[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Context:&lt;/p&gt;\n\n&lt;p&gt;I have been with my girlfriend (let&amp;#39;s call her Beth) for nearly a year and we live together with her sister in our apartment. Beth has a part time job (roughly 20 hrs a week), but is in a very rough financial position right now. She can&amp;#39;t really afford her portion of rent soon, and she is cutting into her savings just to be able to survive. I have job security and a full time job and my financial scenario is stable. I have enough savings for both of us at the moment. &lt;/p&gt;\n\n&lt;p&gt;Beth is trying to secure another part time position (that is hopefully flexible for her since her dream job is to be an actor), and her job search is really starting to take a toll on me and our relationship. Beth met for an interview and the interviewer offered her a position on the spot, told her the start date, salary information etc and they&amp;#39;ve been unresponsive and flakey since then and it has hit her significantly harder than her other rejections.&lt;/p&gt;\n\n&lt;p&gt;If anyone knows what a job search entails, they understand it can be a demoralizing, self deprecating, downward spiral. I&amp;#39;ve gone through periods of depression myself, and she has bi-polar disorder and depressive episodes as well. Well, as you can imagine, the job search is affecting her heavily and it&amp;#39;s starting to rub off on me. It has gotten to the point where anything I say that is encouraging or uplifting just seems like an echo or redundant cliche. There&amp;#39;s only so many ways for me to phrase &amp;quot;keep at it&amp;quot; &amp;quot;don&amp;#39;t give up&amp;quot; &amp;quot;this is a really rough period but we have to push through it and I have your back&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I am almost at my wit&amp;#39;s end...she is not sleeping well (and I&amp;#39;m not sleeping well as a result), and she often seems lifeless or constantly sad and depressed. I understand the situation -- I have been in her position and it totally makes sense to feel down during a job hunt...but it&amp;#39;s draining my happiness by proximity. I can&amp;#39;t just sit around and play PS4 while enjoying myself because it just seems so jarring between her mental state and myself (energy levels...like, I don&amp;#39;t want to be all happy and laughing and stuff while she is sulking in bed). Does anyone have any advice or tips on how I can help her and myself? I really don&amp;#39;t want to sound selfish in this type of situation as I know she is the one struggling, but it is really starting to get to me. &lt;/p&gt;\n\n&lt;p&gt;As an aside, she is thinking about our relationship in the long term, and I don&amp;#39;t know whether I want kids or even want to get married...I kind of just go with the flow and try to play things by ear on how I feel. With the job search stress coming down on me, a lot of these....previously non-relevant things are coming to a head and a small part of my brain wants to run away. I don&amp;#39;t know what to do.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: My girlfriend has been job hunting for months without luck. She is often demoralized and sad. While I try my best to be supportive in every way I can, I am running out of motivational sayings. We are now both unhappy and I don&amp;#39;t know what to do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Context:\n\nI have been with my girlfriend (let's call her Beth) for nearly a year and we live together with her sister in our apartment. Beth has a part time job (roughly 20 hrs a week), but is in a very rough financial position right now. She can't really afford her portion of rent soon, and she is cutting into her savings just to be able to survive. I have job security and a full time job and my financial scenario is stable. I have enough savings for both of us at the moment. \n\nBeth is trying to secure another part time position (that is hopefully flexible for her since her dream job is to be an actor), and her job search is really starting to take a toll on me and our relationship. Beth met for an interview and the interviewer offered her a position on the spot, told her the start date, salary information etc and they've been unresponsive and flakey since then and it has hit her significantly harder than her other rejections.\n\nIf anyone knows what a job search entails, they understand it can be a demoralizing, self deprecating, downward spiral. I've gone through periods of depression myself, and she has bi-polar disorder and depressive episodes as well. Well, as you can imagine, the job search is affecting her heavily and it's starting to rub off on me. It has gotten to the point where anything I say that is encouraging or uplifting just seems like an echo or redundant cliche. There's only so many ways for me to phrase \"keep at it\" \"don't give up\" \"this is a really rough period but we have to push through it and I have your back\". \n\nI am almost at my wit's end...she is not sleeping well (and I'm not sleeping well as a result), and she often seems lifeless or constantly sad and depressed. I understand the situation -- I have been in her position and it totally makes sense to feel down during a job hunt...but it's draining my happiness by proximity. I can't just sit around and play PS4 while enjoying myself because it just seems so jarring between her mental state and myself (energy levels...like, I don't want to be all happy and laughing and stuff while she is sulking in bed). Does anyone have any advice or tips on how I can help her and myself? I really don't want to sound selfish in this type of situation as I know she is the one struggling, but it is really starting to get to me. \n\nAs an aside, she is thinking about our relationship in the long term, and I don't know whether I want kids or even want to get married...I kind of just go with the flow and try to play things by ear on how I feel. With the job search stress coming down on me, a lot of these....previously non-relevant things are coming to a head and a small part of my brain wants to run away. I don't know what to do.\n\n---   \n  **tl;dr**: My girlfriend has been job hunting for months without luck. She is often demoralized and sad. While I try my best to be supportive in every way I can, I am running out of motivational sayings. We are now both unhappy and I don't know what to do.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "65dfr5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 82, "report_reasons": null, "author": "throwaway1013202", "saved": false, "mod_reports": [], "name": "t3_65dfr5", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-vt relationships", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65dfr5/me_28m_with_my_girlfriend_28f_of_8_months_she_has/", "num_reports": null, "locked": false, "stickied": false, "created": 1492215203.0, "url": "https://www.reddit.com/r/relationships/comments/65dfr5/me_28m_with_my_girlfriend_28f_of_8_months_she_has/", "author_flair_text": null, "quarantine": false, "title": "Me [28M] with my girlfriend [28F] of 8 months, she has been unable to secure a job and it's affecting our happiness.", "created_utc": 1492186403.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 49, "visited": false, "subreddit_type": "public", "ups": 82}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9i20s", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "turkey1234", "parent_id": "t1_dg9himd", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "forgot to mention - waiting tables! in the Art University Town all the restaurants were filled with artists and for the most part were understanding when \"my band is going on tour for 3 months in europe\" and \"i cannot work this week due to my show opening at x gallery\" or \"i can only take day shifts cause it's hell week at X collective theater group\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;forgot to mention - waiting tables! in the Art University Town all the restaurants were filled with artists and for the most part were understanding when &amp;quot;my band is going on tour for 3 months in europe&amp;quot; and &amp;quot;i cannot work this week due to my show opening at x gallery&amp;quot; or &amp;quot;i can only take day shifts cause it&amp;#39;s hell week at X collective theater group&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9i20s", "score_hidden": false, "stickied": false, "created": 1492221837.0, "created_utc": 1492193037.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dga805r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "turkey1234", "parent_id": "t1_dga0y13", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "ho ho ho - oh no they are not. actually none of the jobs i listed are lucrative they are just other aspects of an industry that isn't \"headlining artist\". I was giving examples of people I know. They wanted to be an actor but that wasn't going to happen so they started to freelance show reviews and were able pivot into journalism. Never said any of that was lucrative! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ho ho ho - oh no they are not. actually none of the jobs i listed are lucrative they are just other aspects of an industry that isn&amp;#39;t &amp;quot;headlining artist&amp;quot;. I was giving examples of people I know. They wanted to be an actor but that wasn&amp;#39;t going to happen so they started to freelance show reviews and were able pivot into journalism. Never said any of that was lucrative! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga805r", "score_hidden": false, "stickied": false, "created": 1492255758.0, "created_utc": 1492226958.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga0y13", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "mollybrains", "parent_id": "t1_dg9himd", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "lol because lucrative writing jobs are so easy to get", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol because lucrative writing jobs are so easy to get&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga0y13", "score_hidden": false, "stickied": false, "created": 1492245701.0, "created_utc": 1492216901.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9himd", "gilded": 0, "archived": false, "score": 79, "report_reasons": null, "author": "turkey1234", "parent_id": "t1_dg9ep79", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That is the reality of being an artist. I went to an art-based university and all my friends had to have a full time job to put food on the table and support their passion. They realized (for the most part by 24) that you cannot survive as an artist and you must make some compromises with reality - my painter friend got into advertising. My sculpture friend is a professor. Musician friends became promoters/managers. Acting friends became writers/critics. Many just ended up with normal office jobs. They still practice their art but it's more along the lines of \"getting recognized in our niche community\" or \"I've removed the financial realities of art to practice it as I want ... by having a full time real job\". \n\ntry to search the sub for things like \"husband quit job to be a painter\" or \"wife has left career to be french horn player\" - you will find comments from REAL PROFESSIONALS who back all this up. Artists are poor forever unless they are .0001% that can do it full time. 99.9999% of the rest have to fit it elsewhere in their lives practically. Your SO needs a wake up call - does she have long term friends in the field she can see this reality in?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is the reality of being an artist. I went to an art-based university and all my friends had to have a full time job to put food on the table and support their passion. They realized (for the most part by 24) that you cannot survive as an artist and you must make some compromises with reality - my painter friend got into advertising. My sculpture friend is a professor. Musician friends became promoters/managers. Acting friends became writers/critics. Many just ended up with normal office jobs. They still practice their art but it&amp;#39;s more along the lines of &amp;quot;getting recognized in our niche community&amp;quot; or &amp;quot;I&amp;#39;ve removed the financial realities of art to practice it as I want ... by having a full time real job&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;try to search the sub for things like &amp;quot;husband quit job to be a painter&amp;quot; or &amp;quot;wife has left career to be french horn player&amp;quot; - you will find comments from REAL PROFESSIONALS who back all this up. Artists are poor forever unless they are .0001% that can do it full time. 99.9999% of the rest have to fit it elsewhere in their lives practically. Your SO needs a wake up call - does she have long term friends in the field she can see this reality in?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9himd", "score_hidden": false, "stickied": false, "created": 1492221210.0, "created_utc": 1492192410.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 79}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9khee", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "beentheredonethatx2", "parent_id": "t1_dg9ju68", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You don't.\n\nWhat you do however is communicate that you will not be her financial future.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;What you do however is communicate that you will not be her financial future.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9khee", "score_hidden": false, "stickied": false, "created": 1492224738.0, "created_utc": 1492195938.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9mx4j", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "turkey1234", "parent_id": "t1_dg9ju68", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Maybe you can try the whole-istic financial future planning route. \"We are both 28yo, would like 2 children, live in a moderately priced single family home in a nice neighborhood with a decent school district. We'd like to go on a $5k vacation with the kids every two years, sports and art activities for them while growing up - while keeping our current hobbies. At least two late model cars at all times, a regular meat diet, good hairdresser, well made clothes, a large dog while saving enough so we're not eating cat food at 65 and still be able to take those vacations with grand kids. What can we negotiate on to get this plan off the ground? Is this what we want? are their additional things (college for kids, your midlife corvette, her midlife 3 month trip to Europe)? What's the current market value for these things? How do WE start building this foundation?\" Seems like 8 months is a short time to bring this up but you all are living together and her income is already starting to make you wonder. Ya'll also ain't 21 - this is a serious relationship and your future kids, home, financial reality is a serious conversation. Maybe if you start by this angle she'll positively think \"I've always wanted to be a mother/travel europe/not eat dog food at 70 - I got to get a job and a retirement account now!\" If she says \"I want to think about those wonderful dreams but not the practicality of accomplishing them\" or  \"Well, all those things are why I'm looking for a husband\" - then you've got a real problem", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you can try the whole-istic financial future planning route. &amp;quot;We are both 28yo, would like 2 children, live in a moderately priced single family home in a nice neighborhood with a decent school district. We&amp;#39;d like to go on a $5k vacation with the kids every two years, sports and art activities for them while growing up - while keeping our current hobbies. At least two late model cars at all times, a regular meat diet, good hairdresser, well made clothes, a large dog while saving enough so we&amp;#39;re not eating cat food at 65 and still be able to take those vacations with grand kids. What can we negotiate on to get this plan off the ground? Is this what we want? are their additional things (college for kids, your midlife corvette, her midlife 3 month trip to Europe)? What&amp;#39;s the current market value for these things? How do WE start building this foundation?&amp;quot; Seems like 8 months is a short time to bring this up but you all are living together and her income is already starting to make you wonder. Ya&amp;#39;ll also ain&amp;#39;t 21 - this is a serious relationship and your future kids, home, financial reality is a serious conversation. Maybe if you start by this angle she&amp;#39;ll positively think &amp;quot;I&amp;#39;ve always wanted to be a mother/travel europe/not eat dog food at 70 - I got to get a job and a retirement account now!&amp;quot; If she says &amp;quot;I want to think about those wonderful dreams but not the practicality of accomplishing them&amp;quot; or  &amp;quot;Well, all those things are why I&amp;#39;m looking for a husband&amp;quot; - then you&amp;#39;ve got a real problem&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9mx4j", "score_hidden": false, "stickied": false, "created": 1492227678.0, "created_utc": 1492198878.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9ni8j", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "rey_gun", "parent_id": "t1_dg9ju68", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Make her accountable to her obligations. Do not enable her by bailing her out when she falls short. She will have to conform her expectations to reality or fail so hard that you leave her for not being willing to pull her weight.", "edited": 1492205991.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make her accountable to her obligations. Do not enable her by bailing her out when she falls short. She will have to conform her expectations to reality or fail so hard that you leave her for not being willing to pull her weight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9ni8j", "score_hidden": false, "stickied": false, "created": 1492228384.0, "created_utc": 1492199584.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9t3l9", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Nora_Oie", "parent_id": "t1_dg9ju68", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Try to rephrase.  She's not stubborn - she is who she is.\n\nYou can't make other people see things.  She's a person, not a project, not someone you can change (although you may be enabling her to prolong her appointment with reality).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try to rephrase.  She&amp;#39;s not stubborn - she is who she is.&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t make other people see things.  She&amp;#39;s a person, not a project, not someone you can change (although you may be enabling her to prolong her appointment with reality).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9t3l9", "score_hidden": false, "stickied": false, "created": 1492235286.0, "created_utc": 1492206486.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dga55md", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "helpwitheating", "parent_id": "t1_dg9ju68", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Reddit loves to shit on people who try to be artists, even when they're working. I wouldn't tell your GF to give up on acting just yet. \n\nInstead, what is available that's related to acting? Is she putting on her own plays? Has she entered into the contest for Fringe in your city?\n\nWhile working part-time, rather than sulking, your GF can also make her own theater stuff happen. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reddit loves to shit on people who try to be artists, even when they&amp;#39;re working. I wouldn&amp;#39;t tell your GF to give up on acting just yet. &lt;/p&gt;\n\n&lt;p&gt;Instead, what is available that&amp;#39;s related to acting? Is she putting on her own plays? Has she entered into the contest for Fringe in your city?&lt;/p&gt;\n\n&lt;p&gt;While working part-time, rather than sulking, your GF can also make her own theater stuff happen. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga55md", "score_hidden": false, "stickied": false, "created": 1492251546.0, "created_utc": 1492222746.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ju68", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "throwaway1013202", "parent_id": "t1_dg9htrf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I agree. SHe's stubborn. \n\nHow do I try to convince her to do non acting work without giving her an ultimatum? Or is that too idealistic? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree. SHe&amp;#39;s stubborn. &lt;/p&gt;\n\n&lt;p&gt;How do I try to convince her to do non acting work without giving her an ultimatum? Or is that too idealistic? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9ju68", "score_hidden": false, "stickied": false, "created": 1492223964.0, "created_utc": 1492195164.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9htrf", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "HRP", "parent_id": "t1_dg9ep79", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; but it's her passion\n\nSorry, but passion doesn't make a living for everyone.  Very few people can say that their passion takes care of their financial needs.\n\nI love wine, but I don't need to make it my entire life.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;but it&amp;#39;s her passion&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sorry, but passion doesn&amp;#39;t make a living for everyone.  Very few people can say that their passion takes care of their financial needs.&lt;/p&gt;\n\n&lt;p&gt;I love wine, but I don&amp;#39;t need to make it my entire life.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9htrf", "score_hidden": false, "stickied": false, "created": 1492221566.0, "created_utc": 1492192766.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9jrmd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "throwaway1013202", "parent_id": "t1_dg9goi8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I agree with you on most of these points. I am not supporting her financially btw, I am in a position to do so if needed, and I love her enough that I am willing. She does not accept this kind of support and often rejects any offer in regards to money..which is why she is so unhappy about the whole being broke thing. If she were just completely fine with being broke and leaching off me, I would have left already. I need to find a way to convince her to take the non acting job...I just don't know how to broach that topic ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with you on most of these points. I am not supporting her financially btw, I am in a position to do so if needed, and I love her enough that I am willing. She does not accept this kind of support and often rejects any offer in regards to money..which is why she is so unhappy about the whole being broke thing. If she were just completely fine with being broke and leaching off me, I would have left already. I need to find a way to convince her to take the non acting job...I just don&amp;#39;t know how to broach that topic &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9jrmd", "score_hidden": false, "stickied": false, "created": 1492223879.0, "created_utc": 1492195079.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9goi8", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "miaret", "parent_id": "t1_dg9ep79", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She's an actor who's struggling. Neither of you should be shocked by this situation. She has not been successful in her acting for a reason. If she continues, she should continue to expect rejection in pursuit of her \"dream.\" Maybe one day she will become better and what the market wants, who knows. In the meanwhile, she has to learn to be comfortable living like this if acting is her dream/priority because random gigs are the norm, not the exception. Further, you are knowingly subsidizing her bad life choices. You are under no obligation to keep this grown woman housed and fed. Would her dream to act be changed if her only other choice was to go live with her parents or on the street? \n\n If, however, she is more interested in stability and finances, her acting needs to take a backseat to reality, and she needs to find a job pronto. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s an actor who&amp;#39;s struggling. Neither of you should be shocked by this situation. She has not been successful in her acting for a reason. If she continues, she should continue to expect rejection in pursuit of her &amp;quot;dream.&amp;quot; Maybe one day she will become better and what the market wants, who knows. In the meanwhile, she has to learn to be comfortable living like this if acting is her dream/priority because random gigs are the norm, not the exception. Further, you are knowingly subsidizing her bad life choices. You are under no obligation to keep this grown woman housed and fed. Would her dream to act be changed if her only other choice was to go live with her parents or on the street? &lt;/p&gt;\n\n&lt;p&gt;If, however, she is more interested in stability and finances, her acting needs to take a backseat to reality, and she needs to find a job pronto. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9goi8", "score_hidden": false, "stickied": false, "created": 1492220236.0, "created_utc": 1492191436.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dgai7ky", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Epicuriosityy", "parent_id": "t1_dg9ep79", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's time for her to take plan B. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s time for her to take plan B. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgai7ky", "score_hidden": false, "stickied": false, "created": 1492279220.0, "created_utc": 1492250420.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dga3u3u", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "UnicycleHooker", "parent_id": "t1_dg9t14e", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're making a lot of assumptions about OP's girlfriend's bipolar disorder.  We don't know whether it's I or II, how severe her swings or symptoms are, whether she sees a psychiatrist or takes medication to handle her symptoms.  I saw in your comments that you were married to someone who is bipolar and I'm sorry if her illness had a negative impact on your life, but as someone with bipolar it's pretty funny, and a little insulting to read that we're irrational, impractical shits.  And diagnosing the gf as bipolar I because she wants to be an actor, just wtf", "edited": 1492221258.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re making a lot of assumptions about OP&amp;#39;s girlfriend&amp;#39;s bipolar disorder.  We don&amp;#39;t know whether it&amp;#39;s I or II, how severe her swings or symptoms are, whether she sees a psychiatrist or takes medication to handle her symptoms.  I saw in your comments that you were married to someone who is bipolar and I&amp;#39;m sorry if her illness had a negative impact on your life, but as someone with bipolar it&amp;#39;s pretty funny, and a little insulting to read that we&amp;#39;re irrational, impractical shits.  And diagnosing the gf as bipolar I because she wants to be an actor, just wtf&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga3u3u", "score_hidden": false, "stickied": false, "created": 1492249652.0, "created_utc": 1492220852.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9t14e", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Nora_Oie", "parent_id": "t1_dg9ep79", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "You will *always* be the more pragmatic one and you will *always* get shit from the hypomanic (look it up) or manic person.  If you're lucky, they'll have some days of remission (rare), where they understand why you're being pragmatic.  Most bipolar type I people (she's almost certainly Type I if she wants to be an actor) are hypomanic to manic.  Hypomanic may be their Normal state.\n\nIt can be delightful living with such a person (until it isn't) and a lot depends on the severity of the illness.  Just be aware that being practical is not their strong suit.  And they can be very angry when thwarted.\n\nAt least she has an agent (but then again, without much steady work, that could be someone's idea of taking advantage of her enthusiasm).\n\nBut if you hook up Long term with an actor or artist, be prepared for them to take career risks that don't pay off, in a practical sense.  Be prepared to support them financially.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You will &lt;em&gt;always&lt;/em&gt; be the more pragmatic one and you will &lt;em&gt;always&lt;/em&gt; get shit from the hypomanic (look it up) or manic person.  If you&amp;#39;re lucky, they&amp;#39;ll have some days of remission (rare), where they understand why you&amp;#39;re being pragmatic.  Most bipolar type I people (she&amp;#39;s almost certainly Type I if she wants to be an actor) are hypomanic to manic.  Hypomanic may be their Normal state.&lt;/p&gt;\n\n&lt;p&gt;It can be delightful living with such a person (until it isn&amp;#39;t) and a lot depends on the severity of the illness.  Just be aware that being practical is not their strong suit.  And they can be very angry when thwarted.&lt;/p&gt;\n\n&lt;p&gt;At least she has an agent (but then again, without much steady work, that could be someone&amp;#39;s idea of taking advantage of her enthusiasm).&lt;/p&gt;\n\n&lt;p&gt;But if you hook up Long term with an actor or artist, be prepared for them to take career risks that don&amp;#39;t pay off, in a practical sense.  Be prepared to support them financially.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9t14e", "score_hidden": false, "stickied": false, "created": 1492235196.0, "created_utc": 1492206396.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ep79", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "throwaway1013202", "parent_id": "t1_dg9dtkf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She has had several acting gigs, nothing super stable or lucrative, but it's her passion. She has representation from an agency, yes. \n\nI am the realist within our relationship...I have been nudging her to put her dreams on hold and try to get her financials straightened out first. For some reason whenever we have that conversation I end up being the bad guy for being pragmatic. I just want her to have food on the table and stuff first before she worries about her passion..She has a plan B option in terms of employment but she won't take it because she thinks she's giving up on her dream...I don't support this, but I'm also not in control of her life. Obviously her not being employed is taking its toll on ME, but I don't want to get into ultimatum territory -- you have to take that job and shelf your dreams or I will break up with you..I'm just not sure what to do\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She has had several acting gigs, nothing super stable or lucrative, but it&amp;#39;s her passion. She has representation from an agency, yes. &lt;/p&gt;\n\n&lt;p&gt;I am the realist within our relationship...I have been nudging her to put her dreams on hold and try to get her financials straightened out first. For some reason whenever we have that conversation I end up being the bad guy for being pragmatic. I just want her to have food on the table and stuff first before she worries about her passion..She has a plan B option in terms of employment but she won&amp;#39;t take it because she thinks she&amp;#39;s giving up on her dream...I don&amp;#39;t support this, but I&amp;#39;m also not in control of her life. Obviously her not being employed is taking its toll on ME, but I don&amp;#39;t want to get into ultimatum territory -- you have to take that job and shelf your dreams or I will break up with you..I&amp;#39;m just not sure what to do&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9ep79", "score_hidden": false, "stickied": false, "created": 1492217954.0, "created_utc": 1492189154.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dgdg7jx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "beentheredonethatx2", "parent_id": "t1_dga9j7l", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Welcome to reddit!  Where it is impossible to either be an asshole or lazy without an underlying medical condition to blame it on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Welcome to reddit!  Where it is impossible to either be an asshole or lazy without an underlying medical condition to blame it on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdg7jx", "score_hidden": true, "stickied": false, "created": 1492463064.0, "created_utc": 1492434264.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga9j7l", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "erehpS", "parent_id": "t1_dg9smw1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Jesus, not every problem is caused by mental illness", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus, not every problem is caused by mental illness&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga9j7l", "score_hidden": false, "stickied": false, "created": 1492258260.0, "created_utc": 1492229460.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9smw1", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Nora_Oie", "parent_id": "t1_dg9dtkf", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Most bipolar people (when not manic) have frequent bouts of hypomania.  During that time, they are quite entertaining and also prone to believing that they are capable of succeeding at anything.\n\nThis is often a lifelong pattern.  Most of us would give up on being an actor at 28, if still without an agent.  But many bipolar will still be cheerfully optimistic (until they are depressed) about their careers.\n\nTo live with a bipolar, one has to decide whether they are willing to go along with the \"dreams\" or are going to be the limit setter in the relationship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most bipolar people (when not manic) have frequent bouts of hypomania.  During that time, they are quite entertaining and also prone to believing that they are capable of succeeding at anything.&lt;/p&gt;\n\n&lt;p&gt;This is often a lifelong pattern.  Most of us would give up on being an actor at 28, if still without an agent.  But many bipolar will still be cheerfully optimistic (until they are depressed) about their careers.&lt;/p&gt;\n\n&lt;p&gt;To live with a bipolar, one has to decide whether they are willing to go along with the &amp;quot;dreams&amp;quot; or are going to be the limit setter in the relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9smw1", "score_hidden": false, "stickied": false, "created": 1492234691.0, "created_utc": 1492205891.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dtkf", "gilded": 0, "archived": false, "score": 122, "report_reasons": null, "author": "beentheredonethatx2", "parent_id": "t3_65dfr5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;Beth is trying to secure another part time position (that is hopefully flexible for her since her dream job is to be an actor)\n\nHas she had any success in acting?  Does she have an agent? \n\nIf the answers are no, she needs to come to the realization that at 28, it isn't going to happen.  And then she needs to stop artificially limiting her job choices to accommodate this dream.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Beth is trying to secure another part time position (that is hopefully flexible for her since her dream job is to be an actor)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Has she had any success in acting?  Does she have an agent? &lt;/p&gt;\n\n&lt;p&gt;If the answers are no, she needs to come to the realization that at 28, it isn&amp;#39;t going to happen.  And then she needs to stop artificially limiting her job choices to accommodate this dream.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9dtkf", "score_hidden": false, "stickied": false, "created": 1492216967.0, "created_utc": 1492188167.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 122}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9m7md", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "YungPootieTang", "parent_id": "t1_dg9km4l", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; What about the idea of growing with that person and developing a relationship to the point where you feel comfortable with the idea of eventually have kids?\n\nWhat about the alternative scenario where one of you grows to resent the other when you don't end up wanting kids?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What about the idea of growing with that person and developing a relationship to the point where you feel comfortable with the idea of eventually have kids?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What about the alternative scenario where one of you grows to resent the other when you don&amp;#39;t end up wanting kids?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9m7md", "score_hidden": false, "stickied": false, "created": 1492226831.0, "created_utc": 1492198031.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dgad1uh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "iridescent59", "parent_id": "t1_dg9ysk3", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's also shitty and patronizing to break up with someone for their own good. If she is happy dating OP, then he shouldn't dump her to appease you. Jesus Christ ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s also shitty and patronizing to break up with someone for their own good. If she is happy dating OP, then he shouldn&amp;#39;t dump her to appease you. Jesus Christ &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgad1uh", "score_hidden": false, "stickied": false, "created": 1492264919.0, "created_utc": 1492236119.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ysk3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "magichippy", "parent_id": "t1_dg9rlce", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I would agree if it weren't for all the posts from OP's perspective or girlfriend's perspective that come in 2 years or whatever time in, heartbroken and upset because they thought the other would change their mind. \n\nThey post upset that they've wasted their best years or their important years finding a compatible mate, but stuck it out because they just figured why break up so early?\n\nAnd this is why I advise breaking up early rather than later if you KNOW your goals are compatible or unlikely to be compatible. And 8 months in at 28, I find it hard that he doesn't have some clue if this is the partner that would make him more keen on having children or not. His ambivalence isn't a positive sign. It's not a negative, but it's definitely gives ya pause.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would agree if it weren&amp;#39;t for all the posts from OP&amp;#39;s perspective or girlfriend&amp;#39;s perspective that come in 2 years or whatever time in, heartbroken and upset because they thought the other would change their mind. &lt;/p&gt;\n\n&lt;p&gt;They post upset that they&amp;#39;ve wasted their best years or their important years finding a compatible mate, but stuck it out because they just figured why break up so early?&lt;/p&gt;\n\n&lt;p&gt;And this is why I advise breaking up early rather than later if you KNOW your goals are compatible or unlikely to be compatible. And 8 months in at 28, I find it hard that he doesn&amp;#39;t have some clue if this is the partner that would make him more keen on having children or not. His ambivalence isn&amp;#39;t a positive sign. It&amp;#39;s not a negative, but it&amp;#39;s definitely gives ya pause.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9ysk3", "score_hidden": false, "stickied": false, "created": 1492242838.0, "created_utc": 1492214038.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rlce", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "verticalnoise", "parent_id": "t1_dg9kyqh", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;What happens when you decide you don't want kids a year or two from now and you are both 30, have wasted nearly 3 years on a relationship, and now need to break up because your lifestyle goals are incompatible? \n\nThe world will not end, that's for sure.\n\nHaving kids or not is a crucial issue indeed, but if they both know each other's stance and both have agreed to continue as is, it's their business. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What happens when you decide you don&amp;#39;t want kids a year or two from now and you are both 30, have wasted nearly 3 years on a relationship, and now need to break up because your lifestyle goals are incompatible? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The world will not end, that&amp;#39;s for sure.&lt;/p&gt;\n\n&lt;p&gt;Having kids or not is a crucial issue indeed, but if they both know each other&amp;#39;s stance and both have agreed to continue as is, it&amp;#39;s their business. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9rlce", "score_hidden": false, "stickied": false, "created": 1492233358.0, "created_utc": 1492204558.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dga18m7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Morrowinded", "parent_id": "t1_dg9sc1e", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Not sure what your point is in saying this, are you saying people with a treatable mental illness shouldn't have children? That's a very ignorant thing to believe. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not sure what your point is in saying this, are you saying people with a treatable mental illness shouldn&amp;#39;t have children? That&amp;#39;s a very ignorant thing to believe. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga18m7", "score_hidden": false, "stickied": false, "created": 1492246100.0, "created_utc": 1492217300.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9sc1e", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Nora_Oie", "parent_id": "t1_dg9kyqh", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'll get downvoted, but of the mental illnesses, bipolar is the one that is most strictly genetically determined (on top of everything else OP is considering).\n\nWhich is to say, all bipolar people have at least one of the genes for bipolar.  It can be a spontaneous mutation, but in nearly all cases, it's passed down.  Not all people with the gene get the disease, but all people with one of the several genes for bipolar are at very high risk for bipolar.  People with more than one of the genes (which is not too uncommon) are at very high risk.\n\nMost bipolar have 2 or 3 genes for the illness (and those that only have 1 may be sub clinical in their expression).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll get downvoted, but of the mental illnesses, bipolar is the one that is most strictly genetically determined (on top of everything else OP is considering).&lt;/p&gt;\n\n&lt;p&gt;Which is to say, all bipolar people have at least one of the genes for bipolar.  It can be a spontaneous mutation, but in nearly all cases, it&amp;#39;s passed down.  Not all people with the gene get the disease, but all people with one of the several genes for bipolar are at very high risk for bipolar.  People with more than one of the genes (which is not too uncommon) are at very high risk.&lt;/p&gt;\n\n&lt;p&gt;Most bipolar have 2 or 3 genes for the illness (and those that only have 1 may be sub clinical in their expression).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9sc1e", "score_hidden": false, "stickied": false, "created": 1492234299.0, "created_utc": 1492205499.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9sg0k", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Nora_Oie", "parent_id": "t1_dg9lofg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I had children with a bipolar person.  It was not diagnosed with Kid 1.  It was not fully understood as a genetic disease with Kid 2.\n\nNow that I know the genetics of bipolar (look into it) I'm glad we had two.  There are ways to avoid expression of the illness (sometimes) but it certainly made life more difficult.\n\nMy children now have to think about whether they are carriers (they're not fond of the idea of passing it along, having seen what it is like with their father).  However, advances in testing are helping them out.  Still, it's something to consider.  If a person is on the fence about kids, knowing they carry a gene for something like schizophrenia or bipolar can be informative in decision making.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had children with a bipolar person.  It was not diagnosed with Kid 1.  It was not fully understood as a genetic disease with Kid 2.&lt;/p&gt;\n\n&lt;p&gt;Now that I know the genetics of bipolar (look into it) I&amp;#39;m glad we had two.  There are ways to avoid expression of the illness (sometimes) but it certainly made life more difficult.&lt;/p&gt;\n\n&lt;p&gt;My children now have to think about whether they are carriers (they&amp;#39;re not fond of the idea of passing it along, having seen what it is like with their father).  However, advances in testing are helping them out.  Still, it&amp;#39;s something to consider.  If a person is on the fence about kids, knowing they carry a gene for something like schizophrenia or bipolar can be informative in decision making.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9sg0k", "score_hidden": false, "stickied": false, "created": 1492234445.0, "created_utc": 1492205645.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9lofg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "throwaway1013202", "parent_id": "t1_dg9kyqh", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Ok I guess I see where you're coming from..\n\nI understand it's an important (time sensitive) thing and obviously it's a deal breaker in many relationships, but I've communicated my position to her and she is fine with where I am at. She doesn't want to have kids any time soon for various reasons, but she knows where I stand and is OK with that. \n\nIf I'm unsure about kids, and I approach a relationship then...does that automatically mean I have to default to the \"i don't want kids\" category since i'm not 100% solid \"yes\"? I mean she has income issues right now so I'm more focused on what's here in front of me and affecting our relationship...once we get over this particular hardship I feel like I can open my mind to deal with other things", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok I guess I see where you&amp;#39;re coming from..&lt;/p&gt;\n\n&lt;p&gt;I understand it&amp;#39;s an important (time sensitive) thing and obviously it&amp;#39;s a deal breaker in many relationships, but I&amp;#39;ve communicated my position to her and she is fine with where I am at. She doesn&amp;#39;t want to have kids any time soon for various reasons, but she knows where I stand and is OK with that. &lt;/p&gt;\n\n&lt;p&gt;If I&amp;#39;m unsure about kids, and I approach a relationship then...does that automatically mean I have to default to the &amp;quot;i don&amp;#39;t want kids&amp;quot; category since i&amp;#39;m not 100% solid &amp;quot;yes&amp;quot;? I mean she has income issues right now so I&amp;#39;m more focused on what&amp;#39;s here in front of me and affecting our relationship...once we get over this particular hardship I feel like I can open my mind to deal with other things&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9lofg", "score_hidden": false, "stickied": false, "created": 1492226182.0, "created_utc": 1492197382.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9kyqh", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "magichippy", "parent_id": "t1_dg9km4l", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "No, that's not what we're implying.\n\nIt's one thing if you two were BOTH undecided. \n\nBut if she wants kids and you're still unsure (which at 28, you should really have some idea where you landed on that especially if you're actively dating/in a relationship), it becomes a problem. \n\nWanting kids is not something people can compromise on.\n\nEither you want them or you don't. At 28, you sound like you're kind of ambivalent, but why? You really need to decide whether having kids would enrich your life and be an endeavor you want to pursue. \n\nWhy aren't you comfortable with the idea of her having your kids as it is? It's been almost a year. You don't have to start trying, but you should have some clue whether or not you want to be a parent to her children, if she would be a good parent, if you guys are compatible in the long-term. \n\nWhat happens when you decide you don't want kids a year or two from now and you are both 30, have wasted nearly 3 years on a relationship, and now need to break up because your lifestyle goals are incompatible? Both are you will end up hurt and that's something you need to account for and consider.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, that&amp;#39;s not what we&amp;#39;re implying.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s one thing if you two were BOTH undecided. &lt;/p&gt;\n\n&lt;p&gt;But if she wants kids and you&amp;#39;re still unsure (which at 28, you should really have some idea where you landed on that especially if you&amp;#39;re actively dating/in a relationship), it becomes a problem. &lt;/p&gt;\n\n&lt;p&gt;Wanting kids is not something people can compromise on.&lt;/p&gt;\n\n&lt;p&gt;Either you want them or you don&amp;#39;t. At 28, you sound like you&amp;#39;re kind of ambivalent, but why? You really need to decide whether having kids would enrich your life and be an endeavor you want to pursue. &lt;/p&gt;\n\n&lt;p&gt;Why aren&amp;#39;t you comfortable with the idea of her having your kids as it is? It&amp;#39;s been almost a year. You don&amp;#39;t have to start trying, but you should have some clue whether or not you want to be a parent to her children, if she would be a good parent, if you guys are compatible in the long-term. &lt;/p&gt;\n\n&lt;p&gt;What happens when you decide you don&amp;#39;t want kids a year or two from now and you are both 30, have wasted nearly 3 years on a relationship, and now need to break up because your lifestyle goals are incompatible? Both are you will end up hurt and that&amp;#39;s something you need to account for and consider.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9kyqh", "score_hidden": false, "stickied": false, "created": 1492225319.0, "created_utc": 1492196519.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dga5fn9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "saturnspoops", "parent_id": "t1_dg9km4l", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You may have all the time in the world to father a child but she only has 5-10 more years - her eggs will be significantly less viable then. So even if you guys end now she needs to start finding a life partner asap cause it takes a few years just to get to know someone enough to commit to marriage and then some time after that till kids. So stop wasting her time if you don't want kids", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You may have all the time in the world to father a child but she only has 5-10 more years - her eggs will be significantly less viable then. So even if you guys end now she needs to start finding a life partner asap cause it takes a few years just to get to know someone enough to commit to marriage and then some time after that till kids. So stop wasting her time if you don&amp;#39;t want kids&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga5fn9", "score_hidden": false, "stickied": false, "created": 1492251961.0, "created_utc": 1492223161.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9km4l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "throwaway1013202", "parent_id": "t1_dg9k36c", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Ok well I'm being downvoted and I guess I'm not fully understanding the narrative here..\n\nAre people implying it's not ok to be undecided about kids when your partner is sure they want kids? What about the idea of growing with that person and developing a relationship to the point where you feel comfortable with the idea of eventually have kids? \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok well I&amp;#39;m being downvoted and I guess I&amp;#39;m not fully understanding the narrative here..&lt;/p&gt;\n\n&lt;p&gt;Are people implying it&amp;#39;s not ok to be undecided about kids when your partner is sure they want kids? What about the idea of growing with that person and developing a relationship to the point where you feel comfortable with the idea of eventually have kids? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9km4l", "score_hidden": false, "stickied": false, "created": 1492224895.0, "created_utc": 1492196095.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9k36c", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "magichippy", "parent_id": "t1_dg9jn58", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Because it's not doing you any favors at your age not to be on the same wavelength. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because it&amp;#39;s not doing you any favors at your age not to be on the same wavelength. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9k36c", "score_hidden": false, "stickied": false, "created": 1492224263.0, "created_utc": 1492195463.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jn58", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "throwaway1013202", "parent_id": "t1_dg9j5zd", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Well, I am unsure of how I feel about kids. And she knows I'm unsure. I feel like as long as she knows where I stand on the topic, and all parties on the same page, I don't see why we can't continue to date for the time being", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I am unsure of how I feel about kids. And she knows I&amp;#39;m unsure. I feel like as long as she knows where I stand on the topic, and all parties on the same page, I don&amp;#39;t see why we can&amp;#39;t continue to date for the time being&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9jn58", "score_hidden": false, "stickied": false, "created": 1492223732.0, "created_utc": 1492194932.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9j5zd", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "aftertheafter-party", "parent_id": "t1_dg9ejk2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; The marriage and kids thing is a separate issue for me\n\nShe's 28 - it's not \"non-relevant\" to tell her you aren't sure you want a family.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The marriage and kids thing is a separate issue for me&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She&amp;#39;s 28 - it&amp;#39;s not &amp;quot;non-relevant&amp;quot; to tell her you aren&amp;#39;t sure you want a family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9j5zd", "score_hidden": false, "stickied": false, "created": 1492223156.0, "created_utc": 1492194356.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9s6bj", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Nora_Oie", "parent_id": "t1_dg9ejk2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I married a bipolar person.  It never goes away.  It will \"exacerbate\" job searches and everything else.  You are not a psychiatrist (and you should make sure she's seeing one at least every other week at this point).  She will possibly be underemployed for life (but maybe, with really good care, she won't be).  Being an actor (and needing to have feelings readily available) is a difficult path for a bipolar person (lots can make it, but with long periods of unemployment).\n\nPersonally, I was okay with being the sole \"breadwinner\" for many years, and it was ultimately other things (definitely related to the bipolar illness in some way) that ended us.  \n\nShe may have to choose between a life as a non-actor (but on mess) and a life as an actor (but without steady income).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I married a bipolar person.  It never goes away.  It will &amp;quot;exacerbate&amp;quot; job searches and everything else.  You are not a psychiatrist (and you should make sure she&amp;#39;s seeing one at least every other week at this point).  She will possibly be underemployed for life (but maybe, with really good care, she won&amp;#39;t be).  Being an actor (and needing to have feelings readily available) is a difficult path for a bipolar person (lots can make it, but with long periods of unemployment).&lt;/p&gt;\n\n&lt;p&gt;Personally, I was okay with being the sole &amp;quot;breadwinner&amp;quot; for many years, and it was ultimately other things (definitely related to the bipolar illness in some way) that ended us.  &lt;/p&gt;\n\n&lt;p&gt;She may have to choose between a life as a non-actor (but on mess) and a life as an actor (but without steady income).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9s6bj", "score_hidden": false, "stickied": false, "created": 1492234095.0, "created_utc": 1492205295.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ejk2", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "throwaway1013202", "parent_id": "t1_dg9dpot", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I am happy in this relationship. I was happy before the whole job fiasco and I'm still happy. (in an overall, general sense)..it's just this particular issue that is affecting it. She's unhappy because she hasn't be able to find a job, and I empathize with her on this. I simply mentioned her bipolar and depressive tendencies to explain that the job situation is exacerbated by those factors. \n\nThe marriage and kids thing is a separate issue for me, and that's a conversation I'll probably have with her later. Thanks for your input anyway..", "edited": 1492189391.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am happy in this relationship. I was happy before the whole job fiasco and I&amp;#39;m still happy. (in an overall, general sense)..it&amp;#39;s just this particular issue that is affecting it. She&amp;#39;s unhappy because she hasn&amp;#39;t be able to find a job, and I empathize with her on this. I simply mentioned her bipolar and depressive tendencies to explain that the job situation is exacerbated by those factors. &lt;/p&gt;\n\n&lt;p&gt;The marriage and kids thing is a separate issue for me, and that&amp;#39;s a conversation I&amp;#39;ll probably have with her later. Thanks for your input anyway..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9ejk2", "score_hidden": false, "stickied": false, "created": 1492217778.0, "created_utc": 1492188978.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dpot", "gilded": 0, "archived": false, "score": 48, "report_reasons": null, "author": "wittyidiot", "parent_id": "t3_65dfr5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're jumping beteween a ton of only-slightly-related problems in this post:\n\n* She's broke\n* She isn't finding a second job\n* She is bipolar and depressed\n* You are frustrated and unhappy\n\nI'm going to make a hypothesis here: this isn't about the job at all.  You aren't happy in this relationship.  But you don't want to break up, so you've managed to fixate on her job situation and mental state as the \"reasons\" you aren't happy.  So you're trying to fix them, instead of treating the actual problem.\n\nIt's an 8-month relationship, not a 5-year marriage.  If you aren't happy, it's time to move on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re jumping beteween a ton of only-slightly-related problems in this post:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;She&amp;#39;s broke&lt;/li&gt;\n&lt;li&gt;She isn&amp;#39;t finding a second job&lt;/li&gt;\n&lt;li&gt;She is bipolar and depressed&lt;/li&gt;\n&lt;li&gt;You are frustrated and unhappy&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I&amp;#39;m going to make a hypothesis here: this isn&amp;#39;t about the job at all.  You aren&amp;#39;t happy in this relationship.  But you don&amp;#39;t want to break up, so you&amp;#39;ve managed to fixate on her job situation and mental state as the &amp;quot;reasons&amp;quot; you aren&amp;#39;t happy.  So you&amp;#39;re trying to fix them, instead of treating the actual problem.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s an 8-month relationship, not a 5-year marriage.  If you aren&amp;#39;t happy, it&amp;#39;s time to move on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9dpot", "score_hidden": false, "stickied": false, "created": 1492216849.0, "created_utc": 1492188049.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 48}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9vupp", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ShelfLifeInc", "parent_id": "t3_65dfr5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You say she has an acting agent. Does she have a *recruitment* agent? Someone who can put her forward for temp roles or full-time jobs they are charged to fill? Have her sign up with a few recruitment agencies, that way she's got jobs and opportunities coming to find her through other means. \n\n&gt; There's only so many ways for me to phrase \"keep at it\" \"don't give up\" \n\nDoes she even need you to say these things? Maybe she doesn't need a cheerleader, maybe she just needs a hug. You shouldn't feel guilty about wanting to relax and enjoy life just because she's struggling; maybe seeing you relaxed and content will help remind her that the world keeps turning. You should remind her that there's more to life than the job hunt. \"Hey, you've been working really hard on your job hunt and I'm really proud of you. It's good to take a break once in a while, so how about I take you out for icecream/to go see a movie?\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You say she has an acting agent. Does she have a &lt;em&gt;recruitment&lt;/em&gt; agent? Someone who can put her forward for temp roles or full-time jobs they are charged to fill? Have her sign up with a few recruitment agencies, that way she&amp;#39;s got jobs and opportunities coming to find her through other means. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There&amp;#39;s only so many ways for me to phrase &amp;quot;keep at it&amp;quot; &amp;quot;don&amp;#39;t give up&amp;quot; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Does she even need you to say these things? Maybe she doesn&amp;#39;t need a cheerleader, maybe she just needs a hug. You shouldn&amp;#39;t feel guilty about wanting to relax and enjoy life just because she&amp;#39;s struggling; maybe seeing you relaxed and content will help remind her that the world keeps turning. You should remind her that there&amp;#39;s more to life than the job hunt. &amp;quot;Hey, you&amp;#39;ve been working really hard on your job hunt and I&amp;#39;m really proud of you. It&amp;#39;s good to take a break once in a while, so how about I take you out for icecream/to go see a movie?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9vupp", "score_hidden": false, "stickied": false, "created": 1492238935.0, "created_utc": 1492210135.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dga06f2", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "I_Tread_Lightly", "parent_id": "t3_65dfr5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is gonna sound harsh, but I think she should put that dream aside and focus on bringing an income to the table. \n\nI acted in my early twenties and believe me, as fucked up as it sounds, actresses are usually done with their careers by maybe 24 or 26. For every​ Meryl there is a half million actresses whose careers are over. She needs to realize that unless she wants to do small work on the side such as theater or maybe background in TV or something, it's a one in a million shot. \n\nThe hard part is getting her to realize that. If she's stubborn, she won't even listen. Good luck OP, I recommend a local staffing agency or snagajob. Get her out there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is gonna sound harsh, but I think she should put that dream aside and focus on bringing an income to the table. &lt;/p&gt;\n\n&lt;p&gt;I acted in my early twenties and believe me, as fucked up as it sounds, actresses are usually done with their careers by maybe 24 or 26. For every​ Meryl there is a half million actresses whose careers are over. She needs to realize that unless she wants to do small work on the side such as theater or maybe background in TV or something, it&amp;#39;s a one in a million shot. &lt;/p&gt;\n\n&lt;p&gt;The hard part is getting her to realize that. If she&amp;#39;s stubborn, she won&amp;#39;t even listen. Good luck OP, I recommend a local staffing agency or snagajob. Get her out there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga06f2", "score_hidden": false, "stickied": false, "created": 1492244683.0, "created_utc": 1492215883.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9s0cb", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Nora_Oie", "parent_id": "t3_65dfr5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're a great person.  I like how you've paid attention to her circumstances.\n\nI don't really have advice.  Been in the situation many times (but now, it's been a while since it was really an unemployment situation).  No real advice that you haven't already thought of, just that in a long term relationship, this can happen.  One person may have to support two (indefinitely).  Her dream job is probably unrealistic (or at least not materializing in a realistic manner).  Almost everyone I know who is in your GF's situation eventually goes to work for a temp agency and then a job they don't like.  She needs to find a reasonable day job (even if it's fast food, frankly) and then go from there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re a great person.  I like how you&amp;#39;ve paid attention to her circumstances.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really have advice.  Been in the situation many times (but now, it&amp;#39;s been a while since it was really an unemployment situation).  No real advice that you haven&amp;#39;t already thought of, just that in a long term relationship, this can happen.  One person may have to support two (indefinitely).  Her dream job is probably unrealistic (or at least not materializing in a realistic manner).  Almost everyone I know who is in your GF&amp;#39;s situation eventually goes to work for a temp agency and then a job they don&amp;#39;t like.  She needs to find a reasonable day job (even if it&amp;#39;s fast food, frankly) and then go from there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9s0cb", "score_hidden": false, "stickied": false, "created": 1492233886.0, "created_utc": 1492205086.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dgafys0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Gaiaimmortal", "parent_id": "t1_dg9x4nd", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I spent two weeks at the university trying to find out the reason. They couldn't give me one. The admin officer said it might have been my age, and because it's a very small class - pharmacy. It's one of two universities in the country that offers the course. There were only ten seats available for my criteria. I had a therapist. I spent a fortune in money we didn't have. Every session she reminded me what an amazing husband he is, how I should be grateful, what achievements he's accomplished. She then violated told my husband things I told her in confidence.\n\nHonestly, I don't care to try to fix anything. But thanks for the effort :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I spent two weeks at the university trying to find out the reason. They couldn&amp;#39;t give me one. The admin officer said it might have been my age, and because it&amp;#39;s a very small class - pharmacy. It&amp;#39;s one of two universities in the country that offers the course. There were only ten seats available for my criteria. I had a therapist. I spent a fortune in money we didn&amp;#39;t have. Every session she reminded me what an amazing husband he is, how I should be grateful, what achievements he&amp;#39;s accomplished. She then violated told my husband things I told her in confidence.&lt;/p&gt;\n\n&lt;p&gt;Honestly, I don&amp;#39;t care to try to fix anything. But thanks for the effort :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgafys0", "score_hidden": false, "stickied": false, "created": 1492272187.0, "created_utc": 1492243387.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9x4nd", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "fakemoose", "parent_id": "t1_dg9srfd", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; Got rejected by the university I wanted to study at so I could secure a job.\n\nHave you looked at the reasons why? I would start there and see why you couldn't get into that program or why you have to go to that school in particular. Can you start taking community college classes? Was it lack of experience? Poor GPA? Poor application in general? Once you know they *why* you can come up with a strategy to fix it. \n\n\nAlso, if you know it's making you and your husband miserable, have you talked to someone about your anxiety problems since it sounds like you really want to try and mitigate those?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Got rejected by the university I wanted to study at so I could secure a job.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Have you looked at the reasons why? I would start there and see why you couldn&amp;#39;t get into that program or why you have to go to that school in particular. Can you start taking community college classes? Was it lack of experience? Poor GPA? Poor application in general? Once you know they &lt;em&gt;why&lt;/em&gt; you can come up with a strategy to fix it. &lt;/p&gt;\n\n&lt;p&gt;Also, if you know it&amp;#39;s making you and your husband miserable, have you talked to someone about your anxiety problems since it sounds like you really want to try and mitigate those?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9x4nd", "score_hidden": false, "stickied": false, "created": 1492240651.0, "created_utc": 1492211851.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9ufjb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LittleBigHorn22", "parent_id": "t1_dg9srfd", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm sitting in the same boat. Haven't gotten a job in my degree and it crushed me. Can't focus on doing anything with my life since everything revolves around having a job. Best I can say is manage yourself while you wait. Look for happiness wherever you can. But of course it's much harder to do than to say. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sitting in the same boat. Haven&amp;#39;t gotten a job in my degree and it crushed me. Can&amp;#39;t focus on doing anything with my life since everything revolves around having a job. Best I can say is manage yourself while you wait. Look for happiness wherever you can. But of course it&amp;#39;s much harder to do than to say. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9ufjb", "score_hidden": false, "stickied": false, "created": 1492237029.0, "created_utc": 1492208229.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dga9e7y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "theskyisbluenow", "parent_id": "t1_dg9srfd", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I am job hunting right now and it really sucks. Have you tried talking to temp agencies? It's how my husband got good his job when I decided to quit teaching. Most don't require too much education or work experience. \n\nBeing unemployed in general is so depressing. I enjoyed it the first month, the second started to get stressful. Now I am the point where I am tried of looking and waiting for jobs to pop up in my field. The worst part is I am afraid of getting a temp job in case I have to quit immediately for my real job but I don't want to spend months on end being unemployed. I want to move but my husband doesn't and I just don't know what to do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am job hunting right now and it really sucks. Have you tried talking to temp agencies? It&amp;#39;s how my husband got good his job when I decided to quit teaching. Most don&amp;#39;t require too much education or work experience. &lt;/p&gt;\n\n&lt;p&gt;Being unemployed in general is so depressing. I enjoyed it the first month, the second started to get stressful. Now I am the point where I am tried of looking and waiting for jobs to pop up in my field. The worst part is I am afraid of getting a temp job in case I have to quit immediately for my real job but I don&amp;#39;t want to spend months on end being unemployed. I want to move but my husband doesn&amp;#39;t and I just don&amp;#39;t know what to do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga9e7y", "score_hidden": false, "stickied": false, "created": 1492258019.0, "created_utc": 1492229219.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9srfd", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Gaiaimmortal", "parent_id": "t3_65dfr5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You sound like my husband. I'm the one without an income. Can't find a job. Got rejected by the university I wanted to study at so I could secure a job. I'm 29 this year.\n\nI stay home all day. I rarely go out - there isn't extra money for that. I eat once a day so I can cut down on the food budget (he doesn't know). I've cut out most of my friends because I don't want people to know what a failure I've turned into. I'm in a sinking hole and don't even care enough to try to pull myself out. I've got severe depression and anxiety. I cried in a parking lot yesterday because I was so anxious of leaving the house and having to interact with people. And what makes it even worse? The fact that my husband is making himself miserable trying to make me feel better.\n\nI don't have any advice for you. But if I could save my husband from the sinking ship that is me? I'd do it in a heartbeat. Think about yourself before you're dragged down too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound like my husband. I&amp;#39;m the one without an income. Can&amp;#39;t find a job. Got rejected by the university I wanted to study at so I could secure a job. I&amp;#39;m 29 this year.&lt;/p&gt;\n\n&lt;p&gt;I stay home all day. I rarely go out - there isn&amp;#39;t extra money for that. I eat once a day so I can cut down on the food budget (he doesn&amp;#39;t know). I&amp;#39;ve cut out most of my friends because I don&amp;#39;t want people to know what a failure I&amp;#39;ve turned into. I&amp;#39;m in a sinking hole and don&amp;#39;t even care enough to try to pull myself out. I&amp;#39;ve got severe depression and anxiety. I cried in a parking lot yesterday because I was so anxious of leaving the house and having to interact with people. And what makes it even worse? The fact that my husband is making himself miserable trying to make me feel better.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have any advice for you. But if I could save my husband from the sinking ship that is me? I&amp;#39;d do it in a heartbeat. Think about yourself before you&amp;#39;re dragged down too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9srfd", "score_hidden": false, "stickied": false, "created": 1492234854.0, "created_utc": 1492206054.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9zj9p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nickykittie", "parent_id": "t3_65dfr5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She might benefit from seeing a counselor, just to have someone besides you to talk to. I'm sure that she's extremely frustrated and probably censoring herself because she doesn't want to unload all of it on you. Maybe you could help her find one/pay for a few sessions until she finds someone for free or through insurance?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She might benefit from seeing a counselor, just to have someone besides you to talk to. I&amp;#39;m sure that she&amp;#39;s extremely frustrated and probably censoring herself because she doesn&amp;#39;t want to unload all of it on you. Maybe you could help her find one/pay for a few sessions until she finds someone for free or through insurance?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9zj9p", "score_hidden": false, "stickied": false, "created": 1492243836.0, "created_utc": 1492215036.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9y6xv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "peanutbutterjealy", "parent_id": "t3_65dfr5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Dunno how much this helps, but I can tell you from her point of view, your sticking-things-out with her will make or break your relationship. If you want to break up, that's fine, but just know you likely won't get her back when things do work out.\n\nJob hunts are hard, but a good partner puts up with it regardless of the time and effort. Ask yourself what you would want her to do if the situation was flipped. Would you want her to understand you're trying and cope with your moods, or would you be okay with her running out on you?\n\nAs a side note, I've been in her shoes before and can tell you the resentment doesn't go away (though your situation seems better still). During grad school, I had a boyfriend-of-3-yrs-turned-fiance who treated me differently because I couldn't find a job at first. (I was young and looking for my first real job.) At first, the guy was supportive, but as the months ran on, he became less patient, picking fights with me over stupid things, before finally threatening to throw me out every couple of days if I didn't also do his half of the chores. Well, one day I ran away, got emergency housing with a good friend who felt bad for me; he helped me slowly rebuild my life: looked over my resume, made calls, helped me practice interviewing until I eventually found a job. Fast forward a year and a half, I landed a job with the company that my ex had wanted but couldn't get (it pays more than its peers). I saw my ex again at our reunion this year. We talked, he congratulated me and asked if I would like to get dinner. \n\nThe only reason I didn't laugh was out of politeness, though I did tell him I'm engaged. (I'm marrying my good friend, a better man than my ex ever was.) \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dunno how much this helps, but I can tell you from her point of view, your sticking-things-out with her will make or break your relationship. If you want to break up, that&amp;#39;s fine, but just know you likely won&amp;#39;t get her back when things do work out.&lt;/p&gt;\n\n&lt;p&gt;Job hunts are hard, but a good partner puts up with it regardless of the time and effort. Ask yourself what you would want her to do if the situation was flipped. Would you want her to understand you&amp;#39;re trying and cope with your moods, or would you be okay with her running out on you?&lt;/p&gt;\n\n&lt;p&gt;As a side note, I&amp;#39;ve been in her shoes before and can tell you the resentment doesn&amp;#39;t go away (though your situation seems better still). During grad school, I had a boyfriend-of-3-yrs-turned-fiance who treated me differently because I couldn&amp;#39;t find a job at first. (I was young and looking for my first real job.) At first, the guy was supportive, but as the months ran on, he became less patient, picking fights with me over stupid things, before finally threatening to throw me out every couple of days if I didn&amp;#39;t also do his half of the chores. Well, one day I ran away, got emergency housing with a good friend who felt bad for me; he helped me slowly rebuild my life: looked over my resume, made calls, helped me practice interviewing until I eventually found a job. Fast forward a year and a half, I landed a job with the company that my ex had wanted but couldn&amp;#39;t get (it pays more than its peers). I saw my ex again at our reunion this year. We talked, he congratulated me and asked if I would like to get dinner. &lt;/p&gt;\n\n&lt;p&gt;The only reason I didn&amp;#39;t laugh was out of politeness, though I did tell him I&amp;#39;m engaged. (I&amp;#39;m marrying my good friend, a better man than my ex ever was.) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9y6xv", "score_hidden": false, "stickied": false, "created": 1492242038.0, "created_utc": 1492213238.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65dfr5", "likes": null, "replies": "", "user_reports": [], "id": "dg9ys5k", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "BigMedallion209", "parent_id": "t3_65dfr5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "No reason for her to get a job while you are sporting the bill.  You are going to have to take a hard stance on this one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No reason for her to get a job while you are sporting the bill.  You are going to have to take a hard stance on this one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9ys5k", "score_hidden": false, "stickied": false, "created": 1492242823.0, "created_utc": 1492214023.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]