[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My wife and I have been married for a little over a year, dated for 3 years before.  We have a good, loving relationship, albeit not completely devoid of arguments (usually over little things). We&amp;#39;ve always been able to resolve conflicts by talking them through, and we&amp;#39;ve always been able to air everything out and then come to a consensus within a couple of days at the most. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s been with her company for 2 years, and once every 2 months or so comes home upset about something that happened at work with her boss or a co-worker. It&amp;#39;s usually something about her being mistreated in some way, a coworker said something rude to her, her boss didn&amp;#39;t acknowledge her work or freaked out on her on something that wasn&amp;#39;t her fault. All understandable stuff, as I&amp;#39;ve had shitty co-workers as well. I know it&amp;#39;s not her either - she&amp;#39;s held other jobs before this one and she&amp;#39;s loved her co-workers/bosses in those, so it&amp;#39;s definitely the people around her. She also switched industries, and she&amp;#39;s mentioned that she kind of regrets it, though she isn&amp;#39;t sure if it&amp;#39;s because of her current team or if it&amp;#39;s the industry.&lt;/p&gt;\n\n&lt;p&gt;Anyway, each time this happens, we always talk it over and she asks me for advice, and I always suggest that she start looking for a new job or think about something new to do. Talk to a career coach, etc. She always agrees and says that she&amp;#39;s really unhappy at work. However, the issues at work always end up petering out, like her co-worker will stop saying rude things, or her boss seems to have acknowledged the mistake so it&amp;#39;s okay now. So things just kinda even out a bit and she stops being proactive about it. If I remind her, she&amp;#39;ll get a bit visibly annoyed that I&amp;#39;m being a bit pushy. I probably am being pushy, but I&amp;#39;m not sure if I should support her by letting her do things on her own time, or to encourage her to be more proactive in looking for a new job.&lt;/p&gt;\n\n&lt;p&gt;From my perspective, she&amp;#39;s definitely on cruise control at her job. She&amp;#39;s never excited to talk about it - it&amp;#39;s always &amp;quot;it was just another day&amp;quot; for her. She&amp;#39;s not depressed or anything in general - we really enjoy our time together and with friends, but I want for her to have that same energy for her work. Is it wrong of me to want that for her? Shouldn&amp;#39;t I just be happy that we have a good relationship, and how she feels about work isn&amp;#39;t an issue?&lt;/p&gt;\n\n&lt;p&gt;TLDR; my wife seems really unhappy at her job, but hasn&amp;#39;t made any concrete moves to do anything about it. I&amp;#39;m unsure of how to be supportive in the right way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My wife and I have been married for a little over a year, dated for 3 years before.  We have a good, loving relationship, albeit not completely devoid of arguments (usually over little things). We've always been able to resolve conflicts by talking them through, and we've always been able to air everything out and then come to a consensus within a couple of days at the most. \n\nShe's been with her company for 2 years, and once every 2 months or so comes home upset about something that happened at work with her boss or a co-worker. It's usually something about her being mistreated in some way, a coworker said something rude to her, her boss didn't acknowledge her work or freaked out on her on something that wasn't her fault. All understandable stuff, as I've had shitty co-workers as well. I know it's not her either - she's held other jobs before this one and she's loved her co-workers/bosses in those, so it's definitely the people around her. She also switched industries, and she's mentioned that she kind of regrets it, though she isn't sure if it's because of her current team or if it's the industry.\n\nAnyway, each time this happens, we always talk it over and she asks me for advice, and I always suggest that she start looking for a new job or think about something new to do. Talk to a career coach, etc. She always agrees and says that she's really unhappy at work. However, the issues at work always end up petering out, like her co-worker will stop saying rude things, or her boss seems to have acknowledged the mistake so it's okay now. So things just kinda even out a bit and she stops being proactive about it. If I remind her, she'll get a bit visibly annoyed that I'm being a bit pushy. I probably am being pushy, but I'm not sure if I should support her by letting her do things on her own time, or to encourage her to be more proactive in looking for a new job.\n\nFrom my perspective, she's definitely on cruise control at her job. She's never excited to talk about it - it's always \"it was just another day\" for her. She's not depressed or anything in general - we really enjoy our time together and with friends, but I want for her to have that same energy for her work. Is it wrong of me to want that for her? Shouldn't I just be happy that we have a good relationship, and how she feels about work isn't an issue?\n\nTLDR; my wife seems really unhappy at her job, but hasn't made any concrete moves to do anything about it. I'm unsure of how to be supportive in the right way.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "65etwb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 87, "report_reasons": null, "author": "grandmanyon", "saved": false, "mod_reports": [], "name": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-vt relationships", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65etwb/my_35m_wife_33f_has_been_unhappy_with_her_job_for/", "num_reports": null, "locked": false, "stickied": false, "created": 1492228762.0, "url": "https://www.reddit.com/r/relationships/comments/65etwb/my_35m_wife_33f_has_been_unhappy_with_her_job_for/", "author_flair_text": null, "quarantine": false, "title": "My [35M] wife [33F] has been unhappy with her job for 2 years. She says she wants to look for another job, but hasn't done anything about it. It bugs me - should it?", "created_utc": 1492199962.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 87}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dg9vzks", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "BensMyBitch", "parent_id": "t1_dg9o5h2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I thought it sounded like venting too. If it were *really* bad I am sure she would be looking for something else, or to switch back to the industry she liked before. But it can feel good to vent about small crappy things that happen at work that you don't necessarily want to leave over. Especially because almost every job has a few downsides like that, you don't want to get into the \"grass is always greener\" mindset or you could be job hopping for years, which could hurt you worse in the long-run. \n\nBut being supportive is the best thing you can do. The option is always there to leave if it gets bad anough, and she knows it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought it sounded like venting too. If it were &lt;em&gt;really&lt;/em&gt; bad I am sure she would be looking for something else, or to switch back to the industry she liked before. But it can feel good to vent about small crappy things that happen at work that you don&amp;#39;t necessarily want to leave over. Especially because almost every job has a few downsides like that, you don&amp;#39;t want to get into the &amp;quot;grass is always greener&amp;quot; mindset or you could be job hopping for years, which could hurt you worse in the long-run. &lt;/p&gt;\n\n&lt;p&gt;But being supportive is the best thing you can do. The option is always there to leave if it gets bad anough, and she knows it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9vzks", "score_hidden": false, "stickied": false, "created": 1492239116.0, "created_utc": 1492210316.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 38}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9o5h2", "gilded": 0, "archived": false, "score": 129, "report_reasons": null, "author": "drunkonmartinis", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The time to bring it up is not when things are going well, because that's pushy. It's when something happens. Tell her that you're more than happy to *listen* to her, lend a shoulder to cry on, etc, but if/when she specifically *asks for advice* you need to tell her that you've got nothing else to offer her. You've already given her the advice you think is applicable here, and she's declined to take any action whatsoever. And then turn down her requests to discuss her action plan any further because she already knows your thoughts. This gets your point across to her without making her feel like she can't vent to you. Because the venting is the important part.\n\nI also encourage you to analyze whether she's actually asking for advice at all. Because she may just be venting, especially since she hasn't made any moves. I think sometimes partners can feel the desire to help fix their spouse's problems when all they actually require is a shoulder to cry on every couple of months.    ", "edited": 1492201593.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The time to bring it up is not when things are going well, because that&amp;#39;s pushy. It&amp;#39;s when something happens. Tell her that you&amp;#39;re more than happy to &lt;em&gt;listen&lt;/em&gt; to her, lend a shoulder to cry on, etc, but if/when she specifically &lt;em&gt;asks for advice&lt;/em&gt; you need to tell her that you&amp;#39;ve got nothing else to offer her. You&amp;#39;ve already given her the advice you think is applicable here, and she&amp;#39;s declined to take any action whatsoever. And then turn down her requests to discuss her action plan any further because she already knows your thoughts. This gets your point across to her without making her feel like she can&amp;#39;t vent to you. Because the venting is the important part.&lt;/p&gt;\n\n&lt;p&gt;I also encourage you to analyze whether she&amp;#39;s actually asking for advice at all. Because she may just be venting, especially since she hasn&amp;#39;t made any moves. I think sometimes partners can feel the desire to help fix their spouse&amp;#39;s problems when all they actually require is a shoulder to cry on every couple of months.    &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9o5h2", "score_hidden": false, "stickied": false, "created": 1492229158.0, "created_utc": 1492200358.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 129}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dg9xwhe", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "hikingboots_allineed", "parent_id": "t1_dg9ucad", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That's what I thought to! Complaining once every 2 months is nothing so quitting sounds like the nuclear option for a relatively minor thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I thought to! Complaining once every 2 months is nothing so quitting sounds like the nuclear option for a relatively minor thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9xwhe", "score_hidden": false, "stickied": false, "created": 1492241663.0, "created_utc": 1492212863.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 34}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ucad", "gilded": 0, "archived": false, "score": 110, "report_reasons": null, "author": "gubbanubnubdoorahka", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She's only complaining once everyone 2 months? I mean, everyone has bad stuff happen at work. Having to listen to your wife vent once every two months doesn't sound that difficult to deal with. If she really wants to change jobs, she will. I don't think there is anything you need to do besides be sympathetic occasionally. Not everyone loves their job.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s only complaining once everyone 2 months? I mean, everyone has bad stuff happen at work. Having to listen to your wife vent once every two months doesn&amp;#39;t sound that difficult to deal with. If she really wants to change jobs, she will. I don&amp;#39;t think there is anything you need to do besides be sympathetic occasionally. Not everyone loves their job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9ucad", "score_hidden": false, "stickied": false, "created": 1492236910.0, "created_utc": 1492208110.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 110}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dg9p347", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "soyunamariposa", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;She also switched industries, and she's mentioned that she kind of regrets it, though she isn't sure if it's because of her current team or if it's the industry.\n\nThis is possibly the source of her inertia. When she made the change, it was with the assumption that it would be an improvement and that hasn't turned out to be the case. When that happens you get stuck in a \"better the devil you know than the devil you don't\" situation aka being afraid of \"going from the frying pan into the fire.\"  So when the things that show her she made a bad move show up front and center, she chafes and wants to make a move, but when it calms down the thoughts of \"what if I make another mistake\" or \"what if I'm not as good at what I do as I think I am\" or \"if this isn't me than who am I\" roll in and doing nothing is safer than running the risk of making it worse.\n\nGiven that, and that it seems like she knows how to find a new job so technically doesn't need your advice, imho this is less about you finding ways to encourage her to act and more about you finding ways to show her that if she fails, you will still love her, if she fails, you will catch her, if she fails you won't mock her and will support her trying again. And of course, show/tell her pshaw at that thinking and that you think she's the bee's knees and won't fail.  That kind of confidence and surety from a partner is very helpful to overcome inertia to save one's self.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She also switched industries, and she&amp;#39;s mentioned that she kind of regrets it, though she isn&amp;#39;t sure if it&amp;#39;s because of her current team or if it&amp;#39;s the industry.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is possibly the source of her inertia. When she made the change, it was with the assumption that it would be an improvement and that hasn&amp;#39;t turned out to be the case. When that happens you get stuck in a &amp;quot;better the devil you know than the devil you don&amp;#39;t&amp;quot; situation aka being afraid of &amp;quot;going from the frying pan into the fire.&amp;quot;  So when the things that show her she made a bad move show up front and center, she chafes and wants to make a move, but when it calms down the thoughts of &amp;quot;what if I make another mistake&amp;quot; or &amp;quot;what if I&amp;#39;m not as good at what I do as I think I am&amp;quot; or &amp;quot;if this isn&amp;#39;t me than who am I&amp;quot; roll in and doing nothing is safer than running the risk of making it worse.&lt;/p&gt;\n\n&lt;p&gt;Given that, and that it seems like she knows how to find a new job so technically doesn&amp;#39;t need your advice, imho this is less about you finding ways to encourage her to act and more about you finding ways to show her that if she fails, you will still love her, if she fails, you will catch her, if she fails you won&amp;#39;t mock her and will support her trying again. And of course, show/tell her pshaw at that thinking and that you think she&amp;#39;s the bee&amp;#39;s knees and won&amp;#39;t fail.  That kind of confidence and surety from a partner is very helpful to overcome inertia to save one&amp;#39;s self.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9p347", "score_hidden": false, "stickied": false, "created": 1492230283.0, "created_utc": 1492201483.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dga3ztk", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "LostSadConfused11", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Being told to get a new job is probably the last thing she needs. Complaining every 2 months is not a lot, and more likely she just needs to vent and have someone validate her emotions (yes, your boss was totally wrong, and your coworker sucks!) If she's asking for advice, what she's likely looking for is how to deal with the specific situation (e.g. Go to HR, don't tell coworker your ideas, withhold cookies from the next meeting!) rather than a global solution like \"quit your job and move to another industry.\" Sometimes the best thing you can do is just listen, help her relax, and distract her with a fun activity at home so she can move on from her stressful day. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Being told to get a new job is probably the last thing she needs. Complaining every 2 months is not a lot, and more likely she just needs to vent and have someone validate her emotions (yes, your boss was totally wrong, and your coworker sucks!) If she&amp;#39;s asking for advice, what she&amp;#39;s likely looking for is how to deal with the specific situation (e.g. Go to HR, don&amp;#39;t tell coworker your ideas, withhold cookies from the next meeting!) rather than a global solution like &amp;quot;quit your job and move to another industry.&amp;quot; Sometimes the best thing you can do is just listen, help her relax, and distract her with a fun activity at home so she can move on from her stressful day. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga3ztk", "score_hidden": false, "stickied": false, "created": 1492249869.0, "created_utc": 1492221069.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dga0koo", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "manamachine", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It doesn't sound like she's complaining often, so maybe it isn't as big a problem as you may think. I had a job where I was abused on a daily basis by a boss who put an unreasonable amount of work on my shoulders and micro-managed the way I did it. I'm sure I complained most days. \n\nBut the thing is, if the job *is* making her wholly unhappy/apathetic/exhausted, like mine was, she may not have the energy at the end of the day to manage both it and a job search. I had a panic attack, quit basically on the spot, and had a job with more than twice the pay (and respect) in a month's time. \n\nHave you two had a serious discussion about this? How she actually feels? What her ideal job situation would be? Where she sees herself in 5 years? Could you support her while she takes time to breathe before putting herself back out there? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t sound like she&amp;#39;s complaining often, so maybe it isn&amp;#39;t as big a problem as you may think. I had a job where I was abused on a daily basis by a boss who put an unreasonable amount of work on my shoulders and micro-managed the way I did it. I&amp;#39;m sure I complained most days. &lt;/p&gt;\n\n&lt;p&gt;But the thing is, if the job &lt;em&gt;is&lt;/em&gt; making her wholly unhappy/apathetic/exhausted, like mine was, she may not have the energy at the end of the day to manage both it and a job search. I had a panic attack, quit basically on the spot, and had a job with more than twice the pay (and respect) in a month&amp;#39;s time. &lt;/p&gt;\n\n&lt;p&gt;Have you two had a serious discussion about this? How she actually feels? What her ideal job situation would be? Where she sees herself in 5 years? Could you support her while she takes time to breathe before putting herself back out there? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga0koo", "score_hidden": false, "stickied": false, "created": 1492245214.0, "created_utc": 1492216414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dg9pysm", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Questions2pm", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What is the local job market like? Where I live, the job market is incredibly depressed, like 200+ applicants for even the shittiest jobs, and employers without unions are outright abusive, because they know people don't have options. Everyone complains, but short of uprooting your entire life to another city, complaining or not working are basically the available options. It would also make sense for someone in this situation to find the \"just find another job\" line of advice to be absolutely infuriating.\n\nIs it like that for her?\n\nIf not, it would bother me. Since she has options, and could see a job counselor (often free), be looking for jobs. A lot of people suffer from job search anxiety (\"What if I put in all this effort to find another job, and it's even worse!!!!!\"), which can appear irrational, but be totally valid. It's completely up to her to decide what to do.\n\nA possibility - she might be looking for emotional support and validation, and you are offering her solutions. Be careful of that, if someone is looking for emotional support, a solution is not what they need, and this is very counter-intuitive for people.", "edited": 1492202845.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is the local job market like? Where I live, the job market is incredibly depressed, like 200+ applicants for even the shittiest jobs, and employers without unions are outright abusive, because they know people don&amp;#39;t have options. Everyone complains, but short of uprooting your entire life to another city, complaining or not working are basically the available options. It would also make sense for someone in this situation to find the &amp;quot;just find another job&amp;quot; line of advice to be absolutely infuriating.&lt;/p&gt;\n\n&lt;p&gt;Is it like that for her?&lt;/p&gt;\n\n&lt;p&gt;If not, it would bother me. Since she has options, and could see a job counselor (often free), be looking for jobs. A lot of people suffer from job search anxiety (&amp;quot;What if I put in all this effort to find another job, and it&amp;#39;s even worse!!!!!&amp;quot;), which can appear irrational, but be totally valid. It&amp;#39;s completely up to her to decide what to do.&lt;/p&gt;\n\n&lt;p&gt;A possibility - she might be looking for emotional support and validation, and you are offering her solutions. Be careful of that, if someone is looking for emotional support, a solution is not what they need, and this is very counter-intuitive for people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9pysm", "score_hidden": false, "stickied": false, "created": 1492231344.0, "created_utc": 1492202544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dga4xbr", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "saturnspoops", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "For some people a job is just a job. And complaining once every two months is not really a lot at all... Stop making a mountain out or a molehill and let her be. She'll tell you when it's a real problem. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For some people a job is just a job. And complaining once every two months is not really a lot at all... Stop making a mountain out or a molehill and let her be. She&amp;#39;ll tell you when it&amp;#39;s a real problem. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga4xbr", "score_hidden": false, "stickied": false, "created": 1492251209.0, "created_utc": 1492222409.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dg9prnr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ThatsATallGlassOfNo", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I changed jobs back in January. I spent a few months looking for the right thing after spending a year talking about how I hated the company I was at. My boyfriend tells me he is proud of me for doing something because most people complain about being in a shitty situation but stay there. This seems ridiculous to me but I've always had to take care of myself so that's possibly why I don't get it. I think it's easy for someone to stay where they are unhappy because they A. Probably don't think there are better options, everyone hates their job, right? Or B. It's what they know and are scared of change. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I changed jobs back in January. I spent a few months looking for the right thing after spending a year talking about how I hated the company I was at. My boyfriend tells me he is proud of me for doing something because most people complain about being in a shitty situation but stay there. This seems ridiculous to me but I&amp;#39;ve always had to take care of myself so that&amp;#39;s possibly why I don&amp;#39;t get it. I think it&amp;#39;s easy for someone to stay where they are unhappy because they A. Probably don&amp;#39;t think there are better options, everyone hates their job, right? Or B. It&amp;#39;s what they know and are scared of change. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9prnr", "score_hidden": false, "stickied": false, "created": 1492231107.0, "created_utc": 1492202307.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dg9we85", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Mowglio", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Don't push her. She will change when the time comes for her to change. In the meantime be patient with her venting and let her know you care about her and want her to be happy. Don't give her anymore \"advice\" on changing jobs, instead let her know that you support her in whatever she chooses to do. Maybe that's sticking around her current job for a couple more years or maybe that's starting the new job hunt tomorrow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t push her. She will change when the time comes for her to change. In the meantime be patient with her venting and let her know you care about her and want her to be happy. Don&amp;#39;t give her anymore &amp;quot;advice&amp;quot; on changing jobs, instead let her know that you support her in whatever she chooses to do. Maybe that&amp;#39;s sticking around her current job for a couple more years or maybe that&amp;#39;s starting the new job hunt tomorrow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9we85", "score_hidden": false, "stickied": false, "created": 1492239662.0, "created_utc": 1492210862.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dg9o9q8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ennmac", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It would be weird if you didn't care about her happiness at work. It sounds like she's just settled into a routine, and complaining is turning into part of that routine. So break it up a bit - go on a spontaneous weekend getaway or surprise her with concert tickets - to remind her about how routines aren't always great. Look for cool job ads that might interest her and bring them home to talk about. She also might not REALLY want to quit, but not know how to tell you that. Next time she complains about work, try helping her come up with some things she can do to make the existing situation improve. If she wants to stick it out, that would explain her lack of movement. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would be weird if you didn&amp;#39;t care about her happiness at work. It sounds like she&amp;#39;s just settled into a routine, and complaining is turning into part of that routine. So break it up a bit - go on a spontaneous weekend getaway or surprise her with concert tickets - to remind her about how routines aren&amp;#39;t always great. Look for cool job ads that might interest her and bring them home to talk about. She also might not REALLY want to quit, but not know how to tell you that. Next time she complains about work, try helping her come up with some things she can do to make the existing situation improve. If she wants to stick it out, that would explain her lack of movement. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9o9q8", "score_hidden": false, "stickied": false, "created": 1492229302.0, "created_utc": 1492200502.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dg9xubq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Mechbiscuit", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's logic vs feelings. \n\nShe needs your emotional dexterity to get her through the tough times. She needs to be listened to and emotionally cared for.\n\nShe knows getting a new job will fix the problem but this isn't about fixing it - it's about acknowledging her going through a hard time.\n\nSuggesting she gets a new job is dismissive to her feelings because this isn't about logic and solving the problem - it's poking the problem and agreeing that it sucks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s logic vs feelings. &lt;/p&gt;\n\n&lt;p&gt;She needs your emotional dexterity to get her through the tough times. She needs to be listened to and emotionally cared for.&lt;/p&gt;\n\n&lt;p&gt;She knows getting a new job will fix the problem but this isn&amp;#39;t about fixing it - it&amp;#39;s about acknowledging her going through a hard time.&lt;/p&gt;\n\n&lt;p&gt;Suggesting she gets a new job is dismissive to her feelings because this isn&amp;#39;t about logic and solving the problem - it&amp;#39;s poking the problem and agreeing that it sucks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9xubq", "score_hidden": false, "stickied": false, "created": 1492241582.0, "created_utc": 1492212782.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dg9qrhq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "scienceismygod", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So I'll say this because it has happened to me. Being in some jobs are no different than being in an emotionally damaging relationship you can love something so much that you don't want to give it away no matter how bad your coworkers are. That being said it's going to take something to push her out of the current position she's in to go look for something new. The best thing you can do is sit and listen and wait for her to go do this herself. Be as supportive as you can but you can't really keep bringing it up because it's just going to cause problems at home.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;ll say this because it has happened to me. Being in some jobs are no different than being in an emotionally damaging relationship you can love something so much that you don&amp;#39;t want to give it away no matter how bad your coworkers are. That being said it&amp;#39;s going to take something to push her out of the current position she&amp;#39;s in to go look for something new. The best thing you can do is sit and listen and wait for her to go do this herself. Be as supportive as you can but you can&amp;#39;t really keep bringing it up because it&amp;#39;s just going to cause problems at home.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9qrhq", "score_hidden": false, "stickied": false, "created": 1492232315.0, "created_utc": 1492203515.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dgaa6ie", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "k9centipede", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "One thing you guys could talk about is getting her a note book so every time she's really upset about her job, she could write out what bothers her in that. So when she's in a better mood she can flip through it to see if its petty complaints or worth looking for a new job.\n\nMy husband complained the first 3 years we were together about his job, whenever it'd get super intense. But when it was getting intense he wouldn't have time to look for a new job, and when it wasn't intense he didn't mind it.\n\nHe eventually was able to leave it when he got the right motivation and new options. Although it didn't seem like it to me, he was looking into his other options/etc when he could and muddling it over. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing you guys could talk about is getting her a note book so every time she&amp;#39;s really upset about her job, she could write out what bothers her in that. So when she&amp;#39;s in a better mood she can flip through it to see if its petty complaints or worth looking for a new job.&lt;/p&gt;\n\n&lt;p&gt;My husband complained the first 3 years we were together about his job, whenever it&amp;#39;d get super intense. But when it was getting intense he wouldn&amp;#39;t have time to look for a new job, and when it wasn&amp;#39;t intense he didn&amp;#39;t mind it.&lt;/p&gt;\n\n&lt;p&gt;He eventually was able to leave it when he got the right motivation and new options. Although it didn&amp;#39;t seem like it to me, he was looking into his other options/etc when he could and muddling it over. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaa6ie", "score_hidden": false, "stickied": false, "created": 1492259379.0, "created_utc": 1492230579.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dgavx8q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "krulos", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Some people like to complain rather than take action.  Or she's overly sensitive to what happens at work.  Because if it was really that bad, she would have started looking by now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some people like to complain rather than take action.  Or she&amp;#39;s overly sensitive to what happens at work.  Because if it was really that bad, she would have started looking by now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgavx8q", "score_hidden": false, "stickied": false, "created": 1492305043.0, "created_utc": 1492276243.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65etwb", "likes": null, "replies": "", "user_reports": [], "id": "dg9ofq4", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "drunkonmartinis", "parent_id": "t1_dg9obqr", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She finds it pushy and gets visibly annoyed when he brings it up, I really doubt she'll enjoy him looking for jobs for her like a helicopter parent..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She finds it pushy and gets visibly annoyed when he brings it up, I really doubt she&amp;#39;ll enjoy him looking for jobs for her like a helicopter parent..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9ofq4", "score_hidden": false, "stickied": false, "created": 1492229502.0, "created_utc": 1492200702.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9obqr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Guyupnorth", "parent_id": "t3_65etwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Make sure to stay positive. It does seem like your wife needs some motivation. Having a job that fucks your happiness and well-being is terrible and sometimes it can train you to just be miserable and live with it. If I were you, I'd start looking for jobs for her (I know it's something she should be doing on her own.) But if you find anything good or interesting it might motivate her. When you see that ad for a job that is right up your alley, the possibility alone is exciting. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make sure to stay positive. It does seem like your wife needs some motivation. Having a job that fucks your happiness and well-being is terrible and sometimes it can train you to just be miserable and live with it. If I were you, I&amp;#39;d start looking for jobs for her (I know it&amp;#39;s something she should be doing on her own.) But if you find anything good or interesting it might motivate her. When you see that ad for a job that is right up your alley, the possibility alone is exciting. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9obqr", "score_hidden": false, "stickied": false, "created": 1492229369.0, "created_utc": 1492200569.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]