[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;UPDATE at the end&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Reddit, guys, I really need some advice here.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Background:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;My parents got divorced when I was 10, and while they got along at first, my dad got remarried and they couldn&amp;#39;t agree on anything after that. They fought for custody of my brother [17 M] and I, and since I was the oldest I was constantly put in the middle. I went a long time thinking my dad was a terrible person for all the things my mom told me he did, and I hated him for a while. &lt;/p&gt;\n\n&lt;p&gt;My senior year of highschool, I found out my mom was pretending to be me on my Facebook account, talking to a woman who had taken my senior pictures for my dad and telling her I didn&amp;#39;t like them, didn&amp;#39;t have fun taking them and didn&amp;#39;t want to be tagged in them (because she only wanted Facebook to see the pictures she had taken, not my dad&amp;#39;s). This woman was pretty hurt and had no idea it wasn&amp;#39;t actually me saying these things. I immediately texted her and told her that was a fucked up thing to do, and changed my password since she violated my privacy and pretended to be me. She reacted by taking all of my money out of my bank account for a made up debt I now suddenly owed her, and I went home, packed up all my stuff, and moved to my dad&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;This made me spiral into a depression, because I had realized i&amp;#39;d spent most of my life thinking my dad was awful and my mom never did anything wrong and didn&amp;#39;t deserve any of it, but after that I realized she was pretty messed up too, and I didn&amp;#39;t know who to believe anymore. I couldn&amp;#39;t wait to turn 18 and move away so I wouldn&amp;#39;t be a part of their drama anymore, and could love them both from a distance.  &lt;/p&gt;\n\n&lt;p&gt;Fast forward to now, I now live 1,000 miles away from my parents. I decided to forgive all past transgressions on both sides so I could have good relationships with them both, separate from each other, and my mom never understood this despite my trying to explain it. My mom would continue to try and tell me things my dad did to hurt her and my brother, and I&amp;#39;ve told her several times that I have zero interest in anything that goes on between them and not to talk to me about it. As far as i&amp;#39;m concerned, when i&amp;#39;m talking to my mom, my dad doesn&amp;#39;t exist, and vice versa. (It&amp;#39;s important to note that not once has my dad ever told me anything my mom had done, and doesn&amp;#39;t mention her, ever.)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Current Situation:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;My dad is finally able to come and visit me next week for the first time since moving here 2.5 years ago. During the time he&amp;#39;ll be here, my brother will be turning 18. The plan was for my dad, brother, and step mom to all come visit for a couple days. I didn&amp;#39;t mention it to my mom because I figured she already knew and there was no reason for me to mention it to her anyway.&lt;/p&gt;\n\n&lt;p&gt;Yesterday I got a text from my mom that read:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;So, not one soul told me about this trip to (state) for (brother&amp;#39;s) birthday. Not only did I have no idea I wouldn&amp;#39;t get to spend my son&amp;#39;s 18th bday with him at all.....but we made plans to go see Jeff Dunham in (another city) that night so he could spend the day with dad. I&amp;#39;d prefer it if you stayed at dad&amp;#39;s when you come visit in May (for my brother&amp;#39;s graduation). I&amp;#39;m not doing this anymore.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So, my initial reaction is: wtf? \nAfter talking to my brother, it seems he forgot to tell my dad he had made plans with my mom, so my dad, thinking there were no other plans in the way, decided to come and visit me and take my brother so he could see me, too. He bought everyone plane tickets. &lt;/p&gt;\n\n&lt;p&gt;This is what I sent back to my mom:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Idk why you&amp;#39;re mad at me. I didn&amp;#39;t know you had plans with him and I didn&amp;#39;t know that you didn&amp;#39;t know he was coming here. It&amp;#39;s not my responsibility or place to tell you things like that. It&amp;#39;s not my fault (brother) forgot to tell dad about your plans and it&amp;#39;s not my fault that you and dad can&amp;#39;t communicate with eachother efficiently so that this entire situation could have been avoided. Now (brother&amp;#39;s) upset that he&amp;#39;s letting everyone down and i&amp;#39;m upset that somehow i&amp;#39;m STILL being thrown into the middle of shit that doesn&amp;#39;t have anything to do with me even when i&amp;#39;m 1,000 miles away. We will stay with one of our friends in May.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;After my mom flipped out, my brother told my dad he wasn&amp;#39;t going to see me anymore since he felt bad that he made plans with mom first and forgot about them, my dad called me to tell me my brother wasn&amp;#39;t coming and he honestly had no idea why he wasn&amp;#39;t coming. &lt;/p&gt;\n\n&lt;p&gt;My brother listened to my mom on the phone with one of her friends, and from the way she was talking, she truly believes that I knew that she didn&amp;#39;t know about the trip, and that she&amp;#39;s convinced herself that my dad planned this all out just to fuck with her and make her not see my brother for his &amp;quot;very important&amp;quot; birthday. She told my brother directly that I &amp;quot;attacked her&amp;quot; in that text message. After all this, my brother decided to come on the trip. He said &amp;quot;i felt bad for her because I fucked up, but if she&amp;#39;s going to slander you and dad then she doesn&amp;#39;t deserve it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And now we come to the true problem. This is the next and last thing she&amp;#39;s said to me so far, and I have no idea how to respond or go forward from here.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;The FACT that you are still blind to what he is doing &amp;amp; his motives is literally astounding to me. &amp;amp; yea it does have to do with you because you keep allowing him to use you to hurt me.&lt;/p&gt;\n\n&lt;p&gt;WHY would he make plans for an 18 year olds bday &amp;amp; not ask him what he wants to do &amp;amp; where he wants to go?! Who does that?! And never say a word?!!&lt;/p&gt;\n\n&lt;p&gt;No one thinks it&amp;#39;s strange to go to (my state) just weeks before you are coming here? No one? (Brother) would rather go to New York or someplace he hasn&amp;#39;t been. But instead of discussing it with his now adult son, he makes his own plans with his own agenda&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t believe for one second it never crossed your mind it was weird.&lt;/p&gt;\n\n&lt;p&gt;(Brother) should be upset! Upset he is being used as a pawn at 18 years old without his permission!!!&lt;/p&gt;\n\n&lt;p&gt;Just like you allow him to use you. I send (brother) over there for all the holidays, mine or not! I went out of my way to ask (brother) what he wanted to do for his birthday &amp;amp; made sure dad also had time with him! I don&amp;#39;t behave the way ya&amp;#39;ll do!!\nAnd this is it!!\nI went over there to see you in Sept. &amp;amp; I&amp;#39;ve never felt more unwanted &amp;amp; unwelcome anywhere in my entire life&lt;/p&gt;\n\n&lt;p&gt;But i&amp;#39;m SURE dad won&amp;#39;t feel that way when he is there. You&amp;#39;d NEVER treat him like that.&lt;/p&gt;\n\n&lt;p&gt;You honestly think had (brother) been given the options he would have wanted this?! Absolutely not.&lt;/p&gt;\n\n&lt;p&gt;The game is still being played, &amp;amp; i&amp;#39;m the one being hurt &amp;amp; YES.....you ARE still allowing it. So stop lying to yourself. You don&amp;#39;t care&lt;/p&gt;\n\n&lt;p&gt;No reason to worry anymore, we haven&amp;#39;t been close in the last year anyway. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m fine.\nEnjoy&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Reddit.&lt;/p&gt;\n\n&lt;p&gt;I think my mom is crazy.&lt;/p&gt;\n\n&lt;p&gt;Literally all of this is in her head and none of it is happening. My dad made a plan to come see me, made sure it was ok with me and my boyfriend, and asked my brother if he wanted to come. My brother said yes, forgetting all about his plans with my mom, and so my dad bought plane tickets. &lt;/p&gt;\n\n&lt;p&gt;When my mom came in September, she didn&amp;#39;t ask but instead told me she had bought tickets. When she was here, she somehow got it in her head that I was mad at her, and despite me trying to assure her that I wasn&amp;#39;t mad, she acted like a child, refused to believe me, and stayed in our guest room the entire rest of the time she was here, which was like 2 days. I made efforts to try and invite her to go put put or bowling or anything at all, and she would decline and stay in the room. Then went home and cried that I had treated her like shit and didn&amp;#39;t want her there. &lt;/p&gt;\n\n&lt;p&gt;Idk what to do. Idk how to respond. My mom always makes herself the victim, no matter what it is. I was depressed and cutting myself? No, I was faking it just to hurt her. I was quiet at lunch because I was tired and had a lot on my mind? No, I hate her and don&amp;#39;t want her to be here.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m pretty hurt that she thinks I would intentionally conspire with my dad to hurt her, especially since I&amp;#39;ve told her over and over I don&amp;#39;t want anything to do with what goes on between them bc I mentally could not handle it anymore.&lt;/p&gt;\n\n&lt;p&gt;What should I do, reddit? The only response I can think of is &amp;quot;you&amp;#39;re crazy, get some help&amp;quot; But somehow I don&amp;#39;t think that&amp;#39;ll go over too well.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;- Edit&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I woke up to a long text about how she feels.&lt;/p&gt;\n\n&lt;p&gt;--She says my father and I &amp;quot;stole her son&amp;#39;s 18th birthday from her, after she&amp;#39;s spent years fighting to not miss one (They fought over full custody the whole time - she says she was fighting for equal custody, and he wanted full with no visitation. I believed this growing up.) &amp;quot;Then legally have been forced to miss more than any parent should ever have to.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;--Then she talks about how when my brother was born she was under &amp;quot;nightmare conditions&amp;quot; because she had just found out my dad had an affair (unsure if it was emotional or physical) and even though she was mad at him, she still allowed him to be in the room when his son was born, because she &amp;quot;chose not to deny him the birth of his son even though he didn&amp;#39;t deserve to be in there and had every right not to allow him&amp;quot; And says how she never denied him the right to his children. Then that child grew up, reached his big 18 milestone and it was stolen from her not only by him, but &amp;quot;by the daughter who spent years of her life watching her mother go through enormous pain &amp;amp; sacrifice... it&amp;#39;s a betrayal I never saw coming.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;--She goes on to say more about how I should have known that she didn&amp;#39;t know, and won&amp;#39;t believe I didn&amp;#39;t. How she would never do this to my dad, and that my dad isn&amp;#39;t even planning this trip for my brother, he&amp;#39;s planning it to hurt her, and doesn&amp;#39;t care about my brother&amp;#39;s birthday. She says my dad and step mom go on vacations all the time, so why didn&amp;#39;t they bring my brother on those instead of this one, when I was already going to see them next month anyway? &lt;/p&gt;\n\n&lt;p&gt;--She says I could have told him it wasn&amp;#39;t a good time to go. (It was a great time for my dad and my boyfriend and I, plus I was happy to be able to spend a birthday with my brother who I haven&amp;#39;t spent a single &amp;quot;so important&amp;quot; birthday with in years.) and I &amp;quot;could have done what you did to me when I&amp;#39;ve tried to go up there&amp;quot; (I told her no, it wasn&amp;#39;t a good time.) But instead, I chose sides and hurt her. Choices have consequences, and now the consequence is our relationship. Dad&amp;#39;s goal has finally been obtained: taking her kids away. &lt;/p&gt;\n\n&lt;p&gt;I decided to respond, told her I would only say one more time that I wasn&amp;#39;t a part of some plan that doesn&amp;#39;t exist, and that I was sorry that she felt as though we stole something from her, but the reality is that, that isn&amp;#39;t the case. I told her she wasn&amp;#39;t entitled to our birthdays or anything in our lives since we are both now adults, and the day is about him, anyway. I told her about how she acted when she was here, and that her constant victim playing is exhausting and I&amp;#39;m concerned for her. I told her I loved her, that I wanted the best for her, and when she was ready to let go of the past and move on, and can stop making everything about hurting her, then she could call me. She&amp;#39;s the only thing standing in the way of her happiness.&lt;/p&gt;\n\n&lt;p&gt;She sent 2 more long messages (we don&amp;#39;t really talk on the phone much. Neither of us ever call the other). The first one saying how it&amp;#39;s amazing how we&amp;#39;re the only ones who think this, but all her friends &amp;quot;see the truth&amp;quot;. She even had to go sit with her pastor because she was so heart broken and even he told her it wasn&amp;#39;t right. It seems my brother told her that he thought she knew about the trip, didn&amp;#39;t realize the timing of the days, and forgot that I would be here for his graduation. She says this is my dad&amp;#39;s manipulation. She&amp;#39;s not gonna explain anything to me anymore because it&amp;#39;s clear that I view her so negatively, and view my father so highly (To be fair, guys, my dad put myself and all of my things outside for my mom to pick up because they thought I was my mom&amp;#39;s spy, and I bought into what my mom was saying and didn&amp;#39;t like my father. We didn&amp;#39;t talk for a yearish after that.) She says I don&amp;#39;t love her, I know what love looks like because she&amp;#39;s demonstrated unconditional love to me my entire life, and this isn&amp;#39;t it. I&amp;#39;m lying to myself and i&amp;#39;ll regret this forever. &lt;/p&gt;\n\n&lt;p&gt;The next one calls me heartless for talking about my problems and not having empathy for her own. She says how she went through so much with her mom abusing her, fighting with my dad during and after both pregnancies, have that same man spend years trying to take her kids from her, then her daughter grows up to be just like him. She&amp;#39;s been in more counseling hours than I could imagine, dedicated her life to Christ because it&amp;#39;s the only way she wouldn&amp;#39;t have ended her life years ago, and that I know nothing about true depression. I know nothing about her except what I chose to believe. She asks how I could call her a victim, that sounds like my step mom. She has many friends who&amp;#39;ve seen things with their own eyes and wouldn&amp;#39;t call her a victim. I&amp;#39;ve placed misplaced blame on her for my own pain growing up because her only other option was to give us up and that was never an option for her. I abuse her because it somehow makes me feel better about myself. She doesn&amp;#39;t allow pain to turn her into someone who hurts those who hurt her, including how I treated her while she was here. I&amp;#39;m blind to who I am. I never send so much as a card for holidays (I got her a birthday present, and mother&amp;#39;s day card, and a Christmas present last year, as well as a call for thanksgiving. I don&amp;#39;t participate in any other holiday.) but she sends me all kinds of things for all holidays, never let a single one go uncelebrated. But this is how I feel, since she has no right to be in my life &amp;amp; this is how I treat her after she moved me to (snowy state) in the dead of winter (I originally wasn&amp;#39;t planning on taking her up for my move, and could have easily done it without her company, but decided to invite her because I knew she was sad I was leaving), then that&amp;#39;s fine. No more relationship for us. She loves me as her daughter, but doesn&amp;#39;t like who I am and won&amp;#39;t allow that in her life. This is how a nonvictim behaves. She prays for me, and says &amp;quot;I pray that you always know how much you are loved even when everyone around you is telling you all the reasons why you aren&amp;#39;t loveable&amp;quot; Until the healing of God brings us together again, she releases me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to respond, I guess. I&amp;#39;m sad to know she isn&amp;#39;t going to be a part of my life anymore, but at the same time I can&amp;#39;t deal with this shit. I hope one day she figures out that she&amp;#39;s the problem. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: My mom is deluded and thinks i&amp;#39;m conspiring with my dad to hurt her when no one is doing anything to her, and is taking it out on me and telling me i&amp;#39;m a liar and i&amp;#39;m not welcome at her house anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**UPDATE at the end**\n\nReddit, guys, I really need some advice here.\n\n**Background:**\n\nMy parents got divorced when I was 10, and while they got along at first, my dad got remarried and they couldn't agree on anything after that. They fought for custody of my brother [17 M] and I, and since I was the oldest I was constantly put in the middle. I went a long time thinking my dad was a terrible person for all the things my mom told me he did, and I hated him for a while. \n\nMy senior year of highschool, I found out my mom was pretending to be me on my Facebook account, talking to a woman who had taken my senior pictures for my dad and telling her I didn't like them, didn't have fun taking them and didn't want to be tagged in them (because she only wanted Facebook to see the pictures she had taken, not my dad's). This woman was pretty hurt and had no idea it wasn't actually me saying these things. I immediately texted her and told her that was a fucked up thing to do, and changed my password since she violated my privacy and pretended to be me. She reacted by taking all of my money out of my bank account for a made up debt I now suddenly owed her, and I went home, packed up all my stuff, and moved to my dad's.\n\nThis made me spiral into a depression, because I had realized i'd spent most of my life thinking my dad was awful and my mom never did anything wrong and didn't deserve any of it, but after that I realized she was pretty messed up too, and I didn't know who to believe anymore. I couldn't wait to turn 18 and move away so I wouldn't be a part of their drama anymore, and could love them both from a distance.  \n\nFast forward to now, I now live 1,000 miles away from my parents. I decided to forgive all past transgressions on both sides so I could have good relationships with them both, separate from each other, and my mom never understood this despite my trying to explain it. My mom would continue to try and tell me things my dad did to hurt her and my brother, and I've told her several times that I have zero interest in anything that goes on between them and not to talk to me about it. As far as i'm concerned, when i'm talking to my mom, my dad doesn't exist, and vice versa. (It's important to note that not once has my dad ever told me anything my mom had done, and doesn't mention her, ever.)\n\n**Current Situation:**\n\nMy dad is finally able to come and visit me next week for the first time since moving here 2.5 years ago. During the time he'll be here, my brother will be turning 18. The plan was for my dad, brother, and step mom to all come visit for a couple days. I didn't mention it to my mom because I figured she already knew and there was no reason for me to mention it to her anyway.\n\nYesterday I got a text from my mom that read:\n&gt; \"So, not one soul told me about this trip to (state) for (brother's) birthday. Not only did I have no idea I wouldn't get to spend my son's 18th bday with him at all.....but we made plans to go see Jeff Dunham in (another city) that night so he could spend the day with dad. I'd prefer it if you stayed at dad's when you come visit in May (for my brother's graduation). I'm not doing this anymore.\"\n\nSo, my initial reaction is: wtf? \nAfter talking to my brother, it seems he forgot to tell my dad he had made plans with my mom, so my dad, thinking there were no other plans in the way, decided to come and visit me and take my brother so he could see me, too. He bought everyone plane tickets. \n\nThis is what I sent back to my mom:\n&gt; \"Idk why you're mad at me. I didn't know you had plans with him and I didn't know that you didn't know he was coming here. It's not my responsibility or place to tell you things like that. It's not my fault (brother) forgot to tell dad about your plans and it's not my fault that you and dad can't communicate with eachother efficiently so that this entire situation could have been avoided. Now (brother's) upset that he's letting everyone down and i'm upset that somehow i'm STILL being thrown into the middle of shit that doesn't have anything to do with me even when i'm 1,000 miles away. We will stay with one of our friends in May.\"\n\nAfter my mom flipped out, my brother told my dad he wasn't going to see me anymore since he felt bad that he made plans with mom first and forgot about them, my dad called me to tell me my brother wasn't coming and he honestly had no idea why he wasn't coming. \n\nMy brother listened to my mom on the phone with one of her friends, and from the way she was talking, she truly believes that I knew that she didn't know about the trip, and that she's convinced herself that my dad planned this all out just to fuck with her and make her not see my brother for his \"very important\" birthday. She told my brother directly that I \"attacked her\" in that text message. After all this, my brother decided to come on the trip. He said \"i felt bad for her because I fucked up, but if she's going to slander you and dad then she doesn't deserve it.\"\n\nAnd now we come to the true problem. This is the next and last thing she's said to me so far, and I have no idea how to respond or go forward from here.\n\n&gt;\"The FACT that you are still blind to what he is doing &amp; his motives is literally astounding to me. &amp; yea it does have to do with you because you keep allowing him to use you to hurt me.\n\n&gt;WHY would he make plans for an 18 year olds bday &amp; not ask him what he wants to do &amp; where he wants to go?! Who does that?! And never say a word?!!\n\n&gt;No one thinks it's strange to go to (my state) just weeks before you are coming here? No one? (Brother) would rather go to New York or someplace he hasn't been. But instead of discussing it with his now adult son, he makes his own plans with his own agenda\n\n&gt;I won't believe for one second it never crossed your mind it was weird.\n\n&gt;(Brother) should be upset! Upset he is being used as a pawn at 18 years old without his permission!!!\n\n&gt;Just like you allow him to use you. I send (brother) over there for all the holidays, mine or not! I went out of my way to ask (brother) what he wanted to do for his birthday &amp; made sure dad also had time with him! I don't behave the way ya'll do!!\nAnd this is it!!\nI went over there to see you in Sept. &amp; I've never felt more unwanted &amp; unwelcome anywhere in my entire life\n\n&gt;But i'm SURE dad won't feel that way when he is there. You'd NEVER treat him like that.\n\n&gt;You honestly think had (brother) been given the options he would have wanted this?! Absolutely not.\n\n&gt;The game is still being played, &amp; i'm the one being hurt &amp; YES.....you ARE still allowing it. So stop lying to yourself. You don't care\n\n&gt;No reason to worry anymore, we haven't been close in the last year anyway. \n\n&gt;I'm fine.\nEnjoy\"\n\n\nReddit.\n\nI think my mom is crazy.\n\nLiterally all of this is in her head and none of it is happening. My dad made a plan to come see me, made sure it was ok with me and my boyfriend, and asked my brother if he wanted to come. My brother said yes, forgetting all about his plans with my mom, and so my dad bought plane tickets. \n\nWhen my mom came in September, she didn't ask but instead told me she had bought tickets. When she was here, she somehow got it in her head that I was mad at her, and despite me trying to assure her that I wasn't mad, she acted like a child, refused to believe me, and stayed in our guest room the entire rest of the time she was here, which was like 2 days. I made efforts to try and invite her to go put put or bowling or anything at all, and she would decline and stay in the room. Then went home and cried that I had treated her like shit and didn't want her there. \n\nIdk what to do. Idk how to respond. My mom always makes herself the victim, no matter what it is. I was depressed and cutting myself? No, I was faking it just to hurt her. I was quiet at lunch because I was tired and had a lot on my mind? No, I hate her and don't want her to be here.\n\nI'm pretty hurt that she thinks I would intentionally conspire with my dad to hurt her, especially since I've told her over and over I don't want anything to do with what goes on between them bc I mentally could not handle it anymore.\n\nWhat should I do, reddit? The only response I can think of is \"you're crazy, get some help\" But somehow I don't think that'll go over too well.\n\n**- Edit**\n\nI woke up to a long text about how she feels.\n\n--She says my father and I \"stole her son's 18th birthday from her, after she's spent years fighting to not miss one (They fought over full custody the whole time - she says she was fighting for equal custody, and he wanted full with no visitation. I believed this growing up.) \"Then legally have been forced to miss more than any parent should ever have to.\"\n\n--Then she talks about how when my brother was born she was under \"nightmare conditions\" because she had just found out my dad had an affair (unsure if it was emotional or physical) and even though she was mad at him, she still allowed him to be in the room when his son was born, because she \"chose not to deny him the birth of his son even though he didn't deserve to be in there and had every right not to allow him\" And says how she never denied him the right to his children. Then that child grew up, reached his big 18 milestone and it was stolen from her not only by him, but \"by the daughter who spent years of her life watching her mother go through enormous pain &amp; sacrifice... it's a betrayal I never saw coming.\"\n\n--She goes on to say more about how I should have known that she didn't know, and won't believe I didn't. How she would never do this to my dad, and that my dad isn't even planning this trip for my brother, he's planning it to hurt her, and doesn't care about my brother's birthday. She says my dad and step mom go on vacations all the time, so why didn't they bring my brother on those instead of this one, when I was already going to see them next month anyway? \n\n--She says I could have told him it wasn't a good time to go. (It was a great time for my dad and my boyfriend and I, plus I was happy to be able to spend a birthday with my brother who I haven't spent a single \"so important\" birthday with in years.) and I \"could have done what you did to me when I've tried to go up there\" (I told her no, it wasn't a good time.) But instead, I chose sides and hurt her. Choices have consequences, and now the consequence is our relationship. Dad's goal has finally been obtained: taking her kids away. \n\nI decided to respond, told her I would only say one more time that I wasn't a part of some plan that doesn't exist, and that I was sorry that she felt as though we stole something from her, but the reality is that, that isn't the case. I told her she wasn't entitled to our birthdays or anything in our lives since we are both now adults, and the day is about him, anyway. I told her about how she acted when she was here, and that her constant victim playing is exhausting and I'm concerned for her. I told her I loved her, that I wanted the best for her, and when she was ready to let go of the past and move on, and can stop making everything about hurting her, then she could call me. She's the only thing standing in the way of her happiness.\n\nShe sent 2 more long messages (we don't really talk on the phone much. Neither of us ever call the other). The first one saying how it's amazing how we're the only ones who think this, but all her friends \"see the truth\". She even had to go sit with her pastor because she was so heart broken and even he told her it wasn't right. It seems my brother told her that he thought she knew about the trip, didn't realize the timing of the days, and forgot that I would be here for his graduation. She says this is my dad's manipulation. She's not gonna explain anything to me anymore because it's clear that I view her so negatively, and view my father so highly (To be fair, guys, my dad put myself and all of my things outside for my mom to pick up because they thought I was my mom's spy, and I bought into what my mom was saying and didn't like my father. We didn't talk for a yearish after that.) She says I don't love her, I know what love looks like because she's demonstrated unconditional love to me my entire life, and this isn't it. I'm lying to myself and i'll regret this forever. \n\nThe next one calls me heartless for talking about my problems and not having empathy for her own. She says how she went through so much with her mom abusing her, fighting with my dad during and after both pregnancies, have that same man spend years trying to take her kids from her, then her daughter grows up to be just like him. She's been in more counseling hours than I could imagine, dedicated her life to Christ because it's the only way she wouldn't have ended her life years ago, and that I know nothing about true depression. I know nothing about her except what I chose to believe. She asks how I could call her a victim, that sounds like my step mom. She has many friends who've seen things with their own eyes and wouldn't call her a victim. I've placed misplaced blame on her for my own pain growing up because her only other option was to give us up and that was never an option for her. I abuse her because it somehow makes me feel better about myself. She doesn't allow pain to turn her into someone who hurts those who hurt her, including how I treated her while she was here. I'm blind to who I am. I never send so much as a card for holidays (I got her a birthday present, and mother's day card, and a Christmas present last year, as well as a call for thanksgiving. I don't participate in any other holiday.) but she sends me all kinds of things for all holidays, never let a single one go uncelebrated. But this is how I feel, since she has no right to be in my life &amp; this is how I treat her after she moved me to (snowy state) in the dead of winter (I originally wasn't planning on taking her up for my move, and could have easily done it without her company, but decided to invite her because I knew she was sad I was leaving), then that's fine. No more relationship for us. She loves me as her daughter, but doesn't like who I am and won't allow that in her life. This is how a nonvictim behaves. She prays for me, and says \"I pray that you always know how much you are loved even when everyone around you is telling you all the reasons why you aren't loveable\" Until the healing of God brings us together again, she releases me.\n\nI'm not going to respond, I guess. I'm sad to know she isn't going to be a part of my life anymore, but at the same time I can't deal with this shit. I hope one day she figures out that she's the problem. \n\n\n\n\n  \n  ---   \n  **tl;dr**: My mom is deluded and thinks i'm conspiring with my dad to hurt her when no one is doing anything to her, and is taking it out on me and telling me i'm a liar and i'm not welcome at her house anymore.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Non-Romantic", "id": "65fq2w", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 581, "report_reasons": null, "author": "Goldenmountains", "saved": false, "mod_reports": [], "name": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": 1492293053.0, "link_flair_css_class": "m-gn misc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65fq2w/my_mother_43_f_has_deluded_herself_into_thinking/", "num_reports": null, "locked": false, "stickied": false, "created": 1492238256.0, "url": "https://www.reddit.com/r/relationships/comments/65fq2w/my_mother_43_f_has_deluded_herself_into_thinking/", "author_flair_text": null, "quarantine": false, "title": "My mother [43 F] has deluded herself into thinking a situation is happening that isn't, and is mad at me [22 F] for it.", "created_utc": 1492209456.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 96, "visited": false, "subreddit_type": "public", "ups": 581}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga85ur", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "dearabby1", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;Idk, I mean despite her being crazy af, she's done a lot for me and sacrificed a lot so I could have and do what I want.\n\nI see that statement (or some variation) posted a lot here, as if those times are enough to constantly excuse bad behavior and problem making. As a parent, I can tell you whole-heartedly that parents usually sacrifice a lot so that our kids can have and do things. We do it because we want our children to succeed and feel happy. That's normal. What's NOT normal is creating chaos and discord for no reason, and that's what your mother is doing. I agree with the other posters - either put her on limited contact, or consider going no contact. You have to live with the person she is NOW, not with the memory of sacrifices that she made years ago.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Idk, I mean despite her being crazy af, she&amp;#39;s done a lot for me and sacrificed a lot so I could have and do what I want.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I see that statement (or some variation) posted a lot here, as if those times are enough to constantly excuse bad behavior and problem making. As a parent, I can tell you whole-heartedly that parents usually sacrifice a lot so that our kids can have and do things. We do it because we want our children to succeed and feel happy. That&amp;#39;s normal. What&amp;#39;s NOT normal is creating chaos and discord for no reason, and that&amp;#39;s what your mother is doing. I agree with the other posters - either put her on limited contact, or consider going no contact. You have to live with the person she is NOW, not with the memory of sacrifices that she made years ago.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga85ur", "score_hidden": false, "stickied": false, "created": 1492256006.0, "created_utc": 1492227206.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 52}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga37ap", "gilded": 0, "archived": false, "score": 151, "report_reasons": null, "author": "Floomby", "parent_id": "t1_dg9whx8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Therapy is not going to work for her unless she recognizes that her behavior hurts people, that hurting people is bad, that it is her obligation to change herself and act like a proper, loving, giving mother, and to commit herself to doing the hard work it takes to change her very ingrained behavior, which includes **telling the therapist the entire, bald, naked truth**. \n\nIn other words, the probability that she suddenly flips a switch and does *all* of the above is very, very low. You must know in your heart of hearts that when she is in the therapist's office, she is spinning a dramatic tale of woe starring herself, the brave and wounded mother. \n\nAll the sacrifices she made for you were probably either things that every parent is supposed to do, or something given with her perceived right to hold that obligation over your head forever. Does she guilt trip you a lot? Does she go around saying variations on, \"after all I've done for you--\"? \n\nListen, from just what you've written here, your childhood and youth has been a shitshow of unnecessary drama and manipulation. It is *extremely* inappropriate to drag children into adult drama. That is called parentification. It is also extremely inappropriate to alienate you kids from each other and from your father. That is called parental alienation. \n\nIn child custody rulings, both are actually forbidden. Always. \n\nNarcissists love to alienate people from each other, because it makes them more powerful. \n\nSo, you know what else your mother has given you? No sense of boundaries, a ruptured family, and a great likelihood of ending up in an abusive relationship. \n\nI'm not saying your should go no contact, but you should draw a hard line about talking about other family members at all. Every time she does so, you need to hang up or leave immediately. That first text she sent? It would have been best to ignore and delete it. She was deliberately drawing you into her telenovela. It was like bait to hook you in. \n\nThere are some excellent books about narcissists out there. You should also visit the website Out of the Fog, which has a plethora of very clearly put, actionable knowledge and advice. \n\nWith your stepdad, you should probably spare him, because she has been using you kids to get back at him since day boo. \n\nIt's painful, but the sooner you recognize the ways in which your mother manipulates you and guilt trips you, the better. \n\nP.S. Stop responding to her. Maybe even block her for a while. It doesn't matter what she thinks. She is choosing to be delusional. You have no power to influence what she thinks anyway. The more you try to explain yourself, or even engage with her at all, the more she will twist your words around. So, for your own sanity, you have to chalk her thoughts down as a thing you can't worry about. ", "edited": 1492220218.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Therapy is not going to work for her unless she recognizes that her behavior hurts people, that hurting people is bad, that it is her obligation to change herself and act like a proper, loving, giving mother, and to commit herself to doing the hard work it takes to change her very ingrained behavior, which includes &lt;strong&gt;telling the therapist the entire, bald, naked truth&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;In other words, the probability that she suddenly flips a switch and does &lt;em&gt;all&lt;/em&gt; of the above is very, very low. You must know in your heart of hearts that when she is in the therapist&amp;#39;s office, she is spinning a dramatic tale of woe starring herself, the brave and wounded mother. &lt;/p&gt;\n\n&lt;p&gt;All the sacrifices she made for you were probably either things that every parent is supposed to do, or something given with her perceived right to hold that obligation over your head forever. Does she guilt trip you a lot? Does she go around saying variations on, &amp;quot;after all I&amp;#39;ve done for you--&amp;quot;? &lt;/p&gt;\n\n&lt;p&gt;Listen, from just what you&amp;#39;ve written here, your childhood and youth has been a shitshow of unnecessary drama and manipulation. It is &lt;em&gt;extremely&lt;/em&gt; inappropriate to drag children into adult drama. That is called parentification. It is also extremely inappropriate to alienate you kids from each other and from your father. That is called parental alienation. &lt;/p&gt;\n\n&lt;p&gt;In child custody rulings, both are actually forbidden. Always. &lt;/p&gt;\n\n&lt;p&gt;Narcissists love to alienate people from each other, because it makes them more powerful. &lt;/p&gt;\n\n&lt;p&gt;So, you know what else your mother has given you? No sense of boundaries, a ruptured family, and a great likelihood of ending up in an abusive relationship. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying your should go no contact, but you should draw a hard line about talking about other family members at all. Every time she does so, you need to hang up or leave immediately. That first text she sent? It would have been best to ignore and delete it. She was deliberately drawing you into her telenovela. It was like bait to hook you in. &lt;/p&gt;\n\n&lt;p&gt;There are some excellent books about narcissists out there. You should also visit the website Out of the Fog, which has a plethora of very clearly put, actionable knowledge and advice. &lt;/p&gt;\n\n&lt;p&gt;With your stepdad, you should probably spare him, because she has been using you kids to get back at him since day boo. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s painful, but the sooner you recognize the ways in which your mother manipulates you and guilt trips you, the better. &lt;/p&gt;\n\n&lt;p&gt;P.S. Stop responding to her. Maybe even block her for a while. It doesn&amp;#39;t matter what she thinks. She is choosing to be delusional. You have no power to influence what she thinks anyway. The more you try to explain yourself, or even engage with her at all, the more she will twist your words around. So, for your own sanity, you have to chalk her thoughts down as a thing you can&amp;#39;t worry about. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga37ap", "score_hidden": false, "stickied": false, "created": 1492248795.0, "created_utc": 1492219995.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 151}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgap1y6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "batholomeo", "parent_id": "t1_dg9wyof", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP doesn't know what her mother discusses in therapy. It may have nothing at all to do with OP or her brother. Parents do have other things in their life than their children! If the therapist is any good at all, they will know she has cognitive distortions. That's what people go to therapy to help overcome.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP doesn&amp;#39;t know what her mother discusses in therapy. It may have nothing at all to do with OP or her brother. Parents do have other things in their life than their children! If the therapist is any good at all, they will know she has cognitive distortions. That&amp;#39;s what people go to therapy to help overcome.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgap1y6", "score_hidden": false, "stickied": false, "created": 1492295201.0, "created_utc": 1492266401.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9wyof", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "Shinbatsu", "parent_id": "t1_dg9whx8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your dad probably knows she has issues (my dad did, that's mainly why they divorced) but he probably can't do anything to help the situation.\n\nAs far as the therapist thing, she might have been not going through the therapy honestly. Like, if you're not completely open and honest with the therapist, they're definitely not gonna be that effective. You gotta put in the work for therapy to help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your dad probably knows she has issues (my dad did, that&amp;#39;s mainly why they divorced) but he probably can&amp;#39;t do anything to help the situation.&lt;/p&gt;\n\n&lt;p&gt;As far as the therapist thing, she might have been not going through the therapy honestly. Like, if you&amp;#39;re not completely open and honest with the therapist, they&amp;#39;re definitely not gonna be that effective. You gotta put in the work for therapy to help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9wyof", "score_hidden": false, "stickied": false, "created": 1492240426.0, "created_utc": 1492211626.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgaozc0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "batholomeo", "parent_id": "t1_dga2b8v", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That is a real violation of her mother's therapy. It doesn't matter what she is telling her therapist about OP. That had no bearing on OP's life, and there is nothing to be gained by doing that other than actually adding credence to her mother's persecution complex.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is a real violation of her mother&amp;#39;s therapy. It doesn&amp;#39;t matter what she is telling her therapist about OP. That had no bearing on OP&amp;#39;s life, and there is nothing to be gained by doing that other than actually adding credence to her mother&amp;#39;s persecution complex.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaozc0", "score_hidden": false, "stickied": false, "created": 1492295079.0, "created_utc": 1492266279.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga2b8v", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "alter_ego77", "parent_id": "t1_dg9whx8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If she is currently in therapy, and you can find out the name of her therapist, you can also call and give them your side of what's happening, to try and subvert any manipulation on her part. HIPAA is one way. They can't talk to you about her at all, but as you aren't a healthcare provider, you can absolutely call and say \"I'm worried about my mom. She's exhibiting these behaviors...\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she is currently in therapy, and you can find out the name of her therapist, you can also call and give them your side of what&amp;#39;s happening, to try and subvert any manipulation on her part. HIPAA is one way. They can&amp;#39;t talk to you about her at all, but as you aren&amp;#39;t a healthcare provider, you can absolutely call and say &amp;quot;I&amp;#39;m worried about my mom. She&amp;#39;s exhibiting these behaviors...&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga2b8v", "score_hidden": false, "stickied": false, "created": 1492247556.0, "created_utc": 1492218756.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgaoxhw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "batholomeo", "parent_id": "t1_dg9whx8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If her therapist is any good, that therapist will be able to see through the stories she tells herself and challenge her on them, but frankly, what she talks to her therapist about really isn't your business.\n\nRecently my own therapist said something to me (in reference to my husband) that kind of opened my eyes: people who have been traumatized are often fragile like this. Oversensitive, seeing things through a lens where they are always the injured party, overemotional, etc. They are in a prison of their distorted perception. It's not always narcissism. \n\nIn any case, that doesn't mean you need to subject yourself to her toxicity. All you need to decide now is how you want to handle this situation and your further dealings with her. I'd suggest just not responding until this blows over, putting her at arm's length/on an information diet and refusing to talk about your father with her. I'd also not talk to your father about her, because you really don't know the whole truth of their relationship, and just because she is wrong and has twisted perception, it doesn't mean your dad was utterly blameless in the past. The truth is probably somewhere in the middle.\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If her therapist is any good, that therapist will be able to see through the stories she tells herself and challenge her on them, but frankly, what she talks to her therapist about really isn&amp;#39;t your business.&lt;/p&gt;\n\n&lt;p&gt;Recently my own therapist said something to me (in reference to my husband) that kind of opened my eyes: people who have been traumatized are often fragile like this. Oversensitive, seeing things through a lens where they are always the injured party, overemotional, etc. They are in a prison of their distorted perception. It&amp;#39;s not always narcissism. &lt;/p&gt;\n\n&lt;p&gt;In any case, that doesn&amp;#39;t mean you need to subject yourself to her toxicity. All you need to decide now is how you want to handle this situation and your further dealings with her. I&amp;#39;d suggest just not responding until this blows over, putting her at arm&amp;#39;s length/on an information diet and refusing to talk about your father with her. I&amp;#39;d also not talk to your father about her, because you really don&amp;#39;t know the whole truth of their relationship, and just because she is wrong and has twisted perception, it doesn&amp;#39;t mean your dad was utterly blameless in the past. The truth is probably somewhere in the middle.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaoxhw", "score_hidden": false, "stickied": false, "created": 1492294991.0, "created_utc": 1492266191.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgaq43w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Wondering__Wanderer", "parent_id": "t1_dg9whx8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Holy shit. The parallels to my own family are unsettling. First of all, I'm sorry you've had to live through this situation, as being the child stuck in the middle of a divorce with parents like this is (in my mind) unfair. It seems like over the years you have made choices that you thought were appropriate and learned how to distance yourself and set boundaries. This is so important! \n\nMy mother is much like yours and even 16 years after getting divorced, almost anytime I talk to her she must mentioned my (terrible) father and even now anything that goes wrong in her life is somehow my dad's fault. Father hardly ever says anything negative about my mother, although he's done shady shit, too. It's exhausting. And you know what? I told her to try therapy and I restricted certain conversations, which she refuses therapy even though she forced me to go years ago. Overall it seems to help a little, but she is still the same.\n\nMaybe give this a little time to see if your mother initiates another conversation. It truly sounds like your mother has a lot she might be dealing with internally, but if refuses to get help then it's not unjustified for you to want to end the relationship. Or even put a hold on it until she gets help or realizes that she is hurting more people in her life that she doesn't need to be. If you want to be there to help her, then let her know that, but remember to keep boundaries because now that you've grown and seen how your parents are as people it is important to watch out for yourself and those you love. \n\nFamily isn't always blood; my family now are people unrelated to me but they care. So I will love them back. Your love can still be unconditional because she is your mom and she has been there for you before, but that doesn't mean she can treat you like this. Surround yourself with positive love and know you aren't the only one who cuts off contact with parents. \n\nBest of luck OP!\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit. The parallels to my own family are unsettling. First of all, I&amp;#39;m sorry you&amp;#39;ve had to live through this situation, as being the child stuck in the middle of a divorce with parents like this is (in my mind) unfair. It seems like over the years you have made choices that you thought were appropriate and learned how to distance yourself and set boundaries. This is so important! &lt;/p&gt;\n\n&lt;p&gt;My mother is much like yours and even 16 years after getting divorced, almost anytime I talk to her she must mentioned my (terrible) father and even now anything that goes wrong in her life is somehow my dad&amp;#39;s fault. Father hardly ever says anything negative about my mother, although he&amp;#39;s done shady shit, too. It&amp;#39;s exhausting. And you know what? I told her to try therapy and I restricted certain conversations, which she refuses therapy even though she forced me to go years ago. Overall it seems to help a little, but she is still the same.&lt;/p&gt;\n\n&lt;p&gt;Maybe give this a little time to see if your mother initiates another conversation. It truly sounds like your mother has a lot she might be dealing with internally, but if refuses to get help then it&amp;#39;s not unjustified for you to want to end the relationship. Or even put a hold on it until she gets help or realizes that she is hurting more people in her life that she doesn&amp;#39;t need to be. If you want to be there to help her, then let her know that, but remember to keep boundaries because now that you&amp;#39;ve grown and seen how your parents are as people it is important to watch out for yourself and those you love. &lt;/p&gt;\n\n&lt;p&gt;Family isn&amp;#39;t always blood; my family now are people unrelated to me but they care. So I will love them back. Your love can still be unconditional because she is your mom and she has been there for you before, but that doesn&amp;#39;t mean she can treat you like this. Surround yourself with positive love and know you aren&amp;#39;t the only one who cuts off contact with parents. &lt;/p&gt;\n\n&lt;p&gt;Best of luck OP!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaq43w", "score_hidden": false, "stickied": false, "created": 1492296843.0, "created_utc": 1492268043.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgb3kep", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "eightiesladies", "parent_id": "t1_dg9whx8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She probably spun a good story to the therapist too, and got counseled based on bullshit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She probably spun a good story to the therapist too, and got counseled based on bullshit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb3kep", "score_hidden": false, "stickied": false, "created": 1492315378.0, "created_utc": 1492286578.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgber45", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "steggo", "parent_id": "t1_dg9whx8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your mom sounds a lot like my MIL. Similarly, people that only talk to her, believe how terribly she's been wronged.\n\nMy SIL went to an appointment with her therapist to help get a better view on her whole personality, add the therapist was surprised about a lot of aspects of her personality (like the explosive anger). MIL puts on her \"best behavior\" for outsiders.\n\nMaybe you could write a letter to her therapist to help her get a better view?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your mom sounds a lot like my MIL. Similarly, people that only talk to her, believe how terribly she&amp;#39;s been wronged.&lt;/p&gt;\n\n&lt;p&gt;My SIL went to an appointment with her therapist to help get a better view on her whole personality, add the therapist was surprised about a lot of aspects of her personality (like the explosive anger). MIL puts on her &amp;quot;best behavior&amp;quot; for outsiders.&lt;/p&gt;\n\n&lt;p&gt;Maybe you could write a letter to her therapist to help her get a better view?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgber45", "score_hidden": false, "stickied": false, "created": 1492331105.0, "created_utc": 1492302305.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9whx8", "gilded": 0, "archived": false, "score": 69, "report_reasons": null, "author": "Goldenmountains", "parent_id": "t1_dg9w8wl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The thing is though, she's been to therapy. She was in it after the divorce and I think more recently too. So idk maybe she has her therapist believing her shit too and he doesn't think she's the root of the problem? I've considered telling my step dad about this but idk if that would help or hurt.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is though, she&amp;#39;s been to therapy. She was in it after the divorce and I think more recently too. So idk maybe she has her therapist believing her shit too and he doesn&amp;#39;t think she&amp;#39;s the root of the problem? I&amp;#39;ve considered telling my step dad about this but idk if that would help or hurt.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9whx8", "score_hidden": false, "stickied": false, "created": 1492239802.0, "created_utc": 1492211002.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 69}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9w8wl", "gilded": 0, "archived": false, "score": 186, "report_reasons": null, "author": "Shinbatsu", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You can suggest therapy but it's unlikely for someone with narcissistic personality traits. Their mindset is that problems are always other people's problems, and that nothing is wrong with themselves so why would they go to therapy? \n\nIt's hard. My mom was never a good mom, so I set a hard boundary. If you still want her in your life you'll need to set boundaries and be firm with them, but also have to accept the drama that comes along with her pushing back against those boundaries.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can suggest therapy but it&amp;#39;s unlikely for someone with narcissistic personality traits. Their mindset is that problems are always other people&amp;#39;s problems, and that nothing is wrong with themselves so why would they go to therapy? &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s hard. My mom was never a good mom, so I set a hard boundary. If you still want her in your life you&amp;#39;ll need to set boundaries and be firm with them, but also have to accept the drama that comes along with her pushing back against those boundaries.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9w8wl", "score_hidden": false, "stickied": false, "created": 1492239467.0, "created_utc": 1492210667.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 186}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga08yd", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "ready__set__go", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "unfortunately, you can't make her happy, and you can't make her not crazy.\n\nYou've got to grieve the mom you want her to be. That will never happen. All she can be is who she is. She won't and can't change, as she has no ability for introspection and accountability. \n\nIf you want to be done with her drama, just stop feeding into it. Don't interact with her. No need to tell her 'you are dead to me' or anything (that'll just fuel her sense of martyrdom and feed the drama). Just concentrate on having a happy life without her, and surround yourself only with people who can be healthy and sane.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;unfortunately, you can&amp;#39;t make her happy, and you can&amp;#39;t make her not crazy.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve got to grieve the mom you want her to be. That will never happen. All she can be is who she is. She won&amp;#39;t and can&amp;#39;t change, as she has no ability for introspection and accountability. &lt;/p&gt;\n\n&lt;p&gt;If you want to be done with her drama, just stop feeding into it. Don&amp;#39;t interact with her. No need to tell her &amp;#39;you are dead to me&amp;#39; or anything (that&amp;#39;ll just fuel her sense of martyrdom and feed the drama). Just concentrate on having a happy life without her, and surround yourself only with people who can be healthy and sane.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga08yd", "score_hidden": false, "stickied": false, "created": 1492244777.0, "created_utc": 1492215977.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgaxknn", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "KrytenKoro", "parent_id": "t1_dgaitye", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I am so incredibly grateful for the chance to have helped you! You deserve to be happy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so incredibly grateful for the chance to have helped you! You deserve to be happy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaxknn", "score_hidden": false, "stickied": false, "created": 1492307276.0, "created_utc": 1492278476.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaitye", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "ThisIsntUrMom", "parent_id": "t1_dgacrbe", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Wow, this just gave me an epiphany. Thank you so much, you have no idea how much guilt this just lifted from me, because my relationship with my mom is so similar to OPs. \n\nOP, I feel your pain, and I know the struggle it takes to eventually get to a place where you realize you don't owe your mom anything, but you'll get there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, this just gave me an epiphany. Thank you so much, you have no idea how much guilt this just lifted from me, because my relationship with my mom is so similar to OPs. &lt;/p&gt;\n\n&lt;p&gt;OP, I feel your pain, and I know the struggle it takes to eventually get to a place where you realize you don&amp;#39;t owe your mom anything, but you&amp;#39;ll get there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaitye", "score_hidden": false, "stickied": false, "created": 1492281196.0, "created_utc": 1492252396.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgbbsbz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lolwally", "parent_id": "t1_dgacrbe", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Totally agreed. As if providing for the kids you decided to bring into the world is some kind of noble, altruistic act. Yet time and again people come here and share stories of awful emotional abuse, but couldn't possibly entertain the idea of cutting their abusers out because \"they have done so much for me\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Totally agreed. As if providing for the kids you decided to bring into the world is some kind of noble, altruistic act. Yet time and again people come here and share stories of awful emotional abuse, but couldn&amp;#39;t possibly entertain the idea of cutting their abusers out because &amp;quot;they have done so much for me&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbbsbz", "score_hidden": false, "stickied": false, "created": 1492326921.0, "created_utc": 1492298121.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgacrbe", "gilded": 0, "archived": false, "score": 84, "report_reasons": null, "author": "KrytenKoro", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; sacrificed a lot so I could have and do what I want.\n\nAbused children always say this.\n\nWhat did she *actually do* beyond the bare legal minimum to make sure you were fed, housed, and educated?\n\nWhat does she do to care about *your* happiness? Not what she thinks \"should\" make you happy, when you say \"mom, it would make me happy if you did this\", how far does she go out of her way to do those things? *That's* sacrificing for you. But burdening herself for what *she* wants your life to be like (and making damn sure you know how much of a burden on her you are, as she's clearly done) is emotional fucking abuse.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;sacrificed a lot so I could have and do what I want.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Abused children always say this.&lt;/p&gt;\n\n&lt;p&gt;What did she &lt;em&gt;actually do&lt;/em&gt; beyond the bare legal minimum to make sure you were fed, housed, and educated?&lt;/p&gt;\n\n&lt;p&gt;What does she do to care about &lt;em&gt;your&lt;/em&gt; happiness? Not what she thinks &amp;quot;should&amp;quot; make you happy, when you say &amp;quot;mom, it would make me happy if you did this&amp;quot;, how far does she go out of her way to do those things? &lt;em&gt;That&amp;#39;s&lt;/em&gt; sacrificing for you. But burdening herself for what &lt;em&gt;she&lt;/em&gt; wants your life to be like (and making damn sure you know how much of a burden on her you are, as she&amp;#39;s clearly done) is emotional fucking abuse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgacrbe", "score_hidden": false, "stickied": false, "created": 1492264281.0, "created_utc": 1492235481.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 84}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga2iie", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "sweetrhymepurereason", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Parents are supposed to sacrifice for their young children. That's the bare minimum of parenthood. What does she do for you now? Not financially, emotionally.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Parents are supposed to sacrifice for their young children. That&amp;#39;s the bare minimum of parenthood. What does she do for you now? Not financially, emotionally.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga2iie", "score_hidden": false, "stickied": false, "created": 1492247835.0, "created_utc": 1492219035.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgahnzh", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "myfemmebot", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; she's done a lot for me and sacrificed a lot so I could have and do what I want\n\nAre you sure she really has? Or is it possible that she has made you feel guilty for totally normal demands placed on parents? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;she&amp;#39;s done a lot for me and sacrificed a lot so I could have and do what I want&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Are you sure she really has? Or is it possible that she has made you feel guilty for totally normal demands placed on parents? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgahnzh", "score_hidden": false, "stickied": false, "created": 1492277443.0, "created_utc": 1492248643.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgabpy1", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "chicketychick", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Look at r/raisedbyborderlines  - people with BPD are always the victim and the world is always out to get them 😕. My mother made every moment with her an absolute joy for exactly that reason /s ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look at &lt;a href=\"/r/raisedbyborderlines\"&gt;r/raisedbyborderlines&lt;/a&gt;  - people with BPD are always the victim and the world is always out to get them 😕. My mother made every moment with her an absolute joy for exactly that reason /s &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgabpy1", "score_hidden": false, "stickied": false, "created": 1492262144.0, "created_utc": 1492233344.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgacfap", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "TMNT4ME", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The thinks Narcs do \"for us\" ALWAYS have strings attached. They do some nice things here and there so we don't immediately cut them out of our lives, sometimes they even use it against us. Your Mom is an awful person, she lies about you, stile your identity, stole your money, lied about your father to you for years, and even now she is making a great family get together ALL ABOUT HER. I really think you should just move on in life from her. She is toxic. By the way, her reaction to you from just showing up to your house uninvited was because she WANTED you to be mad at her for doing that. She wanted you to be mad so she could play victim. Showing up to your house uninvited is extremely rude and boundary breaking. And she knows this! When you didn't react with anger and just rilled with it you ruined her plans of being a victim so she had to fabricate the situation to MAKE YOU LOOK LIKE THE BAD GUY. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thinks Narcs do &amp;quot;for us&amp;quot; ALWAYS have strings attached. They do some nice things here and there so we don&amp;#39;t immediately cut them out of our lives, sometimes they even use it against us. Your Mom is an awful person, she lies about you, stile your identity, stole your money, lied about your father to you for years, and even now she is making a great family get together ALL ABOUT HER. I really think you should just move on in life from her. She is toxic. By the way, her reaction to you from just showing up to your house uninvited was because she WANTED you to be mad at her for doing that. She wanted you to be mad so she could play victim. Showing up to your house uninvited is extremely rude and boundary breaking. And she knows this! When you didn&amp;#39;t react with anger and just rilled with it you ruined her plans of being a victim so she had to fabricate the situation to MAKE YOU LOOK LIKE THE BAD GUY. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgacfap", "score_hidden": false, "stickied": false, "created": 1492263562.0, "created_utc": 1492234762.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga7t5s", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "princessamaterasu", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If you need a place to vent and find support, you might want to check out /r/JUSTNOMIL as well. They do both MILs and Moms over there. They would be able to help you find ways of either dealing with or avoiding craziness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you need a place to vent and find support, you might want to check out &lt;a href=\"/r/JUSTNOMIL\"&gt;/r/JUSTNOMIL&lt;/a&gt; as well. They do both MILs and Moms over there. They would be able to help you find ways of either dealing with or avoiding craziness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga7t5s", "score_hidden": false, "stickied": false, "created": 1492255453.0, "created_utc": 1492226653.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgaeik1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Shari_A_Law", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're more than welcome to light yourself on fire to keep her warm... just know that whatever you do,  it will never be quite enough. Your dad treats you like an adult,  respects your boundaries,  and with more self control than most people have,  manages to do it all while not shit - talking your loony ass mother. \n\nDistance yourself from her,  or beware that she will always spread misery like the Typhoid Mary of narcissistic mothers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re more than welcome to light yourself on fire to keep her warm... just know that whatever you do,  it will never be quite enough. Your dad treats you like an adult,  respects your boundaries,  and with more self control than most people have,  manages to do it all while not shit - talking your loony ass mother. &lt;/p&gt;\n\n&lt;p&gt;Distance yourself from her,  or beware that she will always spread misery like the Typhoid Mary of narcissistic mothers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaeik1", "score_hidden": false, "stickied": false, "created": 1492268317.0, "created_utc": 1492239517.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgaovi1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RememberKoomValley", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; she's done a lot for me and sacrificed a lot \n\nThat's not special, though.  That's the base requirement of having kids.  If she makes you feel like you should be thankful or loyal to her because she did the shit she was supposed to do, she's not a great mom.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;she&amp;#39;s done a lot for me and sacrificed a lot &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not special, though.  That&amp;#39;s the base requirement of having kids.  If she makes you feel like you should be thankful or loyal to her because she did the shit she was supposed to do, she&amp;#39;s not a great mom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaovi1", "score_hidden": false, "stickied": false, "created": 1492294903.0, "created_utc": 1492266103.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgarm8j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deceasedhusband", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I mean despite her being crazy af, she's done a lot for me and sacrificed a lot so I could have and do what I want.\n\n\nLike what exactly? I see this sentiment used quite frequently here by children to excuse atrocious behavior from their parents when the \"sacrifices\" the parent made are actually just normal parenting. Choosing to become a parent means choosing to make many sacrifices with your life. If a person is not willing to make those sacrifices (financial, social, romantic, career, whatever) gladly then they have no business becoming a parent. Children do not ask to be born, they do not owe their parents for the food, water and time they require because that is a choice the parents made for themselves willingly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I mean despite her being crazy af, she&amp;#39;s done a lot for me and sacrificed a lot so I could have and do what I want.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Like what exactly? I see this sentiment used quite frequently here by children to excuse atrocious behavior from their parents when the &amp;quot;sacrifices&amp;quot; the parent made are actually just normal parenting. Choosing to become a parent means choosing to make many sacrifices with your life. If a person is not willing to make those sacrifices (financial, social, romantic, career, whatever) gladly then they have no business becoming a parent. Children do not ask to be born, they do not owe their parents for the food, water and time they require because that is a choice the parents made for themselves willingly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgarm8j", "score_hidden": false, "stickied": false, "created": 1492299024.0, "created_utc": 1492270224.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgb9v6v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "eightiesladies", "parent_id": "t1_dgb67n5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Wow. That's how my uncle got hit by a taxi cab when he was 3. Pushed the couch cushions up to the door and stacked them until he could reach the handle. He bolted out the door, and my Gram heard the screeching brakes and the impact before she even noticed he got out. They're quick. Luckily, my uncle survived, but not without getting a nice souvenir scar across his face. Good call cutting contact with your mom.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. That&amp;#39;s how my uncle got hit by a taxi cab when he was 3. Pushed the couch cushions up to the door and stacked them until he could reach the handle. He bolted out the door, and my Gram heard the screeching brakes and the impact before she even noticed he got out. They&amp;#39;re quick. Luckily, my uncle survived, but not without getting a nice souvenir scar across his face. Good call cutting contact with your mom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb9v6v", "score_hidden": false, "stickied": false, "created": 1492324098.0, "created_utc": 1492295298.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb67n5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "justarandomcommenter", "parent_id": "t1_dgb3uhy", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[This is the comment I made a few weeks ago when I mentioned it in another comment and that person asked](https://www.reddit.com/r/justnomil/comments/61imxv/_/dfezmrv).  Somewhere in my post history is the \"original\" story back in November, but very long story short, she cared about me being polite to her (polite about telling at get for leaving the door unlocked and then bring more rude by shoving my way past her to save my baby's life) - more than she cared about the life of my baby.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/justnomil/comments/61imxv/_/dfezmrv\"&gt;This is the comment I made a few weeks ago when I mentioned it in another comment and that person asked&lt;/a&gt;.  Somewhere in my post history is the &amp;quot;original&amp;quot; story back in November, but very long story short, she cared about me being polite to her (polite about telling at get for leaving the door unlocked and then bring more rude by shoving my way past her to save my baby&amp;#39;s life) - more than she cared about the life of my baby.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb67n5", "score_hidden": false, "stickied": false, "created": 1492318999.0, "created_utc": 1492290199.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3uhy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "eightiesladies", "parent_id": "t1_dgat9lp", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Wow. What did she do to your kid?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. What did she do to your kid?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb3uhy", "score_hidden": false, "stickied": false, "created": 1492315773.0, "created_utc": 1492286973.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgat9lp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "justarandomcommenter", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My mom has a personality disorders called \"Borderline Personality Disorder\", it's very similar to narcissism, but a little more of the intense \"making things up in your head\" stuff, I'd actually recommend you read through raisedbyborderlines in addition to raisedbynarcissists.\n\nI wanted to have a mom I could live and be friends with, too.  But my strong desire to have that relationship with her, led to her almost killing my toddler.  That was the wake up call I needed to finally protect myself from her insanity by going NC (this was back in November).\n\nShe's abusive to you, just as my mother is abusive to me.  If you look up\"the cycle of abuse\", you'll notice that there's plenty of times an abuser will treat you like gold, but it's literally only happening to control you and maintain control over you, it's not because she loves you.\n\nIt took me 35 years to learn that my mother doesn't actually love me, and will literally do anything and make up anything in order to keep that control she wants over me and my life.  You're 1000mi away from your mom, I'm 3500mi away and in another country, and still she was able to control me from that distance because I allowed her to continue to do so (over Skype, text, email, IM, etc).  The only way to fix this is to remove yourself from the situation entirely.  You've tried setting the boundaries, she's trampled right over them, and now you're worried and stressed and about to have a shitty time with two people you love because your mom is still in your head.\n\nI'd highly suggest going to the Psychology Today website, and finding an EMDR therapist (I recommend this site because they list actual licensed therapists, with actual degrees, who can actually help you deal with all the crap you've been through).\n\nGood luck!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mom has a personality disorders called &amp;quot;Borderline Personality Disorder&amp;quot;, it&amp;#39;s very similar to narcissism, but a little more of the intense &amp;quot;making things up in your head&amp;quot; stuff, I&amp;#39;d actually recommend you read through raisedbyborderlines in addition to raisedbynarcissists.&lt;/p&gt;\n\n&lt;p&gt;I wanted to have a mom I could live and be friends with, too.  But my strong desire to have that relationship with her, led to her almost killing my toddler.  That was the wake up call I needed to finally protect myself from her insanity by going NC (this was back in November).&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s abusive to you, just as my mother is abusive to me.  If you look up&amp;quot;the cycle of abuse&amp;quot;, you&amp;#39;ll notice that there&amp;#39;s plenty of times an abuser will treat you like gold, but it&amp;#39;s literally only happening to control you and maintain control over you, it&amp;#39;s not because she loves you.&lt;/p&gt;\n\n&lt;p&gt;It took me 35 years to learn that my mother doesn&amp;#39;t actually love me, and will literally do anything and make up anything in order to keep that control she wants over me and my life.  You&amp;#39;re 1000mi away from your mom, I&amp;#39;m 3500mi away and in another country, and still she was able to control me from that distance because I allowed her to continue to do so (over Skype, text, email, IM, etc).  The only way to fix this is to remove yourself from the situation entirely.  You&amp;#39;ve tried setting the boundaries, she&amp;#39;s trampled right over them, and now you&amp;#39;re worried and stressed and about to have a shitty time with two people you love because your mom is still in your head.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d highly suggest going to the Psychology Today website, and finding an EMDR therapist (I recommend this site because they list actual licensed therapists, with actual degrees, who can actually help you deal with all the crap you&amp;#39;ve been through).&lt;/p&gt;\n\n&lt;p&gt;Good luck!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgat9lp", "score_hidden": false, "stickied": false, "created": 1492301328.0, "created_utc": 1492272528.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgb077k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SeaStarSeeStar", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Parents are supposed to do a lot and sacrifice for their kids.\nShe's not something special just because she made you aware of it.\n\n\n\nKids are supposed to take it all for granted until they're old enough to appricate it. I would NEVER tell my kids what all in life i chose to give up to have them have the childhood we're building for them. I dont regret it and even if i did i wouldn't tell my kids about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Parents are supposed to do a lot and sacrifice for their kids.\nShe&amp;#39;s not something special just because she made you aware of it.&lt;/p&gt;\n\n&lt;p&gt;Kids are supposed to take it all for granted until they&amp;#39;re old enough to appricate it. I would NEVER tell my kids what all in life i chose to give up to have them have the childhood we&amp;#39;re building for them. I dont regret it and even if i did i wouldn&amp;#39;t tell my kids about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb077k", "score_hidden": false, "stickied": false, "created": 1492310873.0, "created_utc": 1492282073.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgcx4qn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sir-winkles", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hey I know this is a few day old thread, but my mom is exactly the same way! She acts massively selfishly and perceives everything as a personal attack. I had a similar realization of her moral issues as you when she was suing  my dad for probably the 10th time when i was 14. I had always heard the same things about how awful he was too, and believed them! It's horrible to realize your parents can be... Bad. \n\nI'm currently going through the process of accepting that for my own health and sanity i have to go low contact (I also moved cross country unsurprisingly), so if you need someone to talk to about it, feel free to message me! I've never actually talked to someone who's  situation sounded so similar before, and it's definitely hard to go through when nobody understands. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey I know this is a few day old thread, but my mom is exactly the same way! She acts massively selfishly and perceives everything as a personal attack. I had a similar realization of her moral issues as you when she was suing  my dad for probably the 10th time when i was 14. I had always heard the same things about how awful he was too, and believed them! It&amp;#39;s horrible to realize your parents can be... Bad. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m currently going through the process of accepting that for my own health and sanity i have to go low contact (I also moved cross country unsurprisingly), so if you need someone to talk to about it, feel free to message me! I&amp;#39;ve never actually talked to someone who&amp;#39;s  situation sounded so similar before, and it&amp;#39;s definitely hard to go through when nobody understands. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcx4qn", "score_hidden": true, "stickied": false, "created": 1492422156.0, "created_utc": 1492393356.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgawgeo", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "mudd00000000", "parent_id": "t1_dg9vpx4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There is an saying that goes, \"you shouldn't have to light yourself on fire to keep someone else warm\" don't let this persons insecurities in life ruin your own life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is an saying that goes, &amp;quot;you shouldn&amp;#39;t have to light yourself on fire to keep someone else warm&amp;quot; don&amp;#39;t let this persons insecurities in life ruin your own life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgawgeo", "score_hidden": false, "stickied": false, "created": 1492305761.0, "created_utc": 1492276961.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9vpx4", "gilded": 0, "archived": false, "score": 128, "report_reasons": null, "author": "Goldenmountains", "parent_id": "t1_dg9vkfg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Idk, I mean despite her being crazy af, she's done a lot for me and sacrificed a lot so I could have and do what I want. But she is narcissistic and controlling and selfish, so idk. But she's my mom, and I love her. I want her to be happy, not crazy :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Idk, I mean despite her being crazy af, she&amp;#39;s done a lot for me and sacrificed a lot so I could have and do what I want. But she is narcissistic and controlling and selfish, so idk. But she&amp;#39;s my mom, and I love her. I want her to be happy, not crazy :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9vpx4", "score_hidden": false, "stickied": false, "created": 1492238758.0, "created_utc": 1492209958.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 128}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9vkfg", "gilded": 0, "archived": false, "score": 622, "report_reasons": null, "author": "Shinbatsu", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Do you still even want your mom in your life after everything she's done? Think hard about it. If she adds nothing positive to your life you don't need to bend yourself into a pretzel to keep her around. \n\nIt seems like she can't live without drama. My mom and dad also divorced when I was young, and my mom would make up delusions that my dad was trying to turn us against her. Dad got remarried and is happy, mom has never had a stable relationship since (coincidence? I don't think so). She was emotionally abusive, and my Dad is a really good person, so I'm on my dad's side here. Your mom sounds a lot like my mom actually, in which case I would point you towards the r/raisedbynarcissists sub.\n\nBack to your original question: what do you respond with.  In my case I just stopped responding. You can't counter crazy with logic. Anything you say will just add to the drama, so don't say anything.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you still even want your mom in your life after everything she&amp;#39;s done? Think hard about it. If she adds nothing positive to your life you don&amp;#39;t need to bend yourself into a pretzel to keep her around. &lt;/p&gt;\n\n&lt;p&gt;It seems like she can&amp;#39;t live without drama. My mom and dad also divorced when I was young, and my mom would make up delusions that my dad was trying to turn us against her. Dad got remarried and is happy, mom has never had a stable relationship since (coincidence? I don&amp;#39;t think so). She was emotionally abusive, and my Dad is a really good person, so I&amp;#39;m on my dad&amp;#39;s side here. Your mom sounds a lot like my mom actually, in which case I would point you towards the &lt;a href=\"/r/raisedbynarcissists\"&gt;r/raisedbynarcissists&lt;/a&gt; sub.&lt;/p&gt;\n\n&lt;p&gt;Back to your original question: what do you respond with.  In my case I just stopped responding. You can&amp;#39;t counter crazy with logic. Anything you say will just add to the drama, so don&amp;#39;t say anything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9vkfg", "score_hidden": false, "stickied": false, "created": 1492238553.0, "created_utc": 1492209753.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 622}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dg9yflb", "gilded": 0, "archived": false, "score": 129, "report_reasons": null, "author": "Battlepuppy", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your mother is a professional victim, you have my sympathies.\n\nNot much you can do about this, this is only something she can fix if she wants to.\n\nWhen you are perpetually a victim:\n\nYou don't have to improve yourself or situation because your problems are created by others.\n\nYou have an \"aggressor\" that owes you because they wronged you, and now they have to pay you back any way you choose if they want to make it right.\n\nVictims are always better people then the aggressors because they are the victims.  Anything they do wrong is over-shadowed by what is done to them, washing them clean by comparison.\n\nVictims are owed sympathy by every other person, and if you don't give it to them, you are a heartless monster.\n\nSince victims are having a hard time when they are aggressed upon, its society's duty to allow them more of everything because no one else is being hurt like they are being hurt.\n\nSometimes life isn't fair, and you are not a perpetual victim.  That doesn't mean you can't make yourself one, and your mother is showing initiative in that department.\n\n\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your mother is a professional victim, you have my sympathies.&lt;/p&gt;\n\n&lt;p&gt;Not much you can do about this, this is only something she can fix if she wants to.&lt;/p&gt;\n\n&lt;p&gt;When you are perpetually a victim:&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to improve yourself or situation because your problems are created by others.&lt;/p&gt;\n\n&lt;p&gt;You have an &amp;quot;aggressor&amp;quot; that owes you because they wronged you, and now they have to pay you back any way you choose if they want to make it right.&lt;/p&gt;\n\n&lt;p&gt;Victims are always better people then the aggressors because they are the victims.  Anything they do wrong is over-shadowed by what is done to them, washing them clean by comparison.&lt;/p&gt;\n\n&lt;p&gt;Victims are owed sympathy by every other person, and if you don&amp;#39;t give it to them, you are a heartless monster.&lt;/p&gt;\n\n&lt;p&gt;Since victims are having a hard time when they are aggressed upon, its society&amp;#39;s duty to allow them more of everything because no one else is being hurt like they are being hurt.&lt;/p&gt;\n\n&lt;p&gt;Sometimes life isn&amp;#39;t fair, and you are not a perpetual victim.  That doesn&amp;#39;t mean you can&amp;#39;t make yourself one, and your mother is showing initiative in that department.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9yflb", "score_hidden": false, "stickied": false, "created": 1492242355.0, "created_utc": 1492213555.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 129}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dg9xspu", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "bearpony", "parent_id": "t1_dg9xo7s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Idk. Obviously I haven't met your mom, so I can't know for sure, but she reminds me of other people I've met. Sometimes they start to believe the things they say, but it's different from having delusions. Either way though, your best bet is to not engage with her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Idk. Obviously I haven&amp;#39;t met your mom, so I can&amp;#39;t know for sure, but she reminds me of other people I&amp;#39;ve met. Sometimes they start to believe the things they say, but it&amp;#39;s different from having delusions. Either way though, your best bet is to not engage with her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9xspu", "score_hidden": false, "stickied": false, "created": 1492241524.0, "created_utc": 1492212724.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 55}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga7sum", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "LaraCroftsButler", "parent_id": "t1_dg9xo7s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "As I was reading your post, I honestly thought \"is this about *my* mom?\" Because she sounds *exactly* like my mother. The only thing that got through to my mother when she was at her \"craziest\" was to just cut her out of my life, absolutely no contact. I blocked her from everything, even had an app that would automatically send my mom's number straight to voicemail. My brother went low contact a few years prior. Both of her children suddenly stopped talking to her. She went *nuts* for a few months before she finally gave in and went to therapy. I didn't speak to nor acknowledge her for 2 years, while she went through at least 3 therapists and divorced my step dad during this time. It took another 2 years where I could stand to have an actual conversation with her. \n\nHonestly, there is nothing you can do or say to someone like them, where they aren't the victim. Going no contact then low contact was the absolute best decision I made regarding my mother. These days she's finally realized that *she* is the problem, not everyone else. Even if you try to reason with them, it's still never any fault of their own, and any decision you make will *always* somehow be about them. What does she really bring to your life?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As I was reading your post, I honestly thought &amp;quot;is this about &lt;em&gt;my&lt;/em&gt; mom?&amp;quot; Because she sounds &lt;em&gt;exactly&lt;/em&gt; like my mother. The only thing that got through to my mother when she was at her &amp;quot;craziest&amp;quot; was to just cut her out of my life, absolutely no contact. I blocked her from everything, even had an app that would automatically send my mom&amp;#39;s number straight to voicemail. My brother went low contact a few years prior. Both of her children suddenly stopped talking to her. She went &lt;em&gt;nuts&lt;/em&gt; for a few months before she finally gave in and went to therapy. I didn&amp;#39;t speak to nor acknowledge her for 2 years, while she went through at least 3 therapists and divorced my step dad during this time. It took another 2 years where I could stand to have an actual conversation with her. &lt;/p&gt;\n\n&lt;p&gt;Honestly, there is nothing you can do or say to someone like them, where they aren&amp;#39;t the victim. Going no contact then low contact was the absolute best decision I made regarding my mother. These days she&amp;#39;s finally realized that &lt;em&gt;she&lt;/em&gt; is the problem, not everyone else. Even if you try to reason with them, it&amp;#39;s still never any fault of their own, and any decision you make will &lt;em&gt;always&lt;/em&gt; somehow be about them. What does she really bring to your life?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga7sum", "score_hidden": false, "stickied": false, "created": 1492255440.0, "created_utc": 1492226640.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga0a53", "gilded": 0, "archived": false, "score": 59, "report_reasons": null, "author": "cman_yall", "parent_id": "t1_dg9xo7s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm sure she would never lie about such things /s", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure she would never lie about such things /s&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga0a53", "score_hidden": false, "stickied": false, "created": 1492244821.0, "created_utc": 1492216021.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 59}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgact7h", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "KrytenKoro", "parent_id": "t1_dg9xo7s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; who is admittedly fucking crazy, she pointed a gun at my mom bc they were late dropping off my step brother\n\nProof? Were you there? Are you sure your mother wasn't threatening her?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;who is admittedly fucking crazy, she pointed a gun at my mom bc they were late dropping off my step brother&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Proof? Were you there? Are you sure your mother wasn&amp;#39;t threatening her?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgact7h", "score_hidden": false, "stickied": false, "created": 1492264398.0, "created_utc": 1492235598.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgaqfb8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tamiaredguard", "parent_id": "t1_dg9xo7s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It doesn't matter whether she does or doesn't. She's a horrible person whom you owe NOTHING and who has done pretty much nothing but damage you. If you don't wake up, and quit involving her in your life, all you're going to wind up doing is continue to allow her to damage you and ruin your life. You're an adult yourself now, so it's on you if you do that. We decide as adults what, and whom, we will and won't allow in our lives. She is toxic. She will not change. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t matter whether she does or doesn&amp;#39;t. She&amp;#39;s a horrible person whom you owe NOTHING and who has done pretty much nothing but damage you. If you don&amp;#39;t wake up, and quit involving her in your life, all you&amp;#39;re going to wind up doing is continue to allow her to damage you and ruin your life. You&amp;#39;re an adult yourself now, so it&amp;#39;s on you if you do that. We decide as adults what, and whom, we will and won&amp;#39;t allow in our lives. She is toxic. She will not change. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaqfb8", "score_hidden": false, "stickied": false, "created": 1492297314.0, "created_utc": 1492268514.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xo7s", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "Goldenmountains", "parent_id": "t1_dg9x6y3", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I really think that she truly believes all of this is true. She also has an issue with her husband's ex (who is admittedly fucking crazy, she pointed a gun at my mom bc they were late dropping off my step brother) but this woman like apparently stalks her and turned her friends against her and shit (so my mom says, anyway) She really believes everyone is just out to hurt her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really think that she truly believes all of this is true. She also has an issue with her husband&amp;#39;s ex (who is admittedly fucking crazy, she pointed a gun at my mom bc they were late dropping off my step brother) but this woman like apparently stalks her and turned her friends against her and shit (so my mom says, anyway) She really believes everyone is just out to hurt her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9xo7s", "score_hidden": false, "stickied": false, "created": 1492241361.0, "created_utc": 1492212561.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 33}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9x6y3", "gilded": 0, "archived": false, "score": 186, "report_reasons": null, "author": "bearpony", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your mom isn't crazy in the sense that she's delusional or not aware of reality. She's just lying and saying inflammatory things to upset you and manipulate you and make sure your attention is on coddling and soothing her. It's kind of like, she's decided that the literal truth of what happened isn't a priority. Her priority is her feelings, and how to use you to assuage them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your mom isn&amp;#39;t crazy in the sense that she&amp;#39;s delusional or not aware of reality. She&amp;#39;s just lying and saying inflammatory things to upset you and manipulate you and make sure your attention is on coddling and soothing her. It&amp;#39;s kind of like, she&amp;#39;s decided that the literal truth of what happened isn&amp;#39;t a priority. Her priority is her feelings, and how to use you to assuage them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9x6y3", "score_hidden": false, "stickied": false, "created": 1492240734.0, "created_utc": 1492211934.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 186}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dg9z583", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "Rapierguy69", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Personally, I wouldn't even respond. She's playing the victim. Let her play, all by herself. Make sure your brother and you are good and that he understands you're not going to engage in her victim theories. If she presses tell her that you already answered her. You could even go so far as to tell her that if her communications involve references to your father than that ends the conversation. You could tell her you currently don't discuss her when talking to him, you won't talk about him if you're talking to her. If she brings it up, you answer simply \"I told you before I'm not going to get in the middle of it. If you want to discuss dad I'm out of this conversation.\" But that's just me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally, I wouldn&amp;#39;t even respond. She&amp;#39;s playing the victim. Let her play, all by herself. Make sure your brother and you are good and that he understands you&amp;#39;re not going to engage in her victim theories. If she presses tell her that you already answered her. You could even go so far as to tell her that if her communications involve references to your father than that ends the conversation. You could tell her you currently don&amp;#39;t discuss her when talking to him, you won&amp;#39;t talk about him if you&amp;#39;re talking to her. If she brings it up, you answer simply &amp;quot;I told you before I&amp;#39;m not going to get in the middle of it. If you want to discuss dad I&amp;#39;m out of this conversation.&amp;quot; But that&amp;#39;s just me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9z583", "score_hidden": false, "stickied": false, "created": 1492243312.0, "created_utc": 1492214512.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga1o5q", "gilded": 0, "archived": false, "score": 57, "report_reasons": null, "author": "ShesTyping", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Go dig yourself into r/raisedbynarcissists, it will help.\n\nYour mother is crazy, crazy manipulative. And she's trying to make you into both her emotional punching bag and her patsy for dealing with her resentments about your dad. \n\nIt's possible to love your mother, appreciate what she did do right for you, and also not want to engage with what she does wrong by you. In fact, it's better that you accept that this is how she is and you can't fix or change her and learn how to survive this behavior instead of feeling you have some duty to validate her or indulge her just because of everything good she's done for you. Go on YouTube and look up Richard Grannon's channel, he has some amazing advice on how to deal with narcissists and be in control of the relationship and not allow the manipulation to get to you.\n\nKeep her on an information diet, when she starts acting out like this just stop responding. \"No\" is a complete sentence, and if you feel you need to respond, you can just respond repetitively with something like \"That's not what happened. I'm not going to discuss your scenario\" or \"I'm not going to talk about dad, if you have a problem with anything he's done, talk to him\" over and over till she gets tired of her manipulations not working and finds a new topic. \n\nDo not try and unravel her scenarios and try and get her to see what really happened, don't JADE (Justify, Argue, Defend, Explain). She's not interested in hearing your side, she just wants you to accept her version of reality. These are the only ways of staying sane, when she starts doing this, distance yourself and follow the above protocols still she starts behaving again. It's almost like a form of behavioral training. You may have to have her accuse you of being mean or not loving her, but take those accusations like water off a ducks back and keep being calmly assertive about boundaries and not engaging in her nonsense. It's like a parent disciplining a child, at some point the kid will tell you they hate you and you just need to go \"That's fine\" and keep on being consistent with the discipline and eventually the kid settles and is fine and loving again.\n\nLook after yourself, if you try and take responsibility for making things right for her or fixing her versions of reality, you're only going to end up the bad guy and hurting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go dig yourself into &lt;a href=\"/r/raisedbynarcissists\"&gt;r/raisedbynarcissists&lt;/a&gt;, it will help.&lt;/p&gt;\n\n&lt;p&gt;Your mother is crazy, crazy manipulative. And she&amp;#39;s trying to make you into both her emotional punching bag and her patsy for dealing with her resentments about your dad. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s possible to love your mother, appreciate what she did do right for you, and also not want to engage with what she does wrong by you. In fact, it&amp;#39;s better that you accept that this is how she is and you can&amp;#39;t fix or change her and learn how to survive this behavior instead of feeling you have some duty to validate her or indulge her just because of everything good she&amp;#39;s done for you. Go on YouTube and look up Richard Grannon&amp;#39;s channel, he has some amazing advice on how to deal with narcissists and be in control of the relationship and not allow the manipulation to get to you.&lt;/p&gt;\n\n&lt;p&gt;Keep her on an information diet, when she starts acting out like this just stop responding. &amp;quot;No&amp;quot; is a complete sentence, and if you feel you need to respond, you can just respond repetitively with something like &amp;quot;That&amp;#39;s not what happened. I&amp;#39;m not going to discuss your scenario&amp;quot; or &amp;quot;I&amp;#39;m not going to talk about dad, if you have a problem with anything he&amp;#39;s done, talk to him&amp;quot; over and over till she gets tired of her manipulations not working and finds a new topic. &lt;/p&gt;\n\n&lt;p&gt;Do not try and unravel her scenarios and try and get her to see what really happened, don&amp;#39;t JADE (Justify, Argue, Defend, Explain). She&amp;#39;s not interested in hearing your side, she just wants you to accept her version of reality. These are the only ways of staying sane, when she starts doing this, distance yourself and follow the above protocols still she starts behaving again. It&amp;#39;s almost like a form of behavioral training. You may have to have her accuse you of being mean or not loving her, but take those accusations like water off a ducks back and keep being calmly assertive about boundaries and not engaging in her nonsense. It&amp;#39;s like a parent disciplining a child, at some point the kid will tell you they hate you and you just need to go &amp;quot;That&amp;#39;s fine&amp;quot; and keep on being consistent with the discipline and eventually the kid settles and is fine and loving again.&lt;/p&gt;\n\n&lt;p&gt;Look after yourself, if you try and take responsibility for making things right for her or fixing her versions of reality, you&amp;#39;re only going to end up the bad guy and hurting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga1o5q", "score_hidden": false, "stickied": false, "created": 1492246677.0, "created_utc": 1492217877.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 57}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga7wln", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Morrowinded", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;My senior year of highschool, I found out my mom was pretending to be me on my Facebook account, talking to a woman who had taken my senior pictures for my dad and telling her I didn't like them, didn't have fun taking them and didn't want to be tagged in them (because she only wanted Facebook to see the pictures she had taken, not my dad's). This woman was pretty hurt and had no idea it wasn't actually me saying these things. I immediately texted her and told her that was a fucked up thing to do, and changed my password since she violated my privacy and pretended to be me. She reacted by taking all of my money out of my bank account for a made up debt I now suddenly owed her\n\nI'm not sure why you are surprised by her recent behavior, the Facebook incident is the moment where she revealed her true nasty self. I understand you want to have a good relationship with her, but the Facebook incident is really all you need to refer to when you are wondering if your mom is crazy. The answer is yes. Your mom has serious issues and she will continue to cause negativity in your life if you let her.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;My senior year of highschool, I found out my mom was pretending to be me on my Facebook account, talking to a woman who had taken my senior pictures for my dad and telling her I didn&amp;#39;t like them, didn&amp;#39;t have fun taking them and didn&amp;#39;t want to be tagged in them (because she only wanted Facebook to see the pictures she had taken, not my dad&amp;#39;s). This woman was pretty hurt and had no idea it wasn&amp;#39;t actually me saying these things. I immediately texted her and told her that was a fucked up thing to do, and changed my password since she violated my privacy and pretended to be me. She reacted by taking all of my money out of my bank account for a made up debt I now suddenly owed her&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not sure why you are surprised by her recent behavior, the Facebook incident is the moment where she revealed her true nasty self. I understand you want to have a good relationship with her, but the Facebook incident is really all you need to refer to when you are wondering if your mom is crazy. The answer is yes. Your mom has serious issues and she will continue to cause negativity in your life if you let her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga7wln", "score_hidden": false, "stickied": false, "created": 1492255609.0, "created_utc": 1492226809.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga16l2", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "dcphoto78", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's highly unlikely there's anything you can say to change her. You have to decide what kind of boundaries you want to set to protect yourself from a toxic family member. That's 100% what she is. A toxic, manipulative, emotionally abusive parent. It doesn't matter how much she's done for you in the past. *That doesn't give her the right to be emotionally abusive.* Don't ever let her convince you otherwise. Set firm boundaries and limit information. If she won't respect the boundaries you set, think about whether you even want her in your life. Your own peace of mind is top priority here. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s highly unlikely there&amp;#39;s anything you can say to change her. You have to decide what kind of boundaries you want to set to protect yourself from a toxic family member. That&amp;#39;s 100% what she is. A toxic, manipulative, emotionally abusive parent. It doesn&amp;#39;t matter how much she&amp;#39;s done for you in the past. &lt;em&gt;That doesn&amp;#39;t give her the right to be emotionally abusive.&lt;/em&gt; Don&amp;#39;t ever let her convince you otherwise. Set firm boundaries and limit information. If she won&amp;#39;t respect the boundaries you set, think about whether you even want her in your life. Your own peace of mind is top priority here. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga16l2", "score_hidden": false, "stickied": false, "created": 1492246020.0, "created_utc": 1492217220.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgai6gj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "myk94901", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hi, I lived through similar. Parents got divorced when I was about 6 and my sister 9. My mother used us kids as a revenge against my dad. Like when he came to see us during his visitation we had to tell him we hate him and don't want to go out with him. (Because if we did not it meant we didn't love mommy - what she said to us). Anyway long story short. I am now 43 and have not spoken to my mother since I left my home at age of 18. I am still in touch with my dad. Lots of people will never understand how can I do that. But it's very easy as she has never attempted to contact me. Looking back at my life that was the right thing to do for me. We all have a story and we all live a life. Follow your instincts. Do what is best for you. Follow your instincts. Travel, volunteer and learn to love and forgive yourself. Good luck. Everything will be ok. M", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I lived through similar. Parents got divorced when I was about 6 and my sister 9. My mother used us kids as a revenge against my dad. Like when he came to see us during his visitation we had to tell him we hate him and don&amp;#39;t want to go out with him. (Because if we did not it meant we didn&amp;#39;t love mommy - what she said to us). Anyway long story short. I am now 43 and have not spoken to my mother since I left my home at age of 18. I am still in touch with my dad. Lots of people will never understand how can I do that. But it&amp;#39;s very easy as she has never attempted to contact me. Looking back at my life that was the right thing to do for me. We all have a story and we all live a life. Follow your instincts. Do what is best for you. Follow your instincts. Travel, volunteer and learn to love and forgive yourself. Good luck. Everything will be ok. M&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgai6gj", "score_hidden": false, "stickied": false, "created": 1492279113.0, "created_utc": 1492250313.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dg9vmbw", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "adhdcombinationokay", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "r/raisedbynarcissists might be helpful and enlightening for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/raisedbynarcissists\"&gt;r/raisedbynarcissists&lt;/a&gt; might be helpful and enlightening for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9vmbw", "score_hidden": false, "stickied": false, "created": 1492238623.0, "created_utc": 1492209823.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga10ai", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "SunshineRegiment", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My mom sends me crazy emails almost identical to this. I've got no advice for you because I've noticed that the crazy just keeps getting worse over time, and I avoid her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mom sends me crazy emails almost identical to this. I&amp;#39;ve got no advice for you because I&amp;#39;ve noticed that the crazy just keeps getting worse over time, and I avoid her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga10ai", "score_hidden": false, "stickied": false, "created": 1492245785.0, "created_utc": 1492216985.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgajn69", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "baby_armadillo", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Don't forgive people's past behavior.  Their past behavior is what informs you what kind of person they are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t forgive people&amp;#39;s past behavior.  Their past behavior is what informs you what kind of person they are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgajn69", "score_hidden": false, "stickied": false, "created": 1492283710.0, "created_utc": 1492254910.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga0832", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "cman_yall", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Tell her that the only person with a history of lying about people, playing games, and stealing money from people is her. That she can talk all day throwing a million and one accusations and spinning so much nonsense that it's impossible to read it all let alone refute it, but at the end of it, she's the one with the history of bullshit like this, not him. So she can either get her shit together and act like an adult and have a relationship with you, or she can carry on her tantrums like a child in which case you'll ignore her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell her that the only person with a history of lying about people, playing games, and stealing money from people is her. That she can talk all day throwing a million and one accusations and spinning so much nonsense that it&amp;#39;s impossible to read it all let alone refute it, but at the end of it, she&amp;#39;s the one with the history of bullshit like this, not him. So she can either get her shit together and act like an adult and have a relationship with you, or she can carry on her tantrums like a child in which case you&amp;#39;ll ignore her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga0832", "score_hidden": false, "stickied": false, "created": 1492244744.0, "created_utc": 1492215944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga3yri", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "flybrand", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There's a lot going on here:\n\n* You are just realizing your mother is not a perfect person, she isn't a saint.\n* She's poisoned you against your father.\n* She is very manipulative.\n* Reading r/raisedbynarcissists could help you understand your mother's behavior, regardless if she is actually a narcissist or not.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a lot going on here:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;You are just realizing your mother is not a perfect person, she isn&amp;#39;t a saint.&lt;/li&gt;\n&lt;li&gt;She&amp;#39;s poisoned you against your father.&lt;/li&gt;\n&lt;li&gt;She is very manipulative.&lt;/li&gt;\n&lt;li&gt;Reading &lt;a href=\"/r/raisedbynarcissists\"&gt;r/raisedbynarcissists&lt;/a&gt; could help you understand your mother&amp;#39;s behavior, regardless if she is actually a narcissist or not.&lt;br/&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga3yri", "score_hidden": false, "stickied": false, "created": 1492249831.0, "created_utc": 1492221031.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga7wws", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "JasonToddsangryface", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My mother hates my father. He beat her and us. It's been 30+ years now and she hates him. She talked to him about us anyway. \n\nYour mother stole from you and is a liar. You need to back away from her. Stop feeling sorry for her, you're falling for her act.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mother hates my father. He beat her and us. It&amp;#39;s been 30+ years now and she hates him. She talked to him about us anyway. &lt;/p&gt;\n\n&lt;p&gt;Your mother stole from you and is a liar. You need to back away from her. Stop feeling sorry for her, you&amp;#39;re falling for her act.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga7wws", "score_hidden": false, "stickied": false, "created": 1492255620.0, "created_utc": 1492226820.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgakmyb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LustfulGumby", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your mom sees what she wants. Nothing you can do will ever change this. She is a victim in life and victims need people against them and will create whatever they need to to make drama happen. \n\nIt's ok to stop talking to her. You won't be her scapegoat anymore. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your mom sees what she wants. Nothing you can do will ever change this. She is a victim in life and victims need people against them and will create whatever they need to to make drama happen. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s ok to stop talking to her. You won&amp;#39;t be her scapegoat anymore. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgakmyb", "score_hidden": false, "stickied": false, "created": 1492286410.0, "created_utc": 1492257610.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgamta8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "twodeadsticks", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your mom has a history of manipulation, deceit and drama.....why would this suddenly change? Sorry OP but I think you need a lightbulb moment and really think about if having a relationship with her is even good for your mental and emotional health. I think you need to start enforcing boundaries (with actual repercussions if they are broken) and grey rocking her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your mom has a history of manipulation, deceit and drama.....why would this suddenly change? Sorry OP but I think you need a lightbulb moment and really think about if having a relationship with her is even good for your mental and emotional health. I think you need to start enforcing boundaries (with actual repercussions if they are broken) and grey rocking her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgamta8", "score_hidden": false, "stickied": false, "created": 1492291239.0, "created_utc": 1492262439.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgasu0g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rabidhamster87", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My mom is really intense like this, OP.  You did good with your first message.  I've learned that you just have to let them wear themselves out.  Let her rant and rave if she wants, but just like you would with a toddler throwing a tantrum, don't acknowledge it.  Only respond to her when she's calm.  If she's anything like my mom, she will eventually reach out and pretend like nothing happened.  Reply back like normal then.  Until then just ignore her and let her batter herself silly against the grey rock that is your self-assurance and resolve.  I can almost guarantee that she didn't mean it about not staying at her house and she will be upset all over again in May when you and your brother have made other arrangements.     \n\n\nJust remember... **You are not responsible for her happiness.**  You're going to wear yourself out trying to look and say and do the right things the right ways and she'll still find something to be upset about.  It's a rough lesson and a hard habit to break when you've been raised to cater to someone else's happiness, but you're going to have to internalize the fact that if she's unhappy, it's her responsibility to fix that, not yours, not your brother's, and certainly not your dad's.  ", "edited": 1492272177.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mom is really intense like this, OP.  You did good with your first message.  I&amp;#39;ve learned that you just have to let them wear themselves out.  Let her rant and rave if she wants, but just like you would with a toddler throwing a tantrum, don&amp;#39;t acknowledge it.  Only respond to her when she&amp;#39;s calm.  If she&amp;#39;s anything like my mom, she will eventually reach out and pretend like nothing happened.  Reply back like normal then.  Until then just ignore her and let her batter herself silly against the grey rock that is your self-assurance and resolve.  I can almost guarantee that she didn&amp;#39;t mean it about not staying at her house and she will be upset all over again in May when you and your brother have made other arrangements.     &lt;/p&gt;\n\n&lt;p&gt;Just remember... &lt;strong&gt;You are not responsible for her happiness.&lt;/strong&gt;  You&amp;#39;re going to wear yourself out trying to look and say and do the right things the right ways and she&amp;#39;ll still find something to be upset about.  It&amp;#39;s a rough lesson and a hard habit to break when you&amp;#39;ve been raised to cater to someone else&amp;#39;s happiness, but you&amp;#39;re going to have to internalize the fact that if she&amp;#39;s unhappy, it&amp;#39;s her responsibility to fix that, not yours, not your brother&amp;#39;s, and certainly not your dad&amp;#39;s.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgasu0g", "score_hidden": false, "stickied": false, "created": 1492300742.0, "created_utc": 1492271942.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga6h6x", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "poop_giggle", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You just now think your mom is crazy? You should have cut her out of your life after she stole money from you when you enforced your right to privacy and prevented her from pretending to be you.\n\nWhat does she have to do for you to be done with her? You can't have a good relationship with someone who honestly believes that everything done to her is done out of spite or that the world is out to get her. \n\nIf it were me I'd send one last message. \"I had no idea of any plans made between you and brother. It was never my responsibility to relay any plans involving brother to anyone else. Nobody is conspiring against you. Ever since I was young it was you doing things to spite dad. Never once has he tried to screw you over in any way. Never once has he so much as said a negative thing about you. It's all been you trying to cause him problems. It's always been you causing problems. You're the one thats always been manipulative. And I'm honestly done. I can't deal with this needless drama anymore. I can't deal with you starting problems then pretending to be the victim anymore. It's tiring. We've not been close because this has been a constant thing with you. I think it's best if we no longer speak unless you seek some help.\" \n\nYou know that she isn't going to stop any of this. So you need to make sure she at the very least can't bring you into it. You can't just hope or love the crazy away so stop trying.", "edited": 1492224868.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You just now think your mom is crazy? You should have cut her out of your life after she stole money from you when you enforced your right to privacy and prevented her from pretending to be you.&lt;/p&gt;\n\n&lt;p&gt;What does she have to do for you to be done with her? You can&amp;#39;t have a good relationship with someone who honestly believes that everything done to her is done out of spite or that the world is out to get her. &lt;/p&gt;\n\n&lt;p&gt;If it were me I&amp;#39;d send one last message. &amp;quot;I had no idea of any plans made between you and brother. It was never my responsibility to relay any plans involving brother to anyone else. Nobody is conspiring against you. Ever since I was young it was you doing things to spite dad. Never once has he tried to screw you over in any way. Never once has he so much as said a negative thing about you. It&amp;#39;s all been you trying to cause him problems. It&amp;#39;s always been you causing problems. You&amp;#39;re the one thats always been manipulative. And I&amp;#39;m honestly done. I can&amp;#39;t deal with this needless drama anymore. I can&amp;#39;t deal with you starting problems then pretending to be the victim anymore. It&amp;#39;s tiring. We&amp;#39;ve not been close because this has been a constant thing with you. I think it&amp;#39;s best if we no longer speak unless you seek some help.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;You know that she isn&amp;#39;t going to stop any of this. So you need to make sure she at the very least can&amp;#39;t bring you into it. You can&amp;#39;t just hope or love the crazy away so stop trying.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga6h6x", "score_hidden": false, "stickied": false, "created": 1492253441.0, "created_utc": 1492224641.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga4p3z", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "saturnspoops", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just go no contact with her and stop engaging in insane irrational arguments with her. Like the saying goes, don't wrestle a pig, you'll both get muddy and the pig likes it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just go no contact with her and stop engaging in insane irrational arguments with her. Like the saying goes, don&amp;#39;t wrestle a pig, you&amp;#39;ll both get muddy and the pig likes it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga4p3z", "score_hidden": false, "stickied": false, "created": 1492250872.0, "created_utc": 1492222072.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgamn9j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Duckyjammies", "parent_id": "t1_dgacv6z", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah there is no win situation in this, I don't talk to three people in my family for this but not everyone is read for that step. All this woman is gonna see regardless is, is how she was not at fault or how they wronged her or how to twist it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah there is no win situation in this, I don&amp;#39;t talk to three people in my family for this but not everyone is read for that step. All this woman is gonna see regardless is, is how she was not at fault or how they wronged her or how to twist it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgamn9j", "score_hidden": false, "stickied": false, "created": 1492290904.0, "created_utc": 1492262104.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgacv6z", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "KrytenKoro", "parent_id": "t1_dg9y5q4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I'm sorry you feel that way\n\nAll a narcissist will hear in that is the \"Sorry\".\n\nAt best, say \"it sucks that you feel that way\" or \"it's unfortunate you feel that way\".\n\nNever admit fault for something that you didn't do wrong. It doesn't help, they'll just bring it up later with \"but you admitted it was your fault!\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m sorry you feel that way&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;All a narcissist will hear in that is the &amp;quot;Sorry&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;At best, say &amp;quot;it sucks that you feel that way&amp;quot; or &amp;quot;it&amp;#39;s unfortunate you feel that way&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Never admit fault for something that you didn&amp;#39;t do wrong. It doesn&amp;#39;t help, they&amp;#39;ll just bring it up later with &amp;quot;but you admitted it was your fault!&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgacv6z", "score_hidden": false, "stickied": false, "created": 1492264518.0, "created_utc": 1492235718.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9y5q4", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Duckyjammies", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "God this sounds so much like my grandmother, everyone was always out to get her to. It's amazing how we all seemed to work to be out to get her. \n\nIf honestly just text her something simple like \"I'm sorry you feel that way but (brother) forgot his plans with you and everyone was coming to visit that was it. No one was out to hurt you, it's not all about you or to leave you out. I am 1000 miles away and was just looking forward at seeing family that is all, everything else you imagined in your head\" and I'd stop responding because honestly there is no winning I think you know that at this point. \n\nEverything gets turned and twisted and they just sit and think on stuff until it works in their favor unfortunately. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;God this sounds so much like my grandmother, everyone was always out to get her to. It&amp;#39;s amazing how we all seemed to work to be out to get her. &lt;/p&gt;\n\n&lt;p&gt;If honestly just text her something simple like &amp;quot;I&amp;#39;m sorry you feel that way but (brother) forgot his plans with you and everyone was coming to visit that was it. No one was out to hurt you, it&amp;#39;s not all about you or to leave you out. I am 1000 miles away and was just looking forward at seeing family that is all, everything else you imagined in your head&amp;quot; and I&amp;#39;d stop responding because honestly there is no winning I think you know that at this point. &lt;/p&gt;\n\n&lt;p&gt;Everything gets turned and twisted and they just sit and think on stuff until it works in their favor unfortunately. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9y5q4", "score_hidden": false, "stickied": false, "created": 1492241994.0, "created_utc": 1492213194.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgal2y3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "semimedium", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I would just respond and say \"Alright, if that's how you feel.\" She just wants a big reaction.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would just respond and say &amp;quot;Alright, if that&amp;#39;s how you feel.&amp;quot; She just wants a big reaction.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgal2y3", "score_hidden": false, "stickied": false, "created": 1492287500.0, "created_utc": 1492258700.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgang68", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Aggressivecleaning", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I stopped reading when you decided to forgive her so \"you could have good relationships with them both\".\n\nThat is not how the world works. If you choose to ignore terrible shitty things people have done to you, they will just keep doing them. Good luck figuring that out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I stopped reading when you decided to forgive her so &amp;quot;you could have good relationships with them both&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;That is not how the world works. If you choose to ignore terrible shitty things people have done to you, they will just keep doing them. Good luck figuring that out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgang68", "score_hidden": false, "stickied": false, "created": 1492292427.0, "created_utc": 1492263627.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga4fqi", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "StrangeurDangeur", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This hit way too close to home. Your mom is either a narcissist, has borderline personality disorder, or both.  it's not your responsibility to take care of your mom's feelings all the time, esp. not regarding your dad or their past relationship. Talk about unhealthy boundaries. I'm so sorry, can completely empathize--which is why I'm having a hard time giving advice other than to try and connect with a therapist if you can, so you can work on building some helpful strategies on how to cope with your mom.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This hit way too close to home. Your mom is either a narcissist, has borderline personality disorder, or both.  it&amp;#39;s not your responsibility to take care of your mom&amp;#39;s feelings all the time, esp. not regarding your dad or their past relationship. Talk about unhealthy boundaries. I&amp;#39;m so sorry, can completely empathize--which is why I&amp;#39;m having a hard time giving advice other than to try and connect with a therapist if you can, so you can work on building some helpful strategies on how to cope with your mom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga4fqi", "score_hidden": false, "stickied": false, "created": 1492250494.0, "created_utc": 1492221694.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga5oic", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sowellhidden", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"Mom,  I really want to encourage you to see a (new) therapist.  I can't continue a relationship with you so long as you're turning yourself into the victim of every situation you encounter. I hope you can get to the bottom of your issues and start acting like my mom again.  When you feel ready to apologize for accusing me of plotting against you (etc.)  I'm here to listen.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Mom,  I really want to encourage you to see a (new) therapist.  I can&amp;#39;t continue a relationship with you so long as you&amp;#39;re turning yourself into the victim of every situation you encounter. I hope you can get to the bottom of your issues and start acting like my mom again.  When you feel ready to apologize for accusing me of plotting against you (etc.)  I&amp;#39;m here to listen.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga5oic", "score_hidden": false, "stickied": false, "created": 1492252309.0, "created_utc": 1492223509.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga40u9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "conamo", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think I'd reply \"I had nothing to do with the planning except to say yes when Dad asked if they could come. If you had plans with Brother and he didn't mention them, it was his mistake. If Dad bought him a ticket before asking if he was free, that was Dad's mistake. This wasn't my fault and I'm not going to continue arguing about it.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I&amp;#39;d reply &amp;quot;I had nothing to do with the planning except to say yes when Dad asked if they could come. If you had plans with Brother and he didn&amp;#39;t mention them, it was his mistake. If Dad bought him a ticket before asking if he was free, that was Dad&amp;#39;s mistake. This wasn&amp;#39;t my fault and I&amp;#39;m not going to continue arguing about it.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga40u9", "score_hidden": false, "stickied": false, "created": 1492249908.0, "created_utc": 1492221108.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgahi6q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "The_KazaakplethKilik", "parent_id": "t1_dga16v7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Won't that make mom explode and finally give her an actual proof for shittalking OP to everyone?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Won&amp;#39;t that make mom explode and finally give her an actual proof for shittalking OP to everyone?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgahi6q", "score_hidden": false, "stickied": false, "created": 1492276932.0, "created_utc": 1492248132.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga16v7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hxcafboi", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"You're right, I don't care. You're acting like a child, I don't care about this pointless drama, find someone else to complain to. \"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;You&amp;#39;re right, I don&amp;#39;t care. You&amp;#39;re acting like a child, I don&amp;#39;t care about this pointless drama, find someone else to complain to. &amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga16v7", "score_hidden": false, "stickied": false, "created": 1492246031.0, "created_utc": 1492217231.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga4zk1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bleuscreenofdeath", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yes, your mom is crazy. Unfortunately, you cannot combat crazy with reason. The only way  to combat it is by calling it out and enforcing boundaries. For example, when she goes off on one of her rants, hang up. Stop trying to argue with her, because it is clear she will only believe what she wants to believe.  Tell her straight up that you refuse to keep having this argument with her and if she persists, you will cut contact. Then do it. It will be tough because it sounds like you still want a relationship with her, but for that to happen, communications need to start being on your terms, not hers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, your mom is crazy. Unfortunately, you cannot combat crazy with reason. The only way  to combat it is by calling it out and enforcing boundaries. For example, when she goes off on one of her rants, hang up. Stop trying to argue with her, because it is clear she will only believe what she wants to believe.  Tell her straight up that you refuse to keep having this argument with her and if she persists, you will cut contact. Then do it. It will be tough because it sounds like you still want a relationship with her, but for that to happen, communications need to start being on your terms, not hers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga4zk1", "score_hidden": false, "stickied": false, "created": 1492251299.0, "created_utc": 1492222499.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgai0k3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dejaenten_", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Is your mum my mum? If so I'm sorry. When I was diagnosed with depression at 14 my mother wrote me a letter about \"how it made her feel\" etc.  \n\nI've recently had a baby and have basically cut her off. Her presence effects my baby negatively and my relationship with his father. She doesn't respect my wishes in regards to my child and instead takes anything I say that doesn't agree with her views. \n\nHonestly it was the best choice I could have made. I very rarely respond to her text messages and they have lost the privilege of receiving photos of my son (who is gorgeous and hilarious so jokes on them). \n\nHonestly I wouldn't reply to that message. If you feel you really need to then just simply explain your side again and inform her that you will no longer be discussing the matter as she isn't listening to you therefore nothing will actually be resolved. Then I would limit contact as much as possible. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is your mum my mum? If so I&amp;#39;m sorry. When I was diagnosed with depression at 14 my mother wrote me a letter about &amp;quot;how it made her feel&amp;quot; etc.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve recently had a baby and have basically cut her off. Her presence effects my baby negatively and my relationship with his father. She doesn&amp;#39;t respect my wishes in regards to my child and instead takes anything I say that doesn&amp;#39;t agree with her views. &lt;/p&gt;\n\n&lt;p&gt;Honestly it was the best choice I could have made. I very rarely respond to her text messages and they have lost the privilege of receiving photos of my son (who is gorgeous and hilarious so jokes on them). &lt;/p&gt;\n\n&lt;p&gt;Honestly I wouldn&amp;#39;t reply to that message. If you feel you really need to then just simply explain your side again and inform her that you will no longer be discussing the matter as she isn&amp;#39;t listening to you therefore nothing will actually be resolved. Then I would limit contact as much as possible. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgai0k3", "score_hidden": false, "stickied": false, "created": 1492278569.0, "created_utc": 1492249769.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgaq4qq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Triptukhos", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She sounds a *lot* like my mom. And in my experience you can't win. There's no logic so you can't convince her of anything. The only winning move is not to play.\n\nAnd it sucks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She sounds a &lt;em&gt;lot&lt;/em&gt; like my mom. And in my experience you can&amp;#39;t win. There&amp;#39;s no logic so you can&amp;#39;t convince her of anything. The only winning move is not to play.&lt;/p&gt;\n\n&lt;p&gt;And it sucks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaq4qq", "score_hidden": false, "stickied": false, "created": 1492296871.0, "created_utc": 1492268071.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgavtna", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "humm_tasty", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Cut her out.\nI know she's your mum but she isn't acting like it. You don't need the stress. \nResponse: dear mum, have a happy life, if you decide to be a proper mother you let me know. In the meantime, I would advise get some help. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cut her out.\nI know she&amp;#39;s your mum but she isn&amp;#39;t acting like it. You don&amp;#39;t need the stress. \nResponse: dear mum, have a happy life, if you decide to be a proper mother you let me know. In the meantime, I would advise get some help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgavtna", "score_hidden": false, "stickied": false, "created": 1492304906.0, "created_utc": 1492276106.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgazdse", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sheldorado", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My dad does the same thing so I know where you are coming from here.\n\nLet's use this example. I'm a dog trainer and a lot of puppies get into the bad habit of jumping up on people. Why do they do this? Because they get pet and attention when they do. How do their owners try to get rid of the behavior? They say \"No off no no bad dog don't jump up like that\" and try to push them off. This doesn't help because it's still giving the dog the attention that they're looking for. The best strategy? To ignore the dog until it stops jumping and has calmed down. Completely ignore. No talking, no saying their name, and no eye contact. Behavior is gone in two weeks.\n\nHumans aren't so simple in that it just goes away because others are reinforcing it. I've been doing the same thing with my dad for YEARS. He says something manipulative, insults my mom, tries to control me, insults me, suggests I treat him badly, is passive aggressive, etc. I stop responding and will not talk to him for several weeks (AT LEAST). I put him at arms length and only talk to him when he has calmed down. He will never apologize but this way I know that it is my decision. This sub has a tendency to throw people away and never talk to them again. While that is a valid option, perhaps simply adding distance every time she pulls this will be a more peaceful solution for the sake of the family. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My dad does the same thing so I know where you are coming from here.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s use this example. I&amp;#39;m a dog trainer and a lot of puppies get into the bad habit of jumping up on people. Why do they do this? Because they get pet and attention when they do. How do their owners try to get rid of the behavior? They say &amp;quot;No off no no bad dog don&amp;#39;t jump up like that&amp;quot; and try to push them off. This doesn&amp;#39;t help because it&amp;#39;s still giving the dog the attention that they&amp;#39;re looking for. The best strategy? To ignore the dog until it stops jumping and has calmed down. Completely ignore. No talking, no saying their name, and no eye contact. Behavior is gone in two weeks.&lt;/p&gt;\n\n&lt;p&gt;Humans aren&amp;#39;t so simple in that it just goes away because others are reinforcing it. I&amp;#39;ve been doing the same thing with my dad for YEARS. He says something manipulative, insults my mom, tries to control me, insults me, suggests I treat him badly, is passive aggressive, etc. I stop responding and will not talk to him for several weeks (AT LEAST). I put him at arms length and only talk to him when he has calmed down. He will never apologize but this way I know that it is my decision. This sub has a tendency to throw people away and never talk to them again. While that is a valid option, perhaps simply adding distance every time she pulls this will be a more peaceful solution for the sake of the family. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgazdse", "score_hidden": false, "stickied": false, "created": 1492309747.0, "created_utc": 1492280947.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgb0fks", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fragilelyon", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"Enjoy.\"\n\n\"I will. -send-\"\n\nMan just reading her diatribe stressed me out. Your first reply was brilliant. Firm, blunt, and you gave her zero wiggle room to turn your words around on you. Which makes her look incredibly silly trying to.\n\nI love my family too, and I haven't breathed a word to them in about a month. There's a point where you have to weigh how much good they bring to your life versus the bad and stress. Right now that balance is looking pretty skewed for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Enjoy.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I will. -send-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Man just reading her diatribe stressed me out. Your first reply was brilliant. Firm, blunt, and you gave her zero wiggle room to turn your words around on you. Which makes her look incredibly silly trying to.&lt;/p&gt;\n\n&lt;p&gt;I love my family too, and I haven&amp;#39;t breathed a word to them in about a month. There&amp;#39;s a point where you have to weigh how much good they bring to your life versus the bad and stress. Right now that balance is looking pretty skewed for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb0fks", "score_hidden": false, "stickied": false, "created": 1492311188.0, "created_utc": 1492282388.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgb3ran", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reddittor783", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your mom claims to be the victim of everyone around her manipulating her, but really she is the manipulative one.  In your position, I'd likely cut off contact with her entirely.  She's an adult and it's not YOUR responsibility to make everyone play nice.  If you're going to continue to have a relationship with her - be smart, and take everything she says with a grain of salt.  But I'd say she needs to be told to behave and treat people with respect or lose her relationship with you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your mom claims to be the victim of everyone around her manipulating her, but really she is the manipulative one.  In your position, I&amp;#39;d likely cut off contact with her entirely.  She&amp;#39;s an adult and it&amp;#39;s not YOUR responsibility to make everyone play nice.  If you&amp;#39;re going to continue to have a relationship with her - be smart, and take everything she says with a grain of salt.  But I&amp;#39;d say she needs to be told to behave and treat people with respect or lose her relationship with you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb3ran", "score_hidden": false, "stickied": false, "created": 1492315648.0, "created_utc": 1492286848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgb3yvt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "YouCantSaveEveryone", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think your mom is crazy too. As people get older it's easier for hen to lose touch with reality. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your mom is crazy too. As people get older it&amp;#39;s easier for hen to lose touch with reality. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb3yvt", "score_hidden": false, "stickied": false, "created": 1492315941.0, "created_utc": 1492287141.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgbblno", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ProjectKurtz", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If the gaslighting about your dad didn't clue you in that she's a crazy, selfish person, hopefully this does.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the gaslighting about your dad didn&amp;#39;t clue you in that she&amp;#39;s a crazy, selfish person, hopefully this does.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbblno", "score_hidden": false, "stickied": false, "created": 1492326650.0, "created_utc": 1492297850.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgbdc0j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kennedyz", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your life would be much happier without your mother in it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your life would be much happier without your mother in it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbdc0j", "score_hidden": false, "stickied": false, "created": 1492329104.0, "created_utc": 1492300304.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgbgald", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "harkandhush", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I think my mom is crazy.\n\nShe's definitely troubled and not in possession of a realistic perspective.\n\nAt the end of the day, when you have two people who had a disagreement and one is constantly shit talking the other, but the other is respectful and keeps their thoughts to themselves, it says a lot about both of them.  Your mother is definitely manipulative and wants to manipulate you and your brother against your father, whereas your father knows that your mom is kind of batshit and still doesn't talk shit about all the things she's probably done to him over the years.  I'm sure he's not perfect, but if he's a good dad, it really doesn't matter to you if he was a good husband or not to your mom.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think my mom is crazy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She&amp;#39;s definitely troubled and not in possession of a realistic perspective.&lt;/p&gt;\n\n&lt;p&gt;At the end of the day, when you have two people who had a disagreement and one is constantly shit talking the other, but the other is respectful and keeps their thoughts to themselves, it says a lot about both of them.  Your mother is definitely manipulative and wants to manipulate you and your brother against your father, whereas your father knows that your mom is kind of batshit and still doesn&amp;#39;t talk shit about all the things she&amp;#39;s probably done to him over the years.  I&amp;#39;m sure he&amp;#39;s not perfect, but if he&amp;#39;s a good dad, it really doesn&amp;#39;t matter to you if he was a good husband or not to your mom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbgald", "score_hidden": false, "stickied": false, "created": 1492333316.0, "created_utc": 1492304516.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga4zk0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sophtine", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"I'm sorry you feel that way.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I&amp;#39;m sorry you feel that way.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga4zk0", "score_hidden": false, "stickied": false, "created": 1492251299.0, "created_utc": 1492222499.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgafbul", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AnnOnimiss", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "  \n\"Mom, do you realize you're hurting people including yourself?  Your actions have pushed your loving children away.  To think I would intentionally conspire with my dad to hurt you, especially since I've told you over and over I don't want anything to do with what goes on between you makes me think you might really be deluded.  I don't think I can handle it anymore.  There is no conspiracy.  No one is doing anything to you intentionally, and taking it out on me and telling me i'm a liar and i'm not welcome at your house anymore makes me want to cut contact with you.  If you really think I am out to get you, it might be best for both of us if we didn't have contact for a while. Please get help. I love you mom.\"\n\n\nDunno if that's what you're going for, but I just edited what you posted into a response to her.  I can't imagine being in the middle of all that narcissistic manipulation.  I'm used to\n more passive aggressive superstitious crazy.\n\nGood luck!\n\n  ", "edited": 1492266678.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Mom, do you realize you&amp;#39;re hurting people including yourself?  Your actions have pushed your loving children away.  To think I would intentionally conspire with my dad to hurt you, especially since I&amp;#39;ve told you over and over I don&amp;#39;t want anything to do with what goes on between you makes me think you might really be deluded.  I don&amp;#39;t think I can handle it anymore.  There is no conspiracy.  No one is doing anything to you intentionally, and taking it out on me and telling me i&amp;#39;m a liar and i&amp;#39;m not welcome at your house anymore makes me want to cut contact with you.  If you really think I am out to get you, it might be best for both of us if we didn&amp;#39;t have contact for a while. Please get help. I love you mom.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Dunno if that&amp;#39;s what you&amp;#39;re going for, but I just edited what you posted into a response to her.  I can&amp;#39;t imagine being in the middle of all that narcissistic manipulation.  I&amp;#39;m used to\n more passive aggressive superstitious crazy.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgafbul", "score_hidden": false, "stickied": false, "created": 1492270430.0, "created_utc": 1492241630.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgahir2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "marojelly", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Are you sure that you mother is mentally healthy? It kind of sound like she has some kind of a psychical illness. She is thinking all the time about how she is a victim and your father is an aggressor. She is looking for danger in every aspect of her life, like everyone was trying to make her sad or angry. I don't think it's just being crazy. I highly recommend going to a doctor with her. \nSource: My grandfather had schizophrenia and he also thought that everyone tried to make his life as bad as possible. How your mother acts resembles me of him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you sure that you mother is mentally healthy? It kind of sound like she has some kind of a psychical illness. She is thinking all the time about how she is a victim and your father is an aggressor. She is looking for danger in every aspect of her life, like everyone was trying to make her sad or angry. I don&amp;#39;t think it&amp;#39;s just being crazy. I highly recommend going to a doctor with her. \nSource: My grandfather had schizophrenia and he also thought that everyone tried to make his life as bad as possible. How your mother acts resembles me of him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgahir2", "score_hidden": false, "stickied": false, "created": 1492276981.0, "created_utc": 1492248181.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgaqxa1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TGiFallen", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're mom IS insane, I think you should cut contact.\n\nOne more note:\n\nYour mom quite clearly hates your dad, especially his new wife.\n\nI'll bet my left testicle that 95% of the stuff your mom said about your dad is a lie and a fabrication. The other 5% of stuff is probably so exaggerated and embellished that is no longer true either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re mom IS insane, I think you should cut contact.&lt;/p&gt;\n\n&lt;p&gt;One more note:&lt;/p&gt;\n\n&lt;p&gt;Your mom quite clearly hates your dad, especially his new wife.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll bet my left testicle that 95% of the stuff your mom said about your dad is a lie and a fabrication. The other 5% of stuff is probably so exaggerated and embellished that is no longer true either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaqxa1", "score_hidden": false, "stickied": false, "created": 1492298035.0, "created_utc": 1492269235.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgas46r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ScammerC", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think the proper reply is \"k\", isn't it? Or is it \"k.\"? I can never remember if it's more condescending with the period or not. \n\nShe's still trying to fight a war that was declared over more than a decade ago. She sees you as a pawn in her game, but her game is now over and she lost. Take her banishment as a win for you and your life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the proper reply is &amp;quot;k&amp;quot;, isn&amp;#39;t it? Or is it &amp;quot;k.&amp;quot;? I can never remember if it&amp;#39;s more condescending with the period or not. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s still trying to fight a war that was declared over more than a decade ago. She sees you as a pawn in her game, but her game is now over and she lost. Take her banishment as a win for you and your life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgas46r", "score_hidden": false, "stickied": false, "created": 1492299729.0, "created_utc": 1492270929.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgacs23", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "ouronlyplanb", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Have you checked out the subreddit /r/raisedbynarcissists \n\nYou mum is a clear case for it. Some people there may be able to help.\n\nFor now I'd just say \"holy shit. Honestly you need therapy. Don't contact me.\" and block her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you checked out the subreddit &lt;a href=\"/r/raisedbynarcissists\"&gt;/r/raisedbynarcissists&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;You mum is a clear case for it. Some people there may be able to help.&lt;/p&gt;\n\n&lt;p&gt;For now I&amp;#39;d just say &amp;quot;holy shit. Honestly you need therapy. Don&amp;#39;t contact me.&amp;quot; and block her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgacs23", "score_hidden": false, "stickied": false, "created": 1492264328.0, "created_utc": 1492235528.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dga4gkz", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "shiroshippo", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Do these two things, in no particular order:\n\n1)  Be sure she is not doing drugs.  If she is, take her to detox, a sober living home, or the psych ward of a hospital.\n\n2)  Take her to a doctor who can prescribe medicine to fix mental problems.\n\nSince you don't normally live nearby, you might just have to sit her down and explain to her as gently as you can that she needs to sober up and see a mental health professional.  If you are very concerned about her health, have this conversation over the phone or via video chat so you don't have to worry about something happening to her before you are able to visit in person.", "edited": 1492222093.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do these two things, in no particular order:&lt;/p&gt;\n\n&lt;p&gt;1)  Be sure she is not doing drugs.  If she is, take her to detox, a sober living home, or the psych ward of a hospital.&lt;/p&gt;\n\n&lt;p&gt;2)  Take her to a doctor who can prescribe medicine to fix mental problems.&lt;/p&gt;\n\n&lt;p&gt;Since you don&amp;#39;t normally live nearby, you might just have to sit her down and explain to her as gently as you can that she needs to sober up and see a mental health professional.  If you are very concerned about her health, have this conversation over the phone or via video chat so you don&amp;#39;t have to worry about something happening to her before you are able to visit in person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga4gkz", "score_hidden": false, "stickied": false, "created": 1492250527.0, "created_utc": 1492221727.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgafknf", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "catladyfromaus", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She sounds like a narcissist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She sounds like a narcissist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgafknf", "score_hidden": false, "stickied": false, "created": 1492271102.0, "created_utc": 1492242302.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgaujjg", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Mexay", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP I'm also 22 and have grown up in a very, very similar situation to you. My parents split when I was about two, so my Mum got an early start on the slander. Going to his place became a punishment and I eventually grew to hate him. Fast forward 11 years till I'm 13, and I move with him because my Mum went batshit one day. Long story short, things with him and I are pretty chill.\n\n&amp;nbsp;\n\nMy relationship with both my parents is much, much better now but honestly things with my mother have only gotten better in the last year. Prior to that, I'd get these 10 page long texts about how I was the bad guy, how I was doing the wrong thing and it was my father's influence, etc etc etc etc. Same kind of shit.\n\n&amp;nbsp;\n\nHonestly OP, you need to put your foot down. It's the only thing that works. You are an adult. I know sometimes it might seem a bit weird having to talk down to your parents, but you need to explain that she is being childish and that you refuse to deal with this shit. \n\n&amp;nbsp;\n\nYou've kind of already said it but you need to make it very, very, very clear that this is distinctly *not your problem*. What your family does is not within your control as all of them are now adults. They can do their own thing and make their own decisions. \n\n&amp;nbsp;\n\nI have one of two methods for this that I think are likely to work.\n\n&amp;nbsp;\n\n1) Go Nuclear\nThis is definitely not  the best option and results may vary, but you may have to.  Essentially you might need to let loose and let everything out and then basically cut contact for as long as it takes. Weeks, Months or maybe years. Eventually she will either come around or you'll be free of the burden. Family is NOT forever. \n\n&amp;nbsp;\n\nThe blood of the covenant is thicker than the water of the womb, is the actual saying. Those you choose to keep in your life are more important than some arbitrary biological similarity. \n\n\n&amp;nbsp;\n\n2) Calm Discussion\nI'd recommend this option first. Sit down, explain how you feel logically. Take steps to make things as clear as possible, if she doesn't understand, ask if YOU can explain it better. If she reacts  poorly, reinforce calmly and clearly that you are not getting angry but that you want to resolve issues in the relationship.\n\nIf that fails, go option 1. It worked for me and I now have a healthy, happy relationship with my mother and we haven't had so much as an unpleasant word since Christmas 2015.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP I&amp;#39;m also 22 and have grown up in a very, very similar situation to you. My parents split when I was about two, so my Mum got an early start on the slander. Going to his place became a punishment and I eventually grew to hate him. Fast forward 11 years till I&amp;#39;m 13, and I move with him because my Mum went batshit one day. Long story short, things with him and I are pretty chill.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;My relationship with both my parents is much, much better now but honestly things with my mother have only gotten better in the last year. Prior to that, I&amp;#39;d get these 10 page long texts about how I was the bad guy, how I was doing the wrong thing and it was my father&amp;#39;s influence, etc etc etc etc. Same kind of shit.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Honestly OP, you need to put your foot down. It&amp;#39;s the only thing that works. You are an adult. I know sometimes it might seem a bit weird having to talk down to your parents, but you need to explain that she is being childish and that you refuse to deal with this shit. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve kind of already said it but you need to make it very, very, very clear that this is distinctly &lt;em&gt;not your problem&lt;/em&gt;. What your family does is not within your control as all of them are now adults. They can do their own thing and make their own decisions. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;I have one of two methods for this that I think are likely to work.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;1) Go Nuclear\nThis is definitely not  the best option and results may vary, but you may have to.  Essentially you might need to let loose and let everything out and then basically cut contact for as long as it takes. Weeks, Months or maybe years. Eventually she will either come around or you&amp;#39;ll be free of the burden. Family is NOT forever. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;The blood of the covenant is thicker than the water of the womb, is the actual saying. Those you choose to keep in your life are more important than some arbitrary biological similarity. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;2) Calm Discussion\nI&amp;#39;d recommend this option first. Sit down, explain how you feel logically. Take steps to make things as clear as possible, if she doesn&amp;#39;t understand, ask if YOU can explain it better. If she reacts  poorly, reinforce calmly and clearly that you are not getting angry but that you want to resolve issues in the relationship.&lt;/p&gt;\n\n&lt;p&gt;If that fails, go option 1. It worked for me and I now have a healthy, happy relationship with my mother and we haven&amp;#39;t had so much as an unpleasant word since Christmas 2015.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaujjg", "score_hidden": false, "stickied": false, "created": 1492303123.0, "created_utc": 1492274323.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgau5di", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Swedishpunsch", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yes, your mother is guano crazy.\n\nI bet that she didn't have previous plans with your brother at all - she probably gaslighted him about his birthday, when she found out that he had a plane ticket.\n\nYou might want to swing by r/raisedbynarcissists.  There are good suggestions for dealing with difficult people there.\n\nI hope that you are getting therapy for yourself, to remove the tentacles that your mother has in you.\n\nTry to stop caring so much what she thinks, because what she thinks varies hourly according to how much she is trying to cause drama and hurt you.  Instead of replying to her drama, Just. Stop.  \n\nKeep your communications breezy and superficial.  Tell her fine, no problem, we've already made arrangements when she tells you that you can't stay with her.\n\nDon't let her come back.  If she tells you she is coming, tell her No.  Tell her that she didn't enjoy her trip before, and that you don't want her back for awhile [never.]  If she already has a plane ticket [favorite trick of moochers and abusers] tell her to change it or sell it to someone else.\n\nStrengthen your spine.  Unfortunately, there is still a long way to go dealing with her.  It sounds like you don't have children.  If you do, a grandbaby will be a whole new shitstorm.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, your mother is guano crazy.&lt;/p&gt;\n\n&lt;p&gt;I bet that she didn&amp;#39;t have previous plans with your brother at all - she probably gaslighted him about his birthday, when she found out that he had a plane ticket.&lt;/p&gt;\n\n&lt;p&gt;You might want to swing by &lt;a href=\"/r/raisedbynarcissists\"&gt;r/raisedbynarcissists&lt;/a&gt;.  There are good suggestions for dealing with difficult people there.&lt;/p&gt;\n\n&lt;p&gt;I hope that you are getting therapy for yourself, to remove the tentacles that your mother has in you.&lt;/p&gt;\n\n&lt;p&gt;Try to stop caring so much what she thinks, because what she thinks varies hourly according to how much she is trying to cause drama and hurt you.  Instead of replying to her drama, Just. Stop.  &lt;/p&gt;\n\n&lt;p&gt;Keep your communications breezy and superficial.  Tell her fine, no problem, we&amp;#39;ve already made arrangements when she tells you that you can&amp;#39;t stay with her.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t let her come back.  If she tells you she is coming, tell her No.  Tell her that she didn&amp;#39;t enjoy her trip before, and that you don&amp;#39;t want her back for awhile [never.]  If she already has a plane ticket [favorite trick of moochers and abusers] tell her to change it or sell it to someone else.&lt;/p&gt;\n\n&lt;p&gt;Strengthen your spine.  Unfortunately, there is still a long way to go dealing with her.  It sounds like you don&amp;#39;t have children.  If you do, a grandbaby will be a whole new shitstorm.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgau5di", "score_hidden": false, "stickied": false, "created": 1492302563.0, "created_utc": 1492273763.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65fq2w", "likes": null, "replies": "", "user_reports": [], "id": "dgacvrb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KrytenKoro", "parent_id": "t1_dga7se3", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Pasted from above:\n\n&gt; I'm sorry you feel that way\n\nAll a narcissist will hear in that is the \"Sorry\".\n\nAt best, say \"it sucks that you feel that way\" or \"it's unfortunate you feel that way\".\n\nNever admit fault for something that you didn't do wrong. It doesn't help, they'll just bring it up later with \"but you admitted it was your fault!\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pasted from above:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m sorry you feel that way&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;All a narcissist will hear in that is the &amp;quot;Sorry&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;At best, say &amp;quot;it sucks that you feel that way&amp;quot; or &amp;quot;it&amp;#39;s unfortunate you feel that way&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Never admit fault for something that you didn&amp;#39;t do wrong. It doesn&amp;#39;t help, they&amp;#39;ll just bring it up later with &amp;quot;but you admitted it was your fault!&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgacvrb", "score_hidden": false, "stickied": false, "created": 1492264552.0, "created_utc": 1492235752.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga7se3", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "macimom", "parent_id": "t3_65fq2w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"Im sorry you want to se it that way but you are 100% wrong. As I have told you before my relationship and activities with dad are completely off topic and form now on who you bring them up I am not going to respond.  The ball will remain in your court until you have managed to move on from whatever is upsetting you about dad and are ready to talk to me about something else.\"\n\nShe will fire back something about dad and you and how she is mistreated.\n\nDOnt respond-that ball is non her court.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Im sorry you want to se it that way but you are 100% wrong. As I have told you before my relationship and activities with dad are completely off topic and form now on who you bring them up I am not going to respond.  The ball will remain in your court until you have managed to move on from whatever is upsetting you about dad and are ready to talk to me about something else.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She will fire back something about dad and you and how she is mistreated.&lt;/p&gt;\n\n&lt;p&gt;DOnt respond-that ball is non her court.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga7se3", "score_hidden": false, "stickied": false, "created": 1492255420.0, "created_utc": 1492226620.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]