[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Maybe this would be a better question for a psychologist. Maybe I need some sort of therapy or medication. But I guess random people&amp;#39;s opinion on the internet can&amp;#39;t hurt.&lt;/p&gt;\n\n&lt;p&gt;I was raised in a really strict Christian family. My dad couldn&amp;#39;t take the strictness so he took off when I was very little. My whole life I have always been a weak, scared person and developed terrible anxiety because of my mother&amp;#39;s ridiculous rules and tone when punishing me. I always got in trouble for little things. It amazed me some of the things that other kids could get away with. I know parent&amp;#39;s that took extreme things like teen pregnancy with less anger and disappointment than I would if I got a bad grade on a test.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I was still financially dependent and living in her house until I finished college. Then I moved out and into my own apartment for a few years and just avoided her when it came to doing things she didn&amp;#39;t approve of like smoking weed or getting a tattoo or not being a Republican. I recently got married and bought a house with my husband about 9 months ago.&lt;/p&gt;\n\n&lt;p&gt;Now she is having financial trouble and wants to move in to my freshly purchased home and I don&amp;#39;t want that. My husband says &amp;quot;just tell her no&amp;quot; but it&amp;#39;s hard for me to. I fear how she is going to react. I fear being disowned because I have no other family. It&amp;#39;s like my brain has this built in mode that just tells me &amp;quot;don&amp;#39;t upset your mother&amp;quot; even though there really is no consequence besides upsetting her anymore.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s really upsetting me because she texts me every few days asking me questions about our extra room. My depression and anxiety is getting really bad and I&amp;#39;m starting to have thoughts like I am some sort of broken person who can&amp;#39;t stand up to their mother and I am weak and powerless and she will always control me.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t even know how to start the convo up. I&amp;#39;ve been putting it off and my anxiety and depression just keeps getting worse and worse since I am not facing this issue. It&amp;#39;s hard for me to go about and enjoy anything because it&amp;#39;s either give in and let her stay here or have a big confrontation with yelling, screaming and disowning. People in my family will say really mean things to other members when they mess up.&lt;/p&gt;\n\n&lt;p&gt;tl;dr: I&amp;#39;m an emotional mess and I don&amp;#39;t know how to tell my mom that i don&amp;#39;t want her living in my house with my husband and I because I live a lifestyle she disagrees with.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Maybe this would be a better question for a psychologist. Maybe I need some sort of therapy or medication. But I guess random people's opinion on the internet can't hurt.\n\nI was raised in a really strict Christian family. My dad couldn't take the strictness so he took off when I was very little. My whole life I have always been a weak, scared person and developed terrible anxiety because of my mother's ridiculous rules and tone when punishing me. I always got in trouble for little things. It amazed me some of the things that other kids could get away with. I know parent's that took extreme things like teen pregnancy with less anger and disappointment than I would if I got a bad grade on a test.\n\nAnyway, I was still financially dependent and living in her house until I finished college. Then I moved out and into my own apartment for a few years and just avoided her when it came to doing things she didn't approve of like smoking weed or getting a tattoo or not being a Republican. I recently got married and bought a house with my husband about 9 months ago.\n\nNow she is having financial trouble and wants to move in to my freshly purchased home and I don't want that. My husband says \"just tell her no\" but it's hard for me to. I fear how she is going to react. I fear being disowned because I have no other family. It's like my brain has this built in mode that just tells me \"don't upset your mother\" even though there really is no consequence besides upsetting her anymore.\n\nIt's really upsetting me because she texts me every few days asking me questions about our extra room. My depression and anxiety is getting really bad and I'm starting to have thoughts like I am some sort of broken person who can't stand up to their mother and I am weak and powerless and she will always control me.\n\nI don't even know how to start the convo up. I've been putting it off and my anxiety and depression just keeps getting worse and worse since I am not facing this issue. It's hard for me to go about and enjoy anything because it's either give in and let her stay here or have a big confrontation with yelling, screaming and disowning. People in my family will say really mean things to other members when they mess up.\n\ntl;dr: I'm an emotional mess and I don't know how to tell my mom that i don't want her living in my house with my husband and I because I live a lifestyle she disagrees with.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Non-Romantic", "id": "65gkmu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 212, "report_reasons": null, "author": "100000nopes", "saved": false, "mod_reports": [], "name": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-gn misc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65gkmu/ive_27f_been_conditioned_my_entire_life_to_fear/", "num_reports": null, "locked": false, "stickied": false, "created": 1492248744.0, "url": "https://www.reddit.com/r/relationships/comments/65gkmu/ive_27f_been_conditioned_my_entire_life_to_fear/", "author_flair_text": null, "quarantine": false, "title": "I've [27/F] been conditioned my entire life to fear my mom [50/F] and she is trying to move into my house and I don't know how to tell her no.", "created_utc": 1492219944.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 66, "visited": false, "subreddit_type": "public", "ups": 212}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgatz5g", "gilded": 0, "archived": false, "score": 66, "report_reasons": null, "author": "EvanWasHere", "parent_id": "t1_dgas7ie", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "But that isn't your problem.  \n\nHelp her get a place of her own or help her move into some other relative's home.  Tell her that she needs to pull herself by the bootstraps and stop looking for a handout.\n\nTell her that your house is a weed smoking, Obama voting, gay friendly, and Planned Parenthood supported home.  She just wouldn't want to live there with you.\n\nDo not let her in.  Not even for a month.  She will never ever ever leave.  Your life will be hell. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But that isn&amp;#39;t your problem.  &lt;/p&gt;\n\n&lt;p&gt;Help her get a place of her own or help her move into some other relative&amp;#39;s home.  Tell her that she needs to pull herself by the bootstraps and stop looking for a handout.&lt;/p&gt;\n\n&lt;p&gt;Tell her that your house is a weed smoking, Obama voting, gay friendly, and Planned Parenthood supported home.  She just wouldn&amp;#39;t want to live there with you.&lt;/p&gt;\n\n&lt;p&gt;Do not let her in.  Not even for a month.  She will never ever ever leave.  Your life will be hell. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgatz5g", "score_hidden": false, "stickied": false, "created": 1492302323.0, "created_utc": 1492273523.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 66}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgbk4dd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RAGE-RAGE-RAGE", "parent_id": "t1_dgas7ie", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I was raised the same way. My \"mother\" pulled the same trick several times. Financial difficulties and nowhere to stay. I sent her information for emergency housing through the government which she turned her nose up at and found somewhere else to live easily every single time. \nThis is a power move. \nShe sees you becoming your own person with your own life and she doesn't like it because she's no longer in control. \n\nI swear if you let her move in she will do everything in her power to ruin your marriage. \n\nI know how difficult saying no is... but you have to. This is one of those pivotal moments.  I think you'll find after saying no to this, saying no to more of her requests will be easier. \n\nI agree with the poster who said to frame it as you and your husband having discussed it and decided it's not possible.  \n\nRemember, you don't have to explain yourself to her.  You can walk away,  hang up the phone,  turn off her chat notifications. \n\nYou can do this, I believe in you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was raised the same way. My &amp;quot;mother&amp;quot; pulled the same trick several times. Financial difficulties and nowhere to stay. I sent her information for emergency housing through the government which she turned her nose up at and found somewhere else to live easily every single time. \nThis is a power move. \nShe sees you becoming your own person with your own life and she doesn&amp;#39;t like it because she&amp;#39;s no longer in control. &lt;/p&gt;\n\n&lt;p&gt;I swear if you let her move in she will do everything in her power to ruin your marriage. &lt;/p&gt;\n\n&lt;p&gt;I know how difficult saying no is... but you have to. This is one of those pivotal moments.  I think you&amp;#39;ll find after saying no to this, saying no to more of her requests will be easier. &lt;/p&gt;\n\n&lt;p&gt;I agree with the poster who said to frame it as you and your husband having discussed it and decided it&amp;#39;s not possible.  &lt;/p&gt;\n\n&lt;p&gt;Remember, you don&amp;#39;t have to explain yourself to her.  You can walk away,  hang up the phone,  turn off her chat notifications. &lt;/p&gt;\n\n&lt;p&gt;You can do this, I believe in you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbk4dd", "score_hidden": false, "stickied": false, "created": 1492338900.0, "created_utc": 1492310100.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgas7ie", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "100000nopes", "parent_id": "t1_dgakz8w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "- We don't ever want kids and she knows that. She sees the four bedrooms 2 people thing as a gold mine.\n\n- She really is going through some financial problems. She might even lose her place. So that's where I feel bad. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;We don&amp;#39;t ever want kids and she knows that. She sees the four bedrooms 2 people thing as a gold mine.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;She really is going through some financial problems. She might even lose her place. So that&amp;#39;s where I feel bad. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgas7ie", "score_hidden": false, "stickied": false, "created": 1492299856.0, "created_utc": 1492271056.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakz8w", "gilded": 0, "archived": false, "score": 113, "report_reasons": null, "author": "andrewtater", "parent_id": "t1_dga3bl7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If she moves in, she will not be some absentee roommate, nor the mother you wish you had. She will be the Mussolini you grew up with. Despite it being your house, she will never not see you as *her* daughter, in some way under her authority. Your mother and your husband will clash, and you will be stuck in between.\n\nShe will probably guilt you into trying to let her move in. She may even visit for a \"week\" and just linger for as long as she can get away with. She may use the fact that she had to sacrifice so much, both in time and money, to raise you and put you through college, and now she is not financially secure. And you will have to let her know that although she sacrificed, and you appreciate that, you are not capable of assisting right now. (PS I don't know about statistics, but I've never heard of a MIL moving out on good terms; she'll either get kicked out in a blowout argument or stay until she is 90, and I don't think your new family wants/is ready for either.)\n\nMost importantly, you just got married, and you just bought a home. You should have a few years to enjoy your marriage before you let other people into your home long-term, be it parents or children (unless you want kids right away, in which case she needs to know that you and your husband are thinking about family planning and need some privacy for these decisions and activities).\n\nFinal thought: is she really having financial issues, or is she just trying to prevent the only person in her family from slipping out from under her thumb. There could be genuine concerns that her daughter is abandoning her, like her husband did, but that still doesn't excuse all the authoritarian things she did. I get the feeling that when you say strict, you really want to say verbally and/or physically abusive. I'm not talking about spanking a kid for lying, but slapping a kid for accidentally breaking something and confessing right away. Big difference.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she moves in, she will not be some absentee roommate, nor the mother you wish you had. She will be the Mussolini you grew up with. Despite it being your house, she will never not see you as &lt;em&gt;her&lt;/em&gt; daughter, in some way under her authority. Your mother and your husband will clash, and you will be stuck in between.&lt;/p&gt;\n\n&lt;p&gt;She will probably guilt you into trying to let her move in. She may even visit for a &amp;quot;week&amp;quot; and just linger for as long as she can get away with. She may use the fact that she had to sacrifice so much, both in time and money, to raise you and put you through college, and now she is not financially secure. And you will have to let her know that although she sacrificed, and you appreciate that, you are not capable of assisting right now. (PS I don&amp;#39;t know about statistics, but I&amp;#39;ve never heard of a MIL moving out on good terms; she&amp;#39;ll either get kicked out in a blowout argument or stay until she is 90, and I don&amp;#39;t think your new family wants/is ready for either.)&lt;/p&gt;\n\n&lt;p&gt;Most importantly, you just got married, and you just bought a home. You should have a few years to enjoy your marriage before you let other people into your home long-term, be it parents or children (unless you want kids right away, in which case she needs to know that you and your husband are thinking about family planning and need some privacy for these decisions and activities).&lt;/p&gt;\n\n&lt;p&gt;Final thought: is she really having financial issues, or is she just trying to prevent the only person in her family from slipping out from under her thumb. There could be genuine concerns that her daughter is abandoning her, like her husband did, but that still doesn&amp;#39;t excuse all the authoritarian things she did. I get the feeling that when you say strict, you really want to say verbally and/or physically abusive. I&amp;#39;m not talking about spanking a kid for lying, but slapping a kid for accidentally breaking something and confessing right away. Big difference.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgakz8w", "score_hidden": false, "stickied": false, "created": 1492287256.0, "created_utc": 1492258456.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 113}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dga521t", "gilded": 0, "archived": false, "score": 78, "report_reasons": null, "author": "KatCole7", "parent_id": "t1_dga3bl7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Jumping on here (I 100% agree) OP in trying to get through this in the short term, think through the worst case scinerios and find your resolutions, and you will start to see it's all that anxiety doing the talking. \n\nIt's comparable to being a teenager who was a big crush on a boy. You want to tell him how much you like him. But you have way too much anxiety to do so. Because you don't know what he's going to say. Fear of the unknown. As you get older, you realise it's not as big a deal. The worst consequence is you don't date, when you weren't dating in the first place. \n\nIf you tell your mom no, you don't have to have a confrontation. You don't have to be yelled at, or screamed at. She can try, and you can hang up the phone. If she disowns you, she disowns you. It's still better than her in your house. And you do have family, right next to you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jumping on here (I 100% agree) OP in trying to get through this in the short term, think through the worst case scinerios and find your resolutions, and you will start to see it&amp;#39;s all that anxiety doing the talking. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s comparable to being a teenager who was a big crush on a boy. You want to tell him how much you like him. But you have way too much anxiety to do so. Because you don&amp;#39;t know what he&amp;#39;s going to say. Fear of the unknown. As you get older, you realise it&amp;#39;s not as big a deal. The worst consequence is you don&amp;#39;t date, when you weren&amp;#39;t dating in the first place. &lt;/p&gt;\n\n&lt;p&gt;If you tell your mom no, you don&amp;#39;t have to have a confrontation. You don&amp;#39;t have to be yelled at, or screamed at. She can try, and you can hang up the phone. If she disowns you, she disowns you. It&amp;#39;s still better than her in your house. And you do have family, right next to you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga521t", "score_hidden": false, "stickied": false, "created": 1492251401.0, "created_utc": 1492222601.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 78}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgav85s", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "nomnommish", "parent_id": "t1_dga3bl7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is obviously the right advice but having seen way too many Asian examples, i have a different suggestion.\n\nTalk to your husband, see if he will agree to \"be the bad guy\". Then tell your mom that your husband is dead set against it so she cannot move in.  \n\nThen make it up to your husband for being so super awesome :)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is obviously the right advice but having seen way too many Asian examples, i have a different suggestion.&lt;/p&gt;\n\n&lt;p&gt;Talk to your husband, see if he will agree to &amp;quot;be the bad guy&amp;quot;. Then tell your mom that your husband is dead set against it so she cannot move in.  &lt;/p&gt;\n\n&lt;p&gt;Then make it up to your husband for being so super awesome :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgav85s", "score_hidden": false, "stickied": false, "created": 1492304086.0, "created_utc": 1492275286.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dga3bl7", "gilded": 0, "archived": false, "score": 372, "report_reasons": null, "author": "Pm_me_some_dessert", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You fear being disowned because you don't have any other family,  but you also fear that family... which is worse? Maintaining contact with someone who doesn't know the person you are now (and from the sound of things, probably would be very disapproving if she did know what you've been up to), or forging ahead without her and forming a new family unit with your husband (and, presumably, his family). \n\nYou don't have to give her a reason why you don't want her to stay with you. \"No\" is a complete sentence in this case. \"Husband and I have discussed it and it is not an option\" is another good choice. You are a team and your family life together would be turned upside down if she moved in. \n\nI definitely would recommend therapy to help overcome the emotional burdens you're dealing with, and start dealing with the grief that goes with having such an unsupportive mother. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You fear being disowned because you don&amp;#39;t have any other family,  but you also fear that family... which is worse? Maintaining contact with someone who doesn&amp;#39;t know the person you are now (and from the sound of things, probably would be very disapproving if she did know what you&amp;#39;ve been up to), or forging ahead without her and forming a new family unit with your husband (and, presumably, his family). &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to give her a reason why you don&amp;#39;t want her to stay with you. &amp;quot;No&amp;quot; is a complete sentence in this case. &amp;quot;Husband and I have discussed it and it is not an option&amp;quot; is another good choice. You are a team and your family life together would be turned upside down if she moved in. &lt;/p&gt;\n\n&lt;p&gt;I definitely would recommend therapy to help overcome the emotional burdens you&amp;#39;re dealing with, and start dealing with the grief that goes with having such an unsupportive mother. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga3bl7", "score_hidden": false, "stickied": false, "created": 1492248961.0, "created_utc": 1492220161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 372}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgazawy", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "ReflectingPond", "parent_id": "t1_dga9qhc", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I would also say do not let her stay over, even for one night.  In JustNoMIL we have seen cases where mom is just going to stay \"for the weekend\" and brings boxes and boxes of stuff, then refuses to move out.  It's tons easier to keep her out than move her out.  So not even one night in the guest bedroom.\n\nWith your description of your mother, this is definitely a hill to die on.  She will destroy your marriage if you let her in.\n\nAlso, as a parent myself, you shouldn't feel sorry for her having issues keeping her current place.  I make choices about my finances, and if I screw up and can't afford where I live, it's up to me to find work and move someplace I can afford.  If she hadn't driven her husband away by being so rigid, she'd have an easier time of it.  That was her choice, not yours.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would also say do not let her stay over, even for one night.  In JustNoMIL we have seen cases where mom is just going to stay &amp;quot;for the weekend&amp;quot; and brings boxes and boxes of stuff, then refuses to move out.  It&amp;#39;s tons easier to keep her out than move her out.  So not even one night in the guest bedroom.&lt;/p&gt;\n\n&lt;p&gt;With your description of your mother, this is definitely a hill to die on.  She will destroy your marriage if you let her in.&lt;/p&gt;\n\n&lt;p&gt;Also, as a parent myself, you shouldn&amp;#39;t feel sorry for her having issues keeping her current place.  I make choices about my finances, and if I screw up and can&amp;#39;t afford where I live, it&amp;#39;s up to me to find work and move someplace I can afford.  If she hadn&amp;#39;t driven her husband away by being so rigid, she&amp;#39;d have an easier time of it.  That was her choice, not yours.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgazawy", "score_hidden": false, "stickied": false, "created": 1492309635.0, "created_utc": 1492280835.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dga9qhc", "gilded": 0, "archived": false, "score": 82, "report_reasons": null, "author": "JohnnyJoeyDeeDee", "parent_id": "t1_dga637r", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yep, lean on your husband here. Thats what partners are for, to support us when we need them. Dont throw him under the bus by saying \"Husband wont let you move in' but you can feel more supported in your language by referring to the two of you as a team - 'we arent able to have you move in', 'we arent able to offer the room to you' 'the two of us have decided to live alone' etc. \n\nALthough it wont make much difference to your mum (she will hear what she wants to hear WAH MY KID IS SO MEAN) but in your head you can just lean into the fact you and your husband are a team. \n\nAlso, yeah do it on the phone so you can hang up but then follow up in writing 'sorry we couldnt continue the conversation, i felt we werent getting anywhere. as i said, you wont be moving in. see you soon, love to dad (whatever vague nicety you like).'", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, lean on your husband here. Thats what partners are for, to support us when we need them. Dont throw him under the bus by saying &amp;quot;Husband wont let you move in&amp;#39; but you can feel more supported in your language by referring to the two of you as a team - &amp;#39;we arent able to have you move in&amp;#39;, &amp;#39;we arent able to offer the room to you&amp;#39; &amp;#39;the two of us have decided to live alone&amp;#39; etc. &lt;/p&gt;\n\n&lt;p&gt;ALthough it wont make much difference to your mum (she will hear what she wants to hear WAH MY KID IS SO MEAN) but in your head you can just lean into the fact you and your husband are a team. &lt;/p&gt;\n\n&lt;p&gt;Also, yeah do it on the phone so you can hang up but then follow up in writing &amp;#39;sorry we couldnt continue the conversation, i felt we werent getting anywhere. as i said, you wont be moving in. see you soon, love to dad (whatever vague nicety you like).&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga9qhc", "score_hidden": false, "stickied": false, "created": 1492258605.0, "created_utc": 1492229805.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 82}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dga91sw", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "run_cueca", "parent_id": "t1_dga637r", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yup. Look to your husband's family and your friends as well to make your new family", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup. Look to your husband&amp;#39;s family and your friends as well to make your new family&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga91sw", "score_hidden": false, "stickied": false, "created": 1492257452.0, "created_utc": 1492228652.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 30}}], "after": null, "before": null}}, "user_reports": [], "id": "dga637r", "gilded": 0, "archived": false, "score": 301, "report_reasons": null, "author": "135791357", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I fear being disowned because I have no other family.\n\nYour husband is your family now.\n\n\"Mom, I don't want you to move in with me. You'll need to find another arrangement. This isn't up for discussion. If you can't accept this, I'm hanging up the phone.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I fear being disowned because I have no other family.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your husband is your family now.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Mom, I don&amp;#39;t want you to move in with me. You&amp;#39;ll need to find another arrangement. This isn&amp;#39;t up for discussion. If you can&amp;#39;t accept this, I&amp;#39;m hanging up the phone.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga637r", "score_hidden": false, "stickied": false, "created": 1492252883.0, "created_utc": 1492224083.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 301}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgaa1bu", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "Lady_Stardust-", "parent_id": "t1_dga6bvo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This. You need to say no. Otherwise she will move in and be controlling you all over again. Won't end well at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. You need to say no. Otherwise she will move in and be controlling you all over again. Won&amp;#39;t end well at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaa1bu", "score_hidden": false, "stickied": false, "created": 1492259127.0, "created_utc": 1492230327.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6bvo", "gilded": 0, "archived": false, "score": 116, "report_reasons": null, "author": "pammylorel", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Text: \"Mom, husband and I discussed it and decided that we cannot have you live in our home.\"\nIf she texts you back insults, ignore.\nIf she phones you, pick up but then hang up the moment the abuse starts.\nShe is a sick, controlling woman. Do not feel guilty about having boundaries. Boundaries will save your sanity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Text: &amp;quot;Mom, husband and I discussed it and decided that we cannot have you live in our home.&amp;quot;\nIf she texts you back insults, ignore.\nIf she phones you, pick up but then hang up the moment the abuse starts.\nShe is a sick, controlling woman. Do not feel guilty about having boundaries. Boundaries will save your sanity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga6bvo", "score_hidden": false, "stickied": false, "created": 1492253224.0, "created_utc": 1492224424.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 116}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dga3ao8", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "eshtive353", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You need to set boundaries with your mom. That starts by telling her no. \"No\" is a complete sentence by itself. I would really recommend getting professional help if you're having trouble setting boundaries with your mom. \n\nHonestly, your mom sounds sort of toxic. You should go low contact with her at least, if not cut her off completely. You're a 27 year old independent adult. Your mom should really have no control over your life and if you feel she does, you need to reduce the contact you have with her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to set boundaries with your mom. That starts by telling her no. &amp;quot;No&amp;quot; is a complete sentence by itself. I would really recommend getting professional help if you&amp;#39;re having trouble setting boundaries with your mom. &lt;/p&gt;\n\n&lt;p&gt;Honestly, your mom sounds sort of toxic. You should go low contact with her at least, if not cut her off completely. You&amp;#39;re a 27 year old independent adult. Your mom should really have no control over your life and if you feel she does, you need to reduce the contact you have with her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga3ao8", "score_hidden": false, "stickied": false, "created": 1492248923.0, "created_utc": 1492220123.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 52}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dga5b9q", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "MAXIMUM_FARTING", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It doesn't sound like this person adds anything good to your life.  If anything, getting disowned sounds like a net positive for you.  I suggest you get therapy to work on your self-esteem.  Maybe with your therapist you could draft a letter, email or text message?\n\nIf therapy is off the table... You're going to need to strategise a way out of this.  Her living with you is not an option.  Perhaps you could get your husband to help you draft an email or text message?  Something along the lines of:\n\n\"Hi mum, you can't live with me.  That will not work for me and Husband, you will need to make other arrangements\".\n\nFailing that, if you really can't stand up for yourself after years of what sounds like abuse, I personally don't see why you couldn't take the \"cowardly\" way out and just avoid her until she's sorted something else out for herself.  Stop accepting her calls, refuse to answer the door if she shows up at your house, filter all her emails and social media until you're in a healthy enough place to read them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t sound like this person adds anything good to your life.  If anything, getting disowned sounds like a net positive for you.  I suggest you get therapy to work on your self-esteem.  Maybe with your therapist you could draft a letter, email or text message?&lt;/p&gt;\n\n&lt;p&gt;If therapy is off the table... You&amp;#39;re going to need to strategise a way out of this.  Her living with you is not an option.  Perhaps you could get your husband to help you draft an email or text message?  Something along the lines of:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hi mum, you can&amp;#39;t live with me.  That will not work for me and Husband, you will need to make other arrangements&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Failing that, if you really can&amp;#39;t stand up for yourself after years of what sounds like abuse, I personally don&amp;#39;t see why you couldn&amp;#39;t take the &amp;quot;cowardly&amp;quot; way out and just avoid her until she&amp;#39;s sorted something else out for herself.  Stop accepting her calls, refuse to answer the door if she shows up at your house, filter all her emails and social media until you&amp;#39;re in a healthy enough place to read them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga5b9q", "score_hidden": false, "stickied": false, "created": 1492251782.0, "created_utc": 1492222982.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dga5l01", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "Justcantstandit", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You *have to* get a backbone and tell her no. For yourself and your new family -- your husband. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You &lt;em&gt;have to&lt;/em&gt; get a backbone and tell her no. For yourself and your new family -- your husband. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga5l01", "score_hidden": false, "stickied": false, "created": 1492252173.0, "created_utc": 1492223373.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dga6tv0", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "azaleia", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP, you do have a family who loves and supports you - your husband. He is probably aware of your mother's controlling and possibly abusive tendencies, and the worst-case scenario here is that she moves in, never moves out, and your marriage breaks down because your husband doesn't like seeing you mistreated by someone you can't stand up to, or because your mother tries to use the same techniques on him.\n\nDo not, under any circumstances, let her in; you will never get her out without a big fight. Remember that someone who moves in with you is legally a tenant after a certain number of days, so it could even require you to evict her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, you do have a family who loves and supports you - your husband. He is probably aware of your mother&amp;#39;s controlling and possibly abusive tendencies, and the worst-case scenario here is that she moves in, never moves out, and your marriage breaks down because your husband doesn&amp;#39;t like seeing you mistreated by someone you can&amp;#39;t stand up to, or because your mother tries to use the same techniques on him.&lt;/p&gt;\n\n&lt;p&gt;Do not, under any circumstances, let her in; you will never get her out without a big fight. Remember that someone who moves in with you is legally a tenant after a certain number of days, so it could even require you to evict her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga6tv0", "score_hidden": false, "stickied": false, "created": 1492253949.0, "created_utc": 1492225149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgaat5q", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "wonderlanders", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;I fear how she is going to react. I fear being disowned because I have no other family. \n\nYour husband is your family now. Don't let your mother ruin that because she happens to be related to you. You didn't choose her, she didn't choose you. You and your husband did. Don't put either of you through the trauma that will be living with your narcissistic mother. Lean on him as much as you need to stand up to her, but don't let her move into your home. *She will never leave* and you could very well end up divorced over it. It's *so fucking hard* to live with someone you love when they're subjecting them self to misery and abuse. \n\n&gt;I don't even know how to start the convo up.\n\n\"You can't move in with me and my husband. You will have to make other arrangements. I won't discuss this further because there is nothing to discuss and I will not change my mind. If you bring it up or try to pressure me, I will end the conversation.\"\n\nThen do it. If she brings it up again, don't answer her calls for a week. After a week, tell her that you said it wasn't up for discussion and you meant it. If she brings it up again, it's 2 weeks.\n\nIgnore her calls if you know you'll cave if you talk to her. Get a therapy appointment ASAP because you need validation of your experience with your mom. It makes a HUGE difference and can give you the confidence to stand up to her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I fear how she is going to react. I fear being disowned because I have no other family. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your husband is your family now. Don&amp;#39;t let your mother ruin that because she happens to be related to you. You didn&amp;#39;t choose her, she didn&amp;#39;t choose you. You and your husband did. Don&amp;#39;t put either of you through the trauma that will be living with your narcissistic mother. Lean on him as much as you need to stand up to her, but don&amp;#39;t let her move into your home. &lt;em&gt;She will never leave&lt;/em&gt; and you could very well end up divorced over it. It&amp;#39;s &lt;em&gt;so fucking hard&lt;/em&gt; to live with someone you love when they&amp;#39;re subjecting them self to misery and abuse. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t even know how to start the convo up.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;You can&amp;#39;t move in with me and my husband. You will have to make other arrangements. I won&amp;#39;t discuss this further because there is nothing to discuss and I will not change my mind. If you bring it up or try to pressure me, I will end the conversation.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Then do it. If she brings it up again, don&amp;#39;t answer her calls for a week. After a week, tell her that you said it wasn&amp;#39;t up for discussion and you meant it. If she brings it up again, it&amp;#39;s 2 weeks.&lt;/p&gt;\n\n&lt;p&gt;Ignore her calls if you know you&amp;#39;ll cave if you talk to her. Get a therapy appointment ASAP because you need validation of your experience with your mom. It makes a HUGE difference and can give you the confidence to stand up to her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaat5q", "score_hidden": false, "stickied": false, "created": 1492260479.0, "created_utc": 1492231679.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dganigp", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Floomby", "parent_id": "t1_dga79pi", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "/r/raisedbynarcissists ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/raisedbynarcissists\"&gt;/r/raisedbynarcissists&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dganigp", "score_hidden": false, "stickied": false, "created": 1492292545.0, "created_utc": 1492263745.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dga79pi", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "neverforthefall", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Go and do skme reading on R/raisedbynarcassists and r/justnomil - they'll help you with building a spine and building confidence to set boundaries ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go and do skme reading on R/raisedbynarcassists and &lt;a href=\"/r/justnomil\"&gt;r/justnomil&lt;/a&gt; - they&amp;#39;ll help you with building a spine and building confidence to set boundaries &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga79pi", "score_hidden": false, "stickied": false, "created": 1492254610.0, "created_utc": 1492225810.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 44}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgarptn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cthulhu_Knits", "parent_id": "t1_dgaccon", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This. The mom knows how to push OP's buttons *because she installed them.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. The mom knows how to push OP&amp;#39;s buttons &lt;em&gt;because she installed them.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgarptn", "score_hidden": false, "stickied": false, "created": 1492299162.0, "created_utc": 1492270362.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaccon", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "samesongnewverse", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just an observation - that part of your brain ordering you not to upset your mom? That was programmed by her. That is her voice in your head. The rational part of you is fighting back when you realize there are no actual consequences she can hurt you with if you upset her.\n\nPlease don't bury yourself underneath her whims any longer. You are her child, yes, but having you and raising you was a choice SHE made, and your success as an independent adult is her reward. You don't owe her your life. You don't owe her the little pieces of your soul that die every time you cannot find it in yourself to stand your ground against her.\n\nFind a therapist, stat. It may be the hardest thing you ever do, to tell your mom NO. But you truly, truly must do. And after the first time, it will only get easier.\n\nIf she moves in, your life will never again be your own.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just an observation - that part of your brain ordering you not to upset your mom? That was programmed by her. That is her voice in your head. The rational part of you is fighting back when you realize there are no actual consequences she can hurt you with if you upset her.&lt;/p&gt;\n\n&lt;p&gt;Please don&amp;#39;t bury yourself underneath her whims any longer. You are her child, yes, but having you and raising you was a choice SHE made, and your success as an independent adult is her reward. You don&amp;#39;t owe her your life. You don&amp;#39;t owe her the little pieces of your soul that die every time you cannot find it in yourself to stand your ground against her.&lt;/p&gt;\n\n&lt;p&gt;Find a therapist, stat. It may be the hardest thing you ever do, to tell your mom NO. But you truly, truly must do. And after the first time, it will only get easier.&lt;/p&gt;\n\n&lt;p&gt;If she moves in, your life will never again be your own.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaccon", "score_hidden": false, "stickied": false, "created": 1492263406.0, "created_utc": 1492234606.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dga8ti4", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "georgettaporcupine", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I have a spouse with a parent he is only just now learning to set boundaries with. It is very hard -- which I know from having a parent like that myself. We have been together 20 years and are a good bit older than you are.\n\nYou might need your husband's help setting boundaries. You can practice saying things to him, for example, or see if he will agree to be \"the bad guy\" while you work up to doing things yourself. I am still in \"the bad guy\" role a bit, but my spouse is slowly learning to do this work himself. And he does it for me sometimes, too!  I mean, I still shut down when my father does certain things, like I CANNOT say no to some things sometimes. So he's up at bat sometimes on that end.\n\nLook, it's REALLY HARD.  It's awful. The only way out is to do it, but it's much better with someone on your side, who is willing to help you learn to fight the fight while doing the bits you can't do yet. I hope your husband can be that person for you. \n\n(Also, therapy!)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a spouse with a parent he is only just now learning to set boundaries with. It is very hard -- which I know from having a parent like that myself. We have been together 20 years and are a good bit older than you are.&lt;/p&gt;\n\n&lt;p&gt;You might need your husband&amp;#39;s help setting boundaries. You can practice saying things to him, for example, or see if he will agree to be &amp;quot;the bad guy&amp;quot; while you work up to doing things yourself. I am still in &amp;quot;the bad guy&amp;quot; role a bit, but my spouse is slowly learning to do this work himself. And he does it for me sometimes, too!  I mean, I still shut down when my father does certain things, like I CANNOT say no to some things sometimes. So he&amp;#39;s up at bat sometimes on that end.&lt;/p&gt;\n\n&lt;p&gt;Look, it&amp;#39;s REALLY HARD.  It&amp;#39;s awful. The only way out is to do it, but it&amp;#39;s much better with someone on your side, who is willing to help you learn to fight the fight while doing the bits you can&amp;#39;t do yet. I hope your husband can be that person for you. &lt;/p&gt;\n\n&lt;p&gt;(Also, therapy!)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga8ti4", "score_hidden": false, "stickied": false, "created": 1492257073.0, "created_utc": 1492228273.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dga582j", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "rmric0", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "How would your husband feel if you told your mom \"Husband says no, having you around would really cramp the nudist camp vibe he's been trying to establish. It was hard enough getting him to agree to having blinds.\"\n\nI know that it is going to be hard and painful, but saying no to your mom is the right choice. You can't do anything right by her and having her in your life (and in your home) is going to be far worse then having her give you the silent treatment (at least you'll have your new family to surround you with love and support). And then maybe when she gets tired of being alone, she'll come back on your terms. So start working on those \"no\" muscles.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How would your husband feel if you told your mom &amp;quot;Husband says no, having you around would really cramp the nudist camp vibe he&amp;#39;s been trying to establish. It was hard enough getting him to agree to having blinds.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I know that it is going to be hard and painful, but saying no to your mom is the right choice. You can&amp;#39;t do anything right by her and having her in your life (and in your home) is going to be far worse then having her give you the silent treatment (at least you&amp;#39;ll have your new family to surround you with love and support). And then maybe when she gets tired of being alone, she&amp;#39;ll come back on your terms. So start working on those &amp;quot;no&amp;quot; muscles.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga582j", "score_hidden": false, "stickied": false, "created": 1492251647.0, "created_utc": 1492222847.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dga44lk", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "javanator999", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Tell her no and stick to your guns. This will be scary but it will be much better than having her move in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell her no and stick to your guns. This will be scary but it will be much better than having her move in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga44lk", "score_hidden": false, "stickied": false, "created": 1492250056.0, "created_utc": 1492221256.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgadtd3", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "YesILeftHisAss2398", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You were told over and over that she was what mattered, that her happiness were what mattered, and you didnt. That pleasing her was your primary job. For your entire life. Thats where your anxiety really started. People that grow up like this learn to be very empathetic and people pleasers. They have to, making sure she was happy was how you protected yourself. I can only imagine how much anxiety was driven into high gear. \n\nYou say you are terrified to say no to her. That you dont want to lose her, that shes your only family. I say, who cares? First, you have a Dad. Somewhere. Second, you have a husband, hes your primary family now. Your life together comes heads and tails before pleasing your Mother. Third, what happens if you dont please her? Does the earth stop rotating? No? She gets mad, doesnt she? She wont tolerate you not doing what she wants and putting her before yourself and now even your husband. Why is that? Because she wont allow you to have authority over your own body or to prioritize your own wants and needs over hers. What do you lose if she isnt in your life? Anxiety. Stress. Fear. You do not have to have someone in your life that brings nothing but bad things to it. She isnt owed your devotion for giving birth to you so that you can be her personal audience and fan club. Shes got serious problems. I mean, serious, as in abusive. I know thats a scary word, and many people think that must mean she beat you with belts, but in reality, emotional abuse is just insidious. Its toxic by its very nature and its main purpose is to erode your self esteem, confidence, and ability to trust your own judgement (instead becoming reliant on hers instead-imagine that, how convenient) and you were not permitted to have boundaries to her or defend them. You dont matter to her, your happiness, your well being, of no concern. \n\nIts time to stand up for yourself and your husband. Time to cut her off. Time to get to a therapist to really deal with this. These things are deeply unhealthy and toxic to you and keep you from building healthy aspects and defenses in life. A therapist trained in childhood abuse is going to help you, but its going to take time. You have 27 years of abuse to work through. Start it off by protecting yourself. Cut her off from you. Stop worrying about what she might do if you refuse to do what she wants. She has no real control over you or power over you that you dont give her. Your Husband is your family. She is just cancer. \n\nYou can learn about emotional abuse from sources like raisedbynarcissists on here, thehotline.org, and many other abuse sites you can find with a good google search. Take action. I know its scary, I know it goes against what you were brainwashed to do and be. Its time. This is the only life you get, OP. Make it a good one. Kick her to the curb. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You were told over and over that she was what mattered, that her happiness were what mattered, and you didnt. That pleasing her was your primary job. For your entire life. Thats where your anxiety really started. People that grow up like this learn to be very empathetic and people pleasers. They have to, making sure she was happy was how you protected yourself. I can only imagine how much anxiety was driven into high gear. &lt;/p&gt;\n\n&lt;p&gt;You say you are terrified to say no to her. That you dont want to lose her, that shes your only family. I say, who cares? First, you have a Dad. Somewhere. Second, you have a husband, hes your primary family now. Your life together comes heads and tails before pleasing your Mother. Third, what happens if you dont please her? Does the earth stop rotating? No? She gets mad, doesnt she? She wont tolerate you not doing what she wants and putting her before yourself and now even your husband. Why is that? Because she wont allow you to have authority over your own body or to prioritize your own wants and needs over hers. What do you lose if she isnt in your life? Anxiety. Stress. Fear. You do not have to have someone in your life that brings nothing but bad things to it. She isnt owed your devotion for giving birth to you so that you can be her personal audience and fan club. Shes got serious problems. I mean, serious, as in abusive. I know thats a scary word, and many people think that must mean she beat you with belts, but in reality, emotional abuse is just insidious. Its toxic by its very nature and its main purpose is to erode your self esteem, confidence, and ability to trust your own judgement (instead becoming reliant on hers instead-imagine that, how convenient) and you were not permitted to have boundaries to her or defend them. You dont matter to her, your happiness, your well being, of no concern. &lt;/p&gt;\n\n&lt;p&gt;Its time to stand up for yourself and your husband. Time to cut her off. Time to get to a therapist to really deal with this. These things are deeply unhealthy and toxic to you and keep you from building healthy aspects and defenses in life. A therapist trained in childhood abuse is going to help you, but its going to take time. You have 27 years of abuse to work through. Start it off by protecting yourself. Cut her off from you. Stop worrying about what she might do if you refuse to do what she wants. She has no real control over you or power over you that you dont give her. Your Husband is your family. She is just cancer. &lt;/p&gt;\n\n&lt;p&gt;You can learn about emotional abuse from sources like raisedbynarcissists on here, thehotline.org, and many other abuse sites you can find with a good google search. Take action. I know its scary, I know it goes against what you were brainwashed to do and be. Its time. This is the only life you get, OP. Make it a good one. Kick her to the curb. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgadtd3", "score_hidden": false, "stickied": false, "created": 1492266624.0, "created_utc": 1492237824.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgafo48", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "mrsmoose1234", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your distress at saying no to your mother comes from a real place. When you were a child, being disowned would have threatened your survival. No wonder you feel terrified about her disowning you. But that response is no longer necessary to keep you alive. You're an adult who can support herself. You can put the fear aside long enough to send a firm text. Once the dust has cleared you'll realise that you are still here, you're fine and you're free.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your distress at saying no to your mother comes from a real place. When you were a child, being disowned would have threatened your survival. No wonder you feel terrified about her disowning you. But that response is no longer necessary to keep you alive. You&amp;#39;re an adult who can support herself. You can put the fear aside long enough to send a firm text. Once the dust has cleared you&amp;#39;ll realise that you are still here, you&amp;#39;re fine and you&amp;#39;re free.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgafo48", "score_hidden": false, "stickied": false, "created": 1492271369.0, "created_utc": 1492242569.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dga5uct", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "kurtcanine", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Stick to your guns, and ask your husband to support your decision. When manipulative people lose power over the people they control, they'll do and say whatever it takes to get back into that position of power. If you let her in, it will be much harder to get her to be financially independent. Besides, you've mentioned anxiety, and your own mental health should be a priority. Besides, you're an adult, so no one, including her, can force you to endure the screaming. If she disowns you, she clearly didn't need you as badly as she says, and just wants to be in your business.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stick to your guns, and ask your husband to support your decision. When manipulative people lose power over the people they control, they&amp;#39;ll do and say whatever it takes to get back into that position of power. If you let her in, it will be much harder to get her to be financially independent. Besides, you&amp;#39;ve mentioned anxiety, and your own mental health should be a priority. Besides, you&amp;#39;re an adult, so no one, including her, can force you to endure the screaming. If she disowns you, she clearly didn&amp;#39;t need you as badly as she says, and just wants to be in your business.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga5uct", "score_hidden": false, "stickied": false, "created": 1492252532.0, "created_utc": 1492223732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgbjm0x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AvoidantSucker", "parent_id": "t1_dgah3go", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "the book \"Nice girl syndrome\" by Beverly Engel is amazing ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the book &amp;quot;Nice girl syndrome&amp;quot; by Beverly Engel is amazing &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbjm0x", "score_hidden": false, "stickied": false, "created": 1492338135.0, "created_utc": 1492309335.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgah3go", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Unclecavemanwasabear", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "As someone with a similar parental relationship, therapy 100% works. Specifically Cognitive Behavioral Therapy.\n\nEven if you can't afford to see a therapist, Google some CBT techniques and books. It's not magic; there are specific techniques and exercises that reinforce better thinking patterns and help manage the negative ones we've been conditioned with for years. It helps immensely with anxiety and self-worth issues, which in turn make it easier to enforce boundaries.\n\nGood luck!\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone with a similar parental relationship, therapy 100% works. Specifically Cognitive Behavioral Therapy.&lt;/p&gt;\n\n&lt;p&gt;Even if you can&amp;#39;t afford to see a therapist, Google some CBT techniques and books. It&amp;#39;s not magic; there are specific techniques and exercises that reinforce better thinking patterns and help manage the negative ones we&amp;#39;ve been conditioned with for years. It helps immensely with anxiety and self-worth issues, which in turn make it easier to enforce boundaries.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgah3go", "score_hidden": false, "stickied": false, "created": 1492275636.0, "created_utc": 1492246836.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgal5mn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "LustfulGumby", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You have a husband so you DO have other family.\n\nYour fear is overwhelming all logic. This relationship does NOTHING for you. Your mother gets mad at you...and what? She hurls some words at you? Words you can ignore? Walk away from?\n\nPlease consider seeing a therapist to deal with the trauma of your childhood.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have a husband so you DO have other family.&lt;/p&gt;\n\n&lt;p&gt;Your fear is overwhelming all logic. This relationship does NOTHING for you. Your mother gets mad at you...and what? She hurls some words at you? Words you can ignore? Walk away from?&lt;/p&gt;\n\n&lt;p&gt;Please consider seeing a therapist to deal with the trauma of your childhood.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgal5mn", "score_hidden": false, "stickied": false, "created": 1492287680.0, "created_utc": 1492258880.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgal7i6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tree_hugging_hippie", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP, both my parents were like yours.  My dad wasn't as bad as my mom and seemed to take his cues from her sometimes, but it was rough growing up.  Even now if one of them raises their voice I flinch and my heart rate and anxiety go crazy, and I'm 34.  I totally get where you're at.\n\nFirst and foremost, you need to be in therapy.  Second of all, think hard about how you're feeling about this situation right now.  Think about how you would feel telling her she can't move in, versus how you would feel if she was living with you.  Right now, you can tell her no and hang up the phone if she gets nasty.  If she lives with you, she'll be soooo much harder to get rid of on top of dealing with the damage to your emotional/mental health. Would you rather deal with a really uncomfortable phone call followed by the immense satisfaction of hanging up on your mom (I've always wanted an excuse to do that) and potential hang-ups in the future, or would you rather deal with abject misery, more guilt, and an eviction process?\n\nIf you ever want to bitch about having awful parents and have a good cry, let me know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, both my parents were like yours.  My dad wasn&amp;#39;t as bad as my mom and seemed to take his cues from her sometimes, but it was rough growing up.  Even now if one of them raises their voice I flinch and my heart rate and anxiety go crazy, and I&amp;#39;m 34.  I totally get where you&amp;#39;re at.&lt;/p&gt;\n\n&lt;p&gt;First and foremost, you need to be in therapy.  Second of all, think hard about how you&amp;#39;re feeling about this situation right now.  Think about how you would feel telling her she can&amp;#39;t move in, versus how you would feel if she was living with you.  Right now, you can tell her no and hang up the phone if she gets nasty.  If she lives with you, she&amp;#39;ll be soooo much harder to get rid of on top of dealing with the damage to your emotional/mental health. Would you rather deal with a really uncomfortable phone call followed by the immense satisfaction of hanging up on your mom (I&amp;#39;ve always wanted an excuse to do that) and potential hang-ups in the future, or would you rather deal with abject misery, more guilt, and an eviction process?&lt;/p&gt;\n\n&lt;p&gt;If you ever want to bitch about having awful parents and have a good cry, let me know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgal7i6", "score_hidden": false, "stickied": false, "created": 1492287808.0, "created_utc": 1492259008.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgal9yg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "kurlygirl", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I have a mother with very similar tendencies. Her crazy finally reached my cutoff point when I was 34. I wish I had cut her off when I was 18. The sooner the better. I actually couldn't do it face to face or on the phone. I wrote her an email. It would be totally OK for you to text her or email her and be VERY direct. It will be super uncomfortable and unfamiliar for you. I still have a fear of her 10 years later (still no contact). You definitely need therapy to undo the psychological torment she has put you through. I wouldn't have been able to stand firm against her without it. For now, just a short, \"Mom, you are not going to move into my home.\" No JADE - justifying, arguing, defending, explaining. Just tell her and repeat as necessary. Don't try to reason with her because she is a bully and will only use that to draw you in more. The sooner you do this, the better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a mother with very similar tendencies. Her crazy finally reached my cutoff point when I was 34. I wish I had cut her off when I was 18. The sooner the better. I actually couldn&amp;#39;t do it face to face or on the phone. I wrote her an email. It would be totally OK for you to text her or email her and be VERY direct. It will be super uncomfortable and unfamiliar for you. I still have a fear of her 10 years later (still no contact). You definitely need therapy to undo the psychological torment she has put you through. I wouldn&amp;#39;t have been able to stand firm against her without it. For now, just a short, &amp;quot;Mom, you are not going to move into my home.&amp;quot; No JADE - justifying, arguing, defending, explaining. Just tell her and repeat as necessary. Don&amp;#39;t try to reason with her because she is a bully and will only use that to draw you in more. The sooner you do this, the better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgal9yg", "score_hidden": false, "stickied": false, "created": 1492287974.0, "created_utc": 1492259174.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgaaytp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JohnnyJoeyDeeDee", "parent_id": "t1_dgaa7ln", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Oh no, if OP wants to, go for it! Just shouldnt feel obliged to give a reason, especially such a nebulous and easily-debatable one as 'emotions'.  People can be jerks about anxiety.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh no, if OP wants to, go for it! Just shouldnt feel obliged to give a reason, especially such a nebulous and easily-debatable one as &amp;#39;emotions&amp;#39;.  People can be jerks about anxiety.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaaytp", "score_hidden": false, "stickied": false, "created": 1492260751.0, "created_utc": 1492231951.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaa7ln", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "adjuventor", "parent_id": "t1_dga9wfq", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP's emotions only matter if it feels cathartic to express herself that fully as she clears her conscious with her mother. She doesn't have to debate it. She shouldn't in my opinion. I don't believe there is harm in saying if it helps OP. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP&amp;#39;s emotions only matter if it feels cathartic to express herself that fully as she clears her conscious with her mother. She doesn&amp;#39;t have to debate it. She shouldn&amp;#39;t in my opinion. I don&amp;#39;t believe there is harm in saying if it helps OP. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaa7ln", "score_hidden": false, "stickied": false, "created": 1492259433.0, "created_utc": 1492230633.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga9wfq", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "JohnnyJoeyDeeDee", "parent_id": "t1_dga3px2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I probably wouldnt say that mum makes her feel anxious, then mum might get some satisfaction, or even turn the screws tighter.  She could also argue 'oh dont be silly, you wont know i'm there!' 'how could I make you feel anxious! I'm your mother!' or even just say its silly to feel anxious which is not helpful when it sounds like OP has been made to feel weak and stupid her/his whole life.\n\nLeave emotion out, and just state the situation - 'no, that wont be happening, actually.' The OPs emotions are not mums business.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I probably wouldnt say that mum makes her feel anxious, then mum might get some satisfaction, or even turn the screws tighter.  She could also argue &amp;#39;oh dont be silly, you wont know i&amp;#39;m there!&amp;#39; &amp;#39;how could I make you feel anxious! I&amp;#39;m your mother!&amp;#39; or even just say its silly to feel anxious which is not helpful when it sounds like OP has been made to feel weak and stupid her/his whole life.&lt;/p&gt;\n\n&lt;p&gt;Leave emotion out, and just state the situation - &amp;#39;no, that wont be happening, actually.&amp;#39; The OPs emotions are not mums business.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga9wfq", "score_hidden": false, "stickied": false, "created": 1492258890.0, "created_utc": 1492230090.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dga3px2", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "adjuventor", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You are correct in identifying that you're having a difficult time saying no and letting the issue fester is what's causing you the most agony. I think expressing yourself to your mother the way you have in this post would be sufficient. It's the truth. \n\nYou tell her no, it's not going to work. (Doesn't really matter why, It's not your responsibility to explain yourself to her or have a \"good enough\" reason.) You tell her that you feel anxious around her due to x,y,z events from your past and that you're unable to host her. She's not going to like it. She may say awful things and it might make you second guess yourself but ultimately, it's YOUR life. Don't spend another moment trying to please or tip-toe around her just because she gave birth to you. Any decent mother would be trying really hard to give you your space with your husband. She's jealous. She'll have to get over it and be the adult she expected you to be as a child. \n\nI'm going through something similar with my mother so I totally understand. Let your husband help guide you through this. He has your best interests in mind and can help you remain objective. Good luck. Don't let the guilt get to you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are correct in identifying that you&amp;#39;re having a difficult time saying no and letting the issue fester is what&amp;#39;s causing you the most agony. I think expressing yourself to your mother the way you have in this post would be sufficient. It&amp;#39;s the truth. &lt;/p&gt;\n\n&lt;p&gt;You tell her no, it&amp;#39;s not going to work. (Doesn&amp;#39;t really matter why, It&amp;#39;s not your responsibility to explain yourself to her or have a &amp;quot;good enough&amp;quot; reason.) You tell her that you feel anxious around her due to x,y,z events from your past and that you&amp;#39;re unable to host her. She&amp;#39;s not going to like it. She may say awful things and it might make you second guess yourself but ultimately, it&amp;#39;s YOUR life. Don&amp;#39;t spend another moment trying to please or tip-toe around her just because she gave birth to you. Any decent mother would be trying really hard to give you your space with your husband. She&amp;#39;s jealous. She&amp;#39;ll have to get over it and be the adult she expected you to be as a child. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going through something similar with my mother so I totally understand. Let your husband help guide you through this. He has your best interests in mind and can help you remain objective. Good luck. Don&amp;#39;t let the guilt get to you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga3px2", "score_hidden": false, "stickied": false, "created": 1492249497.0, "created_utc": 1492220697.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgadfuw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DirtyBoots_1990", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Text her, email her, write a letter. Get it in writing somehow so you have proof. \n\nJust send a simple message: \"You are not moving into my home.\"\n\nOr any of the other suggestions. \n\nBreath. Meditate, try some yoga. Ignore phone calls and repeat saying no to her in messages/emails. With anxiety, it will be easier to communicate through messages. Avoid phone calls if you can. \n\nPlus it gives you a record of repeatedly telling her no. \n\nIf your husband is willing, maybe he can tell her no, this time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Text her, email her, write a letter. Get it in writing somehow so you have proof. &lt;/p&gt;\n\n&lt;p&gt;Just send a simple message: &amp;quot;You are not moving into my home.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Or any of the other suggestions. &lt;/p&gt;\n\n&lt;p&gt;Breath. Meditate, try some yoga. Ignore phone calls and repeat saying no to her in messages/emails. With anxiety, it will be easier to communicate through messages. Avoid phone calls if you can. &lt;/p&gt;\n\n&lt;p&gt;Plus it gives you a record of repeatedly telling her no. &lt;/p&gt;\n\n&lt;p&gt;If your husband is willing, maybe he can tell her no, this time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgadfuw", "score_hidden": false, "stickied": false, "created": 1492265774.0, "created_utc": 1492236974.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgab5v0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WiccanWitchOfTheWest", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You have everything to gain by standing up for yourself to your mother. No matter what you do she will be hurt. Doesn't she claim that she is already hurt? Nothing that you can do will help her. It will never be enough for her. I Know this from experience. What you can do is set firm healthy boundaries for yourself. Have your husband help to support you in upholding those boundaries. Let her have her tantrum, but you don't have to stick around for it. You can literally tell her, as I told my mother years ago, \"this type of communication is not healthy and if it comes to that, this conversation will end\". Then when she was in the middle of whatever diatribe she was trying to throw at me, I would say \"I love you Mom\". And then I would hang up the phone. And the first few dozen times after I hung up the phone, I sat and cried. But having that release, taking a stand for myself, really truly being able to enforce those healthy boundaries really made a difference in my life. And now we have a much better relationship. It took a few years to come, but now we have a healthier relationship :-) best of luck to you &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have everything to gain by standing up for yourself to your mother. No matter what you do she will be hurt. Doesn&amp;#39;t she claim that she is already hurt? Nothing that you can do will help her. It will never be enough for her. I Know this from experience. What you can do is set firm healthy boundaries for yourself. Have your husband help to support you in upholding those boundaries. Let her have her tantrum, but you don&amp;#39;t have to stick around for it. You can literally tell her, as I told my mother years ago, &amp;quot;this type of communication is not healthy and if it comes to that, this conversation will end&amp;quot;. Then when she was in the middle of whatever diatribe she was trying to throw at me, I would say &amp;quot;I love you Mom&amp;quot;. And then I would hang up the phone. And the first few dozen times after I hung up the phone, I sat and cried. But having that release, taking a stand for myself, really truly being able to enforce those healthy boundaries really made a difference in my life. And now we have a much better relationship. It took a few years to come, but now we have a healthier relationship :-) best of luck to you &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgab5v0", "score_hidden": false, "stickied": false, "created": 1492261106.0, "created_utc": 1492232306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgane23", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "muffbomb", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You and I are similar about our mothers.  Although my mother is a narcissist and drunk. I could never say no because she made me so anxious.\n\nAfter I got married and she started with her crazy nonsense demands, I just started saying \"well I need to talk to Jared about this first.\" \n\nI'd wait a couple of days, and then make the conversation. By a couple of days she's pretty much aware it's a no go, and I confirm it with the conversation.\n\nI understand this is passive aggressive and I don't care lol it works for me. Maybe it might help you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You and I are similar about our mothers.  Although my mother is a narcissist and drunk. I could never say no because she made me so anxious.&lt;/p&gt;\n\n&lt;p&gt;After I got married and she started with her crazy nonsense demands, I just started saying &amp;quot;well I need to talk to Jared about this first.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d wait a couple of days, and then make the conversation. By a couple of days she&amp;#39;s pretty much aware it&amp;#39;s a no go, and I confirm it with the conversation.&lt;/p&gt;\n\n&lt;p&gt;I understand this is passive aggressive and I don&amp;#39;t care lol it works for me. Maybe it might help you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgane23", "score_hidden": false, "stickied": false, "created": 1492292314.0, "created_utc": 1492263514.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgao3pe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "feelsanddreams", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "you do have other family. Your husbands family.\n\nA lot of people seem to forget when you get married you join 2 families together. Your husbands family will have your back if you fall out with your mother.\n\nIMO you need to put your foot down and flat out tell her no its not happening and if it does she lives under your rule and if she protests shes out the door. That being said if your mother hates you for it then that is on her and not you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you do have other family. Your husbands family.&lt;/p&gt;\n\n&lt;p&gt;A lot of people seem to forget when you get married you join 2 families together. Your husbands family will have your back if you fall out with your mother.&lt;/p&gt;\n\n&lt;p&gt;IMO you need to put your foot down and flat out tell her no its not happening and if it does she lives under your rule and if she protests shes out the door. That being said if your mother hates you for it then that is on her and not you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgao3pe", "score_hidden": false, "stickied": false, "created": 1492293605.0, "created_utc": 1492264805.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgaolvo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SharkWeekJunkie", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;I don't even know how to start the convo up.\n\n\nText: \"Hey mom. I've put a lot of thought into this, and I'm afraid I'm not going to be able to let you move in with Husband and me. What are you doing for Easter?\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t even know how to start the convo up.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Text: &amp;quot;Hey mom. I&amp;#39;ve put a lot of thought into this, and I&amp;#39;m afraid I&amp;#39;m not going to be able to let you move in with Husband and me. What are you doing for Easter?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaolvo", "score_hidden": false, "stickied": false, "created": 1492294460.0, "created_utc": 1492265660.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgarbvs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "royalic", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Throw the Bible back at her, you've left your parents to cling to your husband.  If she wanted a daughter to live with then she should have had a son who married a girl called Naomi who'd stick by her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Throw the Bible back at her, you&amp;#39;ve left your parents to cling to your husband.  If she wanted a daughter to live with then she should have had a son who married a girl called Naomi who&amp;#39;d stick by her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgarbvs", "score_hidden": false, "stickied": false, "created": 1492298616.0, "created_utc": 1492269816.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgasold", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "illithid66", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You can take a small piece of paper and say you are quoting u\\Illithid66 \"No.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can take a small piece of paper and say you are quoting u\\Illithid66 &amp;quot;No.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgasold", "score_hidden": false, "stickied": false, "created": 1492300526.0, "created_utc": 1492271726.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgatm9g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dweebgirl", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Perhaps as a baby steps you could set her phone number to \"ignore\" or \"block\" on your phone. Then after a day or two, or whenever you're ready you could undo it and see what messages she sent. It would allow you to not feel anxious all the time from her guilt tripping texts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perhaps as a baby steps you could set her phone number to &amp;quot;ignore&amp;quot; or &amp;quot;block&amp;quot; on your phone. Then after a day or two, or whenever you&amp;#39;re ready you could undo it and see what messages she sent. It would allow you to not feel anxious all the time from her guilt tripping texts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgatm9g", "score_hidden": false, "stickied": false, "created": 1492301821.0, "created_utc": 1492273021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgav87v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "helendestroy", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Honestly, if you can't manage to tell your mother no but want to, ask your husband to. \n\nGenerally it's best to let the children deal with the parent, but in this case, I think you can ask your hubby to be the \"bad guy\" while you're still working up to it. Are you in therapy/councelling?\n\n&gt;I fear being disowned because I have no other family\n\nYour husband is your family.\n\n", "edited": 1492275476.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, if you can&amp;#39;t manage to tell your mother no but want to, ask your husband to. &lt;/p&gt;\n\n&lt;p&gt;Generally it&amp;#39;s best to let the children deal with the parent, but in this case, I think you can ask your hubby to be the &amp;quot;bad guy&amp;quot; while you&amp;#39;re still working up to it. Are you in therapy/councelling?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I fear being disowned because I have no other family&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your husband is your family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgav87v", "score_hidden": false, "stickied": false, "created": 1492304088.0, "created_utc": 1492275288.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgavfm7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "redshoewearer", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "IF you let her into your house, she becomes a resident/tenant, and it is very difficult legally to make someone leave if they are considered a tenant.  \n\nMaybe you don't have to start a conversation - just stonewall and don't take the bait when she talks about moving in.  Ignore the texts. If necessary, block her. Tell her you have other plans for the rooms (Airbnb to help pay down your mortgage?), whether you do or not.\n\nI'm a mother with a child this age and I wouldn't treat a child this way. It is just plain wrong. You have the right to live your life as you see fit. She is the past, you are the future.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IF you let her into your house, she becomes a resident/tenant, and it is very difficult legally to make someone leave if they are considered a tenant.  &lt;/p&gt;\n\n&lt;p&gt;Maybe you don&amp;#39;t have to start a conversation - just stonewall and don&amp;#39;t take the bait when she talks about moving in.  Ignore the texts. If necessary, block her. Tell her you have other plans for the rooms (Airbnb to help pay down your mortgage?), whether you do or not.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a mother with a child this age and I wouldn&amp;#39;t treat a child this way. It is just plain wrong. You have the right to live your life as you see fit. She is the past, you are the future.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgavfm7", "score_hidden": false, "stickied": false, "created": 1492304368.0, "created_utc": 1492275568.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgbibw4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nblackhand", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Can you write her an email? You could sit down with your husband and have him help you write it - don't be afraid to ask him for help, that's what family is actually for, helping each other, not scaring them - and it might be lower-stress than trying to text her or talk to her in real time. \n\nIf she calls or texts you in response, just ignore her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you write her an email? You could sit down with your husband and have him help you write it - don&amp;#39;t be afraid to ask him for help, that&amp;#39;s what family is actually for, helping each other, not scaring them - and it might be lower-stress than trying to text her or talk to her in real time. &lt;/p&gt;\n\n&lt;p&gt;If she calls or texts you in response, just ignore her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbibw4", "score_hidden": false, "stickied": false, "created": 1492336238.0, "created_utc": 1492307438.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgad793", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MrEcke", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You might also want to check out /r/raisedbynarcissists/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might also want to check out &lt;a href=\"/r/raisedbynarcissists/\"&gt;/r/raisedbynarcissists/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgad793", "score_hidden": false, "stickied": false, "created": 1492265247.0, "created_utc": 1492236447.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgacutg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TexasNorthWest", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Normally I would say, your family, your problem - you be the one to deal with your mom.\n\nBut it sounds like if you tried to stand up to her, you would have your mom moving in by the end of this week.\n\nSo if saying, \"Sorry mom, but that extra room is unavailable.\" isn't working for you, please see if you can tag team your husband in to help you out. Otherwise he might have his MIL moving in by the end of this week. \n\nAlso, don't be afraid to be the black sheep and cut them out of your life. It's extremely liberating! What do they honestly bring to the table?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Normally I would say, your family, your problem - you be the one to deal with your mom.&lt;/p&gt;\n\n&lt;p&gt;But it sounds like if you tried to stand up to her, you would have your mom moving in by the end of this week.&lt;/p&gt;\n\n&lt;p&gt;So if saying, &amp;quot;Sorry mom, but that extra room is unavailable.&amp;quot; isn&amp;#39;t working for you, please see if you can tag team your husband in to help you out. Otherwise he might have his MIL moving in by the end of this week. &lt;/p&gt;\n\n&lt;p&gt;Also, don&amp;#39;t be afraid to be the black sheep and cut them out of your life. It&amp;#39;s extremely liberating! What do they honestly bring to the table?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgacutg", "score_hidden": false, "stickied": false, "created": 1492264497.0, "created_utc": 1492235697.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgafydg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "futurecrazycatlady", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It will be hard and there's not a right way to do it. If your mother is going to explode, she's going to do that no matter how you word it.\n\nBut try to think about it this way, it's either telling her 'no' now, or having to deal with her living in your home which would mean hundreds of times telling her 'no', or wishing that you knew how to. \n\nIf she starts screaming at you over the phone, you can hang up on her, if she's living with you it's much harder to get away from the abuse.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It will be hard and there&amp;#39;s not a right way to do it. If your mother is going to explode, she&amp;#39;s going to do that no matter how you word it.&lt;/p&gt;\n\n&lt;p&gt;But try to think about it this way, it&amp;#39;s either telling her &amp;#39;no&amp;#39; now, or having to deal with her living in your home which would mean hundreds of times telling her &amp;#39;no&amp;#39;, or wishing that you knew how to. &lt;/p&gt;\n\n&lt;p&gt;If she starts screaming at you over the phone, you can hang up on her, if she&amp;#39;s living with you it&amp;#39;s much harder to get away from the abuse.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgafydg", "score_hidden": false, "stickied": false, "created": 1492272157.0, "created_utc": 1492243357.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgancm0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThreatLevel2400", "parent_id": "t1_dgak82s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This. I have no issue being the heavy for my wife if she wants me to. Generally the blood relation should handle stuff like this but in this case it might be helpful for OP to let hubby go attack dog if mom oversteps boundaries. \n\nLong term, OP needs to learn how to stick up to her mother.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. I have no issue being the heavy for my wife if she wants me to. Generally the blood relation should handle stuff like this but in this case it might be helpful for OP to let hubby go attack dog if mom oversteps boundaries. &lt;/p&gt;\n\n&lt;p&gt;Long term, OP needs to learn how to stick up to her mother.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgancm0", "score_hidden": false, "stickied": false, "created": 1492292241.0, "created_utc": 1492263441.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgak82s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Namsonite", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Agree to a plan with your husband, go together, you do the talking. But setup a backup, if she tries to take over the conversation or she gets overbearing he steps in and reinforces what you said. Then get up and leave the house. Mention that it's no longer up for discussion and If it comes up, you guys won't be in contact for x amount of time. \n\nUsually people will say it's your mom so your problem and while I generally agree, sometimes you need the support someone doesn't have history with that family member.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agree to a plan with your husband, go together, you do the talking. But setup a backup, if she tries to take over the conversation or she gets overbearing he steps in and reinforces what you said. Then get up and leave the house. Mention that it&amp;#39;s no longer up for discussion and If it comes up, you guys won&amp;#39;t be in contact for x amount of time. &lt;/p&gt;\n\n&lt;p&gt;Usually people will say it&amp;#39;s your mom so your problem and while I generally agree, sometimes you need the support someone doesn&amp;#39;t have history with that family member.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgak82s", "score_hidden": false, "stickied": false, "created": 1492285337.0, "created_utc": 1492256537.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dganvzj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "YouCantSaveEveryone", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You have nothing to lose by saying no. And everything to lose by saying yes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have nothing to lose by saying no. And everything to lose by saying yes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dganvzj", "score_hidden": false, "stickied": false, "created": 1492293226.0, "created_utc": 1492264426.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dganzzm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SurvivingMissPrism", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "When you got married, your immediate family moved from \"mother and I\" to \"husband and I\".\n\nYour husband is your immediate, most important family. Your mother is now extended family, and extended \"family\" that did a great deal of harm.\n\nDo see a therapist if you can afford to. Look into Inner Child Work and Reparentification. Read \"Will I ever be good enough\".\n\nDo NOT let her move in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you got married, your immediate family moved from &amp;quot;mother and I&amp;quot; to &amp;quot;husband and I&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Your husband is your immediate, most important family. Your mother is now extended family, and extended &amp;quot;family&amp;quot; that did a great deal of harm.&lt;/p&gt;\n\n&lt;p&gt;Do see a therapist if you can afford to. Look into Inner Child Work and Reparentification. Read &amp;quot;Will I ever be good enough&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Do NOT let her move in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dganzzm", "score_hidden": false, "stickied": false, "created": 1492293425.0, "created_utc": 1492264625.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgaro9u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "froghero2", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So you may think getting disowned is the worst think that could happen, but being indecisive and letting her in is another decision that you choose by default. Let's see the other possible outcomes if you let her in:\n\n* Your husband becomes stressed with your mother disrupting the dynamic. By becoming a door mat you make no effort to respect your husband when he complains because it's comfortable to agree to your mother. You pick her, and he leaves you\n* You let her in, she discovers all your habit. She won't leave, but disowns you anyway by complaining about your behaviour to your family. You can't get rid of her and she makes your life a living hell. You let your husband kick her out and solve your problem, making him the 'bad' guy. He loses some respect for you\n\nNot that I'm saying these will happen, but don't they sound like worse possibilities than getting disowned now? Change your mentality from \"I don't want to get disowned or look bad to her\" to \"Who cares if she disownes me, I need to protect my husband and my new family\". Besides, what's so bad if she get's angry and stop sending you texts? Her talking to you is giving you anxiety, it's a treat that she's willing to stop harrassing you\n\nAsk help from your husband and friends if you want to prepare a script to tell her so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you may think getting disowned is the worst think that could happen, but being indecisive and letting her in is another decision that you choose by default. Let&amp;#39;s see the other possible outcomes if you let her in:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Your husband becomes stressed with your mother disrupting the dynamic. By becoming a door mat you make no effort to respect your husband when he complains because it&amp;#39;s comfortable to agree to your mother. You pick her, and he leaves you&lt;/li&gt;\n&lt;li&gt;You let her in, she discovers all your habit. She won&amp;#39;t leave, but disowns you anyway by complaining about your behaviour to your family. You can&amp;#39;t get rid of her and she makes your life a living hell. You let your husband kick her out and solve your problem, making him the &amp;#39;bad&amp;#39; guy. He loses some respect for you&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Not that I&amp;#39;m saying these will happen, but don&amp;#39;t they sound like worse possibilities than getting disowned now? Change your mentality from &amp;quot;I don&amp;#39;t want to get disowned or look bad to her&amp;quot; to &amp;quot;Who cares if she disownes me, I need to protect my husband and my new family&amp;quot;. Besides, what&amp;#39;s so bad if she get&amp;#39;s angry and stop sending you texts? Her talking to you is giving you anxiety, it&amp;#39;s a treat that she&amp;#39;s willing to stop harrassing you&lt;/p&gt;\n\n&lt;p&gt;Ask help from your husband and friends if you want to prepare a script to tell her so.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaro9u", "score_hidden": false, "stickied": false, "created": 1492299104.0, "created_utc": 1492270304.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgasrrq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tatregretthrow", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your husband is your family now. Usually I say each person should handle their own parents, but in cases like yours where you've been conditioned to be subservient to that parent it may be a good idea to have your husband be the bad guy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your husband is your family now. Usually I say each person should handle their own parents, but in cases like yours where you&amp;#39;ve been conditioned to be subservient to that parent it may be a good idea to have your husband be the bad guy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgasrrq", "score_hidden": false, "stickied": false, "created": 1492300651.0, "created_utc": 1492271851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgat3ye", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Just_A_Faze", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I love my mom, and she's not a bad person. She was a bad mother though. I know that this day will come, and when it does, I know I will have to say no. It sucks, but I also know that having her in my home will ruin my life and my relationship. \n\nYou have to choose you. Tell her that you love her, but you need to work on your life and your marriage, and that means you need to be alone with your husband. She will fight, but it's your home. You will risk losing her, but honestly, better her than you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love my mom, and she&amp;#39;s not a bad person. She was a bad mother though. I know that this day will come, and when it does, I know I will have to say no. It sucks, but I also know that having her in my home will ruin my life and my relationship. &lt;/p&gt;\n\n&lt;p&gt;You have to choose you. Tell her that you love her, but you need to work on your life and your marriage, and that means you need to be alone with your husband. She will fight, but it&amp;#39;s your home. You will risk losing her, but honestly, better her than you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgat3ye", "score_hidden": false, "stickied": false, "created": 1492301112.0, "created_utc": 1492272312.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgaysjn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "redditeria", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Always remember, your mother made choices in her life that got her to where she is today.\n\nIf you don't want her living with her, then do not allow her to move in. It's up to her to deal with this... to make the choices that are best for her given her situation. If she responds with guilt and disowning you, that is her choice. She could choose many possible reactions, but if she chooses that, it's all on her--not you.\n\nI'd approach it with, \"I love you, but I cannot live with you. And, it's not fair to my husband. I'm willing to get you back up and running but we cannot live under the same roof.\" If she freaks, then that's her problem. All you can do is say \"when you're ready to talk, I'll always be here.\"\n\nIt's important to set your boundaries with her. I know it's not easy, but it's incredibly important.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Always remember, your mother made choices in her life that got her to where she is today.&lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t want her living with her, then do not allow her to move in. It&amp;#39;s up to her to deal with this... to make the choices that are best for her given her situation. If she responds with guilt and disowning you, that is her choice. She could choose many possible reactions, but if she chooses that, it&amp;#39;s all on her--not you.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d approach it with, &amp;quot;I love you, but I cannot live with you. And, it&amp;#39;s not fair to my husband. I&amp;#39;m willing to get you back up and running but we cannot live under the same roof.&amp;quot; If she freaks, then that&amp;#39;s her problem. All you can do is say &amp;quot;when you&amp;#39;re ready to talk, I&amp;#39;ll always be here.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s important to set your boundaries with her. I know it&amp;#39;s not easy, but it&amp;#39;s incredibly important.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaysjn", "score_hidden": false, "stickied": false, "created": 1492308922.0, "created_utc": 1492280122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgazzfh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jewelsinme", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I GET it. Especially the \"tone\" she had when getting on to you. I too grew up like that. As an adult, I still have problems in general with ANY type of confrontation in my life. With anyone. The only thing I can say - which you already know - is if you cave in - you're not free anymore. You're going to be right back under her thumb. Why didn't you get up earlier? Why are you lazy sleeping til 8 on the weekend? That's not how the coffee should be made. You're not doing enough for your huband. He's going to get tired of you if you ask him to do things for you. When are you having a child? Why are you raising the child this way? Millions of silent judgements where you retreat further and further into your self until you're just a shell again. You are going to have to FIND THE STRENGTH to say  no. You have to do it for yourself. You have to do it for your marriage. You can even ask your husband to be the bad guy if you need to. You can even say my husband said no. But you can NOT LET her move in. Good luck. Find the strength. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I GET it. Especially the &amp;quot;tone&amp;quot; she had when getting on to you. I too grew up like that. As an adult, I still have problems in general with ANY type of confrontation in my life. With anyone. The only thing I can say - which you already know - is if you cave in - you&amp;#39;re not free anymore. You&amp;#39;re going to be right back under her thumb. Why didn&amp;#39;t you get up earlier? Why are you lazy sleeping til 8 on the weekend? That&amp;#39;s not how the coffee should be made. You&amp;#39;re not doing enough for your huband. He&amp;#39;s going to get tired of you if you ask him to do things for you. When are you having a child? Why are you raising the child this way? Millions of silent judgements where you retreat further and further into your self until you&amp;#39;re just a shell again. You are going to have to FIND THE STRENGTH to say  no. You have to do it for yourself. You have to do it for your marriage. You can even ask your husband to be the bad guy if you need to. You can even say my husband said no. But you can NOT LET her move in. Good luck. Find the strength. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgazzfh", "score_hidden": false, "stickied": false, "created": 1492310578.0, "created_utc": 1492281778.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgbb1im", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ghonaherpasiphilaids", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "No is a complete sentence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No is a complete sentence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbb1im", "score_hidden": false, "stickied": false, "created": 1492325835.0, "created_utc": 1492297035.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgbdqjs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "harkandhush", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I have no other family\n\nWhat about your husband?  The best thing you can do is remind yourself that blood relation and family don't always have to overlap.  I know it's hard to fight childhood baggage like this, but remember that your husband is just as much family, maybe more.  He chose to be your family and I hope that he supports you emotionally as a family should and as your mother clearly doesn't.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have no other family&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What about your husband?  The best thing you can do is remind yourself that blood relation and family don&amp;#39;t always have to overlap.  I know it&amp;#39;s hard to fight childhood baggage like this, but remember that your husband is just as much family, maybe more.  He chose to be your family and I hope that he supports you emotionally as a family should and as your mother clearly doesn&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbdqjs", "score_hidden": false, "stickied": false, "created": 1492329651.0, "created_utc": 1492300851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgbfqxg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "exfiltration", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Dad died in 2009. Mom was disowned in 2010.\n\nI had shitty parents. I didn't start truly healing from the abuse until i excised mom.\n\nI have my own family now, that i do my best to be good to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dad died in 2009. Mom was disowned in 2010.&lt;/p&gt;\n\n&lt;p&gt;I had shitty parents. I didn&amp;#39;t start truly healing from the abuse until i excised mom.&lt;/p&gt;\n\n&lt;p&gt;I have my own family now, that i do my best to be good to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbfqxg", "score_hidden": false, "stickied": false, "created": 1492332537.0, "created_utc": 1492303737.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgc4jw3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Esotericgirl", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You need to repeat the three following lines in your head to yourself:\n\n*I am not responsible for my mother's poor financial habits.*\n\n*I am not responsible for the repercussions of those poor financial habits.*\n\n*It is not my responsibility to try and fix my mother's life when she screws it up.*\n\nYou have your own life, away from her. She is NOT your only family anymore. You've made a new family, with your husband. \n\nIf she has directly asked you about moving in, versus just hinting, you can tell her \"My husband and I are starting a new stage of our life together and are not looking for roommates.\" Or, just \"No, Mom, you can't come and stay with us.\" Stand united here with your husband. He will help you with the support/strength you need. Have him be there to help back you up when you have this conversation, if it's in person or via phone.\n\n(Realistically though, YOU DON'T OWE HER ANY EXPLANATION AS TO WHY SHE CAN'T LIVE WITH YOU. And if she truly can't understand why you WOULDN'T want to be living with her after everything she's already put you through, that is even MORE of a reason to strengthen your resolve against it. If you cave and let her stay with you, not only will you be miserable, but it may likely end your marriage.) \n\nIf she hasn't asked you directly, I would suggest being supportive (while not offering your place as her new home) via something like \"Wow, Mom, that must be difficult to have those financial issues. Maybe you could talk with &lt;insert name of someone you know would be willing to help her here&gt; about possibly staying there until you can get on your feet. Or, I've heard that &lt;insert names of places in the area that help displaced people get back on their feet&gt; sometimes helps people in your kind of situation.\" If she keeps hinting about your extra bedrooms, let her know (the next time she brings up your \"extra\" space) that you have plans for that space and that is why you bought a house that has it.\n\nYou don't have to go into excruciating detail about why you don't want her living with you, if you choose not to. You just need to make it clear that she's not going to be doing it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to repeat the three following lines in your head to yourself:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am not responsible for my mother&amp;#39;s poor financial habits.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am not responsible for the repercussions of those poor financial habits.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;It is not my responsibility to try and fix my mother&amp;#39;s life when she screws it up.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;You have your own life, away from her. She is NOT your only family anymore. You&amp;#39;ve made a new family, with your husband. &lt;/p&gt;\n\n&lt;p&gt;If she has directly asked you about moving in, versus just hinting, you can tell her &amp;quot;My husband and I are starting a new stage of our life together and are not looking for roommates.&amp;quot; Or, just &amp;quot;No, Mom, you can&amp;#39;t come and stay with us.&amp;quot; Stand united here with your husband. He will help you with the support/strength you need. Have him be there to help back you up when you have this conversation, if it&amp;#39;s in person or via phone.&lt;/p&gt;\n\n&lt;p&gt;(Realistically though, YOU DON&amp;#39;T OWE HER ANY EXPLANATION AS TO WHY SHE CAN&amp;#39;T LIVE WITH YOU. And if she truly can&amp;#39;t understand why you WOULDN&amp;#39;T want to be living with her after everything she&amp;#39;s already put you through, that is even MORE of a reason to strengthen your resolve against it. If you cave and let her stay with you, not only will you be miserable, but it may likely end your marriage.) &lt;/p&gt;\n\n&lt;p&gt;If she hasn&amp;#39;t asked you directly, I would suggest being supportive (while not offering your place as her new home) via something like &amp;quot;Wow, Mom, that must be difficult to have those financial issues. Maybe you could talk with &amp;lt;insert name of someone you know would be willing to help her here&amp;gt; about possibly staying there until you can get on your feet. Or, I&amp;#39;ve heard that &amp;lt;insert names of places in the area that help displaced people get back on their feet&amp;gt; sometimes helps people in your kind of situation.&amp;quot; If she keeps hinting about your extra bedrooms, let her know (the next time she brings up your &amp;quot;extra&amp;quot; space) that you have plans for that space and that is why you bought a house that has it.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to go into excruciating detail about why you don&amp;#39;t want her living with you, if you choose not to. You just need to make it clear that she&amp;#39;s not going to be doing it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc4jw3", "score_hidden": false, "stickied": false, "created": 1492384127.0, "created_utc": 1492355327.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65gkmu", "likes": null, "replies": "", "user_reports": [], "id": "dgaq7t3", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "OlDirtyBurton", "parent_id": "t3_65gkmu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Let her move in then lord over her with ridiculous rules.\nLike she doesn't get to poop unless she says allahu Akbar or has to eat spaghetti every hour on the hour or she gets kicked out!\nShould be fun.... Plz post pics.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let her move in then lord over her with ridiculous rules.\nLike she doesn&amp;#39;t get to poop unless she says allahu Akbar or has to eat spaghetti every hour on the hour or she gets kicked out!\nShould be fun.... Plz post pics.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaq7t3", "score_hidden": false, "stickied": false, "created": 1492297001.0, "created_utc": 1492268201.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]