[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been dating my girlfriend for over a year now and things for the most part have been great. However, lately things in the bedroom have become frustrating and have really been turning me off from wanting to have sex with her and I don&amp;#39;t know what to do.&lt;/p&gt;\n\n&lt;p&gt;The sex is usually very good for me and I always make sure she is enjoying it as well. She never turns me down for sex and is always up for it when I initiate sex with her. The bigger problem is after we are done having sex she always complains. Sometimes its little subtle comments like &amp;quot;well if we didn&amp;#39;t have sex all the time I could have gotten this done&amp;quot; or just flat out saying &amp;quot;I&amp;#39;m tired at work all the time because we had sex&amp;quot;. It&amp;#39;s extremely frustrating because she never complains and never turns me down before sex yet complains after.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;edit&lt;/strong&gt;: We got into an argument a few weeks back and her big thing was &amp;quot;I always give you sex and I&amp;#39;m always tired or can&amp;#39;t get things done when I need to because we were having sex&amp;quot;. When in reality we only have sex a few times a week(sometimes only one or two times). There have been a few occasions where we&amp;#39;ve had sex during the day and needed to do errands that had to be postponed because of it. She seems to stick to those few times and forget that... well it was just a few times and since she complained about it the first time I&amp;#39;ve never done it again. Now she sticks to those snide comments every chance she can get after we have sex. It&amp;#39;s beyond frustrating to hear.&lt;/p&gt;\n\n&lt;p&gt;Plus my girlfriend has gained some weight over the year we have been dating and it has made her really insecure. I don&amp;#39;t mind it and I still find her as beautiful as the day I met her. It&amp;#39;s just that lately when we have sex she gets upset about her body and tries to hide away from me by keeping most of her clothes on to shield herself or forcing me to turn out the lights... &lt;/p&gt;\n\n&lt;p&gt;This has been turning me off so much. I have sat down and tried discussing with her, but she just Stonewalls me and says snide/rude remarks about how I&amp;#39;m always demanding something. Then when I get fed up with dealing with her acting like that she breaks down and cries apologizing and nothing ends up getting done.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;edit2&lt;/strong&gt;:I&amp;#39;ve asked her to please not be so negative before, during, and after sex. She tends to berate/put herself down because of her looks and or body image. I&amp;#39;ve asked her not to feel obligated to have sex with me and to turn me down if she wasn&amp;#39;t feeling in the mood. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve told her that her lack of initiation or enthusiasm when it comes to anything sexual makes me feel like she doesn&amp;#39;t want me.  I&amp;#39;ve even told her all the things I&amp;#39;ve listed in this post.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve asked her what&amp;#39;s wrong if anything on my side that I can change that would make things better. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a very direct person and also I&amp;#39;ve been raised to be an open person and have never been afraid to say whats on my mind. I&amp;#39;ve told her everything I&amp;#39;m posting here in this thread and even some of the things people are recommending me as I&amp;#39;ve thought about this subject before.&lt;/p&gt;\n\n&lt;p&gt;Nothing really seems to work. She just gives me this look its a deadpan look. It&amp;#39;s one of those looks where you know the other person really isn&amp;#39;t paying attention. However, she is quick to pick out one or two words from everything I&amp;#39;ve said and throw them back at me like I was trying to insult her in some way.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to break up with her because other than this I think she&amp;#39;s great but... lately I enjoy masturbating more than even bothering with sex... Is there anything I can do?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;edit3&lt;/strong&gt;: I&amp;#39;m very conflicted after reading some responses. I feel like breaking up is the easy way out. I&amp;#39;ve always been raised with the &amp;quot;diamond in the rough&amp;quot;(is this the correct saying) type mentality. Where If do my best and try my hardest things will play out perfectly in the end. However, I can&amp;#39;t honestly tell if it&amp;#39;s me thinking negatively and things in this relationship are better than I think they are or they&amp;#39;re really as bad as I think they are and I&amp;#39;m telling myself everything is going to be alright.  Sucks. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;edit4&lt;/strong&gt;: We went to dinner earlier and had a good time. We took her car because she wanted to take me to a restaurant I&amp;#39;ve been wanting to eat at for weeks. After we are heading back and get in the car she looks very upset. I was surprised because I didn&amp;#39;t know why she was so upset we just had a good dinner and a good time. I ask her if she is alright and she says shes fine and just doesn&amp;#39;t feel good and that her clothes are feeling &amp;quot;tight&amp;quot;. It was depressing because I was just having a good time and then she starts cold shouldering me and acting upset. As we are driving her phone is going off a lot and she looked at her phone and seemed even more upset. I asked her if everything was alright and who she was talking to because I was worried something came up. She ignores this for a bit and then shows me its her friends texting her. I asked her if everything was alright and whats going on to which she snaps and said that I&amp;#39;m being nosy and that it&amp;#39;s none of my business what her and her friends are talking about. I told her I was honestly just worried about her because she was looking at her phone and seemed even more upset afterwards. &lt;/p&gt;\n\n&lt;p&gt;She told me that she didn&amp;#39;t like the way I was talking to her and that it&amp;#39;s not fair that she takes me out to eat and then I get upset..(I wasn&amp;#39;t even talking most of the way). So I sat down before she dropped me off and told her that we had some problems that we needed to talk about and they are making me feel depressed. I reiterated a lot of the things I&amp;#39;ve said in this post and some mentioned comments. I did however leave out any sex talk as I didn&amp;#39;t feel it to be an appropriate time to talk about it as the issue here was her negativity about her body causing her to lash out at me.&lt;/p&gt;\n\n&lt;p&gt;She told me that she didn&amp;#39;t want to talk about anything and wanted to leave. I told her that until she was willing to talk things out with me and have a proper discussion with me about our problems without getting upset I think we should take a break. She drives off taking my phone and wallet with her(which she just returned everything intact).  Then messages me saying that she &amp;quot;can&amp;#39;t believe I did that and that she never wants to see me again&amp;quot;  and she drives over to my place to drop of my phone and wallet and looked to be dressed up and had her friends in the car... figured she is going out and partying I guess(which she never does with me).&lt;/p&gt;\n\n&lt;p&gt;Surprisingly once I got started and the words came out of my mouth I felt a lot better. Her response and the way she is acting makes me feel better because I know that I tried everything I could and that it&amp;#39;s out of my hands at this point. I feel quite calm and relaxed right now... I am not sure how long this feeling will last but for now I don&amp;#39;t feel as bad as I thought.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;end edit4&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;edit5&lt;/strong&gt;: I in response to &lt;a href=\"/u/Spektor0925\"&gt;/u/Spektor0925&lt;/a&gt; comment of &amp;quot;She was cheating on you, or planning to, guaranteed.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;When we got into that first fight that I mentioned in my edit. I saw that she had unblocked her ex&amp;#39;s number from her phone and he tried to call her while I was there. I asked her why she unblocked him and started talking to him to which she said that she was upset and angry at me and that she figured that by unblocking him it would make me upset.\nI highly doubt she cheated on me thus far. Actually that is the only thing I&amp;#39;m confident she hasn&amp;#39;t done. What I do agree on is that she might have been planning to cheat on me. After seeing her going out tonight I have a feeling that she wants to get back at me. Don&amp;#39;t want to think about it much because I know it will get to me.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;edit6&lt;/strong&gt;: She lives down the street from my house and I know she went out with her friends so I went over to grab my stuff because she is very possessive with my stuff and I know I wont get them back If I didn&amp;#39;t get it myself.&lt;/p&gt;\n\n&lt;p&gt;Her mom was home which is weird since she doesn&amp;#39;t live there. In the over one year we have been dating I&amp;#39;ve only had two conversations with my GF&amp;#39;s mother (she lives out of town at least 10 hours away from where we live) but I&amp;#39;ve met her quite a few times just never talked much. She asked where my GF was and I told her I wasn&amp;#39;t sure and that she went out with her friends. Conversation continues in a friendly manner and I inform her that we were taking a break from each other at the moment.&lt;/p&gt;\n\n&lt;p&gt;Her mom then informs me that there are some things about my GF that I should know.&lt;/p&gt;\n\n&lt;p&gt;She said that my GF is very stubborn and has always throughout her life been unwilling to compromise about anything. She said that she herself has always just let my GF have her way when doing things because otherwise it makes her extremely upset. She told me that my GF has always has body issues since she was younger and that she tries to make improvements to herself but gets upset when she doesn&amp;#39;t see the results she wants. She her own mother said that she tries to avoid her sometimes because she feels that she tends to get easily upset and lash out when things don&amp;#39;t go her own way.&lt;/p&gt;\n\n&lt;p&gt;I am not sure how I feel about this. Her mom told me that the only way to deal with her is to let her have her way all the time. She told me she thinks I&amp;#39;m a good boyfriend to her and that she can tell I&amp;#39;ve been extremely patient with her and can tell I&amp;#39;ve been taking care of her. She asked me if I would continue to be patient with her and work things out. I didn&amp;#39;t really respond much after that as I packed my stuff and left...&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: Girlfriend has body insecurities and makes a lot of snide/rude remarks post sex about us having sex. We talked about it and nothing got done. What do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": " I've been dating my girlfriend for over a year now and things for the most part have been great. However, lately things in the bedroom have become frustrating and have really been turning me off from wanting to have sex with her and I don't know what to do.\n\n\nThe sex is usually very good for me and I always make sure she is enjoying it as well. She never turns me down for sex and is always up for it when I initiate sex with her. The bigger problem is after we are done having sex she always complains. Sometimes its little subtle comments like \"well if we didn't have sex all the time I could have gotten this done\" or just flat out saying \"I'm tired at work all the time because we had sex\". It's extremely frustrating because she never complains and never turns me down before sex yet complains after.\n\n\n**edit**: We got into an argument a few weeks back and her big thing was \"I always give you sex and I'm always tired or can't get things done when I need to because we were having sex\". When in reality we only have sex a few times a week(sometimes only one or two times). There have been a few occasions where we've had sex during the day and needed to do errands that had to be postponed because of it. She seems to stick to those few times and forget that... well it was just a few times and since she complained about it the first time I've never done it again. Now she sticks to those snide comments every chance she can get after we have sex. It's beyond frustrating to hear.\n\nPlus my girlfriend has gained some weight over the year we have been dating and it has made her really insecure. I don't mind it and I still find her as beautiful as the day I met her. It's just that lately when we have sex she gets upset about her body and tries to hide away from me by keeping most of her clothes on to shield herself or forcing me to turn out the lights... \n\n\nThis has been turning me off so much. I have sat down and tried discussing with her, but she just Stonewalls me and says snide/rude remarks about how I'm always demanding something. Then when I get fed up with dealing with her acting like that she breaks down and cries apologizing and nothing ends up getting done.\n\n\n**edit2**:I've asked her to please not be so negative before, during, and after sex. She tends to berate/put herself down because of her looks and or body image. I've asked her not to feel obligated to have sex with me and to turn me down if she wasn't feeling in the mood. \n\nI've told her that her lack of initiation or enthusiasm when it comes to anything sexual makes me feel like she doesn't want me.  I've even told her all the things I've listed in this post.\n\nI've asked her what's wrong if anything on my side that I can change that would make things better. \n\nI'm a very direct person and also I've been raised to be an open person and have never been afraid to say whats on my mind. I've told her everything I'm posting here in this thread and even some of the things people are recommending me as I've thought about this subject before.\n\nNothing really seems to work. She just gives me this look its a deadpan look. It's one of those looks where you know the other person really isn't paying attention. However, she is quick to pick out one or two words from everything I've said and throw them back at me like I was trying to insult her in some way.\n\nI don't want to break up with her because other than this I think she's great but... lately I enjoy masturbating more than even bothering with sex... Is there anything I can do?\n\n**edit3**: I'm very conflicted after reading some responses. I feel like breaking up is the easy way out. I've always been raised with the \"diamond in the rough\"(is this the correct saying) type mentality. Where If do my best and try my hardest things will play out perfectly in the end. However, I can't honestly tell if it's me thinking negatively and things in this relationship are better than I think they are or they're really as bad as I think they are and I'm telling myself everything is going to be alright.  Sucks. \n\n  ---\n**edit4**: We went to dinner earlier and had a good time. We took her car because she wanted to take me to a restaurant I've been wanting to eat at for weeks. After we are heading back and get in the car she looks very upset. I was surprised because I didn't know why she was so upset we just had a good dinner and a good time. I ask her if she is alright and she says shes fine and just doesn't feel good and that her clothes are feeling \"tight\". It was depressing because I was just having a good time and then she starts cold shouldering me and acting upset. As we are driving her phone is going off a lot and she looked at her phone and seemed even more upset. I asked her if everything was alright and who she was talking to because I was worried something came up. She ignores this for a bit and then shows me its her friends texting her. I asked her if everything was alright and whats going on to which she snaps and said that I'm being nosy and that it's none of my business what her and her friends are talking about. I told her I was honestly just worried about her because she was looking at her phone and seemed even more upset afterwards. \n\nShe told me that she didn't like the way I was talking to her and that it's not fair that she takes me out to eat and then I get upset..(I wasn't even talking most of the way). So I sat down before she dropped me off and told her that we had some problems that we needed to talk about and they are making me feel depressed. I reiterated a lot of the things I've said in this post and some mentioned comments. I did however leave out any sex talk as I didn't feel it to be an appropriate time to talk about it as the issue here was her negativity about her body causing her to lash out at me.\n\nShe told me that she didn't want to talk about anything and wanted to leave. I told her that until she was willing to talk things out with me and have a proper discussion with me about our problems without getting upset I think we should take a break. She drives off taking my phone and wallet with her(which she just returned everything intact).  Then messages me saying that she \"can't believe I did that and that she never wants to see me again\"  and she drives over to my place to drop of my phone and wallet and looked to be dressed up and had her friends in the car... figured she is going out and partying I guess(which she never does with me).\n\nSurprisingly once I got started and the words came out of my mouth I felt a lot better. Her response and the way she is acting makes me feel better because I know that I tried everything I could and that it's out of my hands at this point. I feel quite calm and relaxed right now... I am not sure how long this feeling will last but for now I don't feel as bad as I thought.\n\n**end edit4**\n\n**edit5**: I in response to /u/Spektor0925 comment of \"She was cheating on you, or planning to, guaranteed.\"\n\n\nWhen we got into that first fight that I mentioned in my edit. I saw that she had unblocked her ex's number from her phone and he tried to call her while I was there. I asked her why she unblocked him and started talking to him to which she said that she was upset and angry at me and that she figured that by unblocking him it would make me upset.\nI highly doubt she cheated on me thus far. Actually that is the only thing I'm confident she hasn't done. What I do agree on is that she might have been planning to cheat on me. After seeing her going out tonight I have a feeling that she wants to get back at me. Don't want to think about it much because I know it will get to me.\n\n\n**edit6**: She lives down the street from my house and I know she went out with her friends so I went over to grab my stuff because she is very possessive with my stuff and I know I wont get them back If I didn't get it myself.\n\nHer mom was home which is weird since she doesn't live there. In the over one year we have been dating I've only had two conversations with my GF's mother (she lives out of town at least 10 hours away from where we live) but I've met her quite a few times just never talked much. She asked where my GF was and I told her I wasn't sure and that she went out with her friends. Conversation continues in a friendly manner and I inform her that we were taking a break from each other at the moment.\n\nHer mom then informs me that there are some things about my GF that I should know.\n\nShe said that my GF is very stubborn and has always throughout her life been unwilling to compromise about anything. She said that she herself has always just let my GF have her way when doing things because otherwise it makes her extremely upset. She told me that my GF has always has body issues since she was younger and that she tries to make improvements to herself but gets upset when she doesn't see the results she wants. She her own mother said that she tries to avoid her sometimes because she feels that she tends to get easily upset and lash out when things don't go her own way.\n\n\nI am not sure how I feel about this. Her mom told me that the only way to deal with her is to let her have her way all the time. She told me she thinks I'm a good boyfriend to her and that she can tell I've been extremely patient with her and can tell I've been taking care of her. She asked me if I would continue to be patient with her and work things out. I didn't really respond much after that as I packed my stuff and left...\n\n\n  ---   \n  **tl;dr**: Girlfriend has body insecurities and makes a lot of snide/rude remarks post sex about us having sex. We talked about it and nothing got done. What do?", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "65i5z1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 542, "report_reasons": null, "author": "aaron12153", "saved": false, "mod_reports": [], "name": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": 1492310469.0, "link_flair_css_class": "m-vt relationships", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65i5z1/i23m_dont_want_to_have_sex_with_my_girlfriend25f/", "num_reports": null, "locked": true, "stickied": false, "created": 1492274749.0, "url": "https://www.reddit.com/r/relationships/comments/65i5z1/i23m_dont_want_to_have_sex_with_my_girlfriend25f/", "author_flair_text": null, "quarantine": false, "title": "I[23M] don't want to have sex with my Girlfriend[25F] because of her insecurities during sex and nagging post sex. What should I do?", "created_utc": 1492245949.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 135, "visited": false, "subreddit_type": "public", "ups": 542}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbh4a7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "NotAReelclown", "parent_id": "t1_dgaumqj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "like a bank account, put more in than you take out", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;like a bank account, put more in than you take out&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbh4a7", "score_hidden": false, "stickied": false, "created": 1492334478.0, "created_utc": 1492305678.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaumqj", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "snorting_dandelions", "parent_id": "t1_dgas899", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; a relationship shouldn't be a matter of trying to quantitatively get much out of it as you put in\n\nI've read once that as long as both partners try to put in more than the other one, it's a pretty solid foundation for a good relationship. From my personal experience(going strong for 10 years now) it seems to fit perfectly, so I can only recommend it.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;a relationship shouldn&amp;#39;t be a matter of trying to quantitatively get much out of it as you put in&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;ve read once that as long as both partners try to put in more than the other one, it&amp;#39;s a pretty solid foundation for a good relationship. From my personal experience(going strong for 10 years now) it seems to fit perfectly, so I can only recommend it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaumqj", "score_hidden": false, "stickied": false, "created": 1492303252.0, "created_utc": 1492274452.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, "user_reports": [], "id": "dgas899", "gilded": 0, "archived": false, "score": 157, "report_reasons": null, "author": "cnslt", "parent_id": "t1_dgaospq", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I completely agree with this. If she thinks she's doing you a favor by giving you sex, there are two big problems at play.\n\n1) She's \"keeping score\". Everything favor or concession is being measured against a balance in her head. This in itself is unhealthy, as a relationship shouldn't be a matter of trying to quantitatively get much out of it as you put in. It should be more selfless. Furthermore, if every time you have sex it's a credit on her account, she'll perceive your relationship as far more unbalanced than it really is.\n\n2) She doesn't see sex as something for her. This might be a societal thing - maybe she does enjoy it, but believes it's mostly for you because of how she was raised. Or maybe she does feel like letting you have sex is the same as \"that's fine, I'll do the dishes tonight\". Something as critical as sex in a relationship should be more comfortable.\n\nIn all, I'd agree with you to hold back from sex a bit until you can have these conversations in a clear atmosphere. Maintaining this path guarantees dissatisfaction from both of you down the road, and resentment, as mentioned above.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I completely agree with this. If she thinks she&amp;#39;s doing you a favor by giving you sex, there are two big problems at play.&lt;/p&gt;\n\n&lt;p&gt;1) She&amp;#39;s &amp;quot;keeping score&amp;quot;. Everything favor or concession is being measured against a balance in her head. This in itself is unhealthy, as a relationship shouldn&amp;#39;t be a matter of trying to quantitatively get much out of it as you put in. It should be more selfless. Furthermore, if every time you have sex it&amp;#39;s a credit on her account, she&amp;#39;ll perceive your relationship as far more unbalanced than it really is.&lt;/p&gt;\n\n&lt;p&gt;2) She doesn&amp;#39;t see sex as something for her. This might be a societal thing - maybe she does enjoy it, but believes it&amp;#39;s mostly for you because of how she was raised. Or maybe she does feel like letting you have sex is the same as &amp;quot;that&amp;#39;s fine, I&amp;#39;ll do the dishes tonight&amp;quot;. Something as critical as sex in a relationship should be more comfortable.&lt;/p&gt;\n\n&lt;p&gt;In all, I&amp;#39;d agree with you to hold back from sex a bit until you can have these conversations in a clear atmosphere. Maintaining this path guarantees dissatisfaction from both of you down the road, and resentment, as mentioned above.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgas899", "score_hidden": false, "stickied": false, "created": 1492299885.0, "created_utc": 1492271085.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 157}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaywst", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "swivelhinges", "parent_id": "t1_dgaospq", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yea, her perspective on sex is bad, but its not a dealbreaker in and of itself. OP, I think you realize this.\n\nWhat's even worse in my eyes is the fact that she prevents you from having a real discussions about your relationship and completely counteracts your efforts to improve it. Few things are insurmountable if both parties are willing to put forth the time, effort, and commitment. When one party is unwilling to do the same, THAT PARTY IS NOT READY FOR A RELATIONSHIP. What she wants right now is to be miserable and to have someone to be miserable with. She's not gonna do her errands anyway, but she wants you to be a scapegoat for that, and she wants to be in a position to pass her blame on to you so she can direct some of her inner misery outward. Unless that's your idea of a happy relationship, you need to call her out on this (in the non-accusatory but direct terms). Maybe she will see the light, but if she doesn't? *Run* If she continues to deflect, it only means she is using the relationship and your desire to never-give-up as a distraction from dealing with her own problems. Your relationship is not going to get any better until she is ready to deal with them, and your relationship is part of what she uses to stay in denial. This looks like a set-up for a possible death spiral, though you aren't necessarily in it yet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea, her perspective on sex is bad, but its not a dealbreaker in and of itself. OP, I think you realize this.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s even worse in my eyes is the fact that she prevents you from having a real discussions about your relationship and completely counteracts your efforts to improve it. Few things are insurmountable if both parties are willing to put forth the time, effort, and commitment. When one party is unwilling to do the same, THAT PARTY IS NOT READY FOR A RELATIONSHIP. What she wants right now is to be miserable and to have someone to be miserable with. She&amp;#39;s not gonna do her errands anyway, but she wants you to be a scapegoat for that, and she wants to be in a position to pass her blame on to you so she can direct some of her inner misery outward. Unless that&amp;#39;s your idea of a happy relationship, you need to call her out on this (in the non-accusatory but direct terms). Maybe she will see the light, but if she doesn&amp;#39;t? &lt;em&gt;Run&lt;/em&gt; If she continues to deflect, it only means she is using the relationship and your desire to never-give-up as a distraction from dealing with her own problems. Your relationship is not going to get any better until she is ready to deal with them, and your relationship is part of what she uses to stay in denial. This looks like a set-up for a possible death spiral, though you aren&amp;#39;t necessarily in it yet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaywst", "score_hidden": false, "stickied": false, "created": 1492309085.0, "created_utc": 1492280285.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaospq", "gilded": 0, "archived": false, "score": 666, "report_reasons": null, "author": "salt_and_linen", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Her framing your sex life as her \"giving you sex\" is really illuminating and *really* bad, assuming those are the words she actually used. It means that she sees sex as a thing you want and she grants, not something you both want together. Continuing down that path is resentment and further complications in your sex life, so you need to address this part of it with her *fast*. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Her framing your sex life as her &amp;quot;giving you sex&amp;quot; is really illuminating and &lt;em&gt;really&lt;/em&gt; bad, assuming those are the words she actually used. It means that she sees sex as a thing you want and she grants, not something you both want together. Continuing down that path is resentment and further complications in your sex life, so you need to address this part of it with her &lt;em&gt;fast&lt;/em&gt;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaospq", "score_hidden": false, "stickied": false, "created": 1492294773.0, "created_utc": 1492265973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 666}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaloj3", "gilded": 0, "archived": false, "score": 108, "report_reasons": null, "author": "Pm_me_some_dessert", "parent_id": "t1_dgajz16", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Or this is how you get membership to the /r/deadbedrooms club. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or this is how you get membership to the &lt;a href=\"/r/deadbedrooms\"&gt;/r/deadbedrooms&lt;/a&gt; club. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaloj3", "score_hidden": false, "stickied": false, "created": 1492288864.0, "created_utc": 1492260064.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 108}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgapp40", "gilded": 0, "archived": false, "score": 69, "report_reasons": null, "author": "discrepancies", "parent_id": "t1_dgajz16", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yes the \"I give you sex\" thing would be enough to put me off all by itself. As if this aspect of the relationship were a poker chip or leverage for negotiation.\n\nOP, there's no shame in refusing to settle for a relationship that's not ideal. I used to feel like a bad guy for making sex an ideal that I would not compromise on in a relationship. But as others have pointed out, that's a good way to box yourself into a LTR that is unfulfilling in a major way. I've been there and it sucks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes the &amp;quot;I give you sex&amp;quot; thing would be enough to put me off all by itself. As if this aspect of the relationship were a poker chip or leverage for negotiation.&lt;/p&gt;\n\n&lt;p&gt;OP, there&amp;#39;s no shame in refusing to settle for a relationship that&amp;#39;s not ideal. I used to feel like a bad guy for making sex an ideal that I would not compromise on in a relationship. But as others have pointed out, that&amp;#39;s a good way to box yourself into a LTR that is unfulfilling in a major way. I&amp;#39;ve been there and it sucks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgapp40", "score_hidden": false, "stickied": false, "created": 1492296211.0, "created_utc": 1492267411.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 69}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaq5lx", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "andrewse", "parent_id": "t1_dgajz16", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "More likely this is how you spend the first years of your marriage with terrible sex. The rest of the marriage will be filled with a dead bedroom and resentment.\n\nOP, it sounds like your girlfriend has some guilt issues about sex. Perhaps you could persuade her to see a councillor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;More likely this is how you spend the first years of your marriage with terrible sex. The rest of the marriage will be filled with a dead bedroom and resentment.&lt;/p&gt;\n\n&lt;p&gt;OP, it sounds like your girlfriend has some guilt issues about sex. Perhaps you could persuade her to see a councillor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaq5lx", "score_hidden": false, "stickied": false, "created": 1492296908.0, "created_utc": 1492268108.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgas3qm", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "henrokk1", "parent_id": "t1_dgakvje", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That's hardly a reference anymore. It's just a widely used meme at this point ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s hardly a reference anymore. It&amp;#39;s just a widely used meme at this point &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgas3qm", "score_hidden": false, "stickied": false, "created": 1492299711.0, "created_utc": 1492270911.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakvje", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "alexemalexem", "parent_id": "t1_dgajz16", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Up vote for Archer reference.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Up vote for Archer reference.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgakvje", "score_hidden": false, "stickied": false, "created": 1492287006.0, "created_utc": 1492258206.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgajz16", "gilded": 0, "archived": false, "score": 556, "report_reasons": null, "author": "Werewolfbathtubs", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So she treats you like crap, gets snippy and defensive whenever you try to have an adult conversation, manipulates you by blubbering and sniveling when called out on bad behavior, and nothing ever changes.\n\nYou want to spend the rest of your life having terrible sex? Cause this is how you spend the rest of your life having terrible sex. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So she treats you like crap, gets snippy and defensive whenever you try to have an adult conversation, manipulates you by blubbering and sniveling when called out on bad behavior, and nothing ever changes.&lt;/p&gt;\n\n&lt;p&gt;You want to spend the rest of your life having terrible sex? Cause this is how you spend the rest of your life having terrible sex. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgajz16", "score_hidden": false, "stickied": false, "created": 1492284654.0, "created_utc": 1492255854.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 556}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaz6us", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "jewelsinme", "parent_id": "t1_dgaqctl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "And breaking up with someone isn't the \"easy thing to do\" when it requires a mature decision and larger perspective on life. Believing something you've invested a year on is worth sacrificing every real happiness you might find in the future - and not doing anything about it - that's not easy. That's lacking perspective and good personal judgement for what it takes you to *truly* be happy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And breaking up with someone isn&amp;#39;t the &amp;quot;easy thing to do&amp;quot; when it requires a mature decision and larger perspective on life. Believing something you&amp;#39;ve invested a year on is worth sacrificing every real happiness you might find in the future - and not doing anything about it - that&amp;#39;s not easy. That&amp;#39;s lacking perspective and good personal judgement for what it takes you to &lt;em&gt;truly&lt;/em&gt; be happy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaz6us", "score_hidden": false, "stickied": false, "created": 1492309477.0, "created_utc": 1492280677.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaqctl", "gilded": 0, "archived": false, "score": 114, "report_reasons": null, "author": "OneTwoWee000", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;edit3: I'm very conflicted after reading some responses. I feel like breaking up is the easy way out. I've always been raised with the \"diamond in the rough\"(is this the correct saying) type mentality. \n\nDude, you're 23. You're too young to settle and there are a lot of things listed that show she isn't a good fit for you.\n\nHer negativity, nagging, and body insecurities is on her to fix. You cannot change her, she has to want to change. Right now she's locked into a pattern and no matter how much you talk it out, she can't see beyond the fog. **Maybe breaking up will be the thing that causes her to reevaluate her views on herself and how she treats her intimate partners.** Set her free for both of your sakes. Time and distance may give her a new perspective.\n\nBreaking up isn't always a failure. Sometimes it's acknowledging your current relationship isn't giving you want you need, and that your partner simply isn't the right person for you long term. Can you imagine marrying this girl with *all of these issues ongoing*? If the thought of that makes you feel dread then you have your answer.. It's never a good thing to hold onto the relationship because of memories of the good feelings at the beginning -- the state of your dynamic now is paramount. Neither is holding on due to obligation or habit. You deserve better than that, you both do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;edit3: I&amp;#39;m very conflicted after reading some responses. I feel like breaking up is the easy way out. I&amp;#39;ve always been raised with the &amp;quot;diamond in the rough&amp;quot;(is this the correct saying) type mentality. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Dude, you&amp;#39;re 23. You&amp;#39;re too young to settle and there are a lot of things listed that show she isn&amp;#39;t a good fit for you.&lt;/p&gt;\n\n&lt;p&gt;Her negativity, nagging, and body insecurities is on her to fix. You cannot change her, she has to want to change. Right now she&amp;#39;s locked into a pattern and no matter how much you talk it out, she can&amp;#39;t see beyond the fog. &lt;strong&gt;Maybe breaking up will be the thing that causes her to reevaluate her views on herself and how she treats her intimate partners.&lt;/strong&gt; Set her free for both of your sakes. Time and distance may give her a new perspective.&lt;/p&gt;\n\n&lt;p&gt;Breaking up isn&amp;#39;t always a failure. Sometimes it&amp;#39;s acknowledging your current relationship isn&amp;#39;t giving you want you need, and that your partner simply isn&amp;#39;t the right person for you long term. Can you imagine marrying this girl with &lt;em&gt;all of these issues ongoing&lt;/em&gt;? If the thought of that makes you feel dread then you have your answer.. It&amp;#39;s never a good thing to hold onto the relationship because of memories of the good feelings at the beginning -- the state of your dynamic now is paramount. Neither is holding on due to obligation or habit. You deserve better than that, you both do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaqctl", "score_hidden": false, "stickied": false, "created": 1492297211.0, "created_utc": 1492268411.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 114}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgauwfr", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "oop0oop0", "parent_id": "t1_dgathir", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Trust me man I nearly broke down the first time I read something similar when I was in your position. I don't know everything or even pretend to know everything about your relationship, but from the info you posted here, I had flashbacks to my own version of this. You're in for a ride but holy fuck the ending destination is so worth it. Good luck man", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trust me man I nearly broke down the first time I read something similar when I was in your position. I don&amp;#39;t know everything or even pretend to know everything about your relationship, but from the info you posted here, I had flashbacks to my own version of this. You&amp;#39;re in for a ride but holy fuck the ending destination is so worth it. Good luck man&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgauwfr", "score_hidden": false, "stickied": false, "created": 1492303634.0, "created_utc": 1492274834.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dgathir", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgarbdk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Ain't going to lie with you almost made me break down reading this. Thank you I really appreciate reading this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ain&amp;#39;t going to lie with you almost made me break down reading this. Thank you I really appreciate reading this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgathir", "score_hidden": false, "stickied": false, "created": 1492301630.0, "created_utc": 1492272830.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgb5xgb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MisterKnightly", "parent_id": "t1_dgarbdk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Having been in a very similar position myself, OP, I wish that someone had given me this advice early on in my relationship. This is all you need to know.\n\nAlso, she sounds awful, to be honest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having been in a very similar position myself, OP, I wish that someone had given me this advice early on in my relationship. This is all you need to know.&lt;/p&gt;\n\n&lt;p&gt;Also, she sounds awful, to be honest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb5xgb", "score_hidden": false, "stickied": false, "created": 1492318601.0, "created_utc": 1492289801.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgarbdk", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "oop0oop0", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;Nothing really seems to work. She just gives me this look its a deadpan look. It's one of those looks where you know the other person really isn't paying attention. However, she is quick to pick out one or two words from everything I've said and throw them back at me like I was trying to insult her in some way.\n\n\nWhy are you still with her? I can probably guess. You don't want to \"give up\" on the relationship. You want to \"work on things\" to get over this. But these issues can only be overcome when the COUPLE aims to get through them, not just one person... Although you clearly want to work on this problem, she does not, WILL not, and you are beating your head against the wall trying over and over and over again.\n\n\n&gt;This has been turning me off so much. I have sat down and tried discussing with her, but she just Stonewalls me and says snide/rude remarks about how I'm always demanding something. Then when I get fed up with dealing with her acting like that she breaks down and cries apologizing and nothing ends up getting done.\n\n\nThis is manipulative behavior - regardless if it's intentional or not. You letting this behavior slide is very indicative you have strong codependent traits. I really hope you read into what that is, because I am very very sure you will read many examples that will resonate with you, and hopefully spark you into taking serious action here. You need to shift focus dude. Stop worrying about, \"why is she doing this? what can I do to fix this?\" and start thinking along the lines of, \"Why am I putting up with this? Why do I value her freedom to attack me with these comments and never change, over my needs of wanting a healthier relationship?\"\n\n\n\n\nPut the issue aside, just forget about its context. Do you want to be in a relationship with someone who deals with blatant problems in this manner? Because this is indicative of how she acts when other problems occur. I'm worried you are essentially letting yourself become a doormat. You sound very codependent. You lack boundaries and standards. Even when you *do* try to act on problems, you have no line drawn for when to stop - you simply think, \"i'm not a quitter!\" and keep drudging through, *hoping* it might change. \n\n\nTelling you to just break up is dumb. You already know you should. You need to dive into your thoughts and find out *why* you won't. None of these deflecting comments of \"i believe on working on things\" - you tried many times and failed every time. Be it lack of self-confidence, thinking you can't find anyone better, *needing* to be in a relationship, being uncomfortable single... There's deeper reasons behind why you are still with her that you are ignoring. I hope something here sparks a flame for you to do more introspection. Please read some articles on codependency - not to see if you *are*, but to see if you relate to some of its traits, and read into the why's and how to overcome them. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Nothing really seems to work. She just gives me this look its a deadpan look. It&amp;#39;s one of those looks where you know the other person really isn&amp;#39;t paying attention. However, she is quick to pick out one or two words from everything I&amp;#39;ve said and throw them back at me like I was trying to insult her in some way.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why are you still with her? I can probably guess. You don&amp;#39;t want to &amp;quot;give up&amp;quot; on the relationship. You want to &amp;quot;work on things&amp;quot; to get over this. But these issues can only be overcome when the COUPLE aims to get through them, not just one person... Although you clearly want to work on this problem, she does not, WILL not, and you are beating your head against the wall trying over and over and over again.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This has been turning me off so much. I have sat down and tried discussing with her, but she just Stonewalls me and says snide/rude remarks about how I&amp;#39;m always demanding something. Then when I get fed up with dealing with her acting like that she breaks down and cries apologizing and nothing ends up getting done.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is manipulative behavior - regardless if it&amp;#39;s intentional or not. You letting this behavior slide is very indicative you have strong codependent traits. I really hope you read into what that is, because I am very very sure you will read many examples that will resonate with you, and hopefully spark you into taking serious action here. You need to shift focus dude. Stop worrying about, &amp;quot;why is she doing this? what can I do to fix this?&amp;quot; and start thinking along the lines of, &amp;quot;Why am I putting up with this? Why do I value her freedom to attack me with these comments and never change, over my needs of wanting a healthier relationship?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Put the issue aside, just forget about its context. Do you want to be in a relationship with someone who deals with blatant problems in this manner? Because this is indicative of how she acts when other problems occur. I&amp;#39;m worried you are essentially letting yourself become a doormat. You sound very codependent. You lack boundaries and standards. Even when you &lt;em&gt;do&lt;/em&gt; try to act on problems, you have no line drawn for when to stop - you simply think, &amp;quot;i&amp;#39;m not a quitter!&amp;quot; and keep drudging through, &lt;em&gt;hoping&lt;/em&gt; it might change. &lt;/p&gt;\n\n&lt;p&gt;Telling you to just break up is dumb. You already know you should. You need to dive into your thoughts and find out &lt;em&gt;why&lt;/em&gt; you won&amp;#39;t. None of these deflecting comments of &amp;quot;i believe on working on things&amp;quot; - you tried many times and failed every time. Be it lack of self-confidence, thinking you can&amp;#39;t find anyone better, &lt;em&gt;needing&lt;/em&gt; to be in a relationship, being uncomfortable single... There&amp;#39;s deeper reasons behind why you are still with her that you are ignoring. I hope something here sparks a flame for you to do more introspection. Please read some articles on codependency - not to see if you &lt;em&gt;are&lt;/em&gt;, but to see if you relate to some of its traits, and read into the why&amp;#39;s and how to overcome them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgarbdk", "score_hidden": false, "stickied": false, "created": 1492298596.0, "created_utc": 1492269796.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaqban", "gilded": 0, "archived": false, "score": 54, "report_reasons": null, "author": "ephemeral-person", "parent_id": "t1_dgap8ng", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Oh man this style of \"communication\" can be so frustrating. She is yanking you back and forth and you know if you tell her that it's hurting your feelings by doing this, she will throw it back at you. I highly recommend breaking up with this person as she definitely needs counseling and to work on her own issues before getting back into a relationship", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man this style of &amp;quot;communication&amp;quot; can be so frustrating. She is yanking you back and forth and you know if you tell her that it&amp;#39;s hurting your feelings by doing this, she will throw it back at you. I highly recommend breaking up with this person as she definitely needs counseling and to work on her own issues before getting back into a relationship&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaqban", "score_hidden": false, "stickied": false, "created": 1492297147.0, "created_utc": 1492268347.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 54}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgar299", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "DebateExposesDoubt", "parent_id": "t1_dgap8ng", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What the fuck? She just sounds like a professional complainer then. It's always gonna be something. She sounds like a real peach.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What the fuck? She just sounds like a professional complainer then. It&amp;#39;s always gonna be something. She sounds like a real peach.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgar299", "score_hidden": false, "stickied": false, "created": 1492298232.0, "created_utc": 1492269432.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 44}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgax1sl", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "deceasedhusband", "parent_id": "t1_dgap8ng", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She sounds exhausting. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She sounds exhausting. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgax1sl", "score_hidden": false, "stickied": false, "created": 1492306566.0, "created_utc": 1492277766.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgb249i", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "earthgarden", "parent_id": "t1_dgap8ng", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Maaaaaan you need to scale this relationship all the way back. Start seeing her only once a week a few hours. That should give her plenty of time to see all her friend and family and take care of all her errands and stuff and whatever else she claims you're preventing her from doing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maaaaaan you need to scale this relationship all the way back. Start seeing her only once a week a few hours. That should give her plenty of time to see all her friend and family and take care of all her errands and stuff and whatever else she claims you&amp;#39;re preventing her from doing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb249i", "score_hidden": false, "stickied": false, "created": 1492313416.0, "created_utc": 1492284616.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbccy9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tdeasyweb", "parent_id": "t1_dgap8ng", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Jesus, I'm tired just reading this. How do you live with this? Think about it this way - remove the words \"romantic\" from your relationship. Remove the sex. It's like you're hanging out with someone who barely likes you, and is getting tired of putting up with you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus, I&amp;#39;m tired just reading this. How do you live with this? Think about it this way - remove the words &amp;quot;romantic&amp;quot; from your relationship. Remove the sex. It&amp;#39;s like you&amp;#39;re hanging out with someone who barely likes you, and is getting tired of putting up with you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbccy9", "score_hidden": false, "stickied": false, "created": 1492327751.0, "created_utc": 1492298951.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbilae", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pineappletits", "parent_id": "t1_dgap8ng", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So rather than being able to appreciate your intentions she just gets angry and views you as the source of any problems she has. You're being so nice, please don't let her spoil that part of your personality.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So rather than being able to appreciate your intentions she just gets angry and views you as the source of any problems she has. You&amp;#39;re being so nice, please don&amp;#39;t let her spoil that part of your personality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbilae", "score_hidden": false, "stickied": false, "created": 1492336630.0, "created_utc": 1492307830.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgap8ng", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgaowff", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're right. We have had issues before that were not sex related and the same things happens. She is extremely bad at managing her time so I offered to help her take care of things that I could do (i.e. feeding her dogs, doing her dishes or laundry ~sn:we don't live together~). I told her that I didn't mind helping her do those things because It meant that I could not only help her finish faster, but I also would get to spend time with her.\n\nThis didn't end well as over time she told me that she never got to spend any time with her friends or family because I was always occupying her time. I told her that I was only trying to help her do the things she needed to do so she could go spend time with her friends. She then got upset at me because she said I failed to realize she didn't want to leave to hang out with her friends while I was over helping because she would feel bad. Therefore she chose to stay over and not see them and take that out on me who was just trying to help.\n\nedit: Then when I tell her I will give her a couple days of space to do what she needs to do and stay out of her way she will text or call me wanting to do something hours later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right. We have had issues before that were not sex related and the same things happens. She is extremely bad at managing her time so I offered to help her take care of things that I could do (i.e. feeding her dogs, doing her dishes or laundry ~sn:we don&amp;#39;t live together~). I told her that I didn&amp;#39;t mind helping her do those things because It meant that I could not only help her finish faster, but I also would get to spend time with her.&lt;/p&gt;\n\n&lt;p&gt;This didn&amp;#39;t end well as over time she told me that she never got to spend any time with her friends or family because I was always occupying her time. I told her that I was only trying to help her do the things she needed to do so she could go spend time with her friends. She then got upset at me because she said I failed to realize she didn&amp;#39;t want to leave to hang out with her friends while I was over helping because she would feel bad. Therefore she chose to stay over and not see them and take that out on me who was just trying to help.&lt;/p&gt;\n\n&lt;p&gt;edit: Then when I tell her I will give her a couple days of space to do what she needs to do and stay out of her way she will text or call me wanting to do something hours later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgap8ng", "score_hidden": false, "stickied": false, "created": 1492295501.0, "created_utc": 1492266701.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 37}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaowff", "gilded": 0, "archived": false, "score": 73, "report_reasons": null, "author": "iDidntReadOP", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She views sex as \"giving it to you\". She doesn't view the sex you guys have as a \"we\" but as something she had to do as part of a relationship. That means in the future, with her current attitude, she will use sex as a weapon/punishment. You did something she didn't like? She will say no sex for a while, you're just using her, etc.  \n  \nIf she isn't willing to work on it this is a way bigger issue. It isn't even about sex. You voice your concerns in a mature manner and she ignores your attempts to communicate. What if other issues arise where she thinks she is in the right? Maybe it is a money related issue or something. Will she be open to communication or view you as attacking her?  \n  \nAfter a year she views the relationship as a \"you vs. me\" dynamic, not an \"us vs. problems\" dynamic. Which would you prefer to be a part of?  \n  \nI'm not going to say to continue the relationship or not, we don't know much more about your relationship, but these are good things to think about. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She views sex as &amp;quot;giving it to you&amp;quot;. She doesn&amp;#39;t view the sex you guys have as a &amp;quot;we&amp;quot; but as something she had to do as part of a relationship. That means in the future, with her current attitude, she will use sex as a weapon/punishment. You did something she didn&amp;#39;t like? She will say no sex for a while, you&amp;#39;re just using her, etc.  &lt;/p&gt;\n\n&lt;p&gt;If she isn&amp;#39;t willing to work on it this is a way bigger issue. It isn&amp;#39;t even about sex. You voice your concerns in a mature manner and she ignores your attempts to communicate. What if other issues arise where she thinks she is in the right? Maybe it is a money related issue or something. Will she be open to communication or view you as attacking her?  &lt;/p&gt;\n\n&lt;p&gt;After a year she views the relationship as a &amp;quot;you vs. me&amp;quot; dynamic, not an &amp;quot;us vs. problems&amp;quot; dynamic. Which would you prefer to be a part of?  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to say to continue the relationship or not, we don&amp;#39;t know much more about your relationship, but these are good things to think about. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaowff", "score_hidden": false, "stickied": false, "created": 1492294944.0, "created_utc": 1492266144.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 73}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgamqj6", "gilded": 0, "archived": false, "score": 74, "report_reasons": null, "author": "The_Pagan_Queen", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "In my life, chores being phostphoned by sex is totally a bonus for my day, when are chores more important than making love? Her excuses are a cop out. Then she nags you and moans? I cant blame you for feeling this way.\n\nShe isnt mature enough to be able to engage with you as an equal partner in your relationship, her stonewalling you is totally not right, she should be making an effort to communicate with you. Its also very clear to me that she views sex as a chore, not as the special, bonding thing it actually is. \n\nI doubt this situation will change unless she makes an effort, there is an issue that she isn't talking about. \n\nDo you really want to deal with this for the rest of your life? You deserve better, you deserve someone who is on the same level as you and has the same values as you, who wont have an issue and let it build to resentment. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my life, chores being phostphoned by sex is totally a bonus for my day, when are chores more important than making love? Her excuses are a cop out. Then she nags you and moans? I cant blame you for feeling this way.&lt;/p&gt;\n\n&lt;p&gt;She isnt mature enough to be able to engage with you as an equal partner in your relationship, her stonewalling you is totally not right, she should be making an effort to communicate with you. Its also very clear to me that she views sex as a chore, not as the special, bonding thing it actually is. &lt;/p&gt;\n\n&lt;p&gt;I doubt this situation will change unless she makes an effort, there is an issue that she isn&amp;#39;t talking about. &lt;/p&gt;\n\n&lt;p&gt;Do you really want to deal with this for the rest of your life? You deserve better, you deserve someone who is on the same level as you and has the same values as you, who wont have an issue and let it build to resentment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgamqj6", "score_hidden": false, "stickied": false, "created": 1492291089.0, "created_utc": 1492262289.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 74}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbhxi6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "arn66he", "parent_id": "t1_dgapz6h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This x100.\n\n I hate to break it to you, OP, but you aren't dating the diamond. You're dating the rough.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This x100.&lt;/p&gt;\n\n&lt;p&gt;I hate to break it to you, OP, but you aren&amp;#39;t dating the diamond. You&amp;#39;re dating the rough.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbhxi6", "score_hidden": false, "stickied": false, "created": 1492335661.0, "created_utc": 1492306861.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgapz6h", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "paletooth", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I've always been raised with the \"diamond in the rough\"(is this the correct saying) type mentality. Where If do my best and try my hardest things will play out perfectly in the end.\n\nyou can't force someone to change. relationships need people to try from BOTH SIDES, not just one; you can't fix this with sheer naivety and force of will.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ve always been raised with the &amp;quot;diamond in the rough&amp;quot;(is this the correct saying) type mentality. Where If do my best and try my hardest things will play out perfectly in the end.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;you can&amp;#39;t force someone to change. relationships need people to try from BOTH SIDES, not just one; you can&amp;#39;t fix this with sheer naivety and force of will.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgapz6h", "score_hidden": false, "stickied": false, "created": 1492296636.0, "created_utc": 1492267836.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgao6wp", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "Stalingrad52", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Acquire a new girlfriend is the only correct answer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Acquire a new girlfriend is the only correct answer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgao6wp", "score_hidden": false, "stickied": false, "created": 1492293757.0, "created_utc": 1492264957.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgapz9h", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "TGiFallen", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\n&gt;**edit3**: I'm very conflicted after reading some responses. I feel like breaking up is the easy way out. I've always been raised with the \"diamond in the rough\"(is this the correct saying) type mentality. Where . \n\nEveryone is a diamond in the rough, but it's up to themselves to cut, shape and polish it. You don't expect other people to do it for you when you're not doing anything yourself. And you shouldn't be try to do it for others, lest that breeds lazy habits in them.\n\n&gt; If do my best and try my hardest things will play out perfectly in the end. However, I can't honestly tell if it's me thinking negatively and things in this relationship are better than I think they are or they're really as bad as I think they are and I'm telling myself everything is going to be alright.  Sucks\n\nUnfortunately that isn't true, plenty of people out there do everything right and still lose. You only have control over how you act and how you react and interpret others. For this relationship to turn out perfect in the end, it requires hard work from two people.\n\nYou can't control your girlfriend, you can't make her change, and if she doesn't want to put any effort into being a good relationship partner, why would you?\n\nIf you resent spending time with her, break up. \n\nSince you're not having sex often, and you don't even enjoy it anymore, what you have is a friend who lives with you, she's not providing anything a friend can't.\n\nWould you let your friends treat you the way she treats you?  ", "edited": 1492268553.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;edit3&lt;/strong&gt;: I&amp;#39;m very conflicted after reading some responses. I feel like breaking up is the easy way out. I&amp;#39;ve always been raised with the &amp;quot;diamond in the rough&amp;quot;(is this the correct saying) type mentality. Where . &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Everyone is a diamond in the rough, but it&amp;#39;s up to themselves to cut, shape and polish it. You don&amp;#39;t expect other people to do it for you when you&amp;#39;re not doing anything yourself. And you shouldn&amp;#39;t be try to do it for others, lest that breeds lazy habits in them.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If do my best and try my hardest things will play out perfectly in the end. However, I can&amp;#39;t honestly tell if it&amp;#39;s me thinking negatively and things in this relationship are better than I think they are or they&amp;#39;re really as bad as I think they are and I&amp;#39;m telling myself everything is going to be alright.  Sucks&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Unfortunately that isn&amp;#39;t true, plenty of people out there do everything right and still lose. You only have control over how you act and how you react and interpret others. For this relationship to turn out perfect in the end, it requires hard work from two people.&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t control your girlfriend, you can&amp;#39;t make her change, and if she doesn&amp;#39;t want to put any effort into being a good relationship partner, why would you?&lt;/p&gt;\n\n&lt;p&gt;If you resent spending time with her, break up. &lt;/p&gt;\n\n&lt;p&gt;Since you&amp;#39;re not having sex often, and you don&amp;#39;t even enjoy it anymore, what you have is a friend who lives with you, she&amp;#39;s not providing anything a friend can&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;Would you let your friends treat you the way she treats you?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgapz9h", "score_hidden": false, "stickied": false, "created": 1492296640.0, "created_utc": 1492267840.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaqfo8", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "enderfem", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "In regards to your third edit: life isn't like that, especially not relationships.  You can do all the work and stick with it and still not be happy, especially with a partner not interested in doing work as well. \n\n(Also diamond in the rough refers to finding something awesome amongst the mundane.  I think you are thinking of \"nose to the grindstone\" or \"shoulder to the wheel\". )\n\nLook into the \"sunk cost\" fallacy because that's where you are.  And go take a peek at r/deadbedrooms because that's where you are going.", "edited": 1492272682.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In regards to your third edit: life isn&amp;#39;t like that, especially not relationships.  You can do all the work and stick with it and still not be happy, especially with a partner not interested in doing work as well. &lt;/p&gt;\n\n&lt;p&gt;(Also diamond in the rough refers to finding something awesome amongst the mundane.  I think you are thinking of &amp;quot;nose to the grindstone&amp;quot; or &amp;quot;shoulder to the wheel&amp;quot;. )&lt;/p&gt;\n\n&lt;p&gt;Look into the &amp;quot;sunk cost&amp;quot; fallacy because that&amp;#39;s where you are.  And go take a peek at &lt;a href=\"/r/deadbedrooms\"&gt;r/deadbedrooms&lt;/a&gt; because that&amp;#39;s where you are going.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaqfo8", "score_hidden": false, "stickied": false, "created": 1492297329.0, "created_utc": 1492268529.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaoown", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "whatiseenow", "parent_id": "t1_dgaoapc", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "In my experience, when your body is hurting at the thought of something, it's for a reason. Your body knows the answer. Trust your instincts, dude!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my experience, when your body is hurting at the thought of something, it&amp;#39;s for a reason. Your body knows the answer. Trust your instincts, dude!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaoown", "score_hidden": false, "stickied": false, "created": 1492294597.0, "created_utc": 1492265797.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 45}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgavus3", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "SurvivingMissPrism", "parent_id": "t1_dgaoapc", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I honestly don't know what you can do to salvage this. Frankly, if you take my advice to stop initiating, I *fully* expect her to go off on you for not thinking she's sexy. But what the hell are you supposed to do when your partner complains like that?\n\nYou can't win.\n\nThis sounds like a really big \"her\" problem. Maybe couples counseling would help, but this is a horse to water situation. It takes two to have a relationship. If she won't work on it, you can't save it.\n\nRelationships shouldn't make your chest hurt. I think you know the answer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I honestly don&amp;#39;t know what you can do to salvage this. Frankly, if you take my advice to stop initiating, I &lt;em&gt;fully&lt;/em&gt; expect her to go off on you for not thinking she&amp;#39;s sexy. But what the hell are you supposed to do when your partner complains like that?&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t win.&lt;/p&gt;\n\n&lt;p&gt;This sounds like a really big &amp;quot;her&amp;quot; problem. Maybe couples counseling would help, but this is a horse to water situation. It takes two to have a relationship. If she won&amp;#39;t work on it, you can&amp;#39;t save it.&lt;/p&gt;\n\n&lt;p&gt;Relationships shouldn&amp;#39;t make your chest hurt. I think you know the answer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgavus3", "score_hidden": false, "stickied": false, "created": 1492304949.0, "created_utc": 1492276149.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaonmy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "godrestsinreason", "parent_id": "t1_dgaoapc", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If only your phone pesky *feelings* didn't get in the way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If only your phone pesky &lt;em&gt;feelings&lt;/em&gt; didn&amp;#39;t get in the way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaonmy", "score_hidden": false, "stickied": false, "created": 1492294541.0, "created_utc": 1492265741.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaoapc", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgao20n", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I know this might be wrong to say... The last part of what you said is how I really feel about how she acts.\n\nedit: It feels that way so much my chest kind of hurts", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know this might be wrong to say... The last part of what you said is how I really feel about how she acts.&lt;/p&gt;\n\n&lt;p&gt;edit: It feels that way so much my chest kind of hurts&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaoapc", "score_hidden": false, "stickied": false, "created": 1492293937.0, "created_utc": 1492265137.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgawd9k", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "anontea", "parent_id": "t1_dgatrr0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That's not healthy... You both need to come from a place of understanding each other and not just apologize as a way to shutting the other person up. That's just extremely shitty for her to do. \n\nYes relationships are work, yes you should fight for the person that you love. But it shouldn't come at a cost of yourself. There's a saying that you shouldn't put yourself on fire to save someone else. And I think you should take that to heart.\n\nNot every relationship started should last forever. It should be a way for BOTH of you to grow together and make each other a better person. And she doesn't sound like she is a positive part in your life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s not healthy... You both need to come from a place of understanding each other and not just apologize as a way to shutting the other person up. That&amp;#39;s just extremely shitty for her to do. &lt;/p&gt;\n\n&lt;p&gt;Yes relationships are work, yes you should fight for the person that you love. But it shouldn&amp;#39;t come at a cost of yourself. There&amp;#39;s a saying that you shouldn&amp;#39;t put yourself on fire to save someone else. And I think you should take that to heart.&lt;/p&gt;\n\n&lt;p&gt;Not every relationship started should last forever. It should be a way for BOTH of you to grow together and make each other a better person. And she doesn&amp;#39;t sound like she is a positive part in your life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgawd9k", "score_hidden": false, "stickied": false, "created": 1492305640.0, "created_utc": 1492276840.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbihi7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pineappletits", "parent_id": "t1_dgatrr0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yikes :(. Here's my concern: I'm sure she has a ton of awesome qualities, which is why you're still with her, but a lot of her behaviors you're mentioning are going to occupy your feelings over time--you'll be too resentful to be able to appreciate/enjoy the good qualities.\n\nYou're in a relationship that's me vs. you, not us vs. the problem. You guys won't ever be able to overcome problems. It's not healthy, and over time it'll make you question yourself, your own values, and who you are as a person. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yikes :(. Here&amp;#39;s my concern: I&amp;#39;m sure she has a ton of awesome qualities, which is why you&amp;#39;re still with her, but a lot of her behaviors you&amp;#39;re mentioning are going to occupy your feelings over time--you&amp;#39;ll be too resentful to be able to appreciate/enjoy the good qualities.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re in a relationship that&amp;#39;s me vs. you, not us vs. the problem. You guys won&amp;#39;t ever be able to overcome problems. It&amp;#39;s not healthy, and over time it&amp;#39;ll make you question yourself, your own values, and who you are as a person. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbihi7", "score_hidden": false, "stickied": false, "created": 1492336475.0, "created_utc": 1492307675.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgatrr0", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgarpm1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Honestly, never. There hasn't been a time where she willingly apologized to me. Most of the time it's just her way of making me shut up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, never. There hasn&amp;#39;t been a time where she willingly apologized to me. Most of the time it&amp;#39;s just her way of making me shut up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgatrr0", "score_hidden": false, "stickied": false, "created": 1492302035.0, "created_utc": 1492273235.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgarpm1", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "oop0oop0", "parent_id": "t1_dgao20n", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It may be narcissism or an instance of any other personality disorder traits... but REGARDLESS, it IS manipulation. Dating someone like this will do nightmares on your mind. It makes you constantly question yourself. \"There must be something I'm doing wrong\", \"she's right, I must be too demanding\"... It's horrible. You feel like a complete failure.\n\n\nOP, how many times do you remember your girlfriend holding herself accountable? No justifications. No, \"I'm sorry, *but it was because of ___*\". No, \"I know I messed up, *but you also did__*\"... Just a statement of pure remorse along the lines of, \"I'm sorry. I shouldn't have done ___. It's entirely my fault. I need to not do that ever again, and this is how I'm going to do it...\". Doesn't have to be that indepth, but I bet you see where I'm coming from. \n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It may be narcissism or an instance of any other personality disorder traits... but REGARDLESS, it IS manipulation. Dating someone like this will do nightmares on your mind. It makes you constantly question yourself. &amp;quot;There must be something I&amp;#39;m doing wrong&amp;quot;, &amp;quot;she&amp;#39;s right, I must be too demanding&amp;quot;... It&amp;#39;s horrible. You feel like a complete failure.&lt;/p&gt;\n\n&lt;p&gt;OP, how many times do you remember your girlfriend holding herself accountable? No justifications. No, &amp;quot;I&amp;#39;m sorry, &lt;em&gt;but it was because of ___&lt;/em&gt;&amp;quot;. No, &amp;quot;I know I messed up, &lt;em&gt;but you also did__&lt;/em&gt;&amp;quot;... Just a statement of pure remorse along the lines of, &amp;quot;I&amp;#39;m sorry. I shouldn&amp;#39;t have done ___. It&amp;#39;s entirely my fault. I need to not do that ever again, and this is how I&amp;#39;m going to do it...&amp;quot;. Doesn&amp;#39;t have to be that indepth, but I bet you see where I&amp;#39;m coming from. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgarpm1", "score_hidden": false, "stickied": false, "created": 1492299154.0, "created_utc": 1492270354.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgao20n", "gilded": 0, "archived": false, "score": 65, "report_reasons": null, "author": "godrestsinreason", "parent_id": "t1_dgamz2f", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I just want to reiterate that it's not \"them\" who has an issue with communication. It's her. He's been direct with his feelings, spelled them out in a collected way, explained why he feels this way, and provided a solution.\n\nBut that's what happens in the face of narcissism. Play the victim like the world is out to get you simply for existing. Nothing is ever your fault. It's his fault for \"attacking\" her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just want to reiterate that it&amp;#39;s not &amp;quot;them&amp;quot; who has an issue with communication. It&amp;#39;s her. He&amp;#39;s been direct with his feelings, spelled them out in a collected way, explained why he feels this way, and provided a solution.&lt;/p&gt;\n\n&lt;p&gt;But that&amp;#39;s what happens in the face of narcissism. Play the victim like the world is out to get you simply for existing. Nothing is ever your fault. It&amp;#39;s his fault for &amp;quot;attacking&amp;quot; her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgao20n", "score_hidden": false, "stickied": false, "created": 1492293526.0, "created_utc": 1492264726.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 65}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbbrrh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "IdontSparkle", "parent_id": "t1_dgb3t1z", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah, doing absolutely nothing usually solves problems...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, doing absolutely nothing usually solves problems...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbbrrh", "score_hidden": false, "stickied": false, "created": 1492326898.0, "created_utc": 1492298098.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3t1z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SurvivingMissPrism", "parent_id": "t1_dgay5ik", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He's 23. He can survive going a few months without sex while trying to work this out if this relationship is worth it to him.\n\nI also fully expect her to lay into him for not initiating, or for her to not care. Either way, hopefully it's the wake up call to make him realize this isn't working. There is a chance it'll be the break they need to sort things out, though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s 23. He can survive going a few months without sex while trying to work this out if this relationship is worth it to him.&lt;/p&gt;\n\n&lt;p&gt;I also fully expect her to lay into him for not initiating, or for her to not care. Either way, hopefully it&amp;#39;s the wake up call to make him realize this isn&amp;#39;t working. There is a chance it&amp;#39;ll be the break they need to sort things out, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb3t1z", "score_hidden": false, "stickied": false, "created": 1492315717.0, "created_utc": 1492286917.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgay5ik", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "IdontSparkle", "parent_id": "t1_dgatybk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;just putting the brakes on sex until they get on the same page.\n\nYou're telling him to get on *her* page not a common ground.\n\nAt 23 year old, he's too young to be having sex once a full moon. He should cut his loss. His girlfriend is guiltripping him, it's unhealthy and he shouldn't have to deal with dead bedrooms at 23 and being made to feel bad about it.\n\nShe has issues she should work on and she's not in a state to have a relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;just putting the brakes on sex until they get on the same page.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re telling him to get on &lt;em&gt;her&lt;/em&gt; page not a common ground.&lt;/p&gt;\n\n&lt;p&gt;At 23 year old, he&amp;#39;s too young to be having sex once a full moon. He should cut his loss. His girlfriend is guiltripping him, it&amp;#39;s unhealthy and he shouldn&amp;#39;t have to deal with dead bedrooms at 23 and being made to feel bad about it.&lt;/p&gt;\n\n&lt;p&gt;She has issues she should work on and she&amp;#39;s not in a state to have a relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgay5ik", "score_hidden": false, "stickied": false, "created": 1492308064.0, "created_utc": 1492279264.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgatybk", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "SurvivingMissPrism", "parent_id": "t1_dgaoias", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; \"I always give you sex and I'm always tired or can't get things done when I need to because we were having sex\"\n\nI never once called op a rapist, and I'm still not. He is getting consent from her, and she's refusing to say what she needs. That isn't OP's fault, but he can't just keep going on like this.\n\n The fact is that you can say \"yes\" to sex you don't really want to have, and she's basically come out and said that's what she's doing. She isn't engaging in a mutually fulfilling activity, she's \"giving\" him sex and resents how often she does.\n\nI also didn't say OP wants sex too often in general. OP can wanr sex 5 times a day and if he finds a partner who matches that drive, power to him! But his girlfriend is consistently expressing that it's more often than she wants.\n\nAnd, yes, OP has presented himself as communicating well- but 1. We're only getting his perspective, 2. He hasn't tried just putting the brakes on  sex until they get on the same page.w", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;I always give you sex and I&amp;#39;m always tired or can&amp;#39;t get things done when I need to because we were having sex&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I never once called op a rapist, and I&amp;#39;m still not. He is getting consent from her, and she&amp;#39;s refusing to say what she needs. That isn&amp;#39;t OP&amp;#39;s fault, but he can&amp;#39;t just keep going on like this.&lt;/p&gt;\n\n&lt;p&gt;The fact is that you can say &amp;quot;yes&amp;quot; to sex you don&amp;#39;t really want to have, and she&amp;#39;s basically come out and said that&amp;#39;s what she&amp;#39;s doing. She isn&amp;#39;t engaging in a mutually fulfilling activity, she&amp;#39;s &amp;quot;giving&amp;quot; him sex and resents how often she does.&lt;/p&gt;\n\n&lt;p&gt;I also didn&amp;#39;t say OP wants sex too often in general. OP can wanr sex 5 times a day and if he finds a partner who matches that drive, power to him! But his girlfriend is consistently expressing that it&amp;#39;s more often than she wants.&lt;/p&gt;\n\n&lt;p&gt;And, yes, OP has presented himself as communicating well- but 1. We&amp;#39;re only getting his perspective, 2. He hasn&amp;#39;t tried just putting the brakes on  sex until they get on the same page.w&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgatybk", "score_hidden": false, "stickied": false, "created": 1492302290.0, "created_utc": 1492273490.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaoias", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "IdontSparkle", "parent_id": "t1_dgamz2f", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\n\n&gt;She's telling you that she's having sex more often than she wants\n\nOK this is borderline accusatory, it has underlying \"consenting\" aspect. It's only after the act is over than she's complaining. She's into it, she just regrets it after.\n\n\n&gt;You two have a big communication issue here.\n\nSeems like it's only her. he's communicating plenty enough\n\n\n&gt; then resents having to do it so often\n\n\"So often\" is subjective. At 23/25 year old, a couple of times a week is perfectly in the norm. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She&amp;#39;s telling you that she&amp;#39;s having sex more often than she wants&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;OK this is borderline accusatory, it has underlying &amp;quot;consenting&amp;quot; aspect. It&amp;#39;s only after the act is over than she&amp;#39;s complaining. She&amp;#39;s into it, she just regrets it after.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You two have a big communication issue here.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Seems like it&amp;#39;s only her. he&amp;#39;s communicating plenty enough&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;then resents having to do it so often&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;So often&amp;quot; is subjective. At 23/25 year old, a couple of times a week is perfectly in the norm. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaoias", "score_hidden": false, "stickied": false, "created": 1492294293.0, "created_utc": 1492265493.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dgamz2f", "gilded": 0, "archived": false, "score": 68, "report_reasons": null, "author": "SurvivingMissPrism", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It might be wise, for right now, to stop initiating and only have sex when she initiates. This is NOT meant to be \"withholding sex\", you should still be affectionate in other ways. Try to make it clear that you do still want sex, but because she's so tired you want to only do it when *she* wants to.\n\nYou two have a big communication issue here. Continuing at your regular sex schedule isn't working, maybe easing off will give you both a chance to re evaluate.\n\nShe's telling you that she's having sex more often than she wants. She won't tell you how much is too much, though.\n\nI'm guessing \nthere are a lot of insecurity issues here.  Obviously her weight causes her to be insecure, but she also might fear that if she turns you down you'll leave her, then resents having to do it so often.\nShe may have some very unhealthy ideas about sex. I don't know her so I can only guess. \n\nYou two need to figure out how to talk to each other and work through this if you want the relationship to continue.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It might be wise, for right now, to stop initiating and only have sex when she initiates. This is NOT meant to be &amp;quot;withholding sex&amp;quot;, you should still be affectionate in other ways. Try to make it clear that you do still want sex, but because she&amp;#39;s so tired you want to only do it when &lt;em&gt;she&lt;/em&gt; wants to.&lt;/p&gt;\n\n&lt;p&gt;You two have a big communication issue here. Continuing at your regular sex schedule isn&amp;#39;t working, maybe easing off will give you both a chance to re evaluate.&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s telling you that she&amp;#39;s having sex more often than she wants. She won&amp;#39;t tell you how much is too much, though.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m guessing \nthere are a lot of insecurity issues here.  Obviously her weight causes her to be insecure, but she also might fear that if she turns you down you&amp;#39;ll leave her, then resents having to do it so often.\nShe may have some very unhealthy ideas about sex. I don&amp;#39;t know her so I can only guess. &lt;/p&gt;\n\n&lt;p&gt;You two need to figure out how to talk to each other and work through this if you want the relationship to continue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgamz2f", "score_hidden": false, "stickied": false, "created": 1492291545.0, "created_utc": 1492262745.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 68}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgapo6g", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ffffffffc", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The fact that she views sex as \"giving it to you\" is a problem. Has she ever turned down sex? It sounds like she doesn't want to have as much sex as you do, but doesn't feel comfortable turning you down.\n\n&gt; I'm a very direct person and also I've been raised to be an open person and have never been afraid to say whats on my mind\n\nI know how you feel, and a lot of other men probably do as well. But this mindset might not be helpful. You want her to be more direct, like you. That would be nice, but the reality is that she deals with different circumstances than you do. She might have a deep-seated (and not entirely unfounded) belief that men in general, and you in particular, are going to be upset if she ever turns down sex. It's also unfortunately the case that society is less accepting of women who are direct and speak their mind. Not to say that women can't do this, but it requires a little more guts.\n\nI don't think anyone could fault you for leaving this relationship. You're both young and you haven't been together that long. It's really too soon to be having fights like this.", "edited": 1492267702.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fact that she views sex as &amp;quot;giving it to you&amp;quot; is a problem. Has she ever turned down sex? It sounds like she doesn&amp;#39;t want to have as much sex as you do, but doesn&amp;#39;t feel comfortable turning you down.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m a very direct person and also I&amp;#39;ve been raised to be an open person and have never been afraid to say whats on my mind&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I know how you feel, and a lot of other men probably do as well. But this mindset might not be helpful. You want her to be more direct, like you. That would be nice, but the reality is that she deals with different circumstances than you do. She might have a deep-seated (and not entirely unfounded) belief that men in general, and you in particular, are going to be upset if she ever turns down sex. It&amp;#39;s also unfortunately the case that society is less accepting of women who are direct and speak their mind. Not to say that women can&amp;#39;t do this, but it requires a little more guts.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think anyone could fault you for leaving this relationship. You&amp;#39;re both young and you haven&amp;#39;t been together that long. It&amp;#39;s really too soon to be having fights like this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgapo6g", "score_hidden": false, "stickied": false, "created": 1492296171.0, "created_utc": 1492267371.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbkz9l", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "AFatHobbit", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Lovely. Her mom raised your gf to be a self entitled asshole. Find someone more emotionally mature to date...you will be MUCH happier.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lovely. Her mom raised your gf to be a self entitled asshole. Find someone more emotionally mature to date...you will be MUCH happier.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbkz9l", "score_hidden": false, "stickied": false, "created": 1492340141.0, "created_utc": 1492311341.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgar1zc", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Micromolecular", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've been in this boat. Tbh dude if you're enjoying all other aspects and rubbing one out in the shower is all you need to keep the boner at bay for a while.. Just don't initiate sex. Sounds really hard at first but maybe she'll realize you're serious about the things you said, including wanting her to have energy to get things done. Maybe after a while she'll snap out of it and realize the sex isn't whats making her unhappy. Or maybe she'll try to solve her issues.\n\n\nIf that doesn't work it may just be that she has some other issues in her life that she is attributing to \"having too much sex\". She may be blind to it herself. If you start thinking this may be the case AND shes continuing to make her unhappiness effect the relationship wothout getting help.. Break up. You've tried to help her and it didn't work. Staying with a person who finds reasons to be unhappy without trying to actively solve the problems is miserable. Don't let it get to you any longer than it has to or is worth.", "edited": 1492269641.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been in this boat. Tbh dude if you&amp;#39;re enjoying all other aspects and rubbing one out in the shower is all you need to keep the boner at bay for a while.. Just don&amp;#39;t initiate sex. Sounds really hard at first but maybe she&amp;#39;ll realize you&amp;#39;re serious about the things you said, including wanting her to have energy to get things done. Maybe after a while she&amp;#39;ll snap out of it and realize the sex isn&amp;#39;t whats making her unhappy. Or maybe she&amp;#39;ll try to solve her issues.&lt;/p&gt;\n\n&lt;p&gt;If that doesn&amp;#39;t work it may just be that she has some other issues in her life that she is attributing to &amp;quot;having too much sex&amp;quot;. She may be blind to it herself. If you start thinking this may be the case AND shes continuing to make her unhappiness effect the relationship wothout getting help.. Break up. You&amp;#39;ve tried to help her and it didn&amp;#39;t work. Staying with a person who finds reasons to be unhappy without trying to actively solve the problems is miserable. Don&amp;#39;t let it get to you any longer than it has to or is worth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgar1zc", "score_hidden": false, "stickied": false, "created": 1492298220.0, "created_utc": 1492269420.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaqq3i", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Exevilsockpuppet", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Diamond in the rough means over time things get better.   \nYou are in a situations where things will only get worse. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Diamond in the rough means over time things get better.&lt;br/&gt;\nYou are in a situations where things will only get worse. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaqq3i", "score_hidden": false, "stickied": false, "created": 1492297758.0, "created_utc": 1492268958.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgas130", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "matrix2002", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Ugh, why do people always think \"Everything is great, except the sex is horrible.\" isn't enough to break up?\n\nHave a heart to heart with her about her attitude and try to find healthy ways for her to be positive.\n\nIf she doesn't change, then you either have to accept her attitude or break-up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ugh, why do people always think &amp;quot;Everything is great, except the sex is horrible.&amp;quot; isn&amp;#39;t enough to break up?&lt;/p&gt;\n\n&lt;p&gt;Have a heart to heart with her about her attitude and try to find healthy ways for her to be positive.&lt;/p&gt;\n\n&lt;p&gt;If she doesn&amp;#39;t change, then you either have to accept her attitude or break-up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgas130", "score_hidden": false, "stickied": false, "created": 1492299610.0, "created_utc": 1492270810.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgatxhu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CraazyMike", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Why do you even want to be with someone who treats you like a yo-yo. Go away... come back.. go away.. come back. \n\nThe way you describe your relationship.. are you sure she even likes you? It's sounds to me like she just keeps you are as a target for her complaints. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why do you even want to be with someone who treats you like a yo-yo. Go away... come back.. go away.. come back. &lt;/p&gt;\n\n&lt;p&gt;The way you describe your relationship.. are you sure she even likes you? It&amp;#39;s sounds to me like she just keeps you are as a target for her complaints. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgatxhu", "score_hidden": false, "stickied": false, "created": 1492302259.0, "created_utc": 1492273459.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgauice", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Takes2-2Mango", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I want to address your third edit, about believing if you do your best and work hard, things will work out.  That's just not always true.  Not in life, not in jobs, and especially not in relationships.  Dating, especially when you're young, is how you find out what your values are in a partner, what your boundaries are, what is unacceptable to you, and how you find someone who will put equal effort in.  Relationships only work if BOTH people are doing their best and working hard...and your girlfriend is not.  \n\nYou know she's negative, that she doesn't communicate well, that she uses sex to manipulate you, and that she will always always find something to complain about and always makes it your fault.  For you to say \"these are not qualities I want or value in a partner\" and \"she is not putting in the same effort I am\" IS OK!  It is the mature thing to do, to realize this relationship is not equal, does not have matching values, and is manipulative and therefore not healthy.  IT IS OK to say that while you love some things about her and the relationship, she is not a good fit for you for the long term.  IT IS OK to decide that you want to break up so you can find a partner who is positive, does not manipulate you, communicates well, has a great sex life with you, and puts in equal effort.  That is what dating is for.  Right now, you're paddling a 2 man canoe, and she's either paddling against you or throwing down her paddle in a huff, and then getting mad at you when the canoe goes in circles.  You have every right to want to find someone who paddles forward just as hard as you do.  You deserve someone who does.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to address your third edit, about believing if you do your best and work hard, things will work out.  That&amp;#39;s just not always true.  Not in life, not in jobs, and especially not in relationships.  Dating, especially when you&amp;#39;re young, is how you find out what your values are in a partner, what your boundaries are, what is unacceptable to you, and how you find someone who will put equal effort in.  Relationships only work if BOTH people are doing their best and working hard...and your girlfriend is not.  &lt;/p&gt;\n\n&lt;p&gt;You know she&amp;#39;s negative, that she doesn&amp;#39;t communicate well, that she uses sex to manipulate you, and that she will always always find something to complain about and always makes it your fault.  For you to say &amp;quot;these are not qualities I want or value in a partner&amp;quot; and &amp;quot;she is not putting in the same effort I am&amp;quot; IS OK!  It is the mature thing to do, to realize this relationship is not equal, does not have matching values, and is manipulative and therefore not healthy.  IT IS OK to say that while you love some things about her and the relationship, she is not a good fit for you for the long term.  IT IS OK to decide that you want to break up so you can find a partner who is positive, does not manipulate you, communicates well, has a great sex life with you, and puts in equal effort.  That is what dating is for.  Right now, you&amp;#39;re paddling a 2 man canoe, and she&amp;#39;s either paddling against you or throwing down her paddle in a huff, and then getting mad at you when the canoe goes in circles.  You have every right to want to find someone who paddles forward just as hard as you do.  You deserve someone who does.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgauice", "score_hidden": false, "stickied": false, "created": 1492303076.0, "created_utc": 1492274276.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbije4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgb2ykm", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you, I added one last edit to my post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I added one last edit to my post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbije4", "score_hidden": false, "stickied": false, "created": 1492336550.0, "created_utc": 1492307750.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2ykm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "aschr", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;edit3: I'm very conflicted after reading some responses. I feel like breaking up is the easy way out. I've always been raised with the \"diamond in the rough\"(is this the correct saying) type mentality.\n\nThis is an absolutely terrible mindset to have. This is the mindset of abuse victims; \"he/she only hits me when I make them angry/they're having a bad day/[insert any other excuse]\". Get the hell out of this relationship guy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;edit3: I&amp;#39;m very conflicted after reading some responses. I feel like breaking up is the easy way out. I&amp;#39;ve always been raised with the &amp;quot;diamond in the rough&amp;quot;(is this the correct saying) type mentality.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is an absolutely terrible mindset to have. This is the mindset of abuse victims; &amp;quot;he/she only hits me when I make them angry/they&amp;#39;re having a bad day/[insert any other excuse]&amp;quot;. Get the hell out of this relationship guy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb2ykm", "score_hidden": false, "stickied": false, "created": 1492314545.0, "created_utc": 1492285745.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgamd7k", "gilded": 0, "archived": false, "score": 51, "report_reasons": null, "author": "IdontSparkle", "parent_id": "t1_dgah4c9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "For a year long relationship? Frankly it certainly is a fair amount of time but too short to already having to deal with a dead bedroom at 23 year old... Frankly at 23 I didn't even have the budget for counseling, let alone the luxury to have middle-age marital problems already...\n\nHe should cut his loss.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For a year long relationship? Frankly it certainly is a fair amount of time but too short to already having to deal with a dead bedroom at 23 year old... Frankly at 23 I didn&amp;#39;t even have the budget for counseling, let alone the luxury to have middle-age marital problems already...&lt;/p&gt;\n\n&lt;p&gt;He should cut his loss.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgamd7k", "score_hidden": false, "stickied": false, "created": 1492290337.0, "created_utc": 1492261537.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 51}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgap5jo", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "abcdefghi1234567", "parent_id": "t1_dgah4c9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Dude has absolutely zero skin in the game. That's the beauty of dating. Just leave.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude has absolutely zero skin in the game. That&amp;#39;s the beauty of dating. Just leave.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgap5jo", "score_hidden": false, "stickied": false, "created": 1492295359.0, "created_utc": 1492266559.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaopqc", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Stalingrad52", "parent_id": "t1_dgah4c9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Is this a standard generated response or something? Fucking counselling for his year-long relationship at 23? Nahhhh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is this a standard generated response or something? Fucking counselling for his year-long relationship at 23? Nahhhh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaopqc", "score_hidden": false, "stickied": false, "created": 1492294636.0, "created_utc": 1492265836.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgah4c9", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "all4reddit", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Get counselling.\n\nIf it doesn't work, then I'd leave.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get counselling.&lt;/p&gt;\n\n&lt;p&gt;If it doesn&amp;#39;t work, then I&amp;#39;d leave.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgah4c9", "score_hidden": false, "stickied": false, "created": 1492275713.0, "created_utc": 1492246913.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaqhlp", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "MCNatCommander", "parent_id": "t1_dgaph9i", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Some of the things your girlfriend has said reminds me of my mom. I've asked her to go to therapy, but she always says that the only reason she would need therapy is us (me and my sister). She has some pretty foundational problems with her sense of self, but admitting that means accepting part of the blame for where her life is at right now. I'm not saying to break up with your girlfriend, but if you plan on making this relationship last, she needs to sort through her issues. My mom's reliance on others for the definition of her own life put a huge burden on me as a child—it stole my childhood in many ways—and has left me with lasting psychological issues. It simply isn't a healthy dynamic for a family.\n\nI understand that you may not be considering marriage or children at all. But a lot of people just kind of keep taking the next step in their relationships without recognizing the repercussions of those choices. I just wanted to bring this up so that you can avoid slipping into a future that will negatively impact more people than just yourself.", "edited": 1492268803.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some of the things your girlfriend has said reminds me of my mom. I&amp;#39;ve asked her to go to therapy, but she always says that the only reason she would need therapy is us (me and my sister). She has some pretty foundational problems with her sense of self, but admitting that means accepting part of the blame for where her life is at right now. I&amp;#39;m not saying to break up with your girlfriend, but if you plan on making this relationship last, she needs to sort through her issues. My mom&amp;#39;s reliance on others for the definition of her own life put a huge burden on me as a child—it stole my childhood in many ways—and has left me with lasting psychological issues. It simply isn&amp;#39;t a healthy dynamic for a family.&lt;/p&gt;\n\n&lt;p&gt;I understand that you may not be considering marriage or children at all. But a lot of people just kind of keep taking the next step in their relationships without recognizing the repercussions of those choices. I just wanted to bring this up so that you can avoid slipping into a future that will negatively impact more people than just yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaqhlp", "score_hidden": false, "stickied": false, "created": 1492297410.0, "created_utc": 1492268610.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgausjw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "riversilver", "parent_id": "t1_dgaph9i", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "jesus she sounds exhausting. If I were you I would've been done a looooong time ago. Enough is enough man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;jesus she sounds exhausting. If I were you I would&amp;#39;ve been done a looooong time ago. Enough is enough man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgausjw", "score_hidden": false, "stickied": false, "created": 1492303483.0, "created_utc": 1492274683.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaph9i", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgaoyfc", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've tried to have a conversation with her when we were just sitting around watching a movie not doing anything in particular. I felt this to be the best method as trying to communicate after we argue \"just makes me more mad\" according to her.\n\nShe then proceed to ignore most of what I say and turn it back on me and say \"I never get to have a good day because of you doing this\" and \"I'm just never good enough for you am I?\".\n\nI know at one point she told me she was going to therapy, but I don't know at what point in her life she was going and what for. I've always known it was a touchy subject and never wanted to push knowing she is easily startled.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve tried to have a conversation with her when we were just sitting around watching a movie not doing anything in particular. I felt this to be the best method as trying to communicate after we argue &amp;quot;just makes me more mad&amp;quot; according to her.&lt;/p&gt;\n\n&lt;p&gt;She then proceed to ignore most of what I say and turn it back on me and say &amp;quot;I never get to have a good day because of you doing this&amp;quot; and &amp;quot;I&amp;#39;m just never good enough for you am I?&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I know at one point she told me she was going to therapy, but I don&amp;#39;t know at what point in her life she was going and what for. I&amp;#39;ve always known it was a touchy subject and never wanted to push knowing she is easily startled.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaph9i", "score_hidden": false, "stickied": false, "created": 1492295878.0, "created_utc": 1492267078.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaoyfc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NightoftheLivingSled", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It sounds to me like she's very insecure about her body and is projecting her feelings. Therapy might be a good call. I don't think things will get better until you guys get to the root of her insecurities and get her to feel good about herself. It sounds like you're trying to be open, honest and communicative, and that's great. Keep that up. Have you tried bringing up your concerns at a neutral time when you're both at your best and not currently arguing?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds to me like she&amp;#39;s very insecure about her body and is projecting her feelings. Therapy might be a good call. I don&amp;#39;t think things will get better until you guys get to the root of her insecurities and get her to feel good about herself. It sounds like you&amp;#39;re trying to be open, honest and communicative, and that&amp;#39;s great. Keep that up. Have you tried bringing up your concerns at a neutral time when you&amp;#39;re both at your best and not currently arguing?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaoyfc", "score_hidden": false, "stickied": false, "created": 1492295036.0, "created_utc": 1492266236.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbgvf4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgaw55n", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Trust me I feel like you are right in the ballpark. Of course I could be wrong as well but I don't know as she doesn't tell me whats going on in her mind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trust me I feel like you are right in the ballpark. Of course I could be wrong as well but I don&amp;#39;t know as she doesn&amp;#39;t tell me whats going on in her mind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbgvf4", "score_hidden": false, "stickied": false, "created": 1492334118.0, "created_utc": 1492305318.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaw55n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CirclingLife", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your girlfriend may be suffering from some form of depression. Reasons I think this:\n\n* Not paying attention (i.e. apathetic) when you're talking to her is possibly an indication of shutting down when one feels hopelessly misunderstood and doesn't know how to communicate effectively.\n* Her weight gain is likely affecting her sense of self worth, which may be part of a downward spiral where she feels like shit, so she starts adopting bad coping habits, which cause her to feel like shit even more.\n* Depressed people sometimes have low sex drives.\n* She doesn't seem to understand her own behavior very well to the point of strong coherence. She may sometimes lash out at you because she's projecting her own inner turmoil.\n\nMaybe I'm overanalyzing the situation, but if I'm in the right ballpark, there are many avenues that she can take. The most commonly recommended one is therapy and/or medication. The next most common is probably exercise and/or meditation. On top of those, having a healthy diet is suuuuper important, especially if you have low energy. Everyone's \"ideal diet\" is pretty personalized, IMO, so experiment with different diets and see what makes her feel best. I suggest less carbs (unless her daily work requires high physical energy) and lots of vegetables &amp; sufficient proteins.\n\nLastly, most people don't just \"snap out of it\" instantly. Don't put unreasonable pressure on her to \"get better\" or you'll only make her feel worse. Just be supportive, and if after a couple months she doesn't seem to be returning to her old self, you should understand that you did everything you could but it's time to separate and let her figure out her own problems.", "edited": 1492276849.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your girlfriend may be suffering from some form of depression. Reasons I think this:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Not paying attention (i.e. apathetic) when you&amp;#39;re talking to her is possibly an indication of shutting down when one feels hopelessly misunderstood and doesn&amp;#39;t know how to communicate effectively.&lt;/li&gt;\n&lt;li&gt;Her weight gain is likely affecting her sense of self worth, which may be part of a downward spiral where she feels like shit, so she starts adopting bad coping habits, which cause her to feel like shit even more.&lt;/li&gt;\n&lt;li&gt;Depressed people sometimes have low sex drives.&lt;/li&gt;\n&lt;li&gt;She doesn&amp;#39;t seem to understand her own behavior very well to the point of strong coherence. She may sometimes lash out at you because she&amp;#39;s projecting her own inner turmoil.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Maybe I&amp;#39;m overanalyzing the situation, but if I&amp;#39;m in the right ballpark, there are many avenues that she can take. The most commonly recommended one is therapy and/or medication. The next most common is probably exercise and/or meditation. On top of those, having a healthy diet is suuuuper important, especially if you have low energy. Everyone&amp;#39;s &amp;quot;ideal diet&amp;quot; is pretty personalized, IMO, so experiment with different diets and see what makes her feel best. I suggest less carbs (unless her daily work requires high physical energy) and lots of vegetables &amp;amp; sufficient proteins.&lt;/p&gt;\n\n&lt;p&gt;Lastly, most people don&amp;#39;t just &amp;quot;snap out of it&amp;quot; instantly. Don&amp;#39;t put unreasonable pressure on her to &amp;quot;get better&amp;quot; or you&amp;#39;ll only make her feel worse. Just be supportive, and if after a couple months she doesn&amp;#39;t seem to be returning to her old self, you should understand that you did everything you could but it&amp;#39;s time to separate and let her figure out her own problems.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaw55n", "score_hidden": false, "stickied": false, "created": 1492305337.0, "created_utc": 1492276537.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgax8wc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "deceasedhusband", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "1 year into a relationship things SHOULD be easy!!!! If your 1 year young relationship isn't easy then you should absolutely take the easy way out. We're not talking about a long term commitment here, with vows or children where you owe it to each other to work through a tough spot. This is pure incompatibility and that's OK!!!\n\nPlus why is taking the easy way out bad? Do you get bonus points for playing life on hard mode? No. The whole point of dating is to find someone who you're compatible with, someone who makes your life enjoyable and yes! easier!! If your relationship is making your life more difficult then you're in the wrong relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1 year into a relationship things SHOULD be easy!!!! If your 1 year young relationship isn&amp;#39;t easy then you should absolutely take the easy way out. We&amp;#39;re not talking about a long term commitment here, with vows or children where you owe it to each other to work through a tough spot. This is pure incompatibility and that&amp;#39;s OK!!!&lt;/p&gt;\n\n&lt;p&gt;Plus why is taking the easy way out bad? Do you get bonus points for playing life on hard mode? No. The whole point of dating is to find someone who you&amp;#39;re compatible with, someone who makes your life enjoyable and yes! easier!! If your relationship is making your life more difficult then you&amp;#39;re in the wrong relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgax8wc", "score_hidden": false, "stickied": false, "created": 1492306836.0, "created_utc": 1492278036.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbijj3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgayxvj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you, I added one last edit to my post.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I added one last edit to my post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbijj3", "score_hidden": false, "stickied": false, "created": 1492336556.0, "created_utc": 1492307756.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgayxvj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "slightlycoolguy", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Breaking up isn't the easy way out. The easy way out is to pretend everything fine and stay with her despite your problems. Also it's not healthy to be in a relationship where you're the only one trying to make an effort while she complains about everything but doesn't make an effort to improve.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Breaking up isn&amp;#39;t the easy way out. The easy way out is to pretend everything fine and stay with her despite your problems. Also it&amp;#39;s not healthy to be in a relationship where you&amp;#39;re the only one trying to make an effort while she complains about everything but doesn&amp;#39;t make an effort to improve.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgayxvj", "score_hidden": false, "stickied": false, "created": 1492309125.0, "created_utc": 1492280325.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbig6i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgb7hqz", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you, I added one last edit to my post.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I added one last edit to my post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbig6i", "score_hidden": false, "stickied": false, "created": 1492336420.0, "created_utc": 1492307620.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7hqz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BAEries", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Sounds to me like she wants out of the relationship but doesn't know why and it's making her unhappy and she's taking that out on you. If everything was good, she wouldn't be behaving as though sex is some kind of chore. \nI *am* wondering if the sex is as good for her as you think it is, though. Like, maybe she's faking it—why else would it feel like \"giving you sex\"? Idk, it seems to me like she's really unhappy and maybe even trying to figure out if she should end things and it's starting to seep through. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds to me like she wants out of the relationship but doesn&amp;#39;t know why and it&amp;#39;s making her unhappy and she&amp;#39;s taking that out on you. If everything was good, she wouldn&amp;#39;t be behaving as though sex is some kind of chore. \nI &lt;em&gt;am&lt;/em&gt; wondering if the sex is as good for her as you think it is, though. Like, maybe she&amp;#39;s faking it—why else would it feel like &amp;quot;giving you sex&amp;quot;? Idk, it seems to me like she&amp;#39;s really unhappy and maybe even trying to figure out if she should end things and it&amp;#39;s starting to seep through. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb7hqz", "score_hidden": false, "stickied": false, "created": 1492320784.0, "created_utc": 1492291984.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbiiah", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgbd7rj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you, I added one last edit to my post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I added one last edit to my post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbiiah", "score_hidden": false, "stickied": false, "created": 1492336507.0, "created_utc": 1492307707.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbd7rj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VaJayJayComingThru", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You don't want to have sex with her. \n\n\nShe doesn't trust you enough and feel comfortable and safe enough to have sex without hiding herself. \n\n\nSure, you can believe all the comforting messages how she is being the difficult one here who doesn't want to have \"an adult conversation\". There is a reason why she obviously feels like that. It can be nice to believe that her insecurities are her own issue and you are the only one sane here, how you really think she is still beautiful and how just talking could resolve everything if she wouldn't be so wrong kind all time.\n\n\nThe things mentioned above are not something that will get fixed by talking. It is obviously too painful to her to talk about and you obviously have made her feel she can't trust you. \n\n\nBreak up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t want to have sex with her. &lt;/p&gt;\n\n&lt;p&gt;She doesn&amp;#39;t trust you enough and feel comfortable and safe enough to have sex without hiding herself. &lt;/p&gt;\n\n&lt;p&gt;Sure, you can believe all the comforting messages how she is being the difficult one here who doesn&amp;#39;t want to have &amp;quot;an adult conversation&amp;quot;. There is a reason why she obviously feels like that. It can be nice to believe that her insecurities are her own issue and you are the only one sane here, how you really think she is still beautiful and how just talking could resolve everything if she wouldn&amp;#39;t be so wrong kind all time.&lt;/p&gt;\n\n&lt;p&gt;The things mentioned above are not something that will get fixed by talking. It is obviously too painful to her to talk about and you obviously have made her feel she can&amp;#39;t trust you. &lt;/p&gt;\n\n&lt;p&gt;Break up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbd7rj", "score_hidden": false, "stickied": false, "created": 1492328945.0, "created_utc": 1492300145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dganhkz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "demonkobra", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "she hates herself and she hates you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;she hates herself and she hates you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dganhkz", "score_hidden": false, "stickied": false, "created": 1492292501.0, "created_utc": 1492263701.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgan9li", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "turbo-plague", "parent_id": "t1_dgakhbu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Sex problems a year in at 23? Personally I don't think life should be a death march to finding the first person to be miserable with. It's a lot easier and more fulfilling to work through issues with someone who can actually treat you with respect and is more or less on the same page as you to begin with. Sex is supposed to be fun.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sex problems a year in at 23? Personally I don&amp;#39;t think life should be a death march to finding the first person to be miserable with. It&amp;#39;s a lot easier and more fulfilling to work through issues with someone who can actually treat you with respect and is more or less on the same page as you to begin with. Sex is supposed to be fun.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgan9li", "score_hidden": false, "stickied": false, "created": 1492292085.0, "created_utc": 1492263285.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgapwah", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SleepytimeMuseo", "parent_id": "t1_dgakhbu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's likely she's frustrated with herself for not managing her life well and taking it out on him. Weight gain will make a woman not feel sexy, and sex can feel like a chore if you don't like your body. Ultimately she has no incentive to work on her own faults when it's easier to make her bf the scapegoat.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s likely she&amp;#39;s frustrated with herself for not managing her life well and taking it out on him. Weight gain will make a woman not feel sexy, and sex can feel like a chore if you don&amp;#39;t like your body. Ultimately she has no incentive to work on her own faults when it&amp;#39;s easier to make her bf the scapegoat.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgapwah", "score_hidden": false, "stickied": false, "created": 1492296511.0, "created_utc": 1492267711.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgamjci", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "betelg", "parent_id": "t1_dgamat3", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Fortunately almost every thread has someone more enlightened swimming upstream and explaining how wrong sub X is for suggesting thing Y slightly more than thing Z.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fortunately almost every thread has someone more enlightened swimming upstream and explaining how wrong sub X is for suggesting thing Y slightly more than thing Z.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgamjci", "score_hidden": false, "stickied": false, "created": 1492290684.0, "created_utc": 1492261884.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgamat3", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Lightningy", "parent_id": "t1_dgakhbu", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Ah, this is a rare comment in this sub. Normally they would recommend counseling or breaking up. Its like most of the people here hate happiness. They don't realize that nobody is perfect.  \n  \n-Nobody", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah, this is a rare comment in this sub. Normally they would recommend counseling or breaking up. Its like most of the people here hate happiness. They don&amp;#39;t realize that nobody is perfect.  &lt;/p&gt;\n\n&lt;p&gt;-Nobody&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgamat3", "score_hidden": false, "stickied": false, "created": 1492290198.0, "created_utc": 1492261398.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgan1p3", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "kjazzcat", "parent_id": "t1_dgakhbu", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Yes I think there's something deeper going on here. Maybe she feels obligated to have sex when you initiate but isn't in the mood. Just speculating but like u/audionautix said, every relationship has problems at some point. Maybe you can work through them, maybe you can't. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes I think there&amp;#39;s something deeper going on here. Maybe she feels obligated to have sex when you initiate but isn&amp;#39;t in the mood. Just speculating but like &lt;a href=\"/u/audionautix\"&gt;u/audionautix&lt;/a&gt; said, every relationship has problems at some point. Maybe you can work through them, maybe you can&amp;#39;t. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgan1p3", "score_hidden": false, "stickied": false, "created": 1492291680.0, "created_utc": 1492262880.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakhbu", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "audionautix", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Two or three times a week? Buddy you have it great and you don't even know it. Anyway, so she has sex with you, but deep down she resents you for it, which is why you're being punished afterwards. You need to find out where the anger is really coming from. Maybe she's frustrated with unrelated things in the relationship. If you stick around long enough, all relationships are shitty, no matter who you end up with. That's the hard sad truth nobody tells you. So stick around.Do the work and make it work. That's where real love comes from.        ", "edited": 1492257428.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Two or three times a week? Buddy you have it great and you don&amp;#39;t even know it. Anyway, so she has sex with you, but deep down she resents you for it, which is why you&amp;#39;re being punished afterwards. You need to find out where the anger is really coming from. Maybe she&amp;#39;s frustrated with unrelated things in the relationship. If you stick around long enough, all relationships are shitty, no matter who you end up with. That&amp;#39;s the hard sad truth nobody tells you. So stick around.Do the work and make it work. That&amp;#39;s where real love comes from.        &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgakhbu", "score_hidden": false, "stickied": false, "created": 1492286012.0, "created_utc": 1492257212.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgargt4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Unshavenhelga", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Congratulations on your stamina. Seriously, though, how long are you actually having sex for? Is her view rooted in something rational? It seems as if she's exhibiting guilt or shame.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congratulations on your stamina. Seriously, though, how long are you actually having sex for? Is her view rooted in something rational? It seems as if she&amp;#39;s exhibiting guilt or shame.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgargt4", "score_hidden": false, "stickied": false, "created": 1492298810.0, "created_utc": 1492270010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgarjkl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CYLKCD", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just sounds like she's finding reasons to put the blame onto you when you haven't done anything wrong (Poor time management skills). Sex is a two way thing. It's not 'given' and you don't owe each other anything. When she says I give you sex it sounds like you're obligated to give something back when you aren't. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just sounds like she&amp;#39;s finding reasons to put the blame onto you when you haven&amp;#39;t done anything wrong (Poor time management skills). Sex is a two way thing. It&amp;#39;s not &amp;#39;given&amp;#39; and you don&amp;#39;t owe each other anything. When she says I give you sex it sounds like you&amp;#39;re obligated to give something back when you aren&amp;#39;t. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgarjkl", "score_hidden": false, "stickied": false, "created": 1492298918.0, "created_utc": 1492270118.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgatiqf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hyacinth_girl", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I haven't read all the comments, so I'm sorry if I'm repeating something. I am not going to remark on most of your problem, but I do have an issue in common with her. My bf is one of those guys who falls asleep right after sex, so he only wants to do it at bedtime. I *hate* this. I have trouble falling asleep as it is, but also instead of getting sleepy sex wakes me up. I don't get enough rest if we do it at bedtime. Try initiating earlier in the day and see if she's receptive to that. I know there are many pillars of this problem, but this might solve one of them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t read all the comments, so I&amp;#39;m sorry if I&amp;#39;m repeating something. I am not going to remark on most of your problem, but I do have an issue in common with her. My bf is one of those guys who falls asleep right after sex, so he only wants to do it at bedtime. I &lt;em&gt;hate&lt;/em&gt; this. I have trouble falling asleep as it is, but also instead of getting sleepy sex wakes me up. I don&amp;#39;t get enough rest if we do it at bedtime. Try initiating earlier in the day and see if she&amp;#39;s receptive to that. I know there are many pillars of this problem, but this might solve one of them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgatiqf", "score_hidden": false, "stickied": false, "created": 1492301678.0, "created_utc": 1492272878.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgav0zu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "doggos_for_days", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"I always give you sex\" Wow, first red flag. That's a horrifying way to put it, and it makes me concerned that she views sex this way. And after a year?! This is supposed to be the honeymoon stage still. \n\nThe issue is that this is problems that *she* has to figure out herself, the self image issues and poor communication skills. But it's not much you can do on your end, other than encourage her to maybe go for walks together, perhaps encourage her to see a counselor or therapist - or break up, honestly. One thing is certain, you will end up asking advice in /deadbedrooms six months from now if this keeps going. ", "edited": 1492275205.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I always give you sex&amp;quot; Wow, first red flag. That&amp;#39;s a horrifying way to put it, and it makes me concerned that she views sex this way. And after a year?! This is supposed to be the honeymoon stage still. &lt;/p&gt;\n\n&lt;p&gt;The issue is that this is problems that &lt;em&gt;she&lt;/em&gt; has to figure out herself, the self image issues and poor communication skills. But it&amp;#39;s not much you can do on your end, other than encourage her to maybe go for walks together, perhaps encourage her to see a counselor or therapist - or break up, honestly. One thing is certain, you will end up asking advice in /deadbedrooms six months from now if this keeps going. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgav0zu", "score_hidden": false, "stickied": false, "created": 1492303811.0, "created_utc": 1492275011.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaxgsk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_N1ng3n", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm pressed for time so not going to give the good lengthy responses others have but I recommend (and you'll have to word this politely so she doesn't think you're accusing her of being fat) that you guys go to the gym together a couple times a week and do some cardio. Even though she's being immature I empathize with the issue of being tired after sex. I feel exhausted for an entire day after I fuck my boyfriend hard but I know it's because I'm in terrible cardiovascular shape and would never inflict that frustration on him. One of my goals for 2017 is to do more cardio so that exhaustion doesn't strain my desire for sex. I hope she can have the same viewpoint.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pressed for time so not going to give the good lengthy responses others have but I recommend (and you&amp;#39;ll have to word this politely so she doesn&amp;#39;t think you&amp;#39;re accusing her of being fat) that you guys go to the gym together a couple times a week and do some cardio. Even though she&amp;#39;s being immature I empathize with the issue of being tired after sex. I feel exhausted for an entire day after I fuck my boyfriend hard but I know it&amp;#39;s because I&amp;#39;m in terrible cardiovascular shape and would never inflict that frustration on him. One of my goals for 2017 is to do more cardio so that exhaustion doesn&amp;#39;t strain my desire for sex. I hope she can have the same viewpoint.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaxgsk", "score_hidden": false, "stickied": false, "created": 1492307130.0, "created_utc": 1492278330.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgb1s0n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lord_Locke", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Get a second girlfriend, or break up then get another girlfriend, or break up and don't get a girlfriend, but have sex with lots of other girls.\n\nEither way, this girlfriend isn't compatible with you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get a second girlfriend, or break up then get another girlfriend, or break up and don&amp;#39;t get a girlfriend, but have sex with lots of other girls.&lt;/p&gt;\n\n&lt;p&gt;Either way, this girlfriend isn&amp;#39;t compatible with you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb1s0n", "score_hidden": false, "stickied": false, "created": 1492312962.0, "created_utc": 1492284162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgb2ur3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BogusBuffalo", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I've always been raised with the \"diamond in the rough\"(is this the correct saying) type mentality. Where If do my best and try my hardest things will play out perfectly in the end. \n\nThat's not how relationships work.  Later in life, yes, but not when you're dating someone.  You need to be with someone who communicates openly and is willing to listen.  You have stated she doesn't listen and doesn't communicate.\n\n&gt; I can't honestly tell if it's me thinking negatively and things in this relationship are better than I think they are or they're really as bad as I think they are and I'm telling myself everything is going to be alright. \n\nDating someone shouldn't be this hard, especially not in the first year.  You're telling yourself everything is going to be alright, but it isn't - she's already set the tone for what a long term relationship is going to be like with her.\n\nDo you really want to be with someone who doesn't like having sex with you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ve always been raised with the &amp;quot;diamond in the rough&amp;quot;(is this the correct saying) type mentality. Where If do my best and try my hardest things will play out perfectly in the end. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not how relationships work.  Later in life, yes, but not when you&amp;#39;re dating someone.  You need to be with someone who communicates openly and is willing to listen.  You have stated she doesn&amp;#39;t listen and doesn&amp;#39;t communicate.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I can&amp;#39;t honestly tell if it&amp;#39;s me thinking negatively and things in this relationship are better than I think they are or they&amp;#39;re really as bad as I think they are and I&amp;#39;m telling myself everything is going to be alright. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Dating someone shouldn&amp;#39;t be this hard, especially not in the first year.  You&amp;#39;re telling yourself everything is going to be alright, but it isn&amp;#39;t - she&amp;#39;s already set the tone for what a long term relationship is going to be like with her.&lt;/p&gt;\n\n&lt;p&gt;Do you really want to be with someone who doesn&amp;#39;t like having sex with you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb2ur3", "score_hidden": false, "stickied": false, "created": 1492314405.0, "created_utc": 1492285605.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbij62", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgb3wsf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you, I added one last edit to my post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I added one last edit to my post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbij62", "score_hidden": false, "stickied": false, "created": 1492336542.0, "created_utc": 1492307742.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3wsf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "eccentricgiraffe", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "1. Taking the easy way out is ok.\n\n2. Have you tried not initiating sex? Backing off for a while and considering your timing (eg, are there things that need to be done? then keep it zipped until later.) can lead to more enthusiasm and less complaining about having sex too often.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Taking the easy way out is ok.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Have you tried not initiating sex? Backing off for a while and considering your timing (eg, are there things that need to be done? then keep it zipped until later.) can lead to more enthusiasm and less complaining about having sex too often.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb3wsf", "score_hidden": false, "stickied": false, "created": 1492315860.0, "created_utc": 1492287060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbmjta", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DarlinMermaidDarlin", "parent_id": "t1_dgbif6r", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm glad you got to say the things you needed to say and you your stuff. But your ex's (right?) mom is so wrong. There is no relationship in the world that should be built on the idea that one person gets their way all the time and the other person gets walked so over. Uh-uh. You've got so many years ahead of you. Please don't waste another day of them in this unhappy relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad you got to say the things you needed to say and you your stuff. But your ex&amp;#39;s (right?) mom is so wrong. There is no relationship in the world that should be built on the idea that one person gets their way all the time and the other person gets walked so over. Uh-uh. You&amp;#39;ve got so many years ahead of you. Please don&amp;#39;t waste another day of them in this unhappy relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbmjta", "score_hidden": false, "stickied": false, "created": 1492342542.0, "created_utc": 1492313742.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbif6r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgb4kd9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you, I added one last edit to my post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I added one last edit to my post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbif6r", "score_hidden": false, "stickied": false, "created": 1492336379.0, "created_utc": 1492307579.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4kd9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DarlinMermaidDarlin", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Re: edit 3\n\nThis isn't just on you to work hard and fix, just like she shouldn't view your bedroom time as \"giving you sex.\" Both of you have to work hard to have a successful relationship (and if you both really care about the other, it shouldn't feel like work) and it sounds like she's admiring the problem instead of solving it. \n\nShe sounds young and immature and sometimes it's distance from issues that help people to grow up. There's no honor in sticking through a crappy situation just because it's hard. You see breaking up as the \"easy way out\" and sometimes it's the healthy and wise way. It's like you're the guy trying to roll cement blocks and you're proud of your hard work, while scoffing at your neighbor for sanding down the edges. \n\nTry having a one last come to Jesus talk. Tell her your concerns, that you want to work together on this, and consider getting couples counseling to better facilitate your communication. If she gives you that deadpan look, refuses to communicate or see someone, you know how much she's willing to work on things with you. Neither one of you sounds particularly happy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Re: edit 3&lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t just on you to work hard and fix, just like she shouldn&amp;#39;t view your bedroom time as &amp;quot;giving you sex.&amp;quot; Both of you have to work hard to have a successful relationship (and if you both really care about the other, it shouldn&amp;#39;t feel like work) and it sounds like she&amp;#39;s admiring the problem instead of solving it. &lt;/p&gt;\n\n&lt;p&gt;She sounds young and immature and sometimes it&amp;#39;s distance from issues that help people to grow up. There&amp;#39;s no honor in sticking through a crappy situation just because it&amp;#39;s hard. You see breaking up as the &amp;quot;easy way out&amp;quot; and sometimes it&amp;#39;s the healthy and wise way. It&amp;#39;s like you&amp;#39;re the guy trying to roll cement blocks and you&amp;#39;re proud of your hard work, while scoffing at your neighbor for sanding down the edges. &lt;/p&gt;\n\n&lt;p&gt;Try having a one last come to Jesus talk. Tell her your concerns, that you want to work together on this, and consider getting couples counseling to better facilitate your communication. If she gives you that deadpan look, refuses to communicate or see someone, you know how much she&amp;#39;s willing to work on things with you. Neither one of you sounds particularly happy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb4kd9", "score_hidden": false, "stickied": false, "created": 1492316756.0, "created_utc": 1492287956.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbincw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "twentyninethrowaways", "parent_id": "t1_dgbifmg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That feeling of relief you feel now will last forever because you got rid of somebody that sounds kind of...unbalanced.  That's good.\n\nBut no, because other people are involved, doing your best and trying your hardest isn't going to solve everything in relationships. In the singular pursuits in your life, yes...but in relationships- no.  Because there is *another person, with their own autonomy*.     ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That feeling of relief you feel now will last forever because you got rid of somebody that sounds kind of...unbalanced.  That&amp;#39;s good.&lt;/p&gt;\n\n&lt;p&gt;But no, because other people are involved, doing your best and trying your hardest isn&amp;#39;t going to solve everything in relationships. In the singular pursuits in your life, yes...but in relationships- no.  Because there is &lt;em&gt;another person, with their own autonomy&lt;/em&gt;.     &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbincw", "score_hidden": false, "stickied": false, "created": 1492336716.0, "created_utc": 1492307916.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbifmg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgb5166", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you, I added one last edit to my post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I added one last edit to my post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbifmg", "score_hidden": false, "stickied": false, "created": 1492336398.0, "created_utc": 1492307598.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5166", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "twentyninethrowaways", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;Where If do my best and try my hardest things will play out perfectly in the end.\n\nAs enjoyable as this sentiment is, it's just not true and *very* naive.  Other people, man.  Other people can and will keep things from \"playing out perfectly\" even if you do everything right.\n\nDid you really think you could maintain a relationship through the sheer force of your will?  No.  No no no no no.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Where If do my best and try my hardest things will play out perfectly in the end.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As enjoyable as this sentiment is, it&amp;#39;s just not true and &lt;em&gt;very&lt;/em&gt; naive.  Other people, man.  Other people can and will keep things from &amp;quot;playing out perfectly&amp;quot; even if you do everything right.&lt;/p&gt;\n\n&lt;p&gt;Did you really think you could maintain a relationship through the sheer force of your will?  No.  No no no no no.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb5166", "score_hidden": false, "stickied": false, "created": 1492317388.0, "created_utc": 1492288588.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgb6pnh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BubblesBlue007", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": " Find someone else to enjoy your life with and all it entails. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Find someone else to enjoy your life with and all it entails. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb6pnh", "score_hidden": false, "stickied": false, "created": 1492319705.0, "created_utc": 1492290905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbihlt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgbb5w9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Abusive. Extremely abusive. I am/was her first serious relationship that didn't begin or end in abuse or drunk hook-ups.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Abusive. Extremely abusive. I am/was her first serious relationship that didn&amp;#39;t begin or end in abuse or drunk hook-ups.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbihlt", "score_hidden": false, "stickied": false, "created": 1492336479.0, "created_utc": 1492307679.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbb5w9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gormnation", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What were her previous relationships like? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What were her previous relationships like? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbb5w9", "score_hidden": false, "stickied": false, "created": 1492326014.0, "created_utc": 1492297214.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbdati", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "girlns", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "same as me, she needs a \"cool down\" session, have a break both of you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;same as me, she needs a &amp;quot;cool down&amp;quot; session, have a break both of you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbdati", "score_hidden": false, "stickied": false, "created": 1492329060.0, "created_utc": 1492300260.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbiirj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgbgnyj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you, I added one last edit to my post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I added one last edit to my post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbiirj", "score_hidden": false, "stickied": false, "created": 1492336526.0, "created_utc": 1492307726.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbgnyj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Whallywhaler", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Her behavior is concerning. Sure. \n\nWhat's really concerning is you've addressed and she doesn't give a damn. That's all you need to know. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Her behavior is concerning. Sure. &lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s really concerning is you&amp;#39;ve addressed and she doesn&amp;#39;t give a damn. That&amp;#39;s all you need to know. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbgnyj", "score_hidden": false, "stickied": false, "created": 1492333821.0, "created_utc": 1492305021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbj8ig", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgbiu70", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What do you mean?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do you mean?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbj8ig", "score_hidden": false, "stickied": false, "created": 1492337586.0, "created_utc": 1492308786.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbiu70", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "abcdefghi1234567", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This update was not sufficient. Definitely need more information. But this isn't done by a long shot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This update was not sufficient. Definitely need more information. But this isn&amp;#39;t done by a long shot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbiu70", "score_hidden": false, "stickied": false, "created": 1492336997.0, "created_utc": 1492308197.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbjjkj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wiggy222", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "In my experience these kind of behaviours only ever get worse as people age. I suggest you may need to assess your relationship, and whether you would be comfortable with this (or worse) behaviour long term.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my experience these kind of behaviours only ever get worse as people age. I suggest you may need to assess your relationship, and whether you would be comfortable with this (or worse) behaviour long term.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbjjkj", "score_hidden": false, "stickied": false, "created": 1492338034.0, "created_utc": 1492309234.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgblftq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "capilot", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; As we are driving her phone is going off a lot and she looked at her phone and seemed even more upset. I asked her if everything was alright and who she was talking to because I was worried something came up. She ignores this for a bit and then shows me its her friends texting her. I asked her if everything was alright and whats going on to which she snaps and said that I'm being nosy and that it's none of my business\n\nThat raised the cheating red alert flag for me. Phone hiding is almost always a sign of cheating.\n\nThe rest of it was symptoms of someone who doesn't want to be in a relationship.\n\n&gt; Her mom told me that the only way to deal with her is to let her have her way all the time.\n\nThat does not bode well for a happy future.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;As we are driving her phone is going off a lot and she looked at her phone and seemed even more upset. I asked her if everything was alright and who she was talking to because I was worried something came up. She ignores this for a bit and then shows me its her friends texting her. I asked her if everything was alright and whats going on to which she snaps and said that I&amp;#39;m being nosy and that it&amp;#39;s none of my business&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That raised the cheating red alert flag for me. Phone hiding is almost always a sign of cheating.&lt;/p&gt;\n\n&lt;p&gt;The rest of it was symptoms of someone who doesn&amp;#39;t want to be in a relationship.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Her mom told me that the only way to deal with her is to let her have her way all the time.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That does not bode well for a happy future.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgblftq", "score_hidden": false, "stickied": false, "created": 1492340823.0, "created_utc": 1492312023.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgatpfi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "enderfem", "parent_id": "t1_dgat7it", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It sounds like she has some hang ups regarding sex (mostly because of the no noise thing and the don't look at her thing) is she willing to seek counseling with you? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like she has some hang ups regarding sex (mostly because of the no noise thing and the don&amp;#39;t look at her thing) is she willing to seek counseling with you? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgatpfi", "score_hidden": false, "stickied": false, "created": 1492301943.0, "created_utc": 1492273143.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgat7it", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgar2ow", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I don't mind you third point. You have reason to think that because I never mentioned it anywhere else.\n\nSomeone tell me in case I'm a fool and really am selfish and don't realize it. I.. really haven't done any of the things I've wanted to do in regards to sex with her besides passion. Blowjobs? She told me from the get-go that she didn't like to do them. In our over one year of dating I've had three of them and have never forced her or bargained for one before. When I cum I pull out and cum in a condom. \n\nI've never really been able to \"have my way\" in regards to sex because she has never been interested in anything more than quiet passionate sex. She doesn't like talking. She doesn't like me looking at her. She likes me to kiss on her, go down on her, and fuck her. \n\nI've never really bothered doing anything else because I know she feels good and I get pleasure knowing my partner feels good. There are things that I would like to do and I've voiced them but they have yet to happen and I doubt they ever will.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t mind you third point. You have reason to think that because I never mentioned it anywhere else.&lt;/p&gt;\n\n&lt;p&gt;Someone tell me in case I&amp;#39;m a fool and really am selfish and don&amp;#39;t realize it. I.. really haven&amp;#39;t done any of the things I&amp;#39;ve wanted to do in regards to sex with her besides passion. Blowjobs? She told me from the get-go that she didn&amp;#39;t like to do them. In our over one year of dating I&amp;#39;ve had three of them and have never forced her or bargained for one before. When I cum I pull out and cum in a condom. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never really been able to &amp;quot;have my way&amp;quot; in regards to sex because she has never been interested in anything more than quiet passionate sex. She doesn&amp;#39;t like talking. She doesn&amp;#39;t like me looking at her. She likes me to kiss on her, go down on her, and fuck her. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never really bothered doing anything else because I know she feels good and I get pleasure knowing my partner feels good. There are things that I would like to do and I&amp;#39;ve voiced them but they have yet to happen and I doubt they ever will.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgat7it", "score_hidden": false, "stickied": false, "created": 1492301250.0, "created_utc": 1492272450.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgar2ow", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "toomanyrougneds", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "1. Break up with her.\n\n2. Get some good counselling to understand why you let yourself get into this mess. \n\n3. I hesitate to mention this because I know I'll be downvoted to hell and back and I might very well be wrong, but ask yourself if you might have been a little sexually selfish in this relationship. Her reactions are off and disturbing but they're what you get when the guy is all about blowjobs and anal. When it's all about the holy perfect male ejaculation all the time, blowjob after blowjob after blowjob after awful, unpleasant, painful, sexually neutering, humiliating blowjob, you start to think that you must be too ugly and fat and disgusting to actually fuck - or to be considered an equal human being. There's nothing more calculated to send an already insecure woman spiralling down the drain of self-hate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Break up with her.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Get some good counselling to understand why you let yourself get into this mess. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I hesitate to mention this because I know I&amp;#39;ll be downvoted to hell and back and I might very well be wrong, but ask yourself if you might have been a little sexually selfish in this relationship. Her reactions are off and disturbing but they&amp;#39;re what you get when the guy is all about blowjobs and anal. When it&amp;#39;s all about the holy perfect male ejaculation all the time, blowjob after blowjob after blowjob after awful, unpleasant, painful, sexually neutering, humiliating blowjob, you start to think that you must be too ugly and fat and disgusting to actually fuck - or to be considered an equal human being. There&amp;#39;s nothing more calculated to send an already insecure woman spiralling down the drain of self-hate.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgar2ow", "score_hidden": false, "stickied": false, "created": 1492298249.0, "created_utc": 1492269449.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgbrfnx", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "enderfem", "parent_id": "t1_dgbkast", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You cannot be in a romantic partnership with someone who has to have her way all the time. Her mom didn't do her or the world any favors by letting your ex have her way. You are not responsible for her, and unless she does some serious work on herself **first**, you should not take her back. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You cannot be in a romantic partnership with someone who has to have her way all the time. Her mom didn&amp;#39;t do her or the world any favors by letting your ex have her way. You are not responsible for her, and unless she does some serious work on herself &lt;strong&gt;first&lt;/strong&gt;, you should not take her back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbrfnx", "score_hidden": false, "stickied": false, "created": 1492351382.0, "created_utc": 1492322582.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbkast", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgbjxt4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Look at my edit 6.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look at my edit 6.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbkast", "score_hidden": false, "stickied": false, "created": 1492339156.0, "created_utc": 1492310356.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbjxt4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spektor0925", "parent_id": "t1_dgbjdtx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Shes being petty and ridiculous.\n\nIt may hurt now, but after that pain subsides you'll realize the bullet you're dodging here.\n\nCut her off completely.  Go out with some friends and try to have a good time.  Admittedly, that always helped me after a breakup.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shes being petty and ridiculous.&lt;/p&gt;\n\n&lt;p&gt;It may hurt now, but after that pain subsides you&amp;#39;ll realize the bullet you&amp;#39;re dodging here.&lt;/p&gt;\n\n&lt;p&gt;Cut her off completely.  Go out with some friends and try to have a good time.  Admittedly, that always helped me after a breakup.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbjxt4", "score_hidden": false, "stickied": false, "created": 1492338626.0, "created_utc": 1492309826.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbjdtx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgbiy15", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "When we got into that first fight that I mentioned in my edit. I saw that she had unblocked her ex's number from her phone and he tried to call her while I was there. I asked her why she unblocked him and started talking to him to which she said that she was upset and angry at me and that she figured that by unblocking him it would make me upset. \n\nI highly doubt she cheated on me thus far. Actually that is the only thing I'm confident she hasn't done. What I do agree on is that she might have been planning to cheat on me. After seeing her going out tonight I have a feeling that she wants to get back at me. Don't want to think about it much because I know it will get to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When we got into that first fight that I mentioned in my edit. I saw that she had unblocked her ex&amp;#39;s number from her phone and he tried to call her while I was there. I asked her why she unblocked him and started talking to him to which she said that she was upset and angry at me and that she figured that by unblocking him it would make me upset. &lt;/p&gt;\n\n&lt;p&gt;I highly doubt she cheated on me thus far. Actually that is the only thing I&amp;#39;m confident she hasn&amp;#39;t done. What I do agree on is that she might have been planning to cheat on me. After seeing her going out tonight I have a feeling that she wants to get back at me. Don&amp;#39;t want to think about it much because I know it will get to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbjdtx", "score_hidden": false, "stickied": false, "created": 1492337796.0, "created_utc": 1492308996.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbiy15", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spektor0925", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Re: edit 4\n\nShe was cheating on you, or planning to, guaranteed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Re: edit 4&lt;/p&gt;\n\n&lt;p&gt;She was cheating on you, or planning to, guaranteed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbiy15", "score_hidden": false, "stickied": false, "created": 1492337154.0, "created_utc": 1492308354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgah9n0", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Evil_Thresh", "parent_id": "t1_dgah32c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Is she using \"I give you sex\" as a bargaining chip? It's something both party should enjoy and not a tool for passive aggressive berating. She really needs to stop hiding her incompetence to get her shit done behind \"giving\" sex. Maybe you should tell her you are just going to wank it from now on lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is she using &amp;quot;I give you sex&amp;quot; as a bargaining chip? It&amp;#39;s something both party should enjoy and not a tool for passive aggressive berating. She really needs to stop hiding her incompetence to get her shit done behind &amp;quot;giving&amp;quot; sex. Maybe you should tell her you are just going to wank it from now on lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgah9n0", "score_hidden": false, "stickied": false, "created": 1492276182.0, "created_utc": 1492247382.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgal3l9", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "lamamaloca", "parent_id": "t1_dgajj52", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'd listen to her and go find another girl, one who's emotionally mature. \n\nIf you want to try one more time, tell her you can't live with this behavior and she needs to get therapy or you're done. ", "edited": 1492263013.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d listen to her and go find another girl, one who&amp;#39;s emotionally mature. &lt;/p&gt;\n\n&lt;p&gt;If you want to try one more time, tell her you can&amp;#39;t live with this behavior and she needs to get therapy or you&amp;#39;re done. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgal3l9", "score_hidden": false, "stickied": false, "created": 1492287543.0, "created_utc": 1492258743.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaroom", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheHatOnTheCat", "parent_id": "t1_dganshi", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There is a point where one person can't solve a couple's problems by themselves. I don't know your girlfriend's side of things and we can give you lots of ideas but it's possible you can't fix this.\n\nMy other suggestion would be to have a conversation completely about her sexual feelings/desires with no pressure or talk of your own feelings/needs at that time. \n\nSo asking her things like:Do you enjoy when we have sex?, Is there anything I can do to make sex better for you? If you don't feel like having sex, do you say no? How do you think I'll react if you say no? How often would you like us to have sex? I've noticed you say some pretty negative stuff about your body and try and hide it from me; is there anything I could be doing to reassure you I find you beautiful?\n\nSomething that occurs to me here is maybe her body issues are impacting her ability to be excited about and properly enjoy sex? If she spends her time slef-conscious about you seeing her and doubting hiding herself maybe it's harder for her to get into the moment? Would it be possible for you to see a couples counselor or sex therapist together?\n\nAnother question is is your gf trying to change her body if she is so unhappy with it? Are you being supportive/helpful of her efforts? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a point where one person can&amp;#39;t solve a couple&amp;#39;s problems by themselves. I don&amp;#39;t know your girlfriend&amp;#39;s side of things and we can give you lots of ideas but it&amp;#39;s possible you can&amp;#39;t fix this.&lt;/p&gt;\n\n&lt;p&gt;My other suggestion would be to have a conversation completely about her sexual feelings/desires with no pressure or talk of your own feelings/needs at that time. &lt;/p&gt;\n\n&lt;p&gt;So asking her things like:Do you enjoy when we have sex?, Is there anything I can do to make sex better for you? If you don&amp;#39;t feel like having sex, do you say no? How do you think I&amp;#39;ll react if you say no? How often would you like us to have sex? I&amp;#39;ve noticed you say some pretty negative stuff about your body and try and hide it from me; is there anything I could be doing to reassure you I find you beautiful?&lt;/p&gt;\n\n&lt;p&gt;Something that occurs to me here is maybe her body issues are impacting her ability to be excited about and properly enjoy sex? If she spends her time slef-conscious about you seeing her and doubting hiding herself maybe it&amp;#39;s harder for her to get into the moment? Would it be possible for you to see a couples counselor or sex therapist together?&lt;/p&gt;\n\n&lt;p&gt;Another question is is your gf trying to change her body if she is so unhappy with it? Are you being supportive/helpful of her efforts? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaroom", "score_hidden": false, "stickied": false, "created": 1492299119.0, "created_utc": 1492270319.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dganshi", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgam8po", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've asked her to please not be so negative before, during, and after sex. She tends to berate/put herself down because of her looks and or body image. I've asked her not to feel obligated to have sex with me and to turn me down if she wasn't feeling in the mood. \n\nI've told her that her lack of initiation or enthusiasm when it comes to anything sexual makes me feel like she doesn't want me.  I've even told her all the things I've listed in this post.\n\nI've asked her what's wrong if anything on my side that I can change that would make things better. \n\nI'm a very direct person. I've been raised to be an open person and have never been afraid to say whats on my mind. I've told her everything I'm posting here in this thread and even some of the things people are recommending me as I've thought about this subject before.\n\n\nNothing really seems to work. She just gives me this look its a deadpan look. It's one of those looks where you know the other person really isn't paying attention. However, she is quick to pick out one or two words from everything I've said and throw them back at me like I was trying to insult her in some way.\n\nedit: adding this to main post also.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve asked her to please not be so negative before, during, and after sex. She tends to berate/put herself down because of her looks and or body image. I&amp;#39;ve asked her not to feel obligated to have sex with me and to turn me down if she wasn&amp;#39;t feeling in the mood. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve told her that her lack of initiation or enthusiasm when it comes to anything sexual makes me feel like she doesn&amp;#39;t want me.  I&amp;#39;ve even told her all the things I&amp;#39;ve listed in this post.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve asked her what&amp;#39;s wrong if anything on my side that I can change that would make things better. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a very direct person. I&amp;#39;ve been raised to be an open person and have never been afraid to say whats on my mind. I&amp;#39;ve told her everything I&amp;#39;m posting here in this thread and even some of the things people are recommending me as I&amp;#39;ve thought about this subject before.&lt;/p&gt;\n\n&lt;p&gt;Nothing really seems to work. She just gives me this look its a deadpan look. It&amp;#39;s one of those looks where you know the other person really isn&amp;#39;t paying attention. However, she is quick to pick out one or two words from everything I&amp;#39;ve said and throw them back at me like I was trying to insult her in some way.&lt;/p&gt;\n\n&lt;p&gt;edit: adding this to main post also.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dganshi", "score_hidden": false, "stickied": false, "created": 1492293055.0, "created_utc": 1492264255.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgam8po", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "TheHatOnTheCat", "parent_id": "t1_dgajj52", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It sounds like the biggest problem is your relationship is actually communication. \n\nWhat sort of compromises on sex are you asking for?\n\nMaybe talk to her and say you only want to have sex if she wants to as well. And make it about your feelings. Tell her that when she says she is only having sex for you/giving it to you it makes you feel unattractive and unwanted. That her comments hurt your feelings because you want sex to be something you both wanted and enjoyed.\n\nThen when she complains just stick to the line of responding about your feelings. \"Honey, it really hurts my feelings when you say that. It makes me feel like you don't want me and to be intimate with me but are just servicing me as some sort of favor.\" Oh but I'm just so tired blah blah. \"I wish you would have said no if you didn't want to have sex. Men need to feel wanted to. This really makes me sad. It makes me regret having been intimate with you.\" \n\n**Edit:** I'm not going to tell you to break up with her but until the two of you (including her) can communicate in a mature way, comprise, empathize with each other (both ways), and support each other (not just you support her) do not get married or have children with her. You need a life partner who can communicate and comprise on life decisions. And while kids are wonderful they are also hard and require good empathy and teamwork between parents. ", "edited": 1492261733.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like the biggest problem is your relationship is actually communication. &lt;/p&gt;\n\n&lt;p&gt;What sort of compromises on sex are you asking for?&lt;/p&gt;\n\n&lt;p&gt;Maybe talk to her and say you only want to have sex if she wants to as well. And make it about your feelings. Tell her that when she says she is only having sex for you/giving it to you it makes you feel unattractive and unwanted. That her comments hurt your feelings because you want sex to be something you both wanted and enjoyed.&lt;/p&gt;\n\n&lt;p&gt;Then when she complains just stick to the line of responding about your feelings. &amp;quot;Honey, it really hurts my feelings when you say that. It makes me feel like you don&amp;#39;t want me and to be intimate with me but are just servicing me as some sort of favor.&amp;quot; Oh but I&amp;#39;m just so tired blah blah. &amp;quot;I wish you would have said no if you didn&amp;#39;t want to have sex. Men need to feel wanted to. This really makes me sad. It makes me regret having been intimate with you.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit:&lt;/strong&gt; I&amp;#39;m not going to tell you to break up with her but until the two of you (including her) can communicate in a mature way, comprise, empathize with each other (both ways), and support each other (not just you support her) do not get married or have children with her. You need a life partner who can communicate and comprise on life decisions. And while kids are wonderful they are also hard and require good empathy and teamwork between parents. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgam8po", "score_hidden": false, "stickied": false, "created": 1492290077.0, "created_utc": 1492261277.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgapju2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "stephiej17", "parent_id": "t1_dgajj52", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Do you see how this is going to start affecting YOUR self esteem? Dude.. be with someone who raises you up and makes you feel good. Not someone who tears you down when you do something that is literally supposed to bring you together. \n\nAn hour is 4% of her day. \n\nYou deserve to feel good about yourself too. You don't deserve this horrible accusations she's throwing at you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you see how this is going to start affecting YOUR self esteem? Dude.. be with someone who raises you up and makes you feel good. Not someone who tears you down when you do something that is literally supposed to bring you together. &lt;/p&gt;\n\n&lt;p&gt;An hour is 4% of her day. &lt;/p&gt;\n\n&lt;p&gt;You deserve to feel good about yourself too. You don&amp;#39;t deserve this horrible accusations she&amp;#39;s throwing at you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgapju2", "score_hidden": false, "stickied": false, "created": 1492295991.0, "created_utc": 1492267191.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgajlz6", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ANewHopeWithKids", "parent_id": "t1_dgajj52", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So you break down the stonewall by being persistent with not stopping.\n\n\"It's not *about* you \"being the kind of girl I want\", it's about *this*.\" or \"Because I'm not *in* a relationship with another woman, I'm here with you, and I want to *continue* to be here with you, so I'd really appreciate us finding a way to get through this.\" kinds of things.\n\nIt's long.  It's melodramatic.  Either you consider it worth it to get to a place where you want to be, or you stay at square one.  Or you find someone more compatible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you break down the stonewall by being persistent with not stopping.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s not &lt;em&gt;about&lt;/em&gt; you &amp;quot;being the kind of girl I want&amp;quot;, it&amp;#39;s about &lt;em&gt;this&lt;/em&gt;.&amp;quot; or &amp;quot;Because I&amp;#39;m not &lt;em&gt;in&lt;/em&gt; a relationship with another woman, I&amp;#39;m here with you, and I want to &lt;em&gt;continue&lt;/em&gt; to be here with you, so I&amp;#39;d really appreciate us finding a way to get through this.&amp;quot; kinds of things.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s long.  It&amp;#39;s melodramatic.  Either you consider it worth it to get to a place where you want to be, or you stay at square one.  Or you find someone more compatible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgajlz6", "score_hidden": false, "stickied": false, "created": 1492283610.0, "created_utc": 1492254810.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaquun", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fulllotusyoga", "parent_id": "t1_dgajj52", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "At this point I've gotta join the chorus and say, break up. She sounds controlling, insecure, anxious, has trouble gettig chores done, at least a bit of an inferiority complex. Leaving isn't going to ruin her either, she's young and has plenty of time to get her head together/shit together so she can be a decent partner to someone else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At this point I&amp;#39;ve gotta join the chorus and say, break up. She sounds controlling, insecure, anxious, has trouble gettig chores done, at least a bit of an inferiority complex. Leaving isn&amp;#39;t going to ruin her either, she&amp;#39;s young and has plenty of time to get her head together/shit together so she can be a decent partner to someone else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaquun", "score_hidden": false, "stickied": false, "created": 1492297939.0, "created_utc": 1492269139.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgajj52", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgajat3", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've talked to her along the lines of what you are saying. However, she is easily upset even when I sit her down and tell her I'm not trying to argue or start a fight. Any time I suggest we compromise about something sex related she says \"Sorry I'm not the kind of girl you want me to be\" or my favorite \"why don't you go find another girl then\". \n\n\nIt's what makes it so frustrating because when I do try to sit down and talk about stuff she stonewalls me until I'm done and gets upset that I brought it up and were back at square one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve talked to her along the lines of what you are saying. However, she is easily upset even when I sit her down and tell her I&amp;#39;m not trying to argue or start a fight. Any time I suggest we compromise about something sex related she says &amp;quot;Sorry I&amp;#39;m not the kind of girl you want me to be&amp;quot; or my favorite &amp;quot;why don&amp;#39;t you go find another girl then&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s what makes it so frustrating because when I do try to sit down and talk about stuff she stonewalls me until I&amp;#39;m done and gets upset that I brought it up and were back at square one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgajj52", "score_hidden": false, "stickied": false, "created": 1492283374.0, "created_utc": 1492254574.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgajat3", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ANewHopeWithKids", "parent_id": "t1_dgah32c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"Okay, when you say that you \"always give me sex\" and \"can't get things done\" because of that, it frustrates me, because I think that's honestly only happened a few times, unless I'm mistaken?\n\nAnd honestly here, since this is coming from a place of concern and wanting to come to a compromise, how about if you're *not* feeling up to it, or feel pressured by other events that are happening that day, you *are* allowed to tell me no, and I'll have to be okay with that.\n\nJust please understand that I really *do* love you, I find you extremely attractive, and enjoy that time with you, and this isn't about trying to start a fight, or nagging or anything.  I sincerely want *us* to solve the problem *together*.  So...do you have any ideas on how we can do that?  I'm eager to listen.\"\n\n(Then, obviously, you *listen*.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Okay, when you say that you &amp;quot;always give me sex&amp;quot; and &amp;quot;can&amp;#39;t get things done&amp;quot; because of that, it frustrates me, because I think that&amp;#39;s honestly only happened a few times, unless I&amp;#39;m mistaken?&lt;/p&gt;\n\n&lt;p&gt;And honestly here, since this is coming from a place of concern and wanting to come to a compromise, how about if you&amp;#39;re &lt;em&gt;not&lt;/em&gt; feeling up to it, or feel pressured by other events that are happening that day, you &lt;em&gt;are&lt;/em&gt; allowed to tell me no, and I&amp;#39;ll have to be okay with that.&lt;/p&gt;\n\n&lt;p&gt;Just please understand that I really &lt;em&gt;do&lt;/em&gt; love you, I find you extremely attractive, and enjoy that time with you, and this isn&amp;#39;t about trying to start a fight, or nagging or anything.  I sincerely want &lt;em&gt;us&lt;/em&gt; to solve the problem &lt;em&gt;together&lt;/em&gt;.  So...do you have any ideas on how we can do that?  I&amp;#39;m eager to listen.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(Then, obviously, you &lt;em&gt;listen&lt;/em&gt;.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgajat3", "score_hidden": false, "stickied": false, "created": 1492282670.0, "created_utc": 1492253870.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaj1y6", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "maps2001", "parent_id": "t1_dgah32c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Welcome to the rest of your life,a nagging whiny girlfriend who brings things up from the past to throw in your face at every opportunity.She wants you under her thumb,running in circles trying to keep her happy,but when she is imagining things to complain about you will never keep her happy.Run.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Welcome to the rest of your life,a nagging whiny girlfriend who brings things up from the past to throw in your face at every opportunity.She wants you under her thumb,running in circles trying to keep her happy,but when she is imagining things to complain about you will never keep her happy.Run.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaj1y6", "score_hidden": false, "stickied": false, "created": 1492281898.0, "created_utc": 1492253098.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgah32c", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "aaron12153", "parent_id": "t1_dgagz6s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "We got into an argument a few weeks back and her big thing was \"I always give you sex and I'm always tired or can't get things done when I need to because we were having sex\". When in reality we only have sex a few times a week(sometimes only one or two times). There have been a few occasions where we've had sex during the day and needed to do errands that had to be postponed because of it. \n\nShe seems to stick to those few times and forget that... well it was just a few times and since she complained about it the first time I've never done it again. Now she sticks to those snide comments every chance she can get after we have sex. It's beyond frustrating to hear.\n\nedit: adding this to main post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We got into an argument a few weeks back and her big thing was &amp;quot;I always give you sex and I&amp;#39;m always tired or can&amp;#39;t get things done when I need to because we were having sex&amp;quot;. When in reality we only have sex a few times a week(sometimes only one or two times). There have been a few occasions where we&amp;#39;ve had sex during the day and needed to do errands that had to be postponed because of it. &lt;/p&gt;\n\n&lt;p&gt;She seems to stick to those few times and forget that... well it was just a few times and since she complained about it the first time I&amp;#39;ve never done it again. Now she sticks to those snide comments every chance she can get after we have sex. It&amp;#39;s beyond frustrating to hear.&lt;/p&gt;\n\n&lt;p&gt;edit: adding this to main post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgah32c", "score_hidden": false, "stickied": false, "created": 1492275598.0, "created_utc": 1492246798.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgagz6s", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Evil_Thresh", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "In regards to post sex complaints: Just listen and don't take it seriously and move on. Sometimes people just like to rant. If she is serious about not wanting to have sex, she would withhold from doing it or complain before finally partake. In regards to her own self image:  You should just let her know what is an enjoyable sexual experience for you and what it entails, i.e no cloth, with lights, whatever kink it is you are into. It's important to be open with each other about what you guys need to be sexually satisfied. Let her know that anything less and you guys might as well not initiate the activity. If she feels uncomfortable with her body, let her be. You don't have the right to tell her how she feels, and you must let her come to terms with her own body on her own. Just tell her you don't like having sex with her when she is being like that, and it's a less than satisfactory experience when you guys do it like that. If this situation is to persist, then we might as well not have sex and just leave it at that. There you go, you just told her you wanted to stop having sex!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In regards to post sex complaints: Just listen and don&amp;#39;t take it seriously and move on. Sometimes people just like to rant. If she is serious about not wanting to have sex, she would withhold from doing it or complain before finally partake. In regards to her own self image:  You should just let her know what is an enjoyable sexual experience for you and what it entails, i.e no cloth, with lights, whatever kink it is you are into. It&amp;#39;s important to be open with each other about what you guys need to be sexually satisfied. Let her know that anything less and you guys might as well not initiate the activity. If she feels uncomfortable with her body, let her be. You don&amp;#39;t have the right to tell her how she feels, and you must let her come to terms with her own body on her own. Just tell her you don&amp;#39;t like having sex with her when she is being like that, and it&amp;#39;s a less than satisfactory experience when you guys do it like that. If this situation is to persist, then we might as well not have sex and just leave it at that. There you go, you just told her you wanted to stop having sex!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgagz6s", "score_hidden": false, "stickied": false, "created": 1492275258.0, "created_utc": 1492246458.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgaw8lg", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "MBCnerdcore", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You cant really truly love someone who doesnt love themselves.  Mainly because she doesnt like who she is and will make that your fault.  Break up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You cant really truly love someone who doesnt love themselves.  Mainly because she doesnt like who she is and will make that your fault.  Break up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaw8lg", "score_hidden": false, "stickied": false, "created": 1492305466.0, "created_utc": 1492276666.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgatmqc", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "chipmunkmarionette", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Don't break up. \n\nGo see a therapist. Specifically a sex therapist. They exist, though maybe they're called something else. Or couples counselling. There's no shame in that - sometimes people just need a third party to help them work through issues. It's hard to see the whole story when you're in the middle of it. \n\nIf your girlfriend won't talk about it with you or with someone else, then breaking up is the solution. But explain that to her - \"I need to have a solution to this because otherwise I can't see us staying together.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t break up. &lt;/p&gt;\n\n&lt;p&gt;Go see a therapist. Specifically a sex therapist. They exist, though maybe they&amp;#39;re called something else. Or couples counselling. There&amp;#39;s no shame in that - sometimes people just need a third party to help them work through issues. It&amp;#39;s hard to see the whole story when you&amp;#39;re in the middle of it. &lt;/p&gt;\n\n&lt;p&gt;If your girlfriend won&amp;#39;t talk about it with you or with someone else, then breaking up is the solution. But explain that to her - &amp;quot;I need to have a solution to this because otherwise I can&amp;#39;t see us staying together.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgatmqc", "score_hidden": false, "stickied": false, "created": 1492301839.0, "created_utc": 1492273039.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65i5z1", "likes": null, "replies": "", "user_reports": [], "id": "dgavddt", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "LAudre41", "parent_id": "t3_65i5z1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your gf needs therapy to deal with her relationship to sexual activity because it isn't normal or healthy. I really wouldn't be surprised if she was faking orgasms also. If she's ashamed of her body she's not at all concerned about enjoying herself. That's probably at the root of why she sees sex as something she's doing for you and it seems like she wants credit for it. \n\nIt isn't that uncommon for women to deal with this because their expectations about sex rarely match reality. \n\nI don't blame you one bit for not wanting to havbe sex with her and I'm surprised you lasted this long. I would talk to her and see if she's even capable of understanding how her behavior is making it impossible to have sex despite her willingness to \"sacrifice\" inthemoment. Ask her if shes ever wanted to have sex. Ask her if why she doesn't initiate. Force her to think about these things and see what happens  Either she's willing to work on it or she's not. If she's not then I would get out now ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your gf needs therapy to deal with her relationship to sexual activity because it isn&amp;#39;t normal or healthy. I really wouldn&amp;#39;t be surprised if she was faking orgasms also. If she&amp;#39;s ashamed of her body she&amp;#39;s not at all concerned about enjoying herself. That&amp;#39;s probably at the root of why she sees sex as something she&amp;#39;s doing for you and it seems like she wants credit for it. &lt;/p&gt;\n\n&lt;p&gt;It isn&amp;#39;t that uncommon for women to deal with this because their expectations about sex rarely match reality. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t blame you one bit for not wanting to havbe sex with her and I&amp;#39;m surprised you lasted this long. I would talk to her and see if she&amp;#39;s even capable of understanding how her behavior is making it impossible to have sex despite her willingness to &amp;quot;sacrifice&amp;quot; inthemoment. Ask her if shes ever wanted to have sex. Ask her if why she doesn&amp;#39;t initiate. Force her to think about these things and see what happens  Either she&amp;#39;s willing to work on it or she&amp;#39;s not. If she&amp;#39;s not then I would get out now &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgavddt", "score_hidden": false, "stickied": false, "created": 1492304284.0, "created_utc": 1492275484.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]