[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;ll start at the beginning.  I met my boyfriend in my second year of university when I started at the uni fencing club. We were friendly and then, over time, became a couple. We were great and lived really close by so we saw each other all the time. We dated for the whole of my third year and for a short while after my graduation.  In that year he was completing the first year of his PhD - he would have 3 years to do after that. &lt;/p&gt;\n\n&lt;p&gt;We agreed to try and give it a go after I moved back home.  We talked about living together but, really, neither of us were in a position to do so and I don&amp;#39;t think that we were actually ready at that time for that level of commitment. &lt;/p&gt;\n\n&lt;p&gt;About 3 months after graduation we ended up going our separate ways - it wasn&amp;#39;t an awful break up as we just talked things through about how we were both finding living apart difficult and the thought of nothing much being able to change in the next 3 years felt like a really big deal.  We have spoken since and have agreed that it was still the best thing to do as neither of us were emotionally mature enough / ready to commit to each other in such a big way. We both needed to go live, work on careers etc.  Neither of us wanted to limit each other&amp;#39;s choices by needing to live in one place or another to make it work when there was so much unknown ahead.&lt;/p&gt;\n\n&lt;p&gt;Anyway, 4 years pass - we go work on our own stuff, date other people etc. As it happens, we have both ended up in careers we love and have done well for ourselves. He has finished his PhD and is buying a house (it is in the process of being built). I already bought one. We got back in touch, one thing led to another and we have been a couple again for the past 3 months.  We live an hour apart and he has asked me to move in with him shortly after he moves in himself.  I am more than happy to do this and rent out my place - I&amp;#39;m so excited about it!!&lt;/p&gt;\n\n&lt;p&gt;So - I feel like I&amp;#39;m definitely in a place where I have no eye on the exit. I&amp;#39;m in this for real. And I&amp;#39;m sure he is too - we have talked a lot about a future together and have both said we feel that this is it.  We want the same things, have talked about getting married, kids in the future - the works. We even have a vague plan for eventually buying home between us in the future (we both own independently at the moment and will do for a while). &lt;/p&gt;\n\n&lt;p&gt;At this point, although we only got back together fairly recently, I would really like to be engaged to him but I don&amp;#39;t want to bring up seriously getting married and  have totally mis-judged it and make him feel like I&amp;#39;m pushing too fast and too soon.  Part of me feels like in his head it&amp;#39;s all a lovely, hypothetical idea but just a little way off yet?  Maybe actually being engaged would be a little much - even though it&amp;#39;s dawned on me that I would really like it to not be a hypothetical idea any more....I&amp;#39;ve never felt that about anyone. &lt;/p&gt;\n\n&lt;p&gt;Another thing I guess that frustrates me is society&amp;#39;s expectation that I wait to be proposed to as the women...if I was a guy I would be planning to do it.  I know that technically there&amp;#39;s nothing stopping me from proposing but I do know that it&amp;#39;s something that he wouldn&amp;#39;t want taken away from him and, to be frank I&amp;#39;d love to be proposed to as well. I don&amp;#39;t want to have forced it out of him either.  What if I mention it and he feels backed into a corner about it!?  I feel like it would be pretty hard to come back from if he said he wasn&amp;#39;t there...like the pressure to propose would then just hang there. &lt;/p&gt;\n\n&lt;p&gt;Should I just keep quiet and be more patient??  Should I just bite the bullet and say how I feel?  If so, advice on phrasing it would be super helpful.. &lt;/p&gt;\n\n&lt;p&gt;Thanks! &lt;/p&gt;\n\n&lt;p&gt;Tl;dr Boyfriend [M, 28] and I [F, 26] got back together 3 months ago after being together previously for a year. Split previously due to logistics and generally not being ready for a big commitment.  I feel I&amp;#39;m ready for us to be engaged as I feel he&amp;#39;s the one, don&amp;#39;t want to mess things up by pushing if he&amp;#39;s not there yet and seeming a bit crazy. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I'll start at the beginning.  I met my boyfriend in my second year of university when I started at the uni fencing club. We were friendly and then, over time, became a couple. We were great and lived really close by so we saw each other all the time. We dated for the whole of my third year and for a short while after my graduation.  In that year he was completing the first year of his PhD - he would have 3 years to do after that. \n\nWe agreed to try and give it a go after I moved back home.  We talked about living together but, really, neither of us were in a position to do so and I don't think that we were actually ready at that time for that level of commitment. \n\nAbout 3 months after graduation we ended up going our separate ways - it wasn't an awful break up as we just talked things through about how we were both finding living apart difficult and the thought of nothing much being able to change in the next 3 years felt like a really big deal.  We have spoken since and have agreed that it was still the best thing to do as neither of us were emotionally mature enough / ready to commit to each other in such a big way. We both needed to go live, work on careers etc.  Neither of us wanted to limit each other's choices by needing to live in one place or another to make it work when there was so much unknown ahead.\n\nAnyway, 4 years pass - we go work on our own stuff, date other people etc. As it happens, we have both ended up in careers we love and have done well for ourselves. He has finished his PhD and is buying a house (it is in the process of being built). I already bought one. We got back in touch, one thing led to another and we have been a couple again for the past 3 months.  We live an hour apart and he has asked me to move in with him shortly after he moves in himself.  I am more than happy to do this and rent out my place - I'm so excited about it!!\n\nSo - I feel like I'm definitely in a place where I have no eye on the exit. I'm in this for real. And I'm sure he is too - we have talked a lot about a future together and have both said we feel that this is it.  We want the same things, have talked about getting married, kids in the future - the works. We even have a vague plan for eventually buying home between us in the future (we both own independently at the moment and will do for a while). \n\nAt this point, although we only got back together fairly recently, I would really like to be engaged to him but I don't want to bring up seriously getting married and  have totally mis-judged it and make him feel like I'm pushing too fast and too soon.  Part of me feels like in his head it's all a lovely, hypothetical idea but just a little way off yet?  Maybe actually being engaged would be a little much - even though it's dawned on me that I would really like it to not be a hypothetical idea any more....I've never felt that about anyone. \n\nAnother thing I guess that frustrates me is society's expectation that I wait to be proposed to as the women...if I was a guy I would be planning to do it.  I know that technically there's nothing stopping me from proposing but I do know that it's something that he wouldn't want taken away from him and, to be frank I'd love to be proposed to as well. I don't want to have forced it out of him either.  What if I mention it and he feels backed into a corner about it!?  I feel like it would be pretty hard to come back from if he said he wasn't there...like the pressure to propose would then just hang there. \n\nShould I just keep quiet and be more patient??  Should I just bite the bullet and say how I feel?  If so, advice on phrasing it would be super helpful.. \n\nThanks! \n\nTl;dr Boyfriend [M, 28] and I [F, 26] got back together 3 months ago after being together previously for a year. Split previously due to logistics and generally not being ready for a big commitment.  I feel I'm ready for us to be engaged as I feel he's the one, don't want to mess things up by pushing if he's not there yet and seeming a bit crazy. \n\n", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "65iq35", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 72, "report_reasons": null, "author": "thejynx2309", "saved": false, "mod_reports": [], "name": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-vt relationships", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65iq35/i_f26_feel_like_im_ready_to_get_engaged_to_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492286168.0, "url": "https://www.reddit.com/r/relationships/comments/65iq35/i_f26_feel_like_im_ready_to_get_engaged_to_my/", "author_flair_text": null, "quarantine": false, "title": "I [F,26] feel like I'm ready to get engaged to my boyfriend [M,28] but scared of bringing it up as a serious topic in case he is not there and he feels I'm pushing it way too soon - I don't want to scare him!!", "created_utc": 1492257368.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 72}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgaovlj", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "Elvis_burrito", "parent_id": "t1_dgallvl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I agree.  Give the relationship some time and see how things go living together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree.  Give the relationship some time and see how things go living together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaovlj", "score_hidden": false, "stickied": false, "created": 1492294907.0, "created_utc": 1492266107.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}], "after": null, "before": null}}, "user_reports": [], "id": "dgallvl", "gilded": 0, "archived": false, "score": 216, "report_reasons": null, "author": "lamamaloca", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think it may be too soon at only together three months. I'd wait to bring up timelines and \"I want to get engaged\" until more like nine months to a year, with a good amount of time living together. \n\nAlso, the waiting for the male to propose and having it be a big production is so sexist. But don't assume the only alternative is that you propose. The real alternative is that choosing to get married is a mutual decision. Then if you want a romantic production you can plan a joint proposal, or just a great engagement party.", "edited": 1492260177.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it may be too soon at only together three months. I&amp;#39;d wait to bring up timelines and &amp;quot;I want to get engaged&amp;quot; until more like nine months to a year, with a good amount of time living together. &lt;/p&gt;\n\n&lt;p&gt;Also, the waiting for the male to propose and having it be a big production is so sexist. But don&amp;#39;t assume the only alternative is that you propose. The real alternative is that choosing to get married is a mutual decision. Then if you want a romantic production you can plan a joint proposal, or just a great engagement party.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgallvl", "score_hidden": false, "stickied": false, "created": 1492288705.0, "created_utc": 1492259905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 216}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgati56", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "Alsacia", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "IME, dating as an established adult is so much different than dating as a college kid. The dynamics are different, YOU'RE different. So, I think 3 months is a little soon. But you've already talked moving in and kids, so it does seem like it's on the horizon. Personally, I'd wait until you lived together a little bit, make sure it's right (living w/people can really show you a different side sometimes!) and then bring it up again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IME, dating as an established adult is so much different than dating as a college kid. The dynamics are different, YOU&amp;#39;RE different. So, I think 3 months is a little soon. But you&amp;#39;ve already talked moving in and kids, so it does seem like it&amp;#39;s on the horizon. Personally, I&amp;#39;d wait until you lived together a little bit, make sure it&amp;#39;s right (living w/people can really show you a different side sometimes!) and then bring it up again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgati56", "score_hidden": false, "stickied": false, "created": 1492301655.0, "created_utc": 1492272855.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 52}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgb100h", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Spoonbills", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Nope. Give it a year. \n\nRent your place out for a year lease, move in together, and then 10 months later, have the engagement conversation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nope. Give it a year. &lt;/p&gt;\n\n&lt;p&gt;Rent your place out for a year lease, move in together, and then 10 months later, have the engagement conversation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb100h", "score_hidden": false, "stickied": false, "created": 1492311940.0, "created_utc": 1492283140.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgar5u2", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "mittenista", "parent_id": "t1_dgalnpa", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Fellow PCOS sufferer here. Some women with PCOS manage to conceive fairly easily. But it took me multiple losses and almost five years to have our son. I'm already a much older mom than I'd like to be, in spite of starting trying at a reasonable age. That's something to keep in mind. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fellow PCOS sufferer here. Some women with PCOS manage to conceive fairly easily. But it took me multiple losses and almost five years to have our son. I&amp;#39;m already a much older mom than I&amp;#39;d like to be, in spite of starting trying at a reasonable age. That&amp;#39;s something to keep in mind. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgar5u2", "score_hidden": false, "stickied": false, "created": 1492298374.0, "created_utc": 1492269574.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgb4ecy", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SexySadie80", "parent_id": "t1_dgalnpa", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Wait until you've lived together at least 6 months. It sounds like you're incredibly eager to jump the gun, and I totally get it. But you need to learn to be a little patient on this one. \nOnce you're engaged you can have a short engagement, a simple wedding (doesn't have to be shitty, just something you can plan quickly), then start trying for a baby. But chill out for now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait until you&amp;#39;ve lived together at least 6 months. It sounds like you&amp;#39;re incredibly eager to jump the gun, and I totally get it. But you need to learn to be a little patient on this one. \nOnce you&amp;#39;re engaged you can have a short engagement, a simple wedding (doesn&amp;#39;t have to be shitty, just something you can plan quickly), then start trying for a baby. But chill out for now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb4ecy", "score_hidden": false, "stickied": false, "created": 1492316522.0, "created_utc": 1492287722.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgaq6sd", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "so_just_here", "parent_id": "t1_dgalnpa", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; We have had discussions along those lines - we have both established that trying for kids in about 3/4 years time is about where we are at. Marriage somewhere in the middle of that\n\nGiven this and your history I wouldnt think its a bad idea to have a dicussion to firm up a timeline for engagement + marriage. Dont propose but ask him when he see its as a likely event", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;We have had discussions along those lines - we have both established that trying for kids in about 3/4 years time is about where we are at. Marriage somewhere in the middle of that&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Given this and your history I wouldnt think its a bad idea to have a dicussion to firm up a timeline for engagement + marriage. Dont propose but ask him when he see its as a likely event&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaq6sd", "score_hidden": false, "stickied": false, "created": 1492296956.0, "created_utc": 1492268156.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgavags", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MathHatter", "parent_id": "t1_dgalnpa", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Have you considered/could you afford to freeze your eggs? It'd be nice to feel some security around being able to wait a little longer -- and also not to feel as pressured to find yet another relationship immediately if this one doesn't work out as you hope.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you considered/could you afford to freeze your eggs? It&amp;#39;d be nice to feel some security around being able to wait a little longer -- and also not to feel as pressured to find yet another relationship immediately if this one doesn&amp;#39;t work out as you hope.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgavags", "score_hidden": false, "stickied": false, "created": 1492304175.0, "created_utc": 1492275375.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgalnpa", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "thejynx2309", "parent_id": "t1_dgal985", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks - and I agree. We have had discussions along those lines - we have both established that trying for kids in about 3/4 years time is about where we are at. Marriage somewhere in the middle of that - I know he wants to be married for a little while before starting a family.  I guess I'm worried they doesn't leave a lot of time and it could easily get a bit put off. I'm anxious about leaving trying for a family much later because I have PCOS and have been told by my doctor that if I want kids I shouldn't hang about too much because it will probably take longer and I may need help. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks - and I agree. We have had discussions along those lines - we have both established that trying for kids in about 3/4 years time is about where we are at. Marriage somewhere in the middle of that - I know he wants to be married for a little while before starting a family.  I guess I&amp;#39;m worried they doesn&amp;#39;t leave a lot of time and it could easily get a bit put off. I&amp;#39;m anxious about leaving trying for a family much later because I have PCOS and have been told by my doctor that if I want kids I shouldn&amp;#39;t hang about too much because it will probably take longer and I may need help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgalnpa", "score_hidden": false, "stickied": false, "created": 1492288814.0, "created_utc": 1492260014.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgal985", "gilded": 0, "archived": false, "score": 72, "report_reasons": null, "author": "gyaradostwister", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You are in your late 20s.  You should be able to have a real adult discussion about marriage and kids with real timetables.  If kids are your goal, you absolutely need to have real concrete discusssions about this, with a timeline.  You need to make sure this isn't sure I'd maybe like to have kids someday and this is I want to have kids in the next few years.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are in your late 20s.  You should be able to have a real adult discussion about marriage and kids with real timetables.  If kids are your goal, you absolutely need to have real concrete discusssions about this, with a timeline.  You need to make sure this isn&amp;#39;t sure I&amp;#39;d maybe like to have kids someday and this is I want to have kids in the next few years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgal985", "score_hidden": false, "stickied": false, "created": 1492287924.0, "created_utc": 1492259124.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 72}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgb5tl2", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "laundryandblowjobs", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I can't think of a way to word this that doesn't sound harsh, but I really don't mean it that way... Try to read this in a gentle, sort of matter-of-fact tone: If you don't know how to talk to him about something big, in a way that won't make him feel confronted, then no, you're not ready to get engaged.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t think of a way to word this that doesn&amp;#39;t sound harsh, but I really don&amp;#39;t mean it that way... Try to read this in a gentle, sort of matter-of-fact tone: If you don&amp;#39;t know how to talk to him about something big, in a way that won&amp;#39;t make him feel confronted, then no, you&amp;#39;re not ready to get engaged.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb5tl2", "score_hidden": false, "stickied": false, "created": 1492318454.0, "created_utc": 1492289654.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgaut7h", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Justcantstandit", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Waaaaaay too soon. You've been back together for 3 months? You need to slow down girly ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Waaaaaay too soon. You&amp;#39;ve been back together for 3 months? You need to slow down girly &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaut7h", "score_hidden": false, "stickied": false, "created": 1492303509.0, "created_utc": 1492274709.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgakpcl", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "airaqua", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just bring it up. If you really want to spend the rest of your life with this man, it's important that you can openly communicate with him and be on the same page. What do you have to lose? Just because you bring up timelines and marriage talk, doesn't mean you have to get married tomorrow. \n\nAsk your bf how his specific timeline would look like (engaged, married, children, house etc.) and see if it's compatible with yours. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just bring it up. If you really want to spend the rest of your life with this man, it&amp;#39;s important that you can openly communicate with him and be on the same page. What do you have to lose? Just because you bring up timelines and marriage talk, doesn&amp;#39;t mean you have to get married tomorrow. &lt;/p&gt;\n\n&lt;p&gt;Ask your bf how his specific timeline would look like (engaged, married, children, house etc.) and see if it&amp;#39;s compatible with yours. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgakpcl", "score_hidden": false, "stickied": false, "created": 1492286577.0, "created_utc": 1492257777.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgaxc82", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "colourinsanity", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'd give it a bit more time before broaching the topic - marriage is really a 11/12 months topic. \n\nThere's nothing stopping you from bringing it up, but I'd expect a \"it's much too soon!\" from him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d give it a bit more time before broaching the topic - marriage is really a 11/12 months topic. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s nothing stopping you from bringing it up, but I&amp;#39;d expect a &amp;quot;it&amp;#39;s much too soon!&amp;quot; from him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaxc82", "score_hidden": false, "stickied": false, "created": 1492306961.0, "created_utc": 1492278161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgbhce2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "_puddles_", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Woah. 3 months?? Pump the breaks girl. \n\nYou don't live together, and you are still firmly in the honeymoon phase. \n\nSome people will tell you \"what do you have to lose?\" Well Im here to tell you what you have to lose is him. I adore my boyfriend, and we were head over heels in love before we even became a couple, having been very good friends for 15 years previous. I knew from very very early on in our relationship that I was all in, that this was the person for me, but if he had talked about proposing 3 months in I would have *freaked out* and not in the good way. I would have panicked that he was impulsive and I would have wanted time to live together, and see how we cope as a unit with some of the shit life throws at you. It would have had me doubting that we would work out because of how differently we saw relationship timelines and the amount of thought given to big decisions. \n\nLook, maybe I'm way off base and maybe he's as ready as you are to get engaged amd won't be freaked out by you bringing it up, but if he is freaked out by it it could pull the rug out from under your relationship in a heartbeat.\n\nAnd even if he *is* as into the idea as you are then that isn't necessarily a good thing either. Healthy marriages that last are built on really *knowing* the person you will be married to, and what you are getting yourself into. And as much as you probably feel like you know his soul or whatever, it really is *not possible* for you to know each other that well after so long apart in 3 months. \n\nAnd before you start thinking \"but so-and-so got engaged to their husband/wife after only a few months and theyve been blissfully married for 50 years\", rules always have exceptions. But another rule is \"you are not the exception to the rule\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Woah. 3 months?? Pump the breaks girl. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t live together, and you are still firmly in the honeymoon phase. &lt;/p&gt;\n\n&lt;p&gt;Some people will tell you &amp;quot;what do you have to lose?&amp;quot; Well Im here to tell you what you have to lose is him. I adore my boyfriend, and we were head over heels in love before we even became a couple, having been very good friends for 15 years previous. I knew from very very early on in our relationship that I was all in, that this was the person for me, but if he had talked about proposing 3 months in I would have &lt;em&gt;freaked out&lt;/em&gt; and not in the good way. I would have panicked that he was impulsive and I would have wanted time to live together, and see how we cope as a unit with some of the shit life throws at you. It would have had me doubting that we would work out because of how differently we saw relationship timelines and the amount of thought given to big decisions. &lt;/p&gt;\n\n&lt;p&gt;Look, maybe I&amp;#39;m way off base and maybe he&amp;#39;s as ready as you are to get engaged amd won&amp;#39;t be freaked out by you bringing it up, but if he is freaked out by it it could pull the rug out from under your relationship in a heartbeat.&lt;/p&gt;\n\n&lt;p&gt;And even if he &lt;em&gt;is&lt;/em&gt; as into the idea as you are then that isn&amp;#39;t necessarily a good thing either. Healthy marriages that last are built on really &lt;em&gt;knowing&lt;/em&gt; the person you will be married to, and what you are getting yourself into. And as much as you probably feel like you know his soul or whatever, it really is &lt;em&gt;not possible&lt;/em&gt; for you to know each other that well after so long apart in 3 months. &lt;/p&gt;\n\n&lt;p&gt;And before you start thinking &amp;quot;but so-and-so got engaged to their husband/wife after only a few months and theyve been blissfully married for 50 years&amp;quot;, rules always have exceptions. But another rule is &amp;quot;you are not the exception to the rule&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbhce2", "score_hidden": false, "stickied": false, "created": 1492334815.0, "created_utc": 1492306015.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgb12h8", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "mazzakre", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Unless I misread something, you've only been together for 3 months? And you not only don't live together but you live an hour apart?\n\nIMO, it's too early to even be considering moving in together, marriage shouldn't even be a thought. Personally, I wouldn't consider living together until a year in, and marriage at least a year after that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unless I misread something, you&amp;#39;ve only been together for 3 months? And you not only don&amp;#39;t live together but you live an hour apart?&lt;/p&gt;\n\n&lt;p&gt;IMO, it&amp;#39;s too early to even be considering moving in together, marriage shouldn&amp;#39;t even be a thought. Personally, I wouldn&amp;#39;t consider living together until a year in, and marriage at least a year after that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb12h8", "score_hidden": false, "stickied": false, "created": 1492312029.0, "created_utc": 1492283229.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgaqvow", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Allycia", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're still in the honeymoon phase, just enjoy it while it lasts! In a few years you can bring it up when you're both on the same page. 15 months total is still early in most relationships to get engaged. Enjoy the butterflies :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re still in the honeymoon phase, just enjoy it while it lasts! In a few years you can bring it up when you&amp;#39;re both on the same page. 15 months total is still early in most relationships to get engaged. Enjoy the butterflies :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgaqvow", "score_hidden": false, "stickied": false, "created": 1492297973.0, "created_utc": 1492269173.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgbgulz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "biologicalspecimen", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If he's asking you to move in I think it's totally appropriate to discuss marriage. I mean I think it's really early to move in but that's not your question. I kind of think you should talk about it before living together. If he's not serious about you why would you want to get your lives so entangled? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If he&amp;#39;s asking you to move in I think it&amp;#39;s totally appropriate to discuss marriage. I mean I think it&amp;#39;s really early to move in but that&amp;#39;s not your question. I kind of think you should talk about it before living together. If he&amp;#39;s not serious about you why would you want to get your lives so entangled? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbgulz", "score_hidden": false, "stickied": false, "created": 1492334088.0, "created_utc": 1492305288.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgb67lq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "babelincoln27", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is an interesting and tricky situation because you haven't really been dating for only three months, it's been much longer than that. Especially if you've kept in touch between dating periods. I wouldn't count those whole 6ish years as having dated, but it's a weird period of time to measure.\n\nThat being said, I would treat this moving in as a new stage in life. Like any stage, the first few months are a settling-in period. I'm absolutely a proponent of living with an SO before marrying, so maybe if you date for a few months, then move into his house and date for a few more, it might be time to think about marrying. Like, six months of this recent dating period, or something.\n\nAdditionally (I've never gotten married, so grain of salt here), a lot of the time I see posts about people talking about getting married and talking about engagement, without an actual ring on bended knee. Would you guys be willing to discuss a timeline, so you're both happy? And then he can still surprise you with an engagement, in a given time period. (Or, if you really want, you can propose. I would.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is an interesting and tricky situation because you haven&amp;#39;t really been dating for only three months, it&amp;#39;s been much longer than that. Especially if you&amp;#39;ve kept in touch between dating periods. I wouldn&amp;#39;t count those whole 6ish years as having dated, but it&amp;#39;s a weird period of time to measure.&lt;/p&gt;\n\n&lt;p&gt;That being said, I would treat this moving in as a new stage in life. Like any stage, the first few months are a settling-in period. I&amp;#39;m absolutely a proponent of living with an SO before marrying, so maybe if you date for a few months, then move into his house and date for a few more, it might be time to think about marrying. Like, six months of this recent dating period, or something.&lt;/p&gt;\n\n&lt;p&gt;Additionally (I&amp;#39;ve never gotten married, so grain of salt here), a lot of the time I see posts about people talking about getting married and talking about engagement, without an actual ring on bended knee. Would you guys be willing to discuss a timeline, so you&amp;#39;re both happy? And then he can still surprise you with an engagement, in a given time period. (Or, if you really want, you can propose. I would.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb67lq", "score_hidden": false, "stickied": false, "created": 1492318997.0, "created_utc": 1492290197.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgbim9x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cancerchicken2", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "im sure he'd ask you if he wanted this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;im sure he&amp;#39;d ask you if he wanted this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbim9x", "score_hidden": false, "stickied": false, "created": 1492336671.0, "created_utc": 1492307871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgbk17q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lordoftheties", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My partner and I have been together going on 3 years, not yet living together due to grad school, and while I would love to be engaged to him we've decided that it would be the smartest choice to give it a year of living together, cooperating together financially completely on our own before getting engaged. It doesn't mean we don't want to be married or have kids, for us it means that we respect the other enough to give it a fair shot and relish what we have before we get engaged. \n\nRealistically you guys need to sit down and discuss a timeline at some point. It seems like you've already talked about kids, but whether it is time to set a more serious timeline for marriage is completely up to you both. What I will say is that going into the conversation with expectations of reciprocity will inevitably lead to hurt feelings. You love him and he loves you. Love is chaotic entanglement, and when it comes down to it the small details are just that- small. When you feel it is the right time ask in a neutral way, and save any judgment until he completely has explained how he feels. Collaborate and work together to mingle both of your visions for the future. If you each have differing views of what you want, go back to the drawing board and discuss it. \n\nI wish you both the best!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My partner and I have been together going on 3 years, not yet living together due to grad school, and while I would love to be engaged to him we&amp;#39;ve decided that it would be the smartest choice to give it a year of living together, cooperating together financially completely on our own before getting engaged. It doesn&amp;#39;t mean we don&amp;#39;t want to be married or have kids, for us it means that we respect the other enough to give it a fair shot and relish what we have before we get engaged. &lt;/p&gt;\n\n&lt;p&gt;Realistically you guys need to sit down and discuss a timeline at some point. It seems like you&amp;#39;ve already talked about kids, but whether it is time to set a more serious timeline for marriage is completely up to you both. What I will say is that going into the conversation with expectations of reciprocity will inevitably lead to hurt feelings. You love him and he loves you. Love is chaotic entanglement, and when it comes down to it the small details are just that- small. When you feel it is the right time ask in a neutral way, and save any judgment until he completely has explained how he feels. Collaborate and work together to mingle both of your visions for the future. If you each have differing views of what you want, go back to the drawing board and discuss it. &lt;/p&gt;\n\n&lt;p&gt;I wish you both the best!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbk17q", "score_hidden": false, "stickied": false, "created": 1492338770.0, "created_utc": 1492309970.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65iq35", "likes": null, "replies": "", "user_reports": [], "id": "dgb0nfz", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Dobby_Lobby", "parent_id": "t3_65iq35", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your history together goes back a while. I think, if you feel this in your heart, say something. I'm sure you know how you say it is important. So, basically, just don't force it. Say how you feel. Be open and honest. You've already talked about a future together, he wants you to move in. With this speed, your ages, how established you both are, I'd be surprised if he didn't bring it up in another 3 months or so! This sounds like a real thing, like you're both feeling it. Talk to him about it. :) I think it will end very well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your history together goes back a while. I think, if you feel this in your heart, say something. I&amp;#39;m sure you know how you say it is important. So, basically, just don&amp;#39;t force it. Say how you feel. Be open and honest. You&amp;#39;ve already talked about a future together, he wants you to move in. With this speed, your ages, how established you both are, I&amp;#39;d be surprised if he didn&amp;#39;t bring it up in another 3 months or so! This sounds like a real thing, like you&amp;#39;re both feeling it. Talk to him about it. :) I think it will end very well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb0nfz", "score_hidden": false, "stickied": false, "created": 1492311481.0, "created_utc": 1492282681.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]