[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Oh boy.  This is hard to talk about.  I hope at least some of you are patient enough to read through this and offer some advice.  I know it&amp;#39;s long.&lt;/p&gt;\n\n&lt;p&gt;My wife and I have been together for 10 years and married for 5 years.  We both work pretty normal 9-5 type jobs, own a home, and have no kids, so we don&amp;#39;t have a lot of the stressors of a normal marriage, I guess you could say.  I love my wife dearly and I can&amp;#39;t imagine life without her.  I feel that I am very good to her and love her in every way possible.  I am kind, considerate, supportive, and never put her down in any way.  She is beautiful and smart and I am incredibly lucky to be married to her.  The spark and adoration of a new marriage is still there 100% for me, at least.&lt;/p&gt;\n\n&lt;p&gt;She loves me too, I think, but I sometimes feel like she&amp;#39;s tired of me, or that she fakes happiness when she&amp;#39;s around me.  The spark seems to be gone for her and she seems bored with day-to-day married life, I guess.  I try to plan fun things with her and we always make a point to go out on a little date at least once a week.&lt;/p&gt;\n\n&lt;p&gt;Now, on to the real root of the problem.  Within the last year and a half, she found a new gaming hobby.  I won&amp;#39;t get too much into specifics, but apparently and previously unbeknownst to me, this hobby has a pretty big online community.  She started spending a good bit of time on this new hobby and I didn&amp;#39;t really think anything of it.  She was having fun.  I even built her a new computer when she asked for one so that she could have more fun with it.  &lt;/p&gt;\n\n&lt;p&gt;I think two giant problems have stemmed from this.&lt;/p&gt;\n\n&lt;p&gt;1) She is now spending so much time on this hobby that I feel like she neglects our relationship and her own wellbeing.  Even though she has to be up at 6 am for work, she&amp;#39;ll stay up until 1 or 2 am playing, and then complain that she doesn&amp;#39;t feel good or that she&amp;#39;s tired all the time.  We used to go to bed together at about 10-11 pm.  We used to do a lot of things together.  It was great.  Over the last year or so, I don&amp;#39;t think we&amp;#39;ve gone to bed at the same time even once.  I try to get her to come to bed with me, but she refuses, saying that she&amp;#39;s going to stay up a while longer.  Sidenote: As you can imagine, this has killed intimacy in the relationship.  We&amp;#39;ve only had sex once in the last year.  It was, at one time in our relationship, at least once a week.&lt;/p&gt;\n\n&lt;p&gt;If I wake up at 1 am to use the bathroom and she&amp;#39;s still gaming, I walk out and tell her to come to bed, and that being up so late is bad for her.  She gets irritated with me and says she&amp;#39;s not tired, even though I know she is, based off of her complaints the next day.  She says I&amp;#39;m being controlling.  I really don&amp;#39;t think that telling my wife to come to bed so she can get at least get 4 hours of sleep is controlling.  She&amp;#39;s an adult, she proclaims.  She is, and she should be responsible enough to take care of herself, but she refuses to do so.  I don&amp;#39;t know how to get around this without her getting upset.  I honestly think there may be some addictive/obsessive component at work here.  &lt;/p&gt;\n\n&lt;p&gt;2) She started to become real-life friends with some of the people from the gaming community.  There&amp;#39;s nothing wrong with that by itself.  Friends are good to have.  A lot of the people in the gaming community are guys.  There&amp;#39;s nothing strictly wrong with her having guy friends either.  However, I think that one of the new friendships has become incredibly inappopriate.  This guy happens to be local, around our age, and single.  Let&amp;#39;s call him Steve.  They text each other ALL the time, probably over 75 messages a day sometimes.  Most of it is relatively harmless, and just chit-chat related to work or games.  However, a while back, she started complaining about me to Steve, primarily about my telling her not to stay up so late.  She even told Steve that she sometimes wishes she wasn&amp;#39;t married and spilling her guts about the things she doesn&amp;#39;t like about me... how I&amp;#39;m an introvert and don&amp;#39;t like to be around big groups of people, don&amp;#39;t like to be up late, etc..  Steve, who I&amp;#39;ve only met in person a few times, had no words of encouragement for the marriage, instead telling her to take the path that makes her happy.  He then went on to talk about how he was previously married, and is now divorced, so on and so forth.  His language with her got really soupy at that point and he told her that he cared very deeply for her, and that he just wants her to be happy.  &lt;/p&gt;\n\n&lt;p&gt;I discovered all this when I got on the computer one day and her chat window was still open.  Perhaps it was wrong for me to read it, but I was pretty suspicious of this guy at this point.  I confronted her about it and she, without much emotion, told me that she was frustrated about some things in our relationship and that her and Steve were just friends.  I told her that his language makes it incredibly obvious that he has feelings for her.  I asked her to confront him about it.  She did and he admitted that he is struggling with himself because he likes her as much more than a friend.  I told her that it was incredibly inappropriate and that he shouldn&amp;#39;t even allow himself to get to that point.  I told her that I don&amp;#39;t like him and that I don&amp;#39;t think it&amp;#39;s appropriate for them to spend time together anymore.  She assured me that I have nothing to worry about and played the &amp;quot;don&amp;#39;t you trust me?&amp;quot; card.  I told her that I don&amp;#39;t think they should see each other one-on-one in private anymore, which they had been doing once a week to play games at our house when I was at work.  Once again, she told me that I had nothing to worry about... that nothing inappropriate had happened and that nothing inappopriate would happen.  I believe her when she says that nothing physically inappropriate has happened.  Making an effort not to be &amp;quot;controlling&amp;quot;, I relented and they have spent more time together since that discussion.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile, they continue to chat like crazy all day and night.  She stays up way too late and even when Steve tells her to go to sleep, she just says that she really likes talking to him.  I feel like she is trying to hide that from me now though.  I still have her Facebook login though and read back through her conversations with him.  Say what you will about that, but I have damn good reason to be doing so.  The conversations are mostly harmless still, but there is still some cause for concern.  They were having a somewhat silly conversation one day and my wife said &amp;quot;I love you&amp;quot; with a sort of heart/smiley emoticon thing.  He wrote that he loved her back.  Now, I know that &amp;quot;L Word&amp;quot; is thrown around a lot these days, but holy hell is it inappropriate to say, even casually and as a friend, to someone that has admitted that he has feelings for her.  I mean, I still can&amp;#39;t believe it.  I still haven&amp;#39;t confronted her about this part.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to this weekend, my wife is going out to lunch with her mom.  I told them I would leave them alone so they could have a girls day out.  Turns out that they are not having a girls day out.  My wife invited Steve to go out to lunch with them and didn&amp;#39;t say a thing about it to me.  I directly asked her, after plans were set in stone with Steve, if it would just be her and her mom, and she avoided the question... twice.  Earlier in her chat with Steve, she also told him that she&amp;#39;s very open with her mom and had talked to her about him.&lt;/p&gt;\n\n&lt;p&gt;This is really eating away at me.  Even if I haven&amp;#39;t been physically cheated on, I feel like I am being emotionally cheated on over and over again.  I love my wife so very much and I would be destroyed if we weren&amp;#39;t able to be together.  I want to fix this and I don&amp;#39;t know how.  Every time I try to talk to her, she clams up, and barely says a thing.  Then she acts emotionally distant afterwards and I feel like talking to her about the problem just pushes her away, and makes her upset with me.  I have proclaimed with tears streaming down my face, how her relationship with Steve makes me feel and she just doesn&amp;#39;t seem to get it.  She won&amp;#39;t end her relationship with Steve, even knowing just how upset it makes me.  I love her more than anything and I want to be with her forever, but this is tearing me apart.  &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to do.  I don&amp;#39;t want to give her a &amp;quot;him or me&amp;quot; ultimatum partly because I know that will make her angry/upset and partly because I&amp;#39;m afraid of what she might choose.  Even if she chooses me I think she may become even more secretive about her relationship with him.&lt;/p&gt;\n\n&lt;p&gt;I could attack from a different angle and tell Steve to stay the hell away from her.  I don&amp;#39;t think he&amp;#39;s very strong willed and I think he just might stay away or at least try to distance himself.  Then again, he might share my message with her and make her even more upset with me.  Or he might retaliate and try to become closer to her, though this last thing seems unlikely.&lt;/p&gt;\n\n&lt;p&gt;I honestly think my wife sees her relationship with Steve as a healthy &amp;quot;best friend relationship&amp;quot; and sees nothing wrong with it.  I should also say that my wife has a very poor social barometer.  She doesn&amp;#39;t pick up on body language or other non-verbal cues very well, and she&amp;#39;s not good at reading between the lines.  I&amp;#39;m no ultra-conservative guy socially speaking, but I think their relationship is highly inappropriate because of the way it affects our marriage, and that neither of them have done anything to move it in a different direction.  I sometimes feel like she&amp;#39;s bored of me and at any moment, she might just start to have real feelings back toward Steve, whether she intends to or not.  It might just... happen.&lt;/p&gt;\n\n&lt;p&gt;I think we should see a marriage counselor, but I&amp;#39;m afraid she might clam up in front of a marriage counselor too, or just refuse to go.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t write any more for now.  I guess I just want a reality check here and want to know what other people would do in my shoes.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: I feel like my wife is emotionally cheating on me with her single male best friend, and she doesn&amp;#39;t see it that way.  It is tearing me apart and I don&amp;#39;t know what to do about it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Oh boy.  This is hard to talk about.  I hope at least some of you are patient enough to read through this and offer some advice.  I know it's long.\n\nMy wife and I have been together for 10 years and married for 5 years.  We both work pretty normal 9-5 type jobs, own a home, and have no kids, so we don't have a lot of the stressors of a normal marriage, I guess you could say.  I love my wife dearly and I can't imagine life without her.  I feel that I am very good to her and love her in every way possible.  I am kind, considerate, supportive, and never put her down in any way.  She is beautiful and smart and I am incredibly lucky to be married to her.  The spark and adoration of a new marriage is still there 100% for me, at least.\n\nShe loves me too, I think, but I sometimes feel like she's tired of me, or that she fakes happiness when she's around me.  The spark seems to be gone for her and she seems bored with day-to-day married life, I guess.  I try to plan fun things with her and we always make a point to go out on a little date at least once a week.\n\nNow, on to the real root of the problem.  Within the last year and a half, she found a new gaming hobby.  I won't get too much into specifics, but apparently and previously unbeknownst to me, this hobby has a pretty big online community.  She started spending a good bit of time on this new hobby and I didn't really think anything of it.  She was having fun.  I even built her a new computer when she asked for one so that she could have more fun with it.  \n\nI think two giant problems have stemmed from this.\n\n1) She is now spending so much time on this hobby that I feel like she neglects our relationship and her own wellbeing.  Even though she has to be up at 6 am for work, she'll stay up until 1 or 2 am playing, and then complain that she doesn't feel good or that she's tired all the time.  We used to go to bed together at about 10-11 pm.  We used to do a lot of things together.  It was great.  Over the last year or so, I don't think we've gone to bed at the same time even once.  I try to get her to come to bed with me, but she refuses, saying that she's going to stay up a while longer.  Sidenote: As you can imagine, this has killed intimacy in the relationship.  We've only had sex once in the last year.  It was, at one time in our relationship, at least once a week.\n\nIf I wake up at 1 am to use the bathroom and she's still gaming, I walk out and tell her to come to bed, and that being up so late is bad for her.  She gets irritated with me and says she's not tired, even though I know she is, based off of her complaints the next day.  She says I'm being controlling.  I really don't think that telling my wife to come to bed so she can get at least get 4 hours of sleep is controlling.  She's an adult, she proclaims.  She is, and she should be responsible enough to take care of herself, but she refuses to do so.  I don't know how to get around this without her getting upset.  I honestly think there may be some addictive/obsessive component at work here.  \n\n2) She started to become real-life friends with some of the people from the gaming community.  There's nothing wrong with that by itself.  Friends are good to have.  A lot of the people in the gaming community are guys.  There's nothing strictly wrong with her having guy friends either.  However, I think that one of the new friendships has become incredibly inappopriate.  This guy happens to be local, around our age, and single.  Let's call him Steve.  They text each other ALL the time, probably over 75 messages a day sometimes.  Most of it is relatively harmless, and just chit-chat related to work or games.  However, a while back, she started complaining about me to Steve, primarily about my telling her not to stay up so late.  She even told Steve that she sometimes wishes she wasn't married and spilling her guts about the things she doesn't like about me... how I'm an introvert and don't like to be around big groups of people, don't like to be up late, etc..  Steve, who I've only met in person a few times, had no words of encouragement for the marriage, instead telling her to take the path that makes her happy.  He then went on to talk about how he was previously married, and is now divorced, so on and so forth.  His language with her got really soupy at that point and he told her that he cared very deeply for her, and that he just wants her to be happy.  \n\nI discovered all this when I got on the computer one day and her chat window was still open.  Perhaps it was wrong for me to read it, but I was pretty suspicious of this guy at this point.  I confronted her about it and she, without much emotion, told me that she was frustrated about some things in our relationship and that her and Steve were just friends.  I told her that his language makes it incredibly obvious that he has feelings for her.  I asked her to confront him about it.  She did and he admitted that he is struggling with himself because he likes her as much more than a friend.  I told her that it was incredibly inappropriate and that he shouldn't even allow himself to get to that point.  I told her that I don't like him and that I don't think it's appropriate for them to spend time together anymore.  She assured me that I have nothing to worry about and played the \"don't you trust me?\" card.  I told her that I don't think they should see each other one-on-one in private anymore, which they had been doing once a week to play games at our house when I was at work.  Once again, she told me that I had nothing to worry about... that nothing inappropriate had happened and that nothing inappopriate would happen.  I believe her when she says that nothing physically inappropriate has happened.  Making an effort not to be \"controlling\", I relented and they have spent more time together since that discussion.\n\nMeanwhile, they continue to chat like crazy all day and night.  She stays up way too late and even when Steve tells her to go to sleep, she just says that she really likes talking to him.  I feel like she is trying to hide that from me now though.  I still have her Facebook login though and read back through her conversations with him.  Say what you will about that, but I have damn good reason to be doing so.  The conversations are mostly harmless still, but there is still some cause for concern.  They were having a somewhat silly conversation one day and my wife said \"I love you\" with a sort of heart/smiley emoticon thing.  He wrote that he loved her back.  Now, I know that \"L Word\" is thrown around a lot these days, but holy hell is it inappropriate to say, even casually and as a friend, to someone that has admitted that he has feelings for her.  I mean, I still can't believe it.  I still haven't confronted her about this part.\n\nFast forward to this weekend, my wife is going out to lunch with her mom.  I told them I would leave them alone so they could have a girls day out.  Turns out that they are not having a girls day out.  My wife invited Steve to go out to lunch with them and didn't say a thing about it to me.  I directly asked her, after plans were set in stone with Steve, if it would just be her and her mom, and she avoided the question... twice.  Earlier in her chat with Steve, she also told him that she's very open with her mom and had talked to her about him.\n\nThis is really eating away at me.  Even if I haven't been physically cheated on, I feel like I am being emotionally cheated on over and over again.  I love my wife so very much and I would be destroyed if we weren't able to be together.  I want to fix this and I don't know how.  Every time I try to talk to her, she clams up, and barely says a thing.  Then she acts emotionally distant afterwards and I feel like talking to her about the problem just pushes her away, and makes her upset with me.  I have proclaimed with tears streaming down my face, how her relationship with Steve makes me feel and she just doesn't seem to get it.  She won't end her relationship with Steve, even knowing just how upset it makes me.  I love her more than anything and I want to be with her forever, but this is tearing me apart.  \n\nI don't know what to do.  I don't want to give her a \"him or me\" ultimatum partly because I know that will make her angry/upset and partly because I'm afraid of what she might choose.  Even if she chooses me I think she may become even more secretive about her relationship with him.\n\nI could attack from a different angle and tell Steve to stay the hell away from her.  I don't think he's very strong willed and I think he just might stay away or at least try to distance himself.  Then again, he might share my message with her and make her even more upset with me.  Or he might retaliate and try to become closer to her, though this last thing seems unlikely.\n\nI honestly think my wife sees her relationship with Steve as a healthy \"best friend relationship\" and sees nothing wrong with it.  I should also say that my wife has a very poor social barometer.  She doesn't pick up on body language or other non-verbal cues very well, and she's not good at reading between the lines.  I'm no ultra-conservative guy socially speaking, but I think their relationship is highly inappropriate because of the way it affects our marriage, and that neither of them have done anything to move it in a different direction.  I sometimes feel like she's bored of me and at any moment, she might just start to have real feelings back toward Steve, whether she intends to or not.  It might just... happen.\n\nI think we should see a marriage counselor, but I'm afraid she might clam up in front of a marriage counselor too, or just refuse to go.\n\nI can't write any more for now.  I guess I just want a reality check here and want to know what other people would do in my shoes.\n  \n  ---   \n  **tl;dr**: I feel like my wife is emotionally cheating on me with her single male best friend, and she doesn't see it that way.  It is tearing me apart and I don't know what to do about it.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Infidelity", "id": "65ku1h", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 236, "report_reasons": null, "author": "throwaway763425", "saved": false, "mod_reports": [], "name": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": 1492283728.0, "link_flair_css_class": "m-oe infidelity", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65ku1h/i_feel_like_my_30m_wife_28f_is_emotionally/", "num_reports": null, "locked": false, "stickied": false, "created": 1492312185.0, "url": "https://www.reddit.com/r/relationships/comments/65ku1h/i_feel_like_my_30m_wife_28f_is_emotionally/", "author_flair_text": null, "quarantine": false, "title": "I feel like my (30/M) wife (28/F) is Emotionally Cheating on Me with her Best Friend (27/M); Need some Insight", "created_utc": 1492283385.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 104, "visited": false, "subreddit_type": "public", "ups": 236}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgb4mr0", "gilded": 0, "archived": false, "score": 339, "report_reasons": null, "author": "RampagingKoala", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She does not see Steve as a healthy best friend relationship, otherwise she wouldn't be hiding him behind your back. Her mom is terrible for essentially covering for her affair. The fact that you've expressed your feelings and she's totally ignored you is very indicative of her feelings towards you and this relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She does not see Steve as a healthy best friend relationship, otherwise she wouldn&amp;#39;t be hiding him behind your back. Her mom is terrible for essentially covering for her affair. The fact that you&amp;#39;ve expressed your feelings and she&amp;#39;s totally ignored you is very indicative of her feelings towards you and this relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb4mr0", "score_hidden": false, "stickied": false, "created": 1492316846.0, "created_utc": 1492288046.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 339}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgb7ro1", "gilded": 0, "archived": false, "score": 112, "report_reasons": null, "author": "ShesTyping", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm so sorry, this was heartbreaking to read.\n\nYour wife checked out of the relationship a while back, and absolutely is emotionally involved with Steve whether she admits it or not. Her behavior is absolutely obsessive and escapist, and you have every right to be concerned.\n\nTell her you want couples counselling to begin immediately, do not discuss why other than you're very unhappy (she will only use it as ammo to emotionally manipulate you as she has in the past). Don't worry about her clamming up in \n therapy, that's down to the therapist to get her to open up (they may ask for a separate session with her alone if she's refusing to talk in front of you, couples therapy often involves separate sessions with each of you as well as joint sessions) - If she refuses couples therapy with you, then it's time to talk to a lawyer and prepare to leave her.\n\nAgain, I'm so sorry. But there is honestly unlikely to be a happy ending to this. Act now so you have less to regret in future, if you try and grit your teeth and bare it in denial, you will end up losing nothing but time you could be spending finding someone who's fully invested and engaged with you. You deserve better, be with someone who's as into you as you are into them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry, this was heartbreaking to read.&lt;/p&gt;\n\n&lt;p&gt;Your wife checked out of the relationship a while back, and absolutely is emotionally involved with Steve whether she admits it or not. Her behavior is absolutely obsessive and escapist, and you have every right to be concerned.&lt;/p&gt;\n\n&lt;p&gt;Tell her you want couples counselling to begin immediately, do not discuss why other than you&amp;#39;re very unhappy (she will only use it as ammo to emotionally manipulate you as she has in the past). Don&amp;#39;t worry about her clamming up in \n therapy, that&amp;#39;s down to the therapist to get her to open up (they may ask for a separate session with her alone if she&amp;#39;s refusing to talk in front of you, couples therapy often involves separate sessions with each of you as well as joint sessions) - If she refuses couples therapy with you, then it&amp;#39;s time to talk to a lawyer and prepare to leave her.&lt;/p&gt;\n\n&lt;p&gt;Again, I&amp;#39;m so sorry. But there is honestly unlikely to be a happy ending to this. Act now so you have less to regret in future, if you try and grit your teeth and bare it in denial, you will end up losing nothing but time you could be spending finding someone who&amp;#39;s fully invested and engaged with you. You deserve better, be with someone who&amp;#39;s as into you as you are into them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb7ro1", "score_hidden": false, "stickied": false, "created": 1492321150.0, "created_utc": 1492292350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 112}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbmpb3", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "flybrand", "parent_id": "t1_dgbenvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I believe her when she says nothing physical has happened.\n\nDidn't she also say she had lunch with her Mom? Why believe this?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I believe her when she says nothing physical has happened.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Didn&amp;#39;t she also say she had lunch with her Mom? Why believe this?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbmpb3", "score_hidden": false, "stickied": false, "created": 1492342756.0, "created_utc": 1492313956.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbhdzw", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "tfresca", "parent_id": "t1_dgbenvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Lying is basically the same as withholding information when asked. She lies to your face man. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lying is basically the same as withholding information when asked. She lies to your face man. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbhdzw", "score_hidden": false, "stickied": false, "created": 1492334881.0, "created_utc": 1492306081.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgdjtw1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JeoAttk", "parent_id": "t1_dgbq4e3", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; A Ferrari is not worth driving if the smell of the interior makes you puke. Trade it in for a better model.\n\n Well put.\n\n I don't have much to add; splitting will be extremely painful and one of the most difficult experiences of your life...yet you will eventually move on and be far happier.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;A Ferrari is not worth driving if the smell of the interior makes you puke. Trade it in for a better model.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well put.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have much to add; splitting will be extremely painful and one of the most difficult experiences of your life...yet you will eventually move on and be far happier.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdjtw1", "score_hidden": true, "stickied": false, "created": 1492468512.0, "created_utc": 1492439712.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbq4e3", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "TomahawkCruise", "parent_id": "t1_dgbenvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your past, unfortunately, is irrelevant now.\n\nIf she's playing you, it doesn't matter a whit how things were 5 years ago. People change. Sometimes for the worse. If that's the case with your wife, if she's checked out, you are going to have only two choices -- 1) put up with her shit and let her screw you time and again, or 2) serve her divorce papers and get back on a happy track.\n\nI can empathize with you man. I was thoroughly in love with an ex-GF a few years ago, didn't want anyone but her for the rest of my life. Crushed my soul to think about losing her. But I also found telltale signs of potential cheating and it obliterates your heart, doesn't it? I've felt it. It's a feeling I'll never forget. It sucks all the life out of you and you tailspin into misery. It was exceedingly difficult, but I ended the relationship because I could no longer trust her. A Ferrari is not worth driving if the smell of the interior makes you puke. Trade it in for a better model.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your past, unfortunately, is irrelevant now.&lt;/p&gt;\n\n&lt;p&gt;If she&amp;#39;s playing you, it doesn&amp;#39;t matter a whit how things were 5 years ago. People change. Sometimes for the worse. If that&amp;#39;s the case with your wife, if she&amp;#39;s checked out, you are going to have only two choices -- 1) put up with her shit and let her screw you time and again, or 2) serve her divorce papers and get back on a happy track.&lt;/p&gt;\n\n&lt;p&gt;I can empathize with you man. I was thoroughly in love with an ex-GF a few years ago, didn&amp;#39;t want anyone but her for the rest of my life. Crushed my soul to think about losing her. But I also found telltale signs of potential cheating and it obliterates your heart, doesn&amp;#39;t it? I&amp;#39;ve felt it. It&amp;#39;s a feeling I&amp;#39;ll never forget. It sucks all the life out of you and you tailspin into misery. It was exceedingly difficult, but I ended the relationship because I could no longer trust her. A Ferrari is not worth driving if the smell of the interior makes you puke. Trade it in for a better model.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbq4e3", "score_hidden": false, "stickied": false, "created": 1492348652.0, "created_utc": 1492319852.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbt70x", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Slapmypickle", "parent_id": "t1_dgbenvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You should look up sunk-cost fallacy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should look up sunk-cost fallacy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbt70x", "score_hidden": false, "stickied": false, "created": 1492355797.0, "created_utc": 1492326997.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgc191p", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Missus_Nicola", "parent_id": "t1_dgbenvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;  I can't just throw it out. I want to fix it.\n\nShe has to want to fix it too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I can&amp;#39;t just throw it out. I want to fix it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She has to want to fix it too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc191p", "score_hidden": false, "stickied": false, "created": 1492378820.0, "created_utc": 1492350020.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbenvk", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "throwaway763425", "parent_id": "t1_dgbdae9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's an interesting question that I don't have an answer to right now.  It hurts to think about.  I mean, this is a 10-year relationship we're talking about here.  She is the only person I've been with as an adult, and 8.5 of 10 years of our relationship have been absolutely wonderful.  I can't just throw it out.  I want to fix it.\n\nI believe her when she says nothing physical has happened.  She is a terrible liar.  She definitely can't look at me and lie to me... I know that much.  She tells me that she talks to Steve and she even tells me what they talk about sometimes.  It's not some giant secret and what she tells me corresponds with what I've seen from their conversations.  She could've lied about his admission of feelings, but she didn't.  That said, she doesn't tell me everything, and that's what concerns me.  She should have come to me, her husband and greatest confidant, if she was unhappy with some aspects of our relationship.  Of even greater concern is that she'll be up until 1 or 2 in the morning talking to him.  She tells him that she needs to sleep, but she likes talking to him so much that she doesn't want to sleep.\n\nThat's why I call it emotional cheating and I think that's all it is now... not that it's terribly comforting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s an interesting question that I don&amp;#39;t have an answer to right now.  It hurts to think about.  I mean, this is a 10-year relationship we&amp;#39;re talking about here.  She is the only person I&amp;#39;ve been with as an adult, and 8.5 of 10 years of our relationship have been absolutely wonderful.  I can&amp;#39;t just throw it out.  I want to fix it.&lt;/p&gt;\n\n&lt;p&gt;I believe her when she says nothing physical has happened.  She is a terrible liar.  She definitely can&amp;#39;t look at me and lie to me... I know that much.  She tells me that she talks to Steve and she even tells me what they talk about sometimes.  It&amp;#39;s not some giant secret and what she tells me corresponds with what I&amp;#39;ve seen from their conversations.  She could&amp;#39;ve lied about his admission of feelings, but she didn&amp;#39;t.  That said, she doesn&amp;#39;t tell me everything, and that&amp;#39;s what concerns me.  She should have come to me, her husband and greatest confidant, if she was unhappy with some aspects of our relationship.  Of even greater concern is that she&amp;#39;ll be up until 1 or 2 in the morning talking to him.  She tells him that she needs to sleep, but she likes talking to him so much that she doesn&amp;#39;t want to sleep.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why I call it emotional cheating and I think that&amp;#39;s all it is now... not that it&amp;#39;s terribly comforting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbenvk", "score_hidden": false, "stickied": false, "created": 1492330978.0, "created_utc": 1492302178.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbdae9", "gilded": 0, "archived": false, "score": 63, "report_reasons": null, "author": "tfresca", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I saw in a comment that you couldn't leave her. Well what would make you leave her? Would it be you knowing 100 percent that she's fucking someone else? \n\nI'm sorry friend but I think that is where this is heading 100 percent if she's not doing it already. The first fight you have she'll be at his house guaranteed. That will be the excuse. \n\nShe's violated your trust and is carrying on a real relationship, not a friendship, with another man. How do you think she'd react if you did the same? \nShe's taking advantage of you. I don't think you'll do anything about it yet but please remember this as she escalates and gas lights you about the relationship. \nI don't like them but you need to give her an ultimatum. She needs to make things up to you, not the other way around. \n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I saw in a comment that you couldn&amp;#39;t leave her. Well what would make you leave her? Would it be you knowing 100 percent that she&amp;#39;s fucking someone else? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry friend but I think that is where this is heading 100 percent if she&amp;#39;s not doing it already. The first fight you have she&amp;#39;ll be at his house guaranteed. That will be the excuse. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s violated your trust and is carrying on a real relationship, not a friendship, with another man. How do you think she&amp;#39;d react if you did the same? \nShe&amp;#39;s taking advantage of you. I don&amp;#39;t think you&amp;#39;ll do anything about it yet but please remember this as she escalates and gas lights you about the relationship. \nI don&amp;#39;t like them but you need to give her an ultimatum. She needs to make things up to you, not the other way around. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbdae9", "score_hidden": false, "stickied": false, "created": 1492329042.0, "created_utc": 1492300242.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 63}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbt8my", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "laviequotidienne", "parent_id": "t1_dgbjroo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "she said it first no less!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;she said it first no less!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbt8my", "score_hidden": false, "stickied": false, "created": 1492355918.0, "created_utc": 1492327118.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbjroo", "gilded": 0, "archived": false, "score": 48, "report_reasons": null, "author": "masa130", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've never commented on this sub but I really can't not say anything, this makes me absolutely furious.\nRespect yourself man, if your good friend wrote this and you were reading it, what would you tell him ?? She KNOWS Steve has feelings for her, yet she said \"i love you\", continued to talk to him 24/7..etc. In a normal relationship, if someone says they love you and you are FUCKING MARRIED, you distance yourself and/or politely decline. What did your wife do? \nThis is absolutely ridiculous, your wife has 0 fucking respect for you. I wouldn't tolerate this AT ALL; issue an ultimatum to either have her get her shit together, or you leave. You deserve better than this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never commented on this sub but I really can&amp;#39;t not say anything, this makes me absolutely furious.\nRespect yourself man, if your good friend wrote this and you were reading it, what would you tell him ?? She KNOWS Steve has feelings for her, yet she said &amp;quot;i love you&amp;quot;, continued to talk to him 24/7..etc. In a normal relationship, if someone says they love you and you are FUCKING MARRIED, you distance yourself and/or politely decline. What did your wife do? \nThis is absolutely ridiculous, your wife has 0 fucking respect for you. I wouldn&amp;#39;t tolerate this AT ALL; issue an ultimatum to either have her get her shit together, or you leave. You deserve better than this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbjroo", "score_hidden": false, "stickied": false, "created": 1492338371.0, "created_utc": 1492309571.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 48}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgb703r", "gilded": 0, "archived": false, "score": 159, "report_reasons": null, "author": "Takes2-2Mango", "parent_id": "t1_dgb6w8w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;It's really tempting to tell Steve off and make my thoughts to him very well known without resorting to threats. Good idea? Bad idea?\n\nBad idea.  While Steve is AN enemy of your marriage, he wouldn't be a threat if you're wife was not actively letting him in, inviting him in, and encouraging his behavior.  Your issues is with your wife.  Steve is responsible for his own actions and is a shitty person, but if your wife was a better person, she would have drawn boundaries and cut him out so that he would have no effect on your marriage.  He's not the main problem...your wife is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s really tempting to tell Steve off and make my thoughts to him very well known without resorting to threats. Good idea? Bad idea?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Bad idea.  While Steve is AN enemy of your marriage, he wouldn&amp;#39;t be a threat if you&amp;#39;re wife was not actively letting him in, inviting him in, and encouraging his behavior.  Your issues is with your wife.  Steve is responsible for his own actions and is a shitty person, but if your wife was a better person, she would have drawn boundaries and cut him out so that he would have no effect on your marriage.  He&amp;#39;s not the main problem...your wife is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb703r", "score_hidden": false, "stickied": false, "created": 1492320107.0, "created_utc": 1492291307.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 159}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbjw2o", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "masa130", "parent_id": "t1_dgbcc0s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Agreed; I feel really awful for the husband.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed; I feel really awful for the husband.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbjw2o", "score_hidden": false, "stickied": false, "created": 1492338553.0, "created_utc": 1492309753.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgc32gx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "FroggyMcnasty", "parent_id": "t1_dgbcc0s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "While Steve is just a guy, he is playing this exactly how one gets a spouse to cheat. Its like textbook what he's doing. \n\nEvery single damn OP confronts her about Steve he looks better and OP looks like the \"bad guy\" here. The guy is a piece of shit and he knows what he's doing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While Steve is just a guy, he is playing this exactly how one gets a spouse to cheat. Its like textbook what he&amp;#39;s doing. &lt;/p&gt;\n\n&lt;p&gt;Every single damn OP confronts her about Steve he looks better and OP looks like the &amp;quot;bad guy&amp;quot; here. The guy is a piece of shit and he knows what he&amp;#39;s doing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc32gx", "score_hidden": false, "stickied": false, "created": 1492381871.0, "created_utc": 1492353071.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcc0s", "gilded": 0, "archived": false, "score": 111, "report_reasons": null, "author": "ShelfLifeInc", "parent_id": "t1_dgb6w8w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Steve is just a guy. Your wife is the one who is cheating on you. \n\nFrankly, even if you tell Steve to leave your wife alone (which I *do not recommend*), it won't make your wife any more committed to your marriage. She'll just find someone else to flirt with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Steve is just a guy. Your wife is the one who is cheating on you. &lt;/p&gt;\n\n&lt;p&gt;Frankly, even if you tell Steve to leave your wife alone (which I &lt;em&gt;do not recommend&lt;/em&gt;), it won&amp;#39;t make your wife any more committed to your marriage. She&amp;#39;ll just find someone else to flirt with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbcc0s", "score_hidden": false, "stickied": false, "created": 1492327713.0, "created_utc": 1492298913.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 111}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbjvc2", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "masa130", "parent_id": "t1_dgb6w8w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "While I see how you think Steve is an enemy, your wife is equally as bad for allowing this to happen. SHE continued this on, SHE CHOOSES to talk to him every day. Steve isn't playing mind tricks on her, she's neglecting you and she knows it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While I see how you think Steve is an enemy, your wife is equally as bad for allowing this to happen. SHE continued this on, SHE CHOOSES to talk to him every day. Steve isn&amp;#39;t playing mind tricks on her, she&amp;#39;s neglecting you and she knows it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbjvc2", "score_hidden": false, "stickied": false, "created": 1492338522.0, "created_utc": 1492309722.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgb9r31", "gilded": 0, "archived": false, "score": 60, "report_reasons": null, "author": "proudneanderthal", "parent_id": "t1_dgb6w8w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Steve is not an enemy, there is no enemy, and Steve has nothing to do with the problem between you and your wife.\n\nYour wife is the problem, she's choosing to spend time gaming instead of spending time in the marriage.  She's choosing to emotionally bond with someone other than her husband.  Not only is she neglecting her health, she's also neglecting her marriage and because she's neglecting her health it will put her job at risk.\n\nMarriage counseling can only help when both parties **want** things to change and improve.  I don't think your wife wants this relationship to improve, she's really happy with things, she has a husband and a boyfriend.   I know you are afraid to make her choose, but in reality she's already choosing, and she's not choosing you.   I'd pull the trigger and get on with my life, instead of being mistreated by the woman who is supposed to be in love with you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Steve is not an enemy, there is no enemy, and Steve has nothing to do with the problem between you and your wife.&lt;/p&gt;\n\n&lt;p&gt;Your wife is the problem, she&amp;#39;s choosing to spend time gaming instead of spending time in the marriage.  She&amp;#39;s choosing to emotionally bond with someone other than her husband.  Not only is she neglecting her health, she&amp;#39;s also neglecting her marriage and because she&amp;#39;s neglecting her health it will put her job at risk.&lt;/p&gt;\n\n&lt;p&gt;Marriage counseling can only help when both parties &lt;strong&gt;want&lt;/strong&gt; things to change and improve.  I don&amp;#39;t think your wife wants this relationship to improve, she&amp;#39;s really happy with things, she has a husband and a boyfriend.   I know you are afraid to make her choose, but in reality she&amp;#39;s already choosing, and she&amp;#39;s not choosing you.   I&amp;#39;d pull the trigger and get on with my life, instead of being mistreated by the woman who is supposed to be in love with you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb9r31", "score_hidden": false, "stickied": false, "created": 1492323934.0, "created_utc": 1492295134.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 60}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbwlww", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FoxWithBlueEyes", "parent_id": "t1_dgb6w8w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He knows you're not happy with him being around, and he clearly doesn't care, confronting him won't do you any good. Your wife brought Steve into your lives, she's the one you need to deal with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He knows you&amp;#39;re not happy with him being around, and he clearly doesn&amp;#39;t care, confronting him won&amp;#39;t do you any good. Your wife brought Steve into your lives, she&amp;#39;s the one you need to deal with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbwlww", "score_hidden": false, "stickied": false, "created": 1492366788.0, "created_utc": 1492337988.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgcawvc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "x0mi07", "parent_id": "t1_dgb6w8w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She said she loved him. Dude, come on!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She said she loved him. Dude, come on!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcawvc", "score_hidden": false, "stickied": false, "created": 1492392645.0, "created_utc": 1492363845.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb6w8w", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "throwaway763425", "parent_id": "t1_dgb56ld", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you.  I plan on insisting on counseling and I completely agree that Steve is enemy # 1.  \n\nIt's really tempting to tell Steve off and make my thoughts to him very well known without resorting to threats.  Good idea?  Bad idea?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you.  I plan on insisting on counseling and I completely agree that Steve is enemy # 1.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s really tempting to tell Steve off and make my thoughts to him very well known without resorting to threats.  Good idea?  Bad idea?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb6w8w", "score_hidden": false, "stickied": false, "created": 1492319959.0, "created_utc": 1492291159.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 44}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb56ld", "gilded": 0, "archived": false, "score": 176, "report_reasons": null, "author": "Takes2-2Mango", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Steve is an enemy to your marriage because of his stated interest in your wife, and because he has no moral qualms about carrying on an emotional affair with a married woman (which is what they are doing, at very least).  Your wife is allowing an enemy of your marriage to infiltrate her life.  She's choosing to keep him around, even though she knows you are hurt, upset and uncomfortable with it.  \n\nIt is long past time for a very frank discussion about this.  She must stop spending time alone with him, and if you request that of her it is NOT you being controlling, it is you asking her to honor her marriage vows and respect you and your marriage together.  I have a feeling she's going to fight for their relationship, though, which tells you just how uncommitted your wife is.  I would insist on marriage counselling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Steve is an enemy to your marriage because of his stated interest in your wife, and because he has no moral qualms about carrying on an emotional affair with a married woman (which is what they are doing, at very least).  Your wife is allowing an enemy of your marriage to infiltrate her life.  She&amp;#39;s choosing to keep him around, even though she knows you are hurt, upset and uncomfortable with it.  &lt;/p&gt;\n\n&lt;p&gt;It is long past time for a very frank discussion about this.  She must stop spending time alone with him, and if you request that of her it is NOT you being controlling, it is you asking her to honor her marriage vows and respect you and your marriage together.  I have a feeling she&amp;#39;s going to fight for their relationship, though, which tells you just how uncommitted your wife is.  I would insist on marriage counselling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb56ld", "score_hidden": false, "stickied": false, "created": 1492317592.0, "created_utc": 1492288792.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 176}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgb1y22", "gilded": 0, "archived": false, "score": 65, "report_reasons": null, "author": "Hadd_77", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "First, I'm so sorry you're going through that. You have every right to feel the way you do. I would be just as crushed as you. I think like you said, counseling  might be the best. She needs to realize she has an addiction &amp; what she's doing is very hurtful to your relationship. \n\nIf things don't change, I'm afraid you might have to give her a choice. I know you love her, but these things only work out if the other person is willing to put the effort in. Her gaming lifestyle has got to go... \n\nBest of luck! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First, I&amp;#39;m so sorry you&amp;#39;re going through that. You have every right to feel the way you do. I would be just as crushed as you. I think like you said, counseling  might be the best. She needs to realize she has an addiction &amp;amp; what she&amp;#39;s doing is very hurtful to your relationship. &lt;/p&gt;\n\n&lt;p&gt;If things don&amp;#39;t change, I&amp;#39;m afraid you might have to give her a choice. I know you love her, but these things only work out if the other person is willing to put the effort in. Her gaming lifestyle has got to go... &lt;/p&gt;\n\n&lt;p&gt;Best of luck! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb1y22", "score_hidden": false, "stickied": false, "created": 1492313185.0, "created_utc": 1492284385.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 65}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgb8u23", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "bigram_s", "parent_id": "t1_dgb7s6v", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Same thing happened to me. I wasn't ready to leave her until she left me. She was distant in our day-to-day as well though. Also, I'm not saying your wife will behave similarly to my ex, of course. I'm just saying you need to be prepared for the worst case, otherwise you might end up blindsided by one of the worst circumstances that can happen to a person, in my book at least.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same thing happened to me. I wasn&amp;#39;t ready to leave her until she left me. She was distant in our day-to-day as well though. Also, I&amp;#39;m not saying your wife will behave similarly to my ex, of course. I&amp;#39;m just saying you need to be prepared for the worst case, otherwise you might end up blindsided by one of the worst circumstances that can happen to a person, in my book at least.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb8u23", "score_hidden": false, "stickied": false, "created": 1492322635.0, "created_utc": 1492293835.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7s6v", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "throwaway763425", "parent_id": "t1_dgb4r82", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you for this.  \n\nI am an optimist and a planner by nature.  I make a lot of plans and envision things going a certain way.  I guess I never saw this marriage problem coming to be honest, and now I have no plan for it.  I expected disagreements over chores, money, politics, etc..  Never this.  I thought it couldn't happen to me. \n\nThe thing is, in face-to-face day-to-day life, she still goes through the motions of a loving wife in a lot of ways.  She still gives me hugs when I go in for one and she still gives me little kisses when I go in for them.  Then when I want to talk about our relationship, she's so distant.  It's so damn confusing to me.\n\nThe thing is... I don't know if I could ever leave her.  That's part of my problem.  Leaving is, at least at this point, not a consideration.  I love her way too much and I just can't see myself with anyone else.  Just thinking about it makes me nauseous. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this.  &lt;/p&gt;\n\n&lt;p&gt;I am an optimist and a planner by nature.  I make a lot of plans and envision things going a certain way.  I guess I never saw this marriage problem coming to be honest, and now I have no plan for it.  I expected disagreements over chores, money, politics, etc..  Never this.  I thought it couldn&amp;#39;t happen to me. &lt;/p&gt;\n\n&lt;p&gt;The thing is, in face-to-face day-to-day life, she still goes through the motions of a loving wife in a lot of ways.  She still gives me hugs when I go in for one and she still gives me little kisses when I go in for them.  Then when I want to talk about our relationship, she&amp;#39;s so distant.  It&amp;#39;s so damn confusing to me.&lt;/p&gt;\n\n&lt;p&gt;The thing is... I don&amp;#39;t know if I could ever leave her.  That&amp;#39;s part of my problem.  Leaving is, at least at this point, not a consideration.  I love her way too much and I just can&amp;#39;t see myself with anyone else.  Just thinking about it makes me nauseous. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb7s6v", "score_hidden": false, "stickied": false, "created": 1492321170.0, "created_utc": 1492292370.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4r82", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb4r82", "score_hidden": false, "stickied": false, "created": 1492317014.0, "created_utc": 1492288214.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgb6105", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "sbnew2", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Oh this one resonated with me.... I am sorry. This is NOT a good situations and I was getting pissed at your wife just reading through your post. I had similar experience myself, when I found message exchanges of very similar nature between my ex and another girl that I knew as his friend. Similar complaints, love you declarations... so inappropriate and so hurtful. I have nearly photographic memory so for months later I kept \"seeing\" these words in my memory. Needles to say, it broke my trust. I couldn't trust him anymore and it ruined our relationship. Ultimately, 6 months later I left, i knew I couldn't undo the damage and I didn't want to compete with practically a stranger. \nShe is so twisted right now. Bringing him to meet her mom? Fuck that. \nIt's all very disrespectful for you. And do not allow her to gaslight you and guilt trip you with phrases like \"don't you trust me?\" The answer is and should be: NO. You broke my trust. \nIf the roles were reversed, everyone on this thread would be saying leave him, he is a cheating asshole. So don't downplay the disrespect that you wife is showing you know just because she is a woman. \nI am sorry OP. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh this one resonated with me.... I am sorry. This is NOT a good situations and I was getting pissed at your wife just reading through your post. I had similar experience myself, when I found message exchanges of very similar nature between my ex and another girl that I knew as his friend. Similar complaints, love you declarations... so inappropriate and so hurtful. I have nearly photographic memory so for months later I kept &amp;quot;seeing&amp;quot; these words in my memory. Needles to say, it broke my trust. I couldn&amp;#39;t trust him anymore and it ruined our relationship. Ultimately, 6 months later I left, i knew I couldn&amp;#39;t undo the damage and I didn&amp;#39;t want to compete with practically a stranger. \nShe is so twisted right now. Bringing him to meet her mom? Fuck that. \nIt&amp;#39;s all very disrespectful for you. And do not allow her to gaslight you and guilt trip you with phrases like &amp;quot;don&amp;#39;t you trust me?&amp;quot; The answer is and should be: NO. You broke my trust. \nIf the roles were reversed, everyone on this thread would be saying leave him, he is a cheating asshole. So don&amp;#39;t downplay the disrespect that you wife is showing you know just because she is a woman. \nI am sorry OP. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb6105", "score_hidden": false, "stickied": false, "created": 1492318741.0, "created_utc": 1492289941.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgc31ew", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shutup_irl", "parent_id": "t1_dgbnhlv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The wife kind of needs to do this herself. Write down any time she's at the computer vs any time she's with her husband and the times she's spending with both don't count.\n\n\nShe needs to be able to see the clear difference in her own handwriting otherwise she will refuse to see it that way. Addiction is a motherfucker.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The wife kind of needs to do this herself. Write down any time she&amp;#39;s at the computer vs any time she&amp;#39;s with her husband and the times she&amp;#39;s spending with both don&amp;#39;t count.&lt;/p&gt;\n\n&lt;p&gt;She needs to be able to see the clear difference in her own handwriting otherwise she will refuse to see it that way. Addiction is a motherfucker.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc31ew", "score_hidden": false, "stickied": false, "created": 1492381826.0, "created_utc": 1492353026.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnhlv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "UltimaStone", "parent_id": "t1_dgbj4ej", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There might be a way to find out the hours she has played. Steam says how many hours and maybe Battlenet might count hours too, idk.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There might be a way to find out the hours she has played. Steam says how many hours and maybe Battlenet might count hours too, idk.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbnhlv", "score_hidden": false, "stickied": false, "created": 1492344009.0, "created_utc": 1492315209.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbj4ej", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "pencilnelectron", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My wife checked out on me emotionally for a few years but we still had sex about once a month during that.  Less sex leads to no sex and a divorce.  Sounds like you want to avoid that. \n\nAsk her to set a date night for ZERO gaming that day and get her back to talking just to you.  If you don't insert back into her relationship, you won't have one.  Make it her choice which night, but insist on it.  Try to make sex part of it.\n\nGet counceling.   I had it, it helps.  If she's not willing, you know the marriage is going to die because she obviously would not care about how YOU feel in the relationship. \n\nAlso, I played MMOs and they can be addicting.  I think you might need to start thinking of it that way.  More of an addiction.  Ask her to write down all the time she spends online and all the time she spends with you for a week and see what she says about that.\n\nIn the long run, something needs to change because you are unhappy.  Even if you opened up your marriage, which you are not, you still need to feel wanted and happy with the way things are.  Tell her how much you hurt.  Make her see what she is doing to you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My wife checked out on me emotionally for a few years but we still had sex about once a month during that.  Less sex leads to no sex and a divorce.  Sounds like you want to avoid that. &lt;/p&gt;\n\n&lt;p&gt;Ask her to set a date night for ZERO gaming that day and get her back to talking just to you.  If you don&amp;#39;t insert back into her relationship, you won&amp;#39;t have one.  Make it her choice which night, but insist on it.  Try to make sex part of it.&lt;/p&gt;\n\n&lt;p&gt;Get counceling.   I had it, it helps.  If she&amp;#39;s not willing, you know the marriage is going to die because she obviously would not care about how YOU feel in the relationship. &lt;/p&gt;\n\n&lt;p&gt;Also, I played MMOs and they can be addicting.  I think you might need to start thinking of it that way.  More of an addiction.  Ask her to write down all the time she spends online and all the time she spends with you for a week and see what she says about that.&lt;/p&gt;\n\n&lt;p&gt;In the long run, something needs to change because you are unhappy.  Even if you opened up your marriage, which you are not, you still need to feel wanted and happy with the way things are.  Tell her how much you hurt.  Make her see what she is doing to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbj4ej", "score_hidden": false, "stickied": false, "created": 1492337411.0, "created_utc": 1492308611.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbth38", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "laviequotidienne", "parent_id": "t1_dgbj9en", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I can almost guarantee she had lunch with him and her mother so that she could get her mother's opinion on him and advice on whether or not she should leave OP. mothers tend to care about what's best for their children rather than their son in laws, and OP's wife admitted to talking about steve to her. she also bad mouthed OP to steve, so i wouldn't be surprised if she did it to her mom as well, making her think that OP wasn't treating her well and would maybe be better off with someone else\n\n/u/throwaway763425 , I know this is hard, but do you think there's any validity in this? I'm so sorry you're going through this, just want to make sure you're prepared for the worst. if she refuses to talk, or to get help, then you walk. there's only so much you can do, and so much heartbreak you can put yourself through, before you decide to move on. she is not the same woman she was when she was 18, and she's putting you through hell not knowing what is really happening. setting hard boundaries on what she needs to do to make this work (go to counseling, then go non contact with this guy) and choosing to walk if she doesn't follow those boundaries -- this will help you regain control. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can almost guarantee she had lunch with him and her mother so that she could get her mother&amp;#39;s opinion on him and advice on whether or not she should leave OP. mothers tend to care about what&amp;#39;s best for their children rather than their son in laws, and OP&amp;#39;s wife admitted to talking about steve to her. she also bad mouthed OP to steve, so i wouldn&amp;#39;t be surprised if she did it to her mom as well, making her think that OP wasn&amp;#39;t treating her well and would maybe be better off with someone else&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"/u/throwaway763425\"&gt;/u/throwaway763425&lt;/a&gt; , I know this is hard, but do you think there&amp;#39;s any validity in this? I&amp;#39;m so sorry you&amp;#39;re going through this, just want to make sure you&amp;#39;re prepared for the worst. if she refuses to talk, or to get help, then you walk. there&amp;#39;s only so much you can do, and so much heartbreak you can put yourself through, before you decide to move on. she is not the same woman she was when she was 18, and she&amp;#39;s putting you through hell not knowing what is really happening. setting hard boundaries on what she needs to do to make this work (go to counseling, then go non contact with this guy) and choosing to walk if she doesn&amp;#39;t follow those boundaries -- this will help you regain control. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbth38", "score_hidden": false, "stickied": false, "created": 1492356549.0, "created_utc": 1492327749.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbj9en", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "littlebithippy", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The thing about this type of problem is it already has escalated. You can't keep someone from cheating on you or leaving you for someone else and it sounds like she's already making her decision. The fact that she is overlooking your discomfort for her friendship with this dude says volumes. The fact she is introducing her to her mother does as well. You need to tell her you won't be strung along while she makes sure it's safe enough with this dude to leave you. That's what she's doing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing about this type of problem is it already has escalated. You can&amp;#39;t keep someone from cheating on you or leaving you for someone else and it sounds like she&amp;#39;s already making her decision. The fact that she is overlooking your discomfort for her friendship with this dude says volumes. The fact she is introducing her to her mother does as well. You need to tell her you won&amp;#39;t be strung along while she makes sure it&amp;#39;s safe enough with this dude to leave you. That&amp;#39;s what she&amp;#39;s doing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbj9en", "score_hidden": false, "stickied": false, "created": 1492337624.0, "created_utc": 1492308824.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgb6k3b", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Dssurf", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Sounds like she's checking out. You should have a frank discussion with her; not just about Steve, but where does she see the relationship going? Don't sound like your accusing her because it sounds like she'll just you out. Suggest counseling at least once. Ask her if she still sees you in her future. They're tough questions but at some point you need to know if you have a future with her. Good luck mate. Keep us posted.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like she&amp;#39;s checking out. You should have a frank discussion with her; not just about Steve, but where does she see the relationship going? Don&amp;#39;t sound like your accusing her because it sounds like she&amp;#39;ll just you out. Suggest counseling at least once. Ask her if she still sees you in her future. They&amp;#39;re tough questions but at some point you need to know if you have a future with her. Good luck mate. Keep us posted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb6k3b", "score_hidden": false, "stickied": false, "created": 1492319486.0, "created_utc": 1492290686.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbm3ug", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "cetaceans_for_trump", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She cares about her relationship with him more than her relationship with you, that much is obvious. \n\nWhat the fuck is with him coming over and hanging out with your wife when you're at work? That's hilariously inappropriate and if they're not fucking already I'll eat my hat.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She cares about her relationship with him more than her relationship with you, that much is obvious. &lt;/p&gt;\n\n&lt;p&gt;What the fuck is with him coming over and hanging out with your wife when you&amp;#39;re at work? That&amp;#39;s hilariously inappropriate and if they&amp;#39;re not fucking already I&amp;#39;ll eat my hat.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbm3ug", "score_hidden": false, "stickied": false, "created": 1492341847.0, "created_utc": 1492313047.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbsx48", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "FroggyMcnasty", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Dude, you're in denial. Your wife IS cheating on you with Steve, Hell, she's bringing him around to have lunch with her mother? Telling each other they love one another, and keeps throwing in your face that you're \"controlling\" you're married to one emotionally manipulative piece of shit. \n\nYour marriage is so fucked right now, and your wife doesn't give a flying fuck about fixing it. She's making plans to leave you and you're so many steps behind that you have no clue that marriage counseling is not the answer here. You need a good divorce lawyer and you need to get on top of this. Your wife knows this is wrong and she's doing it anyway, you need to start being more proactive and protect yourself. \n\nSeriously dude, you have so many red flags going on right now that you should have warning sirens blasting through her cheating ears. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude, you&amp;#39;re in denial. Your wife IS cheating on you with Steve, Hell, she&amp;#39;s bringing him around to have lunch with her mother? Telling each other they love one another, and keeps throwing in your face that you&amp;#39;re &amp;quot;controlling&amp;quot; you&amp;#39;re married to one emotionally manipulative piece of shit. &lt;/p&gt;\n\n&lt;p&gt;Your marriage is so fucked right now, and your wife doesn&amp;#39;t give a flying fuck about fixing it. She&amp;#39;s making plans to leave you and you&amp;#39;re so many steps behind that you have no clue that marriage counseling is not the answer here. You need a good divorce lawyer and you need to get on top of this. Your wife knows this is wrong and she&amp;#39;s doing it anyway, you need to start being more proactive and protect yourself. &lt;/p&gt;\n\n&lt;p&gt;Seriously dude, you have so many red flags going on right now that you should have warning sirens blasting through her cheating ears. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbsx48", "score_hidden": false, "stickied": false, "created": 1492355041.0, "created_utc": 1492326241.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgb8ehr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "throwaway763425", "parent_id": "t1_dgb6los", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks for the laugh.  It's a PC and a wonderful one at that.  She would definitely resent me if I got rid of it.\n\nShe still has a laptop and a cellphone.  She might not be able to play the game with those, but she would definitely be involved in the community, which I think is the root of the problem.  I think she's watching other people play it more than she plays it.  It's weird to me, I must admit.  I casually play console games, but never more than 3-5 hours a week, and never for more than an hour at a time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the laugh.  It&amp;#39;s a PC and a wonderful one at that.  She would definitely resent me if I got rid of it.&lt;/p&gt;\n\n&lt;p&gt;She still has a laptop and a cellphone.  She might not be able to play the game with those, but she would definitely be involved in the community, which I think is the root of the problem.  I think she&amp;#39;s watching other people play it more than she plays it.  It&amp;#39;s weird to me, I must admit.  I casually play console games, but never more than 3-5 hours a week, and never for more than an hour at a time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb8ehr", "score_hidden": false, "stickied": false, "created": 1492322028.0, "created_utc": 1492293228.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb6los", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "Crash662244", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": " Don't you throw bottle of booze down the drain when that's an issue? Throw the gaming unit out the window. Solved! I will thank you in advance for the down votes...😀", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t you throw bottle of booze down the drain when that&amp;#39;s an issue? Throw the gaming unit out the window. Solved! I will thank you in advance for the down votes...😀&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb6los", "score_hidden": false, "stickied": false, "created": 1492319547.0, "created_utc": 1492290747.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgblquc", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "greenstorm12", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Oh man i've been there and it sucks it feels like your trying to push a 1 ton rock up a hill and all she keeps saying is \"He's just a friend! Stop Being Inseure! Trust me!\" But deep down you know what's happening.  From my experience and other situations I have seen this never ends well. Once a woman has checked out of a relationship that's it.\n\nWhat it sounds like to me is your wife is depressed and is lost so she's connecting with this guy on a emotional level so what that pretty much translates to \"He's telling her what she want's to hear and she's loving it\".\n\nMy way of dealing with this at the time was trying to talk to her to see what was wrong. I would constantly tell her I was not happy with her relationship with so called \"Male Friend\" this only ever led to arguments and eventuall split.\n\nHowever I would do thing's so much differnet now first I would sit back and see what you can improve on the relationship better sex life, doing new activities together ect....but I see you are trying that already so I would do the key thing here.\n\nDo a slow fade and have more of a life outside of your relationship just come home one night and she will be like where were you? Oh just doing some hiking with all my friends and just walk away. The look on her face while she sits there on the computer while talking to all her depressed little friends will say it all! \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man i&amp;#39;ve been there and it sucks it feels like your trying to push a 1 ton rock up a hill and all she keeps saying is &amp;quot;He&amp;#39;s just a friend! Stop Being Inseure! Trust me!&amp;quot; But deep down you know what&amp;#39;s happening.  From my experience and other situations I have seen this never ends well. Once a woman has checked out of a relationship that&amp;#39;s it.&lt;/p&gt;\n\n&lt;p&gt;What it sounds like to me is your wife is depressed and is lost so she&amp;#39;s connecting with this guy on a emotional level so what that pretty much translates to &amp;quot;He&amp;#39;s telling her what she want&amp;#39;s to hear and she&amp;#39;s loving it&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;My way of dealing with this at the time was trying to talk to her to see what was wrong. I would constantly tell her I was not happy with her relationship with so called &amp;quot;Male Friend&amp;quot; this only ever led to arguments and eventuall split.&lt;/p&gt;\n\n&lt;p&gt;However I would do thing&amp;#39;s so much differnet now first I would sit back and see what you can improve on the relationship better sex life, doing new activities together ect....but I see you are trying that already so I would do the key thing here.&lt;/p&gt;\n\n&lt;p&gt;Do a slow fade and have more of a life outside of your relationship just come home one night and she will be like where were you? Oh just doing some hiking with all my friends and just walk away. The look on her face while she sits there on the computer while talking to all her depressed little friends will say it all! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgblquc", "score_hidden": false, "stickied": false, "created": 1492341289.0, "created_utc": 1492312489.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbqday", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "TomahawkCruise", "parent_id": "t1_dgbe724", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Absolutely right. Sex once in a year isn't just a red flag. It's a massive crimson sheet with the words \"wake up!!!' printed on it, smacking you in the face.\n\nSudden lack of sexual desire may be the largest sign of cheating or a desire to cheat.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely right. Sex once in a year isn&amp;#39;t just a red flag. It&amp;#39;s a massive crimson sheet with the words &amp;quot;wake up!!!&amp;#39; printed on it, smacking you in the face.&lt;/p&gt;\n\n&lt;p&gt;Sudden lack of sexual desire may be the largest sign of cheating or a desire to cheat.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbqday", "score_hidden": false, "stickied": false, "created": 1492349121.0, "created_utc": 1492320321.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbe724", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "ShotFish", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;Sidenote: As you can imagine, this has killed intimacy in the relationship. We've only had sex once in the last year. It was, at one time in our relationship, at least once a week.\n\nThis is not a side note. This is a huge failing in your relationship. Your wife is not sexually attracted to you anymore. But she has smiles and flirtatious word for Steve.\n\n1) Stop the relationship talk, which not getting you anywhere and is making you seems desperate;\n\n2) Are you in good shape? Time to hit the gym. In part you need to let of steam because the situation you're in;\n\n3) Read about the 180 – detaching from a spouse in preparation to leave them. It is far better to be the dumper than the dumped;\n\n4) Your wife sounds selfish and pretty flighty. Is she such a great partner; do you see yourself spending decades without pussy?\n\nIf you should happen to have kids, her libido, already gone, maybe end up a distant memory.\n\n5) Start doing things that make you happy. Connect up with friends, family, hobbies. Don't let your state of mind depend on her.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Sidenote: As you can imagine, this has killed intimacy in the relationship. We&amp;#39;ve only had sex once in the last year. It was, at one time in our relationship, at least once a week.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is not a side note. This is a huge failing in your relationship. Your wife is not sexually attracted to you anymore. But she has smiles and flirtatious word for Steve.&lt;/p&gt;\n\n&lt;p&gt;1) Stop the relationship talk, which not getting you anywhere and is making you seems desperate;&lt;/p&gt;\n\n&lt;p&gt;2) Are you in good shape? Time to hit the gym. In part you need to let of steam because the situation you&amp;#39;re in;&lt;/p&gt;\n\n&lt;p&gt;3) Read about the 180 – detaching from a spouse in preparation to leave them. It is far better to be the dumper than the dumped;&lt;/p&gt;\n\n&lt;p&gt;4) Your wife sounds selfish and pretty flighty. Is she such a great partner; do you see yourself spending decades without pussy?&lt;/p&gt;\n\n&lt;p&gt;If you should happen to have kids, her libido, already gone, maybe end up a distant memory.&lt;/p&gt;\n\n&lt;p&gt;5) Start doing things that make you happy. Connect up with friends, family, hobbies. Don&amp;#39;t let your state of mind depend on her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbe724", "score_hidden": false, "stickied": false, "created": 1492330290.0, "created_utc": 1492301490.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbhbpd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Dreamsonly", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm not married, so I can't give much advice, but that's a really shitty situation and I'm sorry you're going through it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not married, so I can&amp;#39;t give much advice, but that&amp;#39;s a really shitty situation and I&amp;#39;m sorry you&amp;#39;re going through it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbhbpd", "score_hidden": false, "stickied": false, "created": 1492334785.0, "created_utc": 1492305985.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbt9bx", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "throwaway23482042433", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm very sorry that this is happening to you, OP. It certainly does sound like emotional cheating. Now while I agree that Steve is an enemy to your marriage, please do not absolve responsibility from your wife. He is not a threaten in and of himself. She is allowing him to be a threat. Does that make sense? \n\nYour wife is being very unfair to you. Men and women can surely be friends, but it is, in my opinion, inappropriate and disrespectful for a married woman to carry out a friendship with a man who has feelings for her. It is disrespectful to you, her husband, and she is essentially leading the other man on. *She* may see it as merely platonic, but he evidently does not and has even admitted so himself. The fact that she continues to remain friends with him after he admitted that is not okay, imo. My boyfriend has more female friends than male, but I would absolutely be extremely uncomfortable if he had this type of a relationship with a female friend who had romantic feelings for him.\n\nRegardless of whether or not she likes him, something is wrong. No one in a happy relationship feels the way that you're feeling. The fact that she is giving more attention and love to her \"best friend\" than to you is not okay. The fact that you guys have a dead bedroom is not okay. The fact that she secretly went out on a lunch date with Steve and her mom is not okay. Nothing that she is doing is okay. \n\nYou don't deserve a relationship like this. You need to open up to your wife once and for all. If my boyfriend ever came to me with *tears* on his face, I would throw everything aside to be there for him, OP. It's sad that your wife is neglecting you like this. \n\nI know that you are scared and that you love her and want to be with her forever, but I don't know if that's foreseeable right now. It seems like that's not what she wants. OP, I have no idea what's going through your wife's head. She truly could just be gullible and naive. It doesn't matter, though. What matters is how this is affecting you. \n\nAlso, despite how tempting it may be to message Steve -- don't. Don't do it. Steve will most definitely manipulate that situation to benefit himself. He could even try to persuade your wife into seeing *you* as the bad guy. Don't do it, OP. You will fling yourself deeper into this shithole.\n\nFor now, I would recommend you get into therapy. You need an outlet for what you're feeling and you need ongoing guidance. \n\nRemember, Steve may be an enemy, but it is your wife granting him access to that title. *She* is allowing this to happen. And don't forget that *regardless* of what your wife thinks of her friendship with him, she is neglecting you and making you feel this way, and that's what actually matters.\n\nI'm sorry, OP. This was very sad to read and I hope that you can find happiness soon. You deserve a lot better than what you're getting here. I know that the thought of losing someone you love dearly is terrifying, but don't stay with someone just because you're scared to be without them. You're going to slowly wither away. Leaving, if it comes down to that, will hurt. Immensely. And that's okay. It's necessary to feel those emotions. Let yourself feel that hurt and let yourself cry, if need be. \"Grieve so that you be free to feel something else.\"\n\nSorry for the giant wall of cliché text. I just really feel for you.\n\nEdit: One more thing! If you do end up giving your wife an ultimatum, remember, SHE DID THIS TO HERSELF. She chose to make this get to the point where you have to throw down an ultimatum. You are not the bad guy in this. Setting an ultimatum does not make you the bad guy. If she chooses him in said ultimatum, remember, *SHE* is the one who is throwing away the relationship, not you. Setting an ultimatum is not ending the relationship. She is. Don't forget that.", "edited": 1492327524.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m very sorry that this is happening to you, OP. It certainly does sound like emotional cheating. Now while I agree that Steve is an enemy to your marriage, please do not absolve responsibility from your wife. He is not a threaten in and of himself. She is allowing him to be a threat. Does that make sense? &lt;/p&gt;\n\n&lt;p&gt;Your wife is being very unfair to you. Men and women can surely be friends, but it is, in my opinion, inappropriate and disrespectful for a married woman to carry out a friendship with a man who has feelings for her. It is disrespectful to you, her husband, and she is essentially leading the other man on. &lt;em&gt;She&lt;/em&gt; may see it as merely platonic, but he evidently does not and has even admitted so himself. The fact that she continues to remain friends with him after he admitted that is not okay, imo. My boyfriend has more female friends than male, but I would absolutely be extremely uncomfortable if he had this type of a relationship with a female friend who had romantic feelings for him.&lt;/p&gt;\n\n&lt;p&gt;Regardless of whether or not she likes him, something is wrong. No one in a happy relationship feels the way that you&amp;#39;re feeling. The fact that she is giving more attention and love to her &amp;quot;best friend&amp;quot; than to you is not okay. The fact that you guys have a dead bedroom is not okay. The fact that she secretly went out on a lunch date with Steve and her mom is not okay. Nothing that she is doing is okay. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t deserve a relationship like this. You need to open up to your wife once and for all. If my boyfriend ever came to me with &lt;em&gt;tears&lt;/em&gt; on his face, I would throw everything aside to be there for him, OP. It&amp;#39;s sad that your wife is neglecting you like this. &lt;/p&gt;\n\n&lt;p&gt;I know that you are scared and that you love her and want to be with her forever, but I don&amp;#39;t know if that&amp;#39;s foreseeable right now. It seems like that&amp;#39;s not what she wants. OP, I have no idea what&amp;#39;s going through your wife&amp;#39;s head. She truly could just be gullible and naive. It doesn&amp;#39;t matter, though. What matters is how this is affecting you. &lt;/p&gt;\n\n&lt;p&gt;Also, despite how tempting it may be to message Steve -- don&amp;#39;t. Don&amp;#39;t do it. Steve will most definitely manipulate that situation to benefit himself. He could even try to persuade your wife into seeing &lt;em&gt;you&lt;/em&gt; as the bad guy. Don&amp;#39;t do it, OP. You will fling yourself deeper into this shithole.&lt;/p&gt;\n\n&lt;p&gt;For now, I would recommend you get into therapy. You need an outlet for what you&amp;#39;re feeling and you need ongoing guidance. &lt;/p&gt;\n\n&lt;p&gt;Remember, Steve may be an enemy, but it is your wife granting him access to that title. &lt;em&gt;She&lt;/em&gt; is allowing this to happen. And don&amp;#39;t forget that &lt;em&gt;regardless&lt;/em&gt; of what your wife thinks of her friendship with him, she is neglecting you and making you feel this way, and that&amp;#39;s what actually matters.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry, OP. This was very sad to read and I hope that you can find happiness soon. You deserve a lot better than what you&amp;#39;re getting here. I know that the thought of losing someone you love dearly is terrifying, but don&amp;#39;t stay with someone just because you&amp;#39;re scared to be without them. You&amp;#39;re going to slowly wither away. Leaving, if it comes down to that, will hurt. Immensely. And that&amp;#39;s okay. It&amp;#39;s necessary to feel those emotions. Let yourself feel that hurt and let yourself cry, if need be. &amp;quot;Grieve so that you be free to feel something else.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Sorry for the giant wall of cliché text. I just really feel for you.&lt;/p&gt;\n\n&lt;p&gt;Edit: One more thing! If you do end up giving your wife an ultimatum, remember, SHE DID THIS TO HERSELF. She chose to make this get to the point where you have to throw down an ultimatum. You are not the bad guy in this. Setting an ultimatum does not make you the bad guy. If she chooses him in said ultimatum, remember, &lt;em&gt;SHE&lt;/em&gt; is the one who is throwing away the relationship, not you. Setting an ultimatum is not ending the relationship. She is. Don&amp;#39;t forget that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbt9bx", "score_hidden": false, "stickied": false, "created": 1492355970.0, "created_utc": 1492327170.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbiubz", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Spektor0925", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Divorce time.\n\nShes already decided that, even aside from this \"Steve\" guy being a marriage destroyer, her willful addiction to this gaming community is already more important to her than you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Divorce time.&lt;/p&gt;\n\n&lt;p&gt;Shes already decided that, even aside from this &amp;quot;Steve&amp;quot; guy being a marriage destroyer, her willful addiction to this gaming community is already more important to her than you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbiubz", "score_hidden": false, "stickied": false, "created": 1492337002.0, "created_utc": 1492308202.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbntal", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "UltimaStone", "parent_id": "t1_dgblz7i", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I honestly don't know how OP has tolerated this to escalate for a year and a half. \n\nI've never had a 10 year relationship myself but I don't think time is a good reason to stick it out with someone. 8.5 years of happiness and 1.5 years of misery isn't a good ratio. It's getting worse not better, it'd be different if she stopped the emotional abuse and stopped being a shit wife and wanted to improve but she doesn't. \n\nDoes he even love \"her\" anymore or what she used to be? Marriage problems being bought up to ANYONE like friends or parents with the notion she has like \"I want someone to tell ne I'm right\" is bad enough. Add in the fact that she is spending a huge chunk of time with this guy and it gets even worse.\n\nI honestly wonder why she hasn't just left. I wonder if OP is financially supporting her or if deep down she knows this Steve guy isn't relationship material and just some guy who makes her feel good about herself. I just don't get it.\n\nHow would you feel if your wife took the guy to meet her mum? This part makes me think wife's whole family has no conscience. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I honestly don&amp;#39;t know how OP has tolerated this to escalate for a year and a half. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never had a 10 year relationship myself but I don&amp;#39;t think time is a good reason to stick it out with someone. 8.5 years of happiness and 1.5 years of misery isn&amp;#39;t a good ratio. It&amp;#39;s getting worse not better, it&amp;#39;d be different if she stopped the emotional abuse and stopped being a shit wife and wanted to improve but she doesn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;Does he even love &amp;quot;her&amp;quot; anymore or what she used to be? Marriage problems being bought up to ANYONE like friends or parents with the notion she has like &amp;quot;I want someone to tell ne I&amp;#39;m right&amp;quot; is bad enough. Add in the fact that she is spending a huge chunk of time with this guy and it gets even worse.&lt;/p&gt;\n\n&lt;p&gt;I honestly wonder why she hasn&amp;#39;t just left. I wonder if OP is financially supporting her or if deep down she knows this Steve guy isn&amp;#39;t relationship material and just some guy who makes her feel good about herself. I just don&amp;#39;t get it.&lt;/p&gt;\n\n&lt;p&gt;How would you feel if your wife took the guy to meet her mum? This part makes me think wife&amp;#39;s whole family has no conscience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbntal", "score_hidden": false, "stickied": false, "created": 1492344544.0, "created_utc": 1492315744.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgblz7i", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "lcfparty15", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Bro, I read to the part about her complaining about you to her internet boyfriend and I was like, \"Oh hell no.\"\n\nI'm married about the same length as you, and if my wife did that, I'd be out the fucking door. I wouldn't come back unless she cut all contact with dickbag immediately, and even then, we'd be in a bad place for a long time to come.\n\nAnd I love my wife dearly as you describe, I'm over the moon for her. I understand if you think I'm just saying this because I'm not in the situation. But believe me, dude, I'd be gone. I do not fuck around with that sort of thing, and neither should you. \n\nIt's serious wake up time for her, and I'd go ahead and call a lawyer because at this point, I don't think she's coming back, man. I'm really, really sorry, but you're still young and it's gonna be OK.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bro, I read to the part about her complaining about you to her internet boyfriend and I was like, &amp;quot;Oh hell no.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m married about the same length as you, and if my wife did that, I&amp;#39;d be out the fucking door. I wouldn&amp;#39;t come back unless she cut all contact with dickbag immediately, and even then, we&amp;#39;d be in a bad place for a long time to come.&lt;/p&gt;\n\n&lt;p&gt;And I love my wife dearly as you describe, I&amp;#39;m over the moon for her. I understand if you think I&amp;#39;m just saying this because I&amp;#39;m not in the situation. But believe me, dude, I&amp;#39;d be gone. I do not fuck around with that sort of thing, and neither should you. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s serious wake up time for her, and I&amp;#39;d go ahead and call a lawyer because at this point, I don&amp;#39;t think she&amp;#39;s coming back, man. I&amp;#39;m really, really sorry, but you&amp;#39;re still young and it&amp;#39;s gonna be OK.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgblz7i", "score_hidden": false, "stickied": false, "created": 1492341643.0, "created_utc": 1492312843.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbnwzs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "UltimaStone", "parent_id": "t1_dgbm0ub", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah I am curious as to this now you have pointed it out. Did she start gaming as a hobby or did she take it up with the intention of shutting OP out from the beginning?\n\nThere's definitely more than Steve's influence. I feel like if it wasn't Steve it would be Bob or Derek or Alan or David. She is looking for anyone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I am curious as to this now you have pointed it out. Did she start gaming as a hobby or did she take it up with the intention of shutting OP out from the beginning?&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s definitely more than Steve&amp;#39;s influence. I feel like if it wasn&amp;#39;t Steve it would be Bob or Derek or Alan or David. She is looking for anyone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbnwzs", "score_hidden": false, "stickied": false, "created": 1492344729.0, "created_utc": 1492315929.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbqjex", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MLGsandwichmaker", "parent_id": "t1_dgbm0ub", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is very true, OP should read this.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is very true, OP should read this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbqjex", "score_hidden": false, "stickied": false, "created": 1492349454.0, "created_utc": 1492320654.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbm0ub", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "tealparadise", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So.... When she said she has frustrations with your marriage and continuously expressed unhappiness with you &amp; stopped romantically engaging and having sex with you...... When exactly did you address that?  \n     \nI'm seeing a lot of Steve Steve Steve here..... Your wife is so unhappy in the marriage that she relegated you to roommate and changed her schedule to interact as little as possible.  And you aknowledge that when say you don't know what would happen if you gave an ultimatum.  \n  \n \n    \nYou have bigger problems than Steve.  He's a symptom of the fact that your relationship is in the toilet.  \n   \nIn this whole post you don't once say why your wife is unhappy.  What her problem with you is.  \n   \nIf you really don't know that, you're fucked.  If you know and it's not something you are willing to address (or you think you're right and she should change), you're double fucked.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So.... When she said she has frustrations with your marriage and continuously expressed unhappiness with you &amp;amp; stopped romantically engaging and having sex with you...... When exactly did you address that?  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m seeing a lot of Steve Steve Steve here..... Your wife is so unhappy in the marriage that she relegated you to roommate and changed her schedule to interact as little as possible.  And you aknowledge that when say you don&amp;#39;t know what would happen if you gave an ultimatum.  &lt;/p&gt;\n\n&lt;p&gt;You have bigger problems than Steve.  He&amp;#39;s a symptom of the fact that your relationship is in the toilet.  &lt;/p&gt;\n\n&lt;p&gt;In this whole post you don&amp;#39;t once say why your wife is unhappy.  What her problem with you is.  &lt;/p&gt;\n\n&lt;p&gt;If you really don&amp;#39;t know that, you&amp;#39;re fucked.  If you know and it&amp;#39;s not something you are willing to address (or you think you&amp;#39;re right and she should change), you&amp;#39;re double fucked.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbm0ub", "score_hidden": false, "stickied": false, "created": 1492341715.0, "created_utc": 1492312915.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbi5sz", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "zeporscheguy", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Tell her that you want to go to marriage counseling to save your marriage. And if she isn't willing to do so, then you need to proceed forward with divorce. She is absolutely emotionally cheating. It doesn't matter if she doesn't think so, you know so. Maybe leave reddit open on your computer for her to find and hope she reads your post, or make her read your post and all the responses. ", "edited": 1492307484.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell her that you want to go to marriage counseling to save your marriage. And if she isn&amp;#39;t willing to do so, then you need to proceed forward with divorce. She is absolutely emotionally cheating. It doesn&amp;#39;t matter if she doesn&amp;#39;t think so, you know so. Maybe leave reddit open on your computer for her to find and hope she reads your post, or make her read your post and all the responses. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbi5sz", "score_hidden": false, "stickied": false, "created": 1492335996.0, "created_utc": 1492307196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbha5e", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Dreamsonly", "parent_id": "t1_dgbg6eg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Better 10 years wasted than 11.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Better 10 years wasted than 11.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbha5e", "score_hidden": false, "stickied": false, "created": 1492334722.0, "created_utc": 1492305922.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbpuu2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "meatbeforepudding", "parent_id": "t1_dgbg6eg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Same. I didn't find out my bf was on vacation until he messaged me from the destination that he was with his friends, one who was an ex, and one who he'd had an intimate relationship with in the past. I told him that I thought it was weird that he didn't tell me about the trip beforehand, especially because of his history with those girls. And I got the \"they're just very good friends\" line followed by, \"I have no romantic feelings for them.\" Turns out, what I was meant to get from that wasn't so much that they were just friends, but that they were friends who said I love you, called each other baby, checked up on each other daily via message and had sex...but when I confronted him about it he said never lied to me because he didn't say that didn't have sexual feelings for them--only that he didn't have romantic feelings. So yeah, it was my fault for not clarifying I guess. Reading this post sucked because it reminded me of the awful things people can rationalize in relationships, all in the name of getting what they want. And on the other end of that is some one who loves them and is being emotionally manipulated into feeling guilty or controlling for wanting to know what's going on in their own relationship. I'm so sorry for you, op. You deserve someone who loves you and respects you in the same way that you love and respect your wife. Wish you the best.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same. I didn&amp;#39;t find out my bf was on vacation until he messaged me from the destination that he was with his friends, one who was an ex, and one who he&amp;#39;d had an intimate relationship with in the past. I told him that I thought it was weird that he didn&amp;#39;t tell me about the trip beforehand, especially because of his history with those girls. And I got the &amp;quot;they&amp;#39;re just very good friends&amp;quot; line followed by, &amp;quot;I have no romantic feelings for them.&amp;quot; Turns out, what I was meant to get from that wasn&amp;#39;t so much that they were just friends, but that they were friends who said I love you, called each other baby, checked up on each other daily via message and had sex...but when I confronted him about it he said never lied to me because he didn&amp;#39;t say that didn&amp;#39;t have sexual feelings for them--only that he didn&amp;#39;t have romantic feelings. So yeah, it was my fault for not clarifying I guess. Reading this post sucked because it reminded me of the awful things people can rationalize in relationships, all in the name of getting what they want. And on the other end of that is some one who loves them and is being emotionally manipulated into feeling guilty or controlling for wanting to know what&amp;#39;s going on in their own relationship. I&amp;#39;m so sorry for you, op. You deserve someone who loves you and respects you in the same way that you love and respect your wife. Wish you the best.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbpuu2", "score_hidden": false, "stickied": false, "created": 1492348179.0, "created_utc": 1492319379.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbg6eg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MLGsandwichmaker", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP I am so sorry that your 10 year relationship is going through this right now. I can painfully relate and empathize with what you're going through right now. It hurts so much, almost worse than physically cheating IMO, to know that they have mentally and emotionally created an intimate relationship while you are supposed to be in one with her. \n\nI actually found out about an extremely similar situation with my boyfriend of almost 4 years with a very good female friend of his. I found out, from our neighbor not him, that he had been making plans to borrow money to travel across the country for a week to see her. This is the second time I have not been included in cross country plans to see her. \n\nI hope you two can work things out in couples counseling, 10 years is too long to just throw away and it is very clear that you love her dearly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP I am so sorry that your 10 year relationship is going through this right now. I can painfully relate and empathize with what you&amp;#39;re going through right now. It hurts so much, almost worse than physically cheating IMO, to know that they have mentally and emotionally created an intimate relationship while you are supposed to be in one with her. &lt;/p&gt;\n\n&lt;p&gt;I actually found out about an extremely similar situation with my boyfriend of almost 4 years with a very good female friend of his. I found out, from our neighbor not him, that he had been making plans to borrow money to travel across the country for a week to see her. This is the second time I have not been included in cross country plans to see her. &lt;/p&gt;\n\n&lt;p&gt;I hope you two can work things out in couples counseling, 10 years is too long to just throw away and it is very clear that you love her dearly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbg6eg", "score_hidden": false, "stickied": false, "created": 1492333146.0, "created_utc": 1492304346.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbmmty", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "flybrand", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your partner is lying to your face - this is an unhealthy place to be. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your partner is lying to your face - this is an unhealthy place to be. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbmmty", "score_hidden": false, "stickied": false, "created": 1492342658.0, "created_utc": 1492313858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbk78b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "overten", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Sorry for your troubles.\nYour partner may already have checked out, or may be so addicted to 'gaming', that being present in an adult relationship is not possible. She already seems to be setting up the future by introducing Steve to her mom, using whatever pretext. \n\nMy advice, protect yourself in a clinch. Make sure you have access to your assets, wherever possible. Make sure to let folks closest to you know that you are struggling and why.\n\nGo to the marital therapist without expectations about how things will turn out exactly.\nPrefacing your sentences in difficult dialogue with \"I love you and ...\" as whatever follows \nis more likely to be heard. \nExample: I love you Mary, and am concerned that gaming has... I love you Mary, and am concerned that your constant communication with Steve has...\n\nBest of luck during this stressful time.", "edited": 1492311975.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for your troubles.\nYour partner may already have checked out, or may be so addicted to &amp;#39;gaming&amp;#39;, that being present in an adult relationship is not possible. She already seems to be setting up the future by introducing Steve to her mom, using whatever pretext. &lt;/p&gt;\n\n&lt;p&gt;My advice, protect yourself in a clinch. Make sure you have access to your assets, wherever possible. Make sure to let folks closest to you know that you are struggling and why.&lt;/p&gt;\n\n&lt;p&gt;Go to the marital therapist without expectations about how things will turn out exactly.\nPrefacing your sentences in difficult dialogue with &amp;quot;I love you and ...&amp;quot; as whatever follows \nis more likely to be heard. \nExample: I love you Mary, and am concerned that gaming has... I love you Mary, and am concerned that your constant communication with Steve has...&lt;/p&gt;\n\n&lt;p&gt;Best of luck during this stressful time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbk78b", "score_hidden": false, "stickied": false, "created": 1492339013.0, "created_utc": 1492310213.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbpps0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TomahawkCruise", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Sooner or later it's going to be time for an ultimatum. You've spoken til you're blue in the face that you don't approve of this relationship and that it hurts you. Any woman that chooses to continue to be sneaky with another guy, fully aware it's inflicting pain on their husband, is sending a clear message that they just don't give a shit.\n\nThere is nothing worse than scumbag guys (or girls) in this world who pursue people they know damn well are spoken for. They are loathsome to the extreme. But your wife is problem No. 1 here.\n\nI know you love her, but don't lose yourself for her. Trust is paramount. If you don't have it, serve her divorce papers.\n\nMight sound harsh, but it's the right move. Good luck!", "edited": 1492322239.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sooner or later it&amp;#39;s going to be time for an ultimatum. You&amp;#39;ve spoken til you&amp;#39;re blue in the face that you don&amp;#39;t approve of this relationship and that it hurts you. Any woman that chooses to continue to be sneaky with another guy, fully aware it&amp;#39;s inflicting pain on their husband, is sending a clear message that they just don&amp;#39;t give a shit.&lt;/p&gt;\n\n&lt;p&gt;There is nothing worse than scumbag guys (or girls) in this world who pursue people they know damn well are spoken for. They are loathsome to the extreme. But your wife is problem No. 1 here.&lt;/p&gt;\n\n&lt;p&gt;I know you love her, but don&amp;#39;t lose yourself for her. Trust is paramount. If you don&amp;#39;t have it, serve her divorce papers.&lt;/p&gt;\n\n&lt;p&gt;Might sound harsh, but it&amp;#39;s the right move. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbpps0", "score_hidden": false, "stickied": false, "created": 1492347918.0, "created_utc": 1492319118.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgc0t1u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "breitlex", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Friend, you have your answer already. You've had sex once in the last year, she openly tells you she resents some of your qualities, she told another man, \"I love you,\" and lied to you about having lunch with this guy and her *mom* (she's \"bringing him home to meet mom\"). \n\nThis is where you preserve your own dignity and *you* tell *her* that it's over.\n\nIt would have been better to nip this in the bud when it started; there may have been room to salvage your marriage with conversation and/or counseling. But you're both a year into this sordid affair and she already has everything set up to jump ship. She has already made the jump emotionally, and probably physically too.\n\nProtect yourself, find a good lawyer, get ahead of the situation. The alternative is to wait for her to give you papers or wait for her to reveal the full extent of hers and Steve's relationship.\n\nI'm sorry, brother.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Friend, you have your answer already. You&amp;#39;ve had sex once in the last year, she openly tells you she resents some of your qualities, she told another man, &amp;quot;I love you,&amp;quot; and lied to you about having lunch with this guy and her &lt;em&gt;mom&lt;/em&gt; (she&amp;#39;s &amp;quot;bringing him home to meet mom&amp;quot;). &lt;/p&gt;\n\n&lt;p&gt;This is where you preserve your own dignity and &lt;em&gt;you&lt;/em&gt; tell &lt;em&gt;her&lt;/em&gt; that it&amp;#39;s over.&lt;/p&gt;\n\n&lt;p&gt;It would have been better to nip this in the bud when it started; there may have been room to salvage your marriage with conversation and/or counseling. But you&amp;#39;re both a year into this sordid affair and she already has everything set up to jump ship. She has already made the jump emotionally, and probably physically too.&lt;/p&gt;\n\n&lt;p&gt;Protect yourself, find a good lawyer, get ahead of the situation. The alternative is to wait for her to give you papers or wait for her to reveal the full extent of hers and Steve&amp;#39;s relationship.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry, brother.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc0t1u", "score_hidden": false, "stickied": false, "created": 1492377974.0, "created_utc": 1492349174.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgc9wki", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NotRickDeckard1982", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Next time she's out, pack up the PC and her clothes. Leave it by the front door with a piece of paper that says \"Steve\" on it.\n\nWhen she comes home, tell her she gets to pick. Point at the pile, and then point at your wedding ring.\n\nDon't argue. Don't defend. Don't justify or try to get her on your side. Just pick.\n\nIf she won't, tell her to enjoy her videogames and boyfriend, because you're out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Next time she&amp;#39;s out, pack up the PC and her clothes. Leave it by the front door with a piece of paper that says &amp;quot;Steve&amp;quot; on it.&lt;/p&gt;\n\n&lt;p&gt;When she comes home, tell her she gets to pick. Point at the pile, and then point at your wedding ring.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t argue. Don&amp;#39;t defend. Don&amp;#39;t justify or try to get her on your side. Just pick.&lt;/p&gt;\n\n&lt;p&gt;If she won&amp;#39;t, tell her to enjoy her videogames and boyfriend, because you&amp;#39;re out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc9wki", "score_hidden": false, "stickied": false, "created": 1492391313.0, "created_utc": 1492362513.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgd0jzn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NorthKoreaUnicorn", "parent_id": "t1_dgcwr4p", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yes, I just posted my story and I can so relate. Except, when I fell for my 'Steve', I wasn't socially inept, but we were working different shifts for our fulltime job, plus I had a parttime internship and school. Still a crappy reason to emotionally cheat (even if I didn't know about emotionally cheating when it first happened), but I can't change the past.\n\nAnyway, I think the major thing that helped us was the fact that it was exposed after I realized what happened. Idk how yours was exposed, and I hope you were the catalyst for exposing it, but I know that I never will and haven't done anything similar with anyone else. As soon as someone even hinta at getting close to me online, I ghost immediately. I suggest that you do the same.", "edited": 1492400132.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I just posted my story and I can so relate. Except, when I fell for my &amp;#39;Steve&amp;#39;, I wasn&amp;#39;t socially inept, but we were working different shifts for our fulltime job, plus I had a parttime internship and school. Still a crappy reason to emotionally cheat (even if I didn&amp;#39;t know about emotionally cheating when it first happened), but I can&amp;#39;t change the past.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I think the major thing that helped us was the fact that it was exposed after I realized what happened. Idk how yours was exposed, and I hope you were the catalyst for exposing it, but I know that I never will and haven&amp;#39;t done anything similar with anyone else. As soon as someone even hinta at getting close to me online, I ghost immediately. I suggest that you do the same.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd0jzn", "score_hidden": true, "stickied": false, "created": 1492426935.0, "created_utc": 1492398135.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwr4p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcwr4p", "score_hidden": true, "stickied": false, "created": 1492421642.0, "created_utc": 1492392842.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgd00u0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NorthKoreaUnicorn", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She is undoubtedly emotionally cheating on you.\n\nSee, I was this girl. I played an online game and I met him, lets call him Fred. To shorten up the story, I didn't know what emotionally cheating was and just assumed we were beat friends for a long time, but then my brother and his wife had an incident where she emotionally cheated on him and I realized that I was doing the same with Fred. (Emotionally cheating wasn't really 'well known' back when I did this and most people didn't take it seriously)\n\nI was after all, completely neglecting my husband in favor of this guy and the internet game and stayed up to ungodly hours of the night. Regardless of if I stayed up because of my internet addiction or because of Fred, &gt;both of these are problems and you both deserve a life without a)addiction and b) another guy. Both are devastating to a relationship and the fact that either are happening is a reason to seek help.\n\nAnd although it can get better, even without therapy, there needs to be huge steps made on her part to progress. For instance, I told my husband about my feelings and disconnected with Fred for a year (breifly connecting on the gaming forum). Although, I should have never spoke to him again (I foolishly thought things could change and I told my husband about it), at least me exposing the relationship and talking about it made me face both my addiction and emotionally cheating in a major way that I believe saved our marriage. Fred and I no longer talk.\n\nI guess my summarized advice would be to seek help for the easier out of the two problems for her to discuss. She clearly has an internet addiction as well as an issue with emotionally cheating. Perhaps suggest that she should get help with her addiction, because moving forward on one problem will, imo, also help her move forward on her other issue.\n\nEdit: just reread about the sex. I will say that even while this was going on I had sex with my husband about 3 times a week. And during the times we did talk, I genuinely brought up my issues with the marriage with my husband but nothing ever changed. I learned later that he had a 'work wife' that he emotionally cheated on me with. He has since switched jobs. None of this is an excuse for what happened with Fred, but it might be a reason why mine was recoverable, and yours may not be. (Not saying you can't recover, but in my case, there was effort on both sides to make the marriage work) I also told Fred over and over that it would never work.", "edited": 1492398904.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She is undoubtedly emotionally cheating on you.&lt;/p&gt;\n\n&lt;p&gt;See, I was this girl. I played an online game and I met him, lets call him Fred. To shorten up the story, I didn&amp;#39;t know what emotionally cheating was and just assumed we were beat friends for a long time, but then my brother and his wife had an incident where she emotionally cheated on him and I realized that I was doing the same with Fred. (Emotionally cheating wasn&amp;#39;t really &amp;#39;well known&amp;#39; back when I did this and most people didn&amp;#39;t take it seriously)&lt;/p&gt;\n\n&lt;p&gt;I was after all, completely neglecting my husband in favor of this guy and the internet game and stayed up to ungodly hours of the night. Regardless of if I stayed up because of my internet addiction or because of Fred, &amp;gt;both of these are problems and you both deserve a life without a)addiction and b) another guy. Both are devastating to a relationship and the fact that either are happening is a reason to seek help.&lt;/p&gt;\n\n&lt;p&gt;And although it can get better, even without therapy, there needs to be huge steps made on her part to progress. For instance, I told my husband about my feelings and disconnected with Fred for a year (breifly connecting on the gaming forum). Although, I should have never spoke to him again (I foolishly thought things could change and I told my husband about it), at least me exposing the relationship and talking about it made me face both my addiction and emotionally cheating in a major way that I believe saved our marriage. Fred and I no longer talk.&lt;/p&gt;\n\n&lt;p&gt;I guess my summarized advice would be to seek help for the easier out of the two problems for her to discuss. She clearly has an internet addiction as well as an issue with emotionally cheating. Perhaps suggest that she should get help with her addiction, because moving forward on one problem will, imo, also help her move forward on her other issue.&lt;/p&gt;\n\n&lt;p&gt;Edit: just reread about the sex. I will say that even while this was going on I had sex with my husband about 3 times a week. And during the times we did talk, I genuinely brought up my issues with the marriage with my husband but nothing ever changed. I learned later that he had a &amp;#39;work wife&amp;#39; that he emotionally cheated on me with. He has since switched jobs. None of this is an excuse for what happened with Fred, but it might be a reason why mine was recoverable, and yours may not be. (Not saying you can&amp;#39;t recover, but in my case, there was effort on both sides to make the marriage work) I also told Fred over and over that it would never work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd00u0", "score_hidden": true, "stickied": false, "created": 1492426185.0, "created_utc": 1492397385.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbje00", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "wiggy222", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; If I wake up at 1 am to use the bathroom and she's still gaming, I walk out and tell her to come to bed, and that being up so late is bad for her. She gets irritated with me and says she's not tired, even though I know she is, based off of her complaints the next day. She says I'm being controlling. \n\nYou need to realize online gaming is an addiction for many people. Much like drugs, cigarettes, gambling, or alcohol. It induces a dopamine feedback loop.\n\nFrom your post, your wife seems to have all the classic symptoms of addiction. I would start with trying to get help for her before it's too late.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If I wake up at 1 am to use the bathroom and she&amp;#39;s still gaming, I walk out and tell her to come to bed, and that being up so late is bad for her. She gets irritated with me and says she&amp;#39;s not tired, even though I know she is, based off of her complaints the next day. She says I&amp;#39;m being controlling. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You need to realize online gaming is an addiction for many people. Much like drugs, cigarettes, gambling, or alcohol. It induces a dopamine feedback loop.&lt;/p&gt;\n\n&lt;p&gt;From your post, your wife seems to have all the classic symptoms of addiction. I would start with trying to get help for her before it&amp;#39;s too late.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbje00", "score_hidden": false, "stickied": false, "created": 1492337803.0, "created_utc": 1492309003.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbp8gp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TripNipp_", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Give or take a few specific details my ex did the same thing. (I also don't think she ever physically cheated on me)\n\nAfter she (supposedly) ended it we tried to make things work but I couldn't find it in me to trust her. The way I was lied to was what broke the relationship for me, she kept slowly releasing more and more detail, and changing old ones, about what was going on with them every time we discussed it and eventually I was tired of having to drag the details out her only to find out there was something else she wasn't telling me. (gaslighting) \n\nI couldn't sleep, I couldn't eat, but I also couldn't imagine being without her but, here I am 3-4 years later and I feel like I've got life by the balls rather than her having me by mine. \n\nObviously, you and I aren't the same but the point I want to make is that you are the only one that has to deal with your choice. Are you someone one who can forgive and learn to trust people who have habitually lied to you? I don't mean casually forgive where you forget about it for 15 minutes, I mean to the point where it doesn't cross your mind; 3 years from now you are in an argument and you think of something nasty to say and it isn't about her and Steve or video games.\n\nIf so, try and work it out. Maybe counseling will help, maybe Steve is just a lonely dude that caught feelings for a caring voice, maybe a million other things but most importantly take care of yourself and think about how you are feeling. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Give or take a few specific details my ex did the same thing. (I also don&amp;#39;t think she ever physically cheated on me)&lt;/p&gt;\n\n&lt;p&gt;After she (supposedly) ended it we tried to make things work but I couldn&amp;#39;t find it in me to trust her. The way I was lied to was what broke the relationship for me, she kept slowly releasing more and more detail, and changing old ones, about what was going on with them every time we discussed it and eventually I was tired of having to drag the details out her only to find out there was something else she wasn&amp;#39;t telling me. (gaslighting) &lt;/p&gt;\n\n&lt;p&gt;I couldn&amp;#39;t sleep, I couldn&amp;#39;t eat, but I also couldn&amp;#39;t imagine being without her but, here I am 3-4 years later and I feel like I&amp;#39;ve got life by the balls rather than her having me by mine. &lt;/p&gt;\n\n&lt;p&gt;Obviously, you and I aren&amp;#39;t the same but the point I want to make is that you are the only one that has to deal with your choice. Are you someone one who can forgive and learn to trust people who have habitually lied to you? I don&amp;#39;t mean casually forgive where you forget about it for 15 minutes, I mean to the point where it doesn&amp;#39;t cross your mind; 3 years from now you are in an argument and you think of something nasty to say and it isn&amp;#39;t about her and Steve or video games.&lt;/p&gt;\n\n&lt;p&gt;If so, try and work it out. Maybe counseling will help, maybe Steve is just a lonely dude that caught feelings for a caring voice, maybe a million other things but most importantly take care of yourself and think about how you are feeling. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbp8gp", "score_hidden": false, "stickied": false, "created": 1492347031.0, "created_utc": 1492318231.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgblpqg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lcfparty15", "parent_id": "t1_dgbl482", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Homie I think you replied to OP instead of the world's most pretentious 17 year old. Just a heads up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Homie I think you replied to OP instead of the world&amp;#39;s most pretentious 17 year old. Just a heads up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgblpqg", "score_hidden": false, "stickied": false, "created": 1492341241.0, "created_utc": 1492312441.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbl482", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbl482", "score_hidden": false, "stickied": false, "created": 1492340346.0, "created_utc": 1492311546.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbsp7h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MadeUReadMyUsername", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Damn op hang in there , tough situation to be in, hope  you ll pull through and everything will be okay Good luck ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn op hang in there , tough situation to be in, hope  you ll pull through and everything will be okay Good luck &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbsp7h", "score_hidden": false, "stickied": false, "created": 1492354457.0, "created_utc": 1492325657.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbuin5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "misshufflepuff", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Why is Steve coming to your HOME while you are at work?! Sounds like it's time for a Cheaters-style nanny cam!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why is Steve coming to your HOME while you are at work?! Sounds like it&amp;#39;s time for a Cheaters-style nanny cam!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbuin5", "score_hidden": false, "stickied": false, "created": 1492359669.0, "created_utc": 1492330869.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbv5wj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Strangeandweird", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Honestly, at this point I think you won't even be making the decision to leave her. She will be the one leaving you. She's checked out and is seeing someone else. Physical or not Steve ranks pretty high in the people she cares about. If she pits both of you she would not be able to choose you anymore.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, at this point I think you won&amp;#39;t even be making the decision to leave her. She will be the one leaving you. She&amp;#39;s checked out and is seeing someone else. Physical or not Steve ranks pretty high in the people she cares about. If she pits both of you she would not be able to choose you anymore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbv5wj", "score_hidden": false, "stickied": false, "created": 1492361785.0, "created_utc": 1492332985.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbwm4l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Whenthemoonisbroken", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's pretty clear she doesn't love you anymore, I'm sorry.  She knows you don't feel comfortable with her relationship with Steve, but she's continuing it anyway. She's putting her relationship with him before your feelings. \n\nShe's probably bored and looking for excitement.  You can try asking her to go to counselling but I wouldn't put much hope in it.  She's obviously infatuated and that's a hard thing to come back from.  \n\nWhether or not anything physical has happened she's pouring all her energy into Steve and the game.  You haven't had sex for a year. This is totally detachment on her part.  Not many people would put up with that, certainly joy from someone they have no children with.  \n\nYou could try detaching from her yourself if she won't put any effort in.  Find new friends and new hobbies yourself. It might wake her up or it might just drive the last nail into the coffin, but either way you'll be better off", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s pretty clear she doesn&amp;#39;t love you anymore, I&amp;#39;m sorry.  She knows you don&amp;#39;t feel comfortable with her relationship with Steve, but she&amp;#39;s continuing it anyway. She&amp;#39;s putting her relationship with him before your feelings. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s probably bored and looking for excitement.  You can try asking her to go to counselling but I wouldn&amp;#39;t put much hope in it.  She&amp;#39;s obviously infatuated and that&amp;#39;s a hard thing to come back from.  &lt;/p&gt;\n\n&lt;p&gt;Whether or not anything physical has happened she&amp;#39;s pouring all her energy into Steve and the game.  You haven&amp;#39;t had sex for a year. This is totally detachment on her part.  Not many people would put up with that, certainly joy from someone they have no children with.  &lt;/p&gt;\n\n&lt;p&gt;You could try detaching from her yourself if she won&amp;#39;t put any effort in.  Find new friends and new hobbies yourself. It might wake her up or it might just drive the last nail into the coffin, but either way you&amp;#39;ll be better off&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbwm4l", "score_hidden": false, "stickied": false, "created": 1492366811.0, "created_utc": 1492338011.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbxgqh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "legothor", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Dude, your relationship is over. A similar scenario took place in my life with my wife ( ex wife now ) emotionally cheating on me until it became physical. I mean your story and mine are so closely related it's giving me chills. Looking back, the only thing I regret is not ending it sooner. From what you wrote, it seems painfully obvious that she is not committed to you. This will not change even if Steve goes away forever. She is not going to simply become interested in your relationship again just like she was before. What you had is probably gone forever and the sooner you except that and move on with your life the sooner you can get back to being happy again.\n\nJust for the record, I'm remarried to a wonderful person and now I have two kids and the best family I could ever ask for. \n\nI wish the minimum amount of suffering possible for you.\n\nGood luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude, your relationship is over. A similar scenario took place in my life with my wife ( ex wife now ) emotionally cheating on me until it became physical. I mean your story and mine are so closely related it&amp;#39;s giving me chills. Looking back, the only thing I regret is not ending it sooner. From what you wrote, it seems painfully obvious that she is not committed to you. This will not change even if Steve goes away forever. She is not going to simply become interested in your relationship again just like she was before. What you had is probably gone forever and the sooner you except that and move on with your life the sooner you can get back to being happy again.&lt;/p&gt;\n\n&lt;p&gt;Just for the record, I&amp;#39;m remarried to a wonderful person and now I have two kids and the best family I could ever ask for. &lt;/p&gt;\n\n&lt;p&gt;I wish the minimum amount of suffering possible for you.&lt;/p&gt;\n\n&lt;p&gt;Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbxgqh", "score_hidden": false, "stickied": false, "created": 1492369657.0, "created_utc": 1492340857.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbxie6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bosnacium", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Man, Steve sucks. Kick his ass and divorce your wife! Save yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, Steve sucks. Kick his ass and divorce your wife! Save yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbxie6", "score_hidden": false, "stickied": false, "created": 1492369795.0, "created_utc": 1492340995.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgby9ek", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Berrybeak", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm not even sure the usual \"get counselling\" advice applies here - that ship seems to have sailed. A heartbreaking read and I'm so sorry you're going through it. This is cheating 100% and it's happened with her justification, conniving and somehow with your blessing for the early stages. I don't blame you for being reasonable at all in this - you've given her an inch and she's taken a mile - but there has come a point where she's clearly not coming back to your relationship. Get legal advice not marriage advice and get out of there. My money would be on her crawling back to you after 6 months. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not even sure the usual &amp;quot;get counselling&amp;quot; advice applies here - that ship seems to have sailed. A heartbreaking read and I&amp;#39;m so sorry you&amp;#39;re going through it. This is cheating 100% and it&amp;#39;s happened with her justification, conniving and somehow with your blessing for the early stages. I don&amp;#39;t blame you for being reasonable at all in this - you&amp;#39;ve given her an inch and she&amp;#39;s taken a mile - but there has come a point where she&amp;#39;s clearly not coming back to your relationship. Get legal advice not marriage advice and get out of there. My money would be on her crawling back to you after 6 months. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgby9ek", "score_hidden": false, "stickied": false, "created": 1492372063.0, "created_utc": 1492343263.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbzono", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "toothybaggy", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "One thing I'm interested in is how are the people in your life aside from her mother reacting to this? Have you confided any of this in close friends or trusted family members who know both of you? I'm sure mutual friends who are aware couldn't possibly think she's behaving fairly. Because if for example (my brother's a gamer y'all's age) my sister in law confided in me that my brother was behaving like your wife I would be livid and I would tell her that is unacceptable behavior from him. Hell if she would e cool with me talking to him I'd have a nice pow wow and ask him why the fuck he thinks having a friendship of that nature with another woman is okay. I don't necessarily think you should have friends and family mediating the situation (that's for a professional) but so you have anyone in your life you can share this with and garner support from? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing I&amp;#39;m interested in is how are the people in your life aside from her mother reacting to this? Have you confided any of this in close friends or trusted family members who know both of you? I&amp;#39;m sure mutual friends who are aware couldn&amp;#39;t possibly think she&amp;#39;s behaving fairly. Because if for example (my brother&amp;#39;s a gamer y&amp;#39;all&amp;#39;s age) my sister in law confided in me that my brother was behaving like your wife I would be livid and I would tell her that is unacceptable behavior from him. Hell if she would e cool with me talking to him I&amp;#39;d have a nice pow wow and ask him why the fuck he thinks having a friendship of that nature with another woman is okay. I don&amp;#39;t necessarily think you should have friends and family mediating the situation (that&amp;#39;s for a professional) but so you have anyone in your life you can share this with and garner support from? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbzono", "score_hidden": false, "stickied": false, "created": 1492375665.0, "created_utc": 1492346865.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgc42uh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tastyredballoons", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "While Steve might make you feel uncomfortable, he is not the real problem here. Steve owes you nothing. It is your wife who isn't treating you with respect, being sensitive to your feelings, and hiding things from you.\n\nThat being said, I honestly think this relationship is salvageable if you get to the root cause of the issues, and forget about Steve. Steve seems like a result of your marital issues, not really the cause of them. It's not a great sign for a couple as young as you are to have had sex once in the past year. \n\nI suggest counseling for the two of you so you can get to the root cause--maybe understand your wife's perspective a bit more. Maybe she is feeling neglected in some way that would be completely unprecedented to you. Anyway, the best advice I can give you in order to make her not clam up when talking about issues is to not be accusatory or make her feel like a villain who is causing you so much suffering. Try to have an honest conversation about what's up with her and you because things aren't the way you wish they were and I'm sure that they aren't the way she wishes they were either. I wish you the best of luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While Steve might make you feel uncomfortable, he is not the real problem here. Steve owes you nothing. It is your wife who isn&amp;#39;t treating you with respect, being sensitive to your feelings, and hiding things from you.&lt;/p&gt;\n\n&lt;p&gt;That being said, I honestly think this relationship is salvageable if you get to the root cause of the issues, and forget about Steve. Steve seems like a result of your marital issues, not really the cause of them. It&amp;#39;s not a great sign for a couple as young as you are to have had sex once in the past year. &lt;/p&gt;\n\n&lt;p&gt;I suggest counseling for the two of you so you can get to the root cause--maybe understand your wife&amp;#39;s perspective a bit more. Maybe she is feeling neglected in some way that would be completely unprecedented to you. Anyway, the best advice I can give you in order to make her not clam up when talking about issues is to not be accusatory or make her feel like a villain who is causing you so much suffering. Try to have an honest conversation about what&amp;#39;s up with her and you because things aren&amp;#39;t the way you wish they were and I&amp;#39;m sure that they aren&amp;#39;t the way she wishes they were either. I wish you the best of luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc42uh", "score_hidden": false, "stickied": false, "created": 1492383419.0, "created_utc": 1492354619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgcfdi7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jarroz61", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your wife likes Steve more than she likes you. Can't really counsel your way out of that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your wife likes Steve more than she likes you. Can&amp;#39;t really counsel your way out of that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcfdi7", "score_hidden": false, "stickied": false, "created": 1492398592.0, "created_utc": 1492369792.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgcoy7j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "twentyninethrowaways", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If she didn't think she were doing anything wrong she wouldn't be trying to hide it from you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she didn&amp;#39;t think she were doing anything wrong she wouldn&amp;#39;t be trying to hide it from you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcoy7j", "score_hidden": true, "stickied": false, "created": 1492411155.0, "created_utc": 1492382355.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgd16z4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "alienlady", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If you're married and it comes to a \"him or me\" situation you shouldn't even have to question that she would pick you. That's the entire point of marriage, you're picking each other, forever. She should trust you wouldn't ask that without it meaning a great deal to you.\n\nThis was horrible to read. I hope it all works out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re married and it comes to a &amp;quot;him or me&amp;quot; situation you shouldn&amp;#39;t even have to question that she would pick you. That&amp;#39;s the entire point of marriage, you&amp;#39;re picking each other, forever. She should trust you wouldn&amp;#39;t ask that without it meaning a great deal to you.&lt;/p&gt;\n\n&lt;p&gt;This was horrible to read. I hope it all works out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd16z4", "score_hidden": true, "stickied": false, "created": 1492427858.0, "created_utc": 1492399058.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgdsca9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pixadot", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The more you try to push her to see the light and be a 'nice guy', the further away you push her. She sees you as a doormat. People don't respect doormats.\n\nGo to surviving infidelity forums to get more expert advice. Your wife has checked out of the marriage long ago.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The more you try to push her to see the light and be a &amp;#39;nice guy&amp;#39;, the further away you push her. She sees you as a doormat. People don&amp;#39;t respect doormats.&lt;/p&gt;\n\n&lt;p&gt;Go to surviving infidelity forums to get more expert advice. Your wife has checked out of the marriage long ago.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdsca9", "score_hidden": true, "stickied": false, "created": 1492478394.0, "created_utc": 1492449594.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbssxk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgbci44", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He's not blaming him exclusively, just recognizing the fact that he is an annoyance and still an asshole. You make it sound like every guy would follow the same behavior as Steve if they were in these circumstances.  There are men with class that would not pursue married women no matter what. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s not blaming him exclusively, just recognizing the fact that he is an annoyance and still an asshole. You make it sound like every guy would follow the same behavior as Steve if they were in these circumstances.  There are men with class that would not pursue married women no matter what. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbssxk", "score_hidden": false, "stickied": false, "created": 1492354733.0, "created_utc": 1492325933.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbci44", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ShelfLifeInc", "parent_id": "t1_dgb9wcz", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I feel really disrespected by him, as a guy, that he even let himself become remotely interested. Some people might call this guy code... I call it being a respectable human being,\n\nSteve made no vow to you. Your wife did.  What Steve is doing isn't good, but it's unreasonable to blame him for the issues in your marriage when your wife is the one who is causing the issues. She is certainly not being a respectable human being to you, the man she chose to marry. \n\nSteve isn't the problem. He's just a symptom. The real problem is that your wife doesn't want to be married to you any more. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I feel really disrespected by him, as a guy, that he even let himself become remotely interested. Some people might call this guy code... I call it being a respectable human being,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Steve made no vow to you. Your wife did.  What Steve is doing isn&amp;#39;t good, but it&amp;#39;s unreasonable to blame him for the issues in your marriage when your wife is the one who is causing the issues. She is certainly not being a respectable human being to you, the man she chose to marry. &lt;/p&gt;\n\n&lt;p&gt;Steve isn&amp;#39;t the problem. He&amp;#39;s just a symptom. The real problem is that your wife doesn&amp;#39;t want to be married to you any more. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbci44", "score_hidden": false, "stickied": false, "created": 1492327955.0, "created_utc": 1492299155.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb9wcz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "throwaway763425", "parent_id": "t1_dgb7sty", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you very much for your insight.\n\nSee, and she's had male friends before, and I take no issue with it because she's never been *this* involved.  I have purposely stayed back so as not to seem insecure to her in the past.  I know it's a turnoff and I tried to stay hands-off with this one for as long as possible too... maybe too long.\n\nThis male friend happens to have a ton of the same interests as her, works in a similar field, is single, and is a pretty handsome guy.  I think it's only normal to feel a little apprehensive given these facts.  When you consider his admission of feelings for her, that sets off alarm bells in my mind.\n\nI feel really disrespected by him, as a guy, that he even let himself become remotely interested.  Some people might call this guy code... I call it being a respectable human being, but you never even let yourself develop those types of feelings for a married person or someone in a serious relationship.  Never.  You just don't do it.  And you sure as hell don't continue showing up to her house when she's alone after a fact like this comes out.  \n\nI have hung out with her friends, including him as a group, but their interests are about as polar opposite as could be from mine.  They love anime and obscure video games.  I like cars and trucks and things that go vroom, and movies and books.  We find common ground in casual conversation at restaurants, but when they get together to engage in one of the aforementioned activities, my eyes glaze over.  I've tried to learn about things and show some interest, but it's just not my thing, and that's okay.  Husbands and wives don't always have to share the same hobbies.  That said, we used to do a lot of things together and enjoyed them.  We watched series on Netflix together, went on road-trips/mini-vacations, and just did normal husband/wife stuff together.  Now, it seems that she has no room in her life for those things anymore because they've been taken over by other interests.  She has even turned down going out to dinner so that she can stay home and do gaming stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you very much for your insight.&lt;/p&gt;\n\n&lt;p&gt;See, and she&amp;#39;s had male friends before, and I take no issue with it because she&amp;#39;s never been &lt;em&gt;this&lt;/em&gt; involved.  I have purposely stayed back so as not to seem insecure to her in the past.  I know it&amp;#39;s a turnoff and I tried to stay hands-off with this one for as long as possible too... maybe too long.&lt;/p&gt;\n\n&lt;p&gt;This male friend happens to have a ton of the same interests as her, works in a similar field, is single, and is a pretty handsome guy.  I think it&amp;#39;s only normal to feel a little apprehensive given these facts.  When you consider his admission of feelings for her, that sets off alarm bells in my mind.&lt;/p&gt;\n\n&lt;p&gt;I feel really disrespected by him, as a guy, that he even let himself become remotely interested.  Some people might call this guy code... I call it being a respectable human being, but you never even let yourself develop those types of feelings for a married person or someone in a serious relationship.  Never.  You just don&amp;#39;t do it.  And you sure as hell don&amp;#39;t continue showing up to her house when she&amp;#39;s alone after a fact like this comes out.  &lt;/p&gt;\n\n&lt;p&gt;I have hung out with her friends, including him as a group, but their interests are about as polar opposite as could be from mine.  They love anime and obscure video games.  I like cars and trucks and things that go vroom, and movies and books.  We find common ground in casual conversation at restaurants, but when they get together to engage in one of the aforementioned activities, my eyes glaze over.  I&amp;#39;ve tried to learn about things and show some interest, but it&amp;#39;s just not my thing, and that&amp;#39;s okay.  Husbands and wives don&amp;#39;t always have to share the same hobbies.  That said, we used to do a lot of things together and enjoyed them.  We watched series on Netflix together, went on road-trips/mini-vacations, and just did normal husband/wife stuff together.  Now, it seems that she has no room in her life for those things anymore because they&amp;#39;ve been taken over by other interests.  She has even turned down going out to dinner so that she can stay home and do gaming stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb9wcz", "score_hidden": false, "stickied": false, "created": 1492324146.0, "created_utc": 1492295346.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7sty", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shortishelli", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "I'm sorry this is happening :( I can offer some insight as a woman with a male best friend. My husband is always on my case about always texting or snap chatting or talking to this friend in any way. I tell him all the time, \"i'm not attracted to him, I would never cheat on you, etc etc\" And when I say that, I really do mean it. The relationship I have with this guy is great because he listens to me, we laugh together, it's fun, and I really enjoy his company. I probably enjoy it because my husband is not a great listener and does not like to do anything I like to do whereas my friend does like to do things and be active. It angers me when my husband is always on my case about it because I feel he is trying to control me and it comes off as insecure, which is unattractive. \n\nThe difference with me and my friend, though, is we never hang out alone. We hang out all three of us together with other friends. I also let my husband see my text messages with him and tell him when I am going to text the friend or when I receive one from him so that he doesn't freak out on me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry this is happening :( I can offer some insight as a woman with a male best friend. My husband is always on my case about always texting or snap chatting or talking to this friend in any way. I tell him all the time, &amp;quot;i&amp;#39;m not attracted to him, I would never cheat on you, etc etc&amp;quot; And when I say that, I really do mean it. The relationship I have with this guy is great because he listens to me, we laugh together, it&amp;#39;s fun, and I really enjoy his company. I probably enjoy it because my husband is not a great listener and does not like to do anything I like to do whereas my friend does like to do things and be active. It angers me when my husband is always on my case about it because I feel he is trying to control me and it comes off as insecure, which is unattractive. &lt;/p&gt;\n\n&lt;p&gt;The difference with me and my friend, though, is we never hang out alone. We hang out all three of us together with other friends. I also let my husband see my text messages with him and tell him when I am going to text the friend or when I receive one from him so that he doesn&amp;#39;t freak out on me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgb7sty", "score_hidden": false, "stickied": false, "created": 1492321194.0, "created_utc": 1492292394.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgboj9y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SirLordBaronVonVader", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your marriage is done. You're being cheated on empirically and your wife is an addict. She's no different from a junkie, alcoholic, or gaming addict. These people need to hit rock bottom before they realise what they have done to themselves.\n\nTherapy, if you can get her to agree to it is a must. But at the end of the day get prepared to walk away. Right now, your happiness, relationship, and life together are not priorities. You have a dead bed, and obviously as it stands now a dead relationship full of animosity. This is really not a healthy place to be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your marriage is done. You&amp;#39;re being cheated on empirically and your wife is an addict. She&amp;#39;s no different from a junkie, alcoholic, or gaming addict. These people need to hit rock bottom before they realise what they have done to themselves.&lt;/p&gt;\n\n&lt;p&gt;Therapy, if you can get her to agree to it is a must. But at the end of the day get prepared to walk away. Right now, your happiness, relationship, and life together are not priorities. You have a dead bed, and obviously as it stands now a dead relationship full of animosity. This is really not a healthy place to be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgboj9y", "score_hidden": false, "stickied": false, "created": 1492345791.0, "created_utc": 1492316991.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgblmte", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "greentiger", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yikes, this sounds awfully disrespectful! Hail Mary play may be to take up gaming with her on her hours; bring the fight to them, if you will. The outcome will either be the mutual realisation that you guys hit a bump in the road and can work through it together in time, or the eventual end of this relationship. If the latter, you will suffer more by trying to hang in there, but fighting for love is not purely rational!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yikes, this sounds awfully disrespectful! Hail Mary play may be to take up gaming with her on her hours; bring the fight to them, if you will. The outcome will either be the mutual realisation that you guys hit a bump in the road and can work through it together in time, or the eventual end of this relationship. If the latter, you will suffer more by trying to hang in there, but fighting for love is not purely rational!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgblmte", "score_hidden": false, "stickied": false, "created": 1492341119.0, "created_utc": 1492312319.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbvc87", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ChapJackman", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I don't know you, or your situation, but reading her conversations or logging into her facebook account is **unequivocally** symptomatic of controlling behaviour (the very thing she's accusing you of).\n\n\nI've seen it time and time again where someone (usually a guy) suspects their partner of cheating on them, so they invade their privacy and blow the situation way out of proportion. What's more, this actually pushes their partner away even further: \"If he already thinks I'm cheating, why shouldn't I actually get something out of it?\"\n\n\nI'm not trying to make you sound like the villain here. Counselling would be a great choice for you, because it does seem as though you've tried communicating (to no avail) and you're coming to your wit's end. \n\n\nIf she's still not willing to communicate with you during or after counselling, it might be time to just get out of the house for a while. It's extreme, but would allow you to see if she wants to reach out  to you or not. No answer is still an answer.\n\n\nIf you wanted to get even more extreme, you could disconnect some parts of her computer or change the wi-fi password and contrive a situation where she has to talk with you -- but you cannot use this as a bargaining chip. If she still doesn't want to talk after a stunt like that, just give up. Give her the password.  Reconnect the PC. Maybe start to pack up your things and gauge her reaction.\n\nGood luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know you, or your situation, but reading her conversations or logging into her facebook account is &lt;strong&gt;unequivocally&lt;/strong&gt; symptomatic of controlling behaviour (the very thing she&amp;#39;s accusing you of).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen it time and time again where someone (usually a guy) suspects their partner of cheating on them, so they invade their privacy and blow the situation way out of proportion. What&amp;#39;s more, this actually pushes their partner away even further: &amp;quot;If he already thinks I&amp;#39;m cheating, why shouldn&amp;#39;t I actually get something out of it?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not trying to make you sound like the villain here. Counselling would be a great choice for you, because it does seem as though you&amp;#39;ve tried communicating (to no avail) and you&amp;#39;re coming to your wit&amp;#39;s end. &lt;/p&gt;\n\n&lt;p&gt;If she&amp;#39;s still not willing to communicate with you during or after counselling, it might be time to just get out of the house for a while. It&amp;#39;s extreme, but would allow you to see if she wants to reach out  to you or not. No answer is still an answer.&lt;/p&gt;\n\n&lt;p&gt;If you wanted to get even more extreme, you could disconnect some parts of her computer or change the wi-fi password and contrive a situation where she has to talk with you -- but you cannot use this as a bargaining chip. If she still doesn&amp;#39;t want to talk after a stunt like that, just give up. Give her the password.  Reconnect the PC. Maybe start to pack up your things and gauge her reaction.&lt;/p&gt;\n\n&lt;p&gt;Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbvc87", "score_hidden": false, "stickied": false, "created": 1492362371.0, "created_utc": 1492333571.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgblm8v", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "lcfparty15", "parent_id": "t1_dgbic4x", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You shouldn't be giving married adults advice, kid, and your advice is crap, I do not care what your IQ tests say. My father is a veterinarian, but I don't tell people how to treat their sick animals. But I am married and an adult in my 30s.\n\nWhen you're married, you invest a great deal of yourself and your life into the other person. You make vows. OP's wife is forsaking those vows.\n\nIt's cute that you have these idealized visions of how a relationship should work, but they're skewed because I think you're lonely and want someone to treat like your princess, or something. So, tend to that.\n\nYour advice does not, in any way, apply to the life of a married adult. There are plenty of kids on here looking for advice and you're a smart kid. Stick to that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You shouldn&amp;#39;t be giving married adults advice, kid, and your advice is crap, I do not care what your IQ tests say. My father is a veterinarian, but I don&amp;#39;t tell people how to treat their sick animals. But I am married and an adult in my 30s.&lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re married, you invest a great deal of yourself and your life into the other person. You make vows. OP&amp;#39;s wife is forsaking those vows.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s cute that you have these idealized visions of how a relationship should work, but they&amp;#39;re skewed because I think you&amp;#39;re lonely and want someone to treat like your princess, or something. So, tend to that.&lt;/p&gt;\n\n&lt;p&gt;Your advice does not, in any way, apply to the life of a married adult. There are plenty of kids on here looking for advice and you&amp;#39;re a smart kid. Stick to that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgblm8v", "score_hidden": false, "stickied": false, "created": 1492341093.0, "created_utc": 1492312293.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbqw4a", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "TomahawkCruise", "parent_id": "t1_dgbic4x", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"Now, something quite difficult. Stop watching her convos without her knowing. What it actually does is making you more worried, more stressful, it makes you lose trust and the whole relationship to start being clunky. Plus, and that's a big plus, if she finds out, which she probably will, eventually, you're in deep shit.\"\n\nThis is laughable.\n\nYou absolutely have every right and obligation to rifle through her messaging if it's loaded with red flags, which they most certainly are.\n\nIgnoring it and pretending it doesn't exist is an absurd formula for disaster, loss of self respect and utter failure to even acknowledge the problem.\n\nAlso, the idea that you'll \"be in deep shit\" if you invade her privacy to bust her cheating ass is also so laughable it's tough to believe you're serious with it.\n\nYou lose all right to scream \"invasion of privacy!\" when you start to fuck around on someone you pledged marriage to.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Now, something quite difficult. Stop watching her convos without her knowing. What it actually does is making you more worried, more stressful, it makes you lose trust and the whole relationship to start being clunky. Plus, and that&amp;#39;s a big plus, if she finds out, which she probably will, eventually, you&amp;#39;re in deep shit.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This is laughable.&lt;/p&gt;\n\n&lt;p&gt;You absolutely have every right and obligation to rifle through her messaging if it&amp;#39;s loaded with red flags, which they most certainly are.&lt;/p&gt;\n\n&lt;p&gt;Ignoring it and pretending it doesn&amp;#39;t exist is an absurd formula for disaster, loss of self respect and utter failure to even acknowledge the problem.&lt;/p&gt;\n\n&lt;p&gt;Also, the idea that you&amp;#39;ll &amp;quot;be in deep shit&amp;quot; if you invade her privacy to bust her cheating ass is also so laughable it&amp;#39;s tough to believe you&amp;#39;re serious with it.&lt;/p&gt;\n\n&lt;p&gt;You lose all right to scream &amp;quot;invasion of privacy!&amp;quot; when you start to fuck around on someone you pledged marriage to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbqw4a", "score_hidden": false, "stickied": false, "created": 1492350184.0, "created_utc": 1492321384.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbr50n", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TomahawkCruise", "parent_id": "t1_dgbij9r", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This has got to be a joke.\n\nI would strongly advise the OP against patiently waiting on his \"precious\" cheating wife to see what she wantonly decides to do next to fuck him over, and then opting to treat her like a princess once she makes the move to torch his ass once and for all.\n\nUnbelievable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This has got to be a joke.&lt;/p&gt;\n\n&lt;p&gt;I would strongly advise the OP against patiently waiting on his &amp;quot;precious&amp;quot; cheating wife to see what she wantonly decides to do next to fuck him over, and then opting to treat her like a princess once she makes the move to torch his ass once and for all.&lt;/p&gt;\n\n&lt;p&gt;Unbelievable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbr50n", "score_hidden": false, "stickied": false, "created": 1492350727.0, "created_utc": 1492321927.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbo21h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "UltimaStone", "parent_id": "t1_dgbjheh", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think 17yo Dr Phil over here is somehow conparing him seeing an open chat and reading it as to his mum and dad invading his \"crib\". Taking that part way too personally. OP even admitted it wasn't a morally right thing to do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think 17yo Dr Phil over here is somehow conparing him seeing an open chat and reading it as to his mum and dad invading his &amp;quot;crib&amp;quot;. Taking that part way too personally. OP even admitted it wasn&amp;#39;t a morally right thing to do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbo21h", "score_hidden": false, "stickied": false, "created": 1492344961.0, "created_utc": 1492316161.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgbohvq", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "savemebarry67", "parent_id": "t1_dgbkatm", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Is it assumption to think that a 17yo might not have good advice about marriage?  The people responding to you feel obligated to point out how awful your advice is because they want to make sure that OP disregards it.  Which he should.  Because my god, it is truly very bad advice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is it assumption to think that a 17yo might not have good advice about marriage?  The people responding to you feel obligated to point out how awful your advice is because they want to make sure that OP disregards it.  Which he should.  Because my god, it is truly very bad advice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbohvq", "score_hidden": false, "stickied": false, "created": 1492345725.0, "created_utc": 1492316925.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65ku1h", "likes": null, "replies": "", "user_reports": [], "id": "dgblrvo", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DJ_Long_Snake", "parent_id": "t1_dgbkatm", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I realize at your age that love is enough to carry any relationship thru tough times in some sort of high school musical fantasy. However in the real world when one partner is conducting an emotional affair, planning fun events to show her a good time isnt gonna cut it. Misconception isnt the enemy here, the enemy is her conducting an inappropriate relationship.  If she refuses to end it, the relationship is toast. Period. And by the way when you start out with \"my parents are psychologists and my IQ is above average\" it screams juvenile immaturity, FYI. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I realize at your age that love is enough to carry any relationship thru tough times in some sort of high school musical fantasy. However in the real world when one partner is conducting an emotional affair, planning fun events to show her a good time isnt gonna cut it. Misconception isnt the enemy here, the enemy is her conducting an inappropriate relationship.  If she refuses to end it, the relationship is toast. Period. And by the way when you start out with &amp;quot;my parents are psychologists and my IQ is above average&amp;quot; it screams juvenile immaturity, FYI. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgblrvo", "score_hidden": false, "stickied": false, "created": 1492341331.0, "created_utc": 1492312531.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbkatm", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "ilgagsu", "parent_id": "t1_dgbjheh", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Oh boy. From where do I begin? Ok, let's see. If you could actually read what I typed, you could see that I'm definitely not suggesting he \"ignores\". My parents are both psychologists, were, and I myself am a person who's studied a ton of the subject, have quite above average EQ &amp; IQ. The only reason I'm even saying all of this is pretty much cos arguing with you is the best thing I have to do rn. Also, probably you still aren't experienced enough to learn that people can voice different opinions. You state yours, I state mine. Op needs help but not necessarily YOUR help. He can try what he thinks is best for him. Those are merely suggestions. And why being that offensive out of nowhere? You mention age but you clearly missed some life lessons about communicating with other people, didn't you. I don't want to stress the \"without a lick of life experience\". I'll just advice you to try not making generalisations and assumptions based on cognitive bias if not sheer stupidity. You don't know what one's been through, whether he/she is mature or not, what he has experienced and what not. Do you know why you shouldn't.? Because your job here is to provide advice through constructive dialog, not to bitch over random dudes just cause, yh. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh boy. From where do I begin? Ok, let&amp;#39;s see. If you could actually read what I typed, you could see that I&amp;#39;m definitely not suggesting he &amp;quot;ignores&amp;quot;. My parents are both psychologists, were, and I myself am a person who&amp;#39;s studied a ton of the subject, have quite above average EQ &amp;amp; IQ. The only reason I&amp;#39;m even saying all of this is pretty much cos arguing with you is the best thing I have to do rn. Also, probably you still aren&amp;#39;t experienced enough to learn that people can voice different opinions. You state yours, I state mine. Op needs help but not necessarily YOUR help. He can try what he thinks is best for him. Those are merely suggestions. And why being that offensive out of nowhere? You mention age but you clearly missed some life lessons about communicating with other people, didn&amp;#39;t you. I don&amp;#39;t want to stress the &amp;quot;without a lick of life experience&amp;quot;. I&amp;#39;ll just advice you to try not making generalisations and assumptions based on cognitive bias if not sheer stupidity. You don&amp;#39;t know what one&amp;#39;s been through, whether he/she is mature or not, what he has experienced and what not. Do you know why you shouldn&amp;#39;t.? Because your job here is to provide advice through constructive dialog, not to bitch over random dudes just cause, yh. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbkatm", "score_hidden": false, "stickied": false, "created": 1492339157.0, "created_utc": 1492310357.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbjheh", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "DJ_Long_Snake", "parent_id": "t1_dgbij9r", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your advice is awful and its shows that youre 17 years old without a lick of life experience. His wife is conducting an emotional affair and your advice is to ignore and just be nicer to her? Why doesnt he stick his head in the sand while Steve moves in too? He needs immediate couples therapy along with her cutting Steve out if the relationship stands any chance. Go back to high school with your advice teeny bopper. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your advice is awful and its shows that youre 17 years old without a lick of life experience. His wife is conducting an emotional affair and your advice is to ignore and just be nicer to her? Why doesnt he stick his head in the sand while Steve moves in too? He needs immediate couples therapy along with her cutting Steve out if the relationship stands any chance. Go back to high school with your advice teeny bopper. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbjheh", "score_hidden": false, "stickied": false, "created": 1492337944.0, "created_utc": 1492309144.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbij9r", "gilded": 0, "archived": false, "score": -9, "report_reasons": null, "author": "ilgagsu", "parent_id": "t1_dgbic4x", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just wanted to add. If things go out horribly wrong, the worst possible outcome. Remember this. You have to protect this relationship, but you also have to respect your precious other half. If she still thinks the whole relationship can't go any further, let her go. Be kind to her. Sacrifice your ego and well being for this love. Don't don't dont end up making her sad and miserable just to clang on a totally unhealthy marriage. You gotta find those blurred lines and you gotta make sure you aren't crossing them. Again, best of luck ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just wanted to add. If things go out horribly wrong, the worst possible outcome. Remember this. You have to protect this relationship, but you also have to respect your precious other half. If she still thinks the whole relationship can&amp;#39;t go any further, let her go. Be kind to her. Sacrifice your ego and well being for this love. Don&amp;#39;t don&amp;#39;t dont end up making her sad and miserable just to clang on a totally unhealthy marriage. You gotta find those blurred lines and you gotta make sure you aren&amp;#39;t crossing them. Again, best of luck &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbij9r", "score_hidden": false, "stickied": false, "created": 1492336546.0, "created_utc": 1492307746.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbic4x", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "ilgagsu", "parent_id": "t3_65ku1h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There are two things I kept in mind. 1) \"she loves me, I think\" \n2) \"she told me I'm controlling\" \n\n1) that\" I think\" shows more than you think it does. I don't believe that you see her relationship with Steve as a best friend one. At least, not subconsciously. \n\nNow, first things first. What is clear is that you love her a good damn lot. And the whole you trying to fix those problems shows me you really do care about he. That's all that's needed. Moving on, the gaming thing. Finding a hobby can be exciting etc, etc but there is a really thin line between enjoying and being addicted. Try going like : babe, it's no big deal but I'm kinda worried about the sleep you're getting lately, you seem a little bit tired. \" try to convince her to go get some advice. JUST for the gaming as an activity. If you detect that she believes the reason you're doing this is because you're worried about her relationship make sure you make those clouds go away. The first thing you care about is her health, and she needs to understand that. \n\nNow, something quite difficult. Stop watching her convos without her knowing. What it actually does is making you more worried, more stressful, it makes you lose trust and the whole relationship to start being clunky. Plus, and that's a big plus, if she finds out, which she probably will, eventually, you're in deep shit. \n\n\nAlong the same lines, don't attack Steve. This isn't the solution to the problem. \n\n\nKeep doing innovative, fun things. Try to spend more quality time together. Try to show her you are here for her through simple daily acts. Let her know. But don't be overreacting / faking it, cause she can tell. \n\n\nLet's discuss about number 2 quotation. The word control. Now, that is the biggest flag. What you need to take care of asap. It shows that she either feels you control her, contain her, restrain her (for whatever reason, I'm not saying it's the truth), or, she received these kind of emotions for other environments. (like her job). Lastly, it could just be something dating way back in time, for example feeling controlled from her parents as a child. Aand it could be a combination of those. But it worries me.\n\n\nTo sum up, you love her a lot and I really think you guys will be fine. The number one enemy you need to defeat is misconceptions / misinterpretations. Talk to her, openly, and be very clear and precise. Make sure she understands what you want her to understand and isn't making assumptions she shouldn't be. \n\n\nIf the whole Steve thing remains a mystery you could talk to one of her close friends, talk to Steve, or go to a counselor (which I don't suggest)..\n\nIt's tough, and it sure is doable. \n\n\n\n\nPs. I'm a 17yo and its 4:50 am at my place. Don't do as I say thoughtlessly but I beg you to consider my sayings. Hope it all works out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are two things I kept in mind. 1) &amp;quot;she loves me, I think&amp;quot; \n2) &amp;quot;she told me I&amp;#39;m controlling&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;1) that&amp;quot; I think&amp;quot; shows more than you think it does. I don&amp;#39;t believe that you see her relationship with Steve as a best friend one. At least, not subconsciously. &lt;/p&gt;\n\n&lt;p&gt;Now, first things first. What is clear is that you love her a good damn lot. And the whole you trying to fix those problems shows me you really do care about he. That&amp;#39;s all that&amp;#39;s needed. Moving on, the gaming thing. Finding a hobby can be exciting etc, etc but there is a really thin line between enjoying and being addicted. Try going like : babe, it&amp;#39;s no big deal but I&amp;#39;m kinda worried about the sleep you&amp;#39;re getting lately, you seem a little bit tired. &amp;quot; try to convince her to go get some advice. JUST for the gaming as an activity. If you detect that she believes the reason you&amp;#39;re doing this is because you&amp;#39;re worried about her relationship make sure you make those clouds go away. The first thing you care about is her health, and she needs to understand that. &lt;/p&gt;\n\n&lt;p&gt;Now, something quite difficult. Stop watching her convos without her knowing. What it actually does is making you more worried, more stressful, it makes you lose trust and the whole relationship to start being clunky. Plus, and that&amp;#39;s a big plus, if she finds out, which she probably will, eventually, you&amp;#39;re in deep shit. &lt;/p&gt;\n\n&lt;p&gt;Along the same lines, don&amp;#39;t attack Steve. This isn&amp;#39;t the solution to the problem. &lt;/p&gt;\n\n&lt;p&gt;Keep doing innovative, fun things. Try to spend more quality time together. Try to show her you are here for her through simple daily acts. Let her know. But don&amp;#39;t be overreacting / faking it, cause she can tell. &lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s discuss about number 2 quotation. The word control. Now, that is the biggest flag. What you need to take care of asap. It shows that she either feels you control her, contain her, restrain her (for whatever reason, I&amp;#39;m not saying it&amp;#39;s the truth), or, she received these kind of emotions for other environments. (like her job). Lastly, it could just be something dating way back in time, for example feeling controlled from her parents as a child. Aand it could be a combination of those. But it worries me.&lt;/p&gt;\n\n&lt;p&gt;To sum up, you love her a lot and I really think you guys will be fine. The number one enemy you need to defeat is misconceptions / misinterpretations. Talk to her, openly, and be very clear and precise. Make sure she understands what you want her to understand and isn&amp;#39;t making assumptions she shouldn&amp;#39;t be. &lt;/p&gt;\n\n&lt;p&gt;If the whole Steve thing remains a mystery you could talk to one of her close friends, talk to Steve, or go to a counselor (which I don&amp;#39;t suggest)..&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s tough, and it sure is doable. &lt;/p&gt;\n\n&lt;p&gt;Ps. I&amp;#39;m a 17yo and its 4:50 am at my place. Don&amp;#39;t do as I say thoughtlessly but I beg you to consider my sayings. Hope it all works out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbic4x", "score_hidden": false, "stickied": false, "created": 1492336248.0, "created_utc": 1492307448.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -7}}], "after": null, "before": null}}]