[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know where to begin here.  &lt;/p&gt;\n\n&lt;p&gt;My sister doesn&amp;#39;t get on with much of the family.  There is one brother [37/M] she&amp;#39;s not talking to, my mother [64/F] and me. &lt;/p&gt;\n\n&lt;p&gt;The downfall between me and her: &lt;/p&gt;\n\n&lt;p&gt;A little bit before Christmas time of 2014, I was working some long and hard days.  My sister was usually very pessimistic.  One night after work she was dishing out negativity and I gave out to her.   Me giving out to her had roots in stress and also had roots in her not speaking to our brother and snubbing the birth of his baby/our niece she doesn&amp;#39;t want to know. &lt;/p&gt;\n\n&lt;p&gt;The next day after that, I thought about things and thought I was too harsh with her and thought after work, I will talk to her and apologize.  It didn&amp;#39;t work out like that.  I worked 13 hours and came home exhausted. My dinner was a cup of tea that I was falling asleep over, so I went to bed. &lt;/p&gt;\n\n&lt;p&gt;The following day, my sister started texting me some abusive messages and when came home, again after another long day, I found a lot of my belongings dumped.  She did that.  &lt;/p&gt;\n\n&lt;p&gt;After that, I kept to myself.  I was busy with work.  Any time I was home, my sister was like a bull. She wasn&amp;#39;t speaking to me and there was intimation around the house.  Like say for example if I wanted to make tea, she would stand in front of the cupboard with the mugs and I would be lik, excuse me can I get a mug please.  She would stand there and ignore me.  &lt;/p&gt;\n\n&lt;p&gt;On Christmas eve, I extended my hand and offered to help her with her shopping but she ignored me.  &lt;/p&gt;\n\n&lt;p&gt;After this, I kept to myself.  My sister continued on being that way.  We came into spring and things were much the same.  She made it very clear to me that I was dead to her.  They were her words that she texted me.  I was fine with this. I was busy and I had loads of things planned to be looking forward to for the year ahead.  &lt;/p&gt;\n\n&lt;p&gt;Throughout the spring, I noticed so much like money stolen from my wallet and some belongings going missing like my favourite PlayStation games just gone.  I knew it was her.  Upon discovery of such, I felt like confronting her but I held back knowing it would get me nowhere.  She would more than likely deny things or get a kick from ignoring me.  &lt;/p&gt;\n\n&lt;p&gt;Towards the Easter time, my sister was due to move out.  I received an abusive message from her that left me sick and nearly shaking.  It was a message of pure crazy and that&amp;#39;s all it was.  Like - &amp;#39;you did this&amp;#39; &amp;#39;you did that&amp;#39;.  She took situations out from the past and twisted them all.  Her messages continued for the day and after that too. I considered replying but didn&amp;#39;t because there was nothing I could say or write to fix this.&lt;/p&gt;\n\n&lt;p&gt;There were 100s of messages sent over the following few months.  The messages came on and off.  Sometimes receiving up to 150 a day.  &lt;/p&gt;\n\n&lt;p&gt;There was so much abuse in them messages. There were threats too.  One message even said she brushed the toilet with my toothbrush. &lt;/p&gt;\n\n&lt;p&gt;I never responded to any and each and every time she would step things up in her abuse.&lt;/p&gt;\n\n&lt;p&gt;By autumn, I learned of a fake Facebook profile that she had set up to humiliate me.  I also got a call from someone looking to buy a car from me. I learned that she created an ad on a selling site with my details. &lt;/p&gt;\n\n&lt;p&gt;I changed my number and she continued her abuse by email.  &lt;/p&gt;\n\n&lt;p&gt;All this died down throughout 2016.  There were some face Facebook profiles set up to send me messages on messagner but that was about it.  &lt;/p&gt;\n\n&lt;p&gt;I came so close so many times to going to the police but I never did. &lt;/p&gt;\n\n&lt;p&gt;So it brings me now to today.  Before Christmas just gone, our grandmother died.  My sister came home. She was so sweet.  Things were awkward but we were on speaking terms.  She obtained my new number.  &lt;/p&gt;\n\n&lt;p&gt;After Christmas, the abuse has started up again.  The abusive messages.  I&amp;#39;m also getting prank calls.  There are also accusations coming from her in the abusive messages.  All sorts of works from her.  &lt;/p&gt;\n\n&lt;p&gt;She is also accusing me of prank calling her and she&amp;#39;s threatening me like &amp;#39;if you don&amp;#39;t stop I&amp;#39;ll contact your work or whatever&amp;#39;.   I did text her back this evening saying I&amp;#39;ve better things to be doing aside from calling her.  I&amp;#39;m genuinely not phoning her.  She&amp;#39;s the last thing on my mind from day to day, let me tell you that much.  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: \nI&amp;#39;m getting harassed from my sister.  What do I do here? \nGoing to the police is the last straw for me.  When I told my mam and brothers back in 2015 of what was happening they questioned me - like what am I doing to anger her.  Truth be told, I&amp;#39;m moving on with my life and trying to make the best of it.  I would hate to be sitting in front of a police man in an office explaining all of this and showing the abusive messages and other work and for him to think the same - what am I doing on her. &lt;/p&gt;\n\n&lt;p&gt;I considered writing a letter to her but I doubt it would achieve anything.  There&amp;#39;s too much hatred from her.  &lt;/p&gt;\n\n&lt;p&gt;I considered going to a solicitor but right now money is very tight. &lt;/p&gt;\n\n&lt;p&gt;The country I&amp;#39;m from, blocking a number is not an easy task.  It has to be done through the police. &lt;/p&gt;\n\n&lt;p&gt;Also, something else.  Different but related.  My boyfriend knows I have a sister and but he doesn&amp;#39;t know any details of any of this.  I don&amp;#39;t talk about her to him. He does know I&amp;#39;m getting some prank calls because he&amp;#39;s been in my company when I got a few but that&amp;#39;s it.  Surely something like that would play on his mind.  How would I explain something like this to him.   &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know where to begin here.  \n\nMy sister doesn't get on with much of the family.  There is one brother [37/M] she's not talking to, my mother [64/F] and me. \n\nThe downfall between me and her: \n\nA little bit before Christmas time of 2014, I was working some long and hard days.  My sister was usually very pessimistic.  One night after work she was dishing out negativity and I gave out to her.   Me giving out to her had roots in stress and also had roots in her not speaking to our brother and snubbing the birth of his baby/our niece she doesn't want to know. \n\nThe next day after that, I thought about things and thought I was too harsh with her and thought after work, I will talk to her and apologize.  It didn't work out like that.  I worked 13 hours and came home exhausted. My dinner was a cup of tea that I was falling asleep over, so I went to bed. \n\nThe following day, my sister started texting me some abusive messages and when came home, again after another long day, I found a lot of my belongings dumped.  She did that.  \n\nAfter that, I kept to myself.  I was busy with work.  Any time I was home, my sister was like a bull. She wasn't speaking to me and there was intimation around the house.  Like say for example if I wanted to make tea, she would stand in front of the cupboard with the mugs and I would be lik, excuse me can I get a mug please.  She would stand there and ignore me.  \n\nOn Christmas eve, I extended my hand and offered to help her with her shopping but she ignored me.  \n\nAfter this, I kept to myself.  My sister continued on being that way.  We came into spring and things were much the same.  She made it very clear to me that I was dead to her.  They were her words that she texted me.  I was fine with this. I was busy and I had loads of things planned to be looking forward to for the year ahead.  \n\nThroughout the spring, I noticed so much like money stolen from my wallet and some belongings going missing like my favourite PlayStation games just gone.  I knew it was her.  Upon discovery of such, I felt like confronting her but I held back knowing it would get me nowhere.  She would more than likely deny things or get a kick from ignoring me.  \n\nTowards the Easter time, my sister was due to move out.  I received an abusive message from her that left me sick and nearly shaking.  It was a message of pure crazy and that's all it was.  Like - 'you did this' 'you did that'.  She took situations out from the past and twisted them all.  Her messages continued for the day and after that too. I considered replying but didn't because there was nothing I could say or write to fix this.\n\nThere were 100s of messages sent over the following few months.  The messages came on and off.  Sometimes receiving up to 150 a day.  \n\nThere was so much abuse in them messages. There were threats too.  One message even said she brushed the toilet with my toothbrush. \n\nI never responded to any and each and every time she would step things up in her abuse.\n\nBy autumn, I learned of a fake Facebook profile that she had set up to humiliate me.  I also got a call from someone looking to buy a car from me. I learned that she created an ad on a selling site with my details. \n\nI changed my number and she continued her abuse by email.  \n\nAll this died down throughout 2016.  There were some face Facebook profiles set up to send me messages on messagner but that was about it.  \n\nI came so close so many times to going to the police but I never did. \n\nSo it brings me now to today.  Before Christmas just gone, our grandmother died.  My sister came home. She was so sweet.  Things were awkward but we were on speaking terms.  She obtained my new number.  \n\nAfter Christmas, the abuse has started up again.  The abusive messages.  I'm also getting prank calls.  There are also accusations coming from her in the abusive messages.  All sorts of works from her.  \n\nShe is also accusing me of prank calling her and she's threatening me like 'if you don't stop I'll contact your work or whatever'.   I did text her back this evening saying I've better things to be doing aside from calling her.  I'm genuinely not phoning her.  She's the last thing on my mind from day to day, let me tell you that much.  \n  ---   \n  **tl;dr**: \nI'm getting harassed from my sister.  What do I do here? \nGoing to the police is the last straw for me.  When I told my mam and brothers back in 2015 of what was happening they questioned me - like what am I doing to anger her.  Truth be told, I'm moving on with my life and trying to make the best of it.  I would hate to be sitting in front of a police man in an office explaining all of this and showing the abusive messages and other work and for him to think the same - what am I doing on her. \n\nI considered writing a letter to her but I doubt it would achieve anything.  There's too much hatred from her.  \n\nI considered going to a solicitor but right now money is very tight. \n\nThe country I'm from, blocking a number is not an easy task.  It has to be done through the police. \n\nAlso, something else.  Different but related.  My boyfriend knows I have a sister and but he doesn't know any details of any of this.  I don't talk about her to him. He does know I'm getting some prank calls because he's been in my company when I got a few but that's it.  Surely something like that would play on his mind.  How would I explain something like this to him.   ", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Non-Romantic", "id": "65n06h", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 184, "report_reasons": null, "author": "LovingKnit", "saved": false, "mod_reports": [], "name": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-gn misc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65n06h/my_twin_sister_34f_is_harassing_me_34f/", "num_reports": null, "locked": false, "stickied": false, "created": 1492339386.0, "url": "https://www.reddit.com/r/relationships/comments/65n06h/my_twin_sister_34f_is_harassing_me_34f/", "author_flair_text": null, "quarantine": false, "title": "My twin sister [34/F] is harassing me [34/F]", "created_utc": 1492310586.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 23, "visited": false, "subreddit_type": "public", "ups": 184}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgcnk1x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "meb909", "parent_id": "t1_dgchqlf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Wait do you think they're Siamese twins??", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait do you think they&amp;#39;re Siamese twins??&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcnk1x", "score_hidden": true, "stickied": false, "created": 1492409261.0, "created_utc": 1492380461.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchqlf", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgbm9hr", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgchqlf", "score_hidden": false, "stickied": false, "created": 1492401686.0, "created_utc": 1492372886.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbm9hr", "gilded": 0, "archived": false, "score": 201, "report_reasons": null, "author": "lonelyemoburrito", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If you can't block her, change your number again. Preemptively tell your work/HR about your sister. In regards to your boyfriend, just sit him down and say that your sister has a history of harassing you and has started up again after the funeral, from there you can show him screenshots and tell him how you plan to handle it. I would seriously consider going to the police, in the least to block her number. What will be the final straw for you, when it gets physical? It's clear she hates you, and hasn't stopped for years now, it's time to go to the police. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you can&amp;#39;t block her, change your number again. Preemptively tell your work/HR about your sister. In regards to your boyfriend, just sit him down and say that your sister has a history of harassing you and has started up again after the funeral, from there you can show him screenshots and tell him how you plan to handle it. I would seriously consider going to the police, in the least to block her number. What will be the final straw for you, when it gets physical? It&amp;#39;s clear she hates you, and hasn&amp;#39;t stopped for years now, it&amp;#39;s time to go to the police. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbm9hr", "score_hidden": false, "stickied": false, "created": 1492342089.0, "created_utc": 1492313289.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 201}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgbskba", "gilded": 0, "archived": false, "score": 135, "report_reasons": null, "author": "crystal_3001", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Get a restraining order.  Show the police the hundreds of messages.  It's not your insanity on display.  You have YEARS of her harassing you on display.  Get them to block her number for you.  If they ask you why she's doing this explain the argument that happened three years ago.  She's unhinged.   \n\nTell your boyfriend your sister is insane so he knows, hell show him the hundreds of messages.  She's out of your life now, make it official. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get a restraining order.  Show the police the hundreds of messages.  It&amp;#39;s not your insanity on display.  You have YEARS of her harassing you on display.  Get them to block her number for you.  If they ask you why she&amp;#39;s doing this explain the argument that happened three years ago.  She&amp;#39;s unhinged.   &lt;/p&gt;\n\n&lt;p&gt;Tell your boyfriend your sister is insane so he knows, hell show him the hundreds of messages.  She&amp;#39;s out of your life now, make it official. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbskba", "score_hidden": false, "stickied": false, "created": 1492354116.0, "created_utc": 1492325316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 135}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgbv5dt", "gilded": 0, "archived": false, "score": 72, "report_reasons": null, "author": "UltimaStone", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Go to the police. Just because your family didn't think she would lash out unprovoked, it doesn't mean the police won't believe you. You have hard evidence- there is no getting out of those messages now.\n\nI think sometimes family don't want to believe their loved ones could be so cruel and refuse to see their mean streaks.\n\nYou deserve to live without being harassed. She could jeopardize your job. She won't just come to her senses and be a good person.\n\nPlease dob her in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go to the police. Just because your family didn&amp;#39;t think she would lash out unprovoked, it doesn&amp;#39;t mean the police won&amp;#39;t believe you. You have hard evidence- there is no getting out of those messages now.&lt;/p&gt;\n\n&lt;p&gt;I think sometimes family don&amp;#39;t want to believe their loved ones could be so cruel and refuse to see their mean streaks.&lt;/p&gt;\n\n&lt;p&gt;You deserve to live without being harassed. She could jeopardize your job. She won&amp;#39;t just come to her senses and be a good person.&lt;/p&gt;\n\n&lt;p&gt;Please dob her in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbv5dt", "score_hidden": false, "stickied": false, "created": 1492361735.0, "created_utc": 1492332935.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 72}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgbxff1", "gilded": 0, "archived": false, "score": 48, "report_reasons": null, "author": "baby_armadillo", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I am willing to bet your sister is severely mentally ill and desperately needs help.  And I know it's difficult but start documenting all the messages you get from your sister-their contents and when you received them just in case it escalates to the point that you do need a restraining order or anything else.  And seriously show them to your family so they can appreciate the sheer volume of abuse you are receiving.  ", "edited": 1492340980.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am willing to bet your sister is severely mentally ill and desperately needs help.  And I know it&amp;#39;s difficult but start documenting all the messages you get from your sister-their contents and when you received them just in case it escalates to the point that you do need a restraining order or anything else.  And seriously show them to your family so they can appreciate the sheer volume of abuse you are receiving.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbxff1", "score_hidden": false, "stickied": false, "created": 1492369536.0, "created_utc": 1492340736.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 48}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgbyw8t", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "helpfulkorn", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Since you're not in the US are you using a landline or cell phone?\n\nYou should be able to buy (you may have to order online, try amazon), a landline phone that will give you the option to block numbers using its own programming.\n\nIf you are receiving these calls on a cell phone, look for an application in the app store for your phone.  I do not know if you have different apps or a different app store where you are, but I would suggest looking for Mr. Number or Hiya.  If you can't find either of those apps, search by category, try looking under Utilities, for example, for a Caller ID app that includes number blocking.\n\nAs for the rest, you should go to the police so if she escalates there is already a paper trail and you will be able to get help quicker.  Though I am not sure how similar your police are to the police in the US.  As others have suggested, if you can, get some type of restraining order.\n\nPreemptively go to HR and explain the situation.  It would be helpful to have police documentation here so that they believe you (given she is your twin, I can imagine this could cause issues of mistaken identity).  \n\nTell your boyfriend so he is aware and doesn't accidentally give information away to any \"concerned family\" that may attempt to contact him.\n\nOn Facebook you limit your posts so that they are only seen by people on your Friend's list.  You can also limit all past posts by choosing an option under the Privacy Settings section.  This will retroactively change the visibility of past posts to just members of your friend's list.  If you have an excessively large list of friends or happen to have many people that might know your sister, or you don't know very well in real life on it, create a special privacy filter where you add them to your \"restricted list\".  This allows them to stay friends with you, but when they view your FB page it will appear as if you haven't posted anything.\n\nOf course, the best way to be safe with the whole FB thing is just to deactivate it.\n\nBest of luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since you&amp;#39;re not in the US are you using a landline or cell phone?&lt;/p&gt;\n\n&lt;p&gt;You should be able to buy (you may have to order online, try amazon), a landline phone that will give you the option to block numbers using its own programming.&lt;/p&gt;\n\n&lt;p&gt;If you are receiving these calls on a cell phone, look for an application in the app store for your phone.  I do not know if you have different apps or a different app store where you are, but I would suggest looking for Mr. Number or Hiya.  If you can&amp;#39;t find either of those apps, search by category, try looking under Utilities, for example, for a Caller ID app that includes number blocking.&lt;/p&gt;\n\n&lt;p&gt;As for the rest, you should go to the police so if she escalates there is already a paper trail and you will be able to get help quicker.  Though I am not sure how similar your police are to the police in the US.  As others have suggested, if you can, get some type of restraining order.&lt;/p&gt;\n\n&lt;p&gt;Preemptively go to HR and explain the situation.  It would be helpful to have police documentation here so that they believe you (given she is your twin, I can imagine this could cause issues of mistaken identity).  &lt;/p&gt;\n\n&lt;p&gt;Tell your boyfriend so he is aware and doesn&amp;#39;t accidentally give information away to any &amp;quot;concerned family&amp;quot; that may attempt to contact him.&lt;/p&gt;\n\n&lt;p&gt;On Facebook you limit your posts so that they are only seen by people on your Friend&amp;#39;s list.  You can also limit all past posts by choosing an option under the Privacy Settings section.  This will retroactively change the visibility of past posts to just members of your friend&amp;#39;s list.  If you have an excessively large list of friends or happen to have many people that might know your sister, or you don&amp;#39;t know very well in real life on it, create a special privacy filter where you add them to your &amp;quot;restricted list&amp;quot;.  This allows them to stay friends with you, but when they view your FB page it will appear as if you haven&amp;#39;t posted anything.&lt;/p&gt;\n\n&lt;p&gt;Of course, the best way to be safe with the whole FB thing is just to deactivate it.&lt;/p&gt;\n\n&lt;p&gt;Best of luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbyw8t", "score_hidden": false, "stickied": false, "created": 1492373764.0, "created_utc": 1492344964.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgc1d08", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "siasin", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Go To The Police. \n\nYOU are not the person who has behavior to be embarrassed by. I know you still are-\"Why would a twin, the person who I shared birth with, do this to me unless something was wrong\"? And there is something wrong. But it's with her, not you. \n\nThe fact that she has gone to the extent of making fake ads and Facebook profiles is an escalation. She is determined to make your life hell if she can. No decent person, let alone family member, does this even to someone they want out of their life. It's more frightening to think how this could continue to get worse-you have to become prepared for that!\n\nThere is nothing you owe her because of blood or childhood that equals having to deal with the abuse she is flooding you with. Talk to the police, scrape a bit together for a lawyer if that's not enough, and check out personal security options. \nAnd tell EVERYONE else too. Your boyfriend, friends, coworkers, other family. You deserve to have that support that she is trying to cut you off from, and it will have the added bonus of warning them for future reference. \n\nShe wants you to be silent and accepting and ashamed. This could escalate further. You don't deserve that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go To The Police. &lt;/p&gt;\n\n&lt;p&gt;YOU are not the person who has behavior to be embarrassed by. I know you still are-&amp;quot;Why would a twin, the person who I shared birth with, do this to me unless something was wrong&amp;quot;? And there is something wrong. But it&amp;#39;s with her, not you. &lt;/p&gt;\n\n&lt;p&gt;The fact that she has gone to the extent of making fake ads and Facebook profiles is an escalation. She is determined to make your life hell if she can. No decent person, let alone family member, does this even to someone they want out of their life. It&amp;#39;s more frightening to think how this could continue to get worse-you have to become prepared for that!&lt;/p&gt;\n\n&lt;p&gt;There is nothing you owe her because of blood or childhood that equals having to deal with the abuse she is flooding you with. Talk to the police, scrape a bit together for a lawyer if that&amp;#39;s not enough, and check out personal security options. \nAnd tell EVERYONE else too. Your boyfriend, friends, coworkers, other family. You deserve to have that support that she is trying to cut you off from, and it will have the added bonus of warning them for future reference. &lt;/p&gt;\n\n&lt;p&gt;She wants you to be silent and accepting and ashamed. This could escalate further. You don&amp;#39;t deserve that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc1d08", "score_hidden": false, "stickied": false, "created": 1492379024.0, "created_utc": 1492350224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgc5szm", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "stapleherdick", "parent_id": "t1_dgbv6ea", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Make sure it is on friends only, not friends of friends as I'm sure you'll have at least one mutual. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make sure it is on friends only, not friends of friends as I&amp;#39;m sure you&amp;#39;ll have at least one mutual. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc5szm", "score_hidden": false, "stickied": false, "created": 1492385875.0, "created_utc": 1492357075.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbv6ea", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "UltimaStone", "parent_id": "t1_dgbv1t1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You could consider changing your fb to custom privacy. Anything you don't want getting back to her could be restricted and the posts just wouldn't show up for certain people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could consider changing your fb to custom privacy. Anything you don&amp;#39;t want getting back to her could be restricted and the posts just wouldn&amp;#39;t show up for certain people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbv6ea", "score_hidden": false, "stickied": false, "created": 1492361830.0, "created_utc": 1492333030.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbv1t1", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "LovingKnit", "parent_id": "t1_dgbnz97", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My sister isn't living at home any more.  I will have to go back and read my original post again because I think I wrote there.   She moved out, thank goodness.  \n\nThe comments from my mother and another brother stung at the time but there's no point holding onto them.  My sister eventually moved her hatred onto my mam and that's when my mam learned. \n\nMy sister doesn't know I'm dating him.  They would know of each other from the past.  I have to keep things quite on Facebook because of the place being stalkerbook.  My sister is blocked on Facebook and also another brother has her blocked.  I would never trust my sister here.  She would definitely sabotage things between my boyfriend and I.  \n\nYour last paragraph is very true and I don't need anyone to tell me this.  I have no room in my life for poison and I want nothing to do with her.  This is all water of a ducks back for me.   I was in a similar situation a few years ago with my sister when were younger and both living at home.  She was poison and sour.  Her favourite thing to do was keep me awake at night.  Switch on the light, go make noise around the room etc.  She knowing well I'd have to be up for the morning.  I would have been lucky if I got 3-4 hours sleep a night back then.  Whatever sleep I had was broken.  There was so much more from her too.   As far as I'm concerned, that's over and in the past.  I can see it now for what it is.  Sleep deprivation is a form of torture and I very much suffered too.  She tried to control me this way.  \nShe didn't have that avenue this time around and it's coming out now this way.\n\nI doubt she will ever come home again.  She eventually moved onto my mother with a lot of hatred and she's hops from two brothers, me and mam but I'm getting the abuse and harassment.  I doubt she will be able to sweeten her way back into my mothers life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My sister isn&amp;#39;t living at home any more.  I will have to go back and read my original post again because I think I wrote there.   She moved out, thank goodness.  &lt;/p&gt;\n\n&lt;p&gt;The comments from my mother and another brother stung at the time but there&amp;#39;s no point holding onto them.  My sister eventually moved her hatred onto my mam and that&amp;#39;s when my mam learned. &lt;/p&gt;\n\n&lt;p&gt;My sister doesn&amp;#39;t know I&amp;#39;m dating him.  They would know of each other from the past.  I have to keep things quite on Facebook because of the place being stalkerbook.  My sister is blocked on Facebook and also another brother has her blocked.  I would never trust my sister here.  She would definitely sabotage things between my boyfriend and I.  &lt;/p&gt;\n\n&lt;p&gt;Your last paragraph is very true and I don&amp;#39;t need anyone to tell me this.  I have no room in my life for poison and I want nothing to do with her.  This is all water of a ducks back for me.   I was in a similar situation a few years ago with my sister when were younger and both living at home.  She was poison and sour.  Her favourite thing to do was keep me awake at night.  Switch on the light, go make noise around the room etc.  She knowing well I&amp;#39;d have to be up for the morning.  I would have been lucky if I got 3-4 hours sleep a night back then.  Whatever sleep I had was broken.  There was so much more from her too.   As far as I&amp;#39;m concerned, that&amp;#39;s over and in the past.  I can see it now for what it is.  Sleep deprivation is a form of torture and I very much suffered too.  She tried to control me this way.&lt;br/&gt;\nShe didn&amp;#39;t have that avenue this time around and it&amp;#39;s coming out now this way.&lt;/p&gt;\n\n&lt;p&gt;I doubt she will ever come home again.  She eventually moved onto my mother with a lot of hatred and she&amp;#39;s hops from two brothers, me and mam but I&amp;#39;m getting the abuse and harassment.  I doubt she will be able to sweeten her way back into my mothers life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbv1t1", "score_hidden": false, "stickied": false, "created": 1492361407.0, "created_utc": 1492332607.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnz97", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "YesILeftHisAss2398", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The way you talk about her and getting a mug, etc makes it sound like you live together. If that is still the case, time to move out. As to what the police think, she is absolutely harassing you. You cant worry about other people judging you in these situations. The only move you have to deal with it legally is to pursue a police report. \n\nIf your family really, at this point, after her doing this to your own brother and refusing to see her own niece, are still asking \"what have YOU done to deserve this\" then your Sister isnt the only problem here. Sometimes family doesnt want to get involved and will throw you under the bus to keep the abuser happy and away from them. Dont be fooled, that is ABSOLUTELY someone taking sides, and it isnt yours. Put distance and space there. And dont trust them with your number. I would recommend getting the cell carrier to change your number. Before you give it out, get a google voice number and give them that. Then you can turn it off without any issues if its abused or given out. And block her. \n\nAs to your Boyfriend, you probably should tell him about it. She may approach him, flirt or something, or tell him lies about you. If you keep him in the dark he has no way to protect himself. \n\nAnd I do want you to understand something. What your Sister is doing isnt \"normal\". When I say that, I mean she has serious issues and no talking it out, or doing what she wants is going to make it go away. I would keep her out of your life long term no matter what lies she tells or promises she makes to you. She likes and seems to need to abuse people. So stay away from her. If she is at your folks, you dont go there. And she is going to try damn hard to put you in the middle there and trick you into that to control the situation. And she will likely try to get your folks on board with it. There will be \"why cant we be ffffaaaammmmmiiilllliiiee??\" and you will be blamed for it. Let it go. People that do that dont care about you, they just want more opportunities to harass, control and abuse you. And she will use your Mom against you as long as your Mom enables it. Shes what we call a \"flying monkey\". Read up on Cluster Bs, check out raisedbynarcissists (there is lots of good info in the sidebar), and you can check out justnofamily too. Hopefully you will find that enlightening. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The way you talk about her and getting a mug, etc makes it sound like you live together. If that is still the case, time to move out. As to what the police think, she is absolutely harassing you. You cant worry about other people judging you in these situations. The only move you have to deal with it legally is to pursue a police report. &lt;/p&gt;\n\n&lt;p&gt;If your family really, at this point, after her doing this to your own brother and refusing to see her own niece, are still asking &amp;quot;what have YOU done to deserve this&amp;quot; then your Sister isnt the only problem here. Sometimes family doesnt want to get involved and will throw you under the bus to keep the abuser happy and away from them. Dont be fooled, that is ABSOLUTELY someone taking sides, and it isnt yours. Put distance and space there. And dont trust them with your number. I would recommend getting the cell carrier to change your number. Before you give it out, get a google voice number and give them that. Then you can turn it off without any issues if its abused or given out. And block her. &lt;/p&gt;\n\n&lt;p&gt;As to your Boyfriend, you probably should tell him about it. She may approach him, flirt or something, or tell him lies about you. If you keep him in the dark he has no way to protect himself. &lt;/p&gt;\n\n&lt;p&gt;And I do want you to understand something. What your Sister is doing isnt &amp;quot;normal&amp;quot;. When I say that, I mean she has serious issues and no talking it out, or doing what she wants is going to make it go away. I would keep her out of your life long term no matter what lies she tells or promises she makes to you. She likes and seems to need to abuse people. So stay away from her. If she is at your folks, you dont go there. And she is going to try damn hard to put you in the middle there and trick you into that to control the situation. And she will likely try to get your folks on board with it. There will be &amp;quot;why cant we be ffffaaaammmmmiiilllliiiee??&amp;quot; and you will be blamed for it. Let it go. People that do that dont care about you, they just want more opportunities to harass, control and abuse you. And she will use your Mom against you as long as your Mom enables it. Shes what we call a &amp;quot;flying monkey&amp;quot;. Read up on Cluster Bs, check out raisedbynarcissists (there is lots of good info in the sidebar), and you can check out justnofamily too. Hopefully you will find that enlightening. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbnz97", "score_hidden": false, "stickied": false, "created": 1492344837.0, "created_utc": 1492316037.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgbymqv", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "flybrand", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Is she okay mentally?\n\nThe accusations of OP crank calling sister is odd.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is she okay mentally?&lt;/p&gt;\n\n&lt;p&gt;The accusations of OP crank calling sister is odd.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbymqv", "score_hidden": false, "stickied": false, "created": 1492373066.0, "created_utc": 1492344266.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgc5qn4", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "stapleherdick", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "1. Show your boyfriend this post. Let him support you. \n2. You need to understand that your sister is mentally disturbed. This is NOT normal behavior. If she will not get professional help then there is nothing you can do. You did not cause this. This is not your fault. \n3. You need to change your number today. Do whatever it takes. Second inform your HR department that you are being harassed.\n4. I know you said you cannot afford a lawyer, so set money aside. Compile and save all evidence. You need to get a restraining order before this gets worse because it will get worse. \n5. Once that is done, I'd talk to your parents. I'd do it after because you do not need someone to either escalate the situation by tipping her off, or have them talk you out of doing something completely necessary. Send your parents the proof. Let them know your sister needs help. Wash your hands of it because that is the MAXIMUM you can do to help her. \n\nIt will do you NO good to let her hurt you and disrupt your life. You have to protect yourself first. Make a new email,  get your contact information removed from websites, whatever you have to do. Talk with a lawyer. She has escalated behavior before and it will happen again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;Show your boyfriend this post. Let him support you. &lt;/li&gt;\n&lt;li&gt;You need to understand that your sister is mentally disturbed. This is NOT normal behavior. If she will not get professional help then there is nothing you can do. You did not cause this. This is not your fault. &lt;/li&gt;\n&lt;li&gt;You need to change your number today. Do whatever it takes. Second inform your HR department that you are being harassed.&lt;/li&gt;\n&lt;li&gt;I know you said you cannot afford a lawyer, so set money aside. Compile and save all evidence. You need to get a restraining order before this gets worse because it will get worse. &lt;/li&gt;\n&lt;li&gt;Once that is done, I&amp;#39;d talk to your parents. I&amp;#39;d do it after because you do not need someone to either escalate the situation by tipping her off, or have them talk you out of doing something completely necessary. Send your parents the proof. Let them know your sister needs help. Wash your hands of it because that is the MAXIMUM you can do to help her. &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;It will do you NO good to let her hurt you and disrupt your life. You have to protect yourself first. Make a new email,  get your contact information removed from websites, whatever you have to do. Talk with a lawyer. She has escalated behavior before and it will happen again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc5qn4", "score_hidden": false, "stickied": false, "created": 1492385786.0, "created_utc": 1492356986.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgc6yxd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "KingLi88", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I dont understand why you wont go to the police? Its not like they will arrest her, they will just tell her to stay away or help you get a restraining order. In the worst case scenario, if she makes crazy people show up at your house and you get injured the police doesnt have a record of her harassing you and it makes it harder on you? Im confused as to why wont go to the police", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dont understand why you wont go to the police? Its not like they will arrest her, they will just tell her to stay away or help you get a restraining order. In the worst case scenario, if she makes crazy people show up at your house and you get injured the police doesnt have a record of her harassing you and it makes it harder on you? Im confused as to why wont go to the police&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc6yxd", "score_hidden": false, "stickied": false, "created": 1492387463.0, "created_utc": 1492358663.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgcay8f", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ViviElnora", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Tell your boyfriend, he knows something is up. Not telling him, will make him feel like you don't trust him. If he cares about you, he will want to support you. He can't do that if he doesn't know what is going on.\n\nIf you have saved everything she has sent you, the police should take you seriously. Where I live in the U.S., you don't have to go to the police to get a harassment restraining order, it can be done at the local courthouse. I searched online for \"how to get a restraining order in ~where I live~\"\n\nYou should encourage the rest of your family to also apply for restraining orders. It is possible that without you to harass, she might choose one of them to take your place. I think it is especially important for your brother. He needs to make sure his daughter is safe from her. \n\nYou should let HR at your job know what is going on. If they know, they can ban her from the premises, and put a protocol in place to ensure she can't do anything to affect your job.\n\nI personally don't think you should block all communication from her. Don't ever answer phone calls from her, hang up right away if you answer a call and realize it is her, but keep the written communication. Just archive it without reading it, then if something more happens, you will have proof of continued harassment. You may want to skim through it occasionally to check for specific threats. If you can't do it without taking personally (knowing it really isn't about you, it is about your sister's psychosis), maybe your boyfriend or another friend can. All you should look for are specific threats, ignore, but save, the plain abusive ones. If she says anything about doing something to harm you, take it to the police immediately. Also report anytime she gives out your personal information (like the ad about the car).\n\nYou should also look into how to protect your identity. Make sure there is no way she can take out a loan, get a credit card in your name, or access your bank account.\n\nAnother thing you should consider doing is getting security cameras. It will allow you to see if she is stalking your home and provide proof if she damages anything. If your mailbox doesn't lock, you should try to get one that does. Never leave your doors unlocked, even when you are home.\n\nI know some of this sounds extreme, but you said that ignoring her made her escalate her abuse. She is clearly not rational, and taking more steps to protect yourself could push her to do more. Definitely don't use that as a reason to not get a restraining order, but it is a good idea to take additional steps to protect yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell your boyfriend, he knows something is up. Not telling him, will make him feel like you don&amp;#39;t trust him. If he cares about you, he will want to support you. He can&amp;#39;t do that if he doesn&amp;#39;t know what is going on.&lt;/p&gt;\n\n&lt;p&gt;If you have saved everything she has sent you, the police should take you seriously. Where I live in the U.S., you don&amp;#39;t have to go to the police to get a harassment restraining order, it can be done at the local courthouse. I searched online for &amp;quot;how to get a restraining order in ~where I live~&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You should encourage the rest of your family to also apply for restraining orders. It is possible that without you to harass, she might choose one of them to take your place. I think it is especially important for your brother. He needs to make sure his daughter is safe from her. &lt;/p&gt;\n\n&lt;p&gt;You should let HR at your job know what is going on. If they know, they can ban her from the premises, and put a protocol in place to ensure she can&amp;#39;t do anything to affect your job.&lt;/p&gt;\n\n&lt;p&gt;I personally don&amp;#39;t think you should block all communication from her. Don&amp;#39;t ever answer phone calls from her, hang up right away if you answer a call and realize it is her, but keep the written communication. Just archive it without reading it, then if something more happens, you will have proof of continued harassment. You may want to skim through it occasionally to check for specific threats. If you can&amp;#39;t do it without taking personally (knowing it really isn&amp;#39;t about you, it is about your sister&amp;#39;s psychosis), maybe your boyfriend or another friend can. All you should look for are specific threats, ignore, but save, the plain abusive ones. If she says anything about doing something to harm you, take it to the police immediately. Also report anytime she gives out your personal information (like the ad about the car).&lt;/p&gt;\n\n&lt;p&gt;You should also look into how to protect your identity. Make sure there is no way she can take out a loan, get a credit card in your name, or access your bank account.&lt;/p&gt;\n\n&lt;p&gt;Another thing you should consider doing is getting security cameras. It will allow you to see if she is stalking your home and provide proof if she damages anything. If your mailbox doesn&amp;#39;t lock, you should try to get one that does. Never leave your doors unlocked, even when you are home.&lt;/p&gt;\n\n&lt;p&gt;I know some of this sounds extreme, but you said that ignoring her made her escalate her abuse. She is clearly not rational, and taking more steps to protect yourself could push her to do more. Definitely don&amp;#39;t use that as a reason to not get a restraining order, but it is a good idea to take additional steps to protect yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcay8f", "score_hidden": false, "stickied": false, "created": 1492392697.0, "created_utc": 1492363897.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgc8k03", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "blueWidow", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She's fixated on you and it doesnt require much stimulus from you to make this so. So i would focus on fixing that as well as the main comments made to you. Change your phone number. Collect all data. Get set to submit a restraining order some time if you need to. But i would also stop giving information to your family about her or about you because we dont know what's getting to her. Lock down your social profiles. Be a very gray rock. She's mentally unwell and she really needs to see a professional. ", "edited": 1492361597.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s fixated on you and it doesnt require much stimulus from you to make this so. So i would focus on fixing that as well as the main comments made to you. Change your phone number. Collect all data. Get set to submit a restraining order some time if you need to. But i would also stop giving information to your family about her or about you because we dont know what&amp;#39;s getting to her. Lock down your social profiles. Be a very gray rock. She&amp;#39;s mentally unwell and she really needs to see a professional. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgc8k03", "score_hidden": false, "stickied": false, "created": 1492389577.0, "created_utc": 1492360777.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgbtjyr", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "SurelyGoing2Hell", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; The country I'm from, blocking a number is not an easy task.\n\nOf course it's an easy task. Most modern phones block numbers internally.  You can just route calls with her ID or no caller ID to voicemail.\n\nAlso are you living with her? At 34 you should live with someone else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The country I&amp;#39;m from, blocking a number is not an easy task.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Of course it&amp;#39;s an easy task. Most modern phones block numbers internally.  You can just route calls with her ID or no caller ID to voicemail.&lt;/p&gt;\n\n&lt;p&gt;Also are you living with her? At 34 you should live with someone else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgbtjyr", "score_hidden": false, "stickied": false, "created": 1492356770.0, "created_utc": 1492327970.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgcdrlh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "evilheartemote", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "In terms of blocking her number - if you have an Android phone I think you can do it in contacts. I'm not sure about iOS, but basically all modern cellphones have a way to do so. Often it means that calls go straight to voicemail and texts are still received but archived and hidden.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In terms of blocking her number - if you have an Android phone I think you can do it in contacts. I&amp;#39;m not sure about iOS, but basically all modern cellphones have a way to do so. Often it means that calls go straight to voicemail and texts are still received but archived and hidden.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcdrlh", "score_hidden": false, "stickied": false, "created": 1492396435.0, "created_utc": 1492367635.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgcx3j6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rifrif", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "you can also privatize your facebook profile so you arent even findable apparently. I dont know how to do it, but my boyfriends page wasnt even findable until he added me as a friend. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you can also privatize your facebook profile so you arent even findable apparently. I dont know how to do it, but my boyfriends page wasnt even findable until he added me as a friend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcx3j6", "score_hidden": true, "stickied": false, "created": 1492422109.0, "created_utc": 1492393309.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgd2qd5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kingkept", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Dont give her chances or go easy because she's your twin.\n\nIf it was a friend that went crazy or a stranger you would have gone to the police ages ago.\n\nShe shouldn't get to harass you to this degree and get away with it. \n\n\n\nI'm a twin and me and my brother have gotten into pretty severe disagreements because we would frequently tolerate extremely disrespectful behaviors amongst/to each other because we always thought we were \"family\" and connected deeply in some way as if that made it ok. It wasn't heathy for either of us. \n\nYou aren't doing yourself or your sister any favors by letting her get away with harassing you. You need to go to the police for both your sakes.       ", "edited": 1492402637.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dont give her chances or go easy because she&amp;#39;s your twin.&lt;/p&gt;\n\n&lt;p&gt;If it was a friend that went crazy or a stranger you would have gone to the police ages ago.&lt;/p&gt;\n\n&lt;p&gt;She shouldn&amp;#39;t get to harass you to this degree and get away with it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a twin and me and my brother have gotten into pretty severe disagreements because we would frequently tolerate extremely disrespectful behaviors amongst/to each other because we always thought we were &amp;quot;family&amp;quot; and connected deeply in some way as if that made it ok. It wasn&amp;#39;t heathy for either of us. &lt;/p&gt;\n\n&lt;p&gt;You aren&amp;#39;t doing yourself or your sister any favors by letting her get away with harassing you. You need to go to the police for both your sakes.       &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd2qd5", "score_hidden": true, "stickied": false, "created": 1492430170.0, "created_utc": 1492401370.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65n06h", "likes": null, "replies": "", "user_reports": [], "id": "dgd7v82", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Orac1971", "parent_id": "t3_65n06h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Why cant you block her number? On my iPhone the option to do that is next to the add to favourite and share contact tabs, pretty sure android would be the same.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why cant you block her number? On my iPhone the option to do that is next to the add to favourite and share contact tabs, pretty sure android would be the same.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd7v82", "score_hidden": true, "stickied": false, "created": 1492440217.0, "created_utc": 1492411417.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]