[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi Reddit. Sorry if this is a little rambly or all over the place - I just need a bit of advice!&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s not really one specific example that lends itself to my question so I&amp;#39;m going to have to be a bit more general - please ask me any follow up questions needed :)&lt;/p&gt;\n\n&lt;p&gt;To start, it&amp;#39;s important to note my physical stature as I think it&amp;#39;s part of the problem. I&amp;#39;m just under 6&amp;#39;2&amp;quot; and about 165lbs - so obviously VERY tall and not waif-thin either. I work out and like to think I could, I don&amp;#39;t know, fight back if I were getting mugged or stop an armed bank robber with my bare hands or something (joking, obviously). The point is that I &amp;#39;m a pretty big girl so I think this is adding to my problem.&lt;/p&gt;\n\n&lt;p&gt;Basically, the problem is that the guys I talk to all start to see me as &amp;quot;one of the guys&amp;quot; within a month or two of dating. Now I know this isn&amp;#39;t an overarching &amp;quot;kiss of death&amp;quot; in every relationship, but in my experience it has been. The guy will stop putting literally any effort in, and I&amp;#39;ll have to plan 100% of everything if, for example, I want to eat something besides leftover Jack in the Box tacos that have been in his refrigerator for lord knows how long. That&amp;#39;s a REAL example, and it happened not a month after that exact same guy had been planning gorgeous dates for us to trendy restaurants. And I had paid for half of the bill on all of our dates! It&amp;#39;s not like I was asking him to pick up some huge financial burden. I had planned dates for us too, but when it was &amp;quot;his turn&amp;quot;, the nights changed from romantic candlelit dinners to doing literally nothing in his living room real fast.&lt;/p&gt;\n\n&lt;p&gt;Another example is hanging out watching movies/tv - at the beginning of a new relationship it will be romcoms and cute things that we can snuggle to, but inevitably within a month once the guy sees me as &amp;quot;one of the bros&amp;quot; it becomes South Park reruns or even me watching him play video games. I&amp;#39;ll put up a fight and ask to watch a romcom/something more romantic, and be met with &amp;quot;but you love South Park!&amp;quot; And I&amp;#39;m like &amp;quot;ugh I totally regret telling you that - yes I love South Park when I&amp;#39;m at home high as balls eating Cheetos in my underwear, but we just started talked literally 4 weeks ago so do you think we can put the old married couple thing on hold for a little?!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The truth is that I AM kind of one of the guys within my friend group, which is pretty evenly split gender-wise. I&amp;#39;ll get invited to stuff that the other girls don&amp;#39;t get invited to - e.g. watching the NCAA championship most recently - because I actually love watching sports, whereas the other girls would have been bored outta their gourds (they were glad they weren&amp;#39;t invited haha). But when I&amp;#39;m talking to a new guy romantically, I don&amp;#39;t want to be one of the bros! I want a little romance! I totally understand that it goes both ways and I definitely do my fair share of romancing too, but it&amp;#39;s just so frustrating when I&amp;#39;ve been talking to a guy for 5-6 weeks and he&amp;#39;ll invite me over and when I show up (with makeup and hair done - cause ya know we&amp;#39;re newly talking) he&amp;#39;s wearing stained basketball shorts and a torn t-shirt and he hasn&amp;#39;t showered in 3 days. I&amp;#39;m like ooooookay I guess we&amp;#39;re not going anywhere today...&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know. Am I being unreasonable? This has happened to me like 8 or 10 times in the last 2 years so it&amp;#39;s gotta be something I&amp;#39;m doing. My girlfriends (who I&amp;#39;m fairly sure I&amp;#39;m on the same level with appearance-wise at least) have these guys who bring them flowers and take them on little trips and do weekly date nights. I somehow keep finding these guys that just want to treat me like I&amp;#39;m one of the homies! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really not asking to be swept off my feet but just a little effort for more than 4 weeks would be nice. I see people on here saying the &amp;quot;honeymoon period&amp;quot; lasts for the first year or so, and I&amp;#39;m like - I don&amp;#39;t even know how to make it last longer than 30 days! I&amp;#39;m really chill personality-wise but do I need to start faking it a little bit to get guys to see me as more girly? I wear acrylic nails, have eyelash extensions, dress mostly feminine - I&amp;#39;m not giving off some total tomboy vibe here. I just also happen to love camping, hiking, lifting, sports, cars to some extent...do I need to hide that kind of stuff early on to come across more girly? It really is getting frustrating and I feel awful because I&amp;#39;ve had to break it off with literally at least 8 guys in the last couple years because once the romance is gone I&amp;#39;m totally checked out. There&amp;#39;s only so much one-sided effort I can put in.&lt;/p&gt;\n\n&lt;p&gt;To note: MANY of these guys have reached out to me after I broke it off wanting to rekindle/meet back up, so I&amp;#39;m fairly certain it&amp;#39;s not a lack of attraction. They literally just start seeing me as a bro and forget that we&amp;#39;re newly dating and that there needs to be some effort on both sides.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: I&amp;#39;m into some stereotypically &amp;quot;masculine&amp;quot; things but am otherwise fairly feminine. I keep getting into short-term relationships with guys who stop putting romantic effort in the moment they realize I&amp;#39;m not extremely &amp;quot;girly&amp;quot; or high maintenance, opting for chill nights over date nights 95% of the time. I&amp;#39;m fine with a chill relationship but this happens to me within 4 weeks every time. How do I stop the pattern?! I&amp;#39;d like to be treated like a romantic partner rather than a bro at least for a while longer!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi Reddit. Sorry if this is a little rambly or all over the place - I just need a bit of advice!\n\nThere's not really one specific example that lends itself to my question so I'm going to have to be a bit more general - please ask me any follow up questions needed :)\n\nTo start, it's important to note my physical stature as I think it's part of the problem. I'm just under 6'2\" and about 165lbs - so obviously VERY tall and not waif-thin either. I work out and like to think I could, I don't know, fight back if I were getting mugged or stop an armed bank robber with my bare hands or something (joking, obviously). The point is that I 'm a pretty big girl so I think this is adding to my problem.\n\nBasically, the problem is that the guys I talk to all start to see me as \"one of the guys\" within a month or two of dating. Now I know this isn't an overarching \"kiss of death\" in every relationship, but in my experience it has been. The guy will stop putting literally any effort in, and I'll have to plan 100% of everything if, for example, I want to eat something besides leftover Jack in the Box tacos that have been in his refrigerator for lord knows how long. That's a REAL example, and it happened not a month after that exact same guy had been planning gorgeous dates for us to trendy restaurants. And I had paid for half of the bill on all of our dates! It's not like I was asking him to pick up some huge financial burden. I had planned dates for us too, but when it was \"his turn\", the nights changed from romantic candlelit dinners to doing literally nothing in his living room real fast.\n\nAnother example is hanging out watching movies/tv - at the beginning of a new relationship it will be romcoms and cute things that we can snuggle to, but inevitably within a month once the guy sees me as \"one of the bros\" it becomes South Park reruns or even me watching him play video games. I'll put up a fight and ask to watch a romcom/something more romantic, and be met with \"but you love South Park!\" And I'm like \"ugh I totally regret telling you that - yes I love South Park when I'm at home high as balls eating Cheetos in my underwear, but we just started talked literally 4 weeks ago so do you think we can put the old married couple thing on hold for a little?!\" \n\nThe truth is that I AM kind of one of the guys within my friend group, which is pretty evenly split gender-wise. I'll get invited to stuff that the other girls don't get invited to - e.g. watching the NCAA championship most recently - because I actually love watching sports, whereas the other girls would have been bored outta their gourds (they were glad they weren't invited haha). But when I'm talking to a new guy romantically, I don't want to be one of the bros! I want a little romance! I totally understand that it goes both ways and I definitely do my fair share of romancing too, but it's just so frustrating when I've been talking to a guy for 5-6 weeks and he'll invite me over and when I show up (with makeup and hair done - cause ya know we're newly talking) he's wearing stained basketball shorts and a torn t-shirt and he hasn't showered in 3 days. I'm like ooooookay I guess we're not going anywhere today...\n\nI don't know. Am I being unreasonable? This has happened to me like 8 or 10 times in the last 2 years so it's gotta be something I'm doing. My girlfriends (who I'm fairly sure I'm on the same level with appearance-wise at least) have these guys who bring them flowers and take them on little trips and do weekly date nights. I somehow keep finding these guys that just want to treat me like I'm one of the homies! \n\nI'm really not asking to be swept off my feet but just a little effort for more than 4 weeks would be nice. I see people on here saying the \"honeymoon period\" lasts for the first year or so, and I'm like - I don't even know how to make it last longer than 30 days! I'm really chill personality-wise but do I need to start faking it a little bit to get guys to see me as more girly? I wear acrylic nails, have eyelash extensions, dress mostly feminine - I'm not giving off some total tomboy vibe here. I just also happen to love camping, hiking, lifting, sports, cars to some extent...do I need to hide that kind of stuff early on to come across more girly? It really is getting frustrating and I feel awful because I've had to break it off with literally at least 8 guys in the last couple years because once the romance is gone I'm totally checked out. There's only so much one-sided effort I can put in.\n\nTo note: MANY of these guys have reached out to me after I broke it off wanting to rekindle/meet back up, so I'm fairly certain it's not a lack of attraction. They literally just start seeing me as a bro and forget that we're newly dating and that there needs to be some effort on both sides.\n  \n  ---   \n  **tl;dr**: I'm into some stereotypically \"masculine\" things but am otherwise fairly feminine. I keep getting into short-term relationships with guys who stop putting romantic effort in the moment they realize I'm not extremely \"girly\" or high maintenance, opting for chill nights over date nights 95% of the time. I'm fine with a chill relationship but this happens to me within 4 weeks every time. How do I stop the pattern?! I'd like to be treated like a romantic partner rather than a bro at least for a while longer!", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Personal issues", "id": "65sgu7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 80, "report_reasons": null, "author": "tomboynomore", "saved": false, "mod_reports": [], "name": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-io personal", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65sgu7/me_23f_with_pretty_much_all_the_men_ive_seen/", "num_reports": null, "locked": false, "stickied": false, "created": 1492418250.0, "url": "https://www.reddit.com/r/relationships/comments/65sgu7/me_23f_with_pretty_much_all_the_men_ive_seen/", "author_flair_text": null, "quarantine": false, "title": "Me [23F] with pretty much all the men I've seen within the last 2 years [23-28M] - I want to stop being seen as one of the guys! Help!", "created_utc": 1492389450.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 32, "visited": false, "subreddit_type": "public", "ups": 80}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgd2kq8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Grasshopperontheroad", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Others have hit on the more assertive part, but I'm going to hit on another thing.\n\nDon't make plans...unless there is A PLAN. \n\nLike, don't let a dude say \"wanna hang thursday?\" And then show up on Thursday with your own idea of what you're going to do that night, because you will always be disappointed.\n\nDating is about figuring out expectations. If he says \"wanna hang Thursday?\" You say \"what are we doing?/what would you like to do? where are we going?\" And then you have a back and forth to figure out what sounds best to both of you. If he suggest hang at home with take out **then before you ever even show up** you can say \"no id rather go out\" or \"how about dinner out, movie at home\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Others have hit on the more assertive part, but I&amp;#39;m going to hit on another thing.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t make plans...unless there is A PLAN. &lt;/p&gt;\n\n&lt;p&gt;Like, don&amp;#39;t let a dude say &amp;quot;wanna hang thursday?&amp;quot; And then show up on Thursday with your own idea of what you&amp;#39;re going to do that night, because you will always be disappointed.&lt;/p&gt;\n\n&lt;p&gt;Dating is about figuring out expectations. If he says &amp;quot;wanna hang Thursday?&amp;quot; You say &amp;quot;what are we doing?/what would you like to do? where are we going?&amp;quot; And then you have a back and forth to figure out what sounds best to both of you. If he suggest hang at home with take out &lt;strong&gt;then before you ever even show up&lt;/strong&gt; you can say &amp;quot;no id rather go out&amp;quot; or &amp;quot;how about dinner out, movie at home&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd2kq8", "score_hidden": true, "stickied": false, "created": 1492429917.0, "created_utc": 1492401117.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgd3gup", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Wubbalubbadubbitydo", "parent_id": "t1_dgcyonm", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So when my husband and I first met we were freshman in college. Not dating, just fooling around. He use to show up to my dorm room not having showered or brushed his teeth, ready to spend the night. Mind you, he knows better, he was raised better than that. I called his ass out. Told him he cannot spend the night unless he took a towel and my caddy to go shower and brush his teeth. We didn't start actually dating till a few years later. The standard still stood. Be direct, not mean, but direct. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So when my husband and I first met we were freshman in college. Not dating, just fooling around. He use to show up to my dorm room not having showered or brushed his teeth, ready to spend the night. Mind you, he knows better, he was raised better than that. I called his ass out. Told him he cannot spend the night unless he took a towel and my caddy to go shower and brush his teeth. We didn&amp;#39;t start actually dating till a few years later. The standard still stood. Be direct, not mean, but direct. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd3gup", "score_hidden": true, "stickied": false, "created": 1492431375.0, "created_utc": 1492402575.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgd3ftm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OpusSectile", "parent_id": "t1_dgcyonm", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It may be a usual way of acting, a tendency in the personality of those you are dating - not something you are doing and therefore can change to have a different response. It may not be you. Or tell them outright if it means a lot to you, until you meet someone who can treat you as you would want to be treated by the person you spend the most time with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It may be a usual way of acting, a tendency in the personality of those you are dating - not something you are doing and therefore can change to have a different response. It may not be you. Or tell them outright if it means a lot to you, until you meet someone who can treat you as you would want to be treated by the person you spend the most time with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd3ftm", "score_hidden": true, "stickied": false, "created": 1492431326.0, "created_utc": 1492402526.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyonm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tomboynomore", "parent_id": "t1_dgcv03n", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks, you're totally right. Usually once this starts to happen is when the switch in my brain flips and I start to be less attracted to them, and there's usually only a few weeks left before I break things off. I guess I'm more looking for some advice on how to not let it happen in the first place, but you're totally right that when it does I need to be more assertive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, you&amp;#39;re totally right. Usually once this starts to happen is when the switch in my brain flips and I start to be less attracted to them, and there&amp;#39;s usually only a few weeks left before I break things off. I guess I&amp;#39;m more looking for some advice on how to not let it happen in the first place, but you&amp;#39;re totally right that when it does I need to be more assertive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcyonm", "score_hidden": true, "stickied": false, "created": 1492424324.0, "created_utc": 1492395524.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv03n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cnotesayswhat", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;it's just so frustrating when I've been talking to a guy for 5-6 weeks and he'll invite me over and when I show up (with makeup and hair done - cause ya know we're newly talking) he's wearing stained basketball shorts and a torn t-shirt and he hasn't showered in 3 days. I'm like ooooookay I guess we're not going anywhere today...\n\nYou need to advocate for yourself and call this shit out. If you show up for a date and your boyfriend looks homeless, don't just resign yourself to having a shlubby night in. Tell him to take a freaking shower and put some clean clothes on. \n\nThe reason you keep getting treated like one of the guys isn't because of your physique or your interests, but because you tolerate it. You sound way too willing to just roll over when your needs aren't getting met. Work on asserting yourself with your dates and the problem will resolve itself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;it&amp;#39;s just so frustrating when I&amp;#39;ve been talking to a guy for 5-6 weeks and he&amp;#39;ll invite me over and when I show up (with makeup and hair done - cause ya know we&amp;#39;re newly talking) he&amp;#39;s wearing stained basketball shorts and a torn t-shirt and he hasn&amp;#39;t showered in 3 days. I&amp;#39;m like ooooookay I guess we&amp;#39;re not going anywhere today...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You need to advocate for yourself and call this shit out. If you show up for a date and your boyfriend looks homeless, don&amp;#39;t just resign yourself to having a shlubby night in. Tell him to take a freaking shower and put some clean clothes on. &lt;/p&gt;\n\n&lt;p&gt;The reason you keep getting treated like one of the guys isn&amp;#39;t because of your physique or your interests, but because you tolerate it. You sound way too willing to just roll over when your needs aren&amp;#39;t getting met. Work on asserting yourself with your dates and the problem will resolve itself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcv03n", "score_hidden": true, "stickied": false, "created": 1492419391.0, "created_utc": 1492390591.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdfce7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Yay_Rabies", "parent_id": "t1_dgd3op5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP read this!\nYou and I are very similar and it comes down to the guys you are dating.  I have a hunch that the taco leftovers guy was trying to end it but was too afraid to just outright break up.  \nAs for the South Park guy, do you actually like Rom Coms or do you just associate them with dating?  I ask because it's ok to do \"non girly\" or stereotypical things while on a date.  My husbands ideas for dates have included fishing, hiking, beach kayaking and paintball.  I love it.  We both enjoy those things so why can't they be dates?  \nHeck we both love the Alien franchise so I took him on a dressed up movie date to see Prometheus.  Have you ever been on a date where two grown men behind you scream while the girl in front of you sobs?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP read this!\nYou and I are very similar and it comes down to the guys you are dating.  I have a hunch that the taco leftovers guy was trying to end it but was too afraid to just outright break up.&lt;br/&gt;\nAs for the South Park guy, do you actually like Rom Coms or do you just associate them with dating?  I ask because it&amp;#39;s ok to do &amp;quot;non girly&amp;quot; or stereotypical things while on a date.  My husbands ideas for dates have included fishing, hiking, beach kayaking and paintball.  I love it.  We both enjoy those things so why can&amp;#39;t they be dates?&lt;br/&gt;\nHeck we both love the Alien franchise so I took him on a dressed up movie date to see Prometheus.  Have you ever been on a date where two grown men behind you scream while the girl in front of you sobs?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdfce7", "score_hidden": true, "stickied": false, "created": 1492461484.0, "created_utc": 1492432684.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdelpv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shuzuko", "parent_id": "t1_dgdd62g", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That's how you tag someone to \"notify\" them. It's an easy way to make sure they see something that they might otherwise miss.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s how you tag someone to &amp;quot;notify&amp;quot; them. It&amp;#39;s an easy way to make sure they see something that they might otherwise miss.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdelpv", "score_hidden": true, "stickied": false, "created": 1492459995.0, "created_utc": 1492431195.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdd62g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SomeQaz", "parent_id": "t1_dgdcglz", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Wrong link? Because that one just links to OP...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wrong link? Because that one just links to OP...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdd62g", "score_hidden": true, "stickied": false, "created": 1492456531.0, "created_utc": 1492427731.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcglz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Andre_Johansson", "parent_id": "t1_dgd3op5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "/u/tomboynomore\n\nRead this! \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/tomboynomore\"&gt;/u/tomboynomore&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Read this! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdcglz", "score_hidden": true, "stickied": false, "created": 1492454454.0, "created_utc": 1492425654.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdhsb7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greeneyedwench", "parent_id": "t1_dgd3op5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah, this--I've also had a lot of relationships drift this way, and I'm not a tomboy by any means. I think a lot of people of any gender are just kind of lazy and/or kind of broke and tend to default to couch dates because they're easy and cheap.\n\n(Even if going dutch. I think part of why this happens to me is that a lot of times, the guy and I are *both* kind of broke, and so we look at how much disposable cash we can pool together and it's about enough for some beer and ice cream, haha.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, this--I&amp;#39;ve also had a lot of relationships drift this way, and I&amp;#39;m not a tomboy by any means. I think a lot of people of any gender are just kind of lazy and/or kind of broke and tend to default to couch dates because they&amp;#39;re easy and cheap.&lt;/p&gt;\n\n&lt;p&gt;(Even if going dutch. I think part of why this happens to me is that a lot of times, the guy and I are &lt;em&gt;both&lt;/em&gt; kind of broke, and so we look at how much disposable cash we can pool together and it&amp;#39;s about enough for some beer and ice cream, haha.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdhsb7", "score_hidden": true, "stickied": false, "created": 1492465619.0, "created_utc": 1492436819.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdiztf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DerNubenfrieken", "parent_id": "t1_dgd3op5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; honestly, it sounds like these problems are just the guys you date.\n\nSeriously. I take my girlfriend out to eat or cook her food all the time. But I'm not doing that because I feel like I have to or to \"impress her\" or anything, its because I love cooking and trying new food places. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;honestly, it sounds like these problems are just the guys you date.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Seriously. I take my girlfriend out to eat or cook her food all the time. But I&amp;#39;m not doing that because I feel like I have to or to &amp;quot;impress her&amp;quot; or anything, its because I love cooking and trying new food places. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdiztf", "score_hidden": true, "stickied": false, "created": 1492467371.0, "created_utc": 1492438571.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3op5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheCheshireKitten", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "honestly, it sounds like these problems are just the guys you date. did any of them straight up say you're one of the guys? I know a lot of girls who play video games, watch sports, hardly wear makeup, and they are still considered women. if a guy likes a girl enough to date her, he doesn't see her as one of the guys.\n\nit's easy for people to blame failure in relationships on something they are self conscious about. guys blame stuff on the size of their dicks and height all of the time. most of the time, it is another factor, as people who are bothered by things like that will either obsess over it or not date the person in the first place. my advice is to be careful about blaming not so great relationships on your height or interests as this is a good way to gain a complex and may effect future relationships via self fulfilling prophesies ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;honestly, it sounds like these problems are just the guys you date. did any of them straight up say you&amp;#39;re one of the guys? I know a lot of girls who play video games, watch sports, hardly wear makeup, and they are still considered women. if a guy likes a girl enough to date her, he doesn&amp;#39;t see her as one of the guys.&lt;/p&gt;\n\n&lt;p&gt;it&amp;#39;s easy for people to blame failure in relationships on something they are self conscious about. guys blame stuff on the size of their dicks and height all of the time. most of the time, it is another factor, as people who are bothered by things like that will either obsess over it or not date the person in the first place. my advice is to be careful about blaming not so great relationships on your height or interests as this is a good way to gain a complex and may effect future relationships via self fulfilling prophesies &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd3op5", "score_hidden": true, "stickied": false, "created": 1492431743.0, "created_utc": 1492402943.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdakgr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mintycan", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; it's just so frustrating when I've been talking to a guy for 5-6 weeks and he'll invite me over and when I show up (with makeup and hair done - cause ya know we're newly talking) he's wearing stained basketball shorts and a torn t-shirt and he hasn't showered in 3 days. I'm like ooooookay I guess we're not going anywhere today...\n\nDid you tell the guy beforehand that you wanted to go out? Cause if I invite you to my house, I invite you to my house, not to a restaurant.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;it&amp;#39;s just so frustrating when I&amp;#39;ve been talking to a guy for 5-6 weeks and he&amp;#39;ll invite me over and when I show up (with makeup and hair done - cause ya know we&amp;#39;re newly talking) he&amp;#39;s wearing stained basketball shorts and a torn t-shirt and he hasn&amp;#39;t showered in 3 days. I&amp;#39;m like ooooookay I guess we&amp;#39;re not going anywhere today...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Did you tell the guy beforehand that you wanted to go out? Cause if I invite you to my house, I invite you to my house, not to a restaurant.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdakgr", "score_hidden": true, "stickied": false, "created": 1492448065.0, "created_utc": 1492419265.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgcywem", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pandatweet", "parent_id": "t1_dgcyqap", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": " Relationships should be a discovery. Play some cards close to your chest. Reveal them slowly, when least expected. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Relationships should be a discovery. Play some cards close to your chest. Reveal them slowly, when least expected. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcywem", "score_hidden": true, "stickied": false, "created": 1492424623.0, "created_utc": 1492395823.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyqap", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tomboynomore", "parent_id": "t1_dgcw72g", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you! Your advice is spot on. I definitely do too much too early and they get comfortable/lazy. I'll work on taking your words to heart!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! Your advice is spot on. I definitely do too much too early and they get comfortable/lazy. I&amp;#39;ll work on taking your words to heart!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcyqap", "score_hidden": true, "stickied": false, "created": 1492424390.0, "created_utc": 1492395590.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcw72g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pandatweet", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I don't think they see you as one of the guys. I think you're just dating lazy men. \n\nAre you very giving from the get go?  If so, that's your problem. Make a guy earn it. Actually, anyone new in your life, be it platonic or romantic, should earn your favour. This thing about \"benefit of the doubt\"? Worst. Idea. Ever. That just makes you prime pickings for exploitation. Always treat people with kindness and respect, but don't go out of your way straight away. \n\nI suffered from the same problem. It leads to being taken advantage of. Set a minimum standard and if it's not being upheld, then bounce them. Do nice things but dont give it away all the time.\n\nI have a lot of less \"girly\" interests. Action movies, heavy metal music festivals, adventure travel. I never have a problem being treated like a girl anymore.", "edited": 1492392479.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think they see you as one of the guys. I think you&amp;#39;re just dating lazy men. &lt;/p&gt;\n\n&lt;p&gt;Are you very giving from the get go?  If so, that&amp;#39;s your problem. Make a guy earn it. Actually, anyone new in your life, be it platonic or romantic, should earn your favour. This thing about &amp;quot;benefit of the doubt&amp;quot;? Worst. Idea. Ever. That just makes you prime pickings for exploitation. Always treat people with kindness and respect, but don&amp;#39;t go out of your way straight away. &lt;/p&gt;\n\n&lt;p&gt;I suffered from the same problem. It leads to being taken advantage of. Set a minimum standard and if it&amp;#39;s not being upheld, then bounce them. Do nice things but dont give it away all the time.&lt;/p&gt;\n\n&lt;p&gt;I have a lot of less &amp;quot;girly&amp;quot; interests. Action movies, heavy metal music festivals, adventure travel. I never have a problem being treated like a girl anymore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcw72g", "score_hidden": true, "stickied": false, "created": 1492420925.0, "created_utc": 1492392125.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgd6820", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rebelo86", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've been one of the guys for years. I love soccer, played hockey, and drink beer. It could be the guys your age that are the problem. They think they've won after a month and you're going to hang around. It could be advocating for yourself. I've never been sad to ask for what I want from a relationship. Either we talk and find a compromise or it ends. The more honest you are about your needs and desires, the more successful you'll become in dating. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been one of the guys for years. I love soccer, played hockey, and drink beer. It could be the guys your age that are the problem. They think they&amp;#39;ve won after a month and you&amp;#39;re going to hang around. It could be advocating for yourself. I&amp;#39;ve never been sad to ask for what I want from a relationship. Either we talk and find a compromise or it ends. The more honest you are about your needs and desires, the more successful you&amp;#39;ll become in dating. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd6820", "score_hidden": true, "stickied": false, "created": 1492436597.0, "created_utc": 1492407797.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgd566f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pekes86", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Agree with the others - I don't think this has anything to do with your height or preferences at all, but you're chalking it up to that because you're aware of those things. If you want effort and romance, communicate that. I also move quickly onto gaming and pizza nights in, but I love those things so idm. We also do date type things on occasion but the effort is annoying for me too. If they think you're happy with what you're doing, nothing will change. Just tell them you'd love to go out and get dressed up and do a romantic night etc. If you don't ask they won't know!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agree with the others - I don&amp;#39;t think this has anything to do with your height or preferences at all, but you&amp;#39;re chalking it up to that because you&amp;#39;re aware of those things. If you want effort and romance, communicate that. I also move quickly onto gaming and pizza nights in, but I love those things so idm. We also do date type things on occasion but the effort is annoying for me too. If they think you&amp;#39;re happy with what you&amp;#39;re doing, nothing will change. Just tell them you&amp;#39;d love to go out and get dressed up and do a romantic night etc. If you don&amp;#39;t ask they won&amp;#39;t know!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd566f", "score_hidden": true, "stickied": false, "created": 1492434453.0, "created_utc": 1492405653.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgcv1nb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Usrname52", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm not sure how eating leftovers or watching reruns makes you one of the guys.\n\nIt means he is comfortable with you, and it's what he enjoys doing. Has nothing to do with gender and what type of nails you have. \n\n\nTalk to a guy and tell him what you enjoy doing. Find a guy who enjoys doing the same things. There are people (of any gender) who enjoy sitting around and watching TV and playing video games.  \n\n\nYou spend this entire post talking about what you DON'T LIKE guys doing. Not what you want to do. It's not a gender thing--sounds like you just find schlubby guys who are interested in sitting around. What do you want them to do? Meet guys. Tell them you want to go out and do things. Hike? Out to dinner? Volunteering? Picnic in the park? Drinks at a bar? Whatever. If the guys aren't interested in those things, then they aren't treating you like \"one of the guys,\" they just don't want to go out.\n\nGo to meetups and meet people with similar interests. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure how eating leftovers or watching reruns makes you one of the guys.&lt;/p&gt;\n\n&lt;p&gt;It means he is comfortable with you, and it&amp;#39;s what he enjoys doing. Has nothing to do with gender and what type of nails you have. &lt;/p&gt;\n\n&lt;p&gt;Talk to a guy and tell him what you enjoy doing. Find a guy who enjoys doing the same things. There are people (of any gender) who enjoy sitting around and watching TV and playing video games.  &lt;/p&gt;\n\n&lt;p&gt;You spend this entire post talking about what you DON&amp;#39;T LIKE guys doing. Not what you want to do. It&amp;#39;s not a gender thing--sounds like you just find schlubby guys who are interested in sitting around. What do you want them to do? Meet guys. Tell them you want to go out and do things. Hike? Out to dinner? Volunteering? Picnic in the park? Drinks at a bar? Whatever. If the guys aren&amp;#39;t interested in those things, then they aren&amp;#39;t treating you like &amp;quot;one of the guys,&amp;quot; they just don&amp;#39;t want to go out.&lt;/p&gt;\n\n&lt;p&gt;Go to meetups and meet people with similar interests. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgcv1nb", "score_hidden": true, "stickied": false, "created": 1492419448.0, "created_utc": 1492390648.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdea50", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MrsValentine", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I don't necessarily think this happens to you because they see you as one of the guys. This has happened pretty frequently to me too, and I most definitely am not in the boy's club. I'm like blonde, nails done, eyelashes done, love cooking, sewing, knitting, shopping, going out, rubbish at sports...basically my interests are stereotypically feminine.\n\nI always just saw it as a symptom of them getting too comfortable in the relationship. Getting complacent. They've got you, so no need to try impress anymore. Possibly me just continually the sort of guy that's ok to sit there watching films in slobby clothes for the rest of his life? Idk. I always make it clear at the beginning that I like to go out and do things regularly.\n\nI haven't really found a way to fix the issue with a specific person. Obviously you can't force anyone out of their comfort zone. Just a matter of moving on and seeing who else comes along.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t necessarily think this happens to you because they see you as one of the guys. This has happened pretty frequently to me too, and I most definitely am not in the boy&amp;#39;s club. I&amp;#39;m like blonde, nails done, eyelashes done, love cooking, sewing, knitting, shopping, going out, rubbish at sports...basically my interests are stereotypically feminine.&lt;/p&gt;\n\n&lt;p&gt;I always just saw it as a symptom of them getting too comfortable in the relationship. Getting complacent. They&amp;#39;ve got you, so no need to try impress anymore. Possibly me just continually the sort of guy that&amp;#39;s ok to sit there watching films in slobby clothes for the rest of his life? Idk. I always make it clear at the beginning that I like to go out and do things regularly.&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t really found a way to fix the issue with a specific person. Obviously you can&amp;#39;t force anyone out of their comfort zone. Just a matter of moving on and seeing who else comes along.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdea50", "score_hidden": true, "stickied": false, "created": 1492459279.0, "created_utc": 1492430479.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgd9ldd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nikkithebee", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I feel your pain here. I watch hockey and baseball, I drink beer, I play video games, smoke cigars, legpress 450lbs, know more about whisk(e)y than 95% of people I know... But I also clean up real nice, love doing makeup, own more shoes than anyone should, have over 250 different nail polish colors. I was having a lot of the same troubles until my current guy came along. \n\nHe's stylish, takes care of himself, has lots of gay male friends, loves to shop, owns more shoes than anyone should, gets manicures and pedicures... But he also is extremely handy, is outdoorsy, owns a hatchet or two \"just in case,\" has a dream car, can do a touch of self taught electrical work, drinks just as much whiskey as I do. He just happens to be a straight dude who's crazy comfortable in his skin and doesn't mind my masculine tendencies! \n\nI'm not saying that it's necessary for you to go out and find a guy who is *exactly* like mine. Granted, it would probably be lovely for you to find a foil like I have; we complete each other in ways I didn't even know someone could! What I think you truly need, though, focuses more around the last bit: he's comfortable with himself (read: *mature*). The guy you date needs to be mature enough to recognize how to treat a partner appropriately and to respond to your concerns. If you say \"hey can we not be like an old couple so soon\" he needs to listen and respond in a way that benefits the relationship. I don't think you should have to fake it or change who you are, you just need to find someone who really likes all the things you are... Including the fact that you're a *fancy lady* who likes being treated as such. \n\nThe point is that fancy ladies can lift and go hiking and watch sports, they just need a partner who is grown up enough to recognize it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel your pain here. I watch hockey and baseball, I drink beer, I play video games, smoke cigars, legpress 450lbs, know more about whisk(e)y than 95% of people I know... But I also clean up real nice, love doing makeup, own more shoes than anyone should, have over 250 different nail polish colors. I was having a lot of the same troubles until my current guy came along. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s stylish, takes care of himself, has lots of gay male friends, loves to shop, owns more shoes than anyone should, gets manicures and pedicures... But he also is extremely handy, is outdoorsy, owns a hatchet or two &amp;quot;just in case,&amp;quot; has a dream car, can do a touch of self taught electrical work, drinks just as much whiskey as I do. He just happens to be a straight dude who&amp;#39;s crazy comfortable in his skin and doesn&amp;#39;t mind my masculine tendencies! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying that it&amp;#39;s necessary for you to go out and find a guy who is &lt;em&gt;exactly&lt;/em&gt; like mine. Granted, it would probably be lovely for you to find a foil like I have; we complete each other in ways I didn&amp;#39;t even know someone could! What I think you truly need, though, focuses more around the last bit: he&amp;#39;s comfortable with himself (read: &lt;em&gt;mature&lt;/em&gt;). The guy you date needs to be mature enough to recognize how to treat a partner appropriately and to respond to your concerns. If you say &amp;quot;hey can we not be like an old couple so soon&amp;quot; he needs to listen and respond in a way that benefits the relationship. I don&amp;#39;t think you should have to fake it or change who you are, you just need to find someone who really likes all the things you are... Including the fact that you&amp;#39;re a &lt;em&gt;fancy lady&lt;/em&gt; who likes being treated as such. &lt;/p&gt;\n\n&lt;p&gt;The point is that fancy ladies can lift and go hiking and watch sports, they just need a partner who is grown up enough to recognize it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd9ldd", "score_hidden": true, "stickied": false, "created": 1492444773.0, "created_utc": 1492415973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgd9bhh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sapphire_Knuckle", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You may just have been unlucky about the guys you picked to date. Lord knows I wouldn't have handled some of those situations as gracefully as you. Be blunt. Borderline rude sometimes even, when someone is being (even unknowingly) disrespectful of you or your time. Hopefully, before that happens, you can lay out expectations. Flesh out \"hang out\" plans more before committing. Be upfront about wanting to be romanced, and go out on outings, dates, and give examples about stuff you may want to do together. If the guy is classy or cultured at all he will have additional ideas and you guys can pick from a pool. Don't date uncultured slobs and get disappointed when they don't transform into your prince.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You may just have been unlucky about the guys you picked to date. Lord knows I wouldn&amp;#39;t have handled some of those situations as gracefully as you. Be blunt. Borderline rude sometimes even, when someone is being (even unknowingly) disrespectful of you or your time. Hopefully, before that happens, you can lay out expectations. Flesh out &amp;quot;hang out&amp;quot; plans more before committing. Be upfront about wanting to be romanced, and go out on outings, dates, and give examples about stuff you may want to do together. If the guy is classy or cultured at all he will have additional ideas and you guys can pick from a pool. Don&amp;#39;t date uncultured slobs and get disappointed when they don&amp;#39;t transform into your prince.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd9bhh", "score_hidden": true, "stickied": false, "created": 1492443925.0, "created_utc": 1492415125.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdh4fv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "officerace", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think that some of this is insecurity on your part. I don't think these guys would treat you much differently if you appeared more traditionally feminine. I think it's probably your marketing. Just the way you talk about Cheetos and South Park, I would assume you would rather just hang out at home than go on a date night. I think you need to put both parts of your personality out there, because you currently put more emphasis on the laid back, low maintenance side of your personality. Are you a little afraid they might not like you as much if you act like a \"regular\" girl? I'm not saying you're like this, but I've met a lot of younger women that are afraid of showing their feminine side because they don't want to seem ditzy or vapid. There's nothing wrong with having traditional female interests. Men expect that. I think you just need to communicate what you want and don't be afraid of it coming off a certain way. ", "edited": 1492436017.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that some of this is insecurity on your part. I don&amp;#39;t think these guys would treat you much differently if you appeared more traditionally feminine. I think it&amp;#39;s probably your marketing. Just the way you talk about Cheetos and South Park, I would assume you would rather just hang out at home than go on a date night. I think you need to put both parts of your personality out there, because you currently put more emphasis on the laid back, low maintenance side of your personality. Are you a little afraid they might not like you as much if you act like a &amp;quot;regular&amp;quot; girl? I&amp;#39;m not saying you&amp;#39;re like this, but I&amp;#39;ve met a lot of younger women that are afraid of showing their feminine side because they don&amp;#39;t want to seem ditzy or vapid. There&amp;#39;s nothing wrong with having traditional female interests. Men expect that. I think you just need to communicate what you want and don&amp;#39;t be afraid of it coming off a certain way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdh4fv", "score_hidden": true, "stickied": false, "created": 1492464578.0, "created_utc": 1492435778.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdk2qh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tdasnowman", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This isn't you being treated as just one of the guys. Some of this like the tv shows and movies is jus natural relationship progression. If you only like rom coms then speak up. After they feel more secure with you they are wanting to move past the \"date night\" entertainment and jut get into the regular hey let watch this together stuff.\n\nThe rest just seems to be your bad at picking guys. Seriously a lot of this maybe if you spoke up to them about it would possibly change. None of this is you being treated as one of the guys.  Being treated as  of the guys would be talking and asking you opinion about other women. \n\nSource: A guy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t you being treated as just one of the guys. Some of this like the tv shows and movies is jus natural relationship progression. If you only like rom coms then speak up. After they feel more secure with you they are wanting to move past the &amp;quot;date night&amp;quot; entertainment and jut get into the regular hey let watch this together stuff.&lt;/p&gt;\n\n&lt;p&gt;The rest just seems to be your bad at picking guys. Seriously a lot of this maybe if you spoke up to them about it would possibly change. None of this is you being treated as one of the guys.  Being treated as  of the guys would be talking and asking you opinion about other women. &lt;/p&gt;\n\n&lt;p&gt;Source: A guy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdk2qh", "score_hidden": true, "stickied": false, "created": 1492468833.0, "created_utc": 1492440033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdlttm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "oldcreaker", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Ever think it might not be you - other than poor choices of who you are dating? I've seen these kind of complaints from all sorts of women, girly or not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ever think it might not be you - other than poor choices of who you are dating? I&amp;#39;ve seen these kind of complaints from all sorts of women, girly or not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdlttm", "score_hidden": true, "stickied": false, "created": 1492471028.0, "created_utc": 1492442228.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdmxfv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throwawayno123456789", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah- this is guys getting comfortable once they \"have\" you.  It happens to girly girls too. .it's not a reflection of your femininity.\n\nThe issue is more about how to ask for and get the kind of relationship you want rather than a question of being more feminine.\n\nI suck at communication in relationships, so I can't help you there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah- this is guys getting comfortable once they &amp;quot;have&amp;quot; you.  It happens to girly girls too. .it&amp;#39;s not a reflection of your femininity.&lt;/p&gt;\n\n&lt;p&gt;The issue is more about how to ask for and get the kind of relationship you want rather than a question of being more feminine.&lt;/p&gt;\n\n&lt;p&gt;I suck at communication in relationships, so I can&amp;#39;t help you there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmxfv", "score_hidden": true, "stickied": false, "created": 1492472317.0, "created_utc": 1492443517.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdo35w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tdoodle", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You can have the interests you have and still demand mutual respect from the men you date. Having overlapping interests doesn't mean you forfeit the ability to have expectations in any of your relationships- platonic or romantic. Many of us buy into the fallacy that men aren't \"good\" at being in touch with their feelings and/or make decisions purely based on logic (which is not true) and that friendships between men don't have any \"drama\" because they don't experience emotions the same way women do (which is also not true). Many (straight) men also praise women for being \"chill\" and \"not like other women,\" which basically translates to, \"I don't like it when I'm held accountable for my behavior.\" This is all bullshit, OP. You deserve better friends and better dates.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can have the interests you have and still demand mutual respect from the men you date. Having overlapping interests doesn&amp;#39;t mean you forfeit the ability to have expectations in any of your relationships- platonic or romantic. Many of us buy into the fallacy that men aren&amp;#39;t &amp;quot;good&amp;quot; at being in touch with their feelings and/or make decisions purely based on logic (which is not true) and that friendships between men don&amp;#39;t have any &amp;quot;drama&amp;quot; because they don&amp;#39;t experience emotions the same way women do (which is also not true). Many (straight) men also praise women for being &amp;quot;chill&amp;quot; and &amp;quot;not like other women,&amp;quot; which basically translates to, &amp;quot;I don&amp;#39;t like it when I&amp;#39;m held accountable for my behavior.&amp;quot; This is all bullshit, OP. You deserve better friends and better dates.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdo35w", "score_hidden": true, "stickied": false, "created": 1492473643.0, "created_utc": 1492444843.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgd7kig", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MostlyAngry", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Imo you're just dating the wrong guys. Branch out and find guys with other hobbies. Like cooking. Bros will be bros. Which is what you're dating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Imo you&amp;#39;re just dating the wrong guys. Branch out and find guys with other hobbies. Like cooking. Bros will be bros. Which is what you&amp;#39;re dating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd7kig", "score_hidden": true, "stickied": false, "created": 1492439521.0, "created_utc": 1492410721.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgddhz1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LeRenardEtHirondelle", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your appearance has nothing to do with it. I'm a petite and slim lass and guys treat me like one of the dudes as well. Why? Because I don't demand otherwise.\n\nThe girls who get flowers, they get this because guys know they'll lose interest if they're not getting it. I personally am not into this, so it's fine, but I also know that I am guilty of going with the flow too much.\n\nIn all honesty, you don't mention if these relationships were *bad* per se, just that you wish you were treated differently. It sounds like the guys you've dated might actually be somewhat relieved that you're not so high maintenance that they can kick back and be themselves. But you, too, should be able to be YOURSELF...and that means saying \"yeah I want to watch this guilty pleasure chick flick tonight and not *South Park*\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your appearance has nothing to do with it. I&amp;#39;m a petite and slim lass and guys treat me like one of the dudes as well. Why? Because I don&amp;#39;t demand otherwise.&lt;/p&gt;\n\n&lt;p&gt;The girls who get flowers, they get this because guys know they&amp;#39;ll lose interest if they&amp;#39;re not getting it. I personally am not into this, so it&amp;#39;s fine, but I also know that I am guilty of going with the flow too much.&lt;/p&gt;\n\n&lt;p&gt;In all honesty, you don&amp;#39;t mention if these relationships were &lt;em&gt;bad&lt;/em&gt; per se, just that you wish you were treated differently. It sounds like the guys you&amp;#39;ve dated might actually be somewhat relieved that you&amp;#39;re not so high maintenance that they can kick back and be themselves. But you, too, should be able to be YOURSELF...and that means saying &amp;quot;yeah I want to watch this guilty pleasure chick flick tonight and not &lt;em&gt;South Park&lt;/em&gt;&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgddhz1", "score_hidden": true, "stickied": false, "created": 1492457390.0, "created_utc": 1492428590.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgd7qc3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ikin5050", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "quite frankly your size and weight has nothing to do with it.\nfor your height you're a very normal weight?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;quite frankly your size and weight has nothing to do with it.\nfor your height you&amp;#39;re a very normal weight?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd7qc3", "score_hidden": true, "stickied": false, "created": 1492439885.0, "created_utc": 1492411085.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdq7e5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationshipslol", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\n\nI think this is actually kinda a good litmus test for if a partner is actually listening.  So the first time this happens, or like a month after you start dating, whichever comes first, you say straight out:  \"I like a lot of \"guy stuff\" and because of that I've dated a lot of guys who think it's fine to have dates that are just 'bro time' where I watch you play video games in your ratty sweats.  I'm not a princess but I deserve better than that.  This is what I'm looking for in terms of (personal hygiene) and (actual dates).\"\n\nDudes who continue to bro you after you lay it out that clearly are probably not worth spending that much more time on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is actually kinda a good litmus test for if a partner is actually listening.  So the first time this happens, or like a month after you start dating, whichever comes first, you say straight out:  &amp;quot;I like a lot of &amp;quot;guy stuff&amp;quot; and because of that I&amp;#39;ve dated a lot of guys who think it&amp;#39;s fine to have dates that are just &amp;#39;bro time&amp;#39; where I watch you play video games in your ratty sweats.  I&amp;#39;m not a princess but I deserve better than that.  This is what I&amp;#39;m looking for in terms of (personal hygiene) and (actual dates).&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Dudes who continue to bro you after you lay it out that clearly are probably not worth spending that much more time on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdq7e5", "score_hidden": true, "stickied": false, "created": 1492476022.0, "created_utc": 1492447222.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65sgu7", "likes": null, "replies": "", "user_reports": [], "id": "dgdl45w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zepelino", "parent_id": "t3_65sgu7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What if you really attract this type of guy?\n\nI mean.. all my ex'es and my girlfriend have a very similar set of qualities and fails", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if you really attract this type of guy?&lt;/p&gt;\n\n&lt;p&gt;I mean.. all my ex&amp;#39;es and my girlfriend have a very similar set of qualities and fails&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdl45w", "score_hidden": true, "stickied": false, "created": 1492470152.0, "created_utc": 1492441352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]