[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My wife is pregnant of 1 month and I&amp;#39;ve been extremely happy. I love that her belly is starting to show a little bit and we&amp;#39;re both very smitten right now.&lt;/p&gt;\n\n&lt;p&gt;But then a thought hit me: my sister. She passed away 4 years ago in a house accident related to her epilepsy. I was of course terrible at first because it came out of nowhere and we were very good friends all our lives, but over the years and more specifically this year, I&amp;#39;ve found a way to deal with it and realize that, yes, it&amp;#39;ll probably hurt forever, but I need to deal with it and carry on.&lt;/p&gt;\n\n&lt;p&gt;The thing is that, now that I&amp;#39;ll be a father, it makes me think of how much I would have enjoyed watching her be there with my child and possibly being an uncle for her children. It makes me think that I&amp;#39;ve lost her twice, her and the bigger family that we could have been.&lt;/p&gt;\n\n&lt;p&gt;For all our lives, we were essentially the only real family we had. Our parents were always somewhere between somewhat caring but still distant to sometimes physically abusive. even in the best times, they were always a looming presence instead of people we felt we could trust. It led to some probably unhealthy dynamics between us but in the end we were always each other&amp;#39;s best friends.&lt;/p&gt;\n\n&lt;p&gt;I feel like these reignites the grief for me, at least to some extent. Another strange thought is that I feel like I should strive to be a better father out of some sort of respect for her, or maybe because that&amp;#39;s what she would have wanted. I don&amp;#39;t know.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: My wife&amp;#39;s pregnancy makes me miss my late sister again because we will never be for our respective children the &amp;quot;real&amp;quot; family we never had. I feel robbed by life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My wife is pregnant of 1 month and I've been extremely happy. I love that her belly is starting to show a little bit and we're both very smitten right now.\n\nBut then a thought hit me: my sister. She passed away 4 years ago in a house accident related to her epilepsy. I was of course terrible at first because it came out of nowhere and we were very good friends all our lives, but over the years and more specifically this year, I've found a way to deal with it and realize that, yes, it'll probably hurt forever, but I need to deal with it and carry on.\n\nThe thing is that, now that I'll be a father, it makes me think of how much I would have enjoyed watching her be there with my child and possibly being an uncle for her children. It makes me think that I've lost her twice, her and the bigger family that we could have been.\n\nFor all our lives, we were essentially the only real family we had. Our parents were always somewhere between somewhat caring but still distant to sometimes physically abusive. even in the best times, they were always a looming presence instead of people we felt we could trust. It led to some probably unhealthy dynamics between us but in the end we were always each other's best friends.\n\nI feel like these reignites the grief for me, at least to some extent. Another strange thought is that I feel like I should strive to be a better father out of some sort of respect for her, or maybe because that's what she would have wanted. I don't know.\n  \n  ---   \n  **tl;dr**: My wife's pregnancy makes me miss my late sister again because we will never be for our respective children the \"real\" family we never had. I feel robbed by life.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Personal issues", "id": "65tp0h", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 167, "report_reasons": null, "author": "ishmaelstillhere", "saved": false, "mod_reports": [], "name": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-io personal", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65tp0h/now_that_my_wife_35_f_is_pregnant_i_34_m_feel_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492434379.0, "url": "https://www.reddit.com/r/relationships/comments/65tp0h/now_that_my_wife_35_f_is_pregnant_i_34_m_feel_the/", "author_flair_text": null, "quarantine": false, "title": "Now that my wife [35 F] is pregnant, I [34 M] feel the strangest longing for my late sister.", "created_utc": 1492405579.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 25, "visited": false, "subreddit_type": "public", "ups": 167}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgd5itb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "adhdcombinationokay", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "As life changes you re-grieve and re feel those feelings.  It's perfectly normal.  A grief counselor can help you work through this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As life changes you re-grieve and re feel those feelings.  It&amp;#39;s perfectly normal.  A grief counselor can help you work through this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd5itb", "score_hidden": true, "stickied": false, "created": 1492435160.0, "created_utc": 1492406360.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdcn6d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "punfull", "parent_id": "t1_dgd5ltz", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It may also bring up feelings about your parents, OP. How you were raised now that you're raising your own child. Just be aware, and seek help when you need to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It may also bring up feelings about your parents, OP. How you were raised now that you&amp;#39;re raising your own child. Just be aware, and seek help when you need to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdcn6d", "score_hidden": true, "stickied": false, "created": 1492455013.0, "created_utc": 1492426213.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd5ltz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LittleMissP", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Honestly, it's normal. Pregnancy and the freight train that leads to being a parent brings up all sorts of weird feelings about family, and brings back grief you thought you'd dealt with long ago. People you wish could have met the baby, people you know would have been great with them, people who would have been delighted to see you as a father. It's ok to feel that way. \n\nYou'll feel it when the baby is born too, the weird mix of overwhelming joy whilst looking at your child, and a deep sadness for all the people who missed this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, it&amp;#39;s normal. Pregnancy and the freight train that leads to being a parent brings up all sorts of weird feelings about family, and brings back grief you thought you&amp;#39;d dealt with long ago. People you wish could have met the baby, people you know would have been great with them, people who would have been delighted to see you as a father. It&amp;#39;s ok to feel that way. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll feel it when the baby is born too, the weird mix of overwhelming joy whilst looking at your child, and a deep sadness for all the people who missed this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd5ltz", "score_hidden": true, "stickied": false, "created": 1492435328.0, "created_utc": 1492406528.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdazc5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Phospherocity", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm so sorry you lost your sister. I don't think what you're going through is strange at all - it's bound to hit you at times that her presence would be particularly meaningful and important. \n\nI think you should tell your wife that you're feeling like this. I mean, obviously some moment she isn't feeling exhausted  or overwhelmed by pregnancy hormones, but she should be able to understand and comfort you, and I think speaking it aloud to someone who loves you will help. You could also consider talking to a grief counsellor. But  it is okay to feel what you're feeling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry you lost your sister. I don&amp;#39;t think what you&amp;#39;re going through is strange at all - it&amp;#39;s bound to hit you at times that her presence would be particularly meaningful and important. &lt;/p&gt;\n\n&lt;p&gt;I think you should tell your wife that you&amp;#39;re feeling like this. I mean, obviously some moment she isn&amp;#39;t feeling exhausted  or overwhelmed by pregnancy hormones, but she should be able to understand and comfort you, and I think speaking it aloud to someone who loves you will help. You could also consider talking to a grief counsellor. But  it is okay to feel what you&amp;#39;re feeling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdazc5", "score_hidden": true, "stickied": false, "created": 1492449521.0, "created_utc": 1492420721.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdb466", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zzeeaa", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That all makes a lot of sense, as strange as grief can feel. Have you considered using your sister's name as a middle or first name for your child? That might help you to make her connection to this new child seem more 'real'.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That all makes a lot of sense, as strange as grief can feel. Have you considered using your sister&amp;#39;s name as a middle or first name for your child? That might help you to make her connection to this new child seem more &amp;#39;real&amp;#39;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdb466", "score_hidden": true, "stickied": false, "created": 1492449981.0, "created_utc": 1492421181.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdd8dm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rcrctrd", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Same thing happened to me! My older sister passed away when I was little, I only have a vague memory of her. And still, once I became pregnant I would just be hit with random moments of grief. The first time I visited her grave with my son was almost overwhelming. Knowing that your life goes on while theirs doesn't just catches you off guard sometimes, even if you've made peace with it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same thing happened to me! My older sister passed away when I was little, I only have a vague memory of her. And still, once I became pregnant I would just be hit with random moments of grief. The first time I visited her grave with my son was almost overwhelming. Knowing that your life goes on while theirs doesn&amp;#39;t just catches you off guard sometimes, even if you&amp;#39;ve made peace with it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdd8dm", "score_hidden": true, "stickied": false, "created": 1492456704.0, "created_utc": 1492427904.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgd6ooj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CraazyMike", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Becoming a father is a real mind fuck. Everyone focuses on the mother and what she's going through.. and for good reasons.. but fathers have their own stuff to deal with and usually not much of a peer group to talk about it to. What you're feeling is perfectly normal. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Becoming a father is a real mind fuck. Everyone focuses on the mother and what she&amp;#39;s going through.. and for good reasons.. but fathers have their own stuff to deal with and usually not much of a peer group to talk about it to. What you&amp;#39;re feeling is perfectly normal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd6ooj", "score_hidden": true, "stickied": false, "created": 1492437565.0, "created_utc": 1492408765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdesxu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "marleyrae", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP, I'm so sorry for your loss. I also lost a sibling. I missed him when I got married, when I moved into my first home... I think of him at all the big milestones. There's going to be a space in your heart for your sister for the rest of your life. Perhaps honor her how you think she would like to be honored. What were things you did together that you can teach your child? What can you tell your child about her? Can you involve your sister in your child's birth? When you do those things, it may make you feel closer to her. For example, I had a little locket with a picture of my brother on my wedding bouquet. It made me feel close to my brother when he wasn't there. I also have a drawing he made me framed in my home office. It's stupid and small, but these things bring me comfort and help me to feel like I'm honoring his memory. I hope you can find some things like that to try to bring you comfort also. Congratulations on being a dad! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, I&amp;#39;m so sorry for your loss. I also lost a sibling. I missed him when I got married, when I moved into my first home... I think of him at all the big milestones. There&amp;#39;s going to be a space in your heart for your sister for the rest of your life. Perhaps honor her how you think she would like to be honored. What were things you did together that you can teach your child? What can you tell your child about her? Can you involve your sister in your child&amp;#39;s birth? When you do those things, it may make you feel closer to her. For example, I had a little locket with a picture of my brother on my wedding bouquet. It made me feel close to my brother when he wasn&amp;#39;t there. I also have a drawing he made me framed in my home office. It&amp;#39;s stupid and small, but these things bring me comfort and help me to feel like I&amp;#39;m honoring his memory. I hope you can find some things like that to try to bring you comfort also. Congratulations on being a dad! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdesxu", "score_hidden": true, "stickied": false, "created": 1492460410.0, "created_utc": 1492431610.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdo0x9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShesTyping", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Since my mum died in 2000, there's been several times a life change has occurred which caused me to feel her loss freshly and wish she was around to share x experience or achievement. What you're going through is perfectly normal, grief is not a process that ever ends, and resentment and anger are as much a part of grief as sorrow is.\n\nMy favourite descriptor is grief is as follows. \n\nWhen you first lose a loved one, you're thrown into the middle of an ocean of grief. It is deep and wide and you can see no end to it, sometimes you even feel as if you're going to drown in it. But you start swimming and eventually you hit an island, that will give you a short respite, but you're going to need to keep swimming, you'll hit another island, and then another, and each island will be a bit bigger than the last and the time you spend swimming in grief less &amp; less. Eventually you hit actual land and start walking, you'll still occasionally have to cross a river or pool of grief, but the majority of your time will be spend on solid ground for the rest of your journey.\n\nYou have just hit on a river or pool of grief, you will hit others... just keep onward. And, by remembering your sister you're keeping her close &amp; part of your life, she always will be as long as you can find memories of her. Occasionally you'll even see her in your child, as she was a part of you and you will be part of your child, and that's kind of beautiful.\n\nIt might help you to find a grief counselor, or if you don't want to verbalize your feelings, pick up a good book on grief. Self help can really work. Nothing you're feeling is wrong or strange, all of us who have lost loved ones have and will go through it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since my mum died in 2000, there&amp;#39;s been several times a life change has occurred which caused me to feel her loss freshly and wish she was around to share x experience or achievement. What you&amp;#39;re going through is perfectly normal, grief is not a process that ever ends, and resentment and anger are as much a part of grief as sorrow is.&lt;/p&gt;\n\n&lt;p&gt;My favourite descriptor is grief is as follows. &lt;/p&gt;\n\n&lt;p&gt;When you first lose a loved one, you&amp;#39;re thrown into the middle of an ocean of grief. It is deep and wide and you can see no end to it, sometimes you even feel as if you&amp;#39;re going to drown in it. But you start swimming and eventually you hit an island, that will give you a short respite, but you&amp;#39;re going to need to keep swimming, you&amp;#39;ll hit another island, and then another, and each island will be a bit bigger than the last and the time you spend swimming in grief less &amp;amp; less. Eventually you hit actual land and start walking, you&amp;#39;ll still occasionally have to cross a river or pool of grief, but the majority of your time will be spend on solid ground for the rest of your journey.&lt;/p&gt;\n\n&lt;p&gt;You have just hit on a river or pool of grief, you will hit others... just keep onward. And, by remembering your sister you&amp;#39;re keeping her close &amp;amp; part of your life, she always will be as long as you can find memories of her. Occasionally you&amp;#39;ll even see her in your child, as she was a part of you and you will be part of your child, and that&amp;#39;s kind of beautiful.&lt;/p&gt;\n\n&lt;p&gt;It might help you to find a grief counselor, or if you don&amp;#39;t want to verbalize your feelings, pick up a good book on grief. Self help can really work. Nothing you&amp;#39;re feeling is wrong or strange, all of us who have lost loved ones have and will go through it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdo0x9", "score_hidden": true, "stickied": false, "created": 1492473571.0, "created_utc": 1492444771.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdcxwz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thrwpllw", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It seems completely normal and understandable to me that you'd be having these feelings.  Having a child often changes how people feel about their existing family and relationships, puts a whole new layer on it I guess, and it would be wacky to me if you *didn't* find your feelings about your sister stirred up.  \n\nIt sounds like your sister had a big impact on you.  You will be carrying a piece of her with you always, which means that she is going to touch the life of your child(ren), probably even in ways you aren't consciously aware of. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seems completely normal and understandable to me that you&amp;#39;d be having these feelings.  Having a child often changes how people feel about their existing family and relationships, puts a whole new layer on it I guess, and it would be wacky to me if you &lt;em&gt;didn&amp;#39;t&lt;/em&gt; find your feelings about your sister stirred up.  &lt;/p&gt;\n\n&lt;p&gt;It sounds like your sister had a big impact on you.  You will be carrying a piece of her with you always, which means that she is going to touch the life of your child(ren), probably even in ways you aren&amp;#39;t consciously aware of. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdcxwz", "score_hidden": true, "stickied": false, "created": 1492455902.0, "created_utc": 1492427102.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdm3si", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bringmefoodpls", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you should include your wife on what you're feeling. You don't want her to feel isolated from you during this time and she can figure out what things she can do to help you through this tough time. Never go through things alone! I'm sorry about your sister but know she'll be watching over your little baby", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should include your wife on what you&amp;#39;re feeling. You don&amp;#39;t want her to feel isolated from you during this time and she can figure out what things she can do to help you through this tough time. Never go through things alone! I&amp;#39;m sorry about your sister but know she&amp;#39;ll be watching over your little baby&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdm3si", "score_hidden": true, "stickied": false, "created": 1492471359.0, "created_utc": 1492442559.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdn8lb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jordy_in_the_box", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm having a lot of the same feelings you are right now. Especially since my kids are older and are starting to hit major childhood milestones  (like high school this fall!). I've been told grief coming back in waves is very normal as the initial event becomes more distant in the past. And I guess it's true. I'm definitely in a...less sad place than I was last year. But some moments still hit me hard. Knowing my sister isn't there to enjoy this life with me, watch her niece and nephew grow up, have kids of her own, etc.\n\nJust last week, my daughter won 1st place in an art competition and there was a ceremony; she got an award and a cash prize. My mom, dad, step mom, grandmother, and 2 sisters were there to celebrate. But this sister wasn't  (she passed in Dec 2015) and even though it was supposed to be a happy occasion, I was near tears the whole night. Just thinking she SHOULD be here with us.\n\nI'm very sorry for your loss, I know how it feels. I hope that along with the sad moments you can remember all the happy times you had with her as well. And I do recommend grief counseling, it helped me tremendously when I realized I was finally ready for it. Feel free to PM me if you ever need to vent.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m having a lot of the same feelings you are right now. Especially since my kids are older and are starting to hit major childhood milestones  (like high school this fall!). I&amp;#39;ve been told grief coming back in waves is very normal as the initial event becomes more distant in the past. And I guess it&amp;#39;s true. I&amp;#39;m definitely in a...less sad place than I was last year. But some moments still hit me hard. Knowing my sister isn&amp;#39;t there to enjoy this life with me, watch her niece and nephew grow up, have kids of her own, etc.&lt;/p&gt;\n\n&lt;p&gt;Just last week, my daughter won 1st place in an art competition and there was a ceremony; she got an award and a cash prize. My mom, dad, step mom, grandmother, and 2 sisters were there to celebrate. But this sister wasn&amp;#39;t  (she passed in Dec 2015) and even though it was supposed to be a happy occasion, I was near tears the whole night. Just thinking she SHOULD be here with us.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m very sorry for your loss, I know how it feels. I hope that along with the sad moments you can remember all the happy times you had with her as well. And I do recommend grief counseling, it helped me tremendously when I realized I was finally ready for it. Feel free to PM me if you ever need to vent.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdn8lb", "score_hidden": true, "stickied": false, "created": 1492472670.0, "created_utc": 1492443870.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdqzxj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ishmaelstillhere", "parent_id": "t1_dgddvj7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you. For a while I thought it was very particular and other people wouldn't really \"get it\", but it seems to be a common thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. For a while I thought it was very particular and other people wouldn&amp;#39;t really &amp;quot;get it&amp;quot;, but it seems to be a common thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdqzxj", "score_hidden": true, "stickied": false, "created": 1492476895.0, "created_utc": 1492448095.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgddvj7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ottawadeveloper", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My father was diagnosed with terminal cancer about two months after my daughter  (his first grandchild) was born, and passed away seven months later. It's been a year and I still feel sad about it sometimes, at least some of which comes from him not seeing her grow up and her not knowing him. You're not alone in this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My father was diagnosed with terminal cancer about two months after my daughter  (his first grandchild) was born, and passed away seven months later. It&amp;#39;s been a year and I still feel sad about it sometimes, at least some of which comes from him not seeing her grow up and her not knowing him. You&amp;#39;re not alone in this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgddvj7", "score_hidden": true, "stickied": false, "created": 1492458326.0, "created_utc": 1492429526.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdjeky", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "awildwoodsmanappears", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah man losing someone that important never really goes away.  Both sorry to hear it and congratulations.  Go ahead and feel whatever you feel, it's okay.  \n\nFor me it was one of my parents instead of a sibling.  But the effect is the same.  You think of them during good times and tough times and other times in between.   Nobody gets a perfect life full of everything they want so it's okay to grieve the life you don't get to have with your sister.  Heck do it regularly.  \n\nYou just got to blunder on, doing the best you can.  Forgive yourself your mistakes and never stop trying.  It's all any of us can do.  You're doing all right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah man losing someone that important never really goes away.  Both sorry to hear it and congratulations.  Go ahead and feel whatever you feel, it&amp;#39;s okay.  &lt;/p&gt;\n\n&lt;p&gt;For me it was one of my parents instead of a sibling.  But the effect is the same.  You think of them during good times and tough times and other times in between.   Nobody gets a perfect life full of everything they want so it&amp;#39;s okay to grieve the life you don&amp;#39;t get to have with your sister.  Heck do it regularly.  &lt;/p&gt;\n\n&lt;p&gt;You just got to blunder on, doing the best you can.  Forgive yourself your mistakes and never stop trying.  It&amp;#39;s all any of us can do.  You&amp;#39;re doing all right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdjeky", "score_hidden": true, "stickied": false, "created": 1492467938.0, "created_utc": 1492439138.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdmj4s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BlueberryTheBantha", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I lost my dad last year unexpectedly and my therapist told me that the first year would be tough, and then after that it would ebb and flow. It would come back hard during milestones especially. That sounds like what you're experiencing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I lost my dad last year unexpectedly and my therapist told me that the first year would be tough, and then after that it would ebb and flow. It would come back hard during milestones especially. That sounds like what you&amp;#39;re experiencing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmj4s", "score_hidden": true, "stickied": false, "created": 1492471855.0, "created_utc": 1492443055.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdpaoe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ataraxiary", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hi. I think others have covered how completely normal this is -\n having a child will be bittersweet since it brings up thoughts of your sister. I wanted to add an unsolicited idea... maybe name your child after your sister (even just a middle name) or after something your sister loved (a character, a type of flower - whatever is meaningful). If some part of your child's name honors your sister, I think it would be a lovely tribute and help to keep her memory alive and make her more real for your child one day. Just a thought that popped in my head reading this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi. I think others have covered how completely normal this is -\n having a child will be bittersweet since it brings up thoughts of your sister. I wanted to add an unsolicited idea... maybe name your child after your sister (even just a middle name) or after something your sister loved (a character, a type of flower - whatever is meaningful). If some part of your child&amp;#39;s name honors your sister, I think it would be a lovely tribute and help to keep her memory alive and make her more real for your child one day. Just a thought that popped in my head reading this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdpaoe", "score_hidden": true, "stickied": false, "created": 1492475013.0, "created_utc": 1492446213.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdr7q4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ishmaelstillhere", "parent_id": "t1_dgdq5vf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She also died before I got married. I didn't have a big planned wedding but I sure missed her a lot. Like, I said, we were each other's only family members that were there constantly, so she was the one person I would have wanted there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She also died before I got married. I didn&amp;#39;t have a big planned wedding but I sure missed her a lot. Like, I said, we were each other&amp;#39;s only family members that were there constantly, so she was the one person I would have wanted there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdr7q4", "score_hidden": true, "stickied": false, "created": 1492477138.0, "created_utc": 1492448338.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq5vf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shywatkins1006", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I lost a sister of mine ten years ago in February of 2007. And honestly I still have  this feeling a lot, if something big and life changing going on  I miss her beyond words will sometimes break down crying and even question why. It's hard, at least for me it's been any bigger life event that triggers me.feeling like I lost her all over again. \nLike January of last year my FH and I got engaged and it messed with me for months that she wouldn't be in my wedding and made me question if she'd be happy with my choices etc", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I lost a sister of mine ten years ago in February of 2007. And honestly I still have  this feeling a lot, if something big and life changing going on  I miss her beyond words will sometimes break down crying and even question why. It&amp;#39;s hard, at least for me it&amp;#39;s been any bigger life event that triggers me.feeling like I lost her all over again. \nLike January of last year my FH and I got engaged and it messed with me for months that she wouldn&amp;#39;t be in my wedding and made me question if she&amp;#39;d be happy with my choices etc&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdq5vf", "score_hidden": true, "stickied": false, "created": 1492475975.0, "created_utc": 1492447175.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgd5jog", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ineedmoney17", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Gotta just work with what you have mate. Everyone's robbed of something at some point. Doesn't mean that it doesn't suck, it does.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gotta just work with what you have mate. Everyone&amp;#39;s robbed of something at some point. Doesn&amp;#39;t mean that it doesn&amp;#39;t suck, it does.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgd5jog", "score_hidden": true, "stickied": false, "created": 1492435209.0, "created_utc": 1492406409.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdjgv7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chewedgummiebears", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I feel this way whenever I experience something new since losing my wife a little under 3 years ago. She was a homebody introvert with some increasing mental issues. I loved her and still do but now she is gone, I am experiencing new things for the first time that I couldn't due to the restrictions she placed on my life. With each new thing, I think back on how she would have liked it and how it might have changed the outcome of her life.\n\nThose feelings are normal but the phrase \"Live in the now, not the past\" becomes a focus while moving forward. Re-grieving is a part of life but the key for it is not to dwell on it or let it run your current life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel this way whenever I experience something new since losing my wife a little under 3 years ago. She was a homebody introvert with some increasing mental issues. I loved her and still do but now she is gone, I am experiencing new things for the first time that I couldn&amp;#39;t due to the restrictions she placed on my life. With each new thing, I think back on how she would have liked it and how it might have changed the outcome of her life.&lt;/p&gt;\n\n&lt;p&gt;Those feelings are normal but the phrase &amp;quot;Live in the now, not the past&amp;quot; becomes a focus while moving forward. Re-grieving is a part of life but the key for it is not to dwell on it or let it run your current life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdjgv7", "score_hidden": true, "stickied": false, "created": 1492468024.0, "created_utc": 1492439224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdzk8c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "companionquandary", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Ok I know it's not related to the main question but no-one starts showing at 1 month pregnant, most women don't even know they are pregnant until 8 weeks and it would still be unlikely to be showing at all then ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok I know it&amp;#39;s not related to the main question but no-one starts showing at 1 month pregnant, most women don&amp;#39;t even know they are pregnant until 8 weeks and it would still be unlikely to be showing at all then &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdzk8c", "score_hidden": true, "stickied": false, "created": 1492486491.0, "created_utc": 1492457691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdv3tw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dogmealyem", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Of course you do.\n\nMy SIL lost her father years ago and I'm sure she missed him so much when my niece was born. They honored him specifically at their wedding and everyone cried. She and her siblings all have tattoos in his memory. But he's still around in a way- my cousin made a book with pictures and names of everyone in the baby's family, and he's in there. I gave them an ornament for my niece's first Christmas that honors his heritage. We ask questions about him, mention him at holidays (including me and my parents who never even met him). You should talk about this with your wife, share it with her. I grew feeling love from the grandparents I never met from the stories I heard. Find a way to remember her in your child's life. There will be grief but also joy and love. That's part of the wonder of families and memories and love- they just keep going.\n\nCongrats on your baby OP and sending love to you and yours!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course you do.&lt;/p&gt;\n\n&lt;p&gt;My SIL lost her father years ago and I&amp;#39;m sure she missed him so much when my niece was born. They honored him specifically at their wedding and everyone cried. She and her siblings all have tattoos in his memory. But he&amp;#39;s still around in a way- my cousin made a book with pictures and names of everyone in the baby&amp;#39;s family, and he&amp;#39;s in there. I gave them an ornament for my niece&amp;#39;s first Christmas that honors his heritage. We ask questions about him, mention him at holidays (including me and my parents who never even met him). You should talk about this with your wife, share it with her. I grew feeling love from the grandparents I never met from the stories I heard. Find a way to remember her in your child&amp;#39;s life. There will be grief but also joy and love. That&amp;#39;s part of the wonder of families and memories and love- they just keep going.&lt;/p&gt;\n\n&lt;p&gt;Congrats on your baby OP and sending love to you and yours!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdv3tw", "score_hidden": true, "stickied": false, "created": 1492481444.0, "created_utc": 1492452644.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65tp0h", "likes": null, "replies": "", "user_reports": [], "id": "dgdy119", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cannakitty", "parent_id": "t3_65tp0h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's 100% normal to have a new wave of grief at every big moment in life", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s 100% normal to have a new wave of grief at every big moment in life&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdy119", "score_hidden": true, "stickied": false, "created": 1492484742.0, "created_utc": 1492455942.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]