[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Thank you in advance if you take the time to read through this.&lt;/p&gt;\n\n&lt;p&gt;We have been together for about 3 years. In the past 4 months I [26 M] have been very busy with work and school, but we have a mutual interest in Crossfit and regularly train together, along with our friend (John [26 M]). As I have been unable recently to go everytime she wants to go, she (Sandra) [25 F] has gotten to know a few people at the gym, and regularly (5-7 times a week) trains with them.&lt;/p&gt;\n\n&lt;p&gt;In particular, she has been training a lot with one guy (Tim [~23 M]). They have become good friends in the past ~2 months and basically trained together most days of the week, sometimes just them 2 together, and sometimes with 2-3 other people.&lt;/p&gt;\n\n&lt;p&gt;I have basically never spoken to this Tim, just said hi to him at the gym. On one occasion, me, John and Sandra were training together, and Sandra had gone to the toilet (we thought). When she didn&amp;#39;t come back once the last round was starting, I went to find her, and did find her in the break room. For the record, I was calling her name so they knew I was coming before I could see them. Her and Tim were sitting very close to each other and I thought they were uncomfortable about me being there.&lt;/p&gt;\n\n&lt;p&gt;One evening about a week ago, Sandra was sitting in bed on the computer, and I was in the living room. I came into the bedroom and was starting to chat with her when Tim called her, and she just pressed silent and wouldn&amp;#39;t answer. I asked why and told her to answer the phone, but she wouldn&amp;#39;t and didn&amp;#39;t either when he called a second time soon after. She explained that she didn&amp;#39;t want me to hear what he was going to tell her, that it was something about how a guy from the gym (Tim&amp;#39;s friend, one of those &amp;#39;2-3 other people&amp;#39; they sometimes train with) had been telling Tim how he likes to pick spots at the gym where he can watch her ass, because she said it was just uncomfortable for me to know that.&lt;/p&gt;\n\n&lt;p&gt;I was confiding in John when I told him that I thought it was uncomfortable how Sandra had been liking pictures on Instagram of that friend of Tim&amp;#39;s, because she knew that he was into her. I thought it was inappropriate to send those kinds of &amp;#39;signals&amp;#39; to a guy she knows is into her.&lt;/p&gt;\n\n&lt;p&gt;John told me that he tought so too, but that Tim was a guy he would rather be worrying about. He has on several occasions trained with them (so Sandra, John and Tim training together), and he told me that he had a hard time putting it into words, but something about the chemistry and body language between them was too much in his opinion. He said that if it was his girlfriend, he wouldn&amp;#39;t think it was okay.&lt;/p&gt;\n\n&lt;p&gt;I confronted her yesterday about her relationship with Tim. I said that I thought they spent a lot of time together, that I thought they were uncomfortable when I came into the break room and they were sitting close to each other, and that the fact that she wouldn&amp;#39;t answer his call when I was there made it look like she was hiding something. She just gave the same explanation as before, and I insisted that she still should have answered the phone. I directly asked her if she had feelings for him, or if she had cheated on me with him, and she denied. After a long conversation I asked her if it would be okay if I could read through their conversation on her phone (on facebook or whatever) and in the end she said okay. She pulled up her phone, and as I was walking towards her, I&amp;#39;m fairly certain that the movements of her finger were those you make when you delete a conversation in the messenger app.&lt;/p&gt;\n\n&lt;p&gt;Once I was next to her, she said that she had deleted their conversation. She said she often deletes conversations, because she is afraid that I would see something that looks worse than it is, and be angry at her. Not only conversations with Tim but also with her (girl) friends, and other guys. She said that for example, Tim sometimes calls her &amp;#39;babe&amp;#39;. She insisted that she had deleted the conversation some days back, and that she regularly does so.&lt;/p&gt;\n\n&lt;p&gt;I told her to let me see her phone, that I wanted to go through the phone&amp;#39;s location history or conversations on other apps, and she wouldn&amp;#39;t let me. She said she was afraid if I saw something in the location history which she wouldn&amp;#39;t remember and couldn&amp;#39;t explain, that I would get angry. I gave her an ultimatum, that the relationship was over if I she couldn&amp;#39;t allow me to see her phone so I could at least &amp;#39;have something to work with&amp;#39; in terms of trusting her again. She still denied me of going through her phone. &lt;/p&gt;\n\n&lt;p&gt;In the end I gave in, and thought that I don&amp;#39;t have any proof of anything happening between them, and she might just be telling the truth.&lt;/p&gt;\n\n&lt;p&gt;Just by telling John about the confrontation later on, I thought I was an idiot for still being with her. Just by writing this here, I think I&amp;#39;m an idiot still being with her. This sounds terrible, and I simply can&amp;#39;t trust her, and she might very well have cheated on me (but of course she might well have not).&lt;/p&gt;\n\n&lt;p&gt;I think I should break up with her, but obviously I&amp;#39;m invested in this relationship and would like too seek your advice before doing so.&lt;/p&gt;\n\n&lt;p&gt;What are my options? What can I do in this situation? What are your opionions on what happened? Do any of you have a similar experience where you have been Sandra in this situation, where you deleted a conversation but it wasn&amp;#39;t because you were cheating but just that there was something that looked bad and might make your SO angry?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: Girlfriend deleted conversation with her newly aquired best friend and wouldn&amp;#39;t let me go through her phone&amp;#39;s location history, and I think I should break up with her because I feel I can&amp;#39;t trust her.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Thank you in advance if you take the time to read through this.\n\nWe have been together for about 3 years. In the past 4 months I [26 M] have been very busy with work and school, but we have a mutual interest in Crossfit and regularly train together, along with our friend (John [26 M]). As I have been unable recently to go everytime she wants to go, she (Sandra) [25 F] has gotten to know a few people at the gym, and regularly (5-7 times a week) trains with them.\n\n\nIn particular, she has been training a lot with one guy (Tim [~23 M]). They have become good friends in the past ~2 months and basically trained together most days of the week, sometimes just them 2 together, and sometimes with 2-3 other people.\n\n\nI have basically never spoken to this Tim, just said hi to him at the gym. On one occasion, me, John and Sandra were training together, and Sandra had gone to the toilet (we thought). When she didn't come back once the last round was starting, I went to find her, and did find her in the break room. For the record, I was calling her name so they knew I was coming before I could see them. Her and Tim were sitting very close to each other and I thought they were uncomfortable about me being there.\n\n\nOne evening about a week ago, Sandra was sitting in bed on the computer, and I was in the living room. I came into the bedroom and was starting to chat with her when Tim called her, and she just pressed silent and wouldn't answer. I asked why and told her to answer the phone, but she wouldn't and didn't either when he called a second time soon after. She explained that she didn't want me to hear what he was going to tell her, that it was something about how a guy from the gym (Tim's friend, one of those '2-3 other people' they sometimes train with) had been telling Tim how he likes to pick spots at the gym where he can watch her ass, because she said it was just uncomfortable for me to know that.\n\n\nI was confiding in John when I told him that I thought it was uncomfortable how Sandra had been liking pictures on Instagram of that friend of Tim's, because she knew that he was into her. I thought it was inappropriate to send those kinds of 'signals' to a guy she knows is into her.\n\n\nJohn told me that he tought so too, but that Tim was a guy he would rather be worrying about. He has on several occasions trained with them (so Sandra, John and Tim training together), and he told me that he had a hard time putting it into words, but something about the chemistry and body language between them was too much in his opinion. He said that if it was his girlfriend, he wouldn't think it was okay.\n  \n\nI confronted her yesterday about her relationship with Tim. I said that I thought they spent a lot of time together, that I thought they were uncomfortable when I came into the break room and they were sitting close to each other, and that the fact that she wouldn't answer his call when I was there made it look like she was hiding something. She just gave the same explanation as before, and I insisted that she still should have answered the phone. I directly asked her if she had feelings for him, or if she had cheated on me with him, and she denied. After a long conversation I asked her if it would be okay if I could read through their conversation on her phone (on facebook or whatever) and in the end she said okay. She pulled up her phone, and as I was walking towards her, I'm fairly certain that the movements of her finger were those you make when you delete a conversation in the messenger app.\n\n\nOnce I was next to her, she said that she had deleted their conversation. She said she often deletes conversations, because she is afraid that I would see something that looks worse than it is, and be angry at her. Not only conversations with Tim but also with her (girl) friends, and other guys. She said that for example, Tim sometimes calls her 'babe'. She insisted that she had deleted the conversation some days back, and that she regularly does so.\n\n\nI told her to let me see her phone, that I wanted to go through the phone's location history or conversations on other apps, and she wouldn't let me. She said she was afraid if I saw something in the location history which she wouldn't remember and couldn't explain, that I would get angry. I gave her an ultimatum, that the relationship was over if I she couldn't allow me to see her phone so I could at least 'have something to work with' in terms of trusting her again. She still denied me of going through her phone. \n\n\nIn the end I gave in, and thought that I don't have any proof of anything happening between them, and she might just be telling the truth.\n\nJust by telling John about the confrontation later on, I thought I was an idiot for still being with her. Just by writing this here, I think I'm an idiot still being with her. This sounds terrible, and I simply can't trust her, and she might very well have cheated on me (but of course she might well have not).\n\nI think I should break up with her, but obviously I'm invested in this relationship and would like too seek your advice before doing so.\n\nWhat are my options? What can I do in this situation? What are your opionions on what happened? Do any of you have a similar experience where you have been Sandra in this situation, where you deleted a conversation but it wasn't because you were cheating but just that there was something that looked bad and might make your SO angry?\n\n  ---   \n  **tl;dr**: Girlfriend deleted conversation with her newly aquired best friend and wouldn't let me go through her phone's location history, and I think I should break up with her because I feel I can't trust her.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "65v2jx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 131, "report_reasons": null, "author": "relationship01234", "saved": false, "mod_reports": [], "name": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-vt relationships", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65v2jx/i_26_m_confronted_my_girlfriend_25_f_of_3_years/", "num_reports": null, "locked": false, "stickied": false, "created": 1492458519.0, "url": "https://www.reddit.com/r/relationships/comments/65v2jx/i_26_m_confronted_my_girlfriend_25_f_of_3_years/", "author_flair_text": null, "quarantine": false, "title": "I [26 M] confronted my girlfriend [25 F] of 3 years about new close friend [~23 M] and she had deleted their conversation", "created_utc": 1492429719.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 129, "visited": false, "subreddit_type": "public", "ups": 131}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdydme", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kilagria", "parent_id": "t1_dgdwbi4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I wouldn't go through so much hassle op, it's clear what she's doing here. If I were\"Sandra\" in this scenario I wouldn't make bullshit excuses for the messages, I'd straight up tell my SO what the messages were so she wouldn't get the wrong idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t go through so much hassle op, it&amp;#39;s clear what she&amp;#39;s doing here. If I were&amp;quot;Sandra&amp;quot; in this scenario I wouldn&amp;#39;t make bullshit excuses for the messages, I&amp;#39;d straight up tell my SO what the messages were so she wouldn&amp;#39;t get the wrong idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdydme", "score_hidden": true, "stickied": false, "created": 1492485139.0, "created_utc": 1492456339.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdwbi4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nicqui", "parent_id": "t1_dgdrv7c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You can recover these things, and that's what I'd do. Get a PC app to recover her texts and read them. She will never agree to this btw.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can recover these things, and that&amp;#39;s what I&amp;#39;d do. Get a PC app to recover her texts and read them. She will never agree to this btw.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdwbi4", "score_hidden": true, "stickied": false, "created": 1492482808.0, "created_utc": 1492454008.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrv7c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdriid", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The thing is that now she has had the opportunity to delete said location data. As far as I can tell however you are only able to delete all of it - not single instances. So It will be very clear if she has done so.\n\nSadly, I can't imagine there is anything realistic that can confirm that she wasn't doing anything wrong. The conversation is deleted and that is the issue. I could ask Tim about it, but that is kind of ridicoulus, and if he says no then of course he might be lying - the only thing I could get from him that worth anything is if he says yes. If cheating was actually happening I imagine she has already spoken with Tim about my confrontation yesterday.\n\nEdit to add:\nAnd even if I get to see location data, emotional cheating might still have been happening, or physical cheating might have been happening at the gym or something. It's really just how she handled the whole thing that makes this so suspicious.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is that now she has had the opportunity to delete said location data. As far as I can tell however you are only able to delete all of it - not single instances. So It will be very clear if she has done so.&lt;/p&gt;\n\n&lt;p&gt;Sadly, I can&amp;#39;t imagine there is anything realistic that can confirm that she wasn&amp;#39;t doing anything wrong. The conversation is deleted and that is the issue. I could ask Tim about it, but that is kind of ridicoulus, and if he says no then of course he might be lying - the only thing I could get from him that worth anything is if he says yes. If cheating was actually happening I imagine she has already spoken with Tim about my confrontation yesterday.&lt;/p&gt;\n\n&lt;p&gt;Edit to add:\nAnd even if I get to see location data, emotional cheating might still have been happening, or physical cheating might have been happening at the gym or something. It&amp;#39;s really just how she handled the whole thing that makes this so suspicious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdrv7c", "score_hidden": true, "stickied": false, "created": 1492477867.0, "created_utc": 1492449067.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdriid", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EatinToasterStrudel", "parent_id": "t1_dgdr4g7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I agree with others that there's little point and you're certainly right in just leaving because you do leave yourself open to being lied to again, which you note she's skillful at, another red flag big enough to cover a football field with. So it can be safer to just leave and keep yourself from being continued to be manipulated. But I understand the need to know. So be careful.\n\nEstablish specific things you absolutely need that you don't think are faked, like the location data.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with others that there&amp;#39;s little point and you&amp;#39;re certainly right in just leaving because you do leave yourself open to being lied to again, which you note she&amp;#39;s skillful at, another red flag big enough to cover a football field with. So it can be safer to just leave and keep yourself from being continued to be manipulated. But I understand the need to know. So be careful.&lt;/p&gt;\n\n&lt;p&gt;Establish specific things you absolutely need that you don&amp;#39;t think are faked, like the location data.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdriid", "score_hidden": true, "stickied": false, "created": 1492477470.0, "created_utc": 1492448670.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdr4g7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdquqk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;I'd lay it out one last time and say that if you can't prove what you're saying, you're walking.\n\nI think that might very well be what I'll do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;d lay it out one last time and say that if you can&amp;#39;t prove what you&amp;#39;re saying, you&amp;#39;re walking.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think that might very well be what I&amp;#39;ll do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdr4g7", "score_hidden": true, "stickied": false, "created": 1492477037.0, "created_utc": 1492448237.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdquqk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EatinToasterStrudel", "parent_id": "t1_dgdfmxl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Well, technically you have no proof she did anything wrong. But she's basically gone by the book of how to badly hide that you've done something wrong. \n\nYou need truat. She's specifically saying you can't verify your trust, you simply need to take her word when she's flying more red flags than a beach in a hurricane. \n\nShe's acting like she did something wrong. Now do you know she has? No. I mean, you do, but you don't if you follow. If you don't want to just end it then I'd lay it out one last time and say that if you can't prove what you're saying, you're walking. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, technically you have no proof she did anything wrong. But she&amp;#39;s basically gone by the book of how to badly hide that you&amp;#39;ve done something wrong. &lt;/p&gt;\n\n&lt;p&gt;You need truat. She&amp;#39;s specifically saying you can&amp;#39;t verify your trust, you simply need to take her word when she&amp;#39;s flying more red flags than a beach in a hurricane. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s acting like she did something wrong. Now do you know she has? No. I mean, you do, but you don&amp;#39;t if you follow. If you don&amp;#39;t want to just end it then I&amp;#39;d lay it out one last time and say that if you can&amp;#39;t prove what you&amp;#39;re saying, you&amp;#39;re walking. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdquqk", "score_hidden": true, "stickied": false, "created": 1492476737.0, "created_utc": 1492447937.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dge2b1c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "samuelgia", "parent_id": "t1_dgdfmxl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She may have deleted the history but you can always check the picture folder.\n\nYou know that folder that keeps all the photos that are send or received!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She may have deleted the history but you can always check the picture folder.&lt;/p&gt;\n\n&lt;p&gt;You know that folder that keeps all the photos that are send or received!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge2b1c", "score_hidden": true, "stickied": false, "created": 1492489564.0, "created_utc": 1492460764.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfmxl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgde4kg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I know. Rational me knows and I'll probably look back on this one day and think 'what the hell was I thinking'. I just want to get some advice and perspectives from other people to confirm I'm not acting irrationally before I end a long relationship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know. Rational me knows and I&amp;#39;ll probably look back on this one day and think &amp;#39;what the hell was I thinking&amp;#39;. I just want to get some advice and perspectives from other people to confirm I&amp;#39;m not acting irrationally before I end a long relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdfmxl", "score_hidden": true, "stickied": false, "created": 1492462044.0, "created_utc": 1492433244.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgde4kg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lilghostgirl", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "this is all very sketchy. if you think something is really wrong, you're probably right. but you shouldn't be with someone you don't trust, anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this is all very sketchy. if you think something is really wrong, you&amp;#39;re probably right. but you shouldn&amp;#39;t be with someone you don&amp;#39;t trust, anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgde4kg", "score_hidden": true, "stickied": false, "created": 1492458917.0, "created_utc": 1492430117.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdprx8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "twerkshop", "parent_id": "t1_dgdfjhv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "In some ways, ending it without knowing for sure what happened will let you feel better about the decision. Less \"the relationship ended because she betrayed me\" and more \"I broke up with her because I didn't want to be with someone I couldn't fully trust and/or someone who doesn't respect our relationship\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In some ways, ending it without knowing for sure what happened will let you feel better about the decision. Less &amp;quot;the relationship ended because she betrayed me&amp;quot; and more &amp;quot;I broke up with her because I didn&amp;#39;t want to be with someone I couldn&amp;#39;t fully trust and/or someone who doesn&amp;#39;t respect our relationship&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdprx8", "score_hidden": true, "stickied": false, "created": 1492475545.0, "created_utc": 1492446745.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdpt15", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdpmf5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Definitely seems like it's obvious. Wanted to get confirmation from more people before going ahead but I think it looks like I'm going to break up with her.\n\nAnd thanks - I'll probably use your lines in one way or another:\n&gt;Tell her that your concerns about Tim, whether they're valid or not, are preventing you from enjoying the relationship and you'll both be happier if you leave.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely seems like it&amp;#39;s obvious. Wanted to get confirmation from more people before going ahead but I think it looks like I&amp;#39;m going to break up with her.&lt;/p&gt;\n\n&lt;p&gt;And thanks - I&amp;#39;ll probably use your lines in one way or another:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Tell her that your concerns about Tim, whether they&amp;#39;re valid or not, are preventing you from enjoying the relationship and you&amp;#39;ll both be happier if you leave.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdpt15", "score_hidden": true, "stickied": false, "created": 1492475581.0, "created_utc": 1492446781.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpmf5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OccamsRaiser", "parent_id": "t1_dgdfjhv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It seems like your answer is obvious. \n\nEven the best-case scenario is one in which you're unhappy. In that scenario, she isn't cheating on you and doesn't have feelings for Tim, but you're in a position where you know she is willing to lie, and is good at it. You know that you're now in a position where you basically have to demand she back away from Tim because it makes you feel like shit. \n\nDon't put yourself in a position where you end up becoming less of a good dude in order to cling to something that's making you feel like shit. Tell her that your concerns about Tim, whether they're valid or not, are preventing you from enjoying the relationship and you'll both be happier if you leave. Move on to someone else who is more honest and concerned for your feelings, before you lose that side of yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seems like your answer is obvious. &lt;/p&gt;\n\n&lt;p&gt;Even the best-case scenario is one in which you&amp;#39;re unhappy. In that scenario, she isn&amp;#39;t cheating on you and doesn&amp;#39;t have feelings for Tim, but you&amp;#39;re in a position where you know she is willing to lie, and is good at it. You know that you&amp;#39;re now in a position where you basically have to demand she back away from Tim because it makes you feel like shit. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t put yourself in a position where you end up becoming less of a good dude in order to cling to something that&amp;#39;s making you feel like shit. Tell her that your concerns about Tim, whether they&amp;#39;re valid or not, are preventing you from enjoying the relationship and you&amp;#39;ll both be happier if you leave. Move on to someone else who is more honest and concerned for your feelings, before you lose that side of yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdpmf5", "score_hidden": true, "stickied": false, "created": 1492475375.0, "created_utc": 1492446575.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdydyg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tehlith", "parent_id": "t1_dgdfjhv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'd be more concerned that she was adamantly lying about such an innocuous thing as using your computer. How can you actually expect her to be honest when the truth is much worse than using your computer?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d be more concerned that she was adamantly lying about such an innocuous thing as using your computer. How can you actually expect her to be honest when the truth is much worse than using your computer?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdydyg", "score_hidden": true, "stickied": false, "created": 1492485150.0, "created_utc": 1492456350.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dge16zy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Wubbalubbadubbitydo", "parent_id": "t1_dgdfjhv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That was the moment you should have ended this relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was the moment you should have ended this relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge16zy", "score_hidden": true, "stickied": false, "created": 1492488327.0, "created_utc": 1492459527.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfjhv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgde95b", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I know. It's so heartbreaking that I won't be able to find out exactly what that something is. That she won't come clean even though she was basically out the door at one point during the confrontation (of course if she's lying, she wouldn't want to reveal herself at that point, because if she still insists the lie, that makes it more believable that she insists on it even when the relationship is supposedly over).\n\nAnd on top of that I know that she is able to lie straight to my face very convincingly:\n\nShe has not known the password to my computer, because I never tell anyone, and it wasn't going to start with her, and we have that understanding (and I don't know hers). One night when I'm out with friends she calls me and asks if she can use it to watch a movie, and I tell her to rather use our other computer which is at home, she says ok.\n\nThe following day I'm on my computer and check my browsers history. Someone had been using the computer while I was out with friends. I confronted her and asked if she knew my password. For about 10 minutes, with a VERY straight poker face, she denied, and it was disturbing because I knew she was lying, but she had a completely straight face. I showed her the browser history and she still insisted. Then at a random point while I of course insisted that she was lying, she admitted that she knew it because I had saved it on accident on another computer (I used the same password on some account and my computer).\n\nKnowing that she is perfectly able to maintain a lie with a straight face is terrible in this situation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know. It&amp;#39;s so heartbreaking that I won&amp;#39;t be able to find out exactly what that something is. That she won&amp;#39;t come clean even though she was basically out the door at one point during the confrontation (of course if she&amp;#39;s lying, she wouldn&amp;#39;t want to reveal herself at that point, because if she still insists the lie, that makes it more believable that she insists on it even when the relationship is supposedly over).&lt;/p&gt;\n\n&lt;p&gt;And on top of that I know that she is able to lie straight to my face very convincingly:&lt;/p&gt;\n\n&lt;p&gt;She has not known the password to my computer, because I never tell anyone, and it wasn&amp;#39;t going to start with her, and we have that understanding (and I don&amp;#39;t know hers). One night when I&amp;#39;m out with friends she calls me and asks if she can use it to watch a movie, and I tell her to rather use our other computer which is at home, she says ok.&lt;/p&gt;\n\n&lt;p&gt;The following day I&amp;#39;m on my computer and check my browsers history. Someone had been using the computer while I was out with friends. I confronted her and asked if she knew my password. For about 10 minutes, with a VERY straight poker face, she denied, and it was disturbing because I knew she was lying, but she had a completely straight face. I showed her the browser history and she still insisted. Then at a random point while I of course insisted that she was lying, she admitted that she knew it because I had saved it on accident on another computer (I used the same password on some account and my computer).&lt;/p&gt;\n\n&lt;p&gt;Knowing that she is perfectly able to maintain a lie with a straight face is terrible in this situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdfjhv", "score_hidden": true, "stickied": false, "created": 1492461861.0, "created_utc": 1492433061.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgde95b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ohmydearlucia", "parent_id": "t1_dgde79w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That was my gut feeling on it, but I thought I'd put that caveat in there just in case (because I had a bf like that in the past).\n\nShe is definitely acting like she has something to hide.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was my gut feeling on it, but I thought I&amp;#39;d put that caveat in there just in case (because I had a bf like that in the past).&lt;/p&gt;\n\n&lt;p&gt;She is definitely acting like she has something to hide.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgde95b", "score_hidden": true, "stickied": false, "created": 1492459212.0, "created_utc": 1492430412.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dge2k4x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "samuelgia", "parent_id": "t1_dgde79w", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "for the record, I don't know how old the phone is but if you call the phone you can take the call and minimize the call.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;for the record, I don&amp;#39;t know how old the phone is but if you call the phone you can take the call and minimize the call.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge2k4x", "score_hidden": true, "stickied": false, "created": 1492489843.0, "created_utc": 1492461043.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgde79w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgde4ob", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah for the record I never go through her phone, and I couldn't if I wanted too since I don't even know the passcode.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah for the record I never go through her phone, and I couldn&amp;#39;t if I wanted too since I don&amp;#39;t even know the passcode.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgde79w", "score_hidden": true, "stickied": false, "created": 1492459092.0, "created_utc": 1492430292.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgde4ob", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ohmydearlucia", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; Once I was next to her, she said that she had deleted their conversation. She said she often deletes conversations, because she is afraid that I would see something that looks worse than it is, and be angry at her. Not only conversations with Tim but also with her (girl) friends, and other guys. She said that for example, Tim sometimes calls her 'babe'. She insisted that she had deleted the conversation some days back, and that she regularly does so.\n\nThis is bullshit, and these are not the actions of someone with nothing to hide...unless you are controlling and frequently go through her phone.\n\nYou're not an idiot--you're in love with her and are clinging to a last bit of (what I feel is false) hope. You gave in yesterday, but that doesn't mean you can't decide at any point today or tomorrow or a month from now to end the relationship. ", "edited": 1492447171.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Once I was next to her, she said that she had deleted their conversation. She said she often deletes conversations, because she is afraid that I would see something that looks worse than it is, and be angry at her. Not only conversations with Tim but also with her (girl) friends, and other guys. She said that for example, Tim sometimes calls her &amp;#39;babe&amp;#39;. She insisted that she had deleted the conversation some days back, and that she regularly does so.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is bullshit, and these are not the actions of someone with nothing to hide...unless you are controlling and frequently go through her phone.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re not an idiot--you&amp;#39;re in love with her and are clinging to a last bit of (what I feel is false) hope. You gave in yesterday, but that doesn&amp;#39;t mean you can&amp;#39;t decide at any point today or tomorrow or a month from now to end the relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgde4ob", "score_hidden": true, "stickied": false, "created": 1492458925.0, "created_utc": 1492430125.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdnwa6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdnhlw", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; She's not acting like a girlfriend, she's playing around as if she's single. So let her be.\n\nWell put. Yeah I'm fairly sure that she is emotionally cheating, but there is that minor possibility that she deleted because of something that wasn't emotional cheating, but maybe just something else that she couldn't imagine me seeing. I can't think of what that would be though..\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She&amp;#39;s not acting like a girlfriend, she&amp;#39;s playing around as if she&amp;#39;s single. So let her be.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well put. Yeah I&amp;#39;m fairly sure that she is emotionally cheating, but there is that minor possibility that she deleted because of something that wasn&amp;#39;t emotional cheating, but maybe just something else that she couldn&amp;#39;t imagine me seeing. I can&amp;#39;t think of what that would be though..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnwa6", "score_hidden": true, "stickied": false, "created": 1492473423.0, "created_utc": 1492444623.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnhlw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lingeringthoughts", "parent_id": "t1_dgdhz5z", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I know it's hard since you have history with her, but just know reading the conversation wouldn't have done anything but hurt you. I think it's better that she delete the conversation. This way you don't have to read the conversation, and you know that she is hiding something. Think about it this way: if she did care about you she would rather show you that there's nothing going on, rather than her bullshit reason for deleting the convo. Even if she's not physically cheating on you remember she is emotionally. She knows she can push you around.. don't let her do that to you. You deserve someone who only thinks about you. She's not acting like a girlfriend, she's playing around as if she's single. So let her be. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it&amp;#39;s hard since you have history with her, but just know reading the conversation wouldn&amp;#39;t have done anything but hurt you. I think it&amp;#39;s better that she delete the conversation. This way you don&amp;#39;t have to read the conversation, and you know that she is hiding something. Think about it this way: if she did care about you she would rather show you that there&amp;#39;s nothing going on, rather than her bullshit reason for deleting the convo. Even if she&amp;#39;s not physically cheating on you remember she is emotionally. She knows she can push you around.. don&amp;#39;t let her do that to you. You deserve someone who only thinks about you. She&amp;#39;s not acting like a girlfriend, she&amp;#39;s playing around as if she&amp;#39;s single. So let her be. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnhlw", "score_hidden": true, "stickied": false, "created": 1492472959.0, "created_utc": 1492444159.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhz5z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdh3rf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think she might fall under the category of having sometimes not set the boundaries I would have wanted in the past. I know that she gets some attention on social media (guys that reply to her story on Instagram or Snapchat) and I know in many cases she doesn't ask them to stop. So I definitely think she enjoys the attention, I'm sure of it. She is in very good shape and regularly posts pictures of her where she is just wearing pants/shorts and a bra or sports bra. But I would be more okay with that if I had full trust in her. I think it is okay to enjoy attention even though you are in a relationship - as long as you are fully dedicated to the relationship and set the appropriate boundaries, and the relationship has a 100% mutual trust. Sadly that isn't the case with us now (we don't have 100% mutual trust edit: and I'm not sure she sets appropriate boundaries).\n\nI also think she has a crush on Tim, and I'm heartbroken to know that I'll never know what went on in their conversations, or if anything was actually going on that would be an emotional or physical affair.\n\nI learned about the term gaslighting just like 3 weeks ago, and since then I've thought a lot about if I've been gaslighted by her during our relationship. Thanks for confirming to me that that is what is happening now.", "edited": 1492439822.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think she might fall under the category of having sometimes not set the boundaries I would have wanted in the past. I know that she gets some attention on social media (guys that reply to her story on Instagram or Snapchat) and I know in many cases she doesn&amp;#39;t ask them to stop. So I definitely think she enjoys the attention, I&amp;#39;m sure of it. She is in very good shape and regularly posts pictures of her where she is just wearing pants/shorts and a bra or sports bra. But I would be more okay with that if I had full trust in her. I think it is okay to enjoy attention even though you are in a relationship - as long as you are fully dedicated to the relationship and set the appropriate boundaries, and the relationship has a 100% mutual trust. Sadly that isn&amp;#39;t the case with us now (we don&amp;#39;t have 100% mutual trust edit: and I&amp;#39;m not sure she sets appropriate boundaries).&lt;/p&gt;\n\n&lt;p&gt;I also think she has a crush on Tim, and I&amp;#39;m heartbroken to know that I&amp;#39;ll never know what went on in their conversations, or if anything was actually going on that would be an emotional or physical affair.&lt;/p&gt;\n\n&lt;p&gt;I learned about the term gaslighting just like 3 weeks ago, and since then I&amp;#39;ve thought a lot about if I&amp;#39;ve been gaslighted by her during our relationship. Thanks for confirming to me that that is what is happening now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdhz5z", "score_hidden": true, "stickied": false, "created": 1492465912.0, "created_utc": 1492437112.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdh3rf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kesinhants", "parent_id": "t1_dgdf9ue", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is a textbook case of gaslighting. You and John can see her behavior is very shady, but she is twisting your thoughts to make it seem like you are being paranoid and controlling. \n\nIf your girlfriend does not think she is doing anything wrong then she has a problem with setting boundaries with other guys. If she has never had a problem with setting boundaries in the past then she is, at the very least, at the beginnings of an emotional affair.\n\nI think she has a crush on Tim and is enjoying the attention. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a textbook case of gaslighting. You and John can see her behavior is very shady, but she is twisting your thoughts to make it seem like you are being paranoid and controlling. &lt;/p&gt;\n\n&lt;p&gt;If your girlfriend does not think she is doing anything wrong then she has a problem with setting boundaries with other guys. If she has never had a problem with setting boundaries in the past then she is, at the very least, at the beginnings of an emotional affair.&lt;/p&gt;\n\n&lt;p&gt;I think she has a crush on Tim and is enjoying the attention. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdh3rf", "score_hidden": true, "stickied": false, "created": 1492464549.0, "created_utc": 1492435749.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdluev", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdlc3o", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I see no evidence of her trying to fix or rectify the situation\n \nTo be fair she did say she'd stop liking that guys pictures. But yeah from your comment and others here I think she at the very least doesn't set appropriate boundaries with friends.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I see no evidence of her trying to fix or rectify the situation&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To be fair she did say she&amp;#39;d stop liking that guys pictures. But yeah from your comment and others here I think she at the very least doesn&amp;#39;t set appropriate boundaries with friends.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdluev", "score_hidden": true, "stickied": false, "created": 1492471048.0, "created_utc": 1492442248.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlc3o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Anagiesays", "parent_id": "t1_dgdf9ue", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;That guy also regularly trains with them and she tells me of course that she is not giving him any hints, that she just likes to have friends to train with and she 'can't do anything about the fact that some guys at the gym are into her'.\n\nShe could tell them to dial it back or remove herself from the situation. \n\nIt's your girlfriend's responsibility to set and maintain boundaries with her friends. She hasn't been doing that. I think the big take away from your post is that she likes the attention and she doesn't want it to stop. You've said your piece and she's either given you excuses or shifted the blame to you. I see no evidence of her trying to fix or rectify the situation, and I think that says a lot. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That guy also regularly trains with them and she tells me of course that she is not giving him any hints, that she just likes to have friends to train with and she &amp;#39;can&amp;#39;t do anything about the fact that some guys at the gym are into her&amp;#39;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She could tell them to dial it back or remove herself from the situation. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s your girlfriend&amp;#39;s responsibility to set and maintain boundaries with her friends. She hasn&amp;#39;t been doing that. I think the big take away from your post is that she likes the attention and she doesn&amp;#39;t want it to stop. You&amp;#39;ve said your piece and she&amp;#39;s either given you excuses or shifted the blame to you. I see no evidence of her trying to fix or rectify the situation, and I think that says a lot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdlc3o", "score_hidden": true, "stickied": false, "created": 1492470427.0, "created_utc": 1492441627.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdwz7k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "walk_through_this", "parent_id": "t1_dgdf9ue", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My rule is: I don't have to tell my wife everything I do, but I don't do things I wouldn't want my wife to find out about. She thinks you should trust her without giving you any reason to. I doubt that she's being perfectly faithful here, but even if she were, she's not giving you any reason to trust her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My rule is: I don&amp;#39;t have to tell my wife everything I do, but I don&amp;#39;t do things I wouldn&amp;#39;t want my wife to find out about. She thinks you should trust her without giving you any reason to. I doubt that she&amp;#39;s being perfectly faithful here, but even if she were, she&amp;#39;s not giving you any reason to trust her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdwz7k", "score_hidden": true, "stickied": false, "created": 1492483550.0, "created_utc": 1492454750.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdf9ue", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgded5n", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That's what I thought - I actually said that to her, that if she is doing things that she feels she has to delete, she probably shouldn't be doing them.\n\nShe makes it sound like I'll always get really angry and 'use it against her', but the fact is that our relationship is not like that - we're rational, I'm very rational and she knows that, I don't give her a hard time on things when she is able to explain them.\n\nAnd yeah I've really had an issue with that friend of Tim's. He has gone through her instagram and liked old pictures, but only those where she's only wearing a bikini or something. He's given her all the hints, and Tim has directly told her that he's into her. Given all that, I think it's inappropriate of her that she has liked a few pictures on his profile, and commented on one.\n\nThat guy also regularly trains with them and she tells me of course that she is not giving him any hints, that she just likes to have friends to train with and she 'can't do anything about the fact that some guys at the gym are into her'.\n\nI actually confronted her about that earlier in the day, and while she didn't disagree with me that it was inappropriate, she tried to fight me on it - that she just wants to be able to have friends without me having issues with that because she feels that she has to be so careful about everything so that I don't get angry. But as I said above, that has not been a thing in our relationship - that I frequently get angry for that reason or any other reason for that matter. I only confront her when I think something is possibly inappropriate, and I don't even do it angrily - I just discuss it with her calmly (of course sometimes discussions haven't ended calmly, but the blame for that is certainly equally divided between us).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I thought - I actually said that to her, that if she is doing things that she feels she has to delete, she probably shouldn&amp;#39;t be doing them.&lt;/p&gt;\n\n&lt;p&gt;She makes it sound like I&amp;#39;ll always get really angry and &amp;#39;use it against her&amp;#39;, but the fact is that our relationship is not like that - we&amp;#39;re rational, I&amp;#39;m very rational and she knows that, I don&amp;#39;t give her a hard time on things when she is able to explain them.&lt;/p&gt;\n\n&lt;p&gt;And yeah I&amp;#39;ve really had an issue with that friend of Tim&amp;#39;s. He has gone through her instagram and liked old pictures, but only those where she&amp;#39;s only wearing a bikini or something. He&amp;#39;s given her all the hints, and Tim has directly told her that he&amp;#39;s into her. Given all that, I think it&amp;#39;s inappropriate of her that she has liked a few pictures on his profile, and commented on one.&lt;/p&gt;\n\n&lt;p&gt;That guy also regularly trains with them and she tells me of course that she is not giving him any hints, that she just likes to have friends to train with and she &amp;#39;can&amp;#39;t do anything about the fact that some guys at the gym are into her&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;I actually confronted her about that earlier in the day, and while she didn&amp;#39;t disagree with me that it was inappropriate, she tried to fight me on it - that she just wants to be able to have friends without me having issues with that because she feels that she has to be so careful about everything so that I don&amp;#39;t get angry. But as I said above, that has not been a thing in our relationship - that I frequently get angry for that reason or any other reason for that matter. I only confront her when I think something is possibly inappropriate, and I don&amp;#39;t even do it angrily - I just discuss it with her calmly (of course sometimes discussions haven&amp;#39;t ended calmly, but the blame for that is certainly equally divided between us).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdf9ue", "score_hidden": true, "stickied": false, "created": 1492461345.0, "created_utc": 1492432545.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgded5n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Anagiesays", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think John has your back here, and that you should probably listen to him. If your girlfriend is doing or saying something that could be misconstrued as wrong, then she probably shouldn't be doing it. Her excuse is weak at best. \n\nKeep in mind that it really doesn't matter if she's actually cheating on you or not. She's not respecting your relationship when she's reaching out to other guys when she knows they have a crush on her. You've also been told by other people that her behavior with other guys is raising eyebrows. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think John has your back here, and that you should probably listen to him. If your girlfriend is doing or saying something that could be misconstrued as wrong, then she probably shouldn&amp;#39;t be doing it. Her excuse is weak at best. &lt;/p&gt;\n\n&lt;p&gt;Keep in mind that it really doesn&amp;#39;t matter if she&amp;#39;s actually cheating on you or not. She&amp;#39;s not respecting your relationship when she&amp;#39;s reaching out to other guys when she knows they have a crush on her. You&amp;#39;ve also been told by other people that her behavior with other guys is raising eyebrows. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgded5n", "score_hidden": true, "stickied": false, "created": 1492459471.0, "created_utc": 1492430671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdn759", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdmzck", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah I know. It's plausible, but definitely weird.\n\nI think the fact that she told me about it all was just because she was concerned I might some day somehow check her location history and see that, so she preemptively explained it. So I basically know that she has definitely gone to his home for about 40 minutes at some point, but I have no way of knowing whether they were just eating or not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I know. It&amp;#39;s plausible, but definitely weird.&lt;/p&gt;\n\n&lt;p&gt;I think the fact that she told me about it all was just because she was concerned I might some day somehow check her location history and see that, so she preemptively explained it. So I basically know that she has definitely gone to his home for about 40 minutes at some point, but I have no way of knowing whether they were just eating or not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdn759", "score_hidden": true, "stickied": false, "created": 1492472625.0, "created_utc": 1492443825.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmzck", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "antioch75", "parent_id": "t1_dgdmk78", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yea, Again sorry you are going through this.  \nAnd I want to second that the food thing..the trip to his house...makes no rational sense...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea, Again sorry you are going through this.&lt;br/&gt;\nAnd I want to second that the food thing..the trip to his house...makes no rational sense...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmzck", "score_hidden": true, "stickied": false, "created": 1492472378.0, "created_utc": 1492443578.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmk78", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdmbz6", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah that came out a little wrong - I realise that she was of course not 'just calling a bluff'. She was making the decision to break up rather than allowing me to check her phone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah that came out a little wrong - I realise that she was of course not &amp;#39;just calling a bluff&amp;#39;. She was making the decision to break up rather than allowing me to check her phone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmk78", "score_hidden": true, "stickied": false, "created": 1492471889.0, "created_utc": 1492443089.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmbz6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "antioch75", "parent_id": "t1_dgdice6", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Oh I understand, we know our passwords and such, yet I don't check her phone.  \nAnd personally I don't care if she has ever checked mine.  \nShe might have been \"calling a bluff\", however to me this would be the same as going into your bank and then telling you they will foreclose if you don't pay, then not paying.  \nYou may be calling a bluff or not, but the same with card games, you need to take the results of your bet.  \nShe had no way of knowing 100% that you wouldn't kick her out then and there. Do you really want to deal with that? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh I understand, we know our passwords and such, yet I don&amp;#39;t check her phone.&lt;br/&gt;\nAnd personally I don&amp;#39;t care if she has ever checked mine.&lt;br/&gt;\nShe might have been &amp;quot;calling a bluff&amp;quot;, however to me this would be the same as going into your bank and then telling you they will foreclose if you don&amp;#39;t pay, then not paying.&lt;br/&gt;\nYou may be calling a bluff or not, but the same with card games, you need to take the results of your bet.&lt;br/&gt;\nShe had no way of knowing 100% that you wouldn&amp;#39;t kick her out then and there. Do you really want to deal with that? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmbz6", "score_hidden": true, "stickied": false, "created": 1492471622.0, "created_utc": 1492442822.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdice6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdh8r1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah I think of the fact that she didn't allow me to view her location history in the same way as you.\n\nI agree in with you on this:\n&gt;Let me just say the one thing my wife and I agree on, if you are doing nothing wrong, then there is no reason to hide anything. We had our 15 year anniversary last month.\n\nbut to give some context as to why this isn't a complete confirmation of something sketchy, in our relationship we haven't generally known each others passwords to phones, computers or social media accounts, and I basically never touch her phone or she mine unless right in front of each other to change the song on spotify or something.\n\nBut still of course, when her options are to break up or show me location history and she chooses break up, it is to me a confirmation that something is there that shouldn't.\n\nEdit: as u/Sihada said [here](https://rr.reddit.com/r/relationships/comments/65v2jx/i_26_m_confronted_my_girlfriend_25_f_of_3_years/dgdimve/), she was most likely just calling my bluff - not actually 'choosing to break up'", "edited": 1492438508.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I think of the fact that she didn&amp;#39;t allow me to view her location history in the same way as you.&lt;/p&gt;\n\n&lt;p&gt;I agree in with you on this:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Let me just say the one thing my wife and I agree on, if you are doing nothing wrong, then there is no reason to hide anything. We had our 15 year anniversary last month.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;but to give some context as to why this isn&amp;#39;t a complete confirmation of something sketchy, in our relationship we haven&amp;#39;t generally known each others passwords to phones, computers or social media accounts, and I basically never touch her phone or she mine unless right in front of each other to change the song on spotify or something.&lt;/p&gt;\n\n&lt;p&gt;But still of course, when her options are to break up or show me location history and she chooses break up, it is to me a confirmation that something is there that shouldn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;Edit: as &lt;a href=\"/u/Sihada\"&gt;u/Sihada&lt;/a&gt; said &lt;a href=\"https://rr.reddit.com/r/relationships/comments/65v2jx/i_26_m_confronted_my_girlfriend_25_f_of_3_years/dgdimve/\"&gt;here&lt;/a&gt;, she was most likely just calling my bluff - not actually &amp;#39;choosing to break up&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdice6", "score_hidden": true, "stickied": false, "created": 1492466456.0, "created_utc": 1492437656.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdh8r1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "antioch75", "parent_id": "t1_dgdfsmm", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I am sorry you have to go through this.  \nIt is just, there are so many ways that your trust could have been confirmed so easily, and yet every one she blocked.  \nHeck the most telling to me is the location options, that right there pretty much confirms things, at least to me.  \nEDIT: Let me just say the one thing my wife and I agree on, if you are doing nothing wrong, then there is no reason to hide anything.  We had our 15 year anniversary last month.", "edited": 1492436299.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sorry you have to go through this.&lt;br/&gt;\nIt is just, there are so many ways that your trust could have been confirmed so easily, and yet every one she blocked.&lt;br/&gt;\nHeck the most telling to me is the location options, that right there pretty much confirms things, at least to me.&lt;br/&gt;\nEDIT: Let me just say the one thing my wife and I agree on, if you are doing nothing wrong, then there is no reason to hide anything.  We had our 15 year anniversary last month.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdh8r1", "score_hidden": true, "stickied": false, "created": 1492464775.0, "created_utc": 1492435975.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdqbm1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdq80f", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Probably true that she's putting out feelers - at least she does enjoy attention from other guys, and no I wouldn't want to be with someone like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably true that she&amp;#39;s putting out feelers - at least she does enjoy attention from other guys, and no I wouldn&amp;#39;t want to be with someone like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdqbm1", "score_hidden": true, "stickied": false, "created": 1492476153.0, "created_utc": 1492447353.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq80f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "clockinmyrari", "parent_id": "t1_dgdfsmm", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You caved and she saw that you caved, she would think that she can get away with anything. If I learned anything, it's that living in a relationship without trust is not a way to live at all. \n\nShe seems to be putting out \"feelers\" so that she has a backup to fall on once you leave ... do you really want someone like that ? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You caved and she saw that you caved, she would think that she can get away with anything. If I learned anything, it&amp;#39;s that living in a relationship without trust is not a way to live at all. &lt;/p&gt;\n\n&lt;p&gt;She seems to be putting out &amp;quot;feelers&amp;quot; so that she has a backup to fall on once you leave ... do you really want someone like that ? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdq80f", "score_hidden": true, "stickied": false, "created": 1492476041.0, "created_utc": 1492447241.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfsmm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdf306", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It is. Thank you for confirming that other people think so too. That's the purpose of the thread - I wanted to see if other people would agree with my thoughts on this and other perspectives.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is. Thank you for confirming that other people think so too. That&amp;#39;s the purpose of the thread - I wanted to see if other people would agree with my thoughts on this and other perspectives.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdfsmm", "score_hidden": true, "stickied": false, "created": 1492462337.0, "created_utc": 1492433537.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdf306", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "antioch75", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You gave her a choice.  \nEnd the relationship or show you the phone.  \nShe made her choice, isn't that pretty obvious here?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You gave her a choice.&lt;br/&gt;\nEnd the relationship or show you the phone.&lt;br/&gt;\nShe made her choice, isn&amp;#39;t that pretty obvious here?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdf306", "score_hidden": true, "stickied": false, "created": 1492460976.0, "created_utc": 1492432176.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdg630", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheKingOfKolo", "parent_id": "t1_dgdfo39", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I mean .. lets be honest ... she can easily delete the message but can she delete the fact that you have just lost all the trust in her ? I dont think so ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean .. lets be honest ... she can easily delete the message but can she delete the fact that you have just lost all the trust in her ? I dont think so &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdg630", "score_hidden": true, "stickied": false, "created": 1492462994.0, "created_utc": 1492434194.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdrfz9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_Woodrow_", "parent_id": "t1_dgdp8ry", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The older you get the more you realize there is nothing new under the sun. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The older you get the more you realize there is nothing new under the sun. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdrfz9", "score_hidden": true, "stickied": false, "created": 1492477392.0, "created_utc": 1492448592.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdp8ry", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdoust", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm a little amazed by how much you were able to read into her from my writing but you're probably perfectly right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a little amazed by how much you were able to read into her from my writing but you&amp;#39;re probably perfectly right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdp8ry", "score_hidden": true, "stickied": false, "created": 1492474953.0, "created_utc": 1492446153.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdoust", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_Woodrow_", "parent_id": "t1_dgdnq5h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just going by the playbook of situations like these. \n\nIt's just human nature. For example, my toddler will refuse to eat his dinner because it's yucky, but then cries to get it back when I take it away from him. \"The heart wants what it can't have\" which is partly her attraction to this other guy, and also helps predict her behavior (since she is obviously already susceptible to it)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just going by the playbook of situations like these. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just human nature. For example, my toddler will refuse to eat his dinner because it&amp;#39;s yucky, but then cries to get it back when I take it away from him. &amp;quot;The heart wants what it can&amp;#39;t have&amp;quot; which is partly her attraction to this other guy, and also helps predict her behavior (since she is obviously already susceptible to it)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdoust", "score_hidden": true, "stickied": false, "created": 1492474519.0, "created_utc": 1492445719.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnq5h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdnfe4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "No yeah I know I don't 'need' proof, but that would make things a lot easier. Why are you so certain she is going to beg me not to follow through with the break up?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No yeah I know I don&amp;#39;t &amp;#39;need&amp;#39; proof, but that would make things a lot easier. Why are you so certain she is going to beg me not to follow through with the break up?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnq5h", "score_hidden": true, "stickied": false, "created": 1492473231.0, "created_utc": 1492444431.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnfe4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_Woodrow_", "parent_id": "t1_dgdfo39", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This isn't a court of law, you don't need undeniable proof with a proper chain of custody in order to break things off with a person who is being shady and disrespecting your relationship. \n\nFair warning though, she is going to beg you not to follow through with the break up. It's up to you (and your backbone) how you handle her pleas ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t a court of law, you don&amp;#39;t need undeniable proof with a proper chain of custody in order to break things off with a person who is being shady and disrespecting your relationship. &lt;/p&gt;\n\n&lt;p&gt;Fair warning though, she is going to beg you not to follow through with the break up. It&amp;#39;s up to you (and your backbone) how you handle her pleas &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnfe4", "score_hidden": true, "stickied": false, "created": 1492472889.0, "created_utc": 1492444089.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfo39", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgde5rk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The issue is just that I don't have proof of anything wrong happening. But yeah I think she should have allowed me to go through her phone at that point, it's certainly worrying that she wouldn't.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The issue is just that I don&amp;#39;t have proof of anything wrong happening. But yeah I think she should have allowed me to go through her phone at that point, it&amp;#39;s certainly worrying that she wouldn&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdfo39", "score_hidden": true, "stickied": false, "created": 1492462104.0, "created_utc": 1492433304.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdqocf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheKingOfKolo", "parent_id": "t1_dgdq7s8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If there is no trust, there is no love - no love, no us \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If there is no trust, there is no love - no love, no us &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdqocf", "score_hidden": true, "stickied": false, "created": 1492476536.0, "created_utc": 1492447736.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq7s8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "clockinmyrari", "parent_id": "t1_dgde5rk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just curious , \n1) would you be with someone who doesn't trust you enough to want to check your phone ?\n\n2) would you be with someone who won't show you what's on their phone ? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just curious , \n1) would you be with someone who doesn&amp;#39;t trust you enough to want to check your phone ?&lt;/p&gt;\n\n&lt;p&gt;2) would you be with someone who won&amp;#39;t show you what&amp;#39;s on their phone ? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdq7s8", "score_hidden": true, "stickied": false, "created": 1492476034.0, "created_utc": 1492447234.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgde5rk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheKingOfKolo", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "3 years dating and she does not have a trust in you to show you her phone ? \n\nI would not last with her for another day ...\n\nSorry to say but if girl is untruthful for me, she is gone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;3 years dating and she does not have a trust in you to show you her phone ? &lt;/p&gt;\n\n&lt;p&gt;I would not last with her for another day ...&lt;/p&gt;\n\n&lt;p&gt;Sorry to say but if girl is untruthful for me, she is gone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgde5rk", "score_hidden": true, "stickied": false, "created": 1492458994.0, "created_utc": 1492430194.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdphop", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Viking1865", "parent_id": "t1_dgdp16l", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Oh she probably ate her lunch over there for sure. Need your energy when you're \"training\" so hard. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh she probably ate her lunch over there for sure. Need your energy when you&amp;#39;re &amp;quot;training&amp;quot; so hard. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdphop", "score_hidden": true, "stickied": false, "created": 1492475229.0, "created_utc": 1492446429.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdp16l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdoss6", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "When you put it like that, I see how much I'm believing what I want to be true instead of seeing the obvious. But to be fair there is a slight chance of it being true (it is my honest opinion that it might very well be true, but yeah..).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you put it like that, I see how much I&amp;#39;m believing what I want to be true instead of seeing the obvious. But to be fair there is a slight chance of it being true (it is my honest opinion that it might very well be true, but yeah..).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdp16l", "score_hidden": true, "stickied": false, "created": 1492474717.0, "created_utc": 1492445917.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdoss6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Viking1865", "parent_id": "t1_dgdil84", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;That she had food in tupperware with her, and he was going home to cook something to eat, so she went with him to his place for about 40 minutes, instead of eating alone.\n\nDude......Come on man. You don't honestly believe this, do you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That she had food in tupperware with her, and he was going home to cook something to eat, so she went with him to his place for about 40 minutes, instead of eating alone.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Dude......Come on man. You don&amp;#39;t honestly believe this, do you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdoss6", "score_hidden": true, "stickied": false, "created": 1492474457.0, "created_utc": 1492445657.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdl7u0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anxiousonmybirthday", "parent_id": "t1_dgdil84", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That's something a number of people would feel pretty skeevy about even with open communication on it. She purposely lied by omission here. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s something a number of people would feel pretty skeevy about even with open communication on it. She purposely lied by omission here. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdl7u0", "score_hidden": true, "stickied": false, "created": 1492470278.0, "created_utc": 1492441478.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdletg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dolphinesque", "parent_id": "t1_dgdil84", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So she didn't tell you about it when it happened, like a normal person would do after having lunch with a platonic friend...\n\nMan...I get that you love her and she's hot and all, but she's playing you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So she didn&amp;#39;t tell you about it when it happened, like a normal person would do after having lunch with a platonic friend...&lt;/p&gt;\n\n&lt;p&gt;Man...I get that you love her and she&amp;#39;s hot and all, but she&amp;#39;s playing you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdletg", "score_hidden": true, "stickied": false, "created": 1492470522.0, "created_utc": 1492441722.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgduikt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "clumplings2", "parent_id": "t1_dgdil84", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is called trickle truth.. She won't flat out deny everything as she knows it sounds unbelievable. So she mixes mlies with some believable stuff ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is called trickle truth.. She won&amp;#39;t flat out deny everything as she knows it sounds unbelievable. So she mixes mlies with some believable stuff &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgduikt", "score_hidden": true, "stickied": false, "created": 1492480789.0, "created_utc": 1492451989.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdmtoe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdmg34", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I didn't ask, but I assume she was going to school after gym, not home. So her reasoning is that she just went to eat with someone instead of eating alone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t ask, but I assume she was going to school after gym, not home. So her reasoning is that she just went to eat with someone instead of eating alone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmtoe", "score_hidden": true, "stickied": false, "created": 1492472196.0, "created_utc": 1492443396.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmg34", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bronstin", "parent_id": "t1_dgdil84", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So she brought food to the gym in a tupperware and it sat out while she was training and she was planning to bring that tupperware back home and eat it?  What?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So she brought food to the gym in a tupperware and it sat out while she was training and she was planning to bring that tupperware back home and eat it?  What?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmg34", "score_hidden": true, "stickied": false, "created": 1492471759.0, "created_utc": 1492442959.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdil84", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdi0vw", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah. Afterwards when she asked what I thought I might find in the location history I mentioned maybe she went to his place. She answered that actually she went to his place once after training to eat lunch. That she had food in tupperware with her, and he was going home to cook something to eat, so she went with him to his place for about 40 minutes, instead of eating alone.\n\nWriting this makes me think about how weird that is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah. Afterwards when she asked what I thought I might find in the location history I mentioned maybe she went to his place. She answered that actually she went to his place once after training to eat lunch. That she had food in tupperware with her, and he was going home to cook something to eat, so she went with him to his place for about 40 minutes, instead of eating alone.&lt;/p&gt;\n\n&lt;p&gt;Writing this makes me think about how weird that is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdil84", "score_hidden": true, "stickied": false, "created": 1492466812.0, "created_utc": 1492438012.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdi0vw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aschr", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;She said she often deletes conversations, because she is afraid that I would see something that looks worse than it is, and be angry at her. Not only conversations with Tim but also with her (girl) friends, and other guys. She said that for example, Tim sometimes calls her 'babe'. She insisted that she had deleted the conversation some days back, and that she regularly does so.\n\n&gt;She said she was afraid if I saw something in the location history which she wouldn't remember and couldn't explain, that I would get angry.\n\nShe literally told you straight-up that she's afraid you'll see evidence of her infidelity that she wouldn't be able to explain away. Don't be a chump. It's time to break up, man.\n\nAnd ignoring how brazen she was about this, if your SO is doing shady shit with no explanation and is just dismissing your feelings about it, then you don't need \"solid proof\" to break up with them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She said she often deletes conversations, because she is afraid that I would see something that looks worse than it is, and be angry at her. Not only conversations with Tim but also with her (girl) friends, and other guys. She said that for example, Tim sometimes calls her &amp;#39;babe&amp;#39;. She insisted that she had deleted the conversation some days back, and that she regularly does so.&lt;/p&gt;\n\n&lt;p&gt;She said she was afraid if I saw something in the location history which she wouldn&amp;#39;t remember and couldn&amp;#39;t explain, that I would get angry.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She literally told you straight-up that she&amp;#39;s afraid you&amp;#39;ll see evidence of her infidelity that she wouldn&amp;#39;t be able to explain away. Don&amp;#39;t be a chump. It&amp;#39;s time to break up, man.&lt;/p&gt;\n\n&lt;p&gt;And ignoring how brazen she was about this, if your SO is doing shady shit with no explanation and is just dismissing your feelings about it, then you don&amp;#39;t need &amp;quot;solid proof&amp;quot; to break up with them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdi0vw", "score_hidden": true, "stickied": false, "created": 1492465986.0, "created_utc": 1492437186.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdoi23", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdnv97", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Aah, I see what you're saying. Makes perfect sense and is really good advice.. Ineedtogetoutofhere I guess.\n\nAnd to address that: I don't believe that I have been controlling or emotionally manipulative about these things during our relationship. I do sometimes bring it up if I think something is inappropriate, but I'm fairly certain that those things are something others would agree are inappropriate. When those discussions happen, I always ask 'don't you agree that it is inappropriate? - would you be okay if I were doing the same thing' and usually the answer is yes I agree.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aah, I see what you&amp;#39;re saying. Makes perfect sense and is really good advice.. Ineedtogetoutofhere I guess.&lt;/p&gt;\n\n&lt;p&gt;And to address that: I don&amp;#39;t believe that I have been controlling or emotionally manipulative about these things during our relationship. I do sometimes bring it up if I think something is inappropriate, but I&amp;#39;m fairly certain that those things are something others would agree are inappropriate. When those discussions happen, I always ask &amp;#39;don&amp;#39;t you agree that it is inappropriate? - would you be okay if I were doing the same thing&amp;#39; and usually the answer is yes I agree.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdoi23", "score_hidden": true, "stickied": false, "created": 1492474117.0, "created_utc": 1492445317.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnv97", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anxiousonmybirthday", "parent_id": "t1_dgdn2d5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I was referring to her saying she won't show you her messages or her location because you wouldn't handle it well, sorry for the ambiguous language. We have to trust your word here but if it's true you've never been controlling or emotionally manipulative about these things before, then her essentially telling you you can't handle the truth is pretty insulting, right?  She's basically implying you would be controlling or manipulative, which is a serious thing to think of your partner. \nAnd then if you continued in the relationship, an approach that \"shields you from the truth\" is really just shutting you out of any agency in the relationship. This is a recipe for failure in relationships regardless of the specific issue. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was referring to her saying she won&amp;#39;t show you her messages or her location because you wouldn&amp;#39;t handle it well, sorry for the ambiguous language. We have to trust your word here but if it&amp;#39;s true you&amp;#39;ve never been controlling or emotionally manipulative about these things before, then her essentially telling you you can&amp;#39;t handle the truth is pretty insulting, right?  She&amp;#39;s basically implying you would be controlling or manipulative, which is a serious thing to think of your partner. \nAnd then if you continued in the relationship, an approach that &amp;quot;shields you from the truth&amp;quot; is really just shutting you out of any agency in the relationship. This is a recipe for failure in relationships regardless of the specific issue. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnv97", "score_hidden": true, "stickied": false, "created": 1492473390.0, "created_utc": 1492444590.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdn2d5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdm9lw", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah I think I agree with you on that those are deal breakers. \n\nI'm not following a 100% with this part:\n&gt; and the not telling you because you won't respond well is an awful approach to a relationship. There is no real issue a couple could approach with that mindset without it turning into a trainwreck. That is also a sign of serious deficiencies in the relationship and definitely doesn't serve as an argument for staying.\n\nwhat are you referring to with 'not telling you because you won't respond well'?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I think I agree with you on that those are deal breakers. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not following a 100% with this part:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;and the not telling you because you won&amp;#39;t respond well is an awful approach to a relationship. There is no real issue a couple could approach with that mindset without it turning into a trainwreck. That is also a sign of serious deficiencies in the relationship and definitely doesn&amp;#39;t serve as an argument for staying.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;what are you referring to with &amp;#39;not telling you because you won&amp;#39;t respond well&amp;#39;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdn2d5", "score_hidden": true, "stickied": false, "created": 1492472473.0, "created_utc": 1492443673.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdm9lw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anxiousonmybirthday", "parent_id": "t1_dgdlmv1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She is not willing to compromise or communicate on finding better boundaries, and no I don't think you should be certain because either one should be a deal breaker. If she had disagreed with your ideal boundaries with transparency and openness to finding a solution or compromise, that would be a best case that is better than your current best case. \n\nYour current best case is she doesn't care you disagree and is willing to proceed full steam ahead without much concern to whether it hurts you, because she is enjoying the (at most innocent assumptions) attention. That's a pretty messed up best case, and I think given that you can't trust her to tell the truth even if the relationship is on the line, it would be pretty naive to think you will ever know the full truth.  \n\nEdit to add: and the not telling you because you won't respond well is an awful approach to a relationship. There is no real issue a couple could approach with that mindset without it turning into a trainwreck. That is also a sign of serious deficiencies in the relationship and definitely doesn't serve as an argument for staying. Your best case there is that she doesn't respect you enough to expect you to respond rationally or reasonably to the situation and doesn't care to communicate clearly about what you could to better. It's not really a better best case and you are just trying to rationalize your way out of doing the hard but right thing here. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She is not willing to compromise or communicate on finding better boundaries, and no I don&amp;#39;t think you should be certain because either one should be a deal breaker. If she had disagreed with your ideal boundaries with transparency and openness to finding a solution or compromise, that would be a best case that is better than your current best case. &lt;/p&gt;\n\n&lt;p&gt;Your current best case is she doesn&amp;#39;t care you disagree and is willing to proceed full steam ahead without much concern to whether it hurts you, because she is enjoying the (at most innocent assumptions) attention. That&amp;#39;s a pretty messed up best case, and I think given that you can&amp;#39;t trust her to tell the truth even if the relationship is on the line, it would be pretty naive to think you will ever know the full truth.  &lt;/p&gt;\n\n&lt;p&gt;Edit to add: and the not telling you because you won&amp;#39;t respond well is an awful approach to a relationship. There is no real issue a couple could approach with that mindset without it turning into a trainwreck. That is also a sign of serious deficiencies in the relationship and definitely doesn&amp;#39;t serve as an argument for staying. Your best case there is that she doesn&amp;#39;t respect you enough to expect you to respond rationally or reasonably to the situation and doesn&amp;#39;t care to communicate clearly about what you could to better. It&amp;#39;s not really a better best case and you are just trying to rationalize your way out of doing the hard but right thing here. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdm9lw", "score_hidden": true, "stickied": false, "created": 1492471546.0, "created_utc": 1492442746.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlmv1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdl54k", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks, that is beautifully written and good advice.\n\nWhat I was thinking when I gave in on my ultimatum was what if it is just the 'at best' part?\n&gt;At best, you have different ideas about acceptable boundaries.\n\nAnd I'll regret having broken up with her? Shouldn't I be certain which it is (best or worst) before breaking up with her? Or should I break up with her because of the fact that she wouldn't allow me to go through her phone when presented with an ultimatum (indicating at best that she just can't handle that I might find something there that she can't explain, and at worst that something there proves her cheating)?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, that is beautifully written and good advice.&lt;/p&gt;\n\n&lt;p&gt;What I was thinking when I gave in on my ultimatum was what if it is just the &amp;#39;at best&amp;#39; part?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;At best, you have different ideas about acceptable boundaries.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And I&amp;#39;ll regret having broken up with her? Shouldn&amp;#39;t I be certain which it is (best or worst) before breaking up with her? Or should I break up with her because of the fact that she wouldn&amp;#39;t allow me to go through her phone when presented with an ultimatum (indicating at best that she just can&amp;#39;t handle that I might find something there that she can&amp;#39;t explain, and at worst that something there proves her cheating)?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdlmv1", "score_hidden": true, "stickied": false, "created": 1492470795.0, "created_utc": 1492441995.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdl54k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anxiousonmybirthday", "parent_id": "t1_dgditgf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If you know what kind of person you want to be (a do er, in this instance), take the steps to get there. Posting here is a good one, but don't let it end there. You know what future you would like to see when reflecting on this time in your life, and it's you standing up for yourself and asking for more than the minimum in relationships. Your SO is gaslighting you and would rather hurt you, lose your trust, and lose you than cooperate or communicate. You two aren't compatible. At best, you have different ideas about acceptable boundaries. At worst, she is actively cheating on you. She has a history of lying. \n\nDo what you need to do to make future you proud of the choices you made here. It may never all become clear. You may never know what she did or did not do. But your actions will stick with you, so be the do-er. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you know what kind of person you want to be (a do er, in this instance), take the steps to get there. Posting here is a good one, but don&amp;#39;t let it end there. You know what future you would like to see when reflecting on this time in your life, and it&amp;#39;s you standing up for yourself and asking for more than the minimum in relationships. Your SO is gaslighting you and would rather hurt you, lose your trust, and lose you than cooperate or communicate. You two aren&amp;#39;t compatible. At best, you have different ideas about acceptable boundaries. At worst, she is actively cheating on you. She has a history of lying. &lt;/p&gt;\n\n&lt;p&gt;Do what you need to do to make future you proud of the choices you made here. It may never all become clear. You may never know what she did or did not do. But your actions will stick with you, so be the do-er. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdl54k", "score_hidden": true, "stickied": false, "created": 1492470186.0, "created_utc": 1492441386.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdmryj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lingeringthoughts", "parent_id": "t1_dgditgf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Do yourself a favor and end it, man. This chick is dragging you along while she's playing around with another guy. She's not even trying to hide it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do yourself a favor and end it, man. This chick is dragging you along while she&amp;#39;s playing around with another guy. She&amp;#39;s not even trying to hide it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmryj", "score_hidden": true, "stickied": false, "created": 1492472139.0, "created_utc": 1492443339.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgditgf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdimve", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; You gave an ultimatum and she called your bluff.\n\nI know man. She really did.\n\nI've only been in 1 other long term relationship, and in that one I wanted to get out for some months before we finally broke up, on her initiative. I think I have an issue with breaking up with girls. It doesn't come very easy for me, even though things in the relationship are far from what I would want, and I've addressed those things with my SO, without things being fixed in the long term.\n\nI wish I was more of a 'do-er' in terms of breaking up. I should have done it sooner in my previous relationship, and I suspect that looking back I will also think so of this relationship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You gave an ultimatum and she called your bluff.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I know man. She really did.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve only been in 1 other long term relationship, and in that one I wanted to get out for some months before we finally broke up, on her initiative. I think I have an issue with breaking up with girls. It doesn&amp;#39;t come very easy for me, even though things in the relationship are far from what I would want, and I&amp;#39;ve addressed those things with my SO, without things being fixed in the long term.&lt;/p&gt;\n\n&lt;p&gt;I wish I was more of a &amp;#39;do-er&amp;#39; in terms of breaking up. I should have done it sooner in my previous relationship, and I suspect that looking back I will also think so of this relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgditgf", "score_hidden": true, "stickied": false, "created": 1492467130.0, "created_utc": 1492438330.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdimve", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sihada", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You gave an ultimatum and she called your bluff. \n\nCut losses. Get out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You gave an ultimatum and she called your bluff. &lt;/p&gt;\n\n&lt;p&gt;Cut losses. Get out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdimve", "score_hidden": true, "stickied": false, "created": 1492466877.0, "created_utc": 1492438077.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdhw67", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "toughnupm8", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You've been lied to, gaslighted, and trickle truthed. It's all there dude you are being cheated on. When you got that gut feeling and the people who hang around you get that gut feeling it's probably true. When your girlfriend trickle truths by telling you he calls her \"babe\" and some of her location history would be too hard to explain it's clearly over. She doesn't give a shit about your feelings when she knows damn good and well what he wants \"her ass\" and she keeps going for it because she wants it. You know what to man...Dump your lying cheating girlfriend find a woman who isn't a lying POS.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve been lied to, gaslighted, and trickle truthed. It&amp;#39;s all there dude you are being cheated on. When you got that gut feeling and the people who hang around you get that gut feeling it&amp;#39;s probably true. When your girlfriend trickle truths by telling you he calls her &amp;quot;babe&amp;quot; and some of her location history would be too hard to explain it&amp;#39;s clearly over. She doesn&amp;#39;t give a shit about your feelings when she knows damn good and well what he wants &amp;quot;her ass&amp;quot; and she keeps going for it because she wants it. You know what to man...Dump your lying cheating girlfriend find a woman who isn&amp;#39;t a lying POS.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdhw67", "score_hidden": true, "stickied": false, "created": 1492465784.0, "created_utc": 1492436984.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdfpj4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgde5xg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks for the input. I'm going to wait for more replies and perspectives on this thread and then make a decision.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the input. I&amp;#39;m going to wait for more replies and perspectives on this thread and then make a decision.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdfpj4", "score_hidden": true, "stickied": false, "created": 1492462179.0, "created_utc": 1492433379.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgde5xg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "qsteak", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There is no trust left.  At the very least she is acting inappropriately with him and emotionally cheating. Time to move on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no trust left.  At the very least she is acting inappropriately with him and emotionally cheating. Time to move on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgde5xg", "score_hidden": true, "stickied": false, "created": 1492459005.0, "created_utc": 1492430205.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdkfcu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Listentotheadviceman", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I gave her an ultimatum  \n&gt; In the end I gave in  \n  \nC'mon man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I gave her an ultimatum&lt;br/&gt;\nIn the end I gave in  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;C&amp;#39;mon man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdkfcu", "score_hidden": true, "stickied": false, "created": 1492469286.0, "created_utc": 1492440486.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdl3dl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "drizzdoe", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you know deep down she isn't being honest. It's unclear how far their relationship has gone, but it is definitely inappropriate. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you know deep down she isn&amp;#39;t being honest. It&amp;#39;s unclear how far their relationship has gone, but it is definitely inappropriate. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdl3dl", "score_hidden": true, "stickied": false, "created": 1492470124.0, "created_utc": 1492441324.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdm04m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vo0d0ochild", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If she was innocent, the chat log  was going to help prove it.  Instead she deleted it because she knows there was something innapropiate in there.  \n\nPretty easy call for you to make.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she was innocent, the chat log  was going to help prove it.  Instead she deleted it because she knows there was something innapropiate in there.  &lt;/p&gt;\n\n&lt;p&gt;Pretty easy call for you to make.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdm04m", "score_hidden": true, "stickied": false, "created": 1492471239.0, "created_utc": 1492442439.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdnz6h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdnqmp", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That is awful. Glad she's out of your life now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is awful. Glad she&amp;#39;s out of your life now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnz6h", "score_hidden": true, "stickied": false, "created": 1492473516.0, "created_utc": 1492444716.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnqmp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DonSoChill", "parent_id": "t1_dgdmwhn", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Well I was pretty depressed at the time and that was her rational.\n\nShe kept texting and a guy kept liking her pictures on Facebook. She then left me saying nothing was going on with this other guy and she didn't admit it until we had fully broken up. \n\nHer family knew and never told me and it was that that hurt to be honest.\n\nFun fact, she emailed me asking to borrow money a year later.\n\nI said 'Nah.'", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I was pretty depressed at the time and that was her rational.&lt;/p&gt;\n\n&lt;p&gt;She kept texting and a guy kept liking her pictures on Facebook. She then left me saying nothing was going on with this other guy and she didn&amp;#39;t admit it until we had fully broken up. &lt;/p&gt;\n\n&lt;p&gt;Her family knew and never told me and it was that that hurt to be honest.&lt;/p&gt;\n\n&lt;p&gt;Fun fact, she emailed me asking to borrow money a year later.&lt;/p&gt;\n\n&lt;p&gt;I said &amp;#39;Nah.&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnqmp", "score_hidden": true, "stickied": false, "created": 1492473245.0, "created_utc": 1492444445.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmwhn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdmnce", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Fuck, that sucks, sorry about that.\n\nHow did you eventually find out?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck, that sucks, sorry about that.&lt;/p&gt;\n\n&lt;p&gt;How did you eventually find out?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmwhn", "score_hidden": true, "stickied": false, "created": 1492472287.0, "created_utc": 1492443487.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmnce", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DonSoChill", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My ex asked to go through my phone and I laughed and offered a trade. Hers for mine and she backed down.\n\nShe then went through mine anyway, there was nothing to see but she was convinced. I asked to see hers (knowing she'd decline) and she said no and that she was just texting a friend.\n\nShe was in fact cheating on me. For months. \n\nThere's more to the story but yeah.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My ex asked to go through my phone and I laughed and offered a trade. Hers for mine and she backed down.&lt;/p&gt;\n\n&lt;p&gt;She then went through mine anyway, there was nothing to see but she was convinced. I asked to see hers (knowing she&amp;#39;d decline) and she said no and that she was just texting a friend.&lt;/p&gt;\n\n&lt;p&gt;She was in fact cheating on me. For months. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s more to the story but yeah.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmnce", "score_hidden": true, "stickied": false, "created": 1492471991.0, "created_utc": 1492443191.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdq89p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Biker_roadkill_LOL", "parent_id": "t1_dgdnknd", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Accept the power you have to not need any proof to break up with someone. A true partner doesn't put you through these kind of stresses. \n\nI know you want a tidy conclusion to this, but accept the power you have to end a relationship at any point with someone who treats you like shit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Accept the power you have to not need any proof to break up with someone. A true partner doesn&amp;#39;t put you through these kind of stresses. &lt;/p&gt;\n\n&lt;p&gt;I know you want a tidy conclusion to this, but accept the power you have to end a relationship at any point with someone who treats you like shit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdq89p", "score_hidden": true, "stickied": false, "created": 1492476049.0, "created_utc": 1492447249.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdpvxc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdpsdr", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks, appreciate it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, appreciate it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdpvxc", "score_hidden": true, "stickied": false, "created": 1492475668.0, "created_utc": 1492446868.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpsdr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Raidicus", "parent_id": "t1_dgdo5kg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Sorry man. I know it's tough. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry man. I know it&amp;#39;s tough. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdpsdr", "score_hidden": true, "stickied": false, "created": 1492475560.0, "created_utc": 1492446760.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdo5kg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdnv4i", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Nope, certainly both terrible things to do. And you're probably correct about those two options - that she's either biding her time or parallel dating us.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nope, certainly both terrible things to do. And you&amp;#39;re probably correct about those two options - that she&amp;#39;s either biding her time or parallel dating us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdo5kg", "score_hidden": true, "stickied": false, "created": 1492473722.0, "created_utc": 1492444922.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnv4i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Raidicus", "parent_id": "t1_dgdnknd", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think what everyone here is trying to tell you is that you have all the proof you should ever need to break up with someone. At worst she's just biding her time to break up with you, at best she's parallel dating y'all...test driving some new guy while still safe and happy in your relationship. Does either one speak much to her character?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think what everyone here is trying to tell you is that you have all the proof you should ever need to break up with someone. At worst she&amp;#39;s just biding her time to break up with you, at best she&amp;#39;s parallel dating y&amp;#39;all...test driving some new guy while still safe and happy in your relationship. Does either one speak much to her character?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnv4i", "score_hidden": true, "stickied": false, "created": 1492473385.0, "created_utc": 1492444585.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnknd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdmt6m", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah I think everything you wrote is probably true. Just wish I could get some proof.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I think everything you wrote is probably true. Just wish I could get some proof.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnknd", "score_hidden": true, "stickied": false, "created": 1492473057.0, "created_utc": 1492444257.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmt6m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Raidicus", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "At this point she's just hiding everything to save face and maintain plausible deniability. You have been together 3 years, just think about that. She doesn't want to be the girl who moved on immediately to a new guy, because everyone will know what that means (she was cheating while with you emotionally if not physically). She knew if she got caught red handed, everyone would find out the shady shit she has been up to. She knows if you break up with her now she can just tell people you were paranoid about her friendship with this guy Tim. They can see each other and in a couple of months just pretend he was a good friend that was there for her during the break up.\n\nWriting is on the wall dude. You don't delete texts that are 100% okay. You don't cover up or hide things that are explainable. You don't tell half truth little by little when you're caught.", "edited": 1492443795.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At this point she&amp;#39;s just hiding everything to save face and maintain plausible deniability. You have been together 3 years, just think about that. She doesn&amp;#39;t want to be the girl who moved on immediately to a new guy, because everyone will know what that means (she was cheating while with you emotionally if not physically). She knew if she got caught red handed, everyone would find out the shady shit she has been up to. She knows if you break up with her now she can just tell people you were paranoid about her friendship with this guy Tim. They can see each other and in a couple of months just pretend he was a good friend that was there for her during the break up.&lt;/p&gt;\n\n&lt;p&gt;Writing is on the wall dude. You don&amp;#39;t delete texts that are 100% okay. You don&amp;#39;t cover up or hide things that are explainable. You don&amp;#39;t tell half truth little by little when you&amp;#39;re caught.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmt6m", "score_hidden": true, "stickied": false, "created": 1492472179.0, "created_utc": 1492443379.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdf5cm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DarthMalgusFTW", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Time to get a new girlfriend. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Time to get a new girlfriend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdf5cm", "score_hidden": true, "stickied": false, "created": 1492461100.0, "created_utc": 1492432300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdmm51", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sdauf", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's obvious she's not investing in this relationship like you are. Break it off.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s obvious she&amp;#39;s not investing in this relationship like you are. Break it off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmm51", "score_hidden": true, "stickied": false, "created": 1492471952.0, "created_utc": 1492443152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdvz7i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EricTheAckAcktor", "parent_id": "t1_dgdv61j", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That is the worst feeling. Rip off the band aid so you can start the healing process.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is the worst feeling. Rip off the band aid so you can start the healing process.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdvz7i", "score_hidden": true, "stickied": false, "created": 1492482421.0, "created_utc": 1492453621.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdv61j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgduz0x", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You are completely correct I think. I forgot to think about the fact that if the relationship continues I'll be worrying about what she has done/is doing or who she is with all the time now because of this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are completely correct I think. I forgot to think about the fact that if the relationship continues I&amp;#39;ll be worrying about what she has done/is doing or who she is with all the time now because of this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdv61j", "score_hidden": true, "stickied": false, "created": 1492481512.0, "created_utc": 1492452712.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgduz0x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EricTheAckAcktor", "parent_id": "t1_dgdsrg9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I understand where you're coming from. But I would prefer the sadness over being stressed out about what she's doing or who she's hanging with all the time. I think that would distract me more than a breakup. This needs to end man. She doesn't respect you and you're holding onto this false sense of security. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand where you&amp;#39;re coming from. But I would prefer the sadness over being stressed out about what she&amp;#39;s doing or who she&amp;#39;s hanging with all the time. I think that would distract me more than a breakup. This needs to end man. She doesn&amp;#39;t respect you and you&amp;#39;re holding onto this false sense of security. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgduz0x", "score_hidden": true, "stickied": false, "created": 1492481294.0, "created_utc": 1492452494.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdsrg9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdqxtg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah I know. I guess I'm just scared of the process that follows - the emotional process. Because of school I basically don't have time to be sad/somehow not able to get work done. So that also sucks. I'm fairly certain a breakup would take a considerable amount of time away from studying, where I would probably not get much done some days from just a lack of concentration by sadness/other feelings.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I know. I guess I&amp;#39;m just scared of the process that follows - the emotional process. Because of school I basically don&amp;#39;t have time to be sad/somehow not able to get work done. So that also sucks. I&amp;#39;m fairly certain a breakup would take a considerable amount of time away from studying, where I would probably not get much done some days from just a lack of concentration by sadness/other feelings.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdsrg9", "score_hidden": true, "stickied": false, "created": 1492478865.0, "created_utc": 1492450065.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqxtg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EricTheAckAcktor", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You know what? The way she's going about this is reason enough to break up with her. Stop looking for a redeeming quality and dump her ass", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know what? The way she&amp;#39;s going about this is reason enough to break up with her. Stop looking for a redeeming quality and dump her ass&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdqxtg", "score_hidden": true, "stickied": false, "created": 1492476830.0, "created_utc": 1492448030.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dge2c8b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "readyforwine", "parent_id": "t1_dgdvopw", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "ah, i read it as you saying you saw her finger motions deleting the message. \n\nYou dont need to see the shit to smell it.  This one has already crossed a lot of lines.   \n\nDont give her an 'ultimatum'. . let her know this is her one chance to clear things up or you two are over.  If you even want to bother with this step.   If she tries to gaslight or trickle truth tell her to get out.  \n\nmake sure you get all your stuff back first, then initiate breakup process. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ah, i read it as you saying you saw her finger motions deleting the message. &lt;/p&gt;\n\n&lt;p&gt;You dont need to see the shit to smell it.  This one has already crossed a lot of lines.   &lt;/p&gt;\n\n&lt;p&gt;Dont give her an &amp;#39;ultimatum&amp;#39;. . let her know this is her one chance to clear things up or you two are over.  If you even want to bother with this step.   If she tries to gaslight or trickle truth tell her to get out.  &lt;/p&gt;\n\n&lt;p&gt;make sure you get all your stuff back first, then initiate breakup process. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge2c8b", "score_hidden": true, "stickied": false, "created": 1492489600.0, "created_utc": 1492460800.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvopw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdvcbb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She insisted that she had deleted it some days ago. But yeah, fuck that very deep.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She insisted that she had deleted it some days ago. But yeah, fuck that very deep.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdvopw", "score_hidden": true, "stickied": false, "created": 1492482095.0, "created_utc": 1492453295.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvcbb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "readyforwine", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Anyone who regularly deletes conversations, because they are worried about something, . . well I mean think about that. she is openly saying she doesnt want you to have actual evidence. the fact she deleted it in front of you, after agreeing to let you see it?   \n\nNah man, fuck all that noise.   You dont need 'evidence' when all these red flags are screaming at you.   her actions are clear enough. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anyone who regularly deletes conversations, because they are worried about something, . . well I mean think about that. she is openly saying she doesnt want you to have actual evidence. the fact she deleted it in front of you, after agreeing to let you see it?   &lt;/p&gt;\n\n&lt;p&gt;Nah man, fuck all that noise.   You dont need &amp;#39;evidence&amp;#39; when all these red flags are screaming at you.   her actions are clear enough. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdvcbb", "score_hidden": true, "stickied": false, "created": 1492481709.0, "created_utc": 1492452909.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdmh5x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CaptainMartian", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You made it clear you were uncomfortable- gave an ultimatum and then when she failed to reciprocate in an attempt to salvage trust, you caved in and stayed anyway? She is going to walk all over you while she works on her downward facing dog pose with Tim before they get a real good sweat on. Leave. she is not honest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You made it clear you were uncomfortable- gave an ultimatum and then when she failed to reciprocate in an attempt to salvage trust, you caved in and stayed anyway? She is going to walk all over you while she works on her downward facing dog pose with Tim before they get a real good sweat on. Leave. she is not honest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmh5x", "score_hidden": true, "stickied": false, "created": 1492471792.0, "created_utc": 1492442992.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdphtn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SaxifragetheGreen", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I gave her an ultimatum, that the relationship was over if I she couldn't allow me to see her phone so I could at least 'have something to work with' in terms of trusting her again. She still denied me of going through her phone.\n\nBreak up with her, she's lying to you and cheating on you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I gave her an ultimatum, that the relationship was over if I she couldn&amp;#39;t allow me to see her phone so I could at least &amp;#39;have something to work with&amp;#39; in terms of trusting her again. She still denied me of going through her phone.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Break up with her, she&amp;#39;s lying to you and cheating on you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdphtn", "score_hidden": true, "stickied": false, "created": 1492475233.0, "created_utc": 1492446433.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdrer7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "merryhexmas", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She's cheating 100%.  Red flag after red flag after red flag.  You know it in your gut and when you read this post back to yourself and all of those compounded warning signs were staring you in the face.  Dump her and don't even explain yourself.  She made it clear she prioritized things with Tim over you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s cheating 100%.  Red flag after red flag after red flag.  You know it in your gut and when you read this post back to yourself and all of those compounded warning signs were staring you in the face.  Dump her and don&amp;#39;t even explain yourself.  She made it clear she prioritized things with Tim over you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdrer7", "score_hidden": true, "stickied": false, "created": 1492477354.0, "created_utc": 1492448554.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdok9i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdo9e3", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Haha I might just borrow that sentance. It does make perfect sense, sadly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha I might just borrow that sentance. It does make perfect sense, sadly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdok9i", "score_hidden": true, "stickied": false, "created": 1492474186.0, "created_utc": 1492445386.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdo9e3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "qldogg", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Break up. Too shady. If she accuses you of being crazy don't let her gaslight you. \"Well if I'm right, then it's good to break up because I don't want to be with someone untrustworthy and sketchy. If you're right and I'm crazy, then you wouldn't want to be with a crazy person anyway. It's a win-win. Now pack your bags.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Break up. Too shady. If she accuses you of being crazy don&amp;#39;t let her gaslight you. &amp;quot;Well if I&amp;#39;m right, then it&amp;#39;s good to break up because I don&amp;#39;t want to be with someone untrustworthy and sketchy. If you&amp;#39;re right and I&amp;#39;m crazy, then you wouldn&amp;#39;t want to be with a crazy person anyway. It&amp;#39;s a win-win. Now pack your bags.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdo9e3", "score_hidden": true, "stickied": false, "created": 1492473841.0, "created_utc": 1492445041.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdq27q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Biker_roadkill_LOL", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Dude, whether something is going on, your GF is a sketchy person and thrives on the attention of other guys. And is pretty trashy about it. She enjoys it and encourages it. It's up to you if you want to waste more time with this time bomb. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude, whether something is going on, your GF is a sketchy person and thrives on the attention of other guys. And is pretty trashy about it. She enjoys it and encourages it. It&amp;#39;s up to you if you want to waste more time with this time bomb. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdq27q", "score_hidden": true, "stickied": false, "created": 1492475860.0, "created_utc": 1492447060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdwufn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShesTyping", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your GF is at best having a pretty intense emotional affair with this guy, at worst it might also be physical to some degree. You should confront her and be ready to break up with her. Don't put yourself through the wringer of trying to deal with an emotional affair unless you truly love her and know you want to spend the rest of your life with her, and even then only if she shows 100% willingness to work on this with you. And make no mistake it does take work to fix this sort of thing.\n\nMy dude had a brief intense emotional affair with a woman, and the only reason our relationship survived is because when I confronted him he was adamant that he wanted to be with me for the rest of his life and admitted that he'd made a terrible mistake with the other woman. He agreed to therapy and to a separation while he had therapy and went to every length to prove his true intents to me. If your GF is not willing to admit she's fucked up here and to do that kind of work to make this right for you, then even if she agreed to not interact with this Tim guy again, she would still be likely to engage in emotional affairs again in future. And at some point, emotional affairs become physical ones. \n\nI will say, that if you do both have the same goal of being together under this, then the hard work of fixing it is worth it. In my case, our relationship is SO much stronger and better now than it was even before he got off the rails and made that mistake. It was worth it for us to put the work in, but it absolutely wouldn't be worth it for everyone. If it isn't, that's no bad thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your GF is at best having a pretty intense emotional affair with this guy, at worst it might also be physical to some degree. You should confront her and be ready to break up with her. Don&amp;#39;t put yourself through the wringer of trying to deal with an emotional affair unless you truly love her and know you want to spend the rest of your life with her, and even then only if she shows 100% willingness to work on this with you. And make no mistake it does take work to fix this sort of thing.&lt;/p&gt;\n\n&lt;p&gt;My dude had a brief intense emotional affair with a woman, and the only reason our relationship survived is because when I confronted him he was adamant that he wanted to be with me for the rest of his life and admitted that he&amp;#39;d made a terrible mistake with the other woman. He agreed to therapy and to a separation while he had therapy and went to every length to prove his true intents to me. If your GF is not willing to admit she&amp;#39;s fucked up here and to do that kind of work to make this right for you, then even if she agreed to not interact with this Tim guy again, she would still be likely to engage in emotional affairs again in future. And at some point, emotional affairs become physical ones. &lt;/p&gt;\n\n&lt;p&gt;I will say, that if you do both have the same goal of being together under this, then the hard work of fixing it is worth it. In my case, our relationship is SO much stronger and better now than it was even before he got off the rails and made that mistake. It was worth it for us to put the work in, but it absolutely wouldn&amp;#39;t be worth it for everyone. If it isn&amp;#39;t, that&amp;#39;s no bad thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdwufn", "score_hidden": true, "stickied": false, "created": 1492483400.0, "created_utc": 1492454600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdxfwg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Elephansion", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "LOL dude what?\n\n&gt;She said she was afraid if I saw something in the location history which she wouldn't remember and couldn't explain, \n\nWHY WOULDN'T SHE BE ABLE TO EXPLAIN SOMETHING IF SHE'S NOT DOING ANYTHING WRONG?\n\nMate you're a chump. I'm telling you this as a woman, she's not being honest or loyal to you and you're right to be suspicious. Take it one step further and leave her. She's literally lying to you and is probably so pleased with herself that you're eating it up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LOL dude what?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She said she was afraid if I saw something in the location history which she wouldn&amp;#39;t remember and couldn&amp;#39;t explain, &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;WHY WOULDN&amp;#39;T SHE BE ABLE TO EXPLAIN SOMETHING IF SHE&amp;#39;S NOT DOING ANYTHING WRONG?&lt;/p&gt;\n\n&lt;p&gt;Mate you&amp;#39;re a chump. I&amp;#39;m telling you this as a woman, she&amp;#39;s not being honest or loyal to you and you&amp;#39;re right to be suspicious. Take it one step further and leave her. She&amp;#39;s literally lying to you and is probably so pleased with herself that you&amp;#39;re eating it up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdxfwg", "score_hidden": true, "stickied": false, "created": 1492484079.0, "created_utc": 1492455279.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdz0oa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ouch_i_fell_down", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Don't tie your shoes in a melon patch, don't adjust your hat under a plum tree.\n\nThis is a Chinese proverb. It means part of maintaining status as an upstanding citizen is not only avoiding doing anything illegal or immoral, but also avoiding the appearance of impropriety. People know when they are doing things that look suspicious to the outside world, and it is their choice not to discontinue these actions.\n\nIf you caught your neighbor tying his shoes in your melon patch, you may not have any real evidence he was trying to steal a melon, but you'd know his story was too convenient to continue to trust him.\n\nIf your girlfriend deletes her conversations with other guys because she's worried you'd find something you wouldn't like, then she shouldn't be engaging in any interactions with other men *knowing* that it would make you uncomfortable. She may not even be emotionally cheating, but she had shown a clear disrespect towards the boundaries of your relationship. Not to mention, she has embarrassed you in front of your friend John and who knows how many others.\n\nYou lost trust and respect and face. Time to see this girl for who she really is. Your *ex*-girlfriend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t tie your shoes in a melon patch, don&amp;#39;t adjust your hat under a plum tree.&lt;/p&gt;\n\n&lt;p&gt;This is a Chinese proverb. It means part of maintaining status as an upstanding citizen is not only avoiding doing anything illegal or immoral, but also avoiding the appearance of impropriety. People know when they are doing things that look suspicious to the outside world, and it is their choice not to discontinue these actions.&lt;/p&gt;\n\n&lt;p&gt;If you caught your neighbor tying his shoes in your melon patch, you may not have any real evidence he was trying to steal a melon, but you&amp;#39;d know his story was too convenient to continue to trust him.&lt;/p&gt;\n\n&lt;p&gt;If your girlfriend deletes her conversations with other guys because she&amp;#39;s worried you&amp;#39;d find something you wouldn&amp;#39;t like, then she shouldn&amp;#39;t be engaging in any interactions with other men &lt;em&gt;knowing&lt;/em&gt; that it would make you uncomfortable. She may not even be emotionally cheating, but she had shown a clear disrespect towards the boundaries of your relationship. Not to mention, she has embarrassed you in front of your friend John and who knows how many others.&lt;/p&gt;\n\n&lt;p&gt;You lost trust and respect and face. Time to see this girl for who she really is. Your &lt;em&gt;ex&lt;/em&gt;-girlfriend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdz0oa", "score_hidden": true, "stickied": false, "created": 1492485873.0, "created_utc": 1492457073.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdgmqi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "skyscan1", "parent_id": "t1_dgdgeu0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yes. My wife has never given me reason to doubt her. I have never given my wife wife reason to doubt me. We have been married close to 25 years. We have open electronics and open social media. It's not a big deal to us. We have nothing to hide from each other. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. My wife has never given me reason to doubt her. I have never given my wife wife reason to doubt me. We have been married close to 25 years. We have open electronics and open social media. It&amp;#39;s not a big deal to us. We have nothing to hide from each other. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdgmqi", "score_hidden": true, "stickied": false, "created": 1492463792.0, "created_utc": 1492434992.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dge352l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "School_Lunch", "parent_id": "t1_dgdgeu0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Pointless, she will just create a secret account. Stop trying to prove it one way or the other and just focus on how she's handling this, how that makes you feel, and ask her how she'd feel if the tables were turned. Start getting yourself used to the idea that she is not happy with your relationship but is too afraid to end it. Start thinking about your own exit plan.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pointless, she will just create a secret account. Stop trying to prove it one way or the other and just focus on how she&amp;#39;s handling this, how that makes you feel, and ask her how she&amp;#39;d feel if the tables were turned. Start getting yourself used to the idea that she is not happy with your relationship but is too afraid to end it. Start thinking about your own exit plan.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge352l", "score_hidden": true, "stickied": false, "created": 1492490498.0, "created_utc": 1492461698.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgeu0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "relationship01234", "parent_id": "t1_dgdg3b0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That is definitely something I should suggest. Thanks for the input. Maybe I'll tell her that I have no trust in her and that if we are to continue I want to know the password to her computer and phone and she'll know mine.\n\nDo you think that should include passwords to social media?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is definitely something I should suggest. Thanks for the input. Maybe I&amp;#39;ll tell her that I have no trust in her and that if we are to continue I want to know the password to her computer and phone and she&amp;#39;ll know mine.&lt;/p&gt;\n\n&lt;p&gt;Do you think that should include passwords to social media?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdgeu0", "score_hidden": true, "stickied": false, "created": 1492463419.0, "created_utc": 1492434619.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdg3b0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "skyscan1", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Open electronics and open social media for both of you so be one way to rebuild trust. Tell her that she has damaged the trust you had in her and if she wants to remain in a relationship with you that you need open electronics and social media. If she refuses then you need to break up with her and figure out how to separate yourself. Then go no contact. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Open electronics and open social media for both of you so be one way to rebuild trust. Tell her that she has damaged the trust you had in her and if she wants to remain in a relationship with you that you need open electronics and social media. If she refuses then you need to break up with her and figure out how to separate yourself. Then go no contact. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdg3b0", "score_hidden": true, "stickied": false, "created": 1492462860.0, "created_utc": 1492434060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdn8e3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "powabiatch", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Condolences on finding out that you're dating a piece of trash. Just know that it wasn't your fault or that you're not good enough... She is just an awful human being. There is zero chance any of this innocent, even if they've never had sex. You're super young, learn from this, grieve, then go out and have a great time meeting and dating women who aren't liars!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Condolences on finding out that you&amp;#39;re dating a piece of trash. Just know that it wasn&amp;#39;t your fault or that you&amp;#39;re not good enough... She is just an awful human being. There is zero chance any of this innocent, even if they&amp;#39;ve never had sex. You&amp;#39;re super young, learn from this, grieve, then go out and have a great time meeting and dating women who aren&amp;#39;t liars!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdn8e3", "score_hidden": true, "stickied": false, "created": 1492472664.0, "created_utc": 1492443864.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdngkj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GhostRunner8", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Trust is broken, you're young, you will be miserable if you stay, get out before you have a child. Abandon any thoughts of marriage if you had any and leave. I don't want a reply I want to see you leave. You will feel better afterward. Also don't look her up when you're feeling sad. Delete her from your mind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trust is broken, you&amp;#39;re young, you will be miserable if you stay, get out before you have a child. Abandon any thoughts of marriage if you had any and leave. I don&amp;#39;t want a reply I want to see you leave. You will feel better afterward. Also don&amp;#39;t look her up when you&amp;#39;re feeling sad. Delete her from your mind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdngkj", "score_hidden": true, "stickied": false, "created": 1492472926.0, "created_utc": 1492444126.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdnhuq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mwait", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your gf is cheating on you or planning to... Both emotionally and physically. That's all there is to it. Get out now while you're still young. Don't waste any more time on this girl.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your gf is cheating on you or planning to... Both emotionally and physically. That&amp;#39;s all there is to it. Get out now while you&amp;#39;re still young. Don&amp;#39;t waste any more time on this girl.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnhuq", "score_hidden": true, "stickied": false, "created": 1492472967.0, "created_utc": 1492444167.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgds8eb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "conamo", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She knows there are things going on that will make you uncomfortable but rather than, oh I don't know, respect you and your relationship by telling these guys to knock it off, she instead encourages and participates in inappropriate behavior she is hiding from you. She's not even lying - she's telling you these guys are interested, *and* she's communicating with them, *and* she doesn't want you to see or hear what's being said because you'll be upset. She's not trying to spare your feelings, she just wants to enjoy this attentiin without you bitching about it.\n\nI vote dump! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She knows there are things going on that will make you uncomfortable but rather than, oh I don&amp;#39;t know, respect you and your relationship by telling these guys to knock it off, she instead encourages and participates in inappropriate behavior she is hiding from you. She&amp;#39;s not even lying - she&amp;#39;s telling you these guys are interested, &lt;em&gt;and&lt;/em&gt; she&amp;#39;s communicating with them, &lt;em&gt;and&lt;/em&gt; she doesn&amp;#39;t want you to see or hear what&amp;#39;s being said because you&amp;#39;ll be upset. She&amp;#39;s not trying to spare your feelings, she just wants to enjoy this attentiin without you bitching about it.&lt;/p&gt;\n\n&lt;p&gt;I vote dump! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgds8eb", "score_hidden": true, "stickied": false, "created": 1492478272.0, "created_utc": 1492449472.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdt2vi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nigerianprince23", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah, this is sketch as fuck. You should break up with her because she's not being open and she's covering her tracks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, this is sketch as fuck. You should break up with her because she&amp;#39;s not being open and she&amp;#39;s covering her tracks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdt2vi", "score_hidden": true, "stickied": false, "created": 1492479217.0, "created_utc": 1492450417.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdt7jd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Enigma_27", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So you gave her an Ultimatum and didn't follow through with it? It's over bud, end it before this whole thing crushes you.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you gave her an Ultimatum and didn&amp;#39;t follow through with it? It&amp;#39;s over bud, end it before this whole thing crushes you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdt7jd", "score_hidden": true, "stickied": false, "created": 1492479360.0, "created_utc": 1492450560.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdtv62", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "YouCantSaveEveryone", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Trust your gut. This isn't a court of law, if you suspect she's bullshitting you and no longer feel the same way about her then that's that. You don't need to prove it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trust your gut. This isn&amp;#39;t a court of law, if you suspect she&amp;#39;s bullshitting you and no longer feel the same way about her then that&amp;#39;s that. You don&amp;#39;t need to prove it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdtv62", "score_hidden": true, "stickied": false, "created": 1492480079.0, "created_utc": 1492451279.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdwhkp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wompwompwhaa", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The bad news is that your gf is cheating on you. The good news is that you aren't married to her and you don't have kids with her, so, in the big scheme of things, your break-up will be a cake walk. Also, you're 26yo and into crossfit, so you will have all the time and opportunity in the world to find a more fitting gf. Shit happens, and it hurts. But don't compound the problem by staying with this girl any longer. It's over.", "edited": 1492457111.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The bad news is that your gf is cheating on you. The good news is that you aren&amp;#39;t married to her and you don&amp;#39;t have kids with her, so, in the big scheme of things, your break-up will be a cake walk. Also, you&amp;#39;re 26yo and into crossfit, so you will have all the time and opportunity in the world to find a more fitting gf. Shit happens, and it hurts. But don&amp;#39;t compound the problem by staying with this girl any longer. It&amp;#39;s over.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdwhkp", "score_hidden": true, "stickied": false, "created": 1492482996.0, "created_utc": 1492454196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdwquw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dragonbearisreal", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I had the same situation arise, not gym and all. She was secretive, deleted messages, talked about all sorts of friends and stories but the one guy. I knew they had a thing for each other, it was super obvious. After about 3 months of her secrets and everything, she ended up breaking up to \"find herself\" and was dating him 2 weeks later. So in my experience, if she is hiding him, she is definitely thinking about him in more than a friendly way. She may not even be physically cheating, but she may be emotionally cheating.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had the same situation arise, not gym and all. She was secretive, deleted messages, talked about all sorts of friends and stories but the one guy. I knew they had a thing for each other, it was super obvious. After about 3 months of her secrets and everything, she ended up breaking up to &amp;quot;find herself&amp;quot; and was dating him 2 weeks later. So in my experience, if she is hiding him, she is definitely thinking about him in more than a friendly way. She may not even be physically cheating, but she may be emotionally cheating.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdwquw", "score_hidden": true, "stickied": false, "created": 1492483290.0, "created_utc": 1492454490.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdwszc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "walk_through_this", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's a relationship, not a court case. She has to earn your trust and work to keep it. She's doing the opposite. She's also deliberately hiding aspects of her relationship with Tim from you. She trying to justify her actions, but what she isn't doing is putting your mind at ease. Indeed, she's doing the opposite. I see the conversation going like this:\n\n\"I can't trust you.\"\n\n\"But I explained why I did all those things!\"\n\n\"...And yet, I still feel like I can't trust you.\"\n\n\"But you should!\"\n\n\"And yet, I don't. I have given you lots of opportunities to show me that there's no problem, and every time, you've chosen to show me nothing. If there were no reason to be concerned, you would be able to show me that. Do I know that you're cheating on me? No. But since you're not interested in having me trust you, as it turns out, I don't.\"\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a relationship, not a court case. She has to earn your trust and work to keep it. She&amp;#39;s doing the opposite. She&amp;#39;s also deliberately hiding aspects of her relationship with Tim from you. She trying to justify her actions, but what she isn&amp;#39;t doing is putting your mind at ease. Indeed, she&amp;#39;s doing the opposite. I see the conversation going like this:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I can&amp;#39;t trust you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But I explained why I did all those things!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;...And yet, I still feel like I can&amp;#39;t trust you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But you should!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And yet, I don&amp;#39;t. I have given you lots of opportunities to show me that there&amp;#39;s no problem, and every time, you&amp;#39;ve chosen to show me nothing. If there were no reason to be concerned, you would be able to show me that. Do I know that you&amp;#39;re cheating on me? No. But since you&amp;#39;re not interested in having me trust you, as it turns out, I don&amp;#39;t.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdwszc", "score_hidden": true, "stickied": false, "created": 1492483355.0, "created_utc": 1492454555.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdxffz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iSoReddit", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Dude break up already! Clearly you don't trust her and with very good reason.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude break up already! Clearly you don&amp;#39;t trust her and with very good reason.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdxffz", "score_hidden": true, "stickied": false, "created": 1492484065.0, "created_utc": 1492455265.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdzcfq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zen_writer", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The fact that there was enough pause between her handing you her phone and the messages being \"deleted\" is disrespectful on it's own, and sketchy. If my husband asked for my phone, I'd hand it over no problem. If he wound up on my social media accounts, I wouldn't even bat an eye. And if he ever felt the need to look through my messages, I'd let him. The only thing I'd ask of him is if anything he read/saw/whatever made him feel uncomfortable to talk to me about it. Even when I've known people to be super private and liked to keep things to themselves, they would be very open if their spouse was uncomfortable about something. When you respect your partner and plan on keeping them around, you want to build trust with them. All of her actions do not seem respectful nor trustworthy, and I'd likely side with your friend John on this one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fact that there was enough pause between her handing you her phone and the messages being &amp;quot;deleted&amp;quot; is disrespectful on it&amp;#39;s own, and sketchy. If my husband asked for my phone, I&amp;#39;d hand it over no problem. If he wound up on my social media accounts, I wouldn&amp;#39;t even bat an eye. And if he ever felt the need to look through my messages, I&amp;#39;d let him. The only thing I&amp;#39;d ask of him is if anything he read/saw/whatever made him feel uncomfortable to talk to me about it. Even when I&amp;#39;ve known people to be super private and liked to keep things to themselves, they would be very open if their spouse was uncomfortable about something. When you respect your partner and plan on keeping them around, you want to build trust with them. All of her actions do not seem respectful nor trustworthy, and I&amp;#39;d likely side with your friend John on this one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdzcfq", "score_hidden": true, "stickied": false, "created": 1492486246.0, "created_utc": 1492457446.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdzgtq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hangerbaby", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Where there's smoke, there's fire. I'd block her and move on with my life without explaining a damn thing to her or giving her any closure. She's dragging you through the mud until this crush pans out for her, man, all the signs are there. \n\nShe's not ready to give up the comfort of a relationship, but is enjoying all the benefits of being single apparently. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where there&amp;#39;s smoke, there&amp;#39;s fire. I&amp;#39;d block her and move on with my life without explaining a damn thing to her or giving her any closure. She&amp;#39;s dragging you through the mud until this crush pans out for her, man, all the signs are there. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s not ready to give up the comfort of a relationship, but is enjoying all the benefits of being single apparently. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdzgtq", "score_hidden": true, "stickied": false, "created": 1492486385.0, "created_utc": 1492457585.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dge09qp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "clutchy22", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This asshole is gas-lighting you.  If you don't know what that is, you do now.  She has something to hide, and when inquired, denied and hid it just as you would expect someone with something to hide, would.  You're on to her shit and she thinks she's clever, hopefully you have taken your queue to get out while you still have dignity.  \n\nConsider switching Crossfit gyms, you already know the tools that train at your current one who have no respect for others.  If it is a proper gym, that type of fraternization would not fly and those people would be ostracized, consider bringing this up with the people who own the gym as well as this situation certainly affects your time spent there.  I'd be hesitant to train someone whose character is to cheat or to mingle with other gym-goers SO's, they wouldn't be worth my personal time, including any additional drama, and I'd be better off without their money in the long run, screw those people, they can get their HIIT somewhere else.", "edited": 1492460565.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This asshole is gas-lighting you.  If you don&amp;#39;t know what that is, you do now.  She has something to hide, and when inquired, denied and hid it just as you would expect someone with something to hide, would.  You&amp;#39;re on to her shit and she thinks she&amp;#39;s clever, hopefully you have taken your queue to get out while you still have dignity.  &lt;/p&gt;\n\n&lt;p&gt;Consider switching Crossfit gyms, you already know the tools that train at your current one who have no respect for others.  If it is a proper gym, that type of fraternization would not fly and those people would be ostracized, consider bringing this up with the people who own the gym as well as this situation certainly affects your time spent there.  I&amp;#39;d be hesitant to train someone whose character is to cheat or to mingle with other gym-goers SO&amp;#39;s, they wouldn&amp;#39;t be worth my personal time, including any additional drama, and I&amp;#39;d be better off without their money in the long run, screw those people, they can get their HIIT somewhere else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge09qp", "score_hidden": true, "stickied": false, "created": 1492487286.0, "created_utc": 1492458486.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dge0hfh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thegarbagewoman", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; In the end I gave in, and thought that I don't have any proof of anything happening between them, and she might just be telling the truth.\n\nYou don't have proof because she deleted what she could and hid the rest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In the end I gave in, and thought that I don&amp;#39;t have any proof of anything happening between them, and she might just be telling the truth.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You don&amp;#39;t have proof because she deleted what she could and hid the rest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge0hfh", "score_hidden": true, "stickied": false, "created": 1492487524.0, "created_utc": 1492458724.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65v2jx", "likes": null, "replies": "", "user_reports": [], "id": "dgdu9bt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "clumplings2", "parent_id": "t3_65v2jx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;Just by telling John about the confrontation later on, I thought I was an idiot for still being with her. Just by writing this here, I think I'm an idiot still being with her. \n\nObviously.\n\n&gt;In the end I gave in\n\nAnd lost all dignity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Just by telling John about the confrontation later on, I thought I was an idiot for still being with her. Just by writing this here, I think I&amp;#39;m an idiot still being with her. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Obviously.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In the end I gave in&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And lost all dignity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdu9bt", "score_hidden": true, "stickied": false, "created": 1492480509.0, "created_utc": 1492451709.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]