[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I wish I had made a post when this first started two years ago, but I till try to include as much detail possible. &lt;/p&gt;\n\n&lt;p&gt;I started this job when I was 18 and I really enjoy it. I work at a bar/cafe where my main responsibilities as Bar Staff are serving drinks and clearing tables. Kitchen Staff are responsible for cooking and serving food, also clearing tables. There are about 10 members of staff total and I get on really well with almost everyone. My bar manager, Jack, is really helpful with swapping my shifts when it comes to college or if I need extra hours, and I get on with him. Overall it&amp;#39;s a job I enjoy going to and working at.&lt;/p&gt;\n\n&lt;p&gt;From the moment I started, I had an issue with the Kitchen Manager, Kat. She is a very headstrong, strict person who is very black and white in the way she talks and acts. I should mention that although she is &amp;#39;above me&amp;#39;, I don&amp;#39;t work directly for her, but we do work in the same area and alongside each other.&lt;/p&gt;\n\n&lt;p&gt;Kat would make remarks about almost everything I did and because it was my first job and she was older than me, I assumed it was because I was genuinely doing the wrong thing. A few examples of this;&lt;/p&gt;\n\n&lt;p&gt;-uniform, she would comment that I was wearing the wrong shoes, hair style, makeup or nail polish, although none of this was ever mentioned to me in my interview or with my manager Jack. When I asked him about it he would say that she was wrong and just to ignore her. &lt;/p&gt;\n\n&lt;p&gt;-food, when I would take my break, she would interrupt me when I was eating and tell me to go and clear tables or something else. This would mean I would miss out on my meal and when I mentioned this to Jack he would say that she wasn&amp;#39;t supposed to do that and I should carry on with my meal. &lt;/p&gt;\n\n&lt;p&gt;-teas and coffee, If I had more than two or three drinks over the course of a few hours she would ask me &amp;quot;do you know you&amp;#39;re wasting company money?&amp;quot; which I&amp;#39;d never know how to respond to, considering it was only two or three drinks. &lt;/p&gt;\n\n&lt;p&gt;She never says please or thank you, will\ninterrupt me if I am talking to customers or other members of staff, has screamed my name through the bathroom door for me to come and help her, screams and throws tantrums when we get even slightly busy and will blame me for almost anything even when it&amp;#39;s out of my control. I have always remained super polite and cool headed around her as I can&amp;#39;t be bothered engaging in an argument about a cup of coffee with a 50 something woman, but at the same time these comments are always directed at me and is very exhausting. &lt;/p&gt;\n\n&lt;p&gt;I complained to management about a week ago and I was super cautious not to seem like I was being mean out of order. I told them that I didn&amp;#39;t want a big deal to be made out of it, I just wanted it to stop. They have met with her once from what I know. Other members of staff have all agreed that Kat constantly directs comments at me and is in general very mean spirited, they have also encouraged me to come forward about it to management. One of the other members of staff told me today that Kat thinks that I do not respect her. I&amp;#39;m not sure where to go from here because how do I prove to management that I respect her when she is so constantly gunning for me? &lt;/p&gt;\n\n&lt;p&gt;TL;DR  coworker is bullying me and has said I don&amp;#39;t respect her, but I&amp;#39;m tired of her attitude towards me. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I wish I had made a post when this first started two years ago, but I till try to include as much detail possible. \n\nI started this job when I was 18 and I really enjoy it. I work at a bar/cafe where my main responsibilities as Bar Staff are serving drinks and clearing tables. Kitchen Staff are responsible for cooking and serving food, also clearing tables. There are about 10 members of staff total and I get on really well with almost everyone. My bar manager, Jack, is really helpful with swapping my shifts when it comes to college or if I need extra hours, and I get on with him. Overall it's a job I enjoy going to and working at.\n\nFrom the moment I started, I had an issue with the Kitchen Manager, Kat. She is a very headstrong, strict person who is very black and white in the way she talks and acts. I should mention that although she is 'above me', I don't work directly for her, but we do work in the same area and alongside each other.\n\nKat would make remarks about almost everything I did and because it was my first job and she was older than me, I assumed it was because I was genuinely doing the wrong thing. A few examples of this;\n\n-uniform, she would comment that I was wearing the wrong shoes, hair style, makeup or nail polish, although none of this was ever mentioned to me in my interview or with my manager Jack. When I asked him about it he would say that she was wrong and just to ignore her. \n\n-food, when I would take my break, she would interrupt me when I was eating and tell me to go and clear tables or something else. This would mean I would miss out on my meal and when I mentioned this to Jack he would say that she wasn't supposed to do that and I should carry on with my meal. \n\n-teas and coffee, If I had more than two or three drinks over the course of a few hours she would ask me \"do you know you're wasting company money?\" which I'd never know how to respond to, considering it was only two or three drinks. \n\nShe never says please or thank you, will\ninterrupt me if I am talking to customers or other members of staff, has screamed my name through the bathroom door for me to come and help her, screams and throws tantrums when we get even slightly busy and will blame me for almost anything even when it's out of my control. I have always remained super polite and cool headed around her as I can't be bothered engaging in an argument about a cup of coffee with a 50 something woman, but at the same time these comments are always directed at me and is very exhausting. \n\nI complained to management about a week ago and I was super cautious not to seem like I was being mean out of order. I told them that I didn't want a big deal to be made out of it, I just wanted it to stop. They have met with her once from what I know. Other members of staff have all agreed that Kat constantly directs comments at me and is in general very mean spirited, they have also encouraged me to come forward about it to management. One of the other members of staff told me today that Kat thinks that I do not respect her. I'm not sure where to go from here because how do I prove to management that I respect her when she is so constantly gunning for me? \n\nTL;DR  coworker is bullying me and has said I don't respect her, but I'm tired of her attitude towards me. ", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Non-Romantic", "id": "65vv8c", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 271, "report_reasons": null, "author": "MaybeUmaThurman", "saved": false, "mod_reports": [], "name": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-gn misc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65vv8c/i_f20_have_reported_my_coworker_for_bullying_me/", "num_reports": null, "locked": false, "stickied": false, "created": 1492468160.0, "url": "https://www.reddit.com/r/relationships/comments/65vv8c/i_f20_have_reported_my_coworker_for_bullying_me/", "author_flair_text": null, "quarantine": false, "title": "I (F20) have reported my coworker for bullying me, she has come back with saying that I 'don't respect her'. (F50+) Don't know where to go from here.", "created_utc": 1492439360.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 66, "visited": false, "subreddit_type": "public", "ups": 271}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdwx03", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "4ValarMorghulis4", "parent_id": "t1_dgdvbmf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The mother of dragons has spoken. Go forth and unleash your inner *Dracarys*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The mother of dragons has spoken. Go forth and unleash your inner &lt;em&gt;Dracarys&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdwx03", "score_hidden": true, "stickied": false, "created": 1492483482.0, "created_utc": 1492454682.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvbmf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "black_rose_", "parent_id": "t1_dgdkfob", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's from a tumblr user:\n\n&gt; stimmyabby:\n\n&gt; Sometimes people use “respect” to mean “treating someone like a person” and sometimes they use “respect” to mean “treating someone like an authority”\n\n&gt; and sometimes people who are used to being treated like an authority say “if you won’t respect me I won’t respect you” and they mean “if you won’t treat me like an authority I won’t treat you like a person”\n\n&gt; and they think they’re being fair but they aren’t, and it’s not okay.\n\nthere's a dailykos article by ...daenerys? about the subject\n\n&gt; I got to thinking one day about respect, and how often I hear \"respect has to be earned\". I don't know when earning respect became a thing, but that saying has always bothered me. When I was little I was still taught to respect other people, because it's the right thing to do. I still tend to respect people until they give me a reason not to.\n\n&gt; This then got me to thinking about how this attitude affects our entire society.\n\n&gt; If respect has to be earned, logic dictates that people aren't worthy of respect simply by virtue of being fellow humans. This is where everything starts to fall apart. This is why we don't take care of our own in this country; why we don't have universal health care, why we have such a paltry minimum wage, and on and on and on. People are so busy wallowing in their own self-importance.\n\n&gt; Just look at how some people treat servers, cashiers and other service employees just because they happen to have some low-income job. They wouldn't know them from Adam or Eve, but see them only as \"unskilled\" (I hate that word by the way) and lazy, not as ordinary people just trying to make a living in this shitty economy, never mind that they could be veterans, or someone with a graduate degree or whose middle-class factory job got shipped overseas and the minimum wage job is all they could find.\n\n&gt; I would argue that trust has to be earned. Both trust and respect can be lost in an instant though, and both can take a long time to regain once lost.\n\n&gt; People who say respect is earned usually have no interest in earning other people's respect and are the most entitled. They don't respect people who are different from them, and they will never give them a chance to earn their respect. They're also the ones who scream the loudest about tolerance when they are called out; no, we shouldn't tolerate racism, homophobia, misogyny, or any other shitty behavior", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s from a tumblr user:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;stimmyabby:&lt;/p&gt;\n\n&lt;p&gt;Sometimes people use “respect” to mean “treating someone like a person” and sometimes they use “respect” to mean “treating someone like an authority”&lt;/p&gt;\n\n&lt;p&gt;and sometimes people who are used to being treated like an authority say “if you won’t respect me I won’t respect you” and they mean “if you won’t treat me like an authority I won’t treat you like a person”&lt;/p&gt;\n\n&lt;p&gt;and they think they’re being fair but they aren’t, and it’s not okay.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;there&amp;#39;s a dailykos article by ...daenerys? about the subject&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I got to thinking one day about respect, and how often I hear &amp;quot;respect has to be earned&amp;quot;. I don&amp;#39;t know when earning respect became a thing, but that saying has always bothered me. When I was little I was still taught to respect other people, because it&amp;#39;s the right thing to do. I still tend to respect people until they give me a reason not to.&lt;/p&gt;\n\n&lt;p&gt;This then got me to thinking about how this attitude affects our entire society.&lt;/p&gt;\n\n&lt;p&gt;If respect has to be earned, logic dictates that people aren&amp;#39;t worthy of respect simply by virtue of being fellow humans. This is where everything starts to fall apart. This is why we don&amp;#39;t take care of our own in this country; why we don&amp;#39;t have universal health care, why we have such a paltry minimum wage, and on and on and on. People are so busy wallowing in their own self-importance.&lt;/p&gt;\n\n&lt;p&gt;Just look at how some people treat servers, cashiers and other service employees just because they happen to have some low-income job. They wouldn&amp;#39;t know them from Adam or Eve, but see them only as &amp;quot;unskilled&amp;quot; (I hate that word by the way) and lazy, not as ordinary people just trying to make a living in this shitty economy, never mind that they could be veterans, or someone with a graduate degree or whose middle-class factory job got shipped overseas and the minimum wage job is all they could find.&lt;/p&gt;\n\n&lt;p&gt;I would argue that trust has to be earned. Both trust and respect can be lost in an instant though, and both can take a long time to regain once lost.&lt;/p&gt;\n\n&lt;p&gt;People who say respect is earned usually have no interest in earning other people&amp;#39;s respect and are the most entitled. They don&amp;#39;t respect people who are different from them, and they will never give them a chance to earn their respect. They&amp;#39;re also the ones who scream the loudest about tolerance when they are called out; no, we shouldn&amp;#39;t tolerate racism, homophobia, misogyny, or any other shitty behavior&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdvbmf", "score_hidden": true, "stickied": false, "created": 1492481686.0, "created_utc": 1492452886.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dge0q07", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "try2try", "parent_id": "t1_dgdsdfy", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "But careful, OP, not to get too preoccupied with \"catching her\" doing things that you can list; you may become overly sensitive to her attitude and behavior, and it will make you miserable at work. \n\nIt sounds like everyone already recognizes the issue, so it won't be too hard to make your case if you need to.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But careful, OP, not to get too preoccupied with &amp;quot;catching her&amp;quot; doing things that you can list; you may become overly sensitive to her attitude and behavior, and it will make you miserable at work. &lt;/p&gt;\n\n&lt;p&gt;It sounds like everyone already recognizes the issue, so it won&amp;#39;t be too hard to make your case if you need to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge0q07", "score_hidden": true, "stickied": false, "created": 1492487792.0, "created_utc": 1492458992.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdsdfy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "saturnspoops", "parent_id": "t1_dgdpqzv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Definitely document them and document any past instances where you can remember the comment, time, and day. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely document them and document any past instances where you can remember the comment, time, and day. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdsdfy", "score_hidden": true, "stickied": false, "created": 1492478429.0, "created_utc": 1492449629.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdx47s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "songoku9001", "parent_id": "t1_dgdpqzv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've loved to see her be given the response \"With the way you are towards me, is it any surprise?\" but don't think that would go down well and prob burn a bridge or two. Compared to that, you'd quite likely better off reporting things to higher ups if you want to keep at current job, or maybe look into going on to better and brighter job if you can.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve loved to see her be given the response &amp;quot;With the way you are towards me, is it any surprise?&amp;quot; but don&amp;#39;t think that would go down well and prob burn a bridge or two. Compared to that, you&amp;#39;d quite likely better off reporting things to higher ups if you want to keep at current job, or maybe look into going on to better and brighter job if you can.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdx47s", "score_hidden": true, "stickied": false, "created": 1492483710.0, "created_utc": 1492454910.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdxuth", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SurvivingMissPrism", "parent_id": "t1_dgdpqzv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Are yout coworkers willing to back you up? If everyone agrees about how she treats you, it'll help.\n\nFrankly, Jack should have dealt with this when you first reported she was pushing you to skip meals. That can get him in trouble because meals and breaks are the law. If you or yout coworkers reported being denied your lunch break, he could have been facing fines or legal action.\n\nJack also should have nipped it in the bud when she was giving you crap for how you dressed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are yout coworkers willing to back you up? If everyone agrees about how she treats you, it&amp;#39;ll help.&lt;/p&gt;\n\n&lt;p&gt;Frankly, Jack should have dealt with this when you first reported she was pushing you to skip meals. That can get him in trouble because meals and breaks are the law. If you or yout coworkers reported being denied your lunch break, he could have been facing fines or legal action.&lt;/p&gt;\n\n&lt;p&gt;Jack also should have nipped it in the bud when she was giving you crap for how you dressed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdxuth", "score_hidden": true, "stickied": false, "created": 1492484546.0, "created_utc": 1492455746.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dge0dvh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tarcanus", "parent_id": "t1_dgdpqzv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Something to think about and pay attention to is if all of these other coworkers you mention jump when she says frog and generally kow-tow to her or if they act like you do.  Does everyone else do what she says when she says it?  Or has she singled you out.  That's important to note, too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something to think about and pay attention to is if all of these other coworkers you mention jump when she says frog and generally kow-tow to her or if they act like you do.  Does everyone else do what she says when she says it?  Or has she singled you out.  That&amp;#39;s important to note, too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge0dvh", "score_hidden": true, "stickied": false, "created": 1492487413.0, "created_utc": 1492458613.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dge0rlu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pen14klub", "parent_id": "t1_dgdpqzv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Everyone is telling you to document everything but I can tell you right now a lot of industry management would find that shit annoying and excessive. You are not in a normal work environment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone is telling you to document everything but I can tell you right now a lot of industry management would find that shit annoying and excessive. You are not in a normal work environment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge0rlu", "score_hidden": true, "stickied": false, "created": 1492487842.0, "created_utc": 1492459042.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpqzv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MaybeUmaThurman", "parent_id": "t1_dgdkfob", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think the 'obey vs respect' idea describes her as a whole. A lot of the things shes does are very petty and I think documenting them over time would maybe show that its not just a one off?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the &amp;#39;obey vs respect&amp;#39; idea describes her as a whole. A lot of the things shes does are very petty and I think documenting them over time would maybe show that its not just a one off?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdpqzv", "score_hidden": true, "stickied": false, "created": 1492475516.0, "created_utc": 1492446716.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdlgqr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Swampedthing", "parent_id": "t1_dgdkfob", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is really great advice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is really great advice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdlgqr", "score_hidden": true, "stickied": false, "created": 1492470588.0, "created_utc": 1492441788.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdzxut", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tessany", "parent_id": "t1_dgdy5ew", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "yeah, but here's the the thing. Kat isn't her direct supervisor, which is why Jack is saying to ignore her. She's a front of the house employee, of which Jack is the manager/direct supervisor of. Kat is the back of the house manager/direct supervisor. It's quite frankly none of Kat's business what OP is doing and if she really has a problem with OP, she should be bringing it up with Jack as OP is Jack's employee. If Jack is ignoring Kat's complaints, then Kat should be bringing it up to their manager/owner, not reprimanding OP herself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah, but here&amp;#39;s the the thing. Kat isn&amp;#39;t her direct supervisor, which is why Jack is saying to ignore her. She&amp;#39;s a front of the house employee, of which Jack is the manager/direct supervisor of. Kat is the back of the house manager/direct supervisor. It&amp;#39;s quite frankly none of Kat&amp;#39;s business what OP is doing and if she really has a problem with OP, she should be bringing it up with Jack as OP is Jack&amp;#39;s employee. If Jack is ignoring Kat&amp;#39;s complaints, then Kat should be bringing it up to their manager/owner, not reprimanding OP herself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdzxut", "score_hidden": true, "stickied": false, "created": 1492486917.0, "created_utc": 1492458117.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdzjuw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kelsifer", "parent_id": "t1_dgdy5ew", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Even if a staff member is lazy, there's no need to do the things that OP described. They won't get better by harassing them, any good manager will tell you that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even if a staff member is lazy, there&amp;#39;s no need to do the things that OP described. They won&amp;#39;t get better by harassing them, any good manager will tell you that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdzjuw", "score_hidden": true, "stickied": false, "created": 1492486479.0, "created_utc": 1492457679.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dge1ar2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nyctanolis", "parent_id": "t1_dgdy5ew", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I find your approach to be problematic.  It enables bullies to always get what they want and allows them excuses for behaving horribly.  In my experience, people like you make for hostile work environments that cycle through employees.\n\nThe things listed by OP were not ok.  If Kat had legit complaints, she'd simply be able to address those and there'd be no problem.  In this case, she's trying to force OP to do things that OP should not be doing, and no matter how you slice it *that is not ok*.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I find your approach to be problematic.  It enables bullies to always get what they want and allows them excuses for behaving horribly.  In my experience, people like you make for hostile work environments that cycle through employees.&lt;/p&gt;\n\n&lt;p&gt;The things listed by OP were not ok.  If Kat had legit complaints, she&amp;#39;d simply be able to address those and there&amp;#39;d be no problem.  In this case, she&amp;#39;s trying to force OP to do things that OP should not be doing, and no matter how you slice it &lt;em&gt;that is not ok&lt;/em&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge1ar2", "score_hidden": true, "stickied": false, "created": 1492488445.0, "created_utc": 1492459645.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dge11lu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "suckzbuttz69420bro", "parent_id": "t1_dgdy5ew", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Kat sounds petty and power trippish. Any place I've worked, coffee, tea and soda was always something available to you, free of charge. This woman is telling OP she's \"wasting company money.\" \nReally, it sounds like this woman needs to mind her mf business and is really just nit picking. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kat sounds petty and power trippish. Any place I&amp;#39;ve worked, coffee, tea and soda was always something available to you, free of charge. This woman is telling OP she&amp;#39;s &amp;quot;wasting company money.&amp;quot; \nReally, it sounds like this woman needs to mind her mf business and is really just nit picking. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge11lu", "score_hidden": true, "stickied": false, "created": 1492488157.0, "created_utc": 1492459357.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdy5ew", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hungry_dugong", "parent_id": "t1_dgdkfob", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Just to put  an alternative perspective on this, I urge a little caution here.  \n\nAs someone who was in and owned businesses in hospitality for years, I had to wonder what op's work ethic is like after reading this.  There are shitty people in every walk of life but *usually* you have to do something to incur the ongoing wrath of your supervisors' and we seem to be missing something here.   \n\nAlthough I agree that it seems that OP is justified here (especially since management appears to be satisfied with her performance) there is the chance that OP's work performance is lacking in the eyes of her supervisor. It could be just as likely that OP takes too many coffee breaks, talks too much to the customers, takes too many toilets stops, and takes some very long meal breaks. This is an example of where management needs to make sure that everyone is using the same playbook before decisions about what action to take.  It could also mean that management is out of touch with OP's performance on the floor and what the 50yo supervisor is dealing with.\n\nI've had staff like this that just stretch everything to there limits and do and say enough to keep senior management happy, while frustrating their supervisors and the other more diligent staff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just to put  an alternative perspective on this, I urge a little caution here.  &lt;/p&gt;\n\n&lt;p&gt;As someone who was in and owned businesses in hospitality for years, I had to wonder what op&amp;#39;s work ethic is like after reading this.  There are shitty people in every walk of life but &lt;em&gt;usually&lt;/em&gt; you have to do something to incur the ongoing wrath of your supervisors&amp;#39; and we seem to be missing something here.   &lt;/p&gt;\n\n&lt;p&gt;Although I agree that it seems that OP is justified here (especially since management appears to be satisfied with her performance) there is the chance that OP&amp;#39;s work performance is lacking in the eyes of her supervisor. It could be just as likely that OP takes too many coffee breaks, talks too much to the customers, takes too many toilets stops, and takes some very long meal breaks. This is an example of where management needs to make sure that everyone is using the same playbook before decisions about what action to take.  It could also mean that management is out of touch with OP&amp;#39;s performance on the floor and what the 50yo supervisor is dealing with.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had staff like this that just stretch everything to there limits and do and say enough to keep senior management happy, while frustrating their supervisors and the other more diligent staff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdy5ew", "score_hidden": true, "stickied": false, "created": 1492484883.0, "created_utc": 1492456083.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkfob", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dca_user", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "In another post, I saw this idea and thinks it applies well here:\n\n\nWhen you say \"respect\" you mean respect as equals. \n\n\nWhen she says \"respect\" it's code for \"obey her\" and you're not.  You're doing what Jack says. Jack needs to handle this.\n\n\nIn the meantime, do the following:\n\n- start looking for a new job\n\n- you keep documenting her behavior. \n\n- If she gets upset, direct her to Jack, ie why are you angry, jack told me to finish my lunch.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In another post, I saw this idea and thinks it applies well here:&lt;/p&gt;\n\n&lt;p&gt;When you say &amp;quot;respect&amp;quot; you mean respect as equals. &lt;/p&gt;\n\n&lt;p&gt;When she says &amp;quot;respect&amp;quot; it&amp;#39;s code for &amp;quot;obey her&amp;quot; and you&amp;#39;re not.  You&amp;#39;re doing what Jack says. Jack needs to handle this.&lt;/p&gt;\n\n&lt;p&gt;In the meantime, do the following:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;start looking for a new job&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;you keep documenting her behavior. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If she gets upset, direct her to Jack, ie why are you angry, jack told me to finish my lunch.  &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdkfob", "score_hidden": true, "stickied": false, "created": 1492469297.0, "created_utc": 1492440497.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdrmre", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "heyloren", "parent_id": "t1_dgdqrwa", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think they were asking if there was a policy about the coffee/tea drinks that you have. When I worked in a restaurant, we didn't have a limit on the amount of drinks we could have, but there were other restrictions, such as lid requirements and we couldn't bother the bartenders for a soda if they had customers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think they were asking if there was a policy about the coffee/tea drinks that you have. When I worked in a restaurant, we didn&amp;#39;t have a limit on the amount of drinks we could have, but there were other restrictions, such as lid requirements and we couldn&amp;#39;t bother the bartenders for a soda if they had customers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdrmre", "score_hidden": true, "stickied": false, "created": 1492477604.0, "created_utc": 1492448804.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdyh0e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SurvivingMissPrism", "parent_id": "t1_dgdqrwa", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If he's not talking to Kat, that is a VERY bad sign. I would be putting applications out. Jack may be nice, but he's a poor manager if he isn't addressing these problems. If the status quo is to \"ignore her\", that suggests he knows and doesn't plan to fix it.\n\nI was in a job where someone slightly higher than me pulled similar shit. Bullied me, tried to stop me from taking breaks, etc. The other people told me \"that's just how she is, it's not personal\". They ended up cutting my hours so I wouldn't be on the same shifts as her, basically punishing me for being bullied.\n\nSo I found another job.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If he&amp;#39;s not talking to Kat, that is a VERY bad sign. I would be putting applications out. Jack may be nice, but he&amp;#39;s a poor manager if he isn&amp;#39;t addressing these problems. If the status quo is to &amp;quot;ignore her&amp;quot;, that suggests he knows and doesn&amp;#39;t plan to fix it.&lt;/p&gt;\n\n&lt;p&gt;I was in a job where someone slightly higher than me pulled similar shit. Bullied me, tried to stop me from taking breaks, etc. The other people told me &amp;quot;that&amp;#39;s just how she is, it&amp;#39;s not personal&amp;quot;. They ended up cutting my hours so I wouldn&amp;#39;t be on the same shifts as her, basically punishing me for being bullied.&lt;/p&gt;\n\n&lt;p&gt;So I found another job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdyh0e", "score_hidden": true, "stickied": false, "created": 1492485246.0, "created_utc": 1492456446.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dge0znu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MaybeUmaThurman", "parent_id": "t1_dge0ekk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm talking 3 drinks over the course of an 8 hour shift. I wouldn't take advantage of that when I know there's no system in place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m talking 3 drinks over the course of an 8 hour shift. I wouldn&amp;#39;t take advantage of that when I know there&amp;#39;s no system in place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge0znu", "score_hidden": true, "stickied": false, "created": 1492488095.0, "created_utc": 1492459295.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0ekk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "junegloom", "parent_id": "t1_dgdqrwa", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There's refusing to put a formal limit on it, and there's also taking advantage of that honor system policy. The general idea of a buffet is that you're not limited, but its still kinda shitty for someone to go and hog all the crabs legs available just because of it. You're being that person when you actually cash in with taking nonstop drinks at work like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s refusing to put a formal limit on it, and there&amp;#39;s also taking advantage of that honor system policy. The general idea of a buffet is that you&amp;#39;re not limited, but its still kinda shitty for someone to go and hog all the crabs legs available just because of it. You&amp;#39;re being that person when you actually cash in with taking nonstop drinks at work like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge0ekk", "score_hidden": true, "stickied": false, "created": 1492487435.0, "created_utc": 1492458635.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqrwa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MaybeUmaThurman", "parent_id": "t1_dgdkedn", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is good advice, thank you.\n\nI think I may speak to Jack and ask him what he can do as he has the authority here. He's never spoke to Kat directly (as far as I know) but he constantly uses the phrase ignore her, which of course doesn't work when they're shouting your name across the building. \n\nWe're not allowed to drink on the job, but there is CCTV on the bar and the dining areas and entrances; none in the staff room or kitchen, where Kat spends 90% of her time and I spend about 60% of my time in the staff room. But it means theres a very low chance of her accusing me of drinking on the job if thats what you mean..?\n\nEDIT: I understand now you were talking about the coffee/tea thing. We are allowed as many drinks as we want, I think it's just something to say to get at me.", "edited": 1492449193.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is good advice, thank you.&lt;/p&gt;\n\n&lt;p&gt;I think I may speak to Jack and ask him what he can do as he has the authority here. He&amp;#39;s never spoke to Kat directly (as far as I know) but he constantly uses the phrase ignore her, which of course doesn&amp;#39;t work when they&amp;#39;re shouting your name across the building. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re not allowed to drink on the job, but there is CCTV on the bar and the dining areas and entrances; none in the staff room or kitchen, where Kat spends 90% of her time and I spend about 60% of my time in the staff room. But it means theres a very low chance of her accusing me of drinking on the job if thats what you mean..?&lt;/p&gt;\n\n&lt;p&gt;EDIT: I understand now you were talking about the coffee/tea thing. We are allowed as many drinks as we want, I think it&amp;#39;s just something to say to get at me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdqrwa", "score_hidden": true, "stickied": false, "created": 1492476648.0, "created_utc": 1492447848.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkedn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PurplePlurple", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If asked, point out that you've tried to satisfy Kat's demands whenever you can - aside from when your own manager said that Kat was overstepping and that you should ignore her - and that you remain polite. Arguably, Kat's treatment of you is bad for business. You avoid escalation and never yell back at her. You sound like a good worker and I think Kat is taking advantage of your personality.\n\nAlso, how are you supposed to respect someone when they treat you like this? Any lack of respect you currently have for Kat, is because of how Kat has treated you. It sounds like you try to keep it professional. Kat can *think* all she likes, but delusion doesn't make truth - if Kat wants *more* respect, she should reflect on her own behavior. You don't know how to confront her - and if anyone should, your manager is in a better position to do so - and because of your uncertainty of how to address it with Kat (because she doesn't respect you and is flat out mean) you have instead taken it up with management. \n\nHas Jack never spoken to Kat about the fact that she isn't yiur immediate supervisor? Has your manager ever told Kat to check herself? Outside what you've already done, I'm not sure what else you could do - it sounds like you avoid engaging with her when she's mad, focus on customers when you need to and... actually, what's your manager's policy in drinking on the job? Kat may be able to get you in trouble there.  In my experience in the service industry, some managers have a realistic view on this, but if you're under radar of someome who is batsshit, play it safe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If asked, point out that you&amp;#39;ve tried to satisfy Kat&amp;#39;s demands whenever you can - aside from when your own manager said that Kat was overstepping and that you should ignore her - and that you remain polite. Arguably, Kat&amp;#39;s treatment of you is bad for business. You avoid escalation and never yell back at her. You sound like a good worker and I think Kat is taking advantage of your personality.&lt;/p&gt;\n\n&lt;p&gt;Also, how are you supposed to respect someone when they treat you like this? Any lack of respect you currently have for Kat, is because of how Kat has treated you. It sounds like you try to keep it professional. Kat can &lt;em&gt;think&lt;/em&gt; all she likes, but delusion doesn&amp;#39;t make truth - if Kat wants &lt;em&gt;more&lt;/em&gt; respect, she should reflect on her own behavior. You don&amp;#39;t know how to confront her - and if anyone should, your manager is in a better position to do so - and because of your uncertainty of how to address it with Kat (because she doesn&amp;#39;t respect you and is flat out mean) you have instead taken it up with management. &lt;/p&gt;\n\n&lt;p&gt;Has Jack never spoken to Kat about the fact that she isn&amp;#39;t yiur immediate supervisor? Has your manager ever told Kat to check herself? Outside what you&amp;#39;ve already done, I&amp;#39;m not sure what else you could do - it sounds like you avoid engaging with her when she&amp;#39;s mad, focus on customers when you need to and... actually, what&amp;#39;s your manager&amp;#39;s policy in drinking on the job? Kat may be able to get you in trouble there.  In my experience in the service industry, some managers have a realistic view on this, but if you&amp;#39;re under radar of someome who is batsshit, play it safe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdkedn", "score_hidden": true, "stickied": false, "created": 1492469252.0, "created_utc": 1492440452.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdsg4q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "saturnspoops", "parent_id": "t1_dgdq95q", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Don't feel bad if she loses the job. She doesn't deserve the job with her actions. As someone who runs my own company, I would never want a manager or employee like that to represent my company, especially if they are running out better employees than them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t feel bad if she loses the job. She doesn&amp;#39;t deserve the job with her actions. As someone who runs my own company, I would never want a manager or employee like that to represent my company, especially if they are running out better employees than them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdsg4q", "score_hidden": true, "stickied": false, "created": 1492478513.0, "created_utc": 1492449713.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdxtde", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JesstheMess1016", "parent_id": "t1_dgdq95q", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I was in a very similar situation with an assistant manager at a service job. I agree with everyone who has told you to document EVERYTHING. Ask your co-workers who witness these events if they would verify your story if asked to step forward. After 3 REALLY inappropriate conversation with at least 2 witnesses each time I came forward to management with my case. At first, they didn't really take me seriously (even with witnesses) until I asked if I could record our encounters so they would know without a doubt what was said. Reluctantly they agreed as long as I signed a waiver saying that the recordings remain internal (My store had cameras but no audio). It took about another month but I downloaded an app on my phone and recorded 3 more really inappropriate conversations. Presented management with the recordings, the assistant manager was transferred to another store 3 weeks after that. So just because you are escalating this doesn't mean she will get fired. Businesses do not want to lose money on people they have trained and will often transfer/demote for a time until they improve their people skills or get fired after that point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in a very similar situation with an assistant manager at a service job. I agree with everyone who has told you to document EVERYTHING. Ask your co-workers who witness these events if they would verify your story if asked to step forward. After 3 REALLY inappropriate conversation with at least 2 witnesses each time I came forward to management with my case. At first, they didn&amp;#39;t really take me seriously (even with witnesses) until I asked if I could record our encounters so they would know without a doubt what was said. Reluctantly they agreed as long as I signed a waiver saying that the recordings remain internal (My store had cameras but no audio). It took about another month but I downloaded an app on my phone and recorded 3 more really inappropriate conversations. Presented management with the recordings, the assistant manager was transferred to another store 3 weeks after that. So just because you are escalating this doesn&amp;#39;t mean she will get fired. Businesses do not want to lose money on people they have trained and will often transfer/demote for a time until they improve their people skills or get fired after that point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdxtde", "score_hidden": true, "stickied": false, "created": 1492484500.0, "created_utc": 1492455700.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdy5h0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SurvivingMissPrism", "parent_id": "t1_dgdq95q", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "A toxic person can destroy a small business. She'll run off good workers, and if she's throwing tantrums then customers have likely noticed. If she won't shape up, Jack needs to consider firing her or else she'll sink the ship.\n\nAnd if she's this miserable, do you really think this is the right job? A lot of people stay in a bad job out of fear, and getting laid off can change their life for the better. If she has skills, she'll be able to find a job where she's happier and isn't making everyone miserable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A toxic person can destroy a small business. She&amp;#39;ll run off good workers, and if she&amp;#39;s throwing tantrums then customers have likely noticed. If she won&amp;#39;t shape up, Jack needs to consider firing her or else she&amp;#39;ll sink the ship.&lt;/p&gt;\n\n&lt;p&gt;And if she&amp;#39;s this miserable, do you really think this is the right job? A lot of people stay in a bad job out of fear, and getting laid off can change their life for the better. If she has skills, she&amp;#39;ll be able to find a job where she&amp;#39;s happier and isn&amp;#39;t making everyone miserable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdy5h0", "score_hidden": true, "stickied": false, "created": 1492484885.0, "created_utc": 1492456085.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dge0tng", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "claiiirrer", "parent_id": "t1_dgdq95q", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She deserves to be fired by the sounds of it, stick up for yourself damn", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She deserves to be fired by the sounds of it, stick up for yourself damn&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge0tng", "score_hidden": true, "stickied": false, "created": 1492487906.0, "created_utc": 1492459106.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq95q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MaybeUmaThurman", "parent_id": "t1_dgdk6ei", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's funny you mention the jealously thing as Jack would say that she was jealous of me all the time.\n\nHonestly? I don't know if they would fire her or me, and I don't want her to lose her job even if she is a nasty person, I'm not interested in putting someone out of a job and I hope it doesn't come to that. I actually had another job for 3 months in preparation of leaving this one but they couldn't work around my college timetable. I also don't really want to leave this job; it's a 15 minute walk from my house, I really like the other members of staff and it's really handy for me whilst I'm still in education.\n\nWhat happened to you totally sucks, and it sucks that people like us get let down just because someone has been there longer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s funny you mention the jealously thing as Jack would say that she was jealous of me all the time.&lt;/p&gt;\n\n&lt;p&gt;Honestly? I don&amp;#39;t know if they would fire her or me, and I don&amp;#39;t want her to lose her job even if she is a nasty person, I&amp;#39;m not interested in putting someone out of a job and I hope it doesn&amp;#39;t come to that. I actually had another job for 3 months in preparation of leaving this one but they couldn&amp;#39;t work around my college timetable. I also don&amp;#39;t really want to leave this job; it&amp;#39;s a 15 minute walk from my house, I really like the other members of staff and it&amp;#39;s really handy for me whilst I&amp;#39;m still in education.&lt;/p&gt;\n\n&lt;p&gt;What happened to you totally sucks, and it sucks that people like us get let down just because someone has been there longer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdq95q", "score_hidden": true, "stickied": false, "created": 1492476077.0, "created_utc": 1492447277.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdk6ei", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bringbackDiogenes", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She's jealous of you, obviously.  Kat got butthurt and now wants to retaliate when she's in the wrong.  You can't reason with people like her.  Of course you don't respect the witch.  Just be professional even when she's not.  Eventually reporting it to the management will get old to them, or you and management will change something around there.    I hope they don't make the poor decision to fire you for something unrelated over firing her.  \n\nI coincidently had a kitchen manager woman that liked me when I was a dishwasher under her and then was cold as hell to me when I transferred to being a waiter under someone else.  All I could do was try to ignore her while looking for a different job after work.  Management didn't care what I had to go through, and sided with her in every instance.  I became the guy to avoid amongst the waitstaff as if I had some curse.  I simply had to find another job.  2 months after I did, the restaurant shut down and many people had trouble chasing down their last paychecks from this place.  I sure dodged a bullet there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s jealous of you, obviously.  Kat got butthurt and now wants to retaliate when she&amp;#39;s in the wrong.  You can&amp;#39;t reason with people like her.  Of course you don&amp;#39;t respect the witch.  Just be professional even when she&amp;#39;s not.  Eventually reporting it to the management will get old to them, or you and management will change something around there.    I hope they don&amp;#39;t make the poor decision to fire you for something unrelated over firing her.  &lt;/p&gt;\n\n&lt;p&gt;I coincidently had a kitchen manager woman that liked me when I was a dishwasher under her and then was cold as hell to me when I transferred to being a waiter under someone else.  All I could do was try to ignore her while looking for a different job after work.  Management didn&amp;#39;t care what I had to go through, and sided with her in every instance.  I became the guy to avoid amongst the waitstaff as if I had some curse.  I simply had to find another job.  2 months after I did, the restaurant shut down and many people had trouble chasing down their last paychecks from this place.  I sure dodged a bullet there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdk6ei", "score_hidden": true, "stickied": false, "created": 1492468967.0, "created_utc": 1492440167.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdscw4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MaybeUmaThurman", "parent_id": "t1_dgdnvkx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is good, thanks! I'm being super careful not to pull up on peoples comments or anything and make it seem like a big deal; after all they're sick of her shit too and I don't wanna drop them in it.\n\nI'm hoping that if management confront her she'll do what she always does and throw a hissy fit, therefore proving that she's a total hothead.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is good, thanks! I&amp;#39;m being super careful not to pull up on peoples comments or anything and make it seem like a big deal; after all they&amp;#39;re sick of her shit too and I don&amp;#39;t wanna drop them in it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m hoping that if management confront her she&amp;#39;ll do what she always does and throw a hissy fit, therefore proving that she&amp;#39;s a total hothead.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdscw4", "score_hidden": true, "stickied": false, "created": 1492478412.0, "created_utc": 1492449612.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnvkx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crashfrog", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; One of the other members of staff told me today that Kat thinks that I do not respect her. I'm not sure where to go from here\n\nUnless you're hearing this *from management*, don't go anywhere with it. If Kat made some kind of complaint, then your management will know it's retaliatory. If Kat is just running her mouth to your coworkers, then there isn't anything to do about it. People can generally recognize a back-biter, especially when it's somebody old complaining about disrespect from young people.\n\nIf management gets involved, then ask for specific incidents, and tell them you have as much respect for Kat as you do for any of your *fellow co-workers.* Stress that last part. You don't work for Kat, you work *with* Kat, and you're happy to show her just as much deference as you'd show any of the kitchen staff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;One of the other members of staff told me today that Kat thinks that I do not respect her. I&amp;#39;m not sure where to go from here&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Unless you&amp;#39;re hearing this &lt;em&gt;from management&lt;/em&gt;, don&amp;#39;t go anywhere with it. If Kat made some kind of complaint, then your management will know it&amp;#39;s retaliatory. If Kat is just running her mouth to your coworkers, then there isn&amp;#39;t anything to do about it. People can generally recognize a back-biter, especially when it&amp;#39;s somebody old complaining about disrespect from young people.&lt;/p&gt;\n\n&lt;p&gt;If management gets involved, then ask for specific incidents, and tell them you have as much respect for Kat as you do for any of your &lt;em&gt;fellow co-workers.&lt;/em&gt; Stress that last part. You don&amp;#39;t work for Kat, you work &lt;em&gt;with&lt;/em&gt; Kat, and you&amp;#39;re happy to show her just as much deference as you&amp;#39;d show any of the kitchen staff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnvkx", "score_hidden": true, "stickied": false, "created": 1492473401.0, "created_utc": 1492444601.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdnyea", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "coob_detat", "parent_id": "t1_dgdmmtb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "To add on to this, I would write down the dates of when she pull(ed/s) you out of breaks and explain that you're following your direct orders but feel conflicted when she tells you to do the opposite. Pose it as \"I was following what Jack told me to do, but when she pulls me out of break and berates me for not helping, I can't help but feel attacked. Obviously, I want to be helpful, but I also know that I am legally entitled to a break of XYZ minutes.\" If she tries pushing it, use the log of dates of her doing this behavior to your benefit. You can leverage it, but the ideal is that you shouldn't have to. /Restaurant life is tough. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To add on to this, I would write down the dates of when she pull(ed/s) you out of breaks and explain that you&amp;#39;re following your direct orders but feel conflicted when she tells you to do the opposite. Pose it as &amp;quot;I was following what Jack told me to do, but when she pulls me out of break and berates me for not helping, I can&amp;#39;t help but feel attacked. Obviously, I want to be helpful, but I also know that I am legally entitled to a break of XYZ minutes.&amp;quot; If she tries pushing it, use the log of dates of her doing this behavior to your benefit. You can leverage it, but the ideal is that you shouldn&amp;#39;t have to. /Restaurant life is tough. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnyea", "score_hidden": true, "stickied": false, "created": 1492473491.0, "created_utc": 1492444691.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmmtb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FancyPantsDancer", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Has management said anything to you? If not, I wouldn't sweat it from that end.\n\nSome of what she's doing is just really bad for the business. I wouldn't patronize a place where someone is constantly yelling. It's not clear, but she might be violating some law if she's trying to get you to work during your break.\n\nIn terms of the situation, you probably aren't doing anything wrong and there's probably nothing you can do to appease Kat. People like her will find some fault with you. Just be professional. Don't lash out, follow her demands that are reasonable and check in with management if things seem off. If she's getting to you bad enough, it's worthwhile to try to find another job.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Has management said anything to you? If not, I wouldn&amp;#39;t sweat it from that end.&lt;/p&gt;\n\n&lt;p&gt;Some of what she&amp;#39;s doing is just really bad for the business. I wouldn&amp;#39;t patronize a place where someone is constantly yelling. It&amp;#39;s not clear, but she might be violating some law if she&amp;#39;s trying to get you to work during your break.&lt;/p&gt;\n\n&lt;p&gt;In terms of the situation, you probably aren&amp;#39;t doing anything wrong and there&amp;#39;s probably nothing you can do to appease Kat. People like her will find some fault with you. Just be professional. Don&amp;#39;t lash out, follow her demands that are reasonable and check in with management if things seem off. If she&amp;#39;s getting to you bad enough, it&amp;#39;s worthwhile to try to find another job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmmtb", "score_hidden": true, "stickied": false, "created": 1492471974.0, "created_utc": 1492443174.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdrfkx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MaybeUmaThurman", "parent_id": "t1_dgdk9ix", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My coworkers have said to me a number of times that they are ready to be mentioned by name if I needed 'evidence' of her harassing me, but they all work for the kitchen and I'm worried that if Kat stays, they might get fired or she will turn on them by cutting down hours or making their work difficult.\n\nI think they definitely see her as more valuable, but I think that they are also aware of her bad work attitude and I hope they recognise that I do like my work and I have covered many a shift and gone out of my way a number of times for customers that management is aware of. Thanks for your advice!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My coworkers have said to me a number of times that they are ready to be mentioned by name if I needed &amp;#39;evidence&amp;#39; of her harassing me, but they all work for the kitchen and I&amp;#39;m worried that if Kat stays, they might get fired or she will turn on them by cutting down hours or making their work difficult.&lt;/p&gt;\n\n&lt;p&gt;I think they definitely see her as more valuable, but I think that they are also aware of her bad work attitude and I hope they recognise that I do like my work and I have covered many a shift and gone out of my way a number of times for customers that management is aware of. Thanks for your advice!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdrfkx", "score_hidden": true, "stickied": false, "created": 1492477379.0, "created_utc": 1492448579.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdk9ix", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ksama112", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think at this point there is nothing you can do, just carry on as you have been doing. \n\n\nDon't for a second believe that no one is watching you or her and you relationship; you have also spoken to your own direct manager on a number of occasions. \nIt might be worth having your colleagues also voice their opinions of her to management. \n\nIt might be that your management see this and, taking everything into account give you the benefit of the doubt \n\nOn the other hand, just by virtue of being older and in an actual management position and therefore more \"valuable\" some might see her as more credible and take her side. \n\n\nReally, I think it's going to depend on what your company values and if management know what she's like. \n\nTldr; get other people to mention her behaviour and don't let the current situation change how you react to her. \nIf management care they are probably going to be watching. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think at this point there is nothing you can do, just carry on as you have been doing. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t for a second believe that no one is watching you or her and you relationship; you have also spoken to your own direct manager on a number of occasions. \nIt might be worth having your colleagues also voice their opinions of her to management. &lt;/p&gt;\n\n&lt;p&gt;It might be that your management see this and, taking everything into account give you the benefit of the doubt &lt;/p&gt;\n\n&lt;p&gt;On the other hand, just by virtue of being older and in an actual management position and therefore more &amp;quot;valuable&amp;quot; some might see her as more credible and take her side. &lt;/p&gt;\n\n&lt;p&gt;Really, I think it&amp;#39;s going to depend on what your company values and if management know what she&amp;#39;s like. &lt;/p&gt;\n\n&lt;p&gt;Tldr; get other people to mention her behaviour and don&amp;#39;t let the current situation change how you react to her. \nIf management care they are probably going to be watching. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdk9ix", "score_hidden": true, "stickied": false, "created": 1492469078.0, "created_utc": 1492440278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdrk6i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MaybeUmaThurman", "parent_id": "t1_dgdmte1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is something I'll say for sure if it ever comes up, thank you for phrasing my thoughts into actual words. I'm a little scrambled with the whole thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is something I&amp;#39;ll say for sure if it ever comes up, thank you for phrasing my thoughts into actual words. I&amp;#39;m a little scrambled with the whole thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdrk6i", "score_hidden": true, "stickied": false, "created": 1492477522.0, "created_utc": 1492448722.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmte1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "135791357", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; One of the other members of staff told me today that Kat thinks that I do not respect her.\n\n\"How can I respect someone who constantly belittles me?\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;One of the other members of staff told me today that Kat thinks that I do not respect her.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;How can I respect someone who constantly belittles me?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdmte1", "score_hidden": true, "stickied": false, "created": 1492472186.0, "created_utc": 1492443386.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdl9t1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cherpyderp", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What has Management done about this?  Keep a log of your issues with her and then keep track of when you notify management.  Continue letting them know what issues you're having.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What has Management done about this?  Keep a log of your issues with her and then keep track of when you notify management.  Continue letting them know what issues you&amp;#39;re having.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdl9t1", "score_hidden": true, "stickied": false, "created": 1492470346.0, "created_utc": 1492441546.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdtt1p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "overactive-bladder", "parent_id": "t1_dgdqaei", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "is it wrong to document or keep tabs (emails or voice recordings) to showcase the bullying or nastiness? like, how can someone prove that the other person is the one at fault? are there legal limits who will get someone in trouble if he wishes to tape confrontations?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;is it wrong to document or keep tabs (emails or voice recordings) to showcase the bullying or nastiness? like, how can someone prove that the other person is the one at fault? are there legal limits who will get someone in trouble if he wishes to tape confrontations?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdtt1p", "score_hidden": true, "stickied": false, "created": 1492480013.0, "created_utc": 1492451213.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqaei", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Elphabeth", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You know it's bad when other people are commenting on it.  One of my old managers used to bully me in front of customers, and I got a number of comments after she walked away, things like, \"Yikes!\" or, \"I'm sorry you have to deal with that,\" or, \"Someone woke up on the wrong side of the bed!\"\n\nKeep reporting specific incidents.  Make it clear that it's been going on for ages.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know it&amp;#39;s bad when other people are commenting on it.  One of my old managers used to bully me in front of customers, and I got a number of comments after she walked away, things like, &amp;quot;Yikes!&amp;quot; or, &amp;quot;I&amp;#39;m sorry you have to deal with that,&amp;quot; or, &amp;quot;Someone woke up on the wrong side of the bed!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Keep reporting specific incidents.  Make it clear that it&amp;#39;s been going on for ages.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdqaei", "score_hidden": true, "stickied": false, "created": 1492476116.0, "created_utc": 1492447316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdz5h8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "K_Rad", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "**Her:** \"Stop eating your lunch and go clear tables!\"\n\n**You:** \"Aww...bless your heart, I'm on break.\"\n\n**Her:** *interrupting you while you speak to a customer* \"Hurry up and run this food to that table!\"\n\n**You:** *ignore her completely* \"Sorry about that interruption folks! So, it was a Corona for you...\"\n\nYou are a wall, she is the tennis ball. Always be polite, and always disengage. Document and continue to report to Jack and management (especially when she does this in front of customers).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Her:&lt;/strong&gt; &amp;quot;Stop eating your lunch and go clear tables!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;You:&lt;/strong&gt; &amp;quot;Aww...bless your heart, I&amp;#39;m on break.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Her:&lt;/strong&gt; &lt;em&gt;interrupting you while you speak to a customer&lt;/em&gt; &amp;quot;Hurry up and run this food to that table!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;You:&lt;/strong&gt; &lt;em&gt;ignore her completely&lt;/em&gt; &amp;quot;Sorry about that interruption folks! So, it was a Corona for you...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You are a wall, she is the tennis ball. Always be polite, and always disengage. Document and continue to report to Jack and management (especially when she does this in front of customers).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdz5h8", "score_hidden": true, "stickied": false, "created": 1492486026.0, "created_utc": 1492457226.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdlmuz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoxWild", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She's done nothing to earn your respect.  Stop trying to appease her, that makes her worse.  Don't listen to staff members who tell you third-hand information.  Deal with your manager only.\n\nYour manager, Jack, is not handling this correctly.  He needs to clarify who is permitted to give you orders, and under what circumstances.  \nSpecific things like dress code and having free tea and coffee should also be addressed.  All this information should be written down so all staff know what's acceptable.\n\nYou've been targeted by Kat because you're young and want to please people and do a good job.  She's one of those irritating people who have a tiny bit of power in a tiny corner of the world, and uses it like she's Queen of the Galaxy.\n\nShe enjoys wrong-footing you, criticizing you and making you uncertain.\n\nIf she criticizes your clothes, hair, etc., tell her, \"I discussed your concerns with Jack, and he told me you were wrong and to ignore you.  So if you want to pursue this, you'll need to talk to Jack.\"  Walk away from her after you say this.\n\nTry to take your breaks away from where she can speak to you or see you.  If that's not possible, and she tries to interrupt your meal, tell her to start working on it herself, and you'll help when you're off your break.  If she tries to scream or force you, pick up your meal and move away from her.  Force her to respond to your actions.  Do not respond to hers.\n\nIf she screams at you, stand very still and watch her as she shouts and has her tantrum.  Do not respond, move, or interrupt until she stops screaming.  Then say calmly, \"You need to modify your tone when you speak to me.  Please speak more quietly.\"  Keep eye contact.  Try to have witnesses present who can observe her going berserk.\n\nYour management knows she is a problem, but she likely does a good job and they don't want to fire her.\n\nYou have every right to expect her to treat you respectfully.  She cannot demand something from you that she's not willing to give.\n\nIf you meet again with Jack, tell him, \"It seems like Kat is having more and more difficulty doing her work without getting frazzled.  Perhaps her job has become more than she can handle without losing her temper.  What can I and the rest of staff do to help her do her job more efficiently?\"\n\nNever, never engage in gossip about how much you dislike her or how unreasonable she is.\n\nYou should, however, make frequent passing comments about how Kat seems More Tired Than Usual Today.  Or, Kat Is Having Another Bad Day.  Or, I Think The Kitchen Manager Job Might Have Gotten Too Big For Kat.  Or, I Wonder If Kat's Personal Problems AreInterfering With Her Ability To Do Her Job Properly.  Say these things to only one person at a time, and don't say them to any one individual more than once a week.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s done nothing to earn your respect.  Stop trying to appease her, that makes her worse.  Don&amp;#39;t listen to staff members who tell you third-hand information.  Deal with your manager only.&lt;/p&gt;\n\n&lt;p&gt;Your manager, Jack, is not handling this correctly.  He needs to clarify who is permitted to give you orders, and under what circumstances.&lt;br/&gt;\nSpecific things like dress code and having free tea and coffee should also be addressed.  All this information should be written down so all staff know what&amp;#39;s acceptable.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve been targeted by Kat because you&amp;#39;re young and want to please people and do a good job.  She&amp;#39;s one of those irritating people who have a tiny bit of power in a tiny corner of the world, and uses it like she&amp;#39;s Queen of the Galaxy.&lt;/p&gt;\n\n&lt;p&gt;She enjoys wrong-footing you, criticizing you and making you uncertain.&lt;/p&gt;\n\n&lt;p&gt;If she criticizes your clothes, hair, etc., tell her, &amp;quot;I discussed your concerns with Jack, and he told me you were wrong and to ignore you.  So if you want to pursue this, you&amp;#39;ll need to talk to Jack.&amp;quot;  Walk away from her after you say this.&lt;/p&gt;\n\n&lt;p&gt;Try to take your breaks away from where she can speak to you or see you.  If that&amp;#39;s not possible, and she tries to interrupt your meal, tell her to start working on it herself, and you&amp;#39;ll help when you&amp;#39;re off your break.  If she tries to scream or force you, pick up your meal and move away from her.  Force her to respond to your actions.  Do not respond to hers.&lt;/p&gt;\n\n&lt;p&gt;If she screams at you, stand very still and watch her as she shouts and has her tantrum.  Do not respond, move, or interrupt until she stops screaming.  Then say calmly, &amp;quot;You need to modify your tone when you speak to me.  Please speak more quietly.&amp;quot;  Keep eye contact.  Try to have witnesses present who can observe her going berserk.&lt;/p&gt;\n\n&lt;p&gt;Your management knows she is a problem, but she likely does a good job and they don&amp;#39;t want to fire her.&lt;/p&gt;\n\n&lt;p&gt;You have every right to expect her to treat you respectfully.  She cannot demand something from you that she&amp;#39;s not willing to give.&lt;/p&gt;\n\n&lt;p&gt;If you meet again with Jack, tell him, &amp;quot;It seems like Kat is having more and more difficulty doing her work without getting frazzled.  Perhaps her job has become more than she can handle without losing her temper.  What can I and the rest of staff do to help her do her job more efficiently?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Never, never engage in gossip about how much you dislike her or how unreasonable she is.&lt;/p&gt;\n\n&lt;p&gt;You should, however, make frequent passing comments about how Kat seems More Tired Than Usual Today.  Or, Kat Is Having Another Bad Day.  Or, I Think The Kitchen Manager Job Might Have Gotten Too Big For Kat.  Or, I Wonder If Kat&amp;#39;s Personal Problems AreInterfering With Her Ability To Do Her Job Properly.  Say these things to only one person at a time, and don&amp;#39;t say them to any one individual more than once a week.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdlmuz", "score_hidden": true, "stickied": false, "created": 1492470795.0, "created_utc": 1492441995.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdtlml", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "co_sign", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Educate yourself on bullying (types, causes, and help with).  It will make you feel better to know you are not alone and it will give you healthy ways to cope.  I was bullied by a narcissist for a long time.  I took it personally until I was able to see it wasn't ME that was the problem.  She even did the \"doesn't respect me\" crap.  Basically this woman wants you to kow-tow to her, even though she doesn't deserve it.  Bullies have a crazy sense of self importance and entitlement. Bullies also thrive off making others look weak, and it is usually the person they feel the most threatened by.\n\nDocument everything, including your conversations with your boss about how you should treat her.  \n\nI hate to tell you but this probably won't end well.  You need to have another job lined up.  Kat won't back down (narcissism in bullies is very rarely curable) and she is never going to empathize with you.  She will likely continue to make your life hell until you either quit or she finds a way to get you fired.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Educate yourself on bullying (types, causes, and help with).  It will make you feel better to know you are not alone and it will give you healthy ways to cope.  I was bullied by a narcissist for a long time.  I took it personally until I was able to see it wasn&amp;#39;t ME that was the problem.  She even did the &amp;quot;doesn&amp;#39;t respect me&amp;quot; crap.  Basically this woman wants you to kow-tow to her, even though she doesn&amp;#39;t deserve it.  Bullies have a crazy sense of self importance and entitlement. Bullies also thrive off making others look weak, and it is usually the person they feel the most threatened by.&lt;/p&gt;\n\n&lt;p&gt;Document everything, including your conversations with your boss about how you should treat her.  &lt;/p&gt;\n\n&lt;p&gt;I hate to tell you but this probably won&amp;#39;t end well.  You need to have another job lined up.  Kat won&amp;#39;t back down (narcissism in bullies is very rarely curable) and she is never going to empathize with you.  She will likely continue to make your life hell until you either quit or she finds a way to get you fired.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdtlml", "score_hidden": true, "stickied": false, "created": 1492479786.0, "created_utc": 1492450986.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdkt5t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PM_TITS_OR_DONT", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "When you ask someone to do something and they just *don't*, it feels disrespectful.  But that's exactly what your management advised you to do with Kat and her attempts to guide you / manage you.  That was a bad call on management's part, they should have talked to Kat about her interactions with you earlier.\n\nI don't think you should worry about Kat's feelings here, just keep doing what you are doing.  Keep calm, be professional and helpful, dress appropriately.  Take your breaks and politely decline to take any assignments during break time.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you ask someone to do something and they just &lt;em&gt;don&amp;#39;t&lt;/em&gt;, it feels disrespectful.  But that&amp;#39;s exactly what your management advised you to do with Kat and her attempts to guide you / manage you.  That was a bad call on management&amp;#39;s part, they should have talked to Kat about her interactions with you earlier.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think you should worry about Kat&amp;#39;s feelings here, just keep doing what you are doing.  Keep calm, be professional and helpful, dress appropriately.  Take your breaks and politely decline to take any assignments during break time.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdkt5t", "score_hidden": true, "stickied": false, "created": 1492469773.0, "created_utc": 1492440973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdyja9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wonderlandgirl111", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She's jealous that you're young.  This probably has nothing to do with you and all to do with you have something she wants and can never have.  \n\nI've met women like this before and they're usually ones who are unhappy with their life (overweight, unattractive, low pay job, husband left her, etc) since there are lots of older women who do not do this.  The difference is that those who are happy with themselves have no time to care if someone \"doesn't respect them\" because they are too concerned with bettering themselves and spending time on things they DO like.\n\nGet a new job because she has the upperhand since she's older with more experience.  Literally the only thing that gets her off is that she has this weird power because everything else about her life is probably bad.\n\nWhile you're still there, I would just be a little bit blatantly rude.  Otherwise she is going to think she can push you more and more and get away with it.  Others won't agree with this, but its true.  You sound like me when I was that age like a decade ago.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s jealous that you&amp;#39;re young.  This probably has nothing to do with you and all to do with you have something she wants and can never have.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve met women like this before and they&amp;#39;re usually ones who are unhappy with their life (overweight, unattractive, low pay job, husband left her, etc) since there are lots of older women who do not do this.  The difference is that those who are happy with themselves have no time to care if someone &amp;quot;doesn&amp;#39;t respect them&amp;quot; because they are too concerned with bettering themselves and spending time on things they DO like.&lt;/p&gt;\n\n&lt;p&gt;Get a new job because she has the upperhand since she&amp;#39;s older with more experience.  Literally the only thing that gets her off is that she has this weird power because everything else about her life is probably bad.&lt;/p&gt;\n\n&lt;p&gt;While you&amp;#39;re still there, I would just be a little bit blatantly rude.  Otherwise she is going to think she can push you more and more and get away with it.  Others won&amp;#39;t agree with this, but its true.  You sound like me when I was that age like a decade ago.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdyja9", "score_hidden": true, "stickied": false, "created": 1492485318.0, "created_utc": 1492456518.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgduj8u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BettysBooped", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I have totally been there in my younger days, to the point of leaving a restaurant in tears. Call her on it! If she's being a jerk, just turn and say, \"Kat, I DON'T APPRECIATE being talking down to like that. If you won't treat me with respect, I won't help you.\" Better if you do this in front of others too, to give her a bit of humiliation. It sounds like this woman never really grew up, and is stuck in a high-school bullying role. Once you call her out, she will most likely stop. Right now she feels powerful having another person cower to her every whim. Nip that shit the bud.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have totally been there in my younger days, to the point of leaving a restaurant in tears. Call her on it! If she&amp;#39;s being a jerk, just turn and say, &amp;quot;Kat, I DON&amp;#39;T APPRECIATE being talking down to like that. If you won&amp;#39;t treat me with respect, I won&amp;#39;t help you.&amp;quot; Better if you do this in front of others too, to give her a bit of humiliation. It sounds like this woman never really grew up, and is stuck in a high-school bullying role. Once you call her out, she will most likely stop. Right now she feels powerful having another person cower to her every whim. Nip that shit the bud.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgduj8u", "score_hidden": true, "stickied": false, "created": 1492480809.0, "created_utc": 1492452009.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdvf2m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "redheadedblonde", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You don't respect her. And that's okay. People often assume they deserve respect, but respect is something that has to be earned - which she clearly hasn't earned. You're being polite to her. That's common courtesy and what she can assume to receive. You haven't done anything wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t respect her. And that&amp;#39;s okay. People often assume they deserve respect, but respect is something that has to be earned - which she clearly hasn&amp;#39;t earned. You&amp;#39;re being polite to her. That&amp;#39;s common courtesy and what she can assume to receive. You haven&amp;#39;t done anything wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdvf2m", "score_hidden": true, "stickied": false, "created": 1492481794.0, "created_utc": 1492452994.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdwf6j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Epicuriosityy", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Fuck this bumface! Sorry I'm drunk.\n\nBut when I worked at a bookstore this woman yelled at me too for no reason. You're a hard worker. Don't let her problems become yours.\n\nShe sucks. You're not trying to get her fired but if that happens because you tell mgmt how much she is the worst,,, not your fault.\n\nShe chose to behave that way! \n\nRise above", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck this bumface! Sorry I&amp;#39;m drunk.&lt;/p&gt;\n\n&lt;p&gt;But when I worked at a bookstore this woman yelled at me too for no reason. You&amp;#39;re a hard worker. Don&amp;#39;t let her problems become yours.&lt;/p&gt;\n\n&lt;p&gt;She sucks. You&amp;#39;re not trying to get her fired but if that happens because you tell mgmt how much she is the worst,,, not your fault.&lt;/p&gt;\n\n&lt;p&gt;She chose to behave that way! &lt;/p&gt;\n\n&lt;p&gt;Rise above&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdwf6j", "score_hidden": true, "stickied": false, "created": 1492482922.0, "created_utc": 1492454122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdxaw8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GTmakesthepaingoaway", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "When the bleep will people learn that respect is not something you demand or are entitled to. It is something you bleep bleepity bleepbleep earn through your actions. And no, getting hired on or promoted to a higher paycheck than the people around you does NOT mean you have earned this mythical \"respect\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When the bleep will people learn that respect is not something you demand or are entitled to. It is something you bleep bleepity bleepbleep earn through your actions. And no, getting hired on or promoted to a higher paycheck than the people around you does NOT mean you have earned this mythical &amp;quot;respect&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdxaw8", "score_hidden": true, "stickied": false, "created": 1492483920.0, "created_utc": 1492455120.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdxjz3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "weakling778", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Easy answer: she's obsessed with you from either jealousy, insecurity, hatred, or other. \n\nKitchen staff that isn't crazy and can cook well are hard to come by. \n\nIgnore her 100% act like she isn't there / doesn't exist is my go-to method of dealing with psychos like that at work, which unfortunately they exist. \n\nIf I was in that spot again, I would either quit like I did or tell that person, literally, \"shut the fuck up if you know what's good for you\". \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Easy answer: she&amp;#39;s obsessed with you from either jealousy, insecurity, hatred, or other. &lt;/p&gt;\n\n&lt;p&gt;Kitchen staff that isn&amp;#39;t crazy and can cook well are hard to come by. &lt;/p&gt;\n\n&lt;p&gt;Ignore her 100% act like she isn&amp;#39;t there / doesn&amp;#39;t exist is my go-to method of dealing with psychos like that at work, which unfortunately they exist. &lt;/p&gt;\n\n&lt;p&gt;If I was in that spot again, I would either quit like I did or tell that person, literally, &amp;quot;shut the fuck up if you know what&amp;#39;s good for you&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdxjz3", "score_hidden": true, "stickied": false, "created": 1492484207.0, "created_utc": 1492455407.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdxxw8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "annarchy8", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You don't owe her respect. Especially with how she has bullied you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t owe her respect. Especially with how she has bullied you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdxxw8", "score_hidden": true, "stickied": false, "created": 1492484639.0, "created_utc": 1492455839.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdy287", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stink3rbelle", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;One of the other members of staff told me today that Kat thinks that I do not respect her. I'm not sure where to go from here because how do I prove to management that I respect her when she is so constantly gunning for me?\n\nHonestly, I'm surprised at some of the comments on here, because this doesn't sound like it's your problem at all. You don't need to prove anything to management about it until *they* talk to you. I'd ignore this other staff person, and maybe treat them with a bit of caution as they may like to stir drama and trouble. If they didn't have any ideas for you to butter her up or help her treat you better, they sound like they were just stirring the pot. Let management take Kat on as you've told them to, and ask your direct supervisor to take her on sometimes, too. It sounds like he's long overdue to confront her about bossing around *his* team members.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;One of the other members of staff told me today that Kat thinks that I do not respect her. I&amp;#39;m not sure where to go from here because how do I prove to management that I respect her when she is so constantly gunning for me?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Honestly, I&amp;#39;m surprised at some of the comments on here, because this doesn&amp;#39;t sound like it&amp;#39;s your problem at all. You don&amp;#39;t need to prove anything to management about it until &lt;em&gt;they&lt;/em&gt; talk to you. I&amp;#39;d ignore this other staff person, and maybe treat them with a bit of caution as they may like to stir drama and trouble. If they didn&amp;#39;t have any ideas for you to butter her up or help her treat you better, they sound like they were just stirring the pot. Let management take Kat on as you&amp;#39;ve told them to, and ask your direct supervisor to take her on sometimes, too. It sounds like he&amp;#39;s long overdue to confront her about bossing around &lt;em&gt;his&lt;/em&gt; team members.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdy287", "score_hidden": true, "stickied": false, "created": 1492484781.0, "created_utc": 1492455981.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dge0rif", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EE_108", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm gonna be the guy with the unpopular opinion it seems...\n\njust ignore it/her. \n\nI worked through college serving/bartending/etc. Some managers were cool, others sucked. It's great when you're on their good side, bad when they're on your bad side.\n\nHowever, this is NOT your manager. You're part of the FOH (front of house) staff, while she's part of the back of house. She has no direct influence over you, only on your managers and GM. \n\nGive her no reason to come after you, but don't listen to her either. If she's super persistent about you \"messing something up\" simply say \"If it were an issue, I'm sure (front of the house manager) would have said something. Thanks for your concern\" \n\nFrom the sounds of things, she really isn't that bad as far as restaurant managers go. \n\nWould you be happy if you were in your 50's still working in a restaurant? Put up with her comments so that you don't end up like her. Use them as fuel.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m gonna be the guy with the unpopular opinion it seems...&lt;/p&gt;\n\n&lt;p&gt;just ignore it/her. &lt;/p&gt;\n\n&lt;p&gt;I worked through college serving/bartending/etc. Some managers were cool, others sucked. It&amp;#39;s great when you&amp;#39;re on their good side, bad when they&amp;#39;re on your bad side.&lt;/p&gt;\n\n&lt;p&gt;However, this is NOT your manager. You&amp;#39;re part of the FOH (front of house) staff, while she&amp;#39;s part of the back of house. She has no direct influence over you, only on your managers and GM. &lt;/p&gt;\n\n&lt;p&gt;Give her no reason to come after you, but don&amp;#39;t listen to her either. If she&amp;#39;s super persistent about you &amp;quot;messing something up&amp;quot; simply say &amp;quot;If it were an issue, I&amp;#39;m sure (front of the house manager) would have said something. Thanks for your concern&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;From the sounds of things, she really isn&amp;#39;t that bad as far as restaurant managers go. &lt;/p&gt;\n\n&lt;p&gt;Would you be happy if you were in your 50&amp;#39;s still working in a restaurant? Put up with her comments so that you don&amp;#39;t end up like her. Use them as fuel.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge0rif", "score_hidden": true, "stickied": false, "created": 1492487839.0, "created_utc": 1492459039.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dge29ir", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ermergerdperderders", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Stand your ground OP. And bring up the \"Obey vs. Respect\" point of view subtly. I'll be waiting for an update. Kat needs to be put in her place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stand your ground OP. And bring up the &amp;quot;Obey vs. Respect&amp;quot; point of view subtly. I&amp;#39;ll be waiting for an update. Kat needs to be put in her place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge29ir", "score_hidden": true, "stickied": false, "created": 1492489518.0, "created_utc": 1492460718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dge2b2r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "honestly_honestly", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Be firm, but polite. She interrupts your break? Tell her you'll do it as soon as you're back from break. Repeat as necessary. Criticizes your appearance? Thank her for her input and ignore as necessary. Says you don't respect her? Ask her why she feels that way, but don't respond or defend. \n\nStand up for yourself in a constructive way. It's a good thing to learn how to do in this world.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Be firm, but polite. She interrupts your break? Tell her you&amp;#39;ll do it as soon as you&amp;#39;re back from break. Repeat as necessary. Criticizes your appearance? Thank her for her input and ignore as necessary. Says you don&amp;#39;t respect her? Ask her why she feels that way, but don&amp;#39;t respond or defend. &lt;/p&gt;\n\n&lt;p&gt;Stand up for yourself in a constructive way. It&amp;#39;s a good thing to learn how to do in this world.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge2b2r", "score_hidden": true, "stickied": false, "created": 1492489564.0, "created_utc": 1492460764.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dge32s8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rosiedoes", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "In my experience, both as an employee and a manager, every workplace has one of these bossy shits.\n\nAlso in my experience, they've probably been there a long time and are part of the furniture. They usually know the place and dominate over younger or less confident managers who don't have the nerve to stand up to them or just want a quiet life. It tends to take something really, really major for them to be brought up on it, and in defending themselves, they'll throw you under buses they've personally commissioned for the purpose.\n\nYou'll probably also find that your colleagues will only back you privately, because they know what happens when you step out of line - they'll be next in the firing line because she's unlikely to be fired, for the reasons above.\n\nOf course, your workplace may be the exception, but if this has been going on for two years and you've raised issues with your manager previously and nothing has been done, except to tell you to ignore her, then it isn't very likely to change any time soon.\n\nYour priority, really, should be making a decision about whether you want to live with this, or cut your losses. Being bullied - because that's what you're experiencing - will ruin your confidence and make you miserable.\n\nYou don't need to go through this and it wouldn't be cowardly to leave. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my experience, both as an employee and a manager, every workplace has one of these bossy shits.&lt;/p&gt;\n\n&lt;p&gt;Also in my experience, they&amp;#39;ve probably been there a long time and are part of the furniture. They usually know the place and dominate over younger or less confident managers who don&amp;#39;t have the nerve to stand up to them or just want a quiet life. It tends to take something really, really major for them to be brought up on it, and in defending themselves, they&amp;#39;ll throw you under buses they&amp;#39;ve personally commissioned for the purpose.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll probably also find that your colleagues will only back you privately, because they know what happens when you step out of line - they&amp;#39;ll be next in the firing line because she&amp;#39;s unlikely to be fired, for the reasons above.&lt;/p&gt;\n\n&lt;p&gt;Of course, your workplace may be the exception, but if this has been going on for two years and you&amp;#39;ve raised issues with your manager previously and nothing has been done, except to tell you to ignore her, then it isn&amp;#39;t very likely to change any time soon.&lt;/p&gt;\n\n&lt;p&gt;Your priority, really, should be making a decision about whether you want to live with this, or cut your losses. Being bullied - because that&amp;#39;s what you&amp;#39;re experiencing - will ruin your confidence and make you miserable.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need to go through this and it wouldn&amp;#39;t be cowardly to leave. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge32s8", "score_hidden": true, "stickied": false, "created": 1492490425.0, "created_utc": 1492461625.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdw9vz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdw9vz", "score_hidden": true, "stickied": false, "created": 1492482754.0, "created_utc": 1492453954.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65vv8c", "likes": null, "replies": "", "user_reports": [], "id": "dgdl89r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Grim_Truths_With_Luv", "parent_id": "t3_65vv8c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Next time she says anything to you that is not entirely polite and 100% directed on a duty you actually have to perform right then, quietly respond, \"Leave me alone. I don't work for you.\"  Then walk away.  No further conversation with her about anything.\n\nTell your boss this is how you are going to deal with her from now on, because she cannot seem to behave herself.  If boss does not support you, look for another job. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Next time she says anything to you that is not entirely polite and 100% directed on a duty you actually have to perform right then, quietly respond, &amp;quot;Leave me alone. I don&amp;#39;t work for you.&amp;quot;  Then walk away.  No further conversation with her about anything.&lt;/p&gt;\n\n&lt;p&gt;Tell your boss this is how you are going to deal with her from now on, because she cannot seem to behave herself.  If boss does not support you, look for another job. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdl89r", "score_hidden": true, "stickied": false, "created": 1492470293.0, "created_utc": 1492441493.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]