[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I come from a string of toxic relations rife with infidelity both on my part, and on the other party&amp;#39;s. &lt;/p&gt;\n\n&lt;p&gt;After my last breakup 3 years back, I decided I was done with this whole business of infidelity and transgressions, and have since moved to Japan due to occupational reasons.&lt;/p&gt;\n\n&lt;p&gt;After arriving in this foreign land, I met a wonderful woman (25f, Japanese) whom I am terribly fond of.&lt;/p&gt;\n\n&lt;p&gt;However, much to my appal, I&amp;#39;ve found that Japanese have a highly unusual take on fidelity.&lt;/p&gt;\n\n&lt;p&gt;To list off a few things off the top of my head:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Cheating happens, a lot, for both men and women&lt;/li&gt;\n&lt;li&gt;Physical transgressions are generally not considered to be cheating, unless emotions are involved&lt;/li&gt;\n&lt;li&gt;And perhaps, most unusual, sex with a third party is not always considered cheating, particularly when it&amp;#39;s paid for&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;If you need more elaboration, there&amp;#39;s a video on youtube about cheating by Asian Boss which sums up pretty well.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve since expressed my concern to my partner, and while, thankfully, she does not hold the view that cheating is okay, I&amp;#39;ve mostly been brushed off as being too conservative.&lt;/p&gt;\n\n&lt;p&gt;While that is somewhat a relief, I&amp;#39;m still not fully accepting of the fact that my partner has a much lower standard of fidelity than me.&lt;/p&gt;\n\n&lt;p&gt;To a large extent, I can understand how she feels. In fact, I&amp;#39;ve always reasoned with myself by drawing parallels to substance usage. I&amp;#39;ve dated women who have very strict views on substance use, and frankly, there&amp;#39;s little I can do but brush them off as conservative. Simply, I can&amp;#39;t change my views because substance use is simply not a big deal to me. Likewise, for a women who has been steeped in a culture that normalises cheating, it would be simply impossible for her to take a different view to this.&lt;/p&gt;\n\n&lt;p&gt;While I have complete faith in her, and take her words at face value, the lower standards she holds to infidelity would simply mean that she could be in situations which are completely acceptable to her, but be orthogonal to my views.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m quite at loss of what to do. Her answer to this was simply for me to lower my standards to that of hers, which is something that I&amp;#39;ve since strongly set my mind against.&lt;/p&gt;\n\n&lt;p&gt;Reddit, please offer me your piece of mind. Onegaishimasu.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: Partner has lower standards of fidelity than I.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I come from a string of toxic relations rife with infidelity both on my part, and on the other party's. \n\nAfter my last breakup 3 years back, I decided I was done with this whole business of infidelity and transgressions, and have since moved to Japan due to occupational reasons.\n\nAfter arriving in this foreign land, I met a wonderful woman (25f, Japanese) whom I am terribly fond of.\n\nHowever, much to my appal, I've found that Japanese have a highly unusual take on fidelity.\n\nTo list off a few things off the top of my head:\n\n* Cheating happens, a lot, for both men and women\n* Physical transgressions are generally not considered to be cheating, unless emotions are involved\n* And perhaps, most unusual, sex with a third party is not always considered cheating, particularly when it's paid for\n\nIf you need more elaboration, there's a video on youtube about cheating by Asian Boss which sums up pretty well.\n\nI've since expressed my concern to my partner, and while, thankfully, she does not hold the view that cheating is okay, I've mostly been brushed off as being too conservative.\n\nWhile that is somewhat a relief, I'm still not fully accepting of the fact that my partner has a much lower standard of fidelity than me.\n\nTo a large extent, I can understand how she feels. In fact, I've always reasoned with myself by drawing parallels to substance usage. I've dated women who have very strict views on substance use, and frankly, there's little I can do but brush them off as conservative. Simply, I can't change my views because substance use is simply not a big deal to me. Likewise, for a women who has been steeped in a culture that normalises cheating, it would be simply impossible for her to take a different view to this.\n\nWhile I have complete faith in her, and take her words at face value, the lower standards she holds to infidelity would simply mean that she could be in situations which are completely acceptable to her, but be orthogonal to my views.\n\nI'm quite at loss of what to do. Her answer to this was simply for me to lower my standards to that of hers, which is something that I've since strongly set my mind against.\n\nReddit, please offer me your piece of mind. Onegaishimasu.\n  \n  ---   \n  **tl;dr**: Partner has lower standards of fidelity than I.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Infidelity", "id": "65wche", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 126, "report_reasons": null, "author": "awesterdam", "saved": false, "mod_reports": [], "name": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-oe infidelity", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/65wche/ive_30m_left_behind_a_past_of_infidelity_only_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492472967.0, "url": "https://www.reddit.com/r/relationships/comments/65wche/ive_30m_left_behind_a_past_of_infidelity_only_to/", "author_flair_text": null, "quarantine": false, "title": "I've [30m] left behind a past of infidelity, only to be thrown into a culture of infidelity.", "created_utc": 1492444167.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 31, "visited": false, "subreddit_type": "public", "ups": 126}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdpgvz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gubbanubnubdoorahka", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You are always going to have different standards than your partner on things. Your girlfriend says she understands your standards, and while she doesn't share them in the same way, she respects them and will abide by them. So the actual question is, do you trust her?\n\nIt doesn't sounds like you do, but it also sounds like the reasons are more cultural than specific to her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are always going to have different standards than your partner on things. Your girlfriend says she understands your standards, and while she doesn&amp;#39;t share them in the same way, she respects them and will abide by them. So the actual question is, do you trust her?&lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t sounds like you do, but it also sounds like the reasons are more cultural than specific to her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdpgvz", "score_hidden": true, "stickied": false, "created": 1492475204.0, "created_utc": 1492446404.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdoe7d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "notcalledemma", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "After 4 years in Japan I left because I saw no long term future for myself there in terms of relationships, and I didn't want to embrace a life of celibacy or loneliness. l became incredibly jaded because of the attitudes to fidelity and relationships. Even foreigners who come from cultures with similar values to myself seemed to embrace the infidelity culture. The attitude is 'what they don't know can't hurt them'. Ultimately can you ever trust that she actually respects you, or is she so normalised to the idea that as long as she gets away with it that is still her respecting you. You can't be with someone if you need them to change. You can try and change yourself but it's hard to do that in a way that is sustainable longterm and positive for your mental health. Or, it's not going to work out. It eats away at you, because it is SUCH a cultural norm there. I found it too vast a difference. She's said that for her, the answer is for you to lower your standards. Have a watch of Dan Savage's 'Price of Admission' talk. Is this a price of admission you are willing to pay?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;After 4 years in Japan I left because I saw no long term future for myself there in terms of relationships, and I didn&amp;#39;t want to embrace a life of celibacy or loneliness. l became incredibly jaded because of the attitudes to fidelity and relationships. Even foreigners who come from cultures with similar values to myself seemed to embrace the infidelity culture. The attitude is &amp;#39;what they don&amp;#39;t know can&amp;#39;t hurt them&amp;#39;. Ultimately can you ever trust that she actually respects you, or is she so normalised to the idea that as long as she gets away with it that is still her respecting you. You can&amp;#39;t be with someone if you need them to change. You can try and change yourself but it&amp;#39;s hard to do that in a way that is sustainable longterm and positive for your mental health. Or, it&amp;#39;s not going to work out. It eats away at you, because it is SUCH a cultural norm there. I found it too vast a difference. She&amp;#39;s said that for her, the answer is for you to lower your standards. Have a watch of Dan Savage&amp;#39;s &amp;#39;Price of Admission&amp;#39; talk. Is this a price of admission you are willing to pay?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdoe7d", "score_hidden": true, "stickied": false, "created": 1492473995.0, "created_utc": 1492445195.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdttlg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Queengnome", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I knew where you lived the second I read the title.  \n\n\n  It's true, infidelity is interwoven into the culture here to some degree. That being said, there ARE people who want nothing to do with that, and will be very clear on it if you're willing to look for them. I know several friends here with long and happy interracial marriages and relationships - male and female. \n\n\n  It's not super easy to find one of those people, of course. IF you want to stay here long term, you'll have to be very specific in what kind of person you look for and choose to be in a relationship with. The majority of the foreign guys I know here have had major problems in their marriages, mostly (I think) because they compromised and fell hard. \n\n\n  Look for women who have studied or lived abroad, ideally. Women who are well educated, and open minded to foreign culture. These are the kind of women I keep as friends here, and almost all have no interest in the culture of infidelity. \n Good luck.\n\nEsit: I just did a little thinking on all of this and realized that in every one of the successful interracial marriages that I've seen here, the Japanese partner has lived abroad. Heh.", "edited": 1492453270.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I knew where you lived the second I read the title.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s true, infidelity is interwoven into the culture here to some degree. That being said, there ARE people who want nothing to do with that, and will be very clear on it if you&amp;#39;re willing to look for them. I know several friends here with long and happy interracial marriages and relationships - male and female. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not super easy to find one of those people, of course. IF you want to stay here long term, you&amp;#39;ll have to be very specific in what kind of person you look for and choose to be in a relationship with. The majority of the foreign guys I know here have had major problems in their marriages, mostly (I think) because they compromised and fell hard. &lt;/p&gt;\n\n&lt;p&gt;Look for women who have studied or lived abroad, ideally. Women who are well educated, and open minded to foreign culture. These are the kind of women I keep as friends here, and almost all have no interest in the culture of infidelity. \n Good luck.&lt;/p&gt;\n\n&lt;p&gt;Esit: I just did a little thinking on all of this and realized that in every one of the successful interracial marriages that I&amp;#39;ve seen here, the Japanese partner has lived abroad. Heh.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdttlg", "score_hidden": true, "stickied": false, "created": 1492480030.0, "created_utc": 1492451230.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdnsl7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Callyentay", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Find someone whose morals align more with yours.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Find someone whose morals align more with yours.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdnsl7", "score_hidden": true, "stickied": false, "created": 1492473305.0, "created_utc": 1492444505.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdutc0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jetthrowaway987", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Ok, one thing I want to clarify - are these the standards she's holding you to, or the standards she's holding herself to? Because if these are in regards to you, the solution is just...not to cheat. \nI guess I'm confused because from what I remember, there's far more acceptance of men cheating, not women. Like the paid sex example you used - with the exception of host clubs (which are a whole other kettle of fish) there's pretty much no male prostitution compared to the amount of soaplands and the like for men. I'd also like to note that you necessarily shouldn't take the statements in that video - especially about the percentage of cheaters - as fact. There are articles with more comprehensive stats.\n\nIn the end, if your wife does hold a different standard, then you should have a clear conversation about where your particular boundaries are, regardless of cultural norms. Communication is #1 in an intercultural relationship, and if you can't hash this one out, then you'll inevitably run into another wall on other issues.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok, one thing I want to clarify - are these the standards she&amp;#39;s holding you to, or the standards she&amp;#39;s holding herself to? Because if these are in regards to you, the solution is just...not to cheat. \nI guess I&amp;#39;m confused because from what I remember, there&amp;#39;s far more acceptance of men cheating, not women. Like the paid sex example you used - with the exception of host clubs (which are a whole other kettle of fish) there&amp;#39;s pretty much no male prostitution compared to the amount of soaplands and the like for men. I&amp;#39;d also like to note that you necessarily shouldn&amp;#39;t take the statements in that video - especially about the percentage of cheaters - as fact. There are articles with more comprehensive stats.&lt;/p&gt;\n\n&lt;p&gt;In the end, if your wife does hold a different standard, then you should have a clear conversation about where your particular boundaries are, regardless of cultural norms. Communication is #1 in an intercultural relationship, and if you can&amp;#39;t hash this one out, then you&amp;#39;ll inevitably run into another wall on other issues.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdutc0", "score_hidden": true, "stickied": false, "created": 1492481116.0, "created_utc": 1492452316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdui4k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crashfrog", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; While I have complete faith in her, and take her words at face value, the lower standards she holds to infidelity would simply mean that she could be in situations which are completely acceptable to her, but be orthogonal to my views.\n\nOn one hand, you shouldn't discount the incredible human ability to disappoint those we care about. On the other hand, that's something *everyone* has to face in intimate relationships, because to be *intimate* with someone is to be forced to grapple with them in all their essentially humanity.\n\nSo I don't really see your problem as *unique* in any way - your partner understands how infidelity would hurt you and that you have what she considers a \"conservative\" view of it. But then also maybe she knows about your past and considers you a hypocrite. Or else she knows about your past and thinks \"maybe he knows something I don't from his experience.\" In other words you're *trusting another human being* not to hurt you.\n\nWell, that's the nature of intimacy - everyone in a relationship has some version of this problem. The act of *trust* is the act of discerning her motivations and the general level of willpower with which she's able to delay gratification to pursue those motivations, and deciding that it adds up to someone who is both willing and able not to do things they would enjoy that would cause you harm. And if you *don't* think she would, then what you're looking for in a partner isn't there, and you should move on. But if you *do* think she would, then you're fine - this is just about the level of *help* you think she'll get from her culture. But if you think she'll do just fine without the help, it doesn't matter. She'll be faced by temptation the same as most everyone is, whether you're in the West or the East. She already is. If you trust her to do the right thing, you shouldn't find it difficult to convince yourself to live as though you trust her.\n\n&gt;  the lower standards she holds to infidelity would simply mean that she could be in situations which are completely acceptable to her, but be orthogonal to my views.\n\nWell, yes. She's going to do things that she didn't realize would cause you pain. You're going to do the same to her. It's inevitable, inherent in our humanity. Part of being an adult in a relationship is how you both deal with the aftermath of the situation. Because it's not possible to *avoid* it. You're both human beings, after all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;While I have complete faith in her, and take her words at face value, the lower standards she holds to infidelity would simply mean that she could be in situations which are completely acceptable to her, but be orthogonal to my views.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;On one hand, you shouldn&amp;#39;t discount the incredible human ability to disappoint those we care about. On the other hand, that&amp;#39;s something &lt;em&gt;everyone&lt;/em&gt; has to face in intimate relationships, because to be &lt;em&gt;intimate&lt;/em&gt; with someone is to be forced to grapple with them in all their essentially humanity.&lt;/p&gt;\n\n&lt;p&gt;So I don&amp;#39;t really see your problem as &lt;em&gt;unique&lt;/em&gt; in any way - your partner understands how infidelity would hurt you and that you have what she considers a &amp;quot;conservative&amp;quot; view of it. But then also maybe she knows about your past and considers you a hypocrite. Or else she knows about your past and thinks &amp;quot;maybe he knows something I don&amp;#39;t from his experience.&amp;quot; In other words you&amp;#39;re &lt;em&gt;trusting another human being&lt;/em&gt; not to hurt you.&lt;/p&gt;\n\n&lt;p&gt;Well, that&amp;#39;s the nature of intimacy - everyone in a relationship has some version of this problem. The act of &lt;em&gt;trust&lt;/em&gt; is the act of discerning her motivations and the general level of willpower with which she&amp;#39;s able to delay gratification to pursue those motivations, and deciding that it adds up to someone who is both willing and able not to do things they would enjoy that would cause you harm. And if you &lt;em&gt;don&amp;#39;t&lt;/em&gt; think she would, then what you&amp;#39;re looking for in a partner isn&amp;#39;t there, and you should move on. But if you &lt;em&gt;do&lt;/em&gt; think she would, then you&amp;#39;re fine - this is just about the level of &lt;em&gt;help&lt;/em&gt; you think she&amp;#39;ll get from her culture. But if you think she&amp;#39;ll do just fine without the help, it doesn&amp;#39;t matter. She&amp;#39;ll be faced by temptation the same as most everyone is, whether you&amp;#39;re in the West or the East. She already is. If you trust her to do the right thing, you shouldn&amp;#39;t find it difficult to convince yourself to live as though you trust her.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;the lower standards she holds to infidelity would simply mean that she could be in situations which are completely acceptable to her, but be orthogonal to my views.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, yes. She&amp;#39;s going to do things that she didn&amp;#39;t realize would cause you pain. You&amp;#39;re going to do the same to her. It&amp;#39;s inevitable, inherent in our humanity. Part of being an adult in a relationship is how you both deal with the aftermath of the situation. Because it&amp;#39;s not possible to &lt;em&gt;avoid&lt;/em&gt; it. You&amp;#39;re both human beings, after all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdui4k", "score_hidden": true, "stickied": false, "created": 1492480774.0, "created_utc": 1492451974.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdxlge", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IvainFirelord", "parent_id": "t1_dgds3qa", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is real. I had to have this kind of conversation with my recent ex *all the time* for like the first whole year of our relationship and beyond. It just kept coming!\n\n&gt;No, I'm not comfortable with you making out with people who aren't me.\n\n&gt;No, I'm not comfortable with you going out and letting other guys pick you up and dance with you. Maybe because you've made out with 3 of them. Maybe they did kiss you without asking, but point made.\n\n&gt;No, please don't date other men for food while we're dating. (This was early on but wtf)\n\n&gt;No, I'm not comfortable with you being naked in front of other guys (she pushed back and never agreed to this).\n\nWhen shit like this keeps coming it is *absolutely* exhausting, as you feel like you have to come up with every possible negative scenario in your mind and explicitly rope it off, otherwise they'll go do it and when it inevitably comes up later they'll be all like \"oh but we never discussed that\" and you'll be like \"$%&amp;#@, but you have a brain, don't you?!\"\n\nI'm the type that goes totally the other direction and places extreme limits on myself for the sake of a relationship that could probably be relaxed over time; having a partner that doesn't set those boundaries at all is very upsetting, as you feel like they don't reciprocate what you're willing to give for them. Ultimately, this mindset difference can be a really big issue, even beyond the actual actions involved.\n\nIt did go the other way where I was very confident she would stick to the letter of the law if she agreed to something whereas I was much more likely to work with unspoken rules/motivations. But ultimately it was an extremely aggravating sign of low emotional intelligence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is real. I had to have this kind of conversation with my recent ex &lt;em&gt;all the time&lt;/em&gt; for like the first whole year of our relationship and beyond. It just kept coming!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;No, I&amp;#39;m not comfortable with you making out with people who aren&amp;#39;t me.&lt;/p&gt;\n\n&lt;p&gt;No, I&amp;#39;m not comfortable with you going out and letting other guys pick you up and dance with you. Maybe because you&amp;#39;ve made out with 3 of them. Maybe they did kiss you without asking, but point made.&lt;/p&gt;\n\n&lt;p&gt;No, please don&amp;#39;t date other men for food while we&amp;#39;re dating. (This was early on but wtf)&lt;/p&gt;\n\n&lt;p&gt;No, I&amp;#39;m not comfortable with you being naked in front of other guys (she pushed back and never agreed to this).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When shit like this keeps coming it is &lt;em&gt;absolutely&lt;/em&gt; exhausting, as you feel like you have to come up with every possible negative scenario in your mind and explicitly rope it off, otherwise they&amp;#39;ll go do it and when it inevitably comes up later they&amp;#39;ll be all like &amp;quot;oh but we never discussed that&amp;quot; and you&amp;#39;ll be like &amp;quot;$%&amp;amp;#@, but you have a brain, don&amp;#39;t you?!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m the type that goes totally the other direction and places extreme limits on myself for the sake of a relationship that could probably be relaxed over time; having a partner that doesn&amp;#39;t set those boundaries at all is very upsetting, as you feel like they don&amp;#39;t reciprocate what you&amp;#39;re willing to give for them. Ultimately, this mindset difference can be a really big issue, even beyond the actual actions involved.&lt;/p&gt;\n\n&lt;p&gt;It did go the other way where I was very confident she would stick to the letter of the law if she agreed to something whereas I was much more likely to work with unspoken rules/motivations. But ultimately it was an extremely aggravating sign of low emotional intelligence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdxlge", "score_hidden": true, "stickied": false, "created": 1492484253.0, "created_utc": 1492455453.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dge1tv9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "remizidae", "parent_id": "t1_dgds3qa", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just out of curiosity, what IS cheating if sex doesn't count?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just out of curiosity, what IS cheating if sex doesn&amp;#39;t count?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge1tv9", "score_hidden": true, "stickied": false, "created": 1492489035.0, "created_utc": 1492460235.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgds3qa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "russkayastudentka", "parent_id": "t1_dgdo4vs", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It could be that he trusts her not to cheat, but they have very different definitions of cheating. To some people a drunken kiss with someone else is definitely cheating, while to someone in a culture where even sex isn't necessarily cheating, it wouldn't even occur to them that was cheating. If they lack a common cultural context, it means he needs to be really specific about all kinds of behaviors, physical and online, that he considers to be cheating. That would be exhausting for him and come off as nagging and lack of trust to her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It could be that he trusts her not to cheat, but they have very different definitions of cheating. To some people a drunken kiss with someone else is definitely cheating, while to someone in a culture where even sex isn&amp;#39;t necessarily cheating, it wouldn&amp;#39;t even occur to them that was cheating. If they lack a common cultural context, it means he needs to be really specific about all kinds of behaviors, physical and online, that he considers to be cheating. That would be exhausting for him and come off as nagging and lack of trust to her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgds3qa", "score_hidden": true, "stickied": false, "created": 1492478129.0, "created_utc": 1492449329.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdxeg6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CeruleanSilverWolf", "parent_id": "t1_dgdvnnu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think it's just cause replies from the subteddit represent a one off interaction. A lot of issues require long term discussion to really make progress on. We are very much creatures of habit. Even with friends we may frequently consult with them, and nod and say \"oh yes I will do that!\" And then they just... don't. No follow through. Now consider we're not even at that level of trust with OP, we're internet strangers.\n\nAlso, some of these issues that come up are just way above reddit's paygrade and I don't want to touch with a ten foot pole.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s just cause replies from the subteddit represent a one off interaction. A lot of issues require long term discussion to really make progress on. We are very much creatures of habit. Even with friends we may frequently consult with them, and nod and say &amp;quot;oh yes I will do that!&amp;quot; And then they just... don&amp;#39;t. No follow through. Now consider we&amp;#39;re not even at that level of trust with OP, we&amp;#39;re internet strangers.&lt;/p&gt;\n\n&lt;p&gt;Also, some of these issues that come up are just way above reddit&amp;#39;s paygrade and I don&amp;#39;t want to touch with a ten foot pole.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdxeg6", "score_hidden": true, "stickied": false, "created": 1492484034.0, "created_utc": 1492455234.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvnnu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Celestelle", "parent_id": "t1_dgdug11", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Therapy is ALWAYS suggested in this subreddit, no matter the situation. I'm guessing I'll get a response vehemently defending therapy now like I said something awful about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Therapy is ALWAYS suggested in this subreddit, no matter the situation. I&amp;#39;m guessing I&amp;#39;ll get a response vehemently defending therapy now like I said something awful about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdvnnu", "score_hidden": true, "stickied": false, "created": 1492482061.0, "created_utc": 1492453261.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdug11", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mojojojo3030", "parent_id": "t1_dgdo4vs", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "LMAO therapy... It is very reasonable to have faith that someone will try not to do what she thinks is cheating, and still be nervous that she would cheat. A lot of people I know have seen that one come to fruition.\n\nEspecially reasonable if she herself has cheated before, which we can't really know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LMAO therapy... It is very reasonable to have faith that someone will try not to do what she thinks is cheating, and still be nervous that she would cheat. A lot of people I know have seen that one come to fruition.&lt;/p&gt;\n\n&lt;p&gt;Especially reasonable if she herself has cheated before, which we can&amp;#39;t really know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdug11", "score_hidden": true, "stickied": false, "created": 1492480710.0, "created_utc": 1492451910.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdv0zq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Chauden", "parent_id": "t1_dgdpbh4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; Basically, in her point of view, I'm just making a mountain out of a molehill.\n\nWell, apply this logic for any other thing you don't like, or some other behaviour. Does it work?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Basically, in her point of view, I&amp;#39;m just making a mountain out of a molehill.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, apply this logic for any other thing you don&amp;#39;t like, or some other behaviour. Does it work?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdv0zq", "score_hidden": true, "stickied": false, "created": 1492481356.0, "created_utc": 1492452556.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdzx2k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sanaren", "parent_id": "t1_dgdq2wv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There is a cultural difference here. This isn't a trust issue, it's a thing where both parties don't agree on what's cheating to begin with. If you thought a lap dance was cheating but your boyfriend was sure that it wasn't, wouldn't that be a cause for concern? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a cultural difference here. This isn&amp;#39;t a trust issue, it&amp;#39;s a thing where both parties don&amp;#39;t agree on what&amp;#39;s cheating to begin with. If you thought a lap dance was cheating but your boyfriend was sure that it wasn&amp;#39;t, wouldn&amp;#39;t that be a cause for concern? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdzx2k", "score_hidden": true, "stickied": false, "created": 1492486893.0, "created_utc": 1492458093.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq2wv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "popular_usernamez", "parent_id": "t1_dgdpbh4", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "&gt;I have not considered therapy as I don't see it as a trust issue\n\nYou were cheated on in the past and now you're worried that this girl will cheat on you, even if she has not given you a reason to worry. It's a *you* issue.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have not considered therapy as I don&amp;#39;t see it as a trust issue&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You were cheated on in the past and now you&amp;#39;re worried that this girl will cheat on you, even if she has not given you a reason to worry. It&amp;#39;s a &lt;em&gt;you&lt;/em&gt; issue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdq2wv", "score_hidden": true, "stickied": false, "created": 1492475882.0, "created_utc": 1492447082.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpbh4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "awesterdam", "parent_id": "t1_dgdo4vs", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Well, it has been somewhat difficult to broach on the subject of boundaries with her. Most attempt has ended up with me being portrayed as being overly conservative and that has a tendency to annoy her. \n\nBasically, in her point of view, I'm just making a mountain out of a molehill. \n\nI have not considered therapy as I don't see it as a trust issue, but more of a difference in opinion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, it has been somewhat difficult to broach on the subject of boundaries with her. Most attempt has ended up with me being portrayed as being overly conservative and that has a tendency to annoy her. &lt;/p&gt;\n\n&lt;p&gt;Basically, in her point of view, I&amp;#39;m just making a mountain out of a molehill. &lt;/p&gt;\n\n&lt;p&gt;I have not considered therapy as I don&amp;#39;t see it as a trust issue, but more of a difference in opinion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdpbh4", "score_hidden": true, "stickied": false, "created": 1492475038.0, "created_utc": 1492446238.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdo4vs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "popular_usernamez", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;While I have complete faith in her, and take her words at face value, the lower standards she holds to infidelity would simply mean that she could be in situations which are completely acceptable to her,\n\nRecognize the inherent contradiction in your words. If you had complete faith in her (and have had conversations about the nature and boundaries of your relationship) then this would not be causing you stress. You *don't* have complete faith in her, even though she has not given you any reason (outside of cultural context which neither of you can do anything about) not to trust her.\n\nHave you considered therapy for your trust issues?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;While I have complete faith in her, and take her words at face value, the lower standards she holds to infidelity would simply mean that she could be in situations which are completely acceptable to her,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Recognize the inherent contradiction in your words. If you had complete faith in her (and have had conversations about the nature and boundaries of your relationship) then this would not be causing you stress. You &lt;em&gt;don&amp;#39;t&lt;/em&gt; have complete faith in her, even though she has not given you any reason (outside of cultural context which neither of you can do anything about) not to trust her.&lt;/p&gt;\n\n&lt;p&gt;Have you considered therapy for your trust issues?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdo4vs", "score_hidden": true, "stickied": false, "created": 1492473699.0, "created_utc": 1492444899.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdtx7n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Queengnome", "parent_id": "t1_dgdr9v7", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's not necessarily the standard, but it's very common. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not necessarily the standard, but it&amp;#39;s very common. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdtx7n", "score_hidden": true, "stickied": false, "created": 1492480143.0, "created_utc": 1492451343.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdr9v7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "qwerty1088", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I don't know anything about Japanese culture and relationships, but the things you list off would suggest that it isn't actually infidelity at all.  Infidelity would mean it is against the boundaries of the relationship.  If it's understood that sex without emotions is fine, then it isn't infidelity/cheating.  It sounds like you are describing open relationships.  However, I'm a bit skeptical that this is actually the standard in Japan - I'm just going by what you wrote.\n\nThere is not a culture of infidelity.  It is just that the relationships have different boundaries than you are used to.", "edited": 1492453952.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know anything about Japanese culture and relationships, but the things you list off would suggest that it isn&amp;#39;t actually infidelity at all.  Infidelity would mean it is against the boundaries of the relationship.  If it&amp;#39;s understood that sex without emotions is fine, then it isn&amp;#39;t infidelity/cheating.  It sounds like you are describing open relationships.  However, I&amp;#39;m a bit skeptical that this is actually the standard in Japan - I&amp;#39;m just going by what you wrote.&lt;/p&gt;\n\n&lt;p&gt;There is not a culture of infidelity.  It is just that the relationships have different boundaries than you are used to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdr9v7", "score_hidden": true, "stickied": false, "created": 1492477204.0, "created_utc": 1492448404.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgduq2a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "motodoto", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah, good friend of mine lived in Japan for 7 years. He was really upset by the same exact thing you are talking about. It's a culture clash. Even worse, he lived in Nagoya, which is a total red light district.\n\nAre you values open to evolution? Sure.\n\nBut if they don't it doesn't seem like a relationship is doable for very long.\n\nYou really have to be with someone whose values line up with yours.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, good friend of mine lived in Japan for 7 years. He was really upset by the same exact thing you are talking about. It&amp;#39;s a culture clash. Even worse, he lived in Nagoya, which is a total red light district.&lt;/p&gt;\n\n&lt;p&gt;Are you values open to evolution? Sure.&lt;/p&gt;\n\n&lt;p&gt;But if they don&amp;#39;t it doesn&amp;#39;t seem like a relationship is doable for very long.&lt;/p&gt;\n\n&lt;p&gt;You really have to be with someone whose values line up with yours.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgduq2a", "score_hidden": true, "stickied": false, "created": 1492481016.0, "created_utc": 1492452216.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdu5eq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Queengnome", "parent_id": "t1_dgdtxlb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Depends who you ask. Many people agree it's cheating to SOME degree to be with a sex worker, for instance, or have a fwb, but they see it as a much lower offense. There's a major \"don't ask, don't tell\" policy with these kinds of things. Many women are nonchalant about their husbands fooling around and almost expect they might, but aren't so bothered because they know it likely won't affect their family. Women have financial control in many households in Japan, and control of the children. Likewise, husbands know that their wives (generally) rely on them for the majority of the family income. Divorce is messy and frowned upon. \n\n(As a side note, I've lived in Japan almost 7 years and am friends mostly with Japanese people)", "edited": 1492452493.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Depends who you ask. Many people agree it&amp;#39;s cheating to SOME degree to be with a sex worker, for instance, or have a fwb, but they see it as a much lower offense. There&amp;#39;s a major &amp;quot;don&amp;#39;t ask, don&amp;#39;t tell&amp;quot; policy with these kinds of things. Many women are nonchalant about their husbands fooling around and almost expect they might, but aren&amp;#39;t so bothered because they know it likely won&amp;#39;t affect their family. Women have financial control in many households in Japan, and control of the children. Likewise, husbands know that their wives (generally) rely on them for the majority of the family income. Divorce is messy and frowned upon. &lt;/p&gt;\n\n&lt;p&gt;(As a side note, I&amp;#39;ve lived in Japan almost 7 years and am friends mostly with Japanese people)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdu5eq", "score_hidden": true, "stickied": false, "created": 1492480391.0, "created_utc": 1492451591.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtxlb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "samuelgia", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Wait do I understand it correctly, physical contact is not cheating? :o\nso long there is no emotion involved? (like sex)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait do I understand it correctly, physical contact is not cheating? :o\nso long there is no emotion involved? (like sex)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdtxlb", "score_hidden": true, "stickied": false, "created": 1492480154.0, "created_utc": 1492451354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdznvs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crochet_away", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Remove the cultural context for a second. We know that people from all walks of life cheat, and that social conditioning isn't a great predictor of fidelity. It it was, no socially-conservative politician would ever be caught cheating, and that's so common it's practically a punchline.\n\nWhat you have here is a woman who's heard your expectations of monogamy and told you to lower your standards. She's not going to negotiate this point, and neither are you. And, with infidelity, the person with the lower standard sets the tone of the relationship. You have to ask yourself whether you're willing to live with her definition. \n\nI will say this: you're at a crucial age difference. No, 5 years isn't too much by any means, but the average person who's 30 is going to be a lot more willing to settle down than the average person who's 25. She might not be open to the same level of commitment than you are for reasons other than culture.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Remove the cultural context for a second. We know that people from all walks of life cheat, and that social conditioning isn&amp;#39;t a great predictor of fidelity. It it was, no socially-conservative politician would ever be caught cheating, and that&amp;#39;s so common it&amp;#39;s practically a punchline.&lt;/p&gt;\n\n&lt;p&gt;What you have here is a woman who&amp;#39;s heard your expectations of monogamy and told you to lower your standards. She&amp;#39;s not going to negotiate this point, and neither are you. And, with infidelity, the person with the lower standard sets the tone of the relationship. You have to ask yourself whether you&amp;#39;re willing to live with her definition. &lt;/p&gt;\n\n&lt;p&gt;I will say this: you&amp;#39;re at a crucial age difference. No, 5 years isn&amp;#39;t too much by any means, but the average person who&amp;#39;s 30 is going to be a lot more willing to settle down than the average person who&amp;#39;s 25. She might not be open to the same level of commitment than you are for reasons other than culture.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdznvs", "score_hidden": true, "stickied": false, "created": 1492486607.0, "created_utc": 1492457807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdzuiu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "junegloom", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Can you both agree on what is cheating in your relationship and what isn't? This is a negotiation and a deal, the terms of the agreement will only matter to the 2 of you. It doesn't matter what her wider culture defines as cheating. You can state what behavior is acceptable to you, for you to accept being in a relationship. She isn't obligated to date you if she doesn't like it, its a voluntary choice to be in a relationship. For both of you.\n\nIts the same as with past women you've dated and the substance use. You don't have to necessarily agree with their worldview, to respect their wishes. Or, if you felt you had to brush them off as too consservative, maybe you didn't? I'm not sure what \"brushing off\" means here. Did you decide to use anyway, and keep them in the dark about it since they didn't like it and you felt it wasn't any of their business? Or just do the substances, inform them that you feel its ok and won't stop, and let them make informed decisions about their own lives and relationships? The latter is ok, if maybe nonconducive to keeping the relationship going. The former is being controlling of someone else and not ok.\n\nIf you feel worried that, rather than being honest about her actions, she might nod and smile while lying to you about what she really does, then you don't trust her and there's clearly a bigger problem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you both agree on what is cheating in your relationship and what isn&amp;#39;t? This is a negotiation and a deal, the terms of the agreement will only matter to the 2 of you. It doesn&amp;#39;t matter what her wider culture defines as cheating. You can state what behavior is acceptable to you, for you to accept being in a relationship. She isn&amp;#39;t obligated to date you if she doesn&amp;#39;t like it, its a voluntary choice to be in a relationship. For both of you.&lt;/p&gt;\n\n&lt;p&gt;Its the same as with past women you&amp;#39;ve dated and the substance use. You don&amp;#39;t have to necessarily agree with their worldview, to respect their wishes. Or, if you felt you had to brush them off as too consservative, maybe you didn&amp;#39;t? I&amp;#39;m not sure what &amp;quot;brushing off&amp;quot; means here. Did you decide to use anyway, and keep them in the dark about it since they didn&amp;#39;t like it and you felt it wasn&amp;#39;t any of their business? Or just do the substances, inform them that you feel its ok and won&amp;#39;t stop, and let them make informed decisions about their own lives and relationships? The latter is ok, if maybe nonconducive to keeping the relationship going. The former is being controlling of someone else and not ok.&lt;/p&gt;\n\n&lt;p&gt;If you feel worried that, rather than being honest about her actions, she might nod and smile while lying to you about what she really does, then you don&amp;#39;t trust her and there&amp;#39;s clearly a bigger problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdzuiu", "score_hidden": true, "stickied": false, "created": 1492486814.0, "created_utc": 1492458014.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dgdwtp7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jammersy", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm an American in the US, and I had no idea that this particular culture gap existed between us and Japan. Granted, infidelity is endemic here too, it's just recognized as shameful.\n\nBut anyway, I tried dating a Japanese girl recently, and her attitudes about sex, relationships, trust, and openness were completely indecipherable to me. This is beginning to make a little more sense.\n\nI wonder - is there also a culture of shame around sex? That girl was incredibly flaky w.r.t. our relationship, and put herself in compromising social situations nonstop; but as far as I know, she's prudish about anything beyond flirtation. She was also quite judgmental of me for having has a rich sexual and relationship history.\n\nThis is purely curiosity - I cut that girl off ages ago.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an American in the US, and I had no idea that this particular culture gap existed between us and Japan. Granted, infidelity is endemic here too, it&amp;#39;s just recognized as shameful.&lt;/p&gt;\n\n&lt;p&gt;But anyway, I tried dating a Japanese girl recently, and her attitudes about sex, relationships, trust, and openness were completely indecipherable to me. This is beginning to make a little more sense.&lt;/p&gt;\n\n&lt;p&gt;I wonder - is there also a culture of shame around sex? That girl was incredibly flaky w.r.t. our relationship, and put herself in compromising social situations nonstop; but as far as I know, she&amp;#39;s prudish about anything beyond flirtation. She was also quite judgmental of me for having has a rich sexual and relationship history.&lt;/p&gt;\n\n&lt;p&gt;This is purely curiosity - I cut that girl off ages ago.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdwtp7", "score_hidden": true, "stickied": false, "created": 1492483377.0, "created_utc": 1492454577.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_65wche", "likes": null, "replies": "", "user_reports": [], "id": "dge2ohs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PlasticSunflowers", "parent_id": "t1_dge21ao", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He uses the word \"partner\", I think it's fair to assume that they're at least dating", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He uses the word &amp;quot;partner&amp;quot;, I think it&amp;#39;s fair to assume that they&amp;#39;re at least dating&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge2ohs", "score_hidden": true, "stickied": false, "created": 1492489979.0, "created_utc": 1492461179.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge21ao", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SqueakyPoP", "parent_id": "t3_65wche", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So you're not actually dating and you're trying to change her? smh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you&amp;#39;re not actually dating and you&amp;#39;re trying to change her? smh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dge21ao", "score_hidden": true, "stickied": false, "created": 1492489265.0, "created_utc": 1492460465.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]