[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "IAmA", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey everyone, I&amp;#39;m Chris. My friend Dave and I run &lt;a href=\"https://suitocracy.com/\"&gt;Suitocracy.com&lt;/a&gt;, a website for recording, sharing and rating the ethical conduct of corporations. &lt;/p&gt;\n\n&lt;p&gt;While there are a few places online (not least Reddit) where I would get info about which companies were doing good or which were being jerks, I couldn&amp;#39;t find any single place where I could simply select a company and get a good overview of what it has done, and what people think. Suitocracy is set to be just that!&lt;/p&gt;\n\n&lt;p&gt;This started out as a project to keep me busy and learning while I wasn&amp;#39;t allowed to work (visa nonsense), and ended up going a bit further than I had thought possible. We&amp;#39;re now a registered community interest company in the UK! &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Proof:&lt;/strong&gt; &lt;a href=\"https://suitocracy.com/help/proof\"&gt;https://suitocracy.com/help/proof&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey everyone, I'm Chris. My friend Dave and I run [Suitocracy.com](https://suitocracy.com/), a website for recording, sharing and rating the ethical conduct of corporations. \n\nWhile there are a few places online (not least Reddit) where I would get info about which companies were doing good or which were being jerks, I couldn't find any single place where I could simply select a company and get a good overview of what it has done, and what people think. Suitocracy is set to be just that!\n\nThis started out as a project to keep me busy and learning while I wasn't allowed to work (visa nonsense), and ended up going a bit further than I had thought possible. We're now a registered community interest company in the UK! \n\n**Proof:** https://suitocracy.com/help/proof", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Nonprofit", "id": "64yq9l", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "Chris-Suitocracy", "saved": false, "mod_reports": [], "name": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "approved_by": null, "over_18": false, "domain": "self.IAmA", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qzb6", "edited": false, "link_flair_css_class": "nonprofit", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/IAmA/comments/64yq9l/iama_founder_of_a_nonprofit_focused_on_collating/", "num_reports": null, "locked": false, "stickied": false, "created": 1492038561.0, "url": "https://www.reddit.com/r/IAmA/comments/64yq9l/iama_founder_of_a_nonprofit_focused_on_collating/", "author_flair_text": null, "quarantine": false, "title": "IAmA founder of a non-profit focused on collating news and views on corporate ethics. Not a great week for United... AMA!", "created_utc": 1492009761.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg62bnb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Chris-Suitocracy", "parent_id": "t1_dg61tvy", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "This is done socially. So anyone can sign up, add a rating, share a relevant link on a company's timeline, or add a company that isn't already listed. \n\nWe're still in beta so I have been changing things up a bit. There used to be more of a focus on ratings and less on news articles, which exacerbated the chicken-and-egg problem that sites have if they're based on user-generated content. Users want content, but content requires users...\n\nSo with a focus more on news articles now, I can continue adding those myself over time. I've generally taken a stance of \"If a company is in the news over an ethical issue, add it\", and then also go back and look at older articles for the same company. So I added Pepsi the other day. On top of this ad controversy, they've been in a bit of trouble over water rights in India lately. But a lot of people have no idea about that.\n\n", "edited": 1492012846.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is done socially. So anyone can sign up, add a rating, share a relevant link on a company&amp;#39;s timeline, or add a company that isn&amp;#39;t already listed. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re still in beta so I have been changing things up a bit. There used to be more of a focus on ratings and less on news articles, which exacerbated the chicken-and-egg problem that sites have if they&amp;#39;re based on user-generated content. Users want content, but content requires users...&lt;/p&gt;\n\n&lt;p&gt;So with a focus more on news articles now, I can continue adding those myself over time. I&amp;#39;ve generally taken a stance of &amp;quot;If a company is in the news over an ethical issue, add it&amp;quot;, and then also go back and look at older articles for the same company. So I added Pepsi the other day. On top of this ad controversy, they&amp;#39;ve been in a bit of trouble over water rights in India lately. But a lot of people have no idea about that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg62bnb", "score_hidden": false, "stickied": false, "created": 1492041440.0, "created_utc": 1492012640.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61tvy", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "B1ackMagix", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "How are you gathering data? I searched for several big name companies like IBM and didn't find anything which is odd for a company as big as they are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How are you gathering data? I searched for several big name companies like IBM and didn&amp;#39;t find anything which is odd for a company as big as they are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg61tvy", "score_hidden": false, "stickied": false, "created": 1492040903.0, "created_utc": 1492012103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg60nhg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Chris-Suitocracy", "parent_id": "t1_dg602u7", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "It was actually not until the project was fairly well underway that I had a chat about it with my brother - he mentioned that being a non-profit might be required for credibility reasons. I found it hard to disagree with. I don't want people second guessing our motives at any stage.\n\nAside from that, I don't really see many options in the way of monetisation for the project, so a for-profit structure didn't really seem to have any benefit anyway. \n\nPut those things together, and I think the non-profit route comes out ahead. After-the-fact bonus: We save a few quid every month on bank fees, since our bank waives most charges for NFP's accounts.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was actually not until the project was fairly well underway that I had a chat about it with my brother - he mentioned that being a non-profit might be required for credibility reasons. I found it hard to disagree with. I don&amp;#39;t want people second guessing our motives at any stage.&lt;/p&gt;\n\n&lt;p&gt;Aside from that, I don&amp;#39;t really see many options in the way of monetisation for the project, so a for-profit structure didn&amp;#39;t really seem to have any benefit anyway. &lt;/p&gt;\n\n&lt;p&gt;Put those things together, and I think the non-profit route comes out ahead. After-the-fact bonus: We save a few quid every month on bank fees, since our bank waives most charges for NFP&amp;#39;s accounts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg60nhg", "score_hidden": false, "stickied": false, "created": 1492039608.0, "created_utc": 1492010808.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg602u7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hlwroc", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "Why did you go the non-profit route? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why did you go the non-profit route? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg602u7", "score_hidden": false, "stickied": false, "created": 1492038978.0, "created_utc": 1492010178.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg611z9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Chris-Suitocracy", "parent_id": "t1_dg60p7l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "hard to say. United has had a bad time lately - not just with the beating but also the 'sexist' leggings thing from a couple of weeks ago. But it seems like a set of blips on an otherwise un-newsworthy radar.\n\nComcast's reputation is... well, even for me, as a non-American, it's fairly infamous. I can't see it getting better with what the GOP is seeking to do to net neutrality, and the inevitable freedom it will give to ISPs to do the wrong thing.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hard to say. United has had a bad time lately - not just with the beating but also the &amp;#39;sexist&amp;#39; leggings thing from a couple of weeks ago. But it seems like a set of blips on an otherwise un-newsworthy radar.&lt;/p&gt;\n\n&lt;p&gt;Comcast&amp;#39;s reputation is... well, even for me, as a non-American, it&amp;#39;s fairly infamous. I can&amp;#39;t see it getting better with what the GOP is seeking to do to net neutrality, and the inevitable freedom it will give to ISPs to do the wrong thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg611z9", "score_hidden": false, "stickied": false, "created": 1492040049.0, "created_utc": 1492011249.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60p7l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gmwdim", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "With the recent United fiasco how do you rate their chances of finally ending Comcast's long winning streak for the title of \"Shittiest Company in America\"?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;With the recent United fiasco how do you rate their chances of finally ending Comcast&amp;#39;s long winning streak for the title of &amp;quot;Shittiest Company in America&amp;quot;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg60p7l", "score_hidden": false, "stickied": false, "created": 1492039661.0, "created_utc": 1492010861.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg7csgl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Chris-Suitocracy", "parent_id": "t1_dg7cdn9", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "At the moment, I have a whitelist of domains. When a user submits a link, it has to match one of those domains. This is something I originally put in place to stop spam bots from just linking to any old spam blog created the day before, rather than fake news.\n\nSince then however, I've actually made a much more inflexible whitelist comprising domains that are associated with established, reputable media outlets. \"Reputable\" is in the eye of the beholder of course, but I was fairly lax with that. This whitelist isn't currently the one in use as it seemed a bit restrictive, but I'd be willing to bring it back (or make a sort of compromise between the two) if I saw the need arise.\n\nAt the moment I am also looking in to some free news APIs which might let me scrape headlines from reputable sources and search for ethics-related terms and company names. If I can automate 80% of the timeline creation process for each company, I'd be a big win. It might be a challenge to add historical headlines that way, though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At the moment, I have a whitelist of domains. When a user submits a link, it has to match one of those domains. This is something I originally put in place to stop spam bots from just linking to any old spam blog created the day before, rather than fake news.&lt;/p&gt;\n\n&lt;p&gt;Since then however, I&amp;#39;ve actually made a much more inflexible whitelist comprising domains that are associated with established, reputable media outlets. &amp;quot;Reputable&amp;quot; is in the eye of the beholder of course, but I was fairly lax with that. This whitelist isn&amp;#39;t currently the one in use as it seemed a bit restrictive, but I&amp;#39;d be willing to bring it back (or make a sort of compromise between the two) if I saw the need arise.&lt;/p&gt;\n\n&lt;p&gt;At the moment I am also looking in to some free news APIs which might let me scrape headlines from reputable sources and search for ethics-related terms and company names. If I can automate 80% of the timeline creation process for each company, I&amp;#39;d be a big win. It might be a challenge to add historical headlines that way, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7csgl", "score_hidden": false, "stickied": false, "created": 1492105137.0, "created_utc": 1492076337.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7cdn9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pinchmybum", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "How do you weed out \"fake\" news?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How do you weed out &amp;quot;fake&amp;quot; news?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7cdn9", "score_hidden": false, "stickied": false, "created": 1492103865.0, "created_utc": 1492075065.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg7enop", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Chris-Suitocracy", "parent_id": "t1_dg7d5k2", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "So this issue is one that probably took up more thought time than any other during the conceptual development of the project. Generally there are two kinds of astroturfing: stupid and smart.\n\nStupid means getting people in the company's office to just set up a bunch of accounts and submit ratings, comments and articles to the site. They may have the same or similar IP addresses, they'll all be submitting content about the same company and little else, and this is easy to detect.\n\nSmart means using a PR company that does this sort of thing. They're using virtual desktops and VPNs to mask all of the above, while ensuring the behaviour of the accounts appears genuine by commenting on various unrelated companies. It takes a lot more time, effort and hence money. \n\nOverall we have a series of techniques to detect this sort of stuff. The stupid ones we can detect outright and ban as appropriate. For the smarter users, we have to be smarter as well. When a company's overall score is calculated from submitted ratings, each user's rating is weighed up or down based on how confident we are that the user is real. We have VPN/Proxy detection to see if the user is trying to mask their IP, for example, but this can be offset if the user has other features that makes them seem genuine, as not all VPN users are malicious, of course. I actually don't really want to outline the other techniques we use to combat smarter astroturfers, as they can be worked around if they're known.\n\nUltimately for really good astroturfers you won't know they're astroturfers, so the best we can do is simultaneously maximise the time and effort required for them to be successful, and at the same time minimise the impact they have on our system.\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So this issue is one that probably took up more thought time than any other during the conceptual development of the project. Generally there are two kinds of astroturfing: stupid and smart.&lt;/p&gt;\n\n&lt;p&gt;Stupid means getting people in the company&amp;#39;s office to just set up a bunch of accounts and submit ratings, comments and articles to the site. They may have the same or similar IP addresses, they&amp;#39;ll all be submitting content about the same company and little else, and this is easy to detect.&lt;/p&gt;\n\n&lt;p&gt;Smart means using a PR company that does this sort of thing. They&amp;#39;re using virtual desktops and VPNs to mask all of the above, while ensuring the behaviour of the accounts appears genuine by commenting on various unrelated companies. It takes a lot more time, effort and hence money. &lt;/p&gt;\n\n&lt;p&gt;Overall we have a series of techniques to detect this sort of stuff. The stupid ones we can detect outright and ban as appropriate. For the smarter users, we have to be smarter as well. When a company&amp;#39;s overall score is calculated from submitted ratings, each user&amp;#39;s rating is weighed up or down based on how confident we are that the user is real. We have VPN/Proxy detection to see if the user is trying to mask their IP, for example, but this can be offset if the user has other features that makes them seem genuine, as not all VPN users are malicious, of course. I actually don&amp;#39;t really want to outline the other techniques we use to combat smarter astroturfers, as they can be worked around if they&amp;#39;re known.&lt;/p&gt;\n\n&lt;p&gt;Ultimately for really good astroturfers you won&amp;#39;t know they&amp;#39;re astroturfers, so the best we can do is simultaneously maximise the time and effort required for them to be successful, and at the same time minimise the impact they have on our system.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7enop", "score_hidden": false, "stickied": false, "created": 1492110516.0, "created_utc": 1492081716.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d5k2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iwas99x", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "How do you combat Astroturfing done by companies and trade groups/associations?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How do you combat Astroturfing done by companies and trade groups/associations?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7d5k2", "score_hidden": false, "stickied": false, "created": 1492106248.0, "created_utc": 1492077448.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg7ecxg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Chris-Suitocracy", "parent_id": "t1_dg7d5vx", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "This is entirely funded out-of-pocket by my co-founder and I. Our monthly infrastructure costs are low enough for that to not be an issue, and the platform has been developed with scalability in mind - lots of caching. It's pretty efficient.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is entirely funded out-of-pocket by my co-founder and I. Our monthly infrastructure costs are low enough for that to not be an issue, and the platform has been developed with scalability in mind - lots of caching. It&amp;#39;s pretty efficient.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7ecxg", "score_hidden": false, "stickied": false, "created": 1492109739.0, "created_utc": 1492080939.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d5vx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iwas99x", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "Where do you get your funding from?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where do you get your funding from?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7d5vx", "score_hidden": false, "stickied": false, "created": 1492106275.0, "created_utc": 1492077475.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg7exkp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Chris-Suitocracy", "parent_id": "t1_dg7d8a2", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "The whole point of public relations, going back to its creation last century by Edward Bernays, was to serve the interests of companies. Any good it does for a company's customers is incidental, and is only sought out if there is a benefit to the company as well. Otherwise, what is the company paying for?\n\nUnless by \"customers\" you mean the customers of those PR firms (the companies). In which case, no. They've been wildly successful overall.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The whole point of public relations, going back to its creation last century by Edward Bernays, was to serve the interests of companies. Any good it does for a company&amp;#39;s customers is incidental, and is only sought out if there is a benefit to the company as well. Otherwise, what is the company paying for?&lt;/p&gt;\n\n&lt;p&gt;Unless by &amp;quot;customers&amp;quot; you mean the customers of those PR firms (the companies). In which case, no. They&amp;#39;ve been wildly successful overall.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7exkp", "score_hidden": false, "stickied": false, "created": 1492111178.0, "created_utc": 1492082378.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d8a2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iwas99x", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "Do you think PR firms hired by Fortune 1000 companies do more harm than good to customers?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you think PR firms hired by Fortune 1000 companies do more harm than good to customers?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7d8a2", "score_hidden": false, "stickied": false, "created": 1492106473.0, "created_utc": 1492077673.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg7f75t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Chris-Suitocracy", "parent_id": "t1_dg7d9e7", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "I think every demographic, not just generational, is going to have different trust levels with all sorts of different companies based on their needs, day to day interactions, and how they're targetted by marketing.\n\nAge is an interesting one though, because many companies will have reputations based on things they've done decades ago, which younger people might have no idea about.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think every demographic, not just generational, is going to have different trust levels with all sorts of different companies based on their needs, day to day interactions, and how they&amp;#39;re targetted by marketing.&lt;/p&gt;\n\n&lt;p&gt;Age is an interesting one though, because many companies will have reputations based on things they&amp;#39;ve done decades ago, which younger people might have no idea about.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7f75t", "score_hidden": false, "stickied": false, "created": 1492111797.0, "created_utc": 1492082997.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d9e7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iwas99x", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "Do you think people from different generations such baby boomers, e, generation X, and Millennials' have different trust levels with certain companies? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you think people from different generations such baby boomers, e, generation X, and Millennials&amp;#39; have different trust levels with certain companies? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7d9e7", "score_hidden": false, "stickied": false, "created": 1492106565.0, "created_utc": 1492077765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg7f191", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Chris-Suitocracy", "parent_id": "t1_dg7dcad", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "The USA was originally the ideal place for the company to be founded simply due to the immense legal protections offers by section 230 of the Communications Act.\n\nBut since the UK updated its defamation laws in 2013 to make things easier for website operators, it became \"good enough\", and since neither of us are American, it made sense to just stay within the UK. \n\nAs an online-only company, the geography doesn't really matter that much now that we're incorporated.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The USA was originally the ideal place for the company to be founded simply due to the immense legal protections offers by section 230 of the Communications Act.&lt;/p&gt;\n\n&lt;p&gt;But since the UK updated its defamation laws in 2013 to make things easier for website operators, it became &amp;quot;good enough&amp;quot;, and since neither of us are American, it made sense to just stay within the UK. &lt;/p&gt;\n\n&lt;p&gt;As an online-only company, the geography doesn&amp;#39;t really matter that much now that we&amp;#39;re incorporated.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7f191", "score_hidden": false, "stickied": false, "created": 1492111421.0, "created_utc": 1492082621.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7dcad", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iwas99x", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "Do you plan to have an operation of your group in the USA soon?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you plan to have an operation of your group in the USA soon?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7dcad", "score_hidden": false, "stickied": false, "created": 1492106804.0, "created_utc": 1492078004.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg5zpc8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "Users, please be wary of proof. You are welcome to ask for more proof if you find it insufficient. \n\nOP, if you need any help, please message the mods [here](http://www.reddit.com/message/compose?to=%2Fr%2Fiama&amp;subject=&amp;message=).\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Users, please be wary of proof. You are welcome to ask for more proof if you find it insufficient. &lt;/p&gt;\n\n&lt;p&gt;OP, if you need any help, please message the mods &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fiama&amp;amp;subject=&amp;amp;message=\"&gt;here&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/IAmA\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg5zpc8", "score_hidden": false, "stickied": false, "created": 1492038562.0, "created_utc": 1492009762.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg7d7kh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iwas99x", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "What percentage either through guestimate or actual survey data of people in the USA believe everything or most of what a company says In commercials/slogans/tweets as gospel and what percentage is skeptical?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What percentage either through guestimate or actual survey data of people in the USA believe everything or most of what a company says In commercials/slogans/tweets as gospel and what percentage is skeptical?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7d7kh", "score_hidden": false, "stickied": false, "created": 1492106414.0, "created_utc": 1492077614.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg7db3u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iwas99x", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "I noticed that the local media is much more likely to investigate fraud or criminal activity or poor Customer and employee relations than national media outlets. Why do you think this is the case?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I noticed that the local media is much more likely to investigate fraud or criminal activity or poor Customer and employee relations than national media outlets. Why do you think this is the case?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7db3u", "score_hidden": false, "stickied": false, "created": 1492106704.0, "created_utc": 1492077904.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_64yq9l", "likes": null, "replies": "", "user_reports": [], "id": "dg7dcmf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iwas99x", "parent_id": "t3_64yq9l", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "Do you plan to have any celebrities help your cause?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you plan to have any celebrities help your cause?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg7dcmf", "score_hidden": false, "stickied": false, "created": 1492106832.0, "created_utc": 1492078032.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]