[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "IAmA", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;My 5 Questions:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;What was the experience like?&lt;/li&gt;\n&lt;li&gt;What did you learn from the experience&lt;/li&gt;\n&lt;li&gt;Has the storm affected the way you live?&lt;/li&gt;\n&lt;li&gt;Do you still live in the same city? If so, how has the town changed?&lt;/li&gt;\n&lt;li&gt;With the upcoming tornado season, what would you like to say to everone&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;Public Contact Information:&lt;/strong&gt; If Applicable&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**My 5 Questions:**\n\n1. What was the experience like?\n2. What did you learn from the experience\n3. Has the storm affected the way you live?\n4. Do you still live in the same city? If so, how has the town changed?\n5. With the upcoming tornado season, what would you like to say to everone\n\n**Public Contact Information:** If Applicable", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Request", "id": "65fsly", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "TxSilverBalt", "saved": false, "mod_reports": [], "name": "t3_65fsly", "subreddit_name_prefixed": "r/IAmA", "approved_by": null, "over_18": false, "domain": "self.IAmA", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qzb6", "edited": false, "link_flair_css_class": "request", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/IAmA/comments/65fsly/ama_request_survivors_of_the_moore_oklahoma/", "num_reports": null, "locked": false, "stickied": false, "created": 1492239068.0, "url": "https://www.reddit.com/r/IAmA/comments/65fsly/ama_request_survivors_of_the_moore_oklahoma/", "author_flair_text": null, "quarantine": false, "title": "[AMA Request] Survivors of the Moore Oklahoma tornado or the Joplin Missouri tonrado", "created_utc": 1492210268.0, "distinguished": null, "media": null, "upvote_ratio": 0.62, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_65fsly", "likes": null, "replies": "", "user_reports": [], "id": "dgbouxr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "4ryn", "parent_id": "t3_65fsly", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "I was born in Joplin. I was here during the tornado and I live here still.\n\nThe experience was surreal. I am a bit of an anomaly around here because I was actually afraid of tornados before May 22, 2011. Most people here go about their business during tornado warnings and scoff at people who take cover. That is, most people before \"the tornado.\" I was at my parent's house during the event. They live in the \"tornado zone,\" but their house was only damaged, not destroyed. I am thankful that I was there because my own apartment was completely destroyed. I'm confident that everyone that remained in that complex during the tornado was killed. After the tornado passed, we didn't know immediately how bad it had been. My first clue was when I heard a well-known DJ on the radio driving down the main drag in Joplin, crying. He was describing the damage and I couldn't believe it. We went out on foot after, and it seemed like the whole town was just out wandering around. I, thankfully, did not encounter anything too gruesome, but a lot of people did. Gas was pouring out of broken lines, and people everywhere were lighting up cigarettes. I was walking in the general direction of my apartment and walked up to the edge of a swimming pool. I realized that a familiar fitness center was totally gone and that I had walked up to the pool without realizing where I was. We joined search and rescue parties for the remainder of the evening, but did not accomplish much for than helping people gather belongings. About 20 people stayed at my parent's house that night. There was no power. I stayed up all night cranking a hand radio and listing to the local radio. \n\nOne of my favorite stories from our tornado is story of the KZRG radio guys. Three or four DJs from a local radio station stayed on the air 24 hours a day for about two weeks after the tornado. They directed volunteers and helpers, they advised everyone where to find help and shelter, and they even helped to reunited families who were separated during the storm. They bolstered morale, and I think that the mobilization of neighbors helping neighbors and any positive outlook during the first few days was due to them. \n\nI am currently working on a research paper for a master's program on the \"Whole Community\" approach that FEMA and the Municipal government used in the recovery process. The recovery was grassroots in nature, allowing individuals, nonprofits, and local business take the rebuilding process into their own hands. Building permits were issued as soon as it was safe to do so. Some cities recovering from this sort of disaster, Tuscaloosa for example, impose long planning periods and strict regulations to the rebuilding process. \n\nPhysically, the rebuilding of the city is pretty much complete. There are some empty spaces still remaining, but not many. We have a beautiful new High School (the most technologically advanced school in Missouri), a new middle school and elementary school, a brand new Mercy Hospital, and thousands of new houses. I think that the process kick started the infrastructure development in  Joplin; a new Public Library is currently under construction. \n\nPsychologically, the ongoing recovery is a bit more interesting. I work at a social work agency in town, and it is inevitable that everyone here defines the timeline of their life in reference to the tornado. \"Was that before the tornado?\" \"I know that it was after 2011 because it was after the tornado.\" These types of comments are very common. Everyone has their tornado story, and they are still not tired to telling them. I don't think they will ever be. \n\nThe reaction to springtime severe weather has definitely changed. People are prone to panic during weather incidents, and many people enjoy riling everyone up. Amateur meteorologists and storm chasers seem to flock here, at least digitally, to predict the next weather event. Oddly, I have actually become more calm about the prospect of severe weather. Probably more about growing up than anything to do with our tornado. \n\nSeeing the devastated neighborhoods and homes after the tornado gave us some insight into safe spaces during tornados. Walking and driving through town after the storm, I was often unsure of where I was in the town I grew up in. I drove several blocks on our Main Street before realizing what road I was on. I saw entire blocks with only kitchen cabinets remaining of the homes that had been there. If you lack a basement or a storm shelter, get in the kitchen cabinets! Or at least stuff your little ones in there. Plumbing also seemed to remain pretty well, even on second stories. I saw several apartment buildings with only bathrooms and/or laundry rooms on the second floor. If you can't find a real shelter, look for an interior room with plumbing running to it. \n\nThe best advise is to listen to what is going on and take cover if there is a tornado warning. Many people died running for cover. You don't have to see the tornado before you head to the basement. It's most likely that you won't be able to see it anyway. Our mile wide twister was wrapped in rain, and unfortunately many people died trying to get a look at it. Just go underground until it's over, you won't miss anything and it could save your life. \n\nThat said, don't live in constant fear of weather. Storms like ours are few and far between, and I know from first hand experience that if you live in Weather Channel hyper vigilance, it will take a toll on you. \n\nI would love to answer any questions that anyone may have. I am relatively new to Reddit, so I was a little unsure whether to post here or to start a new AMA. If anyone is interested, guidance would be appreciated. For now, I'm doing this here, so AMA!\n\nedit: typo\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was born in Joplin. I was here during the tornado and I live here still.&lt;/p&gt;\n\n&lt;p&gt;The experience was surreal. I am a bit of an anomaly around here because I was actually afraid of tornados before May 22, 2011. Most people here go about their business during tornado warnings and scoff at people who take cover. That is, most people before &amp;quot;the tornado.&amp;quot; I was at my parent&amp;#39;s house during the event. They live in the &amp;quot;tornado zone,&amp;quot; but their house was only damaged, not destroyed. I am thankful that I was there because my own apartment was completely destroyed. I&amp;#39;m confident that everyone that remained in that complex during the tornado was killed. After the tornado passed, we didn&amp;#39;t know immediately how bad it had been. My first clue was when I heard a well-known DJ on the radio driving down the main drag in Joplin, crying. He was describing the damage and I couldn&amp;#39;t believe it. We went out on foot after, and it seemed like the whole town was just out wandering around. I, thankfully, did not encounter anything too gruesome, but a lot of people did. Gas was pouring out of broken lines, and people everywhere were lighting up cigarettes. I was walking in the general direction of my apartment and walked up to the edge of a swimming pool. I realized that a familiar fitness center was totally gone and that I had walked up to the pool without realizing where I was. We joined search and rescue parties for the remainder of the evening, but did not accomplish much for than helping people gather belongings. About 20 people stayed at my parent&amp;#39;s house that night. There was no power. I stayed up all night cranking a hand radio and listing to the local radio. &lt;/p&gt;\n\n&lt;p&gt;One of my favorite stories from our tornado is story of the KZRG radio guys. Three or four DJs from a local radio station stayed on the air 24 hours a day for about two weeks after the tornado. They directed volunteers and helpers, they advised everyone where to find help and shelter, and they even helped to reunited families who were separated during the storm. They bolstered morale, and I think that the mobilization of neighbors helping neighbors and any positive outlook during the first few days was due to them. &lt;/p&gt;\n\n&lt;p&gt;I am currently working on a research paper for a master&amp;#39;s program on the &amp;quot;Whole Community&amp;quot; approach that FEMA and the Municipal government used in the recovery process. The recovery was grassroots in nature, allowing individuals, nonprofits, and local business take the rebuilding process into their own hands. Building permits were issued as soon as it was safe to do so. Some cities recovering from this sort of disaster, Tuscaloosa for example, impose long planning periods and strict regulations to the rebuilding process. &lt;/p&gt;\n\n&lt;p&gt;Physically, the rebuilding of the city is pretty much complete. There are some empty spaces still remaining, but not many. We have a beautiful new High School (the most technologically advanced school in Missouri), a new middle school and elementary school, a brand new Mercy Hospital, and thousands of new houses. I think that the process kick started the infrastructure development in  Joplin; a new Public Library is currently under construction. &lt;/p&gt;\n\n&lt;p&gt;Psychologically, the ongoing recovery is a bit more interesting. I work at a social work agency in town, and it is inevitable that everyone here defines the timeline of their life in reference to the tornado. &amp;quot;Was that before the tornado?&amp;quot; &amp;quot;I know that it was after 2011 because it was after the tornado.&amp;quot; These types of comments are very common. Everyone has their tornado story, and they are still not tired to telling them. I don&amp;#39;t think they will ever be. &lt;/p&gt;\n\n&lt;p&gt;The reaction to springtime severe weather has definitely changed. People are prone to panic during weather incidents, and many people enjoy riling everyone up. Amateur meteorologists and storm chasers seem to flock here, at least digitally, to predict the next weather event. Oddly, I have actually become more calm about the prospect of severe weather. Probably more about growing up than anything to do with our tornado. &lt;/p&gt;\n\n&lt;p&gt;Seeing the devastated neighborhoods and homes after the tornado gave us some insight into safe spaces during tornados. Walking and driving through town after the storm, I was often unsure of where I was in the town I grew up in. I drove several blocks on our Main Street before realizing what road I was on. I saw entire blocks with only kitchen cabinets remaining of the homes that had been there. If you lack a basement or a storm shelter, get in the kitchen cabinets! Or at least stuff your little ones in there. Plumbing also seemed to remain pretty well, even on second stories. I saw several apartment buildings with only bathrooms and/or laundry rooms on the second floor. If you can&amp;#39;t find a real shelter, look for an interior room with plumbing running to it. &lt;/p&gt;\n\n&lt;p&gt;The best advise is to listen to what is going on and take cover if there is a tornado warning. Many people died running for cover. You don&amp;#39;t have to see the tornado before you head to the basement. It&amp;#39;s most likely that you won&amp;#39;t be able to see it anyway. Our mile wide twister was wrapped in rain, and unfortunately many people died trying to get a look at it. Just go underground until it&amp;#39;s over, you won&amp;#39;t miss anything and it could save your life. &lt;/p&gt;\n\n&lt;p&gt;That said, don&amp;#39;t live in constant fear of weather. Storms like ours are few and far between, and I know from first hand experience that if you live in Weather Channel hyper vigilance, it will take a toll on you. &lt;/p&gt;\n\n&lt;p&gt;I would love to answer any questions that anyone may have. I am relatively new to Reddit, so I was a little unsure whether to post here or to start a new AMA. If anyone is interested, guidance would be appreciated. For now, I&amp;#39;m doing this here, so AMA!&lt;/p&gt;\n\n&lt;p&gt;edit: typo&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dgbouxr", "score_hidden": false, "stickied": false, "created": 1492346350.0, "created_utc": 1492317550.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzb6", "removal_reason": null, "link_id": "t3_65fsly", "likes": null, "replies": "", "user_reports": [], "id": "dg9vyah", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_65fsly", "subreddit_name_prefixed": "r/IAmA", "controversiality": 0, "body": "Hello! Please note that this is a request post, not an actual AMA. Top level comments are not required to be a question on this thread. You can find out more information about request posts [here](https://www.reddit.com/r/IAmA/wiki/index#wiki_8._what_are_.22requests.2C.22_and_why_are_they_allowed.3F).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello! Please note that this is a request post, not an actual AMA. Top level comments are not required to be a question on this thread. You can find out more information about request posts &lt;a href=\"https://www.reddit.com/r/IAmA/wiki/index#wiki_8._what_are_.22requests.2C.22_and_why_are_they_allowed.3F\"&gt;here&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/IAmA\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IAmA", "name": "t1_dg9vyah", "score_hidden": false, "stickied": false, "created": 1492239068.0, "created_utc": 1492210268.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]