[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "google", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, without any input from me, my phone did a google search for this: &amp;quot;There were some words in my head: Philadelphia, my magnificent hell. I am the burning ember that keeps you aflame. Wind blows, and depending on the direction that day, you either keep me warm or watch me b urn. And burn I have. The scars are immeasurable. Tattooed over again and again, as I try to hide my ugliness from you and those within you. You&amp;#39;ve introduced me to murderers and rapists, and with your sick humor have even placed us in rooms together and allowed friendships to form. You&amp;#39;ve introduced me to the loves of my life and my most hated enemies - often one and the same. Though I&amp;#39;ve tried to leave you, my addiction keeps me safe within you and inevitably I return. It is not you I seek to change, not my surroundings even, but myself. And here we sit together, as I try again. I&amp;#39;m leaving you. I will return, but not out of my love and hatred of you, I will return for me. For you are me, and I am you. You are here 🎯dug into the deepest part of my gut. Although I cannot pull out your arrow, as it may cause me to bleed out - I will continue to bend and break you off, and watch as my wounds heal around you.&amp;quot; I have never seen this... poem(?) before, and the search results didn&amp;#39;t return anything relevant to it. I just thought it was super weird, my phone has never done a google search without my input before. Does anyone have any idea what could have caused this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, without any input from me, my phone did a google search for this: \"There were some words in my head: Philadelphia, my magnificent hell. I am the burning ember that keeps you aflame. Wind blows, and depending on the direction that day, you either keep me warm or watch me b urn. And burn I have. The scars are immeasurable. Tattooed over again and again, as I try to hide my ugliness from you and those within you. You've introduced me to murderers and rapists, and with your sick humor have even placed us in rooms together and allowed friendships to form. You've introduced me to the loves of my life and my most hated enemies - often one and the same. Though I've tried to leave you, my addiction keeps me safe within you and inevitably I return. It is not you I seek to change, not my surroundings even, but myself. And here we sit together, as I try again. I'm leaving you. I will return, but not out of my love and hatred of you, I will return for me. For you are me, and I am you. You are here 🎯dug into the deepest part of my gut. Although I cannot pull out your arrow, as it may cause me to bleed out - I will continue to bend and break you off, and watch as my wounds heal around you.\" I have never seen this... poem(?) before, and the search results didn't return anything relevant to it. I just thought it was super weird, my phone has never done a google search without my input before. Does anyone have any idea what could have caused this?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65cjru", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "pattiemcg", "saved": false, "mod_reports": [], "name": "t3_65cjru", "subreddit_name_prefixed": "r/google", "approved_by": null, "over_18": false, "domain": "self.google", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh45", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/google/comments/65cjru/poetry_ghosts/", "num_reports": null, "locked": false, "stickied": false, "created": 1492205821.0, "url": "https://www.reddit.com/r/google/comments/65cjru/poetry_ghosts/", "author_flair_text": null, "quarantine": false, "title": "Poetry ghosts?", "created_utc": 1492177021.0, "distinguished": null, "media": null, "upvote_ratio": 0.56, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh45", "removal_reason": null, "link_id": "t3_65cjru", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh45", "removal_reason": null, "link_id": "t3_65cjru", "likes": null, "replies": "", "user_reports": [], "id": "dg9hz7x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pattiemcg", "parent_id": "t1_dg9ehau", "subreddit_name_prefixed": "r/google", "controversiality": 0, "body": "Well, it's a Note 5 running Android, but I think you misunderstand. It did this search while I was using the phone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, it&amp;#39;s a Note 5 running Android, but I think you misunderstand. It did this search while I was using the phone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "google", "name": "t1_dg9hz7x", "score_hidden": false, "stickied": false, "created": 1492221745.0, "created_utc": 1492192945.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ehau", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pandaDot", "parent_id": "t3_65cjru", "subreddit_name_prefixed": "r/google", "controversiality": 0, "body": "My top two guesses are either a seriously impressive series of keyboard suggestions, or a friend borrowed your phone. You can try reporting this in the [google search help forum](https://productforums.google.com/forum/#!forum/websearch). Providing your OS and phone model may be helpful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My top two guesses are either a seriously impressive series of keyboard suggestions, or a friend borrowed your phone. You can try reporting this in the &lt;a href=\"https://productforums.google.com/forum/#!forum/websearch\"&gt;google search help forum&lt;/a&gt;. Providing your OS and phone model may be helpful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "google", "name": "t1_dg9ehau", "score_hidden": false, "stickied": false, "created": 1492217710.0, "created_utc": 1492188910.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]