[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Games", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ynoi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 275, "report_reasons": null, "author": "8-Brit", "saved": false, "mod_reports": [], "name": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "approved_by": null, "over_18": false, "domain": "lotro.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhwp", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/Games/comments/64ynoi/lord_of_the_rings_online_10th_anniversary/", "num_reports": null, "locked": false, "stickied": false, "created": 1492037869.0, "url": "https://www.lotro.com/en/10-year-celebrations", "author_flair_text": null, "quarantine": false, "title": "Lord of the Rings Online - 10th Anniversary Celebrations", "created_utc": 1492009069.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 107, "visited": false, "subreddit_type": "public", "ups": 275}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg67gfj", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "JPong", "parent_id": "t1_dg5zbex", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "You could be a professional pie delivery hobbit.\n\nThat made it pretty sweet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could be a professional pie delivery hobbit.&lt;/p&gt;\n\n&lt;p&gt;That made it pretty sweet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg67gfj", "score_hidden": false, "stickied": false, "created": 1492046772.0, "created_utc": 1492017972.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg5zr89", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg5zbex", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Yeah, whilst it occasionally buddies you with major characters, it's not really like most MMOs where you basically get shoehorned into every major event ever. Instead you mostly go on your own adventures, following the trail of the Fellowship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, whilst it occasionally buddies you with major characters, it&amp;#39;s not really like most MMOs where you basically get shoehorned into every major event ever. Instead you mostly go on your own adventures, following the trail of the Fellowship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg5zr89", "score_hidden": false, "stickied": false, "created": 1492038621.0, "created_utc": 1492009821.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg7dj68", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Kryogenetics", "parent_id": "t1_dg70vyu", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I think for me it was more the way raids worked after that. You needed a decent group to get the Radiance stuff before you could go in. \n\n That's what disappointed me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think for me it was more the way raids worked after that. You needed a decent group to get the Radiance stuff before you could go in. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what disappointed me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7dj68", "score_hidden": false, "stickied": false, "created": 1492107369.0, "created_utc": 1492078569.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg7sgus", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dbcanuck", "parent_id": "t1_dg70vyu", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Poor Turbine. The launched Mines of Moria right around the time of Wrath of the Lich King.\n\nMoria was probably the best MMO expansion ever, outside of The Burning Crusade and Wrath of the Lich King. But it was definitely a David vs Goliath scenario, and Blizzard won that showdown.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Poor Turbine. The launched Mines of Moria right around the time of Wrath of the Lich King.&lt;/p&gt;\n\n&lt;p&gt;Moria was probably the best MMO expansion ever, outside of The Burning Crusade and Wrath of the Lich King. But it was definitely a David vs Goliath scenario, and Blizzard won that showdown.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7sgus", "score_hidden": false, "stickied": false, "created": 1492129357.0, "created_utc": 1492100557.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg8t17q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LittleSpoonyBard", "parent_id": "t1_dg70vyu", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "It was amazing in terms of landscape stuff, and the quests and exploration.  Finally getting into Lothlorien was fantastic, especially the way they gated it (which while slightly annoying was a good combination of game mechanics, MMO development pipelines, and lore adherence).  And the Warden and Runekeeper were great classes that were well-designed; the Warden remains my favorite MMO class I've ever played because of how fun and challenging it is, and how rewarding it is for those who master it.  And because threat leeching tanks are great and it's a real shame more games don't make tanks revolve around that concept more.  The Runekeeper was a bit lore-breaking but it's the only real scar in the game as a whole over its 10-year life so far.\n\nThe problem with Moria though was that it established two things that plagued the game for a long time: Radiance and Legendary Items.  Both of which were great in theory but the implementation really changed a lot of the fundamentals that had been established with Shadow of Angmar.  \n\nRadiance turned the very well-balanced gear endgame of SoA into a straight up treadmill, with one set being absolutely necessary for raiding.  Beforehand, in SoA, you could mix and match between crafting, raid (both 12 and 24-man), and PvP gear to get a great set of endgame stuff and have your character be able to enter into and do any content.  After Moria that was no longer the case, and not only was raiding gear the only gear to go with, but it was a linear progression as well.  Lots of people weren't happy with it, and it funneled people into too narrow a corridor.  People ended up getting locked out of content because they didn't do the straight up gear grind, and after a while it became increasingly difficult to find groups to do older stuff to get the lower tiers of radiance so that you could even set foot into the higher tiers of stuff.\n\nLegendary Items were similar.  While nice in theory, the implementation was daft.  Tons and tons of items that were just throwaways, with RNG in every aspect of the item from its built-in stats to its legacies to what tier those legacies were to even the \"age\" of the item itself.  And the moment any new level cap was introduced, all the immense amounts of grind to acquire your item AND level it up was wasted.\n\nPlayers complained about these systems for a long time, and they set a foundation for future expansions to really have a overly gear-oriented endgame that funneled players into one particular path.  And Turbine refused to admit that the systems were flawed for *years* and just wouldn't listen to player feedback.  Eventually, they caved and removed Radiance altogether, making a blog post about how they admitted it wasn't fulfilling its original intention and players were unhappy with it.  And then even more years later they finally fixed the legendary item system by making it so you could actually construct your LI and have it truly grow with you as you leveled up.  But those two systems that were supposed to be the foundation for so much of LotRO's endgame and the way people geared really turned a lot of people off.  I know I began checking out around the time Moria hit, playing less and less until Isengard when I left altogether.\n\nThat being said, I'm back now (returned a few months ago) and the game is simply fantastic.  Still old-school in its design but there's so much charm and love and content there.  It remains one of the best to just delve in and explore, even now, and for anyone that has any passing familiarity with LotR it's wonderful to get to explore Middle Earth.  I'm very excited to delve into Mordor and see the end of the War of the Ring, as well as where Standing Stone Games (the developers that have spun off Turbine) will take the game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was amazing in terms of landscape stuff, and the quests and exploration.  Finally getting into Lothlorien was fantastic, especially the way they gated it (which while slightly annoying was a good combination of game mechanics, MMO development pipelines, and lore adherence).  And the Warden and Runekeeper were great classes that were well-designed; the Warden remains my favorite MMO class I&amp;#39;ve ever played because of how fun and challenging it is, and how rewarding it is for those who master it.  And because threat leeching tanks are great and it&amp;#39;s a real shame more games don&amp;#39;t make tanks revolve around that concept more.  The Runekeeper was a bit lore-breaking but it&amp;#39;s the only real scar in the game as a whole over its 10-year life so far.&lt;/p&gt;\n\n&lt;p&gt;The problem with Moria though was that it established two things that plagued the game for a long time: Radiance and Legendary Items.  Both of which were great in theory but the implementation really changed a lot of the fundamentals that had been established with Shadow of Angmar.  &lt;/p&gt;\n\n&lt;p&gt;Radiance turned the very well-balanced gear endgame of SoA into a straight up treadmill, with one set being absolutely necessary for raiding.  Beforehand, in SoA, you could mix and match between crafting, raid (both 12 and 24-man), and PvP gear to get a great set of endgame stuff and have your character be able to enter into and do any content.  After Moria that was no longer the case, and not only was raiding gear the only gear to go with, but it was a linear progression as well.  Lots of people weren&amp;#39;t happy with it, and it funneled people into too narrow a corridor.  People ended up getting locked out of content because they didn&amp;#39;t do the straight up gear grind, and after a while it became increasingly difficult to find groups to do older stuff to get the lower tiers of radiance so that you could even set foot into the higher tiers of stuff.&lt;/p&gt;\n\n&lt;p&gt;Legendary Items were similar.  While nice in theory, the implementation was daft.  Tons and tons of items that were just throwaways, with RNG in every aspect of the item from its built-in stats to its legacies to what tier those legacies were to even the &amp;quot;age&amp;quot; of the item itself.  And the moment any new level cap was introduced, all the immense amounts of grind to acquire your item AND level it up was wasted.&lt;/p&gt;\n\n&lt;p&gt;Players complained about these systems for a long time, and they set a foundation for future expansions to really have a overly gear-oriented endgame that funneled players into one particular path.  And Turbine refused to admit that the systems were flawed for &lt;em&gt;years&lt;/em&gt; and just wouldn&amp;#39;t listen to player feedback.  Eventually, they caved and removed Radiance altogether, making a blog post about how they admitted it wasn&amp;#39;t fulfilling its original intention and players were unhappy with it.  And then even more years later they finally fixed the legendary item system by making it so you could actually construct your LI and have it truly grow with you as you leveled up.  But those two systems that were supposed to be the foundation for so much of LotRO&amp;#39;s endgame and the way people geared really turned a lot of people off.  I know I began checking out around the time Moria hit, playing less and less until Isengard when I left altogether.&lt;/p&gt;\n\n&lt;p&gt;That being said, I&amp;#39;m back now (returned a few months ago) and the game is simply fantastic.  Still old-school in its design but there&amp;#39;s so much charm and love and content there.  It remains one of the best to just delve in and explore, even now, and for anyone that has any passing familiarity with LotR it&amp;#39;s wonderful to get to explore Middle Earth.  I&amp;#39;m very excited to delve into Mordor and see the end of the War of the Ring, as well as where Standing Stone Games (the developers that have spun off Turbine) will take the game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg8t17q", "score_hidden": false, "stickied": false, "created": 1492176146.0, "created_utc": 1492147346.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg70vyu", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Sikktwizted", "parent_id": "t1_dg68ine", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "You are of course entitled to your opinion but Moria was pretty widely acclaimed as an amazing expansion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are of course entitled to your opinion but Moria was pretty widely acclaimed as an amazing expansion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg70vyu", "score_hidden": false, "stickied": false, "created": 1492080374.0, "created_utc": 1492051574.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg796bf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sfc1971", "parent_id": "t1_dg6yhwv", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Moria looked semi decent but it also went against most of SoA which is that in SoA you could travel fairly easily along most roads without constant agro. Fast travel itself became gated as well.\n\nDid you do the detour from the collapsed bridge? On very long hallways with mobs just placed to tag-team agro you the entire long walk. \n\nIn SoA if people talked to you in chat you could often easily break free or weren't engaged in combat. In MoM you often had to run long distances to break free of agro'ing mobs. \n\nPeople didn't leave enmass with Moria. What I noticed is that the some types of players left, leading to a different feel. Good MMO's need a variety of players. The guild leaders, the peace brokers, the event organizers, the raid tactician, the crafters, the DPS, the healer, the tank.\n\nWith Moria a lot of a casual, for fun nature went out of it. People didn't do Moria raids for fun or for socializing but because they needed piece X.\n\nI led some successful PUG raids on Helegrod just for the hell of it and we awarded loot based on \"what the hell, it is your birthday\". Moria changed that. \n\nYou can cater for the loot raiders but frankly WoW did it better. SoA was played by people that didn't like thinks like Suicide Kings loot organization in WoW and found in Lotro a gentler game.\n\nGated content, loot grinding, it just wasn't what the community was looking for, the community changed and frankly never recovered.\n\nI still kinda like the game, I see old players still come back occasionally but it is nostalgia for a game that no longer exists. \n\nI think there should be room for a non-twitch, non-grind, non-gated MMO. When I play say a The Secret World and see with in a week of launch people demanding in chat that players have X speed run with Y gear... I long back for Lotro and \"sure, you can come along at lvl 45 in a lvl 50 raid, yeah your gear is fine, don't worry, I will keep you alive\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Moria looked semi decent but it also went against most of SoA which is that in SoA you could travel fairly easily along most roads without constant agro. Fast travel itself became gated as well.&lt;/p&gt;\n\n&lt;p&gt;Did you do the detour from the collapsed bridge? On very long hallways with mobs just placed to tag-team agro you the entire long walk. &lt;/p&gt;\n\n&lt;p&gt;In SoA if people talked to you in chat you could often easily break free or weren&amp;#39;t engaged in combat. In MoM you often had to run long distances to break free of agro&amp;#39;ing mobs. &lt;/p&gt;\n\n&lt;p&gt;People didn&amp;#39;t leave enmass with Moria. What I noticed is that the some types of players left, leading to a different feel. Good MMO&amp;#39;s need a variety of players. The guild leaders, the peace brokers, the event organizers, the raid tactician, the crafters, the DPS, the healer, the tank.&lt;/p&gt;\n\n&lt;p&gt;With Moria a lot of a casual, for fun nature went out of it. People didn&amp;#39;t do Moria raids for fun or for socializing but because they needed piece X.&lt;/p&gt;\n\n&lt;p&gt;I led some successful PUG raids on Helegrod just for the hell of it and we awarded loot based on &amp;quot;what the hell, it is your birthday&amp;quot;. Moria changed that. &lt;/p&gt;\n\n&lt;p&gt;You can cater for the loot raiders but frankly WoW did it better. SoA was played by people that didn&amp;#39;t like thinks like Suicide Kings loot organization in WoW and found in Lotro a gentler game.&lt;/p&gt;\n\n&lt;p&gt;Gated content, loot grinding, it just wasn&amp;#39;t what the community was looking for, the community changed and frankly never recovered.&lt;/p&gt;\n\n&lt;p&gt;I still kinda like the game, I see old players still come back occasionally but it is nostalgia for a game that no longer exists. &lt;/p&gt;\n\n&lt;p&gt;I think there should be room for a non-twitch, non-grind, non-gated MMO. When I play say a The Secret World and see with in a week of launch people demanding in chat that players have X speed run with Y gear... I long back for Lotro and &amp;quot;sure, you can come along at lvl 45 in a lvl 50 raid, yeah your gear is fine, don&amp;#39;t worry, I will keep you alive&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg796bf", "score_hidden": false, "stickied": false, "created": 1492094640.0, "created_utc": 1492065840.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg71a4a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sikktwizted", "parent_id": "t1_dg716td", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Fair enough. I myself enjoyed the look of the LIs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair enough. I myself enjoyed the look of the LIs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg71a4a", "score_hidden": false, "stickied": false, "created": 1492080895.0, "created_utc": 1492052095.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg716td", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Drezair", "parent_id": "t1_dg70xvm", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "It's definitely not how it worked in-game. And such blades are not common. In Middle-Earth and as a hunter I don't think my bite should be glowing a ridiculously thick blue as it's made of wood not metal. \n\nI was ok with subtle glows on the weapons and designs that looked inset on the wind, but in Moria it was obnoxious, and hovered around the weapon. Almost looking like a lightsaber. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s definitely not how it worked in-game. And such blades are not common. In Middle-Earth and as a hunter I don&amp;#39;t think my bite should be glowing a ridiculously thick blue as it&amp;#39;s made of wood not metal. &lt;/p&gt;\n\n&lt;p&gt;I was ok with subtle glows on the weapons and designs that looked inset on the wind, but in Moria it was obnoxious, and hovered around the weapon. Almost looking like a lightsaber. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg716td", "score_hidden": false, "stickied": false, "created": 1492080773.0, "created_utc": 1492051973.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg70xvm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sikktwizted", "parent_id": "t1_dg6yhwv", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "&gt;it didn't look like something out of middle Earth\n\nFrodo literally has a sword that glows when orcs (or goblins, can't remember which it is) are near in LotR.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;it didn&amp;#39;t look like something out of middle Earth&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Frodo literally has a sword that glows when orcs (or goblins, can&amp;#39;t remember which it is) are near in LotR.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg70xvm", "score_hidden": false, "stickied": false, "created": 1492080443.0, "created_utc": 1492051643.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6yhwv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Drezair", "parent_id": "t1_dg6pi90", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I'll agree with the raids being fun. The watcher is debatable depending on which version you fought. \n\nI think Shadows of Angmar really nailed it. There was such a strong focus on radiance, but it came from hope tokens, the captain, the special item from Helegrod, etc. Not from your gear. \n\nConjunctions were also crazy important at critical moments in raid fights. The teamwork in SoA was, I think perfect. \n\nI think moria kind of ruined the balance that SoA had. Legendary Weapons had atrocious RNG and the glowy stuff on them was so over the top it didn't look like something out of middle Earth. Legendary Weapons and the way the gear grind worked wrecked the games economy. Entire crafting professions became worthless overnight. And I wish the gear did not use radiance as a gate. It was way too obvious. \n\nOther then that, moria was gorgeous. Turbine really killed it in creating the atmosphere, and top notch story telling, and the game was still fun. After moria I kind of dropped off. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll agree with the raids being fun. The watcher is debatable depending on which version you fought. &lt;/p&gt;\n\n&lt;p&gt;I think Shadows of Angmar really nailed it. There was such a strong focus on radiance, but it came from hope tokens, the captain, the special item from Helegrod, etc. Not from your gear. &lt;/p&gt;\n\n&lt;p&gt;Conjunctions were also crazy important at critical moments in raid fights. The teamwork in SoA was, I think perfect. &lt;/p&gt;\n\n&lt;p&gt;I think moria kind of ruined the balance that SoA had. Legendary Weapons had atrocious RNG and the glowy stuff on them was so over the top it didn&amp;#39;t look like something out of middle Earth. Legendary Weapons and the way the gear grind worked wrecked the games economy. Entire crafting professions became worthless overnight. And I wish the gear did not use radiance as a gate. It was way too obvious. &lt;/p&gt;\n\n&lt;p&gt;Other then that, moria was gorgeous. Turbine really killed it in creating the atmosphere, and top notch story telling, and the game was still fun. After moria I kind of dropped off. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6yhwv", "score_hidden": false, "stickied": false, "created": 1492077372.0, "created_utc": 1492048572.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pi90", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Nan0machines", "parent_id": "t1_dg68ine", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "The Watcher and Dar Nargubud were incredible raids. And the Moria 6 mans as well. Looking back, I think I was actually wrong to join the people who disliked Radiance. Once they removed that, LotRO raiding and group play were never the same again, in a bad way. It just kind of gradually stopped being a group oriented game", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Watcher and Dar Nargubud were incredible raids. And the Moria 6 mans as well. Looking back, I think I was actually wrong to join the people who disliked Radiance. Once they removed that, LotRO raiding and group play were never the same again, in a bad way. It just kind of gradually stopped being a group oriented game&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6pi90", "score_hidden": false, "stickied": false, "created": 1492066325.0, "created_utc": 1492037525.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6er8c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg68ine", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I noticed in Moria and for a little while after the game got really WoW-inspired with 'big' content, even weapons and armour went OTT WoW style with all sorts of oversized glowing shit. Mercifully the phase ended eventually and gear looked reasonable again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I noticed in Moria and for a little while after the game got really WoW-inspired with &amp;#39;big&amp;#39; content, even weapons and armour went OTT WoW style with all sorts of oversized glowing shit. Mercifully the phase ended eventually and gear looked reasonable again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6er8c", "score_hidden": false, "stickied": false, "created": 1492054246.0, "created_utc": 1492025446.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg7v5rz", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "v1ct0r1us", "parent_id": "t1_dg68ine", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Moria was probably the best expansion they ever did dood.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Moria was probably the best expansion they ever did dood.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7v5rz", "score_hidden": false, "stickied": false, "created": 1492132222.0, "created_utc": 1492103422.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68ine", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Kryogenetics", "parent_id": "t1_dg5zbex", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Moria ruined the game for me. Something changed. Raids became less fun. It became more of a chore to acquire what you needed to progress. It's a shame because I spent so long in this game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Moria ruined the game for me. Something changed. Raids became less fun. It became more of a chore to acquire what you needed to progress. It&amp;#39;s a shame because I spent so long in this game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg68ine", "score_hidden": false, "stickied": false, "created": 1492047836.0, "created_utc": 1492019036.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg70w5j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg6kfuj", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Playing warden involved lots of AAAAAAAAA in my memory.\n\nThe m.hobbit shout sound is etched into my mind. Didn't help I went yellow spec...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Playing warden involved lots of AAAAAAAAA in my memory.&lt;/p&gt;\n\n&lt;p&gt;The m.hobbit shout sound is etched into my mind. Didn&amp;#39;t help I went yellow spec...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg70w5j", "score_hidden": false, "stickied": false, "created": 1492080380.0, "created_utc": 1492051580.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg7vabe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "v1ct0r1us", "parent_id": "t1_dg6kfuj", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "F2p killed that game for me. It killed what was left of the once great community lotro had.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;F2p killed that game for me. It killed what was left of the once great community lotro had.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7vabe", "score_hidden": false, "stickied": false, "created": 1492132354.0, "created_utc": 1492103554.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kfuj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mnkybrs", "parent_id": "t1_dg5zbex", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I played a warden and was just losing interest as f2p was rolled out. \n\nI feel like I could still instinctively knock out all the gambits. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I played a warden and was just losing interest as f2p was rolled out. &lt;/p&gt;\n\n&lt;p&gt;I feel like I could still instinctively knock out all the gambits. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6kfuj", "score_hidden": false, "stickied": false, "created": 1492060189.0, "created_utc": 1492031389.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zbex", "gilded": 0, "archived": false, "score": 70, "report_reasons": null, "author": "Dahorah", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I really loved this back when I played it when it first came out. At the time it did a lot of fun things and the way it was so faithful to the lore while making you feel like a part of it deserves respect.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really loved this back when I played it when it first came out. At the time it did a lot of fun things and the way it was so faithful to the lore while making you feel like a part of it deserves respect.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg5zbex", "score_hidden": false, "stickied": false, "created": 1492038129.0, "created_utc": 1492009329.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 70}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg64pqm", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg63w2b", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Same devs as ever, they just broke off from Turbine and became a mostly independent studio, I believe Daybreak handles some marketing and publishing but the development team is the same as far as I know. And no, they aren't using Daybreak Cash and the Daybreak name is nowhere near this game or Dungeons and Dragons Online, which is now also broken off from turbine. In fact as far as I can tell the Daybreak name isn't found anywhere on the game's website, so they really do just handle stuff not immediately related to the game itself, not even microtransactions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same devs as ever, they just broke off from Turbine and became a mostly independent studio, I believe Daybreak handles some marketing and publishing but the development team is the same as far as I know. And no, they aren&amp;#39;t using Daybreak Cash and the Daybreak name is nowhere near this game or Dungeons and Dragons Online, which is now also broken off from turbine. In fact as far as I can tell the Daybreak name isn&amp;#39;t found anywhere on the game&amp;#39;s website, so they really do just handle stuff not immediately related to the game itself, not even microtransactions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg64pqm", "score_hidden": false, "stickied": false, "created": 1492043974.0, "created_utc": 1492015174.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg8t4wi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LittleSpoonyBard", "parent_id": "t1_dg6fbwf", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Minas Tirith has some lag issues for folks.  They're working on addressing it, but it's a big place and the tech is aging.\n\nThat being said, the poster above is being a little hyperbolic.  It isn't unplayable as a whole, and the future looks really good.  It's really just Minas Tirith, and you leave it soon enough anyways on the road to Mordor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Minas Tirith has some lag issues for folks.  They&amp;#39;re working on addressing it, but it&amp;#39;s a big place and the tech is aging.&lt;/p&gt;\n\n&lt;p&gt;That being said, the poster above is being a little hyperbolic.  It isn&amp;#39;t unplayable as a whole, and the future looks really good.  It&amp;#39;s really just Minas Tirith, and you leave it soon enough anyways on the road to Mordor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg8t4wi", "score_hidden": false, "stickied": false, "created": 1492176347.0, "created_utc": 1492147547.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fbwf", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg6a4va", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Would you mind giving some specifics?\n\nI played a bit not too long ago and all seemed as it should be. I'm also fairly certain the devs are the same, they just moved to a new studio, independent from Turbine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would you mind giving some specifics?&lt;/p&gt;\n\n&lt;p&gt;I played a bit not too long ago and all seemed as it should be. I&amp;#39;m also fairly certain the devs are the same, they just moved to a new studio, independent from Turbine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6fbwf", "score_hidden": false, "stickied": false, "created": 1492054829.0, "created_utc": 1492026029.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg750c6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "outbound_flight", "parent_id": "t1_dg73eu5", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "&gt; Tons of long time players who are not afraid to admit the game's problems.\n\nI mean, I've played for about five years now. Does my opinion not count?\n\nYou're clearly frustrated with the game. So fair enough if you've run into things that have driven you away; I've rotated through a bunch of MMOs myself. But I personally have not had the experience with Lotro you seem to have had.\n\nI'd never claim the game is perfect. No MMO is, especially not one as old as Lotro. It is, however, disingenuous to say the game is on its way out for the reasons you listed. SSG has been in charge for all of four-ish months, and in that time they've upped communication (forums, Twitch Q&amp;A streams, Facebook, community event newsletters, mass interviews with even the smallest fansites), introduced a content update and QoL updates players have been begging for (the recent housing update), and the in-game population has jumped significantly as a result.\n\nI don't know if you were playing after Helm's Deep, but things were rough. The game's budget was being funneled away into *Infinite Crisis*. Zero communication, scant updates, barely any population on its massive amount of servers.  I was the only one playing through the spring event one day on Landroval. The game is currently in the process of bouncing back in a big way. Loads of new and returning players, events are packed, people are roaming lower level zones. There will always be room for improvements, but I'm just not seeing what you're seeing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Tons of long time players who are not afraid to admit the game&amp;#39;s problems.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I mean, I&amp;#39;ve played for about five years now. Does my opinion not count?&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re clearly frustrated with the game. So fair enough if you&amp;#39;ve run into things that have driven you away; I&amp;#39;ve rotated through a bunch of MMOs myself. But I personally have not had the experience with Lotro you seem to have had.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d never claim the game is perfect. No MMO is, especially not one as old as Lotro. It is, however, disingenuous to say the game is on its way out for the reasons you listed. SSG has been in charge for all of four-ish months, and in that time they&amp;#39;ve upped communication (forums, Twitch Q&amp;amp;A streams, Facebook, community event newsletters, mass interviews with even the smallest fansites), introduced a content update and QoL updates players have been begging for (the recent housing update), and the in-game population has jumped significantly as a result.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if you were playing after Helm&amp;#39;s Deep, but things were rough. The game&amp;#39;s budget was being funneled away into &lt;em&gt;Infinite Crisis&lt;/em&gt;. Zero communication, scant updates, barely any population on its massive amount of servers.  I was the only one playing through the spring event one day on Landroval. The game is currently in the process of bouncing back in a big way. Loads of new and returning players, events are packed, people are roaming lower level zones. There will always be room for improvements, but I&amp;#39;m just not seeing what you&amp;#39;re seeing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg750c6", "score_hidden": false, "stickied": false, "created": 1492086281.0, "created_utc": 1492057481.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg73eu5", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "no99sum", "parent_id": "t1_dg6gokl", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "&gt; But communication, updates, and population have all been stellar under the new management.\n\nThis is complete bullshit. The last update was a disaster (people could not play due to game-freezing lag) and the devs are completely silent for the last few weeks, making a few fluff comments but refusing to discuss major game problems.  \n\nDon't believe this guy. Just read the official forums. The company has admitted the game has serious problems (old client) and they do not have the money to fix them.  \n\nAnd, you don't have to believe me. Just read the forums. Tons of long time players who are not afraid to admit the game's problems.", "edited": 1492055300.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But communication, updates, and population have all been stellar under the new management.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is complete bullshit. The last update was a disaster (people could not play due to game-freezing lag) and the devs are completely silent for the last few weeks, making a few fluff comments but refusing to discuss major game problems.  &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t believe this guy. Just read the official forums. The company has admitted the game has serious problems (old client) and they do not have the money to fix them.  &lt;/p&gt;\n\n&lt;p&gt;And, you don&amp;#39;t have to believe me. Just read the forums. Tons of long time players who are not afraid to admit the game&amp;#39;s problems.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg73eu5", "score_hidden": false, "stickied": false, "created": 1492083864.0, "created_utc": 1492055064.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6gokl", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "outbound_flight", "parent_id": "t1_dg6a4va", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I couldn't disagree more there. Tech issues not withstanding (I personally don't experience any, but I know some do), I don't see how you could look at the recent updates and the Mordor expansion and think the game is pulling back on content under SSG's watch. I'd make the argument the game is in a fantastic way currently. In the mass exodus​ after Helm's Deep years ago, I might have agreed with you then. But communication, updates, and population have all been stellar under the new management.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I couldn&amp;#39;t disagree more there. Tech issues not withstanding (I personally don&amp;#39;t experience any, but I know some do), I don&amp;#39;t see how you could look at the recent updates and the Mordor expansion and think the game is pulling back on content under SSG&amp;#39;s watch. I&amp;#39;d make the argument the game is in a fantastic way currently. In the mass exodus​ after Helm&amp;#39;s Deep years ago, I might have agreed with you then. But communication, updates, and population have all been stellar under the new management.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6gokl", "score_hidden": false, "stickied": false, "created": 1492056209.0, "created_utc": 1492027409.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg8tlj6", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "no99sum", "parent_id": "t1_dg8t6o0", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Did you even play the game? The last few expansions have been quite small. Nothing anywhere close to a full expansion that other companies put out.  \n\nTell yourself whatever you want. They don't have the money. Turbine admitted this. The next \"expansion\" will be small, more of an update.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you even play the game? The last few expansions have been quite small. Nothing anywhere close to a full expansion that other companies put out.  &lt;/p&gt;\n\n&lt;p&gt;Tell yourself whatever you want. They don&amp;#39;t have the money. Turbine admitted this. The next &amp;quot;expansion&amp;quot; will be small, more of an update.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg8tlj6", "score_hidden": false, "stickied": false, "created": 1492177267.0, "created_utc": 1492148467.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8t6o0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LittleSpoonyBard", "parent_id": "t1_dg6sdta", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "A full new expansion is \"pretty small\" in your eyes?  You're hard to please.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A full new expansion is &amp;quot;pretty small&amp;quot; in your eyes?  You&amp;#39;re hard to please.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg8t6o0", "score_hidden": false, "stickied": false, "created": 1492176443.0, "created_utc": 1492147643.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6sdta", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "no99sum", "parent_id": "t1_dg6qp1v", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "They will invest money to put out some new content. But it will be pretty small.  \n\nThey are just putting out standard PR to make things look hopeful. But they had a problem with their recent content, and the client is really in terrible shape. And they are refusing to answer any questions about the problems.  \n\nBefore turning the game over to the new company (with some of the same staff), Turbine admitted the client is old and has many problems they cannot fix. They also admitted they had little money to spend on the game.  \n\nWe will have to wait and see, but we have no actual improvements to the game at all, just empty promises at this point - and silence when asked questions. Just look at the Dev tracker on the forums.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They will invest money to put out some new content. But it will be pretty small.  &lt;/p&gt;\n\n&lt;p&gt;They are just putting out standard PR to make things look hopeful. But they had a problem with their recent content, and the client is really in terrible shape. And they are refusing to answer any questions about the problems.  &lt;/p&gt;\n\n&lt;p&gt;Before turning the game over to the new company (with some of the same staff), Turbine admitted the client is old and has many problems they cannot fix. They also admitted they had little money to spend on the game.  &lt;/p&gt;\n\n&lt;p&gt;We will have to wait and see, but we have no actual improvements to the game at all, just empty promises at this point - and silence when asked questions. Just look at the Dev tracker on the forums.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6sdta", "score_hidden": false, "stickied": false, "created": 1492069886.0, "created_utc": 1492041086.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qp1v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sturminator94", "parent_id": "t1_dg6qa84", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "http://dadislotroguides.com/64-bit-client-possible/\nwhile this isn't a confirmation, it isn't a denial that they are working on a 64 bit client.\n\nWhere did you see them clearly state they won't be working on a 64-bit client?\n\nAnd I'm sure there are plenty of people who are having lag, but I guess I got lucky since I'm not experiencing any. Although I noticed a great deal improvement when I upgraded to an SSD.\n\nWhat about all the new content planned for this year? If SSG wasn't going to invest any money in Lotro, they wouldn't be releasing the first expansion to the game in nearly 5 years.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://dadislotroguides.com/64-bit-client-possible/\"&gt;http://dadislotroguides.com/64-bit-client-possible/&lt;/a&gt;\nwhile this isn&amp;#39;t a confirmation, it isn&amp;#39;t a denial that they are working on a 64 bit client.&lt;/p&gt;\n\n&lt;p&gt;Where did you see them clearly state they won&amp;#39;t be working on a 64-bit client?&lt;/p&gt;\n\n&lt;p&gt;And I&amp;#39;m sure there are plenty of people who are having lag, but I guess I got lucky since I&amp;#39;m not experiencing any. Although I noticed a great deal improvement when I upgraded to an SSD.&lt;/p&gt;\n\n&lt;p&gt;What about all the new content planned for this year? If SSG wasn&amp;#39;t going to invest any money in Lotro, they wouldn&amp;#39;t be releasing the first expansion to the game in nearly 5 years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6qp1v", "score_hidden": false, "stickied": false, "created": 1492067815.0, "created_utc": 1492039015.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qa84", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "no99sum", "parent_id": "t1_dg6prp2", "subreddit_name_prefixed": "r/Games", "controversiality": 1, "body": "They had a disaster at the last update with lag making the game unplayable for many people.  \n\nAnd now they are refusing to comment on any game problems on the official forums.  \n\nThey have said clearly they will not do a 64-bit client.  \n\nDream all you want, but this company has little money to fix Lotro.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They had a disaster at the last update with lag making the game unplayable for many people.  &lt;/p&gt;\n\n&lt;p&gt;And now they are refusing to comment on any game problems on the official forums.  &lt;/p&gt;\n\n&lt;p&gt;They have said clearly they will not do a 64-bit client.  &lt;/p&gt;\n\n&lt;p&gt;Dream all you want, but this company has little money to fix Lotro.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6qa84", "score_hidden": false, "stickied": false, "created": 1492067303.0, "created_utc": 1492038503.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6prp2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Sturminator94", "parent_id": "t1_dg6a4va", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "How can you possibly say that when they have an expansion planned for later this year alongside a much requested, and needed, character model updates as well as a new race. There are even rumors of a 64 bit client which would alleviate a lot of technical issues.\n\nIf anything, I'm quite optimistic for the future of LOTRO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How can you possibly say that when they have an expansion planned for later this year alongside a much requested, and needed, character model updates as well as a new race. There are even rumors of a 64 bit client which would alleviate a lot of technical issues.&lt;/p&gt;\n\n&lt;p&gt;If anything, I&amp;#39;m quite optimistic for the future of LOTRO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6prp2", "score_hidden": false, "stickied": false, "created": 1492066649.0, "created_utc": 1492037849.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6a4va", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "no99sum", "parent_id": "t1_dg63w2b", "subreddit_name_prefixed": "r/Games", "controversiality": 1, "body": "The new company has shown it has very little money to invest in the game, and has done a lot of things wrong. Incredible lag made the game unplayable for a lot of people. And the new devs are unwilling to talk about game problems. The future for Lotro looks really bad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The new company has shown it has very little money to invest in the game, and has done a lot of things wrong. Incredible lag made the game unplayable for a lot of people. And the new devs are unwilling to talk about game problems. The future for Lotro looks really bad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6a4va", "score_hidden": false, "stickied": false, "created": 1492049483.0, "created_utc": 1492020683.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63w2b", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "TwistingWagoo", "parent_id": "t1_dg5zngh", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I used to play this years back, but left around Rise of Isengard\n due to financial issues and Turbine's decline. You have any links to the current devs' past work?", "edited": 1492038119.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to play this years back, but left around Rise of Isengard\n due to financial issues and Turbine&amp;#39;s decline. You have any links to the current devs&amp;#39; past work?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg63w2b", "score_hidden": false, "stickied": false, "created": 1492043114.0, "created_utc": 1492014314.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg7q8k6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg7d116", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "To this day I know there's a warg pack 'guild' that runs around in a massive blob of 20-30 stealthed wargs, that then ganks the shit out of the free people's backline of healers and ranged. it's glorious to behold.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To this day I know there&amp;#39;s a warg pack &amp;#39;guild&amp;#39; that runs around in a massive blob of 20-30 stealthed wargs, that then ganks the shit out of the free people&amp;#39;s backline of healers and ranged. it&amp;#39;s glorious to behold.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7q8k6", "score_hidden": false, "stickied": false, "created": 1492126985.0, "created_utc": 1492098185.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d116", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kannibalhamster", "parent_id": "t1_dg686y3", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I played it for a few months before it was free to play and if there's anything I miss it's the PvMP mode. Best fun I've ever had in a DaoC-like PvP setting. \n\nAnd levelling as a monster was a ton of fun. I may just be nostalgic, but I remember first starting out as a weak spider, not really able to do much and then learning the class and slowly unlocking its potential as I gain experience and resources.\n\nAnd the fact that there was a dungeon to raid in the PvP zone as well was golden. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I played it for a few months before it was free to play and if there&amp;#39;s anything I miss it&amp;#39;s the PvMP mode. Best fun I&amp;#39;ve ever had in a DaoC-like PvP setting. &lt;/p&gt;\n\n&lt;p&gt;And levelling as a monster was a ton of fun. I may just be nostalgic, but I remember first starting out as a weak spider, not really able to do much and then learning the class and slowly unlocking its potential as I gain experience and resources.&lt;/p&gt;\n\n&lt;p&gt;And the fact that there was a dungeon to raid in the PvP zone as well was golden. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7d116", "score_hidden": false, "stickied": false, "created": 1492105857.0, "created_utc": 1492077057.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg686y3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg67soh", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "&gt;Hunter of Hobbits\n\nWell, I did play a Warg in the PvMP mode...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Hunter of Hobbits&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, I did play a Warg in the PvMP mode...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg686y3", "score_hidden": false, "stickied": false, "created": 1492047509.0, "created_utc": 1492018709.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67soh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SlashCo80", "parent_id": "t1_dg5zngh", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I did play the game for a bit, a couple of years ago, as a hobbit hunter (that is a hobbit who is a hunter, not a hunter of hobbits :) . It was actually pretty fun to travel around the Shire, visiting various places and seeing the sights. Also appreciated that it was based on the books rather than the movies. I lost interest after reaching Bree, but maybe I'll give it another try one of these days. Good to know the game is still alive and going.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did play the game for a bit, a couple of years ago, as a hobbit hunter (that is a hobbit who is a hunter, not a hunter of hobbits :) . It was actually pretty fun to travel around the Shire, visiting various places and seeing the sights. Also appreciated that it was based on the books rather than the movies. I lost interest after reaching Bree, but maybe I&amp;#39;ll give it another try one of these days. Good to know the game is still alive and going.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg67soh", "score_hidden": false, "stickied": false, "created": 1492047110.0, "created_utc": 1492018310.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg71g0n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sikktwizted", "parent_id": "t1_dg71beu", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Yeah I haven't played TESO so I can't comment on that but I think I have such fond memories of LotRO's store because they did it so well compared to any other f2p game I played. Now that the style has been around for a while and is proven to work, other companies have probably done it better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I haven&amp;#39;t played TESO so I can&amp;#39;t comment on that but I think I have such fond memories of LotRO&amp;#39;s store because they did it so well compared to any other f2p game I played. Now that the style has been around for a while and is proven to work, other companies have probably done it better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg71g0n", "score_hidden": false, "stickied": false, "created": 1492081109.0, "created_utc": 1492052309.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71beu", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg710y8", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I have personally seen better, TESO doesn't block off regions into quest packs except for expansion content and purchasing all the expansions isn't too difficult to do, and per character limits don't really exist.\n\nBut, as said, if you can eat a bullet worth somewhere between £40-70 depending on sale prices, you can easily 'unlock' 99% of what LOTRO has to offer in one go. You could even skip buying some of the 100+ leveling areas, as it takes months to get there even if you played every day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have personally seen better, TESO doesn&amp;#39;t block off regions into quest packs except for expansion content and purchasing all the expansions isn&amp;#39;t too difficult to do, and per character limits don&amp;#39;t really exist.&lt;/p&gt;\n\n&lt;p&gt;But, as said, if you can eat a bullet worth somewhere between £40-70 depending on sale prices, you can easily &amp;#39;unlock&amp;#39; 99% of what LOTRO has to offer in one go. You could even skip buying some of the 100+ leveling areas, as it takes months to get there even if you played every day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg71beu", "score_hidden": false, "stickied": false, "created": 1492080941.0, "created_utc": 1492052141.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg710y8", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Sikktwizted", "parent_id": "t1_dg5zngh", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "&gt; The free to play model isn't perfect, however, if you're willing to throw up cash for all the expansions plus a month of VIP, you can:\n\nTo be honest it is the most perfect one that I've seen in a F2P game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The free to play model isn&amp;#39;t perfect, however, if you&amp;#39;re willing to throw up cash for all the expansions plus a month of VIP, you can:&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To be honest it is the most perfect one that I&amp;#39;ve seen in a F2P game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg710y8", "score_hidden": false, "stickied": false, "created": 1492080556.0, "created_utc": 1492051756.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg70zmi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg6mzeb", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Easily done. Wardens can use swords as well but they do primarily use spears for melee and javelins for ranged. Mind, they are a harder class to play. THAT SAID you get them and Rune Keeper if you purchase the full Moria expansion, but I just got the independent quest bundle and Warden individually.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Easily done. Wardens can use swords as well but they do primarily use spears for melee and javelins for ranged. Mind, they are a harder class to play. THAT SAID you get them and Rune Keeper if you purchase the full Moria expansion, but I just got the independent quest bundle and Warden individually.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg70zmi", "score_hidden": false, "stickied": false, "created": 1492080509.0, "created_utc": 1492051709.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mzeb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cyvaris", "parent_id": "t1_dg5zngh", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "How easy/inexpensive is it to unlock the Warden with that set up? The class has always intrigued me as I love the idea of a spear wielding class. Swords are so common in fantasy it's nice to see something break the mold. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How easy/inexpensive is it to unlock the Warden with that set up? The class has always intrigued me as I love the idea of a spear wielding class. Swords are so common in fantasy it&amp;#39;s nice to see something break the mold. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6mzeb", "score_hidden": false, "stickied": false, "created": 1492063196.0, "created_utc": 1492034396.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6pq7k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nan0machines", "parent_id": "t1_dg5zngh", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "You summed it up very well. What I loved about LotRO is how difficult questing was, in a good way. You had to team up with others for a lot of quests but they were arranged on the map in a way you always ran into other people who needed the same things. I also loved its player driven economy (at least in the early days). How high level crafting depended on materials from many different professions, from raids, from world bosses, etc. so you needed to trade and make deals with other players. And how crafting low to mid level gear was balanced in a way that low-mid level players could afford it and the crafters could actually make money from crafting them. Getting help from other players to get your book pages and class quest items. LotRO really did feel like Lord of the Rings in the way you were encouraged to help other players accomplish daunting objectives. That combined with the source material itself resulted in a very mature, friendly, and active community that I haven't experience in another MMO since", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You summed it up very well. What I loved about LotRO is how difficult questing was, in a good way. You had to team up with others for a lot of quests but they were arranged on the map in a way you always ran into other people who needed the same things. I also loved its player driven economy (at least in the early days). How high level crafting depended on materials from many different professions, from raids, from world bosses, etc. so you needed to trade and make deals with other players. And how crafting low to mid level gear was balanced in a way that low-mid level players could afford it and the crafters could actually make money from crafting them. Getting help from other players to get your book pages and class quest items. LotRO really did feel like Lord of the Rings in the way you were encouraged to help other players accomplish daunting objectives. That combined with the source material itself resulted in a very mature, friendly, and active community that I haven&amp;#39;t experience in another MMO since&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6pq7k", "score_hidden": false, "stickied": false, "created": 1492066598.0, "created_utc": 1492037798.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg7q5sz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg75r9x", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "They became independent from Turbine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They became independent from Turbine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7q5sz", "score_hidden": false, "stickied": false, "created": 1492126903.0, "created_utc": 1492098103.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg75r9x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greenstake", "parent_id": "t1_dg5zngh", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I thought they were sunsetting the game? What happened with the devs?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought they were sunsetting the game? What happened with the devs?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg75r9x", "score_hidden": false, "stickied": false, "created": 1492087515.0, "created_utc": 1492058715.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg7cf0y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mrnuno654", "parent_id": "t1_dg5zngh", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "How would and integrated hd620 (newest intel iteration) run the game, is it intensive?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How would and integrated hd620 (newest intel iteration) run the game, is it intensive?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7cf0y", "score_hidden": false, "stickied": false, "created": 1492103984.0, "created_utc": 1492075184.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zngh", "gilded": 0, "archived": false, "score": 90, "report_reasons": null, "author": "8-Brit", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "LOTRO is probably the only MMO, besides WoW, that I still think of regularly, even if I'm not always playing it. The game world is remarkable, combat is still remarkably responsive, it's still receiving plenty of updates with plans to overhaul the player character models -again-, and it has managed to secure development from an independent studio as opposed to being wrangled by Turbine (Who was starting to go under, and start shifting focus to mobile games).\n\nTo this day, the Shire remains my favourite zone in any MMO. Yeah you spend 75% of it doing mundane stuff like chasing animals, delivering post and preparing for a festival. But throughout all the quest text, there are some subtle hints that something isn't quite right in the Shire, not since the Black Rider visited looking for Baggins. Sure enough, you discover Goblins have begin to creep across the borders, but nobody believes you, and it's not until you finally leave the Shire that you realise that the shadows of Mordor have extended much further than the quaint Hobbits would have liked.\n\nLOTRO to me is unique in that it's one of the few MMOs around that treats leveling as a core experience, rather than an obligatory chore you have to zip through ASAP just to get to the \"real\" game at the end of it. Patches regularly just add entire new zones and quest hubs, often even increasing the level cap, with the odd dungeon and -very- occasionally a raid. Admittedly this does cause a problem towards the end, where the speed of leveling becomes abysmally slow, but the game is clearly about the journey, not the destination. I've poured dozens of hours into the game, and have yet to even reach Moria (I'm an altoholic).\n\nThe free to play model isn't perfect, however, if you're willing to throw up cash for all the expansions plus a month of VIP, you can:\n\n* Get enough premium currency to just buy all the quest packs when they're on sale, which is often. Just with what you get from buying the expansions.\n* Unlock all the F2P limitations by making a character and rushing them to level 7, takes less than an hour each. This removest he gold and trait restrictions entirely and persists even aftery our VIP expires.\n* Mounts and other helpful items galore\n* And more besides\n\nI won't lie, especially the latest expansion tends to be a bit stiff on the price, but if it's a one time payment to basically remove every limit on the game, I'm up for it. it's not unlike the lifetime subscription they offered ages ago, which one of my friends had (And to this day he's still a VIP, and has more currency than he knows what to do with).\n\nI strongly encourage people at least give this game a try, you'll be pleasantly surprised. Provided you're a fan of hotkey MMOs. So far my only significant dislike in the game is the zone called the Lonelands... it goes on forever, level 15-30, and it's just one massive slog. But if you own any of the alternate zones, you can go to those instead and they're far newer and more pleasant to go through.\n\nAs a Tolkein nut, it also helps that the game is based on the books, not the film. Making it nice to see a proper visualisation of the books rather than just the movies in MMO form, as the former was significantly more detailed in the events that transpired.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LOTRO is probably the only MMO, besides WoW, that I still think of regularly, even if I&amp;#39;m not always playing it. The game world is remarkable, combat is still remarkably responsive, it&amp;#39;s still receiving plenty of updates with plans to overhaul the player character models -again-, and it has managed to secure development from an independent studio as opposed to being wrangled by Turbine (Who was starting to go under, and start shifting focus to mobile games).&lt;/p&gt;\n\n&lt;p&gt;To this day, the Shire remains my favourite zone in any MMO. Yeah you spend 75% of it doing mundane stuff like chasing animals, delivering post and preparing for a festival. But throughout all the quest text, there are some subtle hints that something isn&amp;#39;t quite right in the Shire, not since the Black Rider visited looking for Baggins. Sure enough, you discover Goblins have begin to creep across the borders, but nobody believes you, and it&amp;#39;s not until you finally leave the Shire that you realise that the shadows of Mordor have extended much further than the quaint Hobbits would have liked.&lt;/p&gt;\n\n&lt;p&gt;LOTRO to me is unique in that it&amp;#39;s one of the few MMOs around that treats leveling as a core experience, rather than an obligatory chore you have to zip through ASAP just to get to the &amp;quot;real&amp;quot; game at the end of it. Patches regularly just add entire new zones and quest hubs, often even increasing the level cap, with the odd dungeon and -very- occasionally a raid. Admittedly this does cause a problem towards the end, where the speed of leveling becomes abysmally slow, but the game is clearly about the journey, not the destination. I&amp;#39;ve poured dozens of hours into the game, and have yet to even reach Moria (I&amp;#39;m an altoholic).&lt;/p&gt;\n\n&lt;p&gt;The free to play model isn&amp;#39;t perfect, however, if you&amp;#39;re willing to throw up cash for all the expansions plus a month of VIP, you can:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Get enough premium currency to just buy all the quest packs when they&amp;#39;re on sale, which is often. Just with what you get from buying the expansions.&lt;/li&gt;\n&lt;li&gt;Unlock all the F2P limitations by making a character and rushing them to level 7, takes less than an hour each. This removest he gold and trait restrictions entirely and persists even aftery our VIP expires.&lt;/li&gt;\n&lt;li&gt;Mounts and other helpful items galore&lt;/li&gt;\n&lt;li&gt;And more besides&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I won&amp;#39;t lie, especially the latest expansion tends to be a bit stiff on the price, but if it&amp;#39;s a one time payment to basically remove every limit on the game, I&amp;#39;m up for it. it&amp;#39;s not unlike the lifetime subscription they offered ages ago, which one of my friends had (And to this day he&amp;#39;s still a VIP, and has more currency than he knows what to do with).&lt;/p&gt;\n\n&lt;p&gt;I strongly encourage people at least give this game a try, you&amp;#39;ll be pleasantly surprised. Provided you&amp;#39;re a fan of hotkey MMOs. So far my only significant dislike in the game is the zone called the Lonelands... it goes on forever, level 15-30, and it&amp;#39;s just one massive slog. But if you own any of the alternate zones, you can go to those instead and they&amp;#39;re far newer and more pleasant to go through.&lt;/p&gt;\n\n&lt;p&gt;As a Tolkein nut, it also helps that the game is based on the books, not the film. Making it nice to see a proper visualisation of the books rather than just the movies in MMO form, as the former was significantly more detailed in the events that transpired.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg5zngh", "score_hidden": false, "stickied": false, "created": 1492038503.0, "created_utc": 1492009703.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 90}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg73ocv", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "no99sum", "parent_id": "t1_dg639st", "subreddit_name_prefixed": "r/Games", "controversiality": 1, "body": "&gt; It's free to play\n\nFree to try. Prepare to pay a hefty sum to get access to content up to endgame in a very outdated and buggy MMO. At least $40.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s free to play&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Free to try. Prepare to pay a hefty sum to get access to content up to endgame in a very outdated and buggy MMO. At least $40.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg73ocv", "score_hidden": false, "stickied": false, "created": 1492084258.0, "created_utc": 1492055458.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg639st", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg62zdz", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "It's free to play, so I highly recommend giving it a try! If the gameplay doesn't pull you in the setting and story absolutely will, it's basically an RPG set in Middle-Earth that is insanely expansive. I'd be happy to answer any basic questions you have on the game, I'm not a pro but my generally understanding is there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s free to play, so I highly recommend giving it a try! If the gameplay doesn&amp;#39;t pull you in the setting and story absolutely will, it&amp;#39;s basically an RPG set in Middle-Earth that is insanely expansive. I&amp;#39;d be happy to answer any basic questions you have on the game, I&amp;#39;m not a pro but my generally understanding is there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg639st", "score_hidden": false, "stickied": false, "created": 1492042464.0, "created_utc": 1492013664.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6epty", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ntn2", "parent_id": "t1_dg62zdz", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I love it and have only ever played it as a single player game. It had many of the typical annoying MMO trappings, but it nails the world and atmosphere.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love it and have only ever played it as a single player game. It had many of the typical annoying MMO trappings, but it nails the world and atmosphere.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6epty", "score_hidden": false, "stickied": false, "created": 1492054208.0, "created_utc": 1492025408.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6gbdg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ltjenkins", "parent_id": "t1_dg62zdz", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I played for like 2 years and quit a little bit after the game made it to Rohan. \n\nInitially I played for the lore and atmosphere. They do such a good job adding all these little nods to the books. The Shire will make you geek out for sure if you were into the books. The game is free to play. You get a bunch of zones for free and you can do the main story quests up to Helm's Deep. Eventually, I found a guild and played with them for a while. I really liked raiding and leveling after I joined with them. \n\nHowever, at the end of the day, it's still an MMO. Combat is typical MMO. The side quests are mainly kill 10 of these and those, gather 10 of this and that. But since you get a lot for free it's worth giving it a shot if you're interested. The story quests are less of the MMO grinding but you will still run into them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I played for like 2 years and quit a little bit after the game made it to Rohan. &lt;/p&gt;\n\n&lt;p&gt;Initially I played for the lore and atmosphere. They do such a good job adding all these little nods to the books. The Shire will make you geek out for sure if you were into the books. The game is free to play. You get a bunch of zones for free and you can do the main story quests up to Helm&amp;#39;s Deep. Eventually, I found a guild and played with them for a while. I really liked raiding and leveling after I joined with them. &lt;/p&gt;\n\n&lt;p&gt;However, at the end of the day, it&amp;#39;s still an MMO. Combat is typical MMO. The side quests are mainly kill 10 of these and those, gather 10 of this and that. But since you get a lot for free it&amp;#39;s worth giving it a shot if you&amp;#39;re interested. The story quests are less of the MMO grinding but you will still run into them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6gbdg", "score_hidden": false, "stickied": false, "created": 1492055830.0, "created_utc": 1492027030.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dgduu3q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TwistingWagoo", "parent_id": "t1_dg68se7", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "When did you last play? I went back into LOTRO again on the Laurelin server, and the only zone that I've found to be empty thus far is the Trollshaws. Every single zone west of that has been filled with a reasonable amount of people, whether it be roleplaying in the true tabletop tradition, swapping stuff for crafting, or questing together. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When did you last play? I went back into LOTRO again on the Laurelin server, and the only zone that I&amp;#39;ve found to be empty thus far is the Trollshaws. Every single zone west of that has been filled with a reasonable amount of people, whether it be roleplaying in the true tabletop tradition, swapping stuff for crafting, or questing together. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dgduu3q", "score_hidden": true, "stickied": false, "created": 1492481140.0, "created_utc": 1492452340.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68se7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "cokevanillazero", "parent_id": "t1_dg62zdz", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "It was cool a few years ago, but these days the community is like six people. It's mostly a SP experience as it is (No enemy players outside of one zone), but it's extremely lonely to play now. \n\nA big portion of it is the social experience of going to Bree and people are running around and playing music and all those shenanigans, but with a player base in the low four digits spread across a handful of servers, you might as well play Skyrim.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was cool a few years ago, but these days the community is like six people. It&amp;#39;s mostly a SP experience as it is (No enemy players outside of one zone), but it&amp;#39;s extremely lonely to play now. &lt;/p&gt;\n\n&lt;p&gt;A big portion of it is the social experience of going to Bree and people are running around and playing music and all those shenanigans, but with a player base in the low four digits spread across a handful of servers, you might as well play Skyrim.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg68se7", "score_hidden": false, "stickied": false, "created": 1492048104.0, "created_utc": 1492019304.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62zdz", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "jonsnowwontgetlaid", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I'm not a fan of MMO's at all as I hate grinding and mindless quests, but I absolutely love Middle Earth and have been wanting an RPG in that world forever.\n\nWould you guys recommend this game to me? I don't care that much about graphics, more about the atmosphere and design.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not a fan of MMO&amp;#39;s at all as I hate grinding and mindless quests, but I absolutely love Middle Earth and have been wanting an RPG in that world forever.&lt;/p&gt;\n\n&lt;p&gt;Would you guys recommend this game to me? I don&amp;#39;t care that much about graphics, more about the atmosphere and design.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg62zdz", "score_hidden": false, "stickied": false, "created": 1492042150.0, "created_utc": 1492013350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6vtti", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Meatoberfest_Mayor", "parent_id": "t1_dg6b47k", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "&gt; the **movement of characters** and mounts are stiff\n\nminor correction : play as a dwarf or hobbit ;) \"no stiffness\"\n\nAnyway the game died around level 75 for me. For some even at 65 and others will tell you the game was perfect til level 50. From lvl85 the game went downhill ...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;the &lt;strong&gt;movement of characters&lt;/strong&gt; and mounts are stiff&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;minor correction : play as a dwarf or hobbit ;) &amp;quot;no stiffness&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Anyway the game died around level 75 for me. For some even at 65 and others will tell you the game was perfect til level 50. From lvl85 the game went downhill ...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6vtti", "score_hidden": false, "stickied": false, "created": 1492074061.0, "created_utc": 1492045261.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6clwe", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg6b47k", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Dated is perhaps correct, imagine if WoW never had all the various improvements over the years (Which is why I will never understand why people have such a raging hardon for vanilla WoW, but I digress).\n\nHowever as someone who is familiar with and enjoyed WoW, I don't find the gameplay to be atrocious, just stiff and clearly aging. The way classes play though can be very interesting, playing a Warden in particular, which requires you to use moves in a sequence to then trigger a specific finisher (Spear, spear, Shout = one move, shout, shield, spear = another, etc).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dated is perhaps correct, imagine if WoW never had all the various improvements over the years (Which is why I will never understand why people have such a raging hardon for vanilla WoW, but I digress).&lt;/p&gt;\n\n&lt;p&gt;However as someone who is familiar with and enjoyed WoW, I don&amp;#39;t find the gameplay to be atrocious, just stiff and clearly aging. The way classes play though can be very interesting, playing a Warden in particular, which requires you to use moves in a sequence to then trigger a specific finisher (Spear, spear, Shout = one move, shout, shield, spear = another, etc).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6clwe", "score_hidden": false, "stickied": false, "created": 1492052017.0, "created_utc": 1492023217.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6pz2q", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Nan0machines", "parent_id": "t1_dg6b47k", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Combat in LotRO is the complete opposite of clunky. You have to learn the speed of skills and use them in a steady rhythm. It's not a simple \"here's your unchanging rotation for the next 200 hours of gameplay\". Even after years of \"Streamlining\" classes, LotRO combat is still deeper and more tactical than most other MMOs. Especially so compared to the popular ones like WoW and ESO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Combat in LotRO is the complete opposite of clunky. You have to learn the speed of skills and use them in a steady rhythm. It&amp;#39;s not a simple &amp;quot;here&amp;#39;s your unchanging rotation for the next 200 hours of gameplay&amp;quot;. Even after years of &amp;quot;Streamlining&amp;quot; classes, LotRO combat is still deeper and more tactical than most other MMOs. Especially so compared to the popular ones like WoW and ESO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6pz2q", "score_hidden": false, "stickied": false, "created": 1492066907.0, "created_utc": 1492038107.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6b47k", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Peejaye", "parent_id": "t1_dg68ykw", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "To add onto your 'warning' -\n\nEverything about this game that shines is all the worldbuilding and extensive lore that IS middle earth, but unfortunately when it comes to gameplay - the thing you'll be doing the most - Lotro does not work well.\n\nThe combat is slow and extremely clunky too, the movement of characters and mounts are stiff. If you've played any recent mmos with active combat, the combat in lotro is going to feel like a sludgefest bore.\n\nAbilities also don't make much sense, itemization is an absolute mess, with stats all over the place and lots of items that don't really help when they should. (Don't get me started on the stat system). Cooldowns on some of the abilities are insanely long for what they are.\n\nIf you can look past these gameplay faults, and play the game and absorb the world, it's a fun time. But if you get bogged down trying to maximize your character stats, Lotro is not enjoyable. I would call many of the systems in the game \"dated\".\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To add onto your &amp;#39;warning&amp;#39; -&lt;/p&gt;\n\n&lt;p&gt;Everything about this game that shines is all the worldbuilding and extensive lore that IS middle earth, but unfortunately when it comes to gameplay - the thing you&amp;#39;ll be doing the most - Lotro does not work well.&lt;/p&gt;\n\n&lt;p&gt;The combat is slow and extremely clunky too, the movement of characters and mounts are stiff. If you&amp;#39;ve played any recent mmos with active combat, the combat in lotro is going to feel like a sludgefest bore.&lt;/p&gt;\n\n&lt;p&gt;Abilities also don&amp;#39;t make much sense, itemization is an absolute mess, with stats all over the place and lots of items that don&amp;#39;t really help when they should. (Don&amp;#39;t get me started on the stat system). Cooldowns on some of the abilities are insanely long for what they are.&lt;/p&gt;\n\n&lt;p&gt;If you can look past these gameplay faults, and play the game and absorb the world, it&amp;#39;s a fun time. But if you get bogged down trying to maximize your character stats, Lotro is not enjoyable. I would call many of the systems in the game &amp;quot;dated&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6b47k", "score_hidden": false, "stickied": false, "created": 1492050489.0, "created_utc": 1492021689.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6awzm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg6ak10", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I think it's remarkable the game is still going. For a long time it was obvious that they had to beeline to Mordor ASAP due to the increasing odds of not being able to renew the license. However, they have said that the license is no longer an issue, and they're free to work on the game as theys ee fit now. So who knows, we know that updated character models and a new race are coming, so under the hood fixes could be on the way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s remarkable the game is still going. For a long time it was obvious that they had to beeline to Mordor ASAP due to the increasing odds of not being able to renew the license. However, they have said that the license is no longer an issue, and they&amp;#39;re free to work on the game as theys ee fit now. So who knows, we know that updated character models and a new race are coming, so under the hood fixes could be on the way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6awzm", "score_hidden": false, "stickied": false, "created": 1492050284.0, "created_utc": 1492021484.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ak10", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "no99sum", "parent_id": "t1_dg6acq7", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "It is just that it has got some serious issues now.  \n\nBut the game has a great world and quests. Moria itself is incredible.   \n\nA lot of us who have played and followed the development closely for years are sad they could not keep the game in good shape.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is just that it has got some serious issues now.  &lt;/p&gt;\n\n&lt;p&gt;But the game has a great world and quests. Moria itself is incredible.   &lt;/p&gt;\n\n&lt;p&gt;A lot of us who have played and followed the development closely for years are sad they could not keep the game in good shape.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6ak10", "score_hidden": false, "stickied": false, "created": 1492049921.0, "created_utc": 1492021121.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6acq7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg68ykw", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I won't pretend the game is flawless performance-wise, but I never got far enough to comment on anything endgame. I got to the high 40s at most, but I have adored 90% of my time otherwise across my characters getting to that point. If you have insight on warning people of such issues, by all means, mention it. I don't want to pretend the game is perfect. It -is- very old and unlike WoW it hasn't had that much under the hood updating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I won&amp;#39;t pretend the game is flawless performance-wise, but I never got far enough to comment on anything endgame. I got to the high 40s at most, but I have adored 90% of my time otherwise across my characters getting to that point. If you have insight on warning people of such issues, by all means, mention it. I don&amp;#39;t want to pretend the game is perfect. It -is- very old and unlike WoW it hasn&amp;#39;t had that much under the hood updating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6acq7", "score_hidden": false, "stickied": false, "created": 1492049707.0, "created_utc": 1492020907.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg7e675", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bmacrules", "parent_id": "t1_dg68ykw", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I love the game but this type of thing is good to let people know about. The lag really hit me hard when I went back to try and play it on a beefier PC a couple months back. =[", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love the game but this type of thing is good to let people know about. The lag really hit me hard when I went back to try and play it on a beefier PC a couple months back. =[&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7e675", "score_hidden": false, "stickied": false, "created": 1492109220.0, "created_utc": 1492080420.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68ykw", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "no99sum", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Lotro is not in good shape. Client is very old, 32-bit, has a memory leak, can only access 1 core. Very good PCs still lag in some areas. People lag for 10 seconds trying to open a bank bag. The game has a ton of problems.  \n\nIt is also quite expensive to buy the whole game, and you are getting an older MMO run by a company that can barely afford to make new content, and who can't at all fix problems in the game. The loot system is completely broken, and they broke the difficulty in the game, so it is incredibly easy for some classes.  \n\nBe warned.    \n\n____________________________________________\n\nOP, you should not be recommending this game without mentioning the problems.  \n\nPlease read this as an example of problems: https://www.lotro.com/forums/showthread.php?652667-Virtually-Paralyzed-in-Bree  \n\nMounted combat is completely unplayable at this point, due to the client and server problems. But the game in general has a ton of problems, that you will not find an any AAA MMO that is being maintained.", "edited": 1492019829.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lotro is not in good shape. Client is very old, 32-bit, has a memory leak, can only access 1 core. Very good PCs still lag in some areas. People lag for 10 seconds trying to open a bank bag. The game has a ton of problems.  &lt;/p&gt;\n\n&lt;p&gt;It is also quite expensive to buy the whole game, and you are getting an older MMO run by a company that can barely afford to make new content, and who can&amp;#39;t at all fix problems in the game. The loot system is completely broken, and they broke the difficulty in the game, so it is incredibly easy for some classes.  &lt;/p&gt;\n\n&lt;p&gt;Be warned.    &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;OP, you should not be recommending this game without mentioning the problems.  &lt;/p&gt;\n\n&lt;p&gt;Please read this as an example of problems: &lt;a href=\"https://www.lotro.com/forums/showthread.php?652667-Virtually-Paralyzed-in-Bree\"&gt;https://www.lotro.com/forums/showthread.php?652667-Virtually-Paralyzed-in-Bree&lt;/a&gt;  &lt;/p&gt;\n\n&lt;p&gt;Mounted combat is completely unplayable at this point, due to the client and server problems. But the game in general has a ton of problems, that you will not find an any AAA MMO that is being maintained.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg68ykw", "score_hidden": false, "stickied": false, "created": 1492048276.0, "created_utc": 1492019476.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg76sk8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ovoon", "parent_id": "t1_dg6djro", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "&gt; Lotro was the MMO I \"grew up with\" in my teen years\n\nAbsolutely.  This game is one of the most special games to me, always will be.\n\nWhen it came out, it was the summer right before I got into high school.  A turning point of my life, and also the first MMO I played.  Every high school summer vacation, I'd boot it back up and just go deep in LOTRO.\n\nNow, years later, I haven't touched it since Mirkwood/Isengard, and I still look at nice summer days with the same fondness I had when I was running around the Shire with friends and having NPC's asking me to \"stay and have some tea.\"\n\nThere's something about the atmosphere of that game that is pure magic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Lotro was the MMO I &amp;quot;grew up with&amp;quot; in my teen years&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Absolutely.  This game is one of the most special games to me, always will be.&lt;/p&gt;\n\n&lt;p&gt;When it came out, it was the summer right before I got into high school.  A turning point of my life, and also the first MMO I played.  Every high school summer vacation, I&amp;#39;d boot it back up and just go deep in LOTRO.&lt;/p&gt;\n\n&lt;p&gt;Now, years later, I haven&amp;#39;t touched it since Mirkwood/Isengard, and I still look at nice summer days with the same fondness I had when I was running around the Shire with friends and having NPC&amp;#39;s asking me to &amp;quot;stay and have some tea.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s something about the atmosphere of that game that is pure magic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg76sk8", "score_hidden": false, "stickied": false, "created": 1492089303.0, "created_utc": 1492060503.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6er04", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thefluffyburrito", "parent_id": "t1_dg6ehr6", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "The community is definitely what I miss the most, which is part of the reason I can't really go back; I know it just wouldn't be the same as being there when the game was great.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The community is definitely what I miss the most, which is part of the reason I can&amp;#39;t really go back; I know it just wouldn&amp;#39;t be the same as being there when the game was great.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6er04", "score_hidden": false, "stickied": false, "created": 1492054239.0, "created_utc": 1492025439.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6q776", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nan0machines", "parent_id": "t1_dg6ehr6", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "The skill tree is probably the biggest thing keeping me from ever returning to the game. It's funny how when every other MMO was switching to trait systems like LotRO always had, LotRO was switching to the tired skill trees those MMOs were abandoning.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The skill tree is probably the biggest thing keeping me from ever returning to the game. It&amp;#39;s funny how when every other MMO was switching to trait systems like LotRO always had, LotRO was switching to the tired skill trees those MMOs were abandoning.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6q776", "score_hidden": false, "stickied": false, "created": 1492067194.0, "created_utc": 1492038394.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ehr6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hotbox4u", "parent_id": "t1_dg6djro", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "&gt; Riders of Rohan then rejected combat that was perfectly fine in favor of \"mounted combat\" that had been hailed as fun and cool by the forums for an eternity. The only problem was the expansion focused entirely on it and it was laggy, rubber-banding mess that wasn't remotely fun to play with. I quit around that time.\n\nSame here. I played and loved the game up until this point. I still shudder when i remember horse combat. What a terrible mess indeed. And then they overhauled the whole character skills etc. and it was just too much for me. I quit and haven't been back since. I still miss the old game and community tho. I was on the EU RP server and it was the most friendly, helpful and generous gaming community i was ever part of. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Riders of Rohan then rejected combat that was perfectly fine in favor of &amp;quot;mounted combat&amp;quot; that had been hailed as fun and cool by the forums for an eternity. The only problem was the expansion focused entirely on it and it was laggy, rubber-banding mess that wasn&amp;#39;t remotely fun to play with. I quit around that time.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Same here. I played and loved the game up until this point. I still shudder when i remember horse combat. What a terrible mess indeed. And then they overhauled the whole character skills etc. and it was just too much for me. I quit and haven&amp;#39;t been back since. I still miss the old game and community tho. I was on the EU RP server and it was the most friendly, helpful and generous gaming community i was ever part of. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6ehr6", "score_hidden": false, "stickied": false, "created": 1492053972.0, "created_utc": 1492025172.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6q4zh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nan0machines", "parent_id": "t1_dg6djro", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Mounted combat would've been great if they ever optimized it. They never did. I guess they just couldn't afford it. It's the main reason I never leveled up my Burglar main past RoR, though. Burglar mounted combat is literally unfinished", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mounted combat would&amp;#39;ve been great if they ever optimized it. They never did. I guess they just couldn&amp;#39;t afford it. It&amp;#39;s the main reason I never leveled up my Burglar main past RoR, though. Burglar mounted combat is literally unfinished&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6q4zh", "score_hidden": false, "stickied": false, "created": 1492067116.0, "created_utc": 1492038316.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6djro", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "thefluffyburrito", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Lotro was the MMO I \"grew up with\" in my teen years from the beta itself and is constantly the one MMO I'm tempted to go back to; if only things hadn't ended so poorly.\n\nThe Shadows of Mirkwood expansion was, in my opinion, the highlight of the game.  Plenty of new end-game content had been released, a new skirmish system added a lot of cool scenarios that revisited old locations and played off the already excellent combat, and the game's population was quite large.   \n\nThen Rise of Isengard hit and while it had great solo PvE content, lacked an end-game entirely.  Months went past as the server populations dwindled with no word as to what was next as players were forced to grind out the same instances as before (I did the \"school\" and \"library\" instances, literally, hundreds of times) for end-game gear.\n\nRiders of Rohan then rejected combat that was perfectly fine in favor of \"mounted combat\" that had been hailed as fun and cool by the forums for an eternity.  The only problem was the expansion focused entirely on it and it was laggy, rubber-banding mess that wasn't remotely fun to play with.  I quit around that time.\n\nEven with the problems of the game around the time I quit, I'll still always remember LOTRO for having the best MMO game world I've ever seen along with a fantastic community of players.  No other game has felt like a livable, breathable world as much as LOTRO did.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lotro was the MMO I &amp;quot;grew up with&amp;quot; in my teen years from the beta itself and is constantly the one MMO I&amp;#39;m tempted to go back to; if only things hadn&amp;#39;t ended so poorly.&lt;/p&gt;\n\n&lt;p&gt;The Shadows of Mirkwood expansion was, in my opinion, the highlight of the game.  Plenty of new end-game content had been released, a new skirmish system added a lot of cool scenarios that revisited old locations and played off the already excellent combat, and the game&amp;#39;s population was quite large.   &lt;/p&gt;\n\n&lt;p&gt;Then Rise of Isengard hit and while it had great solo PvE content, lacked an end-game entirely.  Months went past as the server populations dwindled with no word as to what was next as players were forced to grind out the same instances as before (I did the &amp;quot;school&amp;quot; and &amp;quot;library&amp;quot; instances, literally, hundreds of times) for end-game gear.&lt;/p&gt;\n\n&lt;p&gt;Riders of Rohan then rejected combat that was perfectly fine in favor of &amp;quot;mounted combat&amp;quot; that had been hailed as fun and cool by the forums for an eternity.  The only problem was the expansion focused entirely on it and it was laggy, rubber-banding mess that wasn&amp;#39;t remotely fun to play with.  I quit around that time.&lt;/p&gt;\n\n&lt;p&gt;Even with the problems of the game around the time I quit, I&amp;#39;ll still always remember LOTRO for having the best MMO game world I&amp;#39;ve ever seen along with a fantastic community of players.  No other game has felt like a livable, breathable world as much as LOTRO did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6djro", "score_hidden": false, "stickied": false, "created": 1492053002.0, "created_utc": 1492024202.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg7wmvd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg7vdqg", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Champion it sounds like. But yeah, minstrels can use any instrument whereas other classes are limited to the Lute and one other instrument each.\n\nYou can do some amazing shit with the music system, your friend got a few chords into fire and flames? These guys got through the entire song. https://www.youtube.com/watch?v=TcV34F2PaIQ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Champion it sounds like. But yeah, minstrels can use any instrument whereas other classes are limited to the Lute and one other instrument each.&lt;/p&gt;\n\n&lt;p&gt;You can do some amazing shit with the music system, your friend got a few chords into fire and flames? These guys got through the entire song. &lt;a href=\"https://www.youtube.com/watch?v=TcV34F2PaIQ\"&gt;https://www.youtube.com/watch?v=TcV34F2PaIQ&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7wmvd", "score_hidden": false, "stickied": false, "created": 1492133795.0, "created_utc": 1492104995.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7vdqg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ValexYes", "parent_id": "t1_dg7q3so", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I have no idea, I played a Warrior (or whatever the dual wielding class was called) and my other friend played the Archer. So out of the three of us our Bard friend was the only one to try the Lute :P", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have no idea, I played a Warrior (or whatever the dual wielding class was called) and my other friend played the Archer. So out of the three of us our Bard friend was the only one to try the Lute :P&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7vdqg", "score_hidden": false, "stickied": false, "created": 1492132459.0, "created_utc": 1492103659.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7q3so", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg76dwf", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Any class can use the music system! Though the instruments available vary, I think everyone can use the lute?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Any class can use the music system! Though the instruments available vary, I think everyone can use the lute?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7q3so", "score_hidden": false, "stickied": false, "created": 1492126845.0, "created_utc": 1492098045.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76dwf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ValexYes", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Something amazing about that game was the Bard class actually had the ability to play chords. My friend practised it abit and managed to play a bit of through the fire and flames.\n\nWas a pretty great game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something amazing about that game was the Bard class actually had the ability to play chords. My friend practised it abit and managed to play a bit of through the fire and flames.&lt;/p&gt;\n\n&lt;p&gt;Was a pretty great game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg76dwf", "score_hidden": false, "stickied": false, "created": 1492088578.0, "created_utc": 1492059778.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg7qciz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg7o4vy", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I think we're at the black gates outside Mordornow, but with the threat of a shut down greatly diminished they may start fleshing out other areas first, for a while they had to beeline to Mordor in case they couldn't renew the license.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think we&amp;#39;re at the black gates outside Mordornow, but with the threat of a shut down greatly diminished they may start fleshing out other areas first, for a while they had to beeline to Mordor in case they couldn&amp;#39;t renew the license.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7qciz", "score_hidden": false, "stickied": false, "created": 1492127103.0, "created_utc": 1492098303.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dgdv5cm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TwistingWagoo", "parent_id": "t1_dg7o4vy", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "We are indeed right at the Black Gate of Mordor, and the game does include that final battle. Further updates will certainly include the ability to walk into Mordor (there's gonna be a lot of cleanup needed).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We are indeed right at the Black Gate of Mordor, and the game does include that final battle. Further updates will certainly include the ability to walk into Mordor (there&amp;#39;s gonna be a lot of cleanup needed).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dgdv5cm", "score_hidden": true, "stickied": false, "created": 1492481491.0, "created_utc": 1492452691.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7o4vy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SimonCallahan", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "How far into the story is this game by now? When my brother and I last played (which, admittedly, was about four or five years ago), they were about midway through the first book.\n\nI didn't make it very far, but I also never paid for a subscription. My brother, on the other hand, paid for a subscription and got right up to what was (at the time) the end game content. He even had his own house and a beer keg that allowed him to get so drunk he'd randomly wake up somewhere in Middle-Earth and have to hoof it back home.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How far into the story is this game by now? When my brother and I last played (which, admittedly, was about four or five years ago), they were about midway through the first book.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t make it very far, but I also never paid for a subscription. My brother, on the other hand, paid for a subscription and got right up to what was (at the time) the end game content. He even had his own house and a beer keg that allowed him to get so drunk he&amp;#39;d randomly wake up somewhere in Middle-Earth and have to hoof it back home.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7o4vy", "score_hidden": false, "stickied": false, "created": 1492124719.0, "created_utc": 1492095919.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg67icv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg66aey", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "They closed a bunch of servers, so the pop is small but still alive. I don't have problems asking people for help on group quests.\n\nThe free to play is somewhat limiting yes, a more accurate term is free to play until level 30 or so. However, as said above, if you can bite the bullet and get the expansions and a month of VIP, you never have to worry about the F2P model ever again, at least that has been my experience. I advise waiting for a sale, which tends to occur around anniversary dates! Half off on all the older expansions and quest packs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They closed a bunch of servers, so the pop is small but still alive. I don&amp;#39;t have problems asking people for help on group quests.&lt;/p&gt;\n\n&lt;p&gt;The free to play is somewhat limiting yes, a more accurate term is free to play until level 30 or so. However, as said above, if you can bite the bullet and get the expansions and a month of VIP, you never have to worry about the F2P model ever again, at least that has been my experience. I advise waiting for a sale, which tends to occur around anniversary dates! Half off on all the older expansions and quest packs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg67icv", "score_hidden": false, "stickied": false, "created": 1492046826.0, "created_utc": 1492018026.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg67rte", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "outbound_flight", "parent_id": "t1_dg66aey", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I'd say it's pretty healthy. I'm not even on the most populated server, but there was *a lot* of traffic in the last couple events and I regularly see people questing in the lower level zones. I think the server consolidations greatly helped with retention, and people have been returning to see the new updates leading up to Mordor. \n\nAs for F2P, it's pretty much an unlimited trial. It gives you a nice cross-section of all the content (quests, achievements, player housing, skirmishes, etc.), free run of the overworld, and the epic quests up to Helm's Deep. If you end up enjoying yourself, most of the content can be gotten cheaply during the summer sale.", "edited": 1492018524.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say it&amp;#39;s pretty healthy. I&amp;#39;m not even on the most populated server, but there was &lt;em&gt;a lot&lt;/em&gt; of traffic in the last couple events and I regularly see people questing in the lower level zones. I think the server consolidations greatly helped with retention, and people have been returning to see the new updates leading up to Mordor. &lt;/p&gt;\n\n&lt;p&gt;As for F2P, it&amp;#39;s pretty much an unlimited trial. It gives you a nice cross-section of all the content (quests, achievements, player housing, skirmishes, etc.), free run of the overworld, and the epic quests up to Helm&amp;#39;s Deep. If you end up enjoying yourself, most of the content can be gotten cheaply during the summer sale.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg67rte", "score_hidden": false, "stickied": false, "created": 1492047088.0, "created_utc": 1492018288.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66aey", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jolmer24", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Whats the population like on this and is the free to play still super limiting? I was playing a human ranger type back in like 2011 but havent played since. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whats the population like on this and is the free to play still super limiting? I was playing a human ranger type back in like 2011 but havent played since. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg66aey", "score_hidden": false, "stickied": false, "created": 1492045595.0, "created_utc": 1492016795.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg78qbj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Yasuchika", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I'm tempted to check this out again, I played it during release but ended up quitting soon after hitting level cap because my PC wasn't good enough. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m tempted to check this out again, I played it during release but ended up quitting soon after hitting level cap because my PC wasn&amp;#39;t good enough. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg78qbj", "score_hidden": false, "stickied": false, "created": 1492093518.0, "created_utc": 1492064718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg6ebm2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg6curv", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Indeed, I know the combat is semi-dated but honestly for a hotkey MMO it works perfectly fine. I've not had any issues with it compared to Rift et al.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Indeed, I know the combat is semi-dated but honestly for a hotkey MMO it works perfectly fine. I&amp;#39;ve not had any issues with it compared to Rift et al.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6ebm2", "score_hidden": false, "stickied": false, "created": 1492053793.0, "created_utc": 1492024993.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6curv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bior37", "parent_id": "t1_dg6blsx", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "&gt; At least you guys had your suffering cut short before you actually played the live evrsion of the game, SWG's community got to see their beloved game mutate and twist into a shoddy WoW clone before their eyes.\n\nOof, that's very very true. They get their vindication of having everyone know about it, but they also get the pain too. \n\nBut yes LotRO is probably the most solid WoW clone on the market, I'd say. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;At least you guys had your suffering cut short before you actually played the live evrsion of the game, SWG&amp;#39;s community got to see their beloved game mutate and twist into a shoddy WoW clone before their eyes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Oof, that&amp;#39;s very very true. They get their vindication of having everyone know about it, but they also get the pain too. &lt;/p&gt;\n\n&lt;p&gt;But yes LotRO is probably the most solid WoW clone on the market, I&amp;#39;d say. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6curv", "score_hidden": false, "stickied": false, "created": 1492052271.0, "created_utc": 1492023471.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6blsx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg6bay6", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Doesn't sound unlike the NGU bastardisation that SWG suffered...\n\nAt least you guys had your suffering cut short before you actually played the live evrsion of the game, SWG's community got to see their beloved game mutate and twist into a shoddy WoW clone before their eyes. Worse still, it wans't even a good one, LOTRO is at least a really solid WoW-alike MMO, SWG just... wasn't. At all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doesn&amp;#39;t sound unlike the NGU bastardisation that SWG suffered...&lt;/p&gt;\n\n&lt;p&gt;At least you guys had your suffering cut short before you actually played the live evrsion of the game, SWG&amp;#39;s community got to see their beloved game mutate and twist into a shoddy WoW clone before their eyes. Worse still, it wans&amp;#39;t even a good one, LOTRO is at least a really solid WoW-alike MMO, SWG just... wasn&amp;#39;t. At all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6blsx", "score_hidden": false, "stickied": false, "created": 1492050984.0, "created_utc": 1492022184.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bay6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bior37", "parent_id": "t1_dg6apq0", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I just wish the gameplay supported roleplay. There's so little to do in the game other than solo quest grind. I tried going in with my old Middle Earth Online clan once and the game's mechanics forced us to play apart constantly. \n\nThe only time we could even really play together is if we all logged in at the EXACT same time and did the EXACT same quests at the EXACT same pace. \n\nThis world and setting was so ready and meant to be a social one but all the mechanics discourage socializing with strangers. \n\nBut no, for those who like WoW I'm sure it was fine, just WoW with better lore and art. And if it had marketed that way from the start I would have only been mildly upset. \n\nBut the MEO community was pitched on a totally different game, and we even crowdfunded conventions in Providence with the developers to hang out and see the game. It was a real betrayal. And I can't help but feel the game would have been so much more successful if it hadn't gone the route it had. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just wish the gameplay supported roleplay. There&amp;#39;s so little to do in the game other than solo quest grind. I tried going in with my old Middle Earth Online clan once and the game&amp;#39;s mechanics forced us to play apart constantly. &lt;/p&gt;\n\n&lt;p&gt;The only time we could even really play together is if we all logged in at the EXACT same time and did the EXACT same quests at the EXACT same pace. &lt;/p&gt;\n\n&lt;p&gt;This world and setting was so ready and meant to be a social one but all the mechanics discourage socializing with strangers. &lt;/p&gt;\n\n&lt;p&gt;But no, for those who like WoW I&amp;#39;m sure it was fine, just WoW with better lore and art. And if it had marketed that way from the start I would have only been mildly upset. &lt;/p&gt;\n\n&lt;p&gt;But the MEO community was pitched on a totally different game, and we even crowdfunded conventions in Providence with the developers to hang out and see the game. It was a real betrayal. And I can&amp;#39;t help but feel the game would have been so much more successful if it hadn&amp;#39;t gone the route it had. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6bay6", "score_hidden": false, "stickied": false, "created": 1492050677.0, "created_utc": 1492021877.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6apq0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg6971e", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I have heard of such things, but as someone who enjoys WoW and LOTR, the game is great for me. But I can totally understand the missed chance for a ME RP sandbox. On the bright side, the game feels -made- for RP, being one of the first to have a very extensive outfit system, and MANY NPC vendors that JUST sell casual clothing, backpacks and more. As an Rper on WoW I'd kill for having the same amount of RP-friendly features in WoW.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have heard of such things, but as someone who enjoys WoW and LOTR, the game is great for me. But I can totally understand the missed chance for a ME RP sandbox. On the bright side, the game feels -made- for RP, being one of the first to have a very extensive outfit system, and MANY NPC vendors that JUST sell casual clothing, backpacks and more. As an Rper on WoW I&amp;#39;d kill for having the same amount of RP-friendly features in WoW.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6apq0", "score_hidden": false, "stickied": false, "created": 1492050085.0, "created_utc": 1492021285.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg73pjn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bior37", "parent_id": "t1_dg6qf0e", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "You're confusing two different projects. \n\nDid you not click the link? That's a Turbine game. Why do you think I'm just making up the fact that I met with the devs and played Middle Earth Online?\n\nThe Sierra project stopped being worked on in 1999. \n\nCurrent LotRO started development in 2003, under the title Middle Earth Online, and had NOTHING to do with the Sierra version.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re confusing two different projects. &lt;/p&gt;\n\n&lt;p&gt;Did you not click the link? That&amp;#39;s a Turbine game. Why do you think I&amp;#39;m just making up the fact that I met with the devs and played Middle Earth Online?&lt;/p&gt;\n\n&lt;p&gt;The Sierra project stopped being worked on in 1999. &lt;/p&gt;\n\n&lt;p&gt;Current LotRO started development in 2003, under the title Middle Earth Online, and had NOTHING to do with the Sierra version.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg73pjn", "score_hidden": false, "stickied": false, "created": 1492084309.0, "created_utc": 1492055509.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qf0e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Nan0machines", "parent_id": "t1_dg6971e", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "MEO was not a Turbine game. It was being developed by Sierra On-Line, published by Vivendi who at that time had the rights to LotR video games. Turbine then bought the rights to a LotR MMO and made LotRO, using some assets from MEO. MEO was never going to be a finished product, they really didn't have much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;MEO was not a Turbine game. It was being developed by Sierra On-Line, published by Vivendi who at that time had the rights to LotR video games. Turbine then bought the rights to a LotR MMO and made LotRO, using some assets from MEO. MEO was never going to be a finished product, they really didn&amp;#39;t have much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6qf0e", "score_hidden": false, "stickied": false, "created": 1492067469.0, "created_utc": 1492038669.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6971e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Bior37", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 1, "body": "I'll never forget what MIGHT have been.\n\nThis was the first MMO I got head over heels hyped for, back when Turbine was making it a sandbox MMO called Middle Earth Online. \n\nIt was the tightest knit community I've ever been a part of. Then Turbine had a culture shift and takeover. They won a lawsuit against Tolkien Enterprises that allowed them to develop the game without consulting them, and 9 months before Middle Earth Online was due to be released, they announced they'd changed the name to Lord of the Rings Online.\n\nThe tag line went from \"Live in Middle Earth\" to \"Fight through Middle Earth\". All the cool features from alpha were dropped and replaced by blatant half assed WoW copied features. Veteran developers were shuffled to other projects and LotRO was kicked out the door by fresh college undergrads who were tasked with making MEO look as much like WoW as possible. \n\nThe community fractured, as the game became all about soloing in instanced dungeons and following linear quest paths. \n\nNow and then cool features from MEO cropped up, like the shifting Old Forest (that got patched out) the music system, the morale system...Ever wonder why The Shire was so radically different from the rest of the game? Because that's the most intact part of Middle Earth Online left.\n\n\nA beautiful sandbox game got crunched down into a boring WoW grinder with art and music that was WASTED on it. \n\nNever forget, back when Turbine made good games.\n\nhttps://www.youtube.com/watch?v=Fk0ogD_HMn0\n\nIt was the SWG NGE that no one ever talks about. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll never forget what MIGHT have been.&lt;/p&gt;\n\n&lt;p&gt;This was the first MMO I got head over heels hyped for, back when Turbine was making it a sandbox MMO called Middle Earth Online. &lt;/p&gt;\n\n&lt;p&gt;It was the tightest knit community I&amp;#39;ve ever been a part of. Then Turbine had a culture shift and takeover. They won a lawsuit against Tolkien Enterprises that allowed them to develop the game without consulting them, and 9 months before Middle Earth Online was due to be released, they announced they&amp;#39;d changed the name to Lord of the Rings Online.&lt;/p&gt;\n\n&lt;p&gt;The tag line went from &amp;quot;Live in Middle Earth&amp;quot; to &amp;quot;Fight through Middle Earth&amp;quot;. All the cool features from alpha were dropped and replaced by blatant half assed WoW copied features. Veteran developers were shuffled to other projects and LotRO was kicked out the door by fresh college undergrads who were tasked with making MEO look as much like WoW as possible. &lt;/p&gt;\n\n&lt;p&gt;The community fractured, as the game became all about soloing in instanced dungeons and following linear quest paths. &lt;/p&gt;\n\n&lt;p&gt;Now and then cool features from MEO cropped up, like the shifting Old Forest (that got patched out) the music system, the morale system...Ever wonder why The Shire was so radically different from the rest of the game? Because that&amp;#39;s the most intact part of Middle Earth Online left.&lt;/p&gt;\n\n&lt;p&gt;A beautiful sandbox game got crunched down into a boring WoW grinder with art and music that was WASTED on it. &lt;/p&gt;\n\n&lt;p&gt;Never forget, back when Turbine made good games.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=Fk0ogD_HMn0\"&gt;https://www.youtube.com/watch?v=Fk0ogD_HMn0&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It was the SWG NGE that no one ever talks about. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6971e", "score_hidden": false, "stickied": false, "created": 1492048518.0, "created_utc": 1492019718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg67lp8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg66c2h", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Yeah, it's a pretty by the numbers MMO in terms of gameplay, but I just adore the setting that much and for a hotkey MMO the combat works really well. It helps that the sound design is top notch, such as different weapons making different sounds based on whether you're hitting flesh, armour, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, it&amp;#39;s a pretty by the numbers MMO in terms of gameplay, but I just adore the setting that much and for a hotkey MMO the combat works really well. It helps that the sound design is top notch, such as different weapons making different sounds based on whether you&amp;#39;re hitting flesh, armour, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg67lp8", "score_hidden": false, "stickied": false, "created": 1492046918.0, "created_utc": 1492018118.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66c2h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "guernica88", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I tried several times to get into lotro, but just never could for some reason. I love the world, but I just could not get into this game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I tried several times to get into lotro, but just never could for some reason. I love the world, but I just could not get into this game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg66c2h", "score_hidden": false, "stickied": false, "created": 1492045642.0, "created_utc": 1492016842.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg67pa7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg67hph", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Semi-recent yeah, a few months ago. As said, I'd recommend trying again, but I totally understand if you're hesitant to spend ages trying to resolve account issues. I just remember myself having the exact same error a while ago.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Semi-recent yeah, a few months ago. As said, I&amp;#39;d recommend trying again, but I totally understand if you&amp;#39;re hesitant to spend ages trying to resolve account issues. I just remember myself having the exact same error a while ago.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg67pa7", "score_hidden": false, "stickied": false, "created": 1492047018.0, "created_utc": 1492018218.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67hph", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hellknightx", "parent_id": "t1_dg67eal", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I'd really like to give the game a shot, but I had this problem a few months ago. Was this Turbine untethering very recent? The last time I tried, I think the game's launcher kept redirecting me to the Turbine page.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d really like to give the game a shot, but I had this problem a few months ago. Was this Turbine untethering very recent? The last time I tried, I think the game&amp;#39;s launcher kept redirecting me to the Turbine page.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg67hph", "score_hidden": false, "stickied": false, "created": 1492046807.0, "created_utc": 1492018007.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67eal", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg66pcq", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I remember that being a bug for a while, but cannot for the life of me remember how i solved it, terribly sorry you didn't get it working in the end. It is free to play but the turbine account needed a 'license' for the game still. The game is no longer tethered to Turbine though, so it might be worth another shot if you could find the time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember that being a bug for a while, but cannot for the life of me remember how i solved it, terribly sorry you didn&amp;#39;t get it working in the end. It is free to play but the turbine account needed a &amp;#39;license&amp;#39; for the game still. The game is no longer tethered to Turbine though, so it might be worth another shot if you could find the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg67eal", "score_hidden": false, "stickied": false, "created": 1492046714.0, "created_utc": 1492017914.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg713x4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg6ydw8", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I use the Steam version with no issue but I do remember some people having issues with it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I use the Steam version with no issue but I do remember some people having issues with it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg713x4", "score_hidden": false, "stickied": false, "created": 1492080665.0, "created_utc": 1492051865.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ydw8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hellknightx", "parent_id": "t1_dg6jbof", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Yes, I believe it was through Steam. I will give that a try, thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I believe it was through Steam. I will give that a try, thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6ydw8", "score_hidden": false, "stickied": false, "created": 1492077230.0, "created_utc": 1492048430.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jbof", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Meteorboy", "parent_id": "t1_dg66pcq", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Did you download it on Steam? It's predisposed to errors. Try the direct client.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you download it on Steam? It&amp;#39;s predisposed to errors. Try the direct client.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6jbof", "score_hidden": false, "stickied": false, "created": 1492058947.0, "created_utc": 1492030147.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66pcq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hellknightx", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "I tried to play this game a few months ago, having only played the beta very briefly. I was surprised that this game had survived for so long, so I wanted to see how it had changed and improved over the years.\n\nDownloaded the client, signed in to my Turbine account, and was hit with an error stating that my account did not have a valid license for the game. But... isn't this game free-to-play?\n\nTried to figure out how to add a key to my game, but obviously it's f2p and that's not a thing. So I gave up after about an hour of trying to fix it.\n\nTurbine's proposed solution was to make a new account. Not a game account, a Turbine account - which I have other games attached to. Nope.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I tried to play this game a few months ago, having only played the beta very briefly. I was surprised that this game had survived for so long, so I wanted to see how it had changed and improved over the years.&lt;/p&gt;\n\n&lt;p&gt;Downloaded the client, signed in to my Turbine account, and was hit with an error stating that my account did not have a valid license for the game. But... isn&amp;#39;t this game free-to-play?&lt;/p&gt;\n\n&lt;p&gt;Tried to figure out how to add a key to my game, but obviously it&amp;#39;s f2p and that&amp;#39;s not a thing. So I gave up after about an hour of trying to fix it.&lt;/p&gt;\n\n&lt;p&gt;Turbine&amp;#39;s proposed solution was to make a new account. Not a game account, a Turbine account - which I have other games attached to. Nope.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg66pcq", "score_hidden": false, "stickied": false, "created": 1492046018.0, "created_utc": 1492017218.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dgdvuwi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TwistingWagoo", "parent_id": "t1_dg6pan1", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Class skill trees replaced legendary traits. Normal traits and race traits are unchanged besides just being able to equip them immediately (I wish paying gold to equip that stuff and get new abilities and moves were still a thing, but people love streamlining).\n\nIt wouldn't surprise me if you're getting mixed messages due to how the game has been handled. It's been under the threat of shutdown for awhile and it was clearly getting rushed to at least reach Mt. Doom before then, but now, the deadline's gone thanks to the LOTRO devs (and the devs of Dungeons and Dragons Online too for that matter) exiling from Turbine and taking their work with them. Daybreak games (the Planetside folks) is the publisher now, for better or worse. Either way, time is on LOTRO's side again, even if the budget is less than the Moria days.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Class skill trees replaced legendary traits. Normal traits and race traits are unchanged besides just being able to equip them immediately (I wish paying gold to equip that stuff and get new abilities and moves were still a thing, but people love streamlining).&lt;/p&gt;\n\n&lt;p&gt;It wouldn&amp;#39;t surprise me if you&amp;#39;re getting mixed messages due to how the game has been handled. It&amp;#39;s been under the threat of shutdown for awhile and it was clearly getting rushed to at least reach Mt. Doom before then, but now, the deadline&amp;#39;s gone thanks to the LOTRO devs (and the devs of Dungeons and Dragons Online too for that matter) exiling from Turbine and taking their work with them. Daybreak games (the Planetside folks) is the publisher now, for better or worse. Either way, time is on LOTRO&amp;#39;s side again, even if the budget is less than the Moria days.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dgdvuwi", "score_hidden": true, "stickied": false, "created": 1492482287.0, "created_utc": 1492453487.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pan1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nan0machines", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Played LotRO from launch all the way to Riders of Rohan  \n\nThere's always the itch to come back because Shadows of Angmar and Mines of Moria were such an incredible MMO experience. Made so many friends during that time. It's interesting to see Turbine rebrand and become independent again but I'm getting mixed messages from active players on how good of a job they're doing. And I seriously can't stand the skill tree they replaced traits with a while ago", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Played LotRO from launch all the way to Riders of Rohan  &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s always the itch to come back because Shadows of Angmar and Mines of Moria were such an incredible MMO experience. Made so many friends during that time. It&amp;#39;s interesting to see Turbine rebrand and become independent again but I&amp;#39;m getting mixed messages from active players on how good of a job they&amp;#39;re doing. And I seriously can&amp;#39;t stand the skill tree they replaced traits with a while ago&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6pan1", "score_hidden": false, "stickied": false, "created": 1492066064.0, "created_utc": 1492037264.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhwp", "removal_reason": null, "link_id": "t3_64ynoi", "likes": null, "replies": "", "user_reports": [], "id": "dg7q5dh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg7357p", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "The base story for classes now has x12 XP by default and the companions got mega-buffed to the point of hilarity. But if you want to do anything beyond the base class stories, buckle up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The base story for classes now has x12 XP by default and the companions got mega-buffed to the point of hilarity. But if you want to do anything beyond the base class stories, buckle up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7q5dh", "score_hidden": false, "stickied": false, "created": 1492126890.0, "created_utc": 1492098090.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7357p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheMichaelScott", "parent_id": "t1_dg71718", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Yeah, it's a bit ridiculous. At least you can play through the main storyline quickly now with the 12x boosted XP. Or is that only for members?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, it&amp;#39;s a bit ridiculous. At least you can play through the main storyline quickly now with the 12x boosted XP. Or is that only for members?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg7357p", "score_hidden": false, "stickied": false, "created": 1492083468.0, "created_utc": 1492054668.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71718", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8-Brit", "parent_id": "t1_dg6wj64", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "SWTOR to an extent as well but it's got easily one of the worst f2P models I've ever seen otherwise. Having to pay to equip epics and hide helms? Come the fuck on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;SWTOR to an extent as well but it&amp;#39;s got easily one of the worst f2P models I&amp;#39;ve ever seen otherwise. Having to pay to equip epics and hide helms? Come the fuck on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg71718", "score_hidden": false, "stickied": false, "created": 1492080781.0, "created_utc": 1492051981.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6wj64", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheMichaelScott", "parent_id": "t1_dg6jn3z", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "Don't forget Elder Scrolls Online, too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t forget Elder Scrolls Online, too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6wj64", "score_hidden": false, "stickied": false, "created": 1492074932.0, "created_utc": 1492046132.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jn3z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Meteorboy", "parent_id": "t1_dg6c52h", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "No. Most MMOs don't, the notable exception being Age of Conan.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No. Most MMOs don&amp;#39;t, the notable exception being Age of Conan.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6jn3z", "score_hidden": false, "stickied": false, "created": 1492059289.0, "created_utc": 1492030489.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6c52h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "profHoneybee", "parent_id": "t3_64ynoi", "subreddit_name_prefixed": "r/Games", "controversiality": 0, "body": "did they ever reverse the decision to paywall the main storyline?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;did they ever reverse the decision to paywall the main storyline?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Games", "name": "t1_dg6c52h", "score_hidden": false, "stickied": false, "created": 1492051528.0, "created_utc": 1492022728.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]