[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "CampingandHiking", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Kia ora! I&amp;#39;m a Kiwi who has done a fair amount of tramping (oh sorry, I mean hiking) in Nu Zulund - my longest hikes have been ~8 days. I&amp;#39;m used to wet and wild weather that necessitates packing rain gear for a 2-hour summer walk, overgrown tracks, and encountering terse pig-hunters in crowded DOC huts, but I&amp;#39;m wondering how NZ tracks and general conditions compare to hiking in the States? I&amp;#39;m planning to (hopefully) walk both the Arizona Trail and the Colorado Trail next year, and I want to know where I might be lacking knowledge. We have abundant water sources here (in that it&amp;#39;s often falling from the sky), so tips on planning water refills in somewhere like Arizona would be great. How concerned should I be about snakes and bears, given that New Zealand has very little in the way of things that can kill you? I&amp;#39;m a woman who will be hiking alone, how wary should I be of hitch-hiking? Will I get Lyme disease!? All other general comparisons and info welcome! Chur. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Kia ora! I'm a Kiwi who has done a fair amount of tramping (oh sorry, I mean hiking) in Nu Zulund - my longest hikes have been ~8 days. I'm used to wet and wild weather that necessitates packing rain gear for a 2-hour summer walk, overgrown tracks, and encountering terse pig-hunters in crowded DOC huts, but I'm wondering how NZ tracks and general conditions compare to hiking in the States? I'm planning to (hopefully) walk both the Arizona Trail and the Colorado Trail next year, and I want to know where I might be lacking knowledge. We have abundant water sources here (in that it's often falling from the sky), so tips on planning water refills in somewhere like Arizona would be great. How concerned should I be about snakes and bears, given that New Zealand has very little in the way of things that can kill you? I'm a woman who will be hiking alone, how wary should I be of hitch-hiking? Will I get Lyme disease!? All other general comparisons and info welcome! Chur. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65vf7n", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "gunterisapenguin", "saved": false, "mod_reports": [], "name": "t3_65vf7n", "subreddit_name_prefixed": "r/CampingandHiking", "approved_by": null, "over_18": false, "domain": "self.CampingandHiking", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qqom", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/CampingandHiking/comments/65vf7n/how_does_new_zealand_hiking_compare_to_the_us/", "num_reports": null, "locked": false, "stickied": false, "created": 1492463133.0, "url": "https://www.reddit.com/r/CampingandHiking/comments/65vf7n/how_does_new_zealand_hiking_compare_to_the_us/", "author_flair_text": null, "quarantine": false, "title": "How does New Zealand hiking compare to the US?", "created_utc": 1492434333.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqom", "removal_reason": null, "link_id": "t3_65vf7n", "likes": null, "replies": "", "user_reports": [], "id": "dgdiy3v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BravoJulietKilo", "parent_id": "t3_65vf7n", "subreddit_name_prefixed": "r/CampingandHiking", "controversiality": 0, "body": "Kia Ora! I'm American but backpacked through the South Island for a month in 2011, best month of my life. Did the Banks Peninsula, Abel Tasman, and Milford tracks and spent a few days at Mt Cook.\n\nThe biggest difference you'll find is just the \"wildness\". In NZ, most tracks are generally connected to civilizations in one way or another. You'll be able to walk into town from wherever you might find yourself. In the states, it often takes hours of driving to get out to a trailhead, and you won't see nearly as many people on the trail. Plan on being completely self reliant in general.\n\nThere isn't really a hut system like there is in NZ or many European countries. You'll usually be backcountry tent camping on long distance hikes. So it's important to know how to select a good campsite and be proficient in setting up your tent and camp. You might be able to hitch into town every few days depending on where you are.\n\nFor bears and snakes, they aren't generally dangerous if you understand the threat in that particular area. Bear canisters (cans that hold your food that bears can't open) are required in many parks, particularly on the west coast. You'll also want to know how to hang your food on a tree branch when in bear country. There is lots of info on each park website as far as how to protect yourself from local wildlife depending on where you are.\n\nFor water, I don't have experience on the trails you mentioned but you'll generally have to filter your own water and source availability can be spotty. Most hikers on the PCT will use some sort of crowd sourcing water location app to stay up to date.\n\nI hope you enjoy hiking in the US!", "edited": 1492438751.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kia Ora! I&amp;#39;m American but backpacked through the South Island for a month in 2011, best month of my life. Did the Banks Peninsula, Abel Tasman, and Milford tracks and spent a few days at Mt Cook.&lt;/p&gt;\n\n&lt;p&gt;The biggest difference you&amp;#39;ll find is just the &amp;quot;wildness&amp;quot;. In NZ, most tracks are generally connected to civilizations in one way or another. You&amp;#39;ll be able to walk into town from wherever you might find yourself. In the states, it often takes hours of driving to get out to a trailhead, and you won&amp;#39;t see nearly as many people on the trail. Plan on being completely self reliant in general.&lt;/p&gt;\n\n&lt;p&gt;There isn&amp;#39;t really a hut system like there is in NZ or many European countries. You&amp;#39;ll usually be backcountry tent camping on long distance hikes. So it&amp;#39;s important to know how to select a good campsite and be proficient in setting up your tent and camp. You might be able to hitch into town every few days depending on where you are.&lt;/p&gt;\n\n&lt;p&gt;For bears and snakes, they aren&amp;#39;t generally dangerous if you understand the threat in that particular area. Bear canisters (cans that hold your food that bears can&amp;#39;t open) are required in many parks, particularly on the west coast. You&amp;#39;ll also want to know how to hang your food on a tree branch when in bear country. There is lots of info on each park website as far as how to protect yourself from local wildlife depending on where you are.&lt;/p&gt;\n\n&lt;p&gt;For water, I don&amp;#39;t have experience on the trails you mentioned but you&amp;#39;ll generally have to filter your own water and source availability can be spotty. Most hikers on the PCT will use some sort of crowd sourcing water location app to stay up to date.&lt;/p&gt;\n\n&lt;p&gt;I hope you enjoy hiking in the US!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CampingandHiking", "name": "t1_dgdiy3v", "score_hidden": false, "stickied": false, "created": 1492467307.0, "created_utc": 1492438507.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqom", "removal_reason": null, "link_id": "t3_65vf7n", "likes": null, "replies": "", "user_reports": [], "id": "dgdk5lb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WeAreThePizza", "parent_id": "t3_65vf7n", "subreddit_name_prefixed": "r/CampingandHiking", "controversiality": 0, "body": "Alright I'll try to answer a couple of these. I live near the Colorado Trail in Eagle County. I can't speak to the AZ trail but from my limited experience desert backpacking does come with its own set of considerations that you should definitely be aware of. \nI've never been to New Zealand (someday!) but from what I gather there's lots of huts along trails. You may be aware, but we don't really do that here. [Backcountry huts do exist](http://www.huts.org/) round these parts but only a couple are super convenient off the Colorado Trail, and only in this area. While finding water is not really a serious issue, you unfortunately must always treat it no matter how clean it looks. We have serious issues with [giardia](https://www.ncbi.nlm.nih.gov/pubmed/848482). As for predators, the vast majority of the trail is at higher elevations without poisonous snakes, but especially on the earlier portions they do exist. We are lucky that bears in our area are not generally accustomed to humans as a source of food, and we want to [keep it that way](http://cpw.state.co.us/learn/Pages/LivingwithWildlifeCampingBearCountry.aspx)! One animal I think people underestimate are [moose](http://cpw.state.co.us/learn/Pages/LivingwithWildlifeMoose.aspx). They are big, stupid, and can be aggressive. \nThat's all I've got time for right now but feel free to hit me up with any questions about Colorado.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Alright I&amp;#39;ll try to answer a couple of these. I live near the Colorado Trail in Eagle County. I can&amp;#39;t speak to the AZ trail but from my limited experience desert backpacking does come with its own set of considerations that you should definitely be aware of. \nI&amp;#39;ve never been to New Zealand (someday!) but from what I gather there&amp;#39;s lots of huts along trails. You may be aware, but we don&amp;#39;t really do that here. &lt;a href=\"http://www.huts.org/\"&gt;Backcountry huts do exist&lt;/a&gt; round these parts but only a couple are super convenient off the Colorado Trail, and only in this area. While finding water is not really a serious issue, you unfortunately must always treat it no matter how clean it looks. We have serious issues with &lt;a href=\"https://www.ncbi.nlm.nih.gov/pubmed/848482\"&gt;giardia&lt;/a&gt;. As for predators, the vast majority of the trail is at higher elevations without poisonous snakes, but especially on the earlier portions they do exist. We are lucky that bears in our area are not generally accustomed to humans as a source of food, and we want to &lt;a href=\"http://cpw.state.co.us/learn/Pages/LivingwithWildlifeCampingBearCountry.aspx\"&gt;keep it that way&lt;/a&gt;! One animal I think people underestimate are &lt;a href=\"http://cpw.state.co.us/learn/Pages/LivingwithWildlifeMoose.aspx\"&gt;moose&lt;/a&gt;. They are big, stupid, and can be aggressive. \nThat&amp;#39;s all I&amp;#39;ve got time for right now but feel free to hit me up with any questions about Colorado.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CampingandHiking", "name": "t1_dgdk5lb", "score_hidden": false, "stickied": false, "created": 1492468936.0, "created_utc": 1492440136.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]