[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "happy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I do it because I honestly believe he is the most handsome, beautiful, sexy, and cutest man out there. Of course, him and other people might disagree on that but to me, he&amp;#39;s just my type. I know he can be a little insecure about his image, the both of us have talked about what we dislike about ourselves, but I truly love everything about him. From the freckles on his face to the hairs on his toes (haha).&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s turning 29 this year. His hair is getting thin but I couldn&amp;#39;t care less. Hell, I started dating him when he had his hair completely shaved-- he figured shaving it would be better. But it was his personality that hooked me in and even still, I thought he was physically attractive. &lt;/p&gt;\n\n&lt;p&gt;Later on, he stopped shaving and started growing out his hair and beard. He said he doesn&amp;#39;t like his chin and he liked that his beard hid it. I love his chin. I keep telling him that if we ever have kids, I really wish they get his chin and not mine. Or he can just give me his chin. Whichever works, y&amp;#39;know. Regardless, I think he is handsome with a beard too. And I love his curly hair-- it&amp;#39;s not that thin, sweetheart!&lt;/p&gt;\n\n&lt;p&gt;A couple days ago, he finally shaved his huge beard and he was nervous about it because of his chin. He is literally the most adorable, handsome man to me. It&amp;#39;s funny how much I&amp;#39;ve forgotten what he looked like under the beard, but wow! Some men probably think it&amp;#39;s strange to be described as beautiful, but that&amp;#39;s seriously how I feel about him. He&amp;#39;s such a beautiful, handsome being. He has the prettiest blue-green eyes ever and I love the wrinkles around them whenever he smiles. Without his beard, I can see his smile clearly and he has the most adorable smile in the world. I just want to kiss him every time.&lt;/p&gt;\n\n&lt;p&gt;Whenever I take pictures of him and he catches me, he makes a goofy face. But when he doesn&amp;#39;t notice and I take a candid photo, they&amp;#39;re beautiful photos of a wonderful man.&lt;/p&gt;\n\n&lt;p&gt;Tonight, I&amp;#39;m home alone. He&amp;#39;s left early for Easter with his mother and I&amp;#39;ll be joining them tomorrow. I miss him so I keep looking through the photos I&amp;#39;ve taken. One day, when I&amp;#39;m not so busy, I&amp;#39;ll paint him. He&amp;#39;s my muse and he makes me so happy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I do it because I honestly believe he is the most handsome, beautiful, sexy, and cutest man out there. Of course, him and other people might disagree on that but to me, he's just my type. I know he can be a little insecure about his image, the both of us have talked about what we dislike about ourselves, but I truly love everything about him. From the freckles on his face to the hairs on his toes (haha).\n\nHe's turning 29 this year. His hair is getting thin but I couldn't care less. Hell, I started dating him when he had his hair completely shaved-- he figured shaving it would be better. But it was his personality that hooked me in and even still, I thought he was physically attractive. \n\nLater on, he stopped shaving and started growing out his hair and beard. He said he doesn't like his chin and he liked that his beard hid it. I love his chin. I keep telling him that if we ever have kids, I really wish they get his chin and not mine. Or he can just give me his chin. Whichever works, y'know. Regardless, I think he is handsome with a beard too. And I love his curly hair-- it's not that thin, sweetheart!\n\nA couple days ago, he finally shaved his huge beard and he was nervous about it because of his chin. He is literally the most adorable, handsome man to me. It's funny how much I've forgotten what he looked like under the beard, but wow! Some men probably think it's strange to be described as beautiful, but that's seriously how I feel about him. He's such a beautiful, handsome being. He has the prettiest blue-green eyes ever and I love the wrinkles around them whenever he smiles. Without his beard, I can see his smile clearly and he has the most adorable smile in the world. I just want to kiss him every time.\n\nWhenever I take pictures of him and he catches me, he makes a goofy face. But when he doesn't notice and I take a candid photo, they're beautiful photos of a wonderful man.\n\nTonight, I'm home alone. He's left early for Easter with his mother and I'll be joining them tomorrow. I miss him so I keep looking through the photos I've taken. One day, when I'm not so busy, I'll paint him. He's my muse and he makes me so happy.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65nx52", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "bugrug", "saved": false, "mod_reports": [], "name": "t3_65nx52", "subreddit_name_prefixed": "r/happy", "approved_by": null, "over_18": false, "domain": "self.happy", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh5i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/happy/comments/65nx52/i_like_to_take_pictures_of_my_boyfriend/", "num_reports": null, "locked": false, "stickied": false, "created": 1492354349.0, "url": "https://www.reddit.com/r/happy/comments/65nx52/i_like_to_take_pictures_of_my_boyfriend/", "author_flair_text": null, "quarantine": false, "title": "I like to take pictures of my boyfriend.", "created_utc": 1492325549.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]