[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My sexual drive is raising to levels I never knew were possible. Given that I&amp;#39;ve practically never had a boyfriend I know this hypotethical guy I&amp;#39;ll like won&amp;#39;t be in the picture for years and I honestly don&amp;#39;t know if it&amp;#39;s worth the wait.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t even know if I&amp;#39;ll ever find a bf because I&amp;#39;m this kind of introverted not really attractive person that guys find little to no interest in knowing. And even if a guy did have interest in me, case which has been presented to me several times, I just subconsciously pull away from them. I honestly think that for me to genuinely want someone to be my partner he&amp;#39;d need to be so amazing he&amp;#39;d in no way possible think if me as a possible partner.&lt;/p&gt;\n\n&lt;p&gt;All this is to illustrate the panorama of how evident is that a SO won&amp;#39;t be coming into my life nowhere soon.&lt;/p&gt;\n\n&lt;p&gt;Then what the heck do I do with my sexual drive???? I have a friend who I know would be down to do it with me, BUT he&amp;#39;s this kind if perverted guy who tends to mock me for being so &amp;quot;prude&amp;quot; (i mean im not prude i just dont let him see it, because u know, a virgin is pure and innocent). He has proven several times he cares about me too but the fact that he has been trying to get to my pants for some time now is evident because he literally told me &amp;quot;one day you and I will fuck and it will be amazing&amp;quot;. So, it&amp;#39;d really get on my nerves to give him that, you know?&lt;/p&gt;\n\n&lt;p&gt;On another note, I&amp;#39;m not really attracted to his body and if I am to lose my virginity to someone who I dont love wouldnt the point be that I am physically attracted to him?&lt;/p&gt;\n\n&lt;p&gt;I admit that I like his self confidence, because it&amp;#39;s an asset that I generally like in guys, but the fact that he&amp;#39;s kinda chubby pulls me away because I always imagined my first to be so much different.&lt;/p&gt;\n\n&lt;p&gt;I might have other friends that would be down to it too but this one is so straightforward and has been talking me into it so much it comes naturally to me. What&amp;#39;s more I trust he&amp;#39;s experienced enough and will know how to handle me.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know. Opinions? Is the first time even that important? I always thought the first kiss was and let me tell you that shit was just a bunch of saliva and flesh mixing together. It wasn&amp;#39;t worth the expectation.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My sexual drive is raising to levels I never knew were possible. Given that I've practically never had a boyfriend I know this hypotethical guy I'll like won't be in the picture for years and I honestly don't know if it's worth the wait.\n\nI don't even know if I'll ever find a bf because I'm this kind of introverted not really attractive person that guys find little to no interest in knowing. And even if a guy did have interest in me, case which has been presented to me several times, I just subconsciously pull away from them. I honestly think that for me to genuinely want someone to be my partner he'd need to be so amazing he'd in no way possible think if me as a possible partner.\n\nAll this is to illustrate the panorama of how evident is that a SO won't be coming into my life nowhere soon.\n\nThen what the heck do I do with my sexual drive???? I have a friend who I know would be down to do it with me, BUT he's this kind if perverted guy who tends to mock me for being so \"prude\" (i mean im not prude i just dont let him see it, because u know, a virgin is pure and innocent). He has proven several times he cares about me too but the fact that he has been trying to get to my pants for some time now is evident because he literally told me \"one day you and I will fuck and it will be amazing\". So, it'd really get on my nerves to give him that, you know?\n\nOn another note, I'm not really attracted to his body and if I am to lose my virginity to someone who I dont love wouldnt the point be that I am physically attracted to him?\n\nI admit that I like his self confidence, because it's an asset that I generally like in guys, but the fact that he's kinda chubby pulls me away because I always imagined my first to be so much different.\n\nI might have other friends that would be down to it too but this one is so straightforward and has been talking me into it so much it comes naturally to me. What's more I trust he's experienced enough and will know how to handle me.\n\nI don't know. Opinions? Is the first time even that important? I always thought the first kiss was and let me tell you that shit was just a bunch of saliva and flesh mixing together. It wasn't worth the expectation.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64sqc0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 30, "report_reasons": null, "author": "HikariYumemi", "saved": false, "mod_reports": [], "name": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/64sqc0/would_you_wait_until_you_get_a_so_to_lose_your/", "num_reports": null, "locked": false, "stickied": false, "created": 1491964412.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/64sqc0/would_you_wait_until_you_get_a_so_to_lose_your/", "author_flair_text": null, "quarantine": false, "title": "Would you wait until you get a SO to lose your virginity or would you lose it with someone you're sexually attracted to?", "created_utc": 1491935612.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 23, "visited": false, "subreddit_type": "public", "ups": 30}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg4pxe3", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "kimininegaiwo", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "When I lost my virginity, I was in a relationship. I still only have sex when I'm in relationships because that's my personal preference. It's going to be different for everyone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I lost my virginity, I was in a relationship. I still only have sex when I&amp;#39;m in relationships because that&amp;#39;s my personal preference. It&amp;#39;s going to be different for everyone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4pxe3", "score_hidden": false, "stickied": false, "created": 1491965488.0, "created_utc": 1491936688.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg51t03", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "gafftaped", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Honestly this guy you're talking about sounds like a dick, especially if he won't drop the subject. It seems like he's only trying to get into your pants. If you're going to sleep with someone, whether that be a SO or not, just make sure they're someone you're comfortable with and someone who is trustworthy. If this guy is being this pushy without ever having slept with you I'm worried he won't respect your wishes or consent in the bedroom.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly this guy you&amp;#39;re talking about sounds like a dick, especially if he won&amp;#39;t drop the subject. It seems like he&amp;#39;s only trying to get into your pants. If you&amp;#39;re going to sleep with someone, whether that be a SO or not, just make sure they&amp;#39;re someone you&amp;#39;re comfortable with and someone who is trustworthy. If this guy is being this pushy without ever having slept with you I&amp;#39;m worried he won&amp;#39;t respect your wishes or consent in the bedroom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg51t03", "score_hidden": false, "stickied": false, "created": 1491979139.0, "created_utc": 1491950339.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg4qbmc", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "notyoueither", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I agree with your \"does the first time even matter\"- opinion. I know it's not how a lot of ppl feel but for me the first time was just something to be done with. I was starting to be embarrassed that I was still a virgin (ridiculous since I was pretty young but in my mind everyone else were having sex) so I ended up loosing my virginity in a one night stand. I don't regret it at all. I'm like you on the boyfriend angle, it hasn't happened and I don't see I happening. But I do have some amazing sex with guy friends/  fuck buddies. \nBut no matter what - listen to yourself. I'm pretty loose about the whole sex thing but don't do anything you'd regret :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with your &amp;quot;does the first time even matter&amp;quot;- opinion. I know it&amp;#39;s not how a lot of ppl feel but for me the first time was just something to be done with. I was starting to be embarrassed that I was still a virgin (ridiculous since I was pretty young but in my mind everyone else were having sex) so I ended up loosing my virginity in a one night stand. I don&amp;#39;t regret it at all. I&amp;#39;m like you on the boyfriend angle, it hasn&amp;#39;t happened and I don&amp;#39;t see I happening. But I do have some amazing sex with guy friends/  fuck buddies. \nBut no matter what - listen to yourself. I&amp;#39;m pretty loose about the whole sex thing but don&amp;#39;t do anything you&amp;#39;d regret :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4qbmc", "score_hidden": false, "stickied": false, "created": 1491965898.0, "created_utc": 1491937098.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg5ckdw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "grangerfromthetardis", "parent_id": "t1_dg5c094", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Thanks :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5ckdw", "score_hidden": false, "stickied": false, "created": 1491993443.0, "created_utc": 1491964643.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5c094", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tehzephyrsong", "parent_id": "t1_dg538lx", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Those are good rules.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Those are good rules.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5c094", "score_hidden": false, "stickied": false, "created": 1491992669.0, "created_utc": 1491963869.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg538lx", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "grangerfromthetardis", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": " I had three rules when it came to losing my virginity. \n1) I had to be comfortable enough with him that I could communicate what I wanted and laugh if things got weird \n2) I had protection and trusted him to not harm me intentionally\n3) I would be okay if he walked away in the morning. \n\nSo when I finally narrowed in on the guy I thought it was going to be a one night stand, and it turned into a relationship. Some things you just can't plan.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had three rules when it came to losing my virginity. \n1) I had to be comfortable enough with him that I could communicate what I wanted and laugh if things got weird \n2) I had protection and trusted him to not harm me intentionally\n3) I would be okay if he walked away in the morning. &lt;/p&gt;\n\n&lt;p&gt;So when I finally narrowed in on the guy I thought it was going to be a one night stand, and it turned into a relationship. Some things you just can&amp;#39;t plan.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg538lx", "score_hidden": false, "stickied": false, "created": 1491981030.0, "created_utc": 1491952230.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg4wwbv", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Riatheidea", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "My first time was with my (current) boyfriend, who I have now been dating for a year. Before him, I had kind of gotten to your point and I just wanted to get it over with. I went so far as to think of particular people with whom I wanted to do it, but I never actually acted on it. \n\nLike you, I am extremely introverted. I never thought I'd be with someone. My partner, though, changed that. We met several years ago, got to know each other two years ago, and we started dating last year. That is to say, you'll be surprised what can and will happen.\n\nI don't think you should have sex with the friend you mentioned. You don't seem to care for you, and I am not certain it'd be an experience you like. I don't think you have to love the person you lose your virginity to if that's not important to you. I just think you need to be with someone you definitely want to be with. There is so much wrapped into societal views of sex, so just don't do something that you might not be happy about later.\n\nReally, it's completely up to how and what you want your first time to be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My first time was with my (current) boyfriend, who I have now been dating for a year. Before him, I had kind of gotten to your point and I just wanted to get it over with. I went so far as to think of particular people with whom I wanted to do it, but I never actually acted on it. &lt;/p&gt;\n\n&lt;p&gt;Like you, I am extremely introverted. I never thought I&amp;#39;d be with someone. My partner, though, changed that. We met several years ago, got to know each other two years ago, and we started dating last year. That is to say, you&amp;#39;ll be surprised what can and will happen.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think you should have sex with the friend you mentioned. You don&amp;#39;t seem to care for you, and I am not certain it&amp;#39;d be an experience you like. I don&amp;#39;t think you have to love the person you lose your virginity to if that&amp;#39;s not important to you. I just think you need to be with someone you definitely want to be with. There is so much wrapped into societal views of sex, so just don&amp;#39;t do something that you might not be happy about later.&lt;/p&gt;\n\n&lt;p&gt;Really, it&amp;#39;s completely up to how and what you want your first time to be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4wwbv", "score_hidden": false, "stickied": false, "created": 1491973107.0, "created_utc": 1491944307.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg4sqno", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "kiwi_butt", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "It's not that important, for me it was not a big deal. Still, I don't think it is something you need to get over with. There is no shame in waiting until you find someone you are attracted to, someone you can trust and feel comfortable with. Who doesn't necessarily have to be your partner.\n\nWhen I lost my virginity I just wanted to have sex like other people, too and didn't want to be a virgin anymore. I was 15 and slept with a platonic, not very close friend of mine. It was okay, but in hindsight I think it would have been better to have shared that kind of intimacy with someone more important to me. It didn't go that well and I had a hard time coping with my views on sex for a long while after that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not that important, for me it was not a big deal. Still, I don&amp;#39;t think it is something you need to get over with. There is no shame in waiting until you find someone you are attracted to, someone you can trust and feel comfortable with. Who doesn&amp;#39;t necessarily have to be your partner.&lt;/p&gt;\n\n&lt;p&gt;When I lost my virginity I just wanted to have sex like other people, too and didn&amp;#39;t want to be a virgin anymore. I was 15 and slept with a platonic, not very close friend of mine. It was okay, but in hindsight I think it would have been better to have shared that kind of intimacy with someone more important to me. It didn&amp;#39;t go that well and I had a hard time coping with my views on sex for a long while after that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4sqno", "score_hidden": false, "stickied": false, "created": 1491968486.0, "created_utc": 1491939686.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg4ubhl", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "mariesoleil", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Well, your friend seems like a jerk and you aren't attracted to him. I don't think he'd be a patient first-time lover. I think you should find someone else.\n\n&gt;if I am to lose my virginity to someone who I dont love wouldnt the point be that I am physically attracted to him?\n\nYes. \n\nI waited for marriage and wish I hadn't. It's not something I obsess about, but I wish I'd had more experience before that. \n\nAs you search for someone respectful, get some nice toys to \"tide you over.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, your friend seems like a jerk and you aren&amp;#39;t attracted to him. I don&amp;#39;t think he&amp;#39;d be a patient first-time lover. I think you should find someone else.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;if I am to lose my virginity to someone who I dont love wouldnt the point be that I am physically attracted to him?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes. &lt;/p&gt;\n\n&lt;p&gt;I waited for marriage and wish I hadn&amp;#39;t. It&amp;#39;s not something I obsess about, but I wish I&amp;#39;d had more experience before that. &lt;/p&gt;\n\n&lt;p&gt;As you search for someone respectful, get some nice toys to &amp;quot;tide you over.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4ubhl", "score_hidden": false, "stickied": false, "created": 1491970209.0, "created_utc": 1491941409.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg50t7g", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "callc92", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "The question you need to ask yourself is do you actually want to have sex with this person, or do you just want to have sex? \n\nSex doesn't have to be with someone you love (or even with someone you've known for more than a few hours) but it should be with someone that you trust and that you want to have sex with, and with someone that you won't feel too embarrassed or awkward around when you see them again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The question you need to ask yourself is do you actually want to have sex with this person, or do you just want to have sex? &lt;/p&gt;\n\n&lt;p&gt;Sex doesn&amp;#39;t have to be with someone you love (or even with someone you&amp;#39;ve known for more than a few hours) but it should be with someone that you trust and that you want to have sex with, and with someone that you won&amp;#39;t feel too embarrassed or awkward around when you see them again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg50t7g", "score_hidden": false, "stickied": false, "created": 1491977873.0, "created_utc": 1491949073.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg5x00t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tehzephyrsong", "parent_id": "t1_dg5u12y", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I dunno, that might be overextending the metaphor a little.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dunno, that might be overextending the metaphor a little.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5x00t", "score_hidden": false, "stickied": false, "created": 1492035442.0, "created_utc": 1492006642.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5u12y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FixinThePlanet", "parent_id": "t1_dg5cfnr", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I wonder if left and right hand drive can be used to explain something. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder if left and right hand drive can be used to explain something. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5u12y", "score_hidden": false, "stickied": false, "created": 1492031439.0, "created_utc": 1492002639.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5cfnr", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "tehzephyrsong", "parent_id": "t1_dg4u4ym", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I agree with you. I'd compare it to driving a car. The very first time you drive your very first car is a milestone, sure, and most of us probably have a story or two about that experience. But the first time driving all subsequent cars is *also* special. Sure, you've done this before, and you know what you're doing now, but every new car has its own quirks. The layout is different, the way it communicates with you is different, the handling is different. The experience is different. Shoot, even driving the same car you've had for a while after being away on vacation or otherwise without it for a while is sort of a \"first time.\" Muscle memory kicks in after a bit, but there's definitely a moment where you have to look around and remind yourself where everything is and how it works.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with you. I&amp;#39;d compare it to driving a car. The very first time you drive your very first car is a milestone, sure, and most of us probably have a story or two about that experience. But the first time driving all subsequent cars is &lt;em&gt;also&lt;/em&gt; special. Sure, you&amp;#39;ve done this before, and you know what you&amp;#39;re doing now, but every new car has its own quirks. The layout is different, the way it communicates with you is different, the handling is different. The experience is different. Shoot, even driving the same car you&amp;#39;ve had for a while after being away on vacation or otherwise without it for a while is sort of a &amp;quot;first time.&amp;quot; Muscle memory kicks in after a bit, but there&amp;#39;s definitely a moment where you have to look around and remind yourself where everything is and how it works.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5cfnr", "score_hidden": false, "stickied": false, "created": 1491993259.0, "created_utc": 1491964459.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4u4ym", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "mariesoleil", "parent_id": "t1_dg4qafa", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "&gt; You only get one first time\n\nI see it as you have lots of first times with different partners.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You only get one first time&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I see it as you have lots of first times with different partners.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4u4ym", "score_hidden": false, "stickied": false, "created": 1491970006.0, "created_utc": 1491941206.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg4zioc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "A_Kinky_Virgin", "parent_id": "t1_dg4qafa", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Can you link the site??", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you link the site??&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4zioc", "score_hidden": false, "stickied": false, "created": 1491976245.0, "created_utc": 1491947445.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qafa", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "allonsyyy", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "You only get one first time, it's yours to do what you please with but you'll remember it forever. I'd advocate for making a choice you'll remember fondly and getting a toy in the interim, there was even a charity giving out free sex toys if you paid the shipping on the front page not long ago. Then you'll get a feel for what you like, rather than what some random school boy thinks you'll like. Trust me, he's probably wrong. Confidence does not equal competence, especially on this subject matter lol\n\nI'm probably twice your age, and had my first taken from me when I was probably half your age, so, those are my biases. Make happy memories. Sad ones suck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You only get one first time, it&amp;#39;s yours to do what you please with but you&amp;#39;ll remember it forever. I&amp;#39;d advocate for making a choice you&amp;#39;ll remember fondly and getting a toy in the interim, there was even a charity giving out free sex toys if you paid the shipping on the front page not long ago. Then you&amp;#39;ll get a feel for what you like, rather than what some random school boy thinks you&amp;#39;ll like. Trust me, he&amp;#39;s probably wrong. Confidence does not equal competence, especially on this subject matter lol&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m probably twice your age, and had my first taken from me when I was probably half your age, so, those are my biases. Make happy memories. Sad ones suck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4qafa", "score_hidden": false, "stickied": false, "created": 1491965864.0, "created_utc": 1491937064.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg52jjx", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "featheredheaddress", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I don't think you HAVE to lose your virginity to someone you're committed to/in love with. Sex for the first time is hyped. I personally was surprised by how little it affected me afterwards.\n\nBut do sleep with someone who respects you, will be considerate about your inexperience, and that you can trust. Sex is so personal and you don't want some douche to give you a hard time later.\n\nAlso, Tinder. Some people don't like it, but I say try it out, not necessarily to find someone to hook up with but maybe as a validation exercise. You'll probably get a lot more matches than you think.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think you HAVE to lose your virginity to someone you&amp;#39;re committed to/in love with. Sex for the first time is hyped. I personally was surprised by how little it affected me afterwards.&lt;/p&gt;\n\n&lt;p&gt;But do sleep with someone who respects you, will be considerate about your inexperience, and that you can trust. Sex is so personal and you don&amp;#39;t want some douche to give you a hard time later.&lt;/p&gt;\n\n&lt;p&gt;Also, Tinder. Some people don&amp;#39;t like it, but I say try it out, not necessarily to find someone to hook up with but maybe as a validation exercise. You&amp;#39;ll probably get a lot more matches than you think.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg52jjx", "score_hidden": false, "stickied": false, "created": 1491980099.0, "created_utc": 1491951299.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg5czaa", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "tehzephyrsong", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "[Child get yourself a vibrator.](http://www.lelo.com) I can personally recommend a LELO Gigi--looks like they've updated her and released a Gigi 2, which is even on sale right now! If you have a Brookstone store near you, they carry LELO products if you'd rather purchase your sex toys in public. I was also the horniest god damn teenager, and also was convinced I was a cave troll that none would ever love. Been in a relationship for five years now with a guy that was my first. We moved kind of fast (talking to fucking in about 4 days), but it's worked out so far.\n\nYour friend sounds like an asshole, he doesn't deserve to be your first--you deserve a better experience than that. Pro-tip: nobody knows how to handle you better than you do. But, if you don't know how to get yourself off, you can't direct your partner on how to get you off. Mine is a careful and patient lover, so we were able to figure out together what gets me going, but I wish I would have gotten to know myself better before deciding I was ready to have sex.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.lelo.com\"&gt;Child get yourself a vibrator.&lt;/a&gt; I can personally recommend a LELO Gigi--looks like they&amp;#39;ve updated her and released a Gigi 2, which is even on sale right now! If you have a Brookstone store near you, they carry LELO products if you&amp;#39;d rather purchase your sex toys in public. I was also the horniest god damn teenager, and also was convinced I was a cave troll that none would ever love. Been in a relationship for five years now with a guy that was my first. We moved kind of fast (talking to fucking in about 4 days), but it&amp;#39;s worked out so far.&lt;/p&gt;\n\n&lt;p&gt;Your friend sounds like an asshole, he doesn&amp;#39;t deserve to be your first--you deserve a better experience than that. Pro-tip: nobody knows how to handle you better than you do. But, if you don&amp;#39;t know how to get yourself off, you can&amp;#39;t direct your partner on how to get you off. Mine is a careful and patient lover, so we were able to figure out together what gets me going, but I wish I would have gotten to know myself better before deciding I was ready to have sex.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5czaa", "score_hidden": false, "stickied": false, "created": 1491994023.0, "created_utc": 1491965223.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg5fa1j", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "advicemallard", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "You seem a bit confused about what sex and relationships entail so first I just want to stress that you should only do what you're comfortable with, but if you want to push your own boundaries then that's up to you. Just remember to make sure you feel safe saying no at any point.\n\nThere is nothing special about \"virginity.\" It is an arbitrary concept used to denote the first instance of \"penis in vagina\" or \"PIV\" for short. You're right that it's just like the first kiss, it doesn't really mean anything. It also completely discounts the fact that there are many kinds of sex other than PIV.\n\nAs far as attraction goes, relationships complicate it. You don't have to be in a relationship to be intimate with someone. Your comfort level might mean you prefer to be in a relationship to be intimate, but please don't feel like it's required. However,always practice safe sex whether or not you are in a relationship. You can't know for sure about anyone's​ sexual history so it's best that you both get tested before engaging in sexual activities. Protection against unplanned pregnancy is essential as well.\n\nAs far as your sex drive is concerned, yes, it is nice to have a partner to fulfill your desires, but don't forget you can please yourself. In fact, most partners will have even less of an idea about how to please you than you do. You will have to teach them and that is something I wish I had been told before I started being sexually active. You will be doing yourself a favor if you find out how your body works before you involve someone else. Learn how to reach orgasm and include it in your self care routine. That should help date your sexual appetite.\n\nI am concerned where you talk about this friend of yours being able to \"handle\" you. Are you saying that because you have a submissive nature and you like your partner to be more dominant? Or are you saying that from a preconceived notion that men are more dominant to begin with? Please remember that intimacy and relationships should be equal no matter who is more dominant in the sexual context.\n\nYou also contradict yourself when you say that no one seems to be interested in you but you have multiple people showing interest. This seems like a case where what you mean is that the people who are interested in you aren't the people you are interested in. I suggest asking yourself if you are what you want to be, not what they want you to be. Don't change yourself for anyone else, only change yourself for you. If the wrong people are interested in you then ask yourself is it because you're not the person you want to be?\n\nYou have self doubt and that's not a quality that most people find attractive. You say that you find confidence in others to be attractive, so perhaps finding your own confidence will make you more of the person you want to be. When you are able to focus on yourself you may realize that if someone doesn't like you for who you are then they aren't worth your time. Don't​ ever feel like you aren't good enough for someone else. That's a slippery slope into low self-esteem and letting other people make decisions for you. \n\nI hope you find my words of advice helpful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You seem a bit confused about what sex and relationships entail so first I just want to stress that you should only do what you&amp;#39;re comfortable with, but if you want to push your own boundaries then that&amp;#39;s up to you. Just remember to make sure you feel safe saying no at any point.&lt;/p&gt;\n\n&lt;p&gt;There is nothing special about &amp;quot;virginity.&amp;quot; It is an arbitrary concept used to denote the first instance of &amp;quot;penis in vagina&amp;quot; or &amp;quot;PIV&amp;quot; for short. You&amp;#39;re right that it&amp;#39;s just like the first kiss, it doesn&amp;#39;t really mean anything. It also completely discounts the fact that there are many kinds of sex other than PIV.&lt;/p&gt;\n\n&lt;p&gt;As far as attraction goes, relationships complicate it. You don&amp;#39;t have to be in a relationship to be intimate with someone. Your comfort level might mean you prefer to be in a relationship to be intimate, but please don&amp;#39;t feel like it&amp;#39;s required. However,always practice safe sex whether or not you are in a relationship. You can&amp;#39;t know for sure about anyone&amp;#39;s​ sexual history so it&amp;#39;s best that you both get tested before engaging in sexual activities. Protection against unplanned pregnancy is essential as well.&lt;/p&gt;\n\n&lt;p&gt;As far as your sex drive is concerned, yes, it is nice to have a partner to fulfill your desires, but don&amp;#39;t forget you can please yourself. In fact, most partners will have even less of an idea about how to please you than you do. You will have to teach them and that is something I wish I had been told before I started being sexually active. You will be doing yourself a favor if you find out how your body works before you involve someone else. Learn how to reach orgasm and include it in your self care routine. That should help date your sexual appetite.&lt;/p&gt;\n\n&lt;p&gt;I am concerned where you talk about this friend of yours being able to &amp;quot;handle&amp;quot; you. Are you saying that because you have a submissive nature and you like your partner to be more dominant? Or are you saying that from a preconceived notion that men are more dominant to begin with? Please remember that intimacy and relationships should be equal no matter who is more dominant in the sexual context.&lt;/p&gt;\n\n&lt;p&gt;You also contradict yourself when you say that no one seems to be interested in you but you have multiple people showing interest. This seems like a case where what you mean is that the people who are interested in you aren&amp;#39;t the people you are interested in. I suggest asking yourself if you are what you want to be, not what they want you to be. Don&amp;#39;t change yourself for anyone else, only change yourself for you. If the wrong people are interested in you then ask yourself is it because you&amp;#39;re not the person you want to be?&lt;/p&gt;\n\n&lt;p&gt;You have self doubt and that&amp;#39;s not a quality that most people find attractive. You say that you find confidence in others to be attractive, so perhaps finding your own confidence will make you more of the person you want to be. When you are able to focus on yourself you may realize that if someone doesn&amp;#39;t like you for who you are then they aren&amp;#39;t worth your time. Don&amp;#39;t​ ever feel like you aren&amp;#39;t good enough for someone else. That&amp;#39;s a slippery slope into low self-esteem and letting other people make decisions for you. &lt;/p&gt;\n\n&lt;p&gt;I hope you find my words of advice helpful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5fa1j", "score_hidden": false, "stickied": false, "created": 1491997405.0, "created_utc": 1491968605.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg55e1v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "drunky_crowette", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I lost my consensual virginity to a guy I've seen maybe 3 times since. I think he lives in Florida now. It'll be a decade on halloween. Honestly don't care.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I lost my consensual virginity to a guy I&amp;#39;ve seen maybe 3 times since. I think he lives in Florida now. It&amp;#39;ll be a decade on halloween. Honestly don&amp;#39;t care.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg55e1v", "score_hidden": false, "stickied": false, "created": 1491983957.0, "created_utc": 1491955157.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg4slp7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AlunViir", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I don't think it's that important to have your first time with somebody you're in a relationship with. \n\nYou can have sex with whoever you're attracted to and comfortable with as long as you protect yourself. I had my first time with a kinda friend, I wanted to have sex with him,  he was gentle, respected me and I don't regret it. You do you.", "edited": 1491939830.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think it&amp;#39;s that important to have your first time with somebody you&amp;#39;re in a relationship with. &lt;/p&gt;\n\n&lt;p&gt;You can have sex with whoever you&amp;#39;re attracted to and comfortable with as long as you protect yourself. I had my first time with a kinda friend, I wanted to have sex with him,  he was gentle, respected me and I don&amp;#39;t regret it. You do you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4slp7", "score_hidden": false, "stickied": false, "created": 1491968336.0, "created_utc": 1491939536.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg4wcyy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SubEruanna", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Hi\nSo I'm on my phone so apologies in advance for spelling.\nIt seems like I'm you- but a couple of years from now. When I was little I would dream of a prince sweeping me off my feet, married, and then maybe kids when I'm in my late 30's. Well, that didn't happen. \nWhen I was 13 or so, puberty hit. My sex drive went from 0 to a ga-zillion very fast. I read erotic stories, and progressed to online chatrooms. When I was 14 I had a 6 month relationship with an older guy online. It was kinky and my sex drive and confidence loved it. I used a guy at school as a rebound  (my first relationship according to my parents) but discovered that he was no-where near as sexually anything as my previous relationship. He couldn't give me what I wanted and that was sex. Years passed. I stayed online becoming more central in my kink identity. My online \"slutty\" life and my school \"good girl\" life became seperate and defined who I was to a large part. I sent nudes to guys online, wrote erotica,and never had any of the body confidence troubles my friends and classmates had, partly due to the mass of admittedly biased compliments. At school I kept my head down, and blushed at sexual anything lest my online life be caught out. When my friends used placeholder words for various sexual body parts and actions, I genuinely had no idea what they were talking about because I'd always heard (well read) the real terms, and this helped my good girl persona too. In late year 10 the stress started getting to me, and I confessed my double life to a mental health group. By late year 11 one of the guys from the mental health group and I got real close. He and I became FWB (Friends With Benefits) and I lost my virginity to him and vice versa. It was sweet, a little awkward, and even though I'd always thought I'd lose it on my wedding night in a four-poster bed, it was kind of magical in it's own way. We went on to have sex regularly until I left high school. In late year 12 I confessed to my friends about the double life, about being kinky, poly, and an exhibitionist which was a great weight off my shoulders. After that I found another FWB, and turned 18.\nI'm now 18, and my sex drive is showing no signs of slowing down. I post on GW, and I'm a sex worker, and what's more I love life. \n\nAt the end of the day, the only one who's going to know the existence or lack of, your virginity, is you. It's not a physical thing, it's a cultural thing. You can lie about it if you want, if you do regret anything later, and no-one can truthfully contradict you except the person you rolled (or didn't roll) in the hay with- and even then. \nI don't regret anything. I don't think I'll regret anything in the years to come. My sexuality is filled with happy memories, and as long as you make happy memories, however silly or accidental they may be, you'll be right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi\nSo I&amp;#39;m on my phone so apologies in advance for spelling.\nIt seems like I&amp;#39;m you- but a couple of years from now. When I was little I would dream of a prince sweeping me off my feet, married, and then maybe kids when I&amp;#39;m in my late 30&amp;#39;s. Well, that didn&amp;#39;t happen. \nWhen I was 13 or so, puberty hit. My sex drive went from 0 to a ga-zillion very fast. I read erotic stories, and progressed to online chatrooms. When I was 14 I had a 6 month relationship with an older guy online. It was kinky and my sex drive and confidence loved it. I used a guy at school as a rebound  (my first relationship according to my parents) but discovered that he was no-where near as sexually anything as my previous relationship. He couldn&amp;#39;t give me what I wanted and that was sex. Years passed. I stayed online becoming more central in my kink identity. My online &amp;quot;slutty&amp;quot; life and my school &amp;quot;good girl&amp;quot; life became seperate and defined who I was to a large part. I sent nudes to guys online, wrote erotica,and never had any of the body confidence troubles my friends and classmates had, partly due to the mass of admittedly biased compliments. At school I kept my head down, and blushed at sexual anything lest my online life be caught out. When my friends used placeholder words for various sexual body parts and actions, I genuinely had no idea what they were talking about because I&amp;#39;d always heard (well read) the real terms, and this helped my good girl persona too. In late year 10 the stress started getting to me, and I confessed my double life to a mental health group. By late year 11 one of the guys from the mental health group and I got real close. He and I became FWB (Friends With Benefits) and I lost my virginity to him and vice versa. It was sweet, a little awkward, and even though I&amp;#39;d always thought I&amp;#39;d lose it on my wedding night in a four-poster bed, it was kind of magical in it&amp;#39;s own way. We went on to have sex regularly until I left high school. In late year 12 I confessed to my friends about the double life, about being kinky, poly, and an exhibitionist which was a great weight off my shoulders. After that I found another FWB, and turned 18.\nI&amp;#39;m now 18, and my sex drive is showing no signs of slowing down. I post on GW, and I&amp;#39;m a sex worker, and what&amp;#39;s more I love life. &lt;/p&gt;\n\n&lt;p&gt;At the end of the day, the only one who&amp;#39;s going to know the existence or lack of, your virginity, is you. It&amp;#39;s not a physical thing, it&amp;#39;s a cultural thing. You can lie about it if you want, if you do regret anything later, and no-one can truthfully contradict you except the person you rolled (or didn&amp;#39;t roll) in the hay with- and even then. \nI don&amp;#39;t regret anything. I don&amp;#39;t think I&amp;#39;ll regret anything in the years to come. My sexuality is filled with happy memories, and as long as you make happy memories, however silly or accidental they may be, you&amp;#39;ll be right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4wcyy", "score_hidden": false, "stickied": false, "created": 1491972489.0, "created_utc": 1491943689.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64sqc0", "likes": null, "replies": "", "user_reports": [], "id": "dg59kgo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Daisychains456", "parent_id": "t3_64sqc0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I lost my virginity to a one night stand at 23.  I don't particularly regret it.   AMA.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I lost my virginity to a one night stand at 23.  I don&amp;#39;t particularly regret it.   AMA.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg59kgo", "score_hidden": false, "stickied": false, "created": 1491989407.0, "created_utc": 1491960607.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]