[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay so I&amp;#39;m 18 and my boyfriend is 19. This is my first relationship but my boyfriend was previously in a relationship with a girl for 2 years and it ended before summer 2016. We&amp;#39;ve talked a lot about his girlfriend and how she wasn&amp;#39;t very nice to him or just in general. Basically from what I&amp;#39;ve heard she doesn&amp;#39;t seem like a nice person at all... Whenever we talk about, it makes me sad because I feel like he deserved so much better than her. He always lets me know how happy he is with me now and I feel the same way. We met 7 months ago and were hooking up and basically acting like we were together but have only been officially dating for a little over 3 months.&lt;/p&gt;\n\n&lt;p&gt;Recently we were having a romantic night at a hotel and I was really hoping he was gonna tell me that he loved me but I got really sick and he had to go walk to the store and grab me some medicine. While he was gone I was texting a friend and she randomly suggested I tell him how I felt once he came back. I said no and ended the conversation. However, later that night we were watching Netflix on my laptop and my texts with my friend popped up so I quickly asked him not to read the texts. He got really worried and wanted to know what they were about. I ensured him that it wasn&amp;#39;t anything bad and I just didn&amp;#39;t want to tell him but he wouldn&amp;#39;t let it go and so I eventually was being goofy and kissing him and said &amp;quot;I love you&amp;quot;. He didn&amp;#39;t respond and then said that he thought I was just jokingly saying that. He noticed me getting visibly upset and started talking about how he liked me so so much and how he liked me even more than I liked him but that he just didn&amp;#39;t like saying those three words. He said that it hadn&amp;#39;t been that long since his girlfriend had broken up with him and that he didn&amp;#39;t want to get his heart broken again. &lt;/p&gt;\n\n&lt;p&gt;Obviously everyone is ready to say I love you at different times but I still feel really awful about it. I&amp;#39;m not necessarily upset at him but I really just don&amp;#39;t understand. He has mostly negative things to say about his ex but I know that he did love her. I know that he&amp;#39;s so much happier with me than he ever was with his ex so I guess I just can&amp;#39;t understand why he would use that reasoning to justify not saying it back... Any advice would be super helpful cause I&amp;#39;m just feeling super shitty right now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Okay so I'm 18 and my boyfriend is 19. This is my first relationship but my boyfriend was previously in a relationship with a girl for 2 years and it ended before summer 2016. We've talked a lot about his girlfriend and how she wasn't very nice to him or just in general. Basically from what I've heard she doesn't seem like a nice person at all... Whenever we talk about, it makes me sad because I feel like he deserved so much better than her. He always lets me know how happy he is with me now and I feel the same way. We met 7 months ago and were hooking up and basically acting like we were together but have only been officially dating for a little over 3 months.\n\nRecently we were having a romantic night at a hotel and I was really hoping he was gonna tell me that he loved me but I got really sick and he had to go walk to the store and grab me some medicine. While he was gone I was texting a friend and she randomly suggested I tell him how I felt once he came back. I said no and ended the conversation. However, later that night we were watching Netflix on my laptop and my texts with my friend popped up so I quickly asked him not to read the texts. He got really worried and wanted to know what they were about. I ensured him that it wasn't anything bad and I just didn't want to tell him but he wouldn't let it go and so I eventually was being goofy and kissing him and said \"I love you\". He didn't respond and then said that he thought I was just jokingly saying that. He noticed me getting visibly upset and started talking about how he liked me so so much and how he liked me even more than I liked him but that he just didn't like saying those three words. He said that it hadn't been that long since his girlfriend had broken up with him and that he didn't want to get his heart broken again. \n\nObviously everyone is ready to say I love you at different times but I still feel really awful about it. I'm not necessarily upset at him but I really just don't understand. He has mostly negative things to say about his ex but I know that he did love her. I know that he's so much happier with me than he ever was with his ex so I guess I just can't understand why he would use that reasoning to justify not saying it back... Any advice would be super helpful cause I'm just feeling super shitty right now.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64su00", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "marie3880", "saved": false, "mod_reports": [], "name": "t3_64su00", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/64su00/my_boyfriend_didnt_say_i_love_you_back/", "num_reports": null, "locked": false, "stickied": false, "created": 1491965329.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/64su00/my_boyfriend_didnt_say_i_love_you_back/", "author_flair_text": null, "quarantine": false, "title": "my boyfriend didn't say 'I love you' back...", "created_utc": 1491936529.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64su00", "likes": null, "replies": "", "user_reports": [], "id": "dg4v2kq", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Totally_Not_A_Moogle", "parent_id": "t3_64su00", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "His not being ready to say \"I love you\" most likely has absolutely nothing to do with you as a person. I've had people tell me they love me way before I was ready to say it back. He might be having a hard time investing himself in a relationship, especially if his last one ended poorly. \n\nI can understanding how this can be upsetting, but being angry with him, or forcing this issue is only going to harm your relationship. You should talk to him and let him know that you're okay with being at different stages, because you love him and you want him to be happy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;His not being ready to say &amp;quot;I love you&amp;quot; most likely has absolutely nothing to do with you as a person. I&amp;#39;ve had people tell me they love me way before I was ready to say it back. He might be having a hard time investing himself in a relationship, especially if his last one ended poorly. &lt;/p&gt;\n\n&lt;p&gt;I can understanding how this can be upsetting, but being angry with him, or forcing this issue is only going to harm your relationship. You should talk to him and let him know that you&amp;#39;re okay with being at different stages, because you love him and you want him to be happy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4v2kq", "score_hidden": false, "stickied": false, "created": 1491971049.0, "created_utc": 1491942249.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64su00", "likes": null, "replies": "", "user_reports": [], "id": "dg4v9jw", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "itslieutenantcolumbo", "parent_id": "t3_64su00", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "So one of the things they emphasize at therapy for a lot of conditions is not \"mind reading.\" You've \"figured out\" what's going on in his head, and decided his response isn't appropriate, which is upsetting. I can think of a few valid reasons he might not be ready to say it, but you've decided it must mean he doesn't like you the right way. \nIf everything else he does makes it seem like you're on the same page, keep trusting him and don't try to assume why he's not ready to say it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So one of the things they emphasize at therapy for a lot of conditions is not &amp;quot;mind reading.&amp;quot; You&amp;#39;ve &amp;quot;figured out&amp;quot; what&amp;#39;s going on in his head, and decided his response isn&amp;#39;t appropriate, which is upsetting. I can think of a few valid reasons he might not be ready to say it, but you&amp;#39;ve decided it must mean he doesn&amp;#39;t like you the right way. \nIf everything else he does makes it seem like you&amp;#39;re on the same page, keep trusting him and don&amp;#39;t try to assume why he&amp;#39;s not ready to say it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4v9jw", "score_hidden": false, "stickied": false, "created": 1491971266.0, "created_utc": 1491942466.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64su00", "likes": null, "replies": "", "user_reports": [], "id": "dg4wq1j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "decidedlyindecisive", "parent_id": "t3_64su00", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "If he's had his heart broken before it can be scary be vulnerable. If you're otherwise happy in the relationship then try to be patient. If he's showing his feelings then go by that rather than waiting for particular words, just like with abusers who say one thing and do the opposite, it's important to judge people by their actions. I understand that it hurts not to hear those words once you put them out there but it sounds like he's just wary. \n\nYou say that he only had bad things to say about his last relationship. Could it be that she was emotionally abusive? You're both still very young and it was probably a very formative relationship for him. If he was badly hurt then it makes sense that he's reticent. \n\nI had a real bastard of an ex, we broke each other's hearts I think, although it's possible he just broke mine. I'm two long term relationships past that but it's still fucking terrifying to allow myself to trust someone not to hurt me. Tell him how you feel, tell him when you feel love and tell him when you're hurt but be patient.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If he&amp;#39;s had his heart broken before it can be scary be vulnerable. If you&amp;#39;re otherwise happy in the relationship then try to be patient. If he&amp;#39;s showing his feelings then go by that rather than waiting for particular words, just like with abusers who say one thing and do the opposite, it&amp;#39;s important to judge people by their actions. I understand that it hurts not to hear those words once you put them out there but it sounds like he&amp;#39;s just wary. &lt;/p&gt;\n\n&lt;p&gt;You say that he only had bad things to say about his last relationship. Could it be that she was emotionally abusive? You&amp;#39;re both still very young and it was probably a very formative relationship for him. If he was badly hurt then it makes sense that he&amp;#39;s reticent. &lt;/p&gt;\n\n&lt;p&gt;I had a real bastard of an ex, we broke each other&amp;#39;s hearts I think, although it&amp;#39;s possible he just broke mine. I&amp;#39;m two long term relationships past that but it&amp;#39;s still fucking terrifying to allow myself to trust someone not to hurt me. Tell him how you feel, tell him when you feel love and tell him when you&amp;#39;re hurt but be patient.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4wq1j", "score_hidden": false, "stickied": false, "created": 1491972906.0, "created_utc": 1491944106.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64su00", "likes": null, "replies": "", "user_reports": [], "id": "dg5izll", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jennydancingaway", "parent_id": "t3_64su00", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "No don't feel about it. When someone's heart gets broken it takes time for them to be willing to let themselves become vulnerable again emotionally. He probably really does care about you and if you take it slow and easy he will say I love you soon", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No don&amp;#39;t feel about it. When someone&amp;#39;s heart gets broken it takes time for them to be willing to let themselves become vulnerable again emotionally. He probably really does care about you and if you take it slow and easy he will say I love you soon&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5izll", "score_hidden": false, "stickied": false, "created": 1492004031.0, "created_utc": 1491975231.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64su00", "likes": null, "replies": "", "user_reports": [], "id": "dg5s2h2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "uandtehbae", "parent_id": "t3_64su00", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Well if he dated someone for 2 years he knows not to say it after only 3 months.  You just need time,  I would suggest waiting for him to say it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well if he dated someone for 2 years he knows not to say it after only 3 months.  You just need time,  I would suggest waiting for him to say it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5s2h2", "score_hidden": false, "stickied": false, "created": 1492028168.0, "created_utc": 1491999368.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64su00", "likes": null, "replies": "", "user_reports": [], "id": "dgbbpni", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "subiegyal", "parent_id": "t3_64su00", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "People have different perspectives on love. I remember when I told my boyfriend I loved him earlier on in my relationship, and comparing it to now, I love him so much more, making myself ask if it was love before because it's so much now. The whole concept is relative, and he could feel the same way as you and not think that's the full type of love to be considered \"love\" in his eyes. It doesn't mean that he isn't invested in you in a deeper way. \n\nEspecially after being in a long term relationship he might see love as something else with a different view from the previous relationship. Doesn't mean he's hung up on his ex, but I'm just explaining that perspectives do vary.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People have different perspectives on love. I remember when I told my boyfriend I loved him earlier on in my relationship, and comparing it to now, I love him so much more, making myself ask if it was love before because it&amp;#39;s so much now. The whole concept is relative, and he could feel the same way as you and not think that&amp;#39;s the full type of love to be considered &amp;quot;love&amp;quot; in his eyes. It doesn&amp;#39;t mean that he isn&amp;#39;t invested in you in a deeper way. &lt;/p&gt;\n\n&lt;p&gt;Especially after being in a long term relationship he might see love as something else with a different view from the previous relationship. Doesn&amp;#39;t mean he&amp;#39;s hung up on his ex, but I&amp;#39;m just explaining that perspectives do vary.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgbbpni", "score_hidden": false, "stickied": false, "created": 1492326809.0, "created_utc": 1492298009.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]