[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/blushinggloom\"&gt;u/blushinggloom&lt;/a&gt;&amp;#39;s question about weight loss affecting the attention we receive made me think. \nI am 33. When I was younger and older men (father age and older) hit on me, I rightly considered them pervs and treated them as such. Now that I&amp;#39;m in my 30s it&amp;#39;s not like I look like a child, although I do look pretty young for my age. Still, I look grown up. No one is a pedo for being attracted to me as I look now and I get that. &lt;/p&gt;\n\n&lt;p&gt;However I still feel like a 50+ year old man hitting on me is gross. They were still an adult when I was a baby. It&amp;#39;s not that I blame them for being biologically attracted to younger (adult) women. I understand logically that that is why our species was able to reproduce enough in the past. But it makes me feel icky inside. I don&amp;#39;t like it. I don&amp;#39;t know why they would think I would be interested (I know some women are, not judging them). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never been good with unwanted attention from men because I get embarassed as it is. I am happily married and have been for a long time so I&amp;#39;m not looking either way. &lt;/p&gt;\n\n&lt;p&gt;Is this &amp;quot;normal&amp;quot;? I grew up without a father, so I don&amp;#39;t know if that plays into it. I also still feel very childlike in many ways. I don&amp;#39;t feel 33. Also, my mom was abused by men as a child and warned us about perverts from a young age (big understatement) so that probably makes it worse for me. But I can&amp;#39;t imagine many women like being hit on by men who could be their father. &lt;/p&gt;\n\n&lt;p&gt;Please clue me in to how other women feel about this or how they deal with it. Thank you in advance for your perspectives.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "u/blushinggloom's question about weight loss affecting the attention we receive made me think. \nI am 33. When I was younger and older men (father age and older) hit on me, I rightly considered them pervs and treated them as such. Now that I'm in my 30s it's not like I look like a child, although I do look pretty young for my age. Still, I look grown up. No one is a pedo for being attracted to me as I look now and I get that. \n\nHowever I still feel like a 50+ year old man hitting on me is gross. They were still an adult when I was a baby. It's not that I blame them for being biologically attracted to younger (adult) women. I understand logically that that is why our species was able to reproduce enough in the past. But it makes me feel icky inside. I don't like it. I don't know why they would think I would be interested (I know some women are, not judging them). \n\nI've never been good with unwanted attention from men because I get embarassed as it is. I am happily married and have been for a long time so I'm not looking either way. \n\nIs this \"normal\"? I grew up without a father, so I don't know if that plays into it. I also still feel very childlike in many ways. I don't feel 33. Also, my mom was abused by men as a child and warned us about perverts from a young age (big understatement) so that probably makes it worse for me. But I can't imagine many women like being hit on by men who could be their father. \n\nPlease clue me in to how other women feel about this or how they deal with it. Thank you in advance for your perspectives.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64tk4q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "hoobidabwah", "saved": false, "mod_reports": [], "name": "t3_64tk4q", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/64tk4q/how_do_you_deal_mentally_and_externally_with/", "num_reports": null, "locked": false, "stickied": false, "created": 1491971985.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/64tk4q/how_do_you_deal_mentally_and_externally_with/", "author_flair_text": null, "quarantine": false, "title": "How do you deal mentally and externally with attention from older men? (Possible trigger warning)", "created_utc": 1491943185.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": "", "user_reports": [], "id": "dg655qg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hoobidabwah", "parent_id": "t1_dg50f6a", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Thank you, you are absolutely right. If they are attracted they can keep it to themselves. I don't need to be dragged into it. I deserve more respect then that and should demand it like you do. Once someone disrespects me I don't need to worry about being polite anymore. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, you are absolutely right. If they are attracted they can keep it to themselves. I don&amp;#39;t need to be dragged into it. I deserve more respect then that and should demand it like you do. Once someone disrespects me I don&amp;#39;t need to worry about being polite anymore. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg655qg", "score_hidden": false, "stickied": false, "created": 1492044432.0, "created_utc": 1492015632.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg50f6a", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "aviderin", "parent_id": "t3_64tk4q", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I think that it is disgusting, and sometimes I hate going out in public because of it. I am 21, and adorable, in my innocence. \n\nLike you said, I can't blame them for their biology. But they do have a choice, whether they call me \"sweetie,\" or \"toots.\" That's past biology. As soon as an older man responds to me like that, I am no longer a sweetie. Any response that I have for them is terse, and straightforward. I try my hardest to communicate: I am talking to you to be polite, not because I want to.\n\nYeah.....I hate these kinds of situations. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that it is disgusting, and sometimes I hate going out in public because of it. I am 21, and adorable, in my innocence. &lt;/p&gt;\n\n&lt;p&gt;Like you said, I can&amp;#39;t blame them for their biology. But they do have a choice, whether they call me &amp;quot;sweetie,&amp;quot; or &amp;quot;toots.&amp;quot; That&amp;#39;s past biology. As soon as an older man responds to me like that, I am no longer a sweetie. Any response that I have for them is terse, and straightforward. I try my hardest to communicate: I am talking to you to be polite, not because I want to.&lt;/p&gt;\n\n&lt;p&gt;Yeah.....I hate these kinds of situations. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg50f6a", "score_hidden": false, "stickied": false, "created": 1491977373.0, "created_utc": 1491948573.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": "", "user_reports": [], "id": "dg6u00b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hoobidabwah", "parent_id": "t1_dg6c9wk", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "You are absolutely right. We didn't ask for boobs. It's bad enough to have to lug them around and protect them and deal with them making shirts fit weird but we certainly shouldn't have to deal with leers and creepy comments. We especially shouldn't have to be treated like we wanted those things because we have the nerve to walk around with our bodies! \n\nI'm totally going to wear my bikini this summer and also one of those cute exercise outfits I was afraid to wear for the same reasons. I am not going to even consider how what I wear is going to affect anyone else. They can save it. \n\nIf I could pass for 14 I would totally do that :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are absolutely right. We didn&amp;#39;t ask for boobs. It&amp;#39;s bad enough to have to lug them around and protect them and deal with them making shirts fit weird but we certainly shouldn&amp;#39;t have to deal with leers and creepy comments. We especially shouldn&amp;#39;t have to be treated like we wanted those things because we have the nerve to walk around with our bodies! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m totally going to wear my bikini this summer and also one of those cute exercise outfits I was afraid to wear for the same reasons. I am not going to even consider how what I wear is going to affect anyone else. They can save it. &lt;/p&gt;\n\n&lt;p&gt;If I could pass for 14 I would totally do that :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg6u00b", "score_hidden": false, "stickied": false, "created": 1492071898.0, "created_utc": 1492043098.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6c9wk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CRUSTYMELON", "parent_id": "t1_dg65ljn", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "It's honestly such a ridiculous thing that could easily be fixed by teaching young men to respect women instead of seeing them as meat. As a woman I can't help but have boobs, I didn't ask for them and I shouldn't be punished their existence. And the women in my family were also equally to blame. My mother would yell at me if I was wearing a vest top in front of my brothers - my brothers for fuck sake, I mean come on, to instill in a young woman that all men, even those related to her, can't control themselves if they see flesh is so beyond what I can comprehend. I'm still working out my issues about this too, and it sucks because I feel like I'm kind of in my prime now in my mid 20's but I can't wear certain things because of the way I'll be perceived. \nThanks for sharing too, and I think that you should totally rock a bikini at the beach this summer - Maybe if you feel too uncomfortable you could just get one of those sheer sort of beach dresses? So it's not like you're totally covering up and you've still got your bikini on and then if you get more comfy you can take it off.\nAnd yeah, it is creepy, at first I'd get shy and redfaced about it, now I'm better at telling people to leave me alone ha, I would love to just be like eww you're gross I'm like 14 years old you creep!! - Maybe next time haha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s honestly such a ridiculous thing that could easily be fixed by teaching young men to respect women instead of seeing them as meat. As a woman I can&amp;#39;t help but have boobs, I didn&amp;#39;t ask for them and I shouldn&amp;#39;t be punished their existence. And the women in my family were also equally to blame. My mother would yell at me if I was wearing a vest top in front of my brothers - my brothers for fuck sake, I mean come on, to instill in a young woman that all men, even those related to her, can&amp;#39;t control themselves if they see flesh is so beyond what I can comprehend. I&amp;#39;m still working out my issues about this too, and it sucks because I feel like I&amp;#39;m kind of in my prime now in my mid 20&amp;#39;s but I can&amp;#39;t wear certain things because of the way I&amp;#39;ll be perceived. \nThanks for sharing too, and I think that you should totally rock a bikini at the beach this summer - Maybe if you feel too uncomfortable you could just get one of those sheer sort of beach dresses? So it&amp;#39;s not like you&amp;#39;re totally covering up and you&amp;#39;ve still got your bikini on and then if you get more comfy you can take it off.\nAnd yeah, it is creepy, at first I&amp;#39;d get shy and redfaced about it, now I&amp;#39;m better at telling people to leave me alone ha, I would love to just be like eww you&amp;#39;re gross I&amp;#39;m like 14 years old you creep!! - Maybe next time haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg6c9wk", "score_hidden": false, "stickied": false, "created": 1492051667.0, "created_utc": 1492022867.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg65ljn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hoobidabwah", "parent_id": "t1_dg5obnh", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I was raised in a church that taught us a similar thing. I remember going to a church camp retreat in high school and they made us girls wear t shirts over our bikinis at the pool because it was our responsibility to not tempt the boys, who did not have to wear t shirts with their swim trunks. I'm still so angry at them for instilling that in 14 and 15 year old girls. To this day I feel uncomfortable in a bikini like I am showing too much, and I live in a beach town and love the beach. I think I am going to really work on that this summer and try to get passed that. Thanks for sharing. That truly is creepy that when you look younger more people hit on you. I'd love to be standing next to you and look disgusted and tell them you're 12 and see how they reacted. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was raised in a church that taught us a similar thing. I remember going to a church camp retreat in high school and they made us girls wear t shirts over our bikinis at the pool because it was our responsibility to not tempt the boys, who did not have to wear t shirts with their swim trunks. I&amp;#39;m still so angry at them for instilling that in 14 and 15 year old girls. To this day I feel uncomfortable in a bikini like I am showing too much, and I live in a beach town and love the beach. I think I am going to really work on that this summer and try to get passed that. Thanks for sharing. That truly is creepy that when you look younger more people hit on you. I&amp;#39;d love to be standing next to you and look disgusted and tell them you&amp;#39;re 12 and see how they reacted. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg65ljn", "score_hidden": false, "stickied": false, "created": 1492044891.0, "created_utc": 1492016091.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5obnh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "CRUSTYMELON", "parent_id": "t3_64tk4q", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I'm 25 and look about 18, I found it creepy when older men hit on me before and I still find it creepy now. Honestly whats worse is that I find the younger I look the more I get hit on! I have to put a fair amount of effort into looking around my age, but on days when I can't be bothered and I'm wearing no make-up etc. I look very young, and I get hit on far more, it's creepy on so many levels. \n\nAs other people have mentioned, I can't blame someone for feeling a certain kind of attraction, I can however blame them for how they choose to act on it. Men who think it's appropriate to talk to me like I'm a cutesy teenager or put their hands on me are just disgusting.\n\nI grew up in a culture that is extremely sexist and have constantly been told from the age of 12 or so when I hit puberty that if someone found me attractive it was my fault basically, so I had a lot of issues with this in the past that I'm still trying to work on. \nBut tl;dr, even though I look young that doesn't mean you can touch me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 25 and look about 18, I found it creepy when older men hit on me before and I still find it creepy now. Honestly whats worse is that I find the younger I look the more I get hit on! I have to put a fair amount of effort into looking around my age, but on days when I can&amp;#39;t be bothered and I&amp;#39;m wearing no make-up etc. I look very young, and I get hit on far more, it&amp;#39;s creepy on so many levels. &lt;/p&gt;\n\n&lt;p&gt;As other people have mentioned, I can&amp;#39;t blame someone for feeling a certain kind of attraction, I can however blame them for how they choose to act on it. Men who think it&amp;#39;s appropriate to talk to me like I&amp;#39;m a cutesy teenager or put their hands on me are just disgusting.&lt;/p&gt;\n\n&lt;p&gt;I grew up in a culture that is extremely sexist and have constantly been told from the age of 12 or so when I hit puberty that if someone found me attractive it was my fault basically, so I had a lot of issues with this in the past that I&amp;#39;m still trying to work on. \nBut tl;dr, even though I look young that doesn&amp;#39;t mean you can touch me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5obnh", "score_hidden": false, "stickied": false, "created": 1492018604.0, "created_utc": 1491989804.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": "", "user_reports": [], "id": "dg4vxcd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mentionhelper", "parent_id": "t3_64tk4q", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "It looks like you're trying to mention another user, which only works if it's done in the comments like this (otherwise they don't receive a notification): \n\n- u/blushinggloom\n\n\n\n---\n\n ^I'm ^a ^bot. ^Bleep. ^Bloop. ^| ^Visit ^/r/mentionhelper ^for ^discussion/feedback ^| ^Want ^to ^be ^left ^alone? ^Reply ^to ^this ^message ^with ^\"stop\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like you&amp;#39;re trying to mention another user, which only works if it&amp;#39;s done in the comments like this (otherwise they don&amp;#39;t receive a notification): &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"/u/blushinggloom\"&gt;u/blushinggloom&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;I&amp;#39;m&lt;/sup&gt; &lt;sup&gt;a&lt;/sup&gt; &lt;sup&gt;bot.&lt;/sup&gt; &lt;sup&gt;Bleep.&lt;/sup&gt; &lt;sup&gt;Bloop.&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;Visit&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"/r/mentionhelper\"&gt;/r/mentionhelper&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;for&lt;/sup&gt; &lt;sup&gt;discussion/feedback&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;Want&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;be&lt;/sup&gt; &lt;sup&gt;left&lt;/sup&gt; &lt;sup&gt;alone?&lt;/sup&gt; &lt;sup&gt;Reply&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;this&lt;/sup&gt; &lt;sup&gt;message&lt;/sup&gt; &lt;sup&gt;with&lt;/sup&gt; &lt;sup&gt;&amp;quot;stop&amp;quot;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4vxcd", "score_hidden": false, "stickied": false, "created": 1491972009.0, "created_utc": 1491943209.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": "", "user_reports": [], "id": "dg6qtiy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hoobidabwah", "parent_id": "t1_dg69vzl", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Yeah at least in my case I really don't worry that my husband won't be attracted to me if I went au naturale and I did think long and hard about why I do it and I do genuinely prefer it for me. \nHowever I think it's fabulous that you want to set that example because whether a girl chooses to take the natural route or to groom to whatever extent she prefers the important thing is that it is because she likes it personally. And that she doesn't feel she has to be a certain way to be accepted as good enough.  Of course our natural selves should be good enough no matter what. To me that's the default and I see it as a personal modification for my own comfort, similar to choosing to wear makeup or curl my hair. The little girls in my life who look up to me I hope know that since I sometimes wear makeup and or do my hair and sometimes don't and act like they are both normal. The best thing we can do is support younger women and other women in general :) Rock on with what you are doing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah at least in my case I really don&amp;#39;t worry that my husband won&amp;#39;t be attracted to me if I went au naturale and I did think long and hard about why I do it and I do genuinely prefer it for me. \nHowever I think it&amp;#39;s fabulous that you want to set that example because whether a girl chooses to take the natural route or to groom to whatever extent she prefers the important thing is that it is because she likes it personally. And that she doesn&amp;#39;t feel she has to be a certain way to be accepted as good enough.  Of course our natural selves should be good enough no matter what. To me that&amp;#39;s the default and I see it as a personal modification for my own comfort, similar to choosing to wear makeup or curl my hair. The little girls in my life who look up to me I hope know that since I sometimes wear makeup and or do my hair and sometimes don&amp;#39;t and act like they are both normal. The best thing we can do is support younger women and other women in general :) Rock on with what you are doing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg6qtiy", "score_hidden": false, "stickied": false, "created": 1492067971.0, "created_utc": 1492039171.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg69vzl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "greengreenbean", "parent_id": "t1_dg674g8", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I hear a lot of women say that it's their choice to shave or wax and that's fair. But for me, I realized the only reason I did it was to feel socially accepted and alluring to men. I actually prefer my legs soft and natural and know for certain that were it not a social expectation, it wouldn't occur to me that I needed to remove my body hair at all. Afterall, it doesn't obstruct my life in any way and actually keeps me healthy. The maintenance of a hairless facade has caused me enough pain, money and angst. I do believe that it adds to the infantilization of my gender as well. I try to present myself socially as I am naturally so that other women and young girls who feel afraid to take the plunge can feel supported to do it. I used to wish there were more older women doing this so I could have felt comfortable asserting myself this way a long time ago. I hope to support others now. :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hear a lot of women say that it&amp;#39;s their choice to shave or wax and that&amp;#39;s fair. But for me, I realized the only reason I did it was to feel socially accepted and alluring to men. I actually prefer my legs soft and natural and know for certain that were it not a social expectation, it wouldn&amp;#39;t occur to me that I needed to remove my body hair at all. Afterall, it doesn&amp;#39;t obstruct my life in any way and actually keeps me healthy. The maintenance of a hairless facade has caused me enough pain, money and angst. I do believe that it adds to the infantilization of my gender as well. I try to present myself socially as I am naturally so that other women and young girls who feel afraid to take the plunge can feel supported to do it. I used to wish there were more older women doing this so I could have felt comfortable asserting myself this way a long time ago. I hope to support others now. :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg69vzl", "score_hidden": false, "stickied": false, "created": 1492049229.0, "created_utc": 1492020429.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg674g8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hoobidabwah", "parent_id": "t1_dg5pi0e", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "That's really interesting. I definitely have had many men (I used to be a restaurant server) treat me like I was a naive little \"sweetheart\" and clearly liked thinking of me that way. At the very least it is patronizing. I grew up in the inner city and had to learn street smarts from a young age. I certainly am not naive or weak because I am a polite and friendly woman. \n\nThe barely legal stuff is so weird to me. In that case it is porn so (hopefully at least) the women consent to their images being ogled by whoever. But the targeting sexually of specifically \"barely legal\" does seem creepy to me. A 22 or 25 year old would not have any less fertility so shouldn't they be just as attractive? It does make you wonder why a man would specifically want as close to a child as he could have without going to jail. I'm not saying if an 18 year old who fully looked like an adult were walking down the street that a man is gross for thinking she was attractive. But if she had to be 18 to be attractive that's a different story and that genre of porn certainly highlights that. \n\nIf my husband, who is 34, was attracted to a 25 year old woman I wouldn't be grossed out, but if he had a preference for 18 or 19 year olds specifically I would. It seems predatory like you said. I had a lot of street smarts when I was that age but I was still a kid in a lot of ways and I can't imagine as a 33 year old woman being attracted to a kid that age or reducing them to a sex object. At 33 while I wouldn't treat them in a patronizing manner I certainly would still see them as a kid when it came to that kind of thing. \n\nI do like to remove body hair though, not to look like a kid but because I just like it. \n\nA man that needs to make a woman feel less powerful to feel more powerful himself is the weakest kind of man. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s really interesting. I definitely have had many men (I used to be a restaurant server) treat me like I was a naive little &amp;quot;sweetheart&amp;quot; and clearly liked thinking of me that way. At the very least it is patronizing. I grew up in the inner city and had to learn street smarts from a young age. I certainly am not naive or weak because I am a polite and friendly woman. &lt;/p&gt;\n\n&lt;p&gt;The barely legal stuff is so weird to me. In that case it is porn so (hopefully at least) the women consent to their images being ogled by whoever. But the targeting sexually of specifically &amp;quot;barely legal&amp;quot; does seem creepy to me. A 22 or 25 year old would not have any less fertility so shouldn&amp;#39;t they be just as attractive? It does make you wonder why a man would specifically want as close to a child as he could have without going to jail. I&amp;#39;m not saying if an 18 year old who fully looked like an adult were walking down the street that a man is gross for thinking she was attractive. But if she had to be 18 to be attractive that&amp;#39;s a different story and that genre of porn certainly highlights that. &lt;/p&gt;\n\n&lt;p&gt;If my husband, who is 34, was attracted to a 25 year old woman I wouldn&amp;#39;t be grossed out, but if he had a preference for 18 or 19 year olds specifically I would. It seems predatory like you said. I had a lot of street smarts when I was that age but I was still a kid in a lot of ways and I can&amp;#39;t imagine as a 33 year old woman being attracted to a kid that age or reducing them to a sex object. At 33 while I wouldn&amp;#39;t treat them in a patronizing manner I certainly would still see them as a kid when it came to that kind of thing. &lt;/p&gt;\n\n&lt;p&gt;I do like to remove body hair though, not to look like a kid but because I just like it. &lt;/p&gt;\n\n&lt;p&gt;A man that needs to make a woman feel less powerful to feel more powerful himself is the weakest kind of man. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg674g8", "score_hidden": false, "stickied": false, "created": 1492046443.0, "created_utc": 1492017643.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": "", "user_reports": [], "id": "dg6ct9c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CRUSTYMELON", "parent_id": "t1_dg5pi0e", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "With older generations I feel a lot of it has to do with inherent sexism in that in 'their' world, women are inferior and exist to please men. I know younger(ish) men who also kind of think like this, but I see it so much more with men in older generations. I work in healthcare and have noticed that regardless of the plethora of professions that exist within a hospital setting, to a certain type of older man (because it isn't all of them but certainly a fair amount) they will always call a young woman a nurse. And don't get me wrong I love and respect nurses and what they do, it's more just the mindset that I couldn't possibly be a doctor, or physical therapist, or pharmacist - I'm young and female, therefore nurse. \nI agree with you that a lot of men favour a dynamic where they are the more powerful person in the relationship, and I think men like that prey on younger woman because a more worldly woman, maybe closer to their age, is less likely to put up with their misogynistic bullshit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;With older generations I feel a lot of it has to do with inherent sexism in that in &amp;#39;their&amp;#39; world, women are inferior and exist to please men. I know younger(ish) men who also kind of think like this, but I see it so much more with men in older generations. I work in healthcare and have noticed that regardless of the plethora of professions that exist within a hospital setting, to a certain type of older man (because it isn&amp;#39;t all of them but certainly a fair amount) they will always call a young woman a nurse. And don&amp;#39;t get me wrong I love and respect nurses and what they do, it&amp;#39;s more just the mindset that I couldn&amp;#39;t possibly be a doctor, or physical therapist, or pharmacist - I&amp;#39;m young and female, therefore nurse. \nI agree with you that a lot of men favour a dynamic where they are the more powerful person in the relationship, and I think men like that prey on younger woman because a more worldly woman, maybe closer to their age, is less likely to put up with their misogynistic bullshit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg6ct9c", "score_hidden": false, "stickied": false, "created": 1492052229.0, "created_utc": 1492023429.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5pi0e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "greengreenbean", "parent_id": "t3_64tk4q", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Is it any surprise when the most popular genre of porn is \"teen\" or \"barely legal\"? Dudes have been wanting to stick it to younger women for most of their lives. They even get grown women to shave all of our hair off so we can look as young as possible. The illusion isn't complete if a woman shows signs that she's hit puberty. Also language. \"sweetheart\" and \"honey\" said to me as if I were a child. It's fucking disgusting. And the older a man is, the more I think it's all about power and manipulation than genuine desire. The less worldly a woman is, the better. It makes it easier for him to get away with things a woman his own age would know right away. We dismiss older women and their sexuality so easily and it has to do with men wanting to keep younger women in the dark, I think. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is it any surprise when the most popular genre of porn is &amp;quot;teen&amp;quot; or &amp;quot;barely legal&amp;quot;? Dudes have been wanting to stick it to younger women for most of their lives. They even get grown women to shave all of our hair off so we can look as young as possible. The illusion isn&amp;#39;t complete if a woman shows signs that she&amp;#39;s hit puberty. Also language. &amp;quot;sweetheart&amp;quot; and &amp;quot;honey&amp;quot; said to me as if I were a child. It&amp;#39;s fucking disgusting. And the older a man is, the more I think it&amp;#39;s all about power and manipulation than genuine desire. The less worldly a woman is, the better. It makes it easier for him to get away with things a woman his own age would know right away. We dismiss older women and their sexuality so easily and it has to do with men wanting to keep younger women in the dark, I think. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5pi0e", "score_hidden": false, "stickied": false, "created": 1492022205.0, "created_utc": 1491993405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": "", "user_reports": [], "id": "dg660ev", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PrincessCoPilot", "parent_id": "t3_64tk4q", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I didn't know until I was an adult either but my sister knew growing up. They protected me because I was the youngest. \n\nBut yes I have an anxiety disorder which is well treated with medication so it has lessened fortunately. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t know until I was an adult either but my sister knew growing up. They protected me because I was the youngest. &lt;/p&gt;\n\n&lt;p&gt;But yes I have an anxiety disorder which is well treated with medication so it has lessened fortunately. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg660ev", "score_hidden": false, "stickied": false, "created": 1492045316.0, "created_utc": 1492016516.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64tk4q", "likes": null, "replies": "", "user_reports": [], "id": "dg64y57", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hoobidabwah", "parent_id": "t1_dg4xvtm", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Sounds like you can really relate. Thank you for sharing. I grew up not knowing why my mom was so paranoid. I knew there were creepos but thought she was way overreacting. When I was an adult and  learned what happened to her and also learned just how many creeps there are out there, it was very confusing because while I think she was perhaps overly cautious she did have her reasons and experience causing that fear. It's hard to know how to approach it myself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you can really relate. Thank you for sharing. I grew up not knowing why my mom was so paranoid. I knew there were creepos but thought she was way overreacting. When I was an adult and  learned what happened to her and also learned just how many creeps there are out there, it was very confusing because while I think she was perhaps overly cautious she did have her reasons and experience causing that fear. It&amp;#39;s hard to know how to approach it myself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg64y57", "score_hidden": false, "stickied": false, "created": 1492044212.0, "created_utc": 1492015412.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4xvtm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PrincessCoPilot", "parent_id": "t3_64tk4q", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Same for me. I'm 27 and my mom was abused too and warned me. I've always been weary of men and I have an anxiety disorder linked to the fear of sexual assault despite the fact that I've never been assaulted (well I have technically but that was guilt driven coercion not forced and I was an adult by then and my anxiety is of forced assault). I am 300+ lbs and I think I gained the weight to get men to stop being attracted to me so I can avoid being hit on. I really really hate it and it's not only older men but it is much more triggering if it is an older man. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same for me. I&amp;#39;m 27 and my mom was abused too and warned me. I&amp;#39;ve always been weary of men and I have an anxiety disorder linked to the fear of sexual assault despite the fact that I&amp;#39;ve never been assaulted (well I have technically but that was guilt driven coercion not forced and I was an adult by then and my anxiety is of forced assault). I am 300+ lbs and I think I gained the weight to get men to stop being attracted to me so I can avoid being hit on. I really really hate it and it&amp;#39;s not only older men but it is much more triggering if it is an older man. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg4xvtm", "score_hidden": false, "stickied": false, "created": 1491974277.0, "created_utc": 1491945477.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]