[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have about 0 experience with guys (other than makeouts at college parties and such) so please bear with me! I&amp;#39;m a 19 year old college student. Sorry this story is long but I feel like details are important!&lt;/p&gt;\n\n&lt;p&gt;This past Saturday one of my guy friends (lets call him Michael) had his friend from home visit our college because my roommates and I were throwing a party. His friend goes to a nearby school and is my age. I&amp;#39;m gonna call him &amp;quot;Peter&amp;quot;. So Michael is my friend at college, and Peter is Michael&amp;#39;s friend that goes to another college nearby.&lt;/p&gt;\n\n&lt;p&gt;So Peter and I begin talking as the party is dying down, and eventually everyone leaves and it&amp;#39;s just us talking for like 15-20 minutes on my common room couch. We start to kiss and eventually go to my bedroom. We made out, I gave him a handjob and he fingered me, nothing more. I was pretty drunk (he was drunk too) and I guess I just fell asleep at some point, but I wasn&amp;#39;t blacked out or anything. The next morning I woke up and he was asleep with his arm around me. I felt kind of uncomfortable because this is only the second time I&amp;#39;ve done anything sexual with a guy, so I went and put on pajamas and got back in bed. It was 7 am and he was awake. We actually talked until 10:30am, falling asleep intermittently. We talked about the most random stuff; college life, friends, family, traveling, etc. I&amp;#39;ve never really just talked to a guy like that for so long and felt like they were actually interested in what I had to say. We weren&amp;#39;t cuddling after we woke up or anything but he stayed in my bed for a few hours talking so I feel like that means something. He got up to leave at 10:30, and it was kinda awkward just cause I was still lying in bed and he was standing at the foot of the bed. He was just like &amp;quot;it was nice to meet you&amp;quot; and &amp;quot;this was fun&amp;quot; or something like that. We both kind of just laughed, because, just because what does one really say after hooking up with someone they met last night.&lt;/p&gt;\n\n&lt;p&gt;Anyway, that afternoon, as a joke, my friend Michael wrote me a note pretending to be Peter, being like &amp;quot;I had the time of my life last night&amp;quot; and left me Peter actual number. Michael is pretty immature and keeps making jokes like &amp;quot;did you text him yet?&amp;quot; but I feel awkward actually talking to Michael about it since he will just make jokes about it. &lt;/p&gt;\n\n&lt;p&gt;to be honest, I really like spending time with him! but i feel so awkward texting him because I honestly never text guys I like and because Peter didn&amp;#39;t actually give me his number, nor did he ask for mine. He wasn&amp;#39;t cocky or anything but wasn&amp;#39;t super shy either, just a normal nice guy. i also know for a fact he didn&amp;#39;t tell Michael to give me his number, Michael just did that as a joke by himself. I&amp;#39;m also anxious about bringing it up seriously to Michael, because I&amp;#39;m scared he&amp;#39;s gonna tell me something I dont want to hear, such as Peter isn&amp;#39;t insterested, or something like that. This all stems from my complete lack of guy experience &lt;/p&gt;\n\n&lt;p&gt;What should I do? Even if i did text him i would feel creepy doing it. This semester is ending in mid-may and then I&amp;#39;ll be staying on the east coast for the summer and Peter will be going home to the west coast, so that&amp;#39;s a barrier. Logistically we could get together even next fall semester since we&amp;#39;ll be near each other at college, but idk if that&amp;#39;s worth it. I just can&amp;#39;t stop thinking about him&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have about 0 experience with guys (other than makeouts at college parties and such) so please bear with me! I'm a 19 year old college student. Sorry this story is long but I feel like details are important!\n\nThis past Saturday one of my guy friends (lets call him Michael) had his friend from home visit our college because my roommates and I were throwing a party. His friend goes to a nearby school and is my age. I'm gonna call him \"Peter\". So Michael is my friend at college, and Peter is Michael's friend that goes to another college nearby.\n\nSo Peter and I begin talking as the party is dying down, and eventually everyone leaves and it's just us talking for like 15-20 minutes on my common room couch. We start to kiss and eventually go to my bedroom. We made out, I gave him a handjob and he fingered me, nothing more. I was pretty drunk (he was drunk too) and I guess I just fell asleep at some point, but I wasn't blacked out or anything. The next morning I woke up and he was asleep with his arm around me. I felt kind of uncomfortable because this is only the second time I've done anything sexual with a guy, so I went and put on pajamas and got back in bed. It was 7 am and he was awake. We actually talked until 10:30am, falling asleep intermittently. We talked about the most random stuff; college life, friends, family, traveling, etc. I've never really just talked to a guy like that for so long and felt like they were actually interested in what I had to say. We weren't cuddling after we woke up or anything but he stayed in my bed for a few hours talking so I feel like that means something. He got up to leave at 10:30, and it was kinda awkward just cause I was still lying in bed and he was standing at the foot of the bed. He was just like \"it was nice to meet you\" and \"this was fun\" or something like that. We both kind of just laughed, because, just because what does one really say after hooking up with someone they met last night.\n\nAnyway, that afternoon, as a joke, my friend Michael wrote me a note pretending to be Peter, being like \"I had the time of my life last night\" and left me Peter actual number. Michael is pretty immature and keeps making jokes like \"did you text him yet?\" but I feel awkward actually talking to Michael about it since he will just make jokes about it. \n\nto be honest, I really like spending time with him! but i feel so awkward texting him because I honestly never text guys I like and because Peter didn't actually give me his number, nor did he ask for mine. He wasn't cocky or anything but wasn't super shy either, just a normal nice guy. i also know for a fact he didn't tell Michael to give me his number, Michael just did that as a joke by himself. I'm also anxious about bringing it up seriously to Michael, because I'm scared he's gonna tell me something I dont want to hear, such as Peter isn't insterested, or something like that. This all stems from my complete lack of guy experience \n\nWhat should I do? Even if i did text him i would feel creepy doing it. This semester is ending in mid-may and then I'll be staying on the east coast for the summer and Peter will be going home to the west coast, so that's a barrier. Logistically we could get together even next fall semester since we'll be near each other at college, but idk if that's worth it. I just can't stop thinking about him", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64vkgt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "6263sep", "saved": false, "mod_reports": [], "name": "t3_64vkgt", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": 1492002056.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/64vkgt/guyhook_up_advice_for_a_19_year_old_girl/", "num_reports": null, "locked": false, "stickied": false, "created": 1491993812.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/64vkgt/guyhook_up_advice_for_a_19_year_old_girl/", "author_flair_text": null, "quarantine": false, "title": "Guy/hook up advice for a 19 year old girl!", "created_utc": 1491965012.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64vkgt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64vkgt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64vkgt", "likes": null, "replies": "", "user_reports": [], "id": "dg640e1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Diffog", "parent_id": "t1_dg5zfn6", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "That's the easy part! I'll write it for you :)\n\n\"Hi Peter, it's /u/6263sep! I had a lot of fun with you last night, and I really enjoyed chatting with you in the morning :) I'd love to see you again... would you like to grab a coffee tomorrow after class?\"\n\n&gt;Even if i did text him i would feel creepy doing it.\n\nDo not worry. It will be like pretty much the opposite of creepy - it will be cute and it will make him smile to know that a cute girl likes him, *even if* he doesn't want to date you.\n\n&gt;This semester is ending in mid-may and then I'll be staying on the east coast for the summer and Peter will be going home to the west coast, so that's a barrier. Logistically we could get together even next fall semester since we'll be near each other at college, but idk if that's worth it.\n\nYes!! Worth it! A summer apart is no barrier at all if it turns out you like each other.\n\nPlease text him and let me know the reply :)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the easy part! I&amp;#39;ll write it for you :)&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hi Peter, it&amp;#39;s &lt;a href=\"/u/6263sep\"&gt;/u/6263sep&lt;/a&gt;! I had a lot of fun with you last night, and I really enjoyed chatting with you in the morning :) I&amp;#39;d love to see you again... would you like to grab a coffee tomorrow after class?&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Even if i did text him i would feel creepy doing it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do not worry. It will be like pretty much the opposite of creepy - it will be cute and it will make him smile to know that a cute girl likes him, &lt;em&gt;even if&lt;/em&gt; he doesn&amp;#39;t want to date you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This semester is ending in mid-may and then I&amp;#39;ll be staying on the east coast for the summer and Peter will be going home to the west coast, so that&amp;#39;s a barrier. Logistically we could get together even next fall semester since we&amp;#39;ll be near each other at college, but idk if that&amp;#39;s worth it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes!! Worth it! A summer apart is no barrier at all if it turns out you like each other.&lt;/p&gt;\n\n&lt;p&gt;Please text him and let me know the reply :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg640e1", "score_hidden": false, "stickied": false, "created": 1492043240.0, "created_utc": 1492014440.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zfn6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "6263sep", "parent_id": "t1_dg5y1c3", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "agh and say what? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;agh and say what? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5zfn6", "score_hidden": false, "stickied": false, "created": 1492038260.0, "created_utc": 1492009460.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5y1c3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Diffog", "parent_id": "t3_64vkgt", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Are you crazy?? Text him! No harm can come from it - just because he didn't leave his number doesn't mean he's not interested. The worst thing that could happen is rejection, which is still a great outcome because it lets you move on.\n\nAlso, if Michael is Peter's friend and he gave you Peter's number - he probably talked to Peter about it beforehand, or at least knows enough to think that Peter would appreciate a text from you.\n\nGo for it girl!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you crazy?? Text him! No harm can come from it - just because he didn&amp;#39;t leave his number doesn&amp;#39;t mean he&amp;#39;s not interested. The worst thing that could happen is rejection, which is still a great outcome because it lets you move on.&lt;/p&gt;\n\n&lt;p&gt;Also, if Michael is Peter&amp;#39;s friend and he gave you Peter&amp;#39;s number - he probably talked to Peter about it beforehand, or at least knows enough to think that Peter would appreciate a text from you.&lt;/p&gt;\n\n&lt;p&gt;Go for it girl!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5y1c3", "score_hidden": false, "stickied": false, "created": 1492036668.0, "created_utc": 1492007868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64vkgt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64vkgt", "likes": null, "replies": "", "user_reports": [], "id": "dg5srjf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "6263sep", "parent_id": "t1_dg5mnr8", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": ":( i guess", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:( i guess&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5srjf", "score_hidden": false, "stickied": false, "created": 1492029412.0, "created_utc": 1492000612.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mnr8", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "mariesoleil", "parent_id": "t3_64vkgt", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "If he wanted you to have his number, he would have given it to you, right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If he wanted you to have his number, he would have given it to you, right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg5mnr8", "score_hidden": false, "stickied": false, "created": 1492013364.0, "created_utc": 1491984564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]