[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m interested in hearing about some of your experiences with this as well as any tips or advice. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm interested in hearing about some of your experiences with this as well as any tips or advice. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64yfwk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "flowergirlnextdoor", "saved": false, "mod_reports": [], "name": "t3_64yfwk", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/64yfwk/approaching_a_guymaking_the_first_move/", "num_reports": null, "locked": false, "stickied": false, "created": 1492035729.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/64yfwk/approaching_a_guymaking_the_first_move/", "author_flair_text": null, "quarantine": false, "title": "Approaching a guy/making the first move?", "created_utc": 1492006929.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64yfwk", "likes": null, "replies": "", "user_reports": [], "id": "dg7d6q6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "akanachan", "parent_id": "t3_64yfwk", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "1. Think of what you have to offer -- are you fun to be around, are you talented at something? Good looks alone can only carry through for casual hookups, so don't rely on it for a happy long term relationship, If you think you have nothing to offer, then the outcome of making the first move is going to be bleak, and you should improve yourself first, before making that first move. Knowing that you bring much to the table will also give you a strong boost of confidence.\n\n2. Be prepared for rejection. Rejection always hurts, but it will hurt a lot less if you've accepted that it's a possible outcome beforehand.  Remember that it's not about you, if you get rejected. There's always someone for everyone. Sometimes it's just stupidly hard to find the right person for you, but that just means you will appreciate them so much when you finally find them (this is just my experience. I know it sounds stupid).\n\n3. Keep the first move short and sweet. Give the person some time to process your interest. The point of the first move is to express your interest and let them decide if the interest is mutual. Don't expect them to commit to a relationship there and then :p\n\n---\n\nWhen I make the first move, I usually do silly lines like \"You look like boyfriend material to me\". It's all in the delivery. I deliver cheesy lines and get on with my life. If they're interested, they continue the conversation with me.", "edited": 1492077967.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Think of what you have to offer -- are you fun to be around, are you talented at something? Good looks alone can only carry through for casual hookups, so don&amp;#39;t rely on it for a happy long term relationship, If you think you have nothing to offer, then the outcome of making the first move is going to be bleak, and you should improve yourself first, before making that first move. Knowing that you bring much to the table will also give you a strong boost of confidence.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Be prepared for rejection. Rejection always hurts, but it will hurt a lot less if you&amp;#39;ve accepted that it&amp;#39;s a possible outcome beforehand.  Remember that it&amp;#39;s not about you, if you get rejected. There&amp;#39;s always someone for everyone. Sometimes it&amp;#39;s just stupidly hard to find the right person for you, but that just means you will appreciate them so much when you finally find them (this is just my experience. I know it sounds stupid).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Keep the first move short and sweet. Give the person some time to process your interest. The point of the first move is to express your interest and let them decide if the interest is mutual. Don&amp;#39;t expect them to commit to a relationship there and then :p&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;When I make the first move, I usually do silly lines like &amp;quot;You look like boyfriend material to me&amp;quot;. It&amp;#39;s all in the delivery. I deliver cheesy lines and get on with my life. If they&amp;#39;re interested, they continue the conversation with me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg7d6q6", "score_hidden": false, "stickied": false, "created": 1492106345.0, "created_utc": 1492077545.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_64yfwk", "likes": null, "replies": "", "user_reports": [], "id": "dg6d6bf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "InvoluntaryEyeroll", "parent_id": "t3_64yfwk", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Honestly it seems to be mostly about practice.  It feels terrifying and daunting at first, but just try doing it for the sake of practice and it gets way way easier.  \n\nI'm no expert, but I usually warm up to it a bit by just sitting closer and comfortably with them.  Rub their shoulders or something, who knows, it depends on the situation.  I just like to gauge how they respond to simple touch.  Then if that's going well and they seem to be into it, just wait for a lull in the conversation and make a move.  It's worked great for me.  \n\nAlways helps to remember that awkwardness never killed anyone.  A killer kiss is totally worth the risk of a few minutes of self-conscious overthinking or awkward conversation beforehand.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly it seems to be mostly about practice.  It feels terrifying and daunting at first, but just try doing it for the sake of practice and it gets way way easier.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m no expert, but I usually warm up to it a bit by just sitting closer and comfortably with them.  Rub their shoulders or something, who knows, it depends on the situation.  I just like to gauge how they respond to simple touch.  Then if that&amp;#39;s going well and they seem to be into it, just wait for a lull in the conversation and make a move.  It&amp;#39;s worked great for me.  &lt;/p&gt;\n\n&lt;p&gt;Always helps to remember that awkwardness never killed anyone.  A killer kiss is totally worth the risk of a few minutes of self-conscious overthinking or awkward conversation beforehand.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg6d6bf", "score_hidden": false, "stickied": false, "created": 1492052607.0, "created_utc": 1492023807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]