[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I guess I can start with my sexual history kinda. I&amp;#39;m 19 years old and had sex for the first time when I was 16. I continued having sex (not very often but often enough while in a relationship for maybe 6 months) with no problems, maybe 1 or 2 yeast infections until this past October. I had started dating the guy I&amp;#39;m with now. \nFor the first 2 months or so, nothing seemed wrong and I had been having THE BEST sex of my LIFE. I swear. I had never orgasmed like that, wanted to have sex all the freaking time, or knew that pleasure was possible. It was heaven. but then I started getting really bad bacterial infections and uti like symptoms. I went to planned parenthood several times, probably at least 5, to get antibiotics and of course screened for every std or infections (My bf has been tested many times and is extremely clean and has been told by a dr that it&amp;#39;s not from him). I do not have insurance and have been trying to get on a plan for months and months but can&amp;#39;t get help. \nThe last time (maybe 2 months ago) I went to get tested for any bacteria as it burns when I pee, hurts to have sex, feels like I have to pee all the time when my bladder is empty or not, cramping, and sharp pains in vulva and in many places inside of my vagina. The test results came back negative and they tell me I should have nothing wrong with me. I&amp;#39;ve been on probiotics, tried cutting out alcohol and acidic foods... Basically everything under the sun. My poor bf is the most supportive and loving and sweetest person on the planet and never makes me feel bad about not being able to have sex, but it&amp;#39;s started to weigh on me and make me hate my body/myself. I beat myself up and I don&amp;#39;t know how to fix this or what&amp;#39;s going on. I don&amp;#39;t even want to work out or be healthy, I&amp;#39;m letting my body turn to shit which makes me super depressed and disappointed in myself. \nI&amp;#39;m sorry if this is super long or in the wrong sub, but I don&amp;#39;t know where else to go or what to do. I hope there&amp;#39;s just someone out there that maybe has experienced anything of this sort and has some help. I don&amp;#39;t know how I can deal with this anymore.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I guess I can start with my sexual history kinda. I'm 19 years old and had sex for the first time when I was 16. I continued having sex (not very often but often enough while in a relationship for maybe 6 months) with no problems, maybe 1 or 2 yeast infections until this past October. I had started dating the guy I'm with now. \nFor the first 2 months or so, nothing seemed wrong and I had been having THE BEST sex of my LIFE. I swear. I had never orgasmed like that, wanted to have sex all the freaking time, or knew that pleasure was possible. It was heaven. but then I started getting really bad bacterial infections and uti like symptoms. I went to planned parenthood several times, probably at least 5, to get antibiotics and of course screened for every std or infections (My bf has been tested many times and is extremely clean and has been told by a dr that it's not from him). I do not have insurance and have been trying to get on a plan for months and months but can't get help. \nThe last time (maybe 2 months ago) I went to get tested for any bacteria as it burns when I pee, hurts to have sex, feels like I have to pee all the time when my bladder is empty or not, cramping, and sharp pains in vulva and in many places inside of my vagina. The test results came back negative and they tell me I should have nothing wrong with me. I've been on probiotics, tried cutting out alcohol and acidic foods... Basically everything under the sun. My poor bf is the most supportive and loving and sweetest person on the planet and never makes me feel bad about not being able to have sex, but it's started to weigh on me and make me hate my body/myself. I beat myself up and I don't know how to fix this or what's going on. I don't even want to work out or be healthy, I'm letting my body turn to shit which makes me super depressed and disappointed in myself. \nI'm sorry if this is super long or in the wrong sub, but I don't know where else to go or what to do. I hope there's just someone out there that maybe has experienced anything of this sort and has some help. I don't know how I can deal with this anymore.  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65b76x", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 32, "report_reasons": null, "author": "elyselaurenne", "saved": false, "mod_reports": [], "name": "t3_65b76x", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/65b76x/almost_8_months_of_continuing_vulva_and_urinary/", "num_reports": null, "locked": false, "stickied": false, "created": 1492183374.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/65b76x/almost_8_months_of_continuing_vulva_and_urinary/", "author_flair_text": null, "quarantine": false, "title": "Almost 8 months of continuing vulva and urinary tract pain and nothing is helping, I'm getting depressed.", "created_utc": 1492154574.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": "", "user_reports": [], "id": "dg9hu5y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "doodledeedoo3", "parent_id": "t1_dg9hmha", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Thanks for sharing this! I am already on an anti inflammatory diet (no dairy, wheat, soy, refined sugar, corn) but I think citrus may be my culprit! I've been doing lots of smoothies lately with foods that are on the caution list.. thanks so much for the info!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for sharing this! I am already on an anti inflammatory diet (no dairy, wheat, soy, refined sugar, corn) but I think citrus may be my culprit! I&amp;#39;ve been doing lots of smoothies lately with foods that are on the caution list.. thanks so much for the info!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg9hu5y", "score_hidden": false, "stickied": false, "created": 1492221580.0, "created_utc": 1492192780.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9hmha", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thatwriterkid", "parent_id": "t1_dg9bya9", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "It's mostly diet-related. No citrus, no soda, no alcohol are the big ones. [The IC Diet](http://www.ic-diet.com/IC-diet-food-list.html) is a pretty good starting point, but everyone's triggers can vary. I can indulge in a beer or a coke every now and again, I just have to know I'll be hurting for bit. There's also the usual advice for when you're dealing with vag issues - cotton undies, letting the area breathe (sleeping naked), cleaning with just water and no soap. \nThose few things have made a world of difference for me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s mostly diet-related. No citrus, no soda, no alcohol are the big ones. &lt;a href=\"http://www.ic-diet.com/IC-diet-food-list.html\"&gt;The IC Diet&lt;/a&gt; is a pretty good starting point, but everyone&amp;#39;s triggers can vary. I can indulge in a beer or a coke every now and again, I just have to know I&amp;#39;ll be hurting for bit. There&amp;#39;s also the usual advice for when you&amp;#39;re dealing with vag issues - cotton undies, letting the area breathe (sleeping naked), cleaning with just water and no soap. \nThose few things have made a world of difference for me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg9hmha", "score_hidden": false, "stickied": false, "created": 1492221333.0, "created_utc": 1492192533.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9bya9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "doodledeedoo3", "parent_id": "t1_dg94ezg", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I was going to suggest IC as well. If you don't mind me asking, what was your treatment plan? I am fairly certain I have IC. I recently had surgery for endometriosis and have had a lot of improvement, except for my IC symptoms.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was going to suggest IC as well. If you don&amp;#39;t mind me asking, what was your treatment plan? I am fairly certain I have IC. I recently had surgery for endometriosis and have had a lot of improvement, except for my IC symptoms.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg9bya9", "score_hidden": false, "stickied": false, "created": 1492214899.0, "created_utc": 1492186099.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg94ezg", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "thatwriterkid", "parent_id": "t3_65b76x", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Sounds like it's time to see a specialist.\nA urologist would be much more versed in the not so obvious causes of your symptoms. \n\nI am not a doctor, and neither is the internet, but here's my anecdotal suggestion: \n\nI went through a similar situation three years ago with my now husband. Amazing sex all the freakin' time, and then I got what I thought was a UTI. Cue a round of antibiotics. Then another one a week later. Stronger antibiotics. Then a yeast infection from the antibiotics, then a third round of antibiotics, and the UTI symptoms never went away - full bladder feeling with nothing coming out, burning when I peed, pain during sex, pain after sex... it was miserable. I had been going to walk-in clinics and finally decided I needed to see a urologist, which it sounds like you need to do. After several tests and several visits, he diagnosed me with interstitial cystitis by process of elimination. \n\nIt's an autoimmune condition that is often triggered by a UTI, and causes continued UTI symptoms without the infection. It's usually one of those things that's diagnosed by ruling out everything else, but there is a procedure that can test for and possibly alleviate it for a while. \n\nAll the symptoms fit, and I couldn't afford the procedure to test for it, but I followed a treatment plan which definitely helped. I still have flare-ups now and again, but nothing like those first few months of antibiotic craziness and misery. \n\nAll that to say, get to a doctor. Yes, it may be expensive, yes it's a total pain, but there may be a different cause with a hopefully simple solution, and you won't know until you go. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like it&amp;#39;s time to see a specialist.\nA urologist would be much more versed in the not so obvious causes of your symptoms. &lt;/p&gt;\n\n&lt;p&gt;I am not a doctor, and neither is the internet, but here&amp;#39;s my anecdotal suggestion: &lt;/p&gt;\n\n&lt;p&gt;I went through a similar situation three years ago with my now husband. Amazing sex all the freakin&amp;#39; time, and then I got what I thought was a UTI. Cue a round of antibiotics. Then another one a week later. Stronger antibiotics. Then a yeast infection from the antibiotics, then a third round of antibiotics, and the UTI symptoms never went away - full bladder feeling with nothing coming out, burning when I peed, pain during sex, pain after sex... it was miserable. I had been going to walk-in clinics and finally decided I needed to see a urologist, which it sounds like you need to do. After several tests and several visits, he diagnosed me with interstitial cystitis by process of elimination. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s an autoimmune condition that is often triggered by a UTI, and causes continued UTI symptoms without the infection. It&amp;#39;s usually one of those things that&amp;#39;s diagnosed by ruling out everything else, but there is a procedure that can test for and possibly alleviate it for a while. &lt;/p&gt;\n\n&lt;p&gt;All the symptoms fit, and I couldn&amp;#39;t afford the procedure to test for it, but I followed a treatment plan which definitely helped. I still have flare-ups now and again, but nothing like those first few months of antibiotic craziness and misery. &lt;/p&gt;\n\n&lt;p&gt;All that to say, get to a doctor. Yes, it may be expensive, yes it&amp;#39;s a total pain, but there may be a different cause with a hopefully simple solution, and you won&amp;#39;t know until you go. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg94ezg", "score_hidden": false, "stickied": false, "created": 1492205205.0, "created_utc": 1492176405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": "", "user_reports": [], "id": "dg9fe4x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PBRidesAgain", "parent_id": "t1_dg9coh0", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "It can make it worse for the 2-3 times because your body is trying to correct the extreme ph imbalance. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It can make it worse for the 2-3 times because your body is trying to correct the extreme ph imbalance. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg9fe4x", "score_hidden": false, "stickied": false, "created": 1492218746.0, "created_utc": 1492189946.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9coh0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "GalacticaViper", "parent_id": "t1_dg90t6u", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "This should really help! The one time i tried, baking soda seemed to irritate it more, so i switched to a garlic clove in warm water. But i know a few people that take fairly regular baking soda immersion baths. \n\nI also switched all my underwear to cotton only.\nAnother tip besides condoms is to pee and clean yourself right after if you have sex.\n\nMaybe give it a try!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This should really help! The one time i tried, baking soda seemed to irritate it more, so i switched to a garlic clove in warm water. But i know a few people that take fairly regular baking soda immersion baths. &lt;/p&gt;\n\n&lt;p&gt;I also switched all my underwear to cotton only.\nAnother tip besides condoms is to pee and clean yourself right after if you have sex.&lt;/p&gt;\n\n&lt;p&gt;Maybe give it a try!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg9coh0", "score_hidden": false, "stickied": false, "created": 1492215688.0, "created_utc": 1492186888.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": "", "user_reports": [], "id": "dgb8gav", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MultipleColoredChloe", "parent_id": "t1_dg90t6u", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "All of this AND consider switching to a menstrual cup. I had troubles with constant irritation and burning after my period week. Switched to a Diva cup from cotton/synthetic pads and tampons and the problem has been solved. Make sure to sanitize the cup after every cycle, and to clean with hot water and gentle scentless soap each time you empty it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All of this AND consider switching to a menstrual cup. I had troubles with constant irritation and burning after my period week. Switched to a Diva cup from cotton/synthetic pads and tampons and the problem has been solved. Make sure to sanitize the cup after every cycle, and to clean with hot water and gentle scentless soap each time you empty it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgb8gav", "score_hidden": false, "stickied": false, "created": 1492322098.0, "created_utc": 1492293298.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90t6u", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "PBRidesAgain", "parent_id": "t3_65b76x", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Cyclical vaginosis,  pops negative for everything but has all the same symptoms. Cure is literally take a bath with baking soda. Put an inch of warm water in a (clean) bathtub. Pour baking soda in and sit in it rinsing the exterior genitalia gently. \n\nMay have to do this a couple of times and can rebound worse. May cause yeast infection. \n\n\nIf you have a \"sanitize\" cycle on your washing machine use that on all your undies/leggings/yoga pants. If not BOIL THEM. \n\nMake sure you only wear 100% cotton underwear and use condoms until your natural body pH is reestablished. \n\n\nFor 4 days a month I used to get like this (post ovulation, pre period) and its the worst.  &lt;3  \n\n\nEdit: also see a dr if it doesn't work. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cyclical vaginosis,  pops negative for everything but has all the same symptoms. Cure is literally take a bath with baking soda. Put an inch of warm water in a (clean) bathtub. Pour baking soda in and sit in it rinsing the exterior genitalia gently. &lt;/p&gt;\n\n&lt;p&gt;May have to do this a couple of times and can rebound worse. May cause yeast infection. &lt;/p&gt;\n\n&lt;p&gt;If you have a &amp;quot;sanitize&amp;quot; cycle on your washing machine use that on all your undies/leggings/yoga pants. If not BOIL THEM. &lt;/p&gt;\n\n&lt;p&gt;Make sure you only wear 100% cotton underwear and use condoms until your natural body pH is reestablished. &lt;/p&gt;\n\n&lt;p&gt;For 4 days a month I used to get like this (post ovulation, pre period) and its the worst.  &amp;lt;3  &lt;/p&gt;\n\n&lt;p&gt;Edit: also see a dr if it doesn&amp;#39;t work. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg90t6u", "score_hidden": false, "stickied": false, "created": 1492197942.0, "created_utc": 1492169142.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": "", "user_reports": [], "id": "dga36dx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "elyselaurenne", "parent_id": "t1_dg8yq7l", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I did switch to a new birth control, so I went off of it for a month to see if anything changed and nope it's been the same. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did switch to a new birth control, so I went off of it for a month to see if anything changed and nope it&amp;#39;s been the same. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dga36dx", "score_hidden": false, "stickied": false, "created": 1492248761.0, "created_utc": 1492219961.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8yq7l", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "fayeinwien", "parent_id": "t3_65b76x", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Any other major changes when you started seeing this guy? New birth control, different condoms, etc? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Any other major changes when you started seeing this guy? New birth control, different condoms, etc? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg8yq7l", "score_hidden": false, "stickied": false, "created": 1492191514.0, "created_utc": 1492162714.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": "", "user_reports": [], "id": "dga304a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "elyselaurenne", "parent_id": "t1_dg9gq0y", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I applied for Medicaid almost a year ago and have no primary care doctor. I've gone into the office, called every line, tried to get help but it's literally the worst service. They haven't sent me my ID card/Medicaid number so dr offices won't see me. But they keep sending me bills for no reason, it's stressing me out. Im still trying and hoping for something to change soon, or try and find a cheap plan to buy. I'm 19 and don't live in the same state as my parents, I live by myself. \nI never thought about contacting specialists, that's definitely worth a shot! Thank you. \nYeah I agree about trying random internet suggestions, I really don't want to make anything worse! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I applied for Medicaid almost a year ago and have no primary care doctor. I&amp;#39;ve gone into the office, called every line, tried to get help but it&amp;#39;s literally the worst service. They haven&amp;#39;t sent me my ID card/Medicaid number so dr offices won&amp;#39;t see me. But they keep sending me bills for no reason, it&amp;#39;s stressing me out. Im still trying and hoping for something to change soon, or try and find a cheap plan to buy. I&amp;#39;m 19 and don&amp;#39;t live in the same state as my parents, I live by myself. \nI never thought about contacting specialists, that&amp;#39;s definitely worth a shot! Thank you. \nYeah I agree about trying random internet suggestions, I really don&amp;#39;t want to make anything worse! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dga304a", "score_hidden": false, "stickied": false, "created": 1492248519.0, "created_utc": 1492219719.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9gq0y", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "globus_pallidus", "parent_id": "t3_65b76x", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Ok, I agree with everyone that you should see a urologist. However, I noted that you can't afford it. I think sometimes people forget that \"not affording\" something can either mean that it would be very difficult to stretch your money, OR that you literally don't have excess funds and are barely able to pay for food/shelter. I don't know where you fall on this scale, but if its the first, then prioritize your health over everything else.\n\n\nThat being said, there may be low-cost/free clinics in your area other than planned parenthood. You aren't going to find a specialist at PP (sadly) and that is what you need right now. If you are in the US, call/visit your county public health dept. See if they can either get you on medicaid or if they could provide medical services to you. Its not the best system, and the wait times for specialists will be insane, but its better than nothing. If that doesn't work, as a last resort you can try to email or contact specialists directly, some times doctors will help people pro-bono/low cost. (That wouldn't help with lab costs though, so you will still need to consider that in your budget.)\n\n\n\nFrom a microbiologist's standpoint, I would avoid the baking soda bath. Normal vaginal pH should be acidic, a baking soda bath will make the pH more basic (thats the opposite of what you want). Vaginal infections flourish when the vaginal pH is too high, so I think you'll be inviting more yeast infections/BV if you take that route. Also, as someone with a chronic medical condition that wasn't diagnosed for 10 yrs, I've found that when you try wonky stuff, doctors tend to focus on those as the cause of your problems and not actually address the long-term problem. So IMO its best to stick with only the medically-sanctioned treatments right now, so they don't dismiss your real problems (or lie to them, but that's not a good idea).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok, I agree with everyone that you should see a urologist. However, I noted that you can&amp;#39;t afford it. I think sometimes people forget that &amp;quot;not affording&amp;quot; something can either mean that it would be very difficult to stretch your money, OR that you literally don&amp;#39;t have excess funds and are barely able to pay for food/shelter. I don&amp;#39;t know where you fall on this scale, but if its the first, then prioritize your health over everything else.&lt;/p&gt;\n\n&lt;p&gt;That being said, there may be low-cost/free clinics in your area other than planned parenthood. You aren&amp;#39;t going to find a specialist at PP (sadly) and that is what you need right now. If you are in the US, call/visit your county public health dept. See if they can either get you on medicaid or if they could provide medical services to you. Its not the best system, and the wait times for specialists will be insane, but its better than nothing. If that doesn&amp;#39;t work, as a last resort you can try to email or contact specialists directly, some times doctors will help people pro-bono/low cost. (That wouldn&amp;#39;t help with lab costs though, so you will still need to consider that in your budget.)&lt;/p&gt;\n\n&lt;p&gt;From a microbiologist&amp;#39;s standpoint, I would avoid the baking soda bath. Normal vaginal pH should be acidic, a baking soda bath will make the pH more basic (thats the opposite of what you want). Vaginal infections flourish when the vaginal pH is too high, so I think you&amp;#39;ll be inviting more yeast infections/BV if you take that route. Also, as someone with a chronic medical condition that wasn&amp;#39;t diagnosed for 10 yrs, I&amp;#39;ve found that when you try wonky stuff, doctors tend to focus on those as the cause of your problems and not actually address the long-term problem. So IMO its best to stick with only the medically-sanctioned treatments right now, so they don&amp;#39;t dismiss your real problems (or lie to them, but that&amp;#39;s not a good idea).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg9gq0y", "score_hidden": false, "stickied": false, "created": 1492220288.0, "created_utc": 1492191488.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": "", "user_reports": [], "id": "dg9hgcz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "andmyradio", "parent_id": "t1_dg90bip", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Going to piggyback this to say I had a few womanly health issues and needed new birth control and didn't have insurance and couldn't afford a doctor. I found out through accident that my state offers women's health insurance for free if you're below an income bracket. It only covers women's health issues (OBGYN health) but it saved me hundreds of dollars. See if where you live offers anything similar. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Going to piggyback this to say I had a few womanly health issues and needed new birth control and didn&amp;#39;t have insurance and couldn&amp;#39;t afford a doctor. I found out through accident that my state offers women&amp;#39;s health insurance for free if you&amp;#39;re below an income bracket. It only covers women&amp;#39;s health issues (OBGYN health) but it saved me hundreds of dollars. See if where you live offers anything similar. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg9hgcz", "score_hidden": false, "stickied": false, "created": 1492221137.0, "created_utc": 1492192337.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90bip", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Julevict", "parent_id": "t3_65b76x", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Yikes. You need to see another doctor. Does a parent have insurance? You might be covered under them and you should definitely get a second opinion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yikes. You need to see another doctor. Does a parent have insurance? You might be covered under them and you should definitely get a second opinion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg90bip", "score_hidden": false, "stickied": false, "created": 1492196581.0, "created_utc": 1492167781.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": "", "user_reports": [], "id": "dg97ot3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "herstorian", "parent_id": "t3_65b76x", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I'm here to echo everyone telling you to go see a urologist! I went through this terrible cycle of worse and worse UTIs after subsequently higher doses of antibiotics. I realized part of it might have been due to some acne medicine I had started a year ago which was also a diuretic. And that my initial infections weren't clearing up sufficiently. It got to the point where my urologist told me to take a strong dose of antibiotics each time after sex. Eventually it all cleared up and I don't need to take antibiotics anymore. In your case it might be an additional problem triggered by the UTIs, as the other posters have mentioned. \n\nI know it's difficult to see a specialist if you don't have insurance. Can you give planned parenthood another call and ask if they have any suggestions for affordable urologists who will accept a negotiated fee for self paying patients? If you're in college you could also ask your student health clinic for a referral too.\n\nUTIs and other complications arising from them are a bitch. I hope you recover fully. And I'm glad your boyfriend is understanding. If he went through an illness where he couldn't have sex, I'm sure you would be standing by his side and able to take care of yourself sexually. Just be a little compassionate to yourself - he'll survive without sex until you get better. Good luck! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m here to echo everyone telling you to go see a urologist! I went through this terrible cycle of worse and worse UTIs after subsequently higher doses of antibiotics. I realized part of it might have been due to some acne medicine I had started a year ago which was also a diuretic. And that my initial infections weren&amp;#39;t clearing up sufficiently. It got to the point where my urologist told me to take a strong dose of antibiotics each time after sex. Eventually it all cleared up and I don&amp;#39;t need to take antibiotics anymore. In your case it might be an additional problem triggered by the UTIs, as the other posters have mentioned. &lt;/p&gt;\n\n&lt;p&gt;I know it&amp;#39;s difficult to see a specialist if you don&amp;#39;t have insurance. Can you give planned parenthood another call and ask if they have any suggestions for affordable urologists who will accept a negotiated fee for self paying patients? If you&amp;#39;re in college you could also ask your student health clinic for a referral too.&lt;/p&gt;\n\n&lt;p&gt;UTIs and other complications arising from them are a bitch. I hope you recover fully. And I&amp;#39;m glad your boyfriend is understanding. If he went through an illness where he couldn&amp;#39;t have sex, I&amp;#39;m sure you would be standing by his side and able to take care of yourself sexually. Just be a little compassionate to yourself - he&amp;#39;ll survive without sex until you get better. Good luck! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg97ot3", "score_hidden": false, "stickied": false, "created": 1492209800.0, "created_utc": 1492181000.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": "", "user_reports": [], "id": "dga33mz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "elyselaurenne", "parent_id": "t1_dg97w6v", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Hmm that's odd that's the only way it shows up, but it makes sense! Thank you! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm that&amp;#39;s odd that&amp;#39;s the only way it shows up, but it makes sense! Thank you! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dga33mz", "score_hidden": false, "stickied": false, "created": 1492248654.0, "created_utc": 1492219854.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97w6v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iplaywithbugs", "parent_id": "t3_65b76x", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I've been through something like this before. 1) try the backing soda bath thing. Sometimes the Lactobacillus get a little crazy and can over acidify the vagina. 2) Next time you get tested for a UTI try to schedule it so that it's your very first pee in the morning. Some ladies in my family (myself included) for some reason will only test positive for a UTI if we test 1st thing in the morning. I've had UTIs for months where the doctors have told me the same thing as they told you. There I was, crying in pain outside the pee cubby in the hallway of the ob/gyn and the nurse is telling me I'm fine with a really concerned look on her face. Often you can take a pee sample cup home with you, catch your first pee, and then refrigerate it until the lab opens and you can drop it off. \n\nI'm sorry girl, I feel that feel and it sucks big hairy balls! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been through something like this before. 1) try the backing soda bath thing. Sometimes the Lactobacillus get a little crazy and can over acidify the vagina. 2) Next time you get tested for a UTI try to schedule it so that it&amp;#39;s your very first pee in the morning. Some ladies in my family (myself included) for some reason will only test positive for a UTI if we test 1st thing in the morning. I&amp;#39;ve had UTIs for months where the doctors have told me the same thing as they told you. There I was, crying in pain outside the pee cubby in the hallway of the ob/gyn and the nurse is telling me I&amp;#39;m fine with a really concerned look on her face. Often you can take a pee sample cup home with you, catch your first pee, and then refrigerate it until the lab opens and you can drop it off. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry girl, I feel that feel and it sucks big hairy balls! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg97w6v", "score_hidden": false, "stickied": false, "created": 1492210063.0, "created_utc": 1492181263.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": "", "user_reports": [], "id": "dgacrro", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hhhnnnnnggggggg", "parent_id": "t1_dga32da", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "There is no one set test for IC. It is diagnosed by excluding everything else..which sometimes involves a cystoscopy as well.  I'd try aiming for the easiest things mentioned here to diagnose first, but experimenting with the diet could help you get an idea of how likely it is for you to have it. For example, if you hurt more after eating tomato sauce and drinking orange juice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no one set test for IC. It is diagnosed by excluding everything else..which sometimes involves a cystoscopy as well.  I&amp;#39;d try aiming for the easiest things mentioned here to diagnose first, but experimenting with the diet could help you get an idea of how likely it is for you to have it. For example, if you hurt more after eating tomato sauce and drinking orange juice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgacrro", "score_hidden": false, "stickied": false, "created": 1492264310.0, "created_utc": 1492235510.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga32da", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "elyselaurenne", "parent_id": "t1_dg9dr8c", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Yes I did, nothing came up. But I'm thinking about going to try again, I know sometimes they can run it again and it will show something. Is there something or a test I should be asking for to see if I have IC? I've researched it a lot but can't exactly diagnose myself when there are so many other things that the internet says it could be as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes I did, nothing came up. But I&amp;#39;m thinking about going to try again, I know sometimes they can run it again and it will show something. Is there something or a test I should be asking for to see if I have IC? I&amp;#39;ve researched it a lot but can&amp;#39;t exactly diagnose myself when there are so many other things that the internet says it could be as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dga32da", "score_hidden": false, "stickied": false, "created": 1492248606.0, "created_utc": 1492219806.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dr8c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hhhnnnnnggggggg", "parent_id": "t3_65b76x", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I see people already mentioned IC. Come down to /r/interstitialcystitis and grab the diet list from the sidebar and give it a try if you like. It's also good for a bladder that's sensitive.\n\nDid you get your urine cultured?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see people already mentioned IC. Come down to &lt;a href=\"/r/interstitialcystitis\"&gt;/r/interstitialcystitis&lt;/a&gt; and grab the diet list from the sidebar and give it a try if you like. It&amp;#39;s also good for a bladder that&amp;#39;s sensitive.&lt;/p&gt;\n\n&lt;p&gt;Did you get your urine cultured?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg9dr8c", "score_hidden": false, "stickied": false, "created": 1492216896.0, "created_utc": 1492188096.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": "", "user_reports": [], "id": "dg9m8tv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pelvicpainthrowaway", "parent_id": "t3_65b76x", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "If you keep coming back negative for UTI and other infections, I would try to see a specialist. I see IC already mentioned here and it could be that or another one of many pelvic pain conditions that don't involve infection. I thought I had a problem with UTIs too. I saw several doctors. Medications and antibiotics didn't help. I finally saw a gyn specializing in pelvic pain and a urologist. Between the two of them, we worked out a solution. I recommend this [book](https://www.amazon.com/Heal-Pelvic-Pain- Strengthening-Incontinence/dp/0071546561/ref=sr_1_fkmr2_1?ie=UTF8&amp;qid=1492197691&amp;sr=8-1-fkmr2&amp;keywords=heal+your+pelvic+pain+book) as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you keep coming back negative for UTI and other infections, I would try to see a specialist. I see IC already mentioned here and it could be that or another one of many pelvic pain conditions that don&amp;#39;t involve infection. I thought I had a problem with UTIs too. I saw several doctors. Medications and antibiotics didn&amp;#39;t help. I finally saw a gyn specializing in pelvic pain and a urologist. Between the two of them, we worked out a solution. I recommend this &lt;a href=\"https://www.amazon.com/Heal-Pelvic-Pain-%20Strengthening-Incontinence/dp/0071546561/ref=sr_1_fkmr2_1?ie=UTF8&amp;amp;qid=1492197691&amp;amp;sr=8-1-fkmr2&amp;amp;keywords=heal+your+pelvic+pain+book\"&gt;book&lt;/a&gt; as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dg9m8tv", "score_hidden": false, "stickied": false, "created": 1492226870.0, "created_utc": 1492198070.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65b76x", "likes": null, "replies": "", "user_reports": [], "id": "dgbpkz3", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "gods_bones", "parent_id": "t3_65b76x", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "You probably picked up an STD while whoring your underage ass around town. Who knows what sort of other disgusting diseases you've got bubbling up inside you right now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You probably picked up an STD while whoring your underage ass around town. Who knows what sort of other disgusting diseases you&amp;#39;ve got bubbling up inside you right now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgbpkz3", "score_hidden": false, "stickied": false, "created": 1492347673.0, "created_utc": 1492318873.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}]