[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi friends! Long time lurker here. Hope this post isn&amp;#39;t breaking any rules -- not intended as a medical advice post, which I know this isn&amp;#39;t the place for.&lt;/p&gt;\n\n&lt;p&gt;I recently started taking Orsythia (low-dose combination pill) after a lifetime of infrequent, irregular periods (but typically super light -- think one pad a day). I&amp;#39;m in the placebo week now, and after like two straight weeks of spotting, the actual &amp;quot;real period&amp;quot; is happening and I feel like I&amp;#39;VE BLED ON EVERYTHING I OWN.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m assuming this is a &amp;quot;normal&amp;quot; amount of blood (soaking through pad every 3-4h?), but it&amp;#39;s so much more than I used to get and I&amp;#39;m just not used to managing it! Have already accidentally bled on two pairs of underwear, a pair of shorts, my pajama pants, and my boyfriend&amp;#39;s sheets (currently waiting for him to wake up so I can wash them before the blood sets in... y i k e s)&lt;/p&gt;\n\n&lt;p&gt;All instructions from doctor and pill packaging have said that the spotting is common, but hormonal BC doesn&amp;#39;t typically make periods heavier, so I wasn&amp;#39;t prepared for this 😅&lt;/p&gt;\n\n&lt;p&gt;Did any of you have a similar experience with weird changes in bleeding upon starting/switching birth control? Would love to hear your stories so I don&amp;#39;t feel as ridiculous, hehehe.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi friends! Long time lurker here. Hope this post isn't breaking any rules -- not intended as a medical advice post, which I know this isn't the place for.\n\nI recently started taking Orsythia (low-dose combination pill) after a lifetime of infrequent, irregular periods (but typically super light -- think one pad a day). I'm in the placebo week now, and after like two straight weeks of spotting, the actual \"real period\" is happening and I feel like I'VE BLED ON EVERYTHING I OWN.\n\nI'm assuming this is a \"normal\" amount of blood (soaking through pad every 3-4h?), but it's so much more than I used to get and I'm just not used to managing it! Have already accidentally bled on two pairs of underwear, a pair of shorts, my pajama pants, and my boyfriend's sheets (currently waiting for him to wake up so I can wash them before the blood sets in... y i k e s)\n\nAll instructions from doctor and pill packaging have said that the spotting is common, but hormonal BC doesn't typically make periods heavier, so I wasn't prepared for this 😅\n\nDid any of you have a similar experience with weird changes in bleeding upon starting/switching birth control? Would love to hear your stories so I don't feel as ridiculous, hehehe.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65d0tq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "sleepsheepy", "saved": false, "mod_reports": [], "name": "t3_65d0tq", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/65d0tq/how_did_your_bleeding_patterns_change_when/", "num_reports": null, "locked": false, "stickied": false, "created": 1492211001.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/65d0tq/how_did_your_bleeding_patterns_change_when/", "author_flair_text": null, "quarantine": false, "title": "How did your bleeding patterns change when starting/switching BC? Stories please!", "created_utc": 1492182201.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65d0tq", "likes": null, "replies": "", "user_reports": [], "id": "dgbr91q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Snuffalupegus", "parent_id": "t3_65d0tq", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Various brands of BC had different effects on my body. Some kinds made my periods short and awesome, some made it almost never come. I was on one kind that made me constantly have it really lightly every day and a normal period once a month. I can't remember the brand, but my friend was on it and it did the same thing to her. \n\nIf you just switched, stay on it for about 3 months and if you still don't like what it's doing to you, go back to your doctor and get it switched. \n\nI have since switched to an IUD and don't get a period anymore. It's amazing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Various brands of BC had different effects on my body. Some kinds made my periods short and awesome, some made it almost never come. I was on one kind that made me constantly have it really lightly every day and a normal period once a month. I can&amp;#39;t remember the brand, but my friend was on it and it did the same thing to her. &lt;/p&gt;\n\n&lt;p&gt;If you just switched, stay on it for about 3 months and if you still don&amp;#39;t like what it&amp;#39;s doing to you, go back to your doctor and get it switched. &lt;/p&gt;\n\n&lt;p&gt;I have since switched to an IUD and don&amp;#39;t get a period anymore. It&amp;#39;s amazing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgbr91q", "score_hidden": false, "stickied": false, "created": 1492350976.0, "created_utc": 1492322176.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65d0tq", "likes": null, "replies": "", "user_reports": [], "id": "dgd9c9e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mewkyy", "parent_id": "t3_65d0tq", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I use Sprintec and used to have super heavy 6-7 day painful periods. Ever since starting BC I was able to have regular periods that were about 4 days long. The period cramps also became SO much easier. The flow was lighter and my period was regulated! I really like being on BC. No weight changes or hormonal side effects as far as I can tell. \n\n\nOnly downside is that when I miss a pill I freak out about being pregnant 😭 also you are susceptible to becoming pregnant if you take BC with antibiotics (something I didn't know when taking my UTI antibiotics.. had a major pregnancy scare)\n\nIN REGARDS TO YOUR SITUATION: I'd say call your doctor and ask if that's normal. Typically it takes like a cycle or two to get to your \"stable\" or \"normal\" on-the-pill kind of cycles. If you're not concerned too much then I'd just wait til next cycle and see if it happens again. Typically the first month is wonky. I spotted through my first month. It's normal. Just take ALL the pills. Someone told me to throw away the placebos and jump to the hormonal pills. DO NOT DO THAT 😱 you will get major spotting and cramps that go on over a week til you realize your mistake. ", "edited": 1492415412.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I use Sprintec and used to have super heavy 6-7 day painful periods. Ever since starting BC I was able to have regular periods that were about 4 days long. The period cramps also became SO much easier. The flow was lighter and my period was regulated! I really like being on BC. No weight changes or hormonal side effects as far as I can tell. &lt;/p&gt;\n\n&lt;p&gt;Only downside is that when I miss a pill I freak out about being pregnant 😭 also you are susceptible to becoming pregnant if you take BC with antibiotics (something I didn&amp;#39;t know when taking my UTI antibiotics.. had a major pregnancy scare)&lt;/p&gt;\n\n&lt;p&gt;IN REGARDS TO YOUR SITUATION: I&amp;#39;d say call your doctor and ask if that&amp;#39;s normal. Typically it takes like a cycle or two to get to your &amp;quot;stable&amp;quot; or &amp;quot;normal&amp;quot; on-the-pill kind of cycles. If you&amp;#39;re not concerned too much then I&amp;#39;d just wait til next cycle and see if it happens again. Typically the first month is wonky. I spotted through my first month. It&amp;#39;s normal. Just take ALL the pills. Someone told me to throw away the placebos and jump to the hormonal pills. DO NOT DO THAT 😱 you will get major spotting and cramps that go on over a week til you realize your mistake. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgd9c9e", "score_hidden": false, "stickied": false, "created": 1492443987.0, "created_utc": 1492415187.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]