[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Update: yeah. It&amp;#39;s my fault. I think I am just trying to Blame it on someone so I can feel less guilty. I am sorry. &lt;/p&gt;\n\n&lt;p&gt;I was driving to another town with my friend to watch Fast and Furious (yes, the irony). We were talking and my friend suddenly pointed out there water leaking in the car. I took my eyes off the road and checked it out. It was only an one or two second distraction, when I got it back on the road. Oh boy.. I struggled, wrestled with the car steering. Dodged hitting a few trees and thought of pulling the hand brake only to find the my friend&amp;#39;s bag was stopping me. I told my friend to pull it and tried to keep my eyes on road and to stay as calm as possible whilst continued to wrestle car steering and dodging trees like I&amp;#39;m in a fucking GTA or racing game.&lt;/p&gt;\n\n&lt;p&gt;She eventually or I eventually(I can&amp;#39;t remember it well) pulled the hand brake. Still hit a tree, but not at full speed at least. Nobody was injured. Thank God. &lt;/p&gt;\n\n&lt;p&gt;I felt guilty as fuck though, for I am not the one that&amp;#39;s paying for the car. Still student, can&amp;#39;t afford, parents are paying for it (split 2/3 with my friend because we use it together). &lt;/p&gt;\n\n&lt;p&gt;My friend on the other hand didn&amp;#39;t seem to feel bad about it or see her fault in this case. I mean. I know I am the one that&amp;#39;s driving and I am feeling FUCKING GUILTY for taking my eyes off the road. But she&amp;#39;s the one that started the innocent conversation, I know it&amp;#39;s not her fault and I am kind of blaMing her to make myself feel better but couldn&amp;#39;t she at least see it where the fire started? She phoned her mum, the way she told her parent makes me seemed like the only one to blame, and I feel bad and hey her bag blocked the fucking hand brake. I also told her to apologized to her parent for me, for I was the one that&amp;#39;s driving. She told me her mum sighed and expressed her doubt on supporting her financially to split/ get this car with me. I am annoyed. Sigh. I know it&amp;#39;s my fault but not entirely(?) I am already feeling bad and apologizing is me trying be nice and express my guilt... The sigh and doubt and my friend not realizing it&amp;#39;s her fault clearly isn&amp;#39;t helping. &lt;/p&gt;\n\n&lt;p&gt;I talked to my friend. Told her it&amp;#39;s the conversation that got me distracted. She then only realized thats the start of it... I felt bad and afraid she would blame herself over it and took it back and admit it was my fault too.. for taking eyes off the road... And she kind of put them blame on me again...?&lt;/p&gt;\n\n&lt;p&gt;I am so confused. I am not angry and I know it&amp;#39;s partly my fault. I am glad we both made it out not hurt in any way. I talked to my parents and they both didn&amp;#39;t make a scene out of it and reassured it&amp;#39;s no biggie. But I am still annoyed.. &lt;/p&gt;\n\n&lt;p&gt;Someone please give me a mature talk or different perspectives over the situation..&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Update: yeah. It's my fault. I think I am just trying to Blame it on someone so I can feel less guilty. I am sorry. \n\nI was driving to another town with my friend to watch Fast and Furious (yes, the irony). We were talking and my friend suddenly pointed out there water leaking in the car. I took my eyes off the road and checked it out. It was only an one or two second distraction, when I got it back on the road. Oh boy.. I struggled, wrestled with the car steering. Dodged hitting a few trees and thought of pulling the hand brake only to find the my friend's bag was stopping me. I told my friend to pull it and tried to keep my eyes on road and to stay as calm as possible whilst continued to wrestle car steering and dodging trees like I'm in a fucking GTA or racing game.\n\nShe eventually or I eventually(I can't remember it well) pulled the hand brake. Still hit a tree, but not at full speed at least. Nobody was injured. Thank God. \n\nI felt guilty as fuck though, for I am not the one that's paying for the car. Still student, can't afford, parents are paying for it (split 2/3 with my friend because we use it together). \n\nMy friend on the other hand didn't seem to feel bad about it or see her fault in this case. I mean. I know I am the one that's driving and I am feeling FUCKING GUILTY for taking my eyes off the road. But she's the one that started the innocent conversation, I know it's not her fault and I am kind of blaMing her to make myself feel better but couldn't she at least see it where the fire started? She phoned her mum, the way she told her parent makes me seemed like the only one to blame, and I feel bad and hey her bag blocked the fucking hand brake. I also told her to apologized to her parent for me, for I was the one that's driving. She told me her mum sighed and expressed her doubt on supporting her financially to split/ get this car with me. I am annoyed. Sigh. I know it's my fault but not entirely(?) I am already feeling bad and apologizing is me trying be nice and express my guilt... The sigh and doubt and my friend not realizing it's her fault clearly isn't helping. \n\nI talked to my friend. Told her it's the conversation that got me distracted. She then only realized thats the start of it... I felt bad and afraid she would blame herself over it and took it back and admit it was my fault too.. for taking eyes off the road... And she kind of put them blame on me again...?\n\nI am so confused. I am not angry and I know it's partly my fault. I am glad we both made it out not hurt in any way. I talked to my parents and they both didn't make a scene out of it and reassured it's no biggie. But I am still annoyed.. \n\nSomeone please give me a mature talk or different perspectives over the situation..", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65oaxs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "fmlreally", "saved": false, "mod_reports": [], "name": "t3_65oaxs", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": 1492335958.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/65oaxs/car_crashed_a_tree_dealing_with_the_aftermath/", "num_reports": null, "locked": false, "stickied": false, "created": 1492362907.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/65oaxs/car_crashed_a_tree_dealing_with_the_aftermath/", "author_flair_text": null, "quarantine": false, "title": "Car crashed a tree. Dealing with the aftermath - guilt and annoyed because I felt like my friend blamed it on me.", "created_utc": 1492334107.0, "distinguished": null, "media": null, "upvote_ratio": 0.5, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65oaxs", "likes": null, "replies": "", "user_reports": [], "id": "dgbvvtd", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "mariesoleil", "parent_id": "t3_65oaxs", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "It is not partly your fault. It is entirely your fault. As operator of a dangerous weapon, you should always be in control of it. It is not normal to lose control of your vehicle when you look at things. I don't know why you would be using the parking brake to stop instead of your real brakes, but it's also your responsibility to keep that accessible. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is not partly your fault. It is entirely your fault. As operator of a dangerous weapon, you should always be in control of it. It is not normal to lose control of your vehicle when you look at things. I don&amp;#39;t know why you would be using the parking brake to stop instead of your real brakes, but it&amp;#39;s also your responsibility to keep that accessible. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgbvvtd", "score_hidden": false, "stickied": false, "created": 1492364243.0, "created_utc": 1492335443.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65oaxs", "likes": null, "replies": "", "user_reports": [], "id": "dgbxyj9", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "theonlybagel", "parent_id": "t3_65oaxs", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "It is 100% your fault. You both weren't driving it only you were. And you should have been the one to make sure her things weren't blocking your driving abilities. I'm sorry this happened to you but you really need to take full responsibility ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is 100% your fault. You both weren&amp;#39;t driving it only you were. And you should have been the one to make sure her things weren&amp;#39;t blocking your driving abilities. I&amp;#39;m sorry this happened to you but you really need to take full responsibility &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgbxyj9", "score_hidden": false, "stickied": false, "created": 1492371188.0, "created_utc": 1492342388.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65oaxs", "likes": null, "replies": "", "user_reports": [], "id": "dgcfxb4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "vi0letknight", "parent_id": "t3_65oaxs", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "It was your fault but don't beat yourself up over it. A car accident happens so quickly and you can spend hours trying figure and worry about what happened. Focus on the good things like everyone's ok. Don't be afraid to drive again, just keep your eyes on the road next time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was your fault but don&amp;#39;t beat yourself up over it. A car accident happens so quickly and you can spend hours trying figure and worry about what happened. Focus on the good things like everyone&amp;#39;s ok. Don&amp;#39;t be afraid to drive again, just keep your eyes on the road next time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgcfxb4", "score_hidden": false, "stickied": false, "created": 1492399317.0, "created_utc": 1492370517.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]