[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello ladies ! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always had informative replies from all of you &amp;amp; I thought I&amp;#39;d seek your advice on this.&lt;/p&gt;\n\n&lt;p&gt;So lately I&amp;#39;ve asked for more exposure &amp;amp; opportunities at work &amp;amp; they heard me. I was assigned to a new team and a new project whilst they were in the midst of a shit storm to learn and assist.&lt;/p&gt;\n\n&lt;p&gt;Because they were in a pretty advanced stage in the project, the turn around for the deliverables is pretty quick and things can get hectic real fast.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a small team of 3 people including me &amp;amp; everyone else is working on separate projects so there wasn&amp;#39;t much room for a proper handover.&lt;/p&gt;\n\n&lt;p&gt;Me being new to this job scope- never had any experience prior found the entire process overwhelming. My new manager is Super particular and is a perfectionist - understandably so but I can&amp;#39;t help but feel overwhelmed and stressed out.&lt;/p&gt;\n\n&lt;p&gt;This is to the point that I dread coming to work. I get anxiety attacks and it has unfortunately affected my personal life.&lt;/p&gt;\n\n&lt;p&gt;I try to not be so hard on myself and the feedback I get was that I&amp;#39;m &amp;quot;thinking too much&amp;quot; but the expectations is there and it is very obvious to me that I&amp;#39;m supposed to step up. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been trying my best but it seems like I&amp;#39;m not good enough. It doesn&amp;#39;t help that there are days when I feel like I&amp;#39;m alone when there&amp;#39;s so much expected from me.&lt;/p&gt;\n\n&lt;p&gt;Ladies, if you have ever been in this predicament, please advise how I can manage this without going crazy. I&amp;#39;m trying my best to learn but sometimes the way I&amp;#39;ve been spoken to makes me feel very incompetent. &lt;/p&gt;\n\n&lt;p&gt;There are things which may be obvious to the rest of the team members but when I bring it up, I can&amp;#39;t help that they look at me like I&amp;#39;m an idiot.&lt;/p&gt;\n\n&lt;p&gt;Thanks for the advise ! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello ladies ! \n\nI've always had informative replies from all of you &amp; I thought I'd seek your advice on this.\n\nSo lately I've asked for more exposure &amp; opportunities at work &amp; they heard me. I was assigned to a new team and a new project whilst they were in the midst of a shit storm to learn and assist.\n\nBecause they were in a pretty advanced stage in the project, the turn around for the deliverables is pretty quick and things can get hectic real fast.\n\nIt's a small team of 3 people including me &amp; everyone else is working on separate projects so there wasn't much room for a proper handover.\n\nMe being new to this job scope- never had any experience prior found the entire process overwhelming. My new manager is Super particular and is a perfectionist - understandably so but I can't help but feel overwhelmed and stressed out.\n\nThis is to the point that I dread coming to work. I get anxiety attacks and it has unfortunately affected my personal life.\n\nI try to not be so hard on myself and the feedback I get was that I'm \"thinking too much\" but the expectations is there and it is very obvious to me that I'm supposed to step up. \n\nI've been trying my best but it seems like I'm not good enough. It doesn't help that there are days when I feel like I'm alone when there's so much expected from me.\n\nLadies, if you have ever been in this predicament, please advise how I can manage this without going crazy. I'm trying my best to learn but sometimes the way I've been spoken to makes me feel very incompetent. \n\nThere are things which may be obvious to the rest of the team members but when I bring it up, I can't help that they look at me like I'm an idiot.\n\nThanks for the advise ! ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65pdnv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 48, "report_reasons": null, "author": "i_burn_bras", "saved": false, "mod_reports": [], "name": "t3_65pdnv", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/65pdnv/how_do_i_cope_with_stepping_out_of_my_comfort_zone/", "num_reports": null, "locked": false, "stickied": false, "created": 1492381968.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/65pdnv/how_do_i_cope_with_stepping_out_of_my_comfort_zone/", "author_flair_text": null, "quarantine": false, "title": "How do I cope with stepping out of my comfort zone ?", "created_utc": 1492353168.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 48}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65pdnv", "likes": null, "replies": "", "user_reports": [], "id": "dgcel5l", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "keribelleee", "parent_id": "t3_65pdnv", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I hope this helps a little :)\n\nSo you asked for more work and more responsibility and they gave it to you, but they've thrown you head first into something that's already in progress and that's not fair. It's obvious in your post that you really do want more responsibility and doing your best work weighs heavily on you. If I can see that in your post, I'm betting your coworkers can see it too! \n\nI've been in your spot before and felt so dumb and incompetent. My ideas had been thought through and didn't work already and I felt like my contributions were just kind of a waste of time. I had panic attacks too and struggled a lot with my anxiety during that time. Just keep your head down and keep working. If this experience becomes something that you learned from or allows your coworkers to see that you're willing to work hard and ask questions, that's still a great outcome. You're learning. Your coworkers have been in your same position, I'm sure. Keep trying your best, ask questions, give input, and make the best of it. You shouldn't have been thrown in at such a weird time in the project, but all you can do is focus on making the best of this and look forward to killing it on your next project :)\n\nAlso, having a perfectionist boss can be really tough and anxiety inducing, but I promise it'll make you so much better! I worked for one and it made the already present perfectionist in me even more thorough, but more importantly, more understanding and compassionate for people who are still learning. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope this helps a little :)&lt;/p&gt;\n\n&lt;p&gt;So you asked for more work and more responsibility and they gave it to you, but they&amp;#39;ve thrown you head first into something that&amp;#39;s already in progress and that&amp;#39;s not fair. It&amp;#39;s obvious in your post that you really do want more responsibility and doing your best work weighs heavily on you. If I can see that in your post, I&amp;#39;m betting your coworkers can see it too! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been in your spot before and felt so dumb and incompetent. My ideas had been thought through and didn&amp;#39;t work already and I felt like my contributions were just kind of a waste of time. I had panic attacks too and struggled a lot with my anxiety during that time. Just keep your head down and keep working. If this experience becomes something that you learned from or allows your coworkers to see that you&amp;#39;re willing to work hard and ask questions, that&amp;#39;s still a great outcome. You&amp;#39;re learning. Your coworkers have been in your same position, I&amp;#39;m sure. Keep trying your best, ask questions, give input, and make the best of it. You shouldn&amp;#39;t have been thrown in at such a weird time in the project, but all you can do is focus on making the best of this and look forward to killing it on your next project :)&lt;/p&gt;\n\n&lt;p&gt;Also, having a perfectionist boss can be really tough and anxiety inducing, but I promise it&amp;#39;ll make you so much better! I worked for one and it made the already present perfectionist in me even more thorough, but more importantly, more understanding and compassionate for people who are still learning. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgcel5l", "score_hidden": false, "stickied": false, "created": 1492397550.0, "created_utc": 1492368750.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65pdnv", "likes": null, "replies": "", "user_reports": [], "id": "dgce5bq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheGreenKitKat", "parent_id": "t3_65pdnv", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I can only speak to my own experience, and my experience ended in the worst case scenario so I think I could speak constructively on this issue. \n\nI had gotten a new job with a new startup that was a step up from what I was doing previously, and was my first managerial role. I was in that role for around four months when I finally quit (out of sheer panic and with no backup plan) due to the physical symptoms of the stress and anxiety I'd experienced. The startup shuttered less than a month later, and *I* was blamed for the failure of the entire business and the financial ruin of its owner. Mentally and physically this was one of the toughest times in my life. \n\nThis destroyed my self esteem and was the sole reason for many missed opportunities. This is what I've learned:\n\n- I should have sought professional help in dealing with the acute stress of the new position I was in rather than thinking I was an adult that should be able to manage these things alone. This is why the stress got as bad as it did and why it ultimately got the better of me. Get this help. It will help you with so much more in life than just the new job. It will also help you specifically with the following points. \n\n- I should have recognized what my actual position as an employee is. If an employee is not given the proper training, or is not given the time and tools they need to succeed in the role, this is not the employee's fault but rather a management issue. Take the time to really objectively consider whether or not you're being supported enough in your role. Anyone can ask the world, but it isn't always your fault if you can't give it to them. Use this information to either identify areas for you to improve at work OR to personally absolve yourself of blame for issues they're trying to pin on you. It's easy to think something is your fault when your superiors phrase it that way, but it's a huge weight off when you can objectively tell yourself you did the best you could with what you were given. \n\n- If you identify poor management to be an issue that's starting to cause problems in your personal life, rethink the position. You can always step back, you can change companies, you can change fields, you're absolutely not stuck in your position just because it was the first opportunity to come around. There will be others. Don't let the make-or-break mindset trap you in a role that's ultimately proving unhealthy for your overall life. \n\nUltimately, no, it was absolutely not my fault the business shuttered. Being made to feel that way has put me years behind where I should be career wise. These were the three big traps I fell into without even realizing it, and *I* was the one responsible for letting a bad work environment determine my self worth. \n\nSo in general, separate your feelings of anxiety from your thought process and decision making. Think about your situation rationally and don't act on emotion. Ask yourself honestly if it's a bad work environment. Ask yourself specifically what's going wrong. If you identify areas you can improve on at work, that gives you a jumping off point that makes you feel like you've got a plan to make things better. If you identify things you need from your employer, explore those options with them. Remember that no job takes priority over taking good care of yourself and your well being. \n\nBe rational and proactive, but be kind to yourself first. Take a nice bubble bath or do something for yourself tonight, and hit the ground running tomorrow. You got this.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can only speak to my own experience, and my experience ended in the worst case scenario so I think I could speak constructively on this issue. &lt;/p&gt;\n\n&lt;p&gt;I had gotten a new job with a new startup that was a step up from what I was doing previously, and was my first managerial role. I was in that role for around four months when I finally quit (out of sheer panic and with no backup plan) due to the physical symptoms of the stress and anxiety I&amp;#39;d experienced. The startup shuttered less than a month later, and &lt;em&gt;I&lt;/em&gt; was blamed for the failure of the entire business and the financial ruin of its owner. Mentally and physically this was one of the toughest times in my life. &lt;/p&gt;\n\n&lt;p&gt;This destroyed my self esteem and was the sole reason for many missed opportunities. This is what I&amp;#39;ve learned:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;I should have sought professional help in dealing with the acute stress of the new position I was in rather than thinking I was an adult that should be able to manage these things alone. This is why the stress got as bad as it did and why it ultimately got the better of me. Get this help. It will help you with so much more in life than just the new job. It will also help you specifically with the following points. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I should have recognized what my actual position as an employee is. If an employee is not given the proper training, or is not given the time and tools they need to succeed in the role, this is not the employee&amp;#39;s fault but rather a management issue. Take the time to really objectively consider whether or not you&amp;#39;re being supported enough in your role. Anyone can ask the world, but it isn&amp;#39;t always your fault if you can&amp;#39;t give it to them. Use this information to either identify areas for you to improve at work OR to personally absolve yourself of blame for issues they&amp;#39;re trying to pin on you. It&amp;#39;s easy to think something is your fault when your superiors phrase it that way, but it&amp;#39;s a huge weight off when you can objectively tell yourself you did the best you could with what you were given. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If you identify poor management to be an issue that&amp;#39;s starting to cause problems in your personal life, rethink the position. You can always step back, you can change companies, you can change fields, you&amp;#39;re absolutely not stuck in your position just because it was the first opportunity to come around. There will be others. Don&amp;#39;t let the make-or-break mindset trap you in a role that&amp;#39;s ultimately proving unhealthy for your overall life. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Ultimately, no, it was absolutely not my fault the business shuttered. Being made to feel that way has put me years behind where I should be career wise. These were the three big traps I fell into without even realizing it, and &lt;em&gt;I&lt;/em&gt; was the one responsible for letting a bad work environment determine my self worth. &lt;/p&gt;\n\n&lt;p&gt;So in general, separate your feelings of anxiety from your thought process and decision making. Think about your situation rationally and don&amp;#39;t act on emotion. Ask yourself honestly if it&amp;#39;s a bad work environment. Ask yourself specifically what&amp;#39;s going wrong. If you identify areas you can improve on at work, that gives you a jumping off point that makes you feel like you&amp;#39;ve got a plan to make things better. If you identify things you need from your employer, explore those options with them. Remember that no job takes priority over taking good care of yourself and your well being. &lt;/p&gt;\n\n&lt;p&gt;Be rational and proactive, but be kind to yourself first. Take a nice bubble bath or do something for yourself tonight, and hit the ground running tomorrow. You got this.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgce5bq", "score_hidden": false, "stickied": false, "created": 1492396953.0, "created_utc": 1492368153.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65pdnv", "likes": null, "replies": "", "user_reports": [], "id": "dgce6b7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thewekeend", "parent_id": "t3_65pdnv", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Ah geez, i'm in the saaaaame exact predicament- the only thing that's keeping me afloat is knowing that i'm doing my absolute best and being new to anything takes a bit of time to get used to- it's a process...I know it's difficult to not overthink things but in times of anxiety I just think about where i'll be in a month's time if I take deep breaths, conquer one problem at a time and do my best. It's been six months since I started at a job I thought I was underqualified for and I still beat myself up for not being as excellent as I want to be....but i'm faster, more confident and make better decisions now and I know that it only goes up from here. \n\nIt's okay to feel incompetent, because it means you're learning and you'll never make that mistake again. As long as upper management sees you take the initiative and sees you self motivated enough to want to do better, they won't fault you.\n\nAsk questions, before and after work, reflect on things that you've experienced and how you can do better. Pre-emptively try and figure out solutions to problems that you might encounter. \n\nAs for the feeling as if people look down on you...we all have to start somewhere- when they started, I'm sure they've felt the same. It's important not to let them get to your head and to only allow yourself to think about how much progress you're making and that it's a process and this period of time will pass.\n\nVisualize yourself in the near future killin' it and only think about that. It's easier said than done but it's worth a try. PM me if you need any support ! :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah geez, i&amp;#39;m in the saaaaame exact predicament- the only thing that&amp;#39;s keeping me afloat is knowing that i&amp;#39;m doing my absolute best and being new to anything takes a bit of time to get used to- it&amp;#39;s a process...I know it&amp;#39;s difficult to not overthink things but in times of anxiety I just think about where i&amp;#39;ll be in a month&amp;#39;s time if I take deep breaths, conquer one problem at a time and do my best. It&amp;#39;s been six months since I started at a job I thought I was underqualified for and I still beat myself up for not being as excellent as I want to be....but i&amp;#39;m faster, more confident and make better decisions now and I know that it only goes up from here. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s okay to feel incompetent, because it means you&amp;#39;re learning and you&amp;#39;ll never make that mistake again. As long as upper management sees you take the initiative and sees you self motivated enough to want to do better, they won&amp;#39;t fault you.&lt;/p&gt;\n\n&lt;p&gt;Ask questions, before and after work, reflect on things that you&amp;#39;ve experienced and how you can do better. Pre-emptively try and figure out solutions to problems that you might encounter. &lt;/p&gt;\n\n&lt;p&gt;As for the feeling as if people look down on you...we all have to start somewhere- when they started, I&amp;#39;m sure they&amp;#39;ve felt the same. It&amp;#39;s important not to let them get to your head and to only allow yourself to think about how much progress you&amp;#39;re making and that it&amp;#39;s a process and this period of time will pass.&lt;/p&gt;\n\n&lt;p&gt;Visualize yourself in the near future killin&amp;#39; it and only think about that. It&amp;#39;s easier said than done but it&amp;#39;s worth a try. PM me if you need any support ! :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgce6b7", "score_hidden": false, "stickied": false, "created": 1492396988.0, "created_utc": 1492368188.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65pdnv", "likes": null, "replies": "", "user_reports": [], "id": "dgcnrfn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "riverloves2dance", "parent_id": "t3_65pdnv", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I've been in this exact predicament. I'm a new grad nurse and... well... nursing in school is not nursing in the real world. They're very different and it's taken some time to adjust. When I noticed it start to affect my personal life, I went to my doctor and talked about it. He put me on some anti-anxiety medicine and I felt so much better. I was able to function enough to figure out a way to cope with things. Now I've stopped taking the meds, but I cope just fine without them. All I really needed was something to help me stop overthinking things long enough to realize I actually do know what I'm doing and I have good judgement.\n\nAs to people looking at you like an idiot for asking questions, you have a right to ask questions. I'd return people's looks with a look of exasperation and remind them that I'm learning and have a right to ask questions. I'd also remind them that the alternative is I try to figure it out on my own and make a bunch of potentially really bad mistakes along the way. That generally makes people realize that they need to stop being assholes and looking at you funny.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been in this exact predicament. I&amp;#39;m a new grad nurse and... well... nursing in school is not nursing in the real world. They&amp;#39;re very different and it&amp;#39;s taken some time to adjust. When I noticed it start to affect my personal life, I went to my doctor and talked about it. He put me on some anti-anxiety medicine and I felt so much better. I was able to function enough to figure out a way to cope with things. Now I&amp;#39;ve stopped taking the meds, but I cope just fine without them. All I really needed was something to help me stop overthinking things long enough to realize I actually do know what I&amp;#39;m doing and I have good judgement.&lt;/p&gt;\n\n&lt;p&gt;As to people looking at you like an idiot for asking questions, you have a right to ask questions. I&amp;#39;d return people&amp;#39;s looks with a look of exasperation and remind them that I&amp;#39;m learning and have a right to ask questions. I&amp;#39;d also remind them that the alternative is I try to figure it out on my own and make a bunch of potentially really bad mistakes along the way. That generally makes people realize that they need to stop being assholes and looking at you funny.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgcnrfn", "score_hidden": false, "stickied": false, "created": 1492409530.0, "created_utc": 1492380730.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]