[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hopefully you ladies can help me out. I&amp;#39;m an ok cook with a recipe but I&amp;#39;m not a creative cook at all, so I always have trouble coming up with meal ideas for me and my SO. I&amp;#39;ve tried meal planning but I get stuck trying to find something that sounds good to me in the moment, and I end up with food I don&amp;#39;t want later in the week or stuff that goes to waste because I don&amp;#39;t end up using it. Plus I default to standby meals that are fine (fairly healthy and meet nutritional needs) but eating the same thing gets boring fast. &lt;/p&gt;\n\n&lt;p&gt;I want to use the stuff in my fridge/pantry and figuring out how to combine the ingredients in new-to-me ways would be awesome. I feel like in the perfect world there would be an app or something where I can enter in the food I have, and it would suggest recipes for me. Does such a thing exist? Is there a way to avoid recipe purgatory, or am I doomed to cook boring food forever? I know I&amp;#39;m not, but seriously, I could use some new resources to sort this out. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hopefully you ladies can help me out. I'm an ok cook with a recipe but I'm not a creative cook at all, so I always have trouble coming up with meal ideas for me and my SO. I've tried meal planning but I get stuck trying to find something that sounds good to me in the moment, and I end up with food I don't want later in the week or stuff that goes to waste because I don't end up using it. Plus I default to standby meals that are fine (fairly healthy and meet nutritional needs) but eating the same thing gets boring fast. \n\nI want to use the stuff in my fridge/pantry and figuring out how to combine the ingredients in new-to-me ways would be awesome. I feel like in the perfect world there would be an app or something where I can enter in the food I have, and it would suggest recipes for me. Does such a thing exist? Is there a way to avoid recipe purgatory, or am I doomed to cook boring food forever? I know I'm not, but seriously, I could use some new resources to sort this out. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65s5n5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 32, "report_reasons": null, "author": "twoblueshoes", "saved": false, "mod_reports": [], "name": "t3_65s5n5", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/65s5n5/how_can_i_avoid_repeated_boring_dinners_and_also/", "num_reports": null, "locked": false, "stickied": false, "created": 1492414419.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/65s5n5/how_can_i_avoid_repeated_boring_dinners_and_also/", "author_flair_text": null, "quarantine": false, "title": "How can I avoid repeated boring dinners and also use everything in my pantry? Is there an app for that?", "created_utc": 1492385619.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65s5n5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65s5n5", "likes": null, "replies": "", "user_reports": [], "id": "dgcuqdn", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "twoblueshoes", "parent_id": "t1_dgcub14", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Ooh, that looks interesting. I put some ingredients I have in and it spit ideas back out, and some of them are new and different, and not too complicated. Bookmarking this site. Thanks! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ooh, that looks interesting. I put some ingredients I have in and it spit ideas back out, and some of them are new and different, and not too complicated. Bookmarking this site. Thanks! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgcuqdn", "score_hidden": false, "stickied": false, "created": 1492419031.0, "created_utc": 1492390231.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcub14", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "erkadurka", "parent_id": "t3_65s5n5", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "You can try myfridgefood.com", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can try myfridgefood.com&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgcub14", "score_hidden": false, "stickied": false, "created": 1492418464.0, "created_utc": 1492389664.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65s5n5", "likes": null, "replies": "", "user_reports": [], "id": "dgd0oc6", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "pandasmakeherdance", "parent_id": "t3_65s5n5", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "To me, it can be helpful to pick a theme to grocery shop around. For example, texmex week I might buy tortillas, beans, peppers, onions, rice, corn, tortilla chips and whatever meat I wanted. One night you can eat burrito bowls, then nachos, quesadillas or tacos etc. Your produce should go far since you can use any of your ingredients in every dish. You could do this with lots of different themes: Mediterranean, Asian, Italian, whatever you can think of! \n\nPS- if getting bored is a problem, remember you can always freeze things to eat later on. If you get into the habit of freezing a portion or two automatically, then you always have stuff you can pull out of the freezer. This really helps keep things interesting, imo. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To me, it can be helpful to pick a theme to grocery shop around. For example, texmex week I might buy tortillas, beans, peppers, onions, rice, corn, tortilla chips and whatever meat I wanted. One night you can eat burrito bowls, then nachos, quesadillas or tacos etc. Your produce should go far since you can use any of your ingredients in every dish. You could do this with lots of different themes: Mediterranean, Asian, Italian, whatever you can think of! &lt;/p&gt;\n\n&lt;p&gt;PS- if getting bored is a problem, remember you can always freeze things to eat later on. If you get into the habit of freezing a portion or two automatically, then you always have stuff you can pull out of the freezer. This really helps keep things interesting, imo. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgd0oc6", "score_hidden": false, "stickied": false, "created": 1492427107.0, "created_utc": 1492398307.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65s5n5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65s5n5", "likes": null, "replies": "", "user_reports": [], "id": "dgcub37", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "twoblueshoes", "parent_id": "t1_dgcso0g", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Damn, I was looking for an easier way out ;). Guess I may just have to bite the bullet and spend some time meal planning! I've tried a few Pinterest recipes, and results have been mixed. No worse luck than allrecipes.com though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn, I was looking for an easier way out ;). Guess I may just have to bite the bullet and spend some time meal planning! I&amp;#39;ve tried a few Pinterest recipes, and results have been mixed. No worse luck than allrecipes.com though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgcub37", "score_hidden": false, "stickied": false, "created": 1492418466.0, "created_utc": 1492389666.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcso0g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MrTootenbacher", "parent_id": "t3_65s5n5", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Girl, we have the same issues. My solution was to go on Pinterest and plan to make 2/3 of the recipes during the week. I would go grocery shopping based off of those lists. It's take some more work but I thank myself after I actually get excited to eat my dinner.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Girl, we have the same issues. My solution was to go on Pinterest and plan to make 2/3 of the recipes during the week. I would go grocery shopping based off of those lists. It&amp;#39;s take some more work but I thank myself after I actually get excited to eat my dinner.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgcso0g", "score_hidden": false, "stickied": false, "created": 1492416239.0, "created_utc": 1492387439.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65s5n5", "likes": null, "replies": "", "user_reports": [], "id": "dgd3bjd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Katxbug", "parent_id": "t3_65s5n5", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Try a food subscription service for a week or two like Blueapron or HelloFresh (I've tried both and can give opinions if you want).\nEven just borrow the recipes from the site! Made me and the SO try a lot of new recipes we never thought we would like and you get the exact right amount of ingredients so nothing will go bad and no leftovers. Plus it makes shopping a breeze ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try a food subscription service for a week or two like Blueapron or HelloFresh (I&amp;#39;ve tried both and can give opinions if you want).\nEven just borrow the recipes from the site! Made me and the SO try a lot of new recipes we never thought we would like and you get the exact right amount of ingredients so nothing will go bad and no leftovers. Plus it makes shopping a breeze ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgd3bjd", "score_hidden": false, "stickied": false, "created": 1492431128.0, "created_utc": 1492402328.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65s5n5", "likes": null, "replies": "", "user_reports": [], "id": "dgen8i0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DamnPurpleDress", "parent_id": "t3_65s5n5", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "There is no perfect app that I've discovered yet -  food network or allrecipes.com are my go to's - all recipes people can rate, provide comments on adjustments or offer feedback. I also borrow cook books from the library because that shit has been tested MANY times for successful outcomes before the book gets published.  Pintrest I find is great pictures, but ultimately the majority of pintrest is people wanting to generate content so things may be flawed, not tested, or people just being garbage cooks but make it look all nice and flashy and web designed to get hits. So I sometimes see something on pinterest, but then go to allrecipes to find a few variations and choose a version where there a few of the same so I know it's normal/common instructions, ingredient portions etc (like 5 will be almost identical, just slightly different, but one will be just bonkers so I use one of the similar ones to be safe. Once I've made it a few times then I can try the bonkers version or modify it for our taste).  \n  \nMy own pinterest has a secret board of \"will my family eat this\" where I put new ideas, and a secret board of \"yes we will actually eat this\" for things we've tried and liked.  I can edit the little comment below the picture as well if half the kids liked it, but I hated it for future reference or we reduced or increased a spice or cook time.  I try to schedule our meal plans by having a chicken, a pork, a beef, a pasta/casserole, a meat/potato and leaving two days for leftovers or quick dinners. The first two meals in a week are fresh, the rest I freeze the protein - we prefer most red meat fresh so today we had steak, tomorrow we're having slow cooked pork ribs.  I keep an excel file of dinners we like that I can browse through for inspiration.  Every few months we also try to conjure up favourite meals from a restaurant, the best thing a friends mom served growing up, something we ate at summer camp - just things that are not in our rotation.  Like my mom made potato, bacon, onion hash while camping when I was a kid- would never made this usually, but something reminded me of it and it just sounded SO GOOD so we're having that with italian sausage and raw veggie sticks. High fat meal, but it keeps things interesting.  Or the kids might ask for sloppy jo's or something like I've never made it but their aunt has so we figure out the best recipe online and get it done.  Turns out no one really likes sloppy beef on a bun, we'd rather home made burger patties, but it was fun!\n  \nProduce I buy twice a week so I buy our basics (salad stuff for a few days, peppers/broccoli/asparagus/green beans/cauliflower, stuff for raw veg snacks, fruit) and I try to meal plan/buy only one extra/different produce item a week (like bok choy, cabbage, squash) just stuff we don't always buy, or it needs more prep/cook time then steaming a green veg does or only goes in certain recipes - that way if we don't get around to using it all up I don't feel so guilty or if we don't like it once cooked then I don't feel bad about composting the leftovers.  I keep the same pattern with the pantry stuff as well - I know I can't make 4 new things in a week. 1 new thing some weeks is even too much, so having basics on hand like stock, tomato sauces, some beans, our standard spices, a few rices, some bbq sauce - that stuff will get used up eventually. If we don't use the new/weird ingredient (like artichoke hearts or jarred beets) then it's first on the next meal plan so it doesn't stick around forever.\n  \n If you're stuck with things in the pantry then go on allrecipes and look up that ingredient and it will give you many options. The rest of the week we pull the protein from the freezer the night before or decide on leftovers/quick dinner like eggs. Plan your meals so you're having interesting/new stuff early in the week or the weekend that you can really focus on cooking, and whip up your standbys on your busier nights. That way you'll use up all the new ingredients early in the week when you have energy and motivation, and your healthy standbys are there that you can make mindlessly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no perfect app that I&amp;#39;ve discovered yet -  food network or allrecipes.com are my go to&amp;#39;s - all recipes people can rate, provide comments on adjustments or offer feedback. I also borrow cook books from the library because that shit has been tested MANY times for successful outcomes before the book gets published.  Pintrest I find is great pictures, but ultimately the majority of pintrest is people wanting to generate content so things may be flawed, not tested, or people just being garbage cooks but make it look all nice and flashy and web designed to get hits. So I sometimes see something on pinterest, but then go to allrecipes to find a few variations and choose a version where there a few of the same so I know it&amp;#39;s normal/common instructions, ingredient portions etc (like 5 will be almost identical, just slightly different, but one will be just bonkers so I use one of the similar ones to be safe. Once I&amp;#39;ve made it a few times then I can try the bonkers version or modify it for our taste).  &lt;/p&gt;\n\n&lt;p&gt;My own pinterest has a secret board of &amp;quot;will my family eat this&amp;quot; where I put new ideas, and a secret board of &amp;quot;yes we will actually eat this&amp;quot; for things we&amp;#39;ve tried and liked.  I can edit the little comment below the picture as well if half the kids liked it, but I hated it for future reference or we reduced or increased a spice or cook time.  I try to schedule our meal plans by having a chicken, a pork, a beef, a pasta/casserole, a meat/potato and leaving two days for leftovers or quick dinners. The first two meals in a week are fresh, the rest I freeze the protein - we prefer most red meat fresh so today we had steak, tomorrow we&amp;#39;re having slow cooked pork ribs.  I keep an excel file of dinners we like that I can browse through for inspiration.  Every few months we also try to conjure up favourite meals from a restaurant, the best thing a friends mom served growing up, something we ate at summer camp - just things that are not in our rotation.  Like my mom made potato, bacon, onion hash while camping when I was a kid- would never made this usually, but something reminded me of it and it just sounded SO GOOD so we&amp;#39;re having that with italian sausage and raw veggie sticks. High fat meal, but it keeps things interesting.  Or the kids might ask for sloppy jo&amp;#39;s or something like I&amp;#39;ve never made it but their aunt has so we figure out the best recipe online and get it done.  Turns out no one really likes sloppy beef on a bun, we&amp;#39;d rather home made burger patties, but it was fun!&lt;/p&gt;\n\n&lt;p&gt;Produce I buy twice a week so I buy our basics (salad stuff for a few days, peppers/broccoli/asparagus/green beans/cauliflower, stuff for raw veg snacks, fruit) and I try to meal plan/buy only one extra/different produce item a week (like bok choy, cabbage, squash) just stuff we don&amp;#39;t always buy, or it needs more prep/cook time then steaming a green veg does or only goes in certain recipes - that way if we don&amp;#39;t get around to using it all up I don&amp;#39;t feel so guilty or if we don&amp;#39;t like it once cooked then I don&amp;#39;t feel bad about composting the leftovers.  I keep the same pattern with the pantry stuff as well - I know I can&amp;#39;t make 4 new things in a week. 1 new thing some weeks is even too much, so having basics on hand like stock, tomato sauces, some beans, our standard spices, a few rices, some bbq sauce - that stuff will get used up eventually. If we don&amp;#39;t use the new/weird ingredient (like artichoke hearts or jarred beets) then it&amp;#39;s first on the next meal plan so it doesn&amp;#39;t stick around forever.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re stuck with things in the pantry then go on allrecipes and look up that ingredient and it will give you many options. The rest of the week we pull the protein from the freezer the night before or decide on leftovers/quick dinner like eggs. Plan your meals so you&amp;#39;re having interesting/new stuff early in the week or the weekend that you can really focus on cooking, and whip up your standbys on your busier nights. That way you&amp;#39;ll use up all the new ingredients early in the week when you have energy and motivation, and your healthy standbys are there that you can make mindlessly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgen8i0", "score_hidden": false, "stickied": false, "created": 1492515606.0, "created_utc": 1492486806.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]