[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I mean, let&amp;#39;s just get into it. TMI for the fact that every surface I seem to own now is covered in sanitary products.&lt;/p&gt;\n\n&lt;p&gt;So for this past period I&amp;#39;ve been trying to switch to tampons from pads. The problem is I can&amp;#39;t get a tampon in more than half/ a third way up.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been able to get my finger in further than the tampon itself, and I&amp;#39;ve been using the ones without applicators because the applicators just... confuse me to no extent. I also bought a few different absorbencies, and my last try was using the one with the lightest as recommended. I don&amp;#39;t think I can try again now, because my period is ending so there&amp;#39;s not that much blood any more. Additionally, after a while of trying to tilt the tampon, it sucks up all the moisture and I need to take a break before I can try again since it&amp;#39;s too dry and painful.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been thinking:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;hymen; this one seems unlikely considering every time I get the tampon back out to try again, about half of it is covered in blood... but I&amp;#39;m not ruling it out since they soak up any liquid so quickly so my hymen might just be more in the way than normal&lt;/li&gt;\n&lt;li&gt;tilted cervix; I&amp;#39;ve been feeling my way in with my finger and it seems like I really need to find the direction in which to guide the tampon, because once I get far up enough I tend to hit pressure and it hurts a bit to continue/ cannot continue because the tampon keeps bouncing back out&lt;/li&gt;\n&lt;li&gt;vaginismus; possibly? I&amp;#39;ve never had sex, my disinterest in everything to do with genitalia means that I&amp;#39;ve never had to handle my vagina much before trying tampons (as a grown adult no less lol)&lt;/li&gt;\n&lt;li&gt;small vagina; I don&amp;#39;t know what constitutes as small, but I have a feeling mine might be, and I wonder if smaller ones are likely to have problems with tampons&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I&amp;#39;ve tried using a mirror, I&amp;#39;ve tried different positions, and I seem to be making a small amount of progress (I seem to be able to get the tampon up further than before), but no success.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to a smear test soon so I&amp;#39;ll talk with a doctor before my next period, but I thought I&amp;#39;d ask here before I do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I mean, let's just get into it. TMI for the fact that every surface I seem to own now is covered in sanitary products.\n\nSo for this past period I've been trying to switch to tampons from pads. The problem is I can't get a tampon in more than half/ a third way up.\n\nI've been able to get my finger in further than the tampon itself, and I've been using the ones without applicators because the applicators just... confuse me to no extent. I also bought a few different absorbencies, and my last try was using the one with the lightest as recommended. I don't think I can try again now, because my period is ending so there's not that much blood any more. Additionally, after a while of trying to tilt the tampon, it sucks up all the moisture and I need to take a break before I can try again since it's too dry and painful.\n\nI've been thinking:\n\n- hymen; this one seems unlikely considering every time I get the tampon back out to try again, about half of it is covered in blood... but I'm not ruling it out since they soak up any liquid so quickly so my hymen might just be more in the way than normal\n- tilted cervix; I've been feeling my way in with my finger and it seems like I really need to find the direction in which to guide the tampon, because once I get far up enough I tend to hit pressure and it hurts a bit to continue/ cannot continue because the tampon keeps bouncing back out\n- vaginismus; possibly? I've never had sex, my disinterest in everything to do with genitalia means that I've never had to handle my vagina much before trying tampons (as a grown adult no less lol)\n- small vagina; I don't know what constitutes as small, but I have a feeling mine might be, and I wonder if smaller ones are likely to have problems with tampons\n\nI've tried using a mirror, I've tried different positions, and I seem to be making a small amount of progress (I seem to be able to get the tampon up further than before), but no success.\n\nI'm going to a smear test soon so I'll talk with a doctor before my next period, but I thought I'd ask here before I do?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65uq99", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "problemzzzzzz", "saved": false, "mod_reports": [], "name": "t3_65uq99", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/65uq99/tampon_issues_tmi/", "num_reports": null, "locked": false, "stickied": false, "created": 1492453107.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/65uq99/tampon_issues_tmi/", "author_flair_text": null, "quarantine": false, "title": "Tampon issues... (TMI)", "created_utc": 1492424307.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65uq99", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65uq99", "likes": null, "replies": "", "user_reports": [], "id": "dgdzmyd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rosydoodles", "parent_id": "t1_dgdpixu", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "&gt; Once you have it inserted comfortable take the skinny plunger part and push on that.\n\nAnd if the tampon is very short and there's almost no distance, pull it out until it sits below the tampon first. Those were the first tampons I encountered and somehow my brain just couldn't figure out how they worked until my best friend told me,", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Once you have it inserted comfortable take the skinny plunger part and push on that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And if the tampon is very short and there&amp;#39;s almost no distance, pull it out until it sits below the tampon first. Those were the first tampons I encountered and somehow my brain just couldn&amp;#39;t figure out how they worked until my best friend told me,&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgdzmyd", "score_hidden": false, "stickied": false, "created": 1492486576.0, "created_utc": 1492457776.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpixu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NotACorythosaurus", "parent_id": "t3_65uq99", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Because you can get a finger further than a tampon I do t think it's a hymen or vaginimus. I would recommend trying the one with the applicators, though hopefully I can make it less confusing. So the applicator is a round smooth piece of plastic, kinda like a finger. The great part is that the outer part won't dry you out so you can adjust it a bunch before the tampon is exposed. So take the applicator, holding the bit at the end of the wider part and try to find a comfortable place to insert it. Try a couple different angles. I like to have it seated so that my finger are maybe half an inch inside my vagina, this should be the right place so that the tampon is past my pubic bone. Once you have it inserted comfortable take the skinny plunger part and push on that. While still holding the bottom of the wide part. The tampon will come through the opening at the top of the wide part, and the wide part will slide down on to the skinny part. The tampon will stay in place. Sometimes I have to adjust the tampon a bit with my fingers once the applicator comes off, but since it's in mostly the right place it isn't too difficult. Hope this helps you out, and good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because you can get a finger further than a tampon I do t think it&amp;#39;s a hymen or vaginimus. I would recommend trying the one with the applicators, though hopefully I can make it less confusing. So the applicator is a round smooth piece of plastic, kinda like a finger. The great part is that the outer part won&amp;#39;t dry you out so you can adjust it a bunch before the tampon is exposed. So take the applicator, holding the bit at the end of the wider part and try to find a comfortable place to insert it. Try a couple different angles. I like to have it seated so that my finger are maybe half an inch inside my vagina, this should be the right place so that the tampon is past my pubic bone. Once you have it inserted comfortable take the skinny plunger part and push on that. While still holding the bottom of the wide part. The tampon will come through the opening at the top of the wide part, and the wide part will slide down on to the skinny part. The tampon will stay in place. Sometimes I have to adjust the tampon a bit with my fingers once the applicator comes off, but since it&amp;#39;s in mostly the right place it isn&amp;#39;t too difficult. Hope this helps you out, and good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgdpixu", "score_hidden": false, "stickied": false, "created": 1492475267.0, "created_utc": 1492446467.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65uq99", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65uq99", "likes": null, "replies": "", "user_reports": [], "id": "dgdncrd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "problemzzzzzz", "parent_id": "t1_dgdkqep", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "The reason I want to switch is because of summer... I have quite heavy flow at the beginning and pads feel incredibly gross during summer heat.\n\nI've read around a bit and it definitely seems that tampons aren't for everyone, but the prospect of changing pads about 5 times a day every summer is enough to make me try tampons.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The reason I want to switch is because of summer... I have quite heavy flow at the beginning and pads feel incredibly gross during summer heat.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve read around a bit and it definitely seems that tampons aren&amp;#39;t for everyone, but the prospect of changing pads about 5 times a day every summer is enough to make me try tampons.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgdncrd", "score_hidden": false, "stickied": false, "created": 1492472804.0, "created_utc": 1492444004.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkqep", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TrustMeImADinosaur", "parent_id": "t3_65uq99", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I've never been able to use Tampons and I am 27. I find them very uncomfortable to wear and they hurt even more when I take them out. It could be worth talking to your doctor about but I genuinely don't know a lot of women who actually use Tampons.\n\n Is there a reason you want to switch?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never been able to use Tampons and I am 27. I find them very uncomfortable to wear and they hurt even more when I take them out. It could be worth talking to your doctor about but I genuinely don&amp;#39;t know a lot of women who actually use Tampons.&lt;/p&gt;\n\n&lt;p&gt;Is there a reason you want to switch?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgdkqep", "score_hidden": false, "stickied": false, "created": 1492469676.0, "created_utc": 1492440876.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65uq99", "likes": null, "replies": "", "user_reports": [], "id": "dgdua7l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kvaderr", "parent_id": "t3_65uq99", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I still have this trouble from time to time after using tampons for many years. I'm 32 and married. The most trouble I have is on my light days, not even a thin one would work! I have to use a bit of \"lube\" to get it in. Try that and also work your angles.. don't tense up, that'll make it harder!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I still have this trouble from time to time after using tampons for many years. I&amp;#39;m 32 and married. The most trouble I have is on my light days, not even a thin one would work! I have to use a bit of &amp;quot;lube&amp;quot; to get it in. Try that and also work your angles.. don&amp;#39;t tense up, that&amp;#39;ll make it harder!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgdua7l", "score_hidden": false, "stickied": false, "created": 1492480535.0, "created_utc": 1492451735.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65uq99", "likes": null, "replies": "", "user_reports": [], "id": "dge0iou", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "daydreamer0923", "parent_id": "t3_65uq99", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "If tampons aren't working for you, maybe try menstrual cups? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If tampons aren&amp;#39;t working for you, maybe try menstrual cups? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dge0iou", "score_hidden": false, "stickied": false, "created": 1492487563.0, "created_utc": 1492458763.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65uq99", "likes": null, "replies": "", "user_reports": [], "id": "dgdvep9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "des_tructive", "parent_id": "t3_65uq99", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "Try applicators again because they are smooth whereas just the tampon is dry and cotton-y and hard to insert by itself.\n\nHold the applicator by its little end and insert it until your fingers hit your skin. Once it's full inserted push the bottom thing to push the tampon in. (Usually before I even insert it, Ill push it a little bit so I dont have to use as much force when it's inside.) When its inserted and you're pushing the tampon out of the applictor flex your muscles, like you're doing kegels, to help pull it in! That works for me.\n\nFinally, dont try to pull it out before it's ready. You can check periodically (heh) to see if there is any deep red on the tampon string and if there is, it's time to change it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try applicators again because they are smooth whereas just the tampon is dry and cotton-y and hard to insert by itself.&lt;/p&gt;\n\n&lt;p&gt;Hold the applicator by its little end and insert it until your fingers hit your skin. Once it&amp;#39;s full inserted push the bottom thing to push the tampon in. (Usually before I even insert it, Ill push it a little bit so I dont have to use as much force when it&amp;#39;s inside.) When its inserted and you&amp;#39;re pushing the tampon out of the applictor flex your muscles, like you&amp;#39;re doing kegels, to help pull it in! That works for me.&lt;/p&gt;\n\n&lt;p&gt;Finally, dont try to pull it out before it&amp;#39;s ready. You can check periodically (heh) to see if there is any deep red on the tampon string and if there is, it&amp;#39;s time to change it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgdvep9", "score_hidden": false, "stickied": false, "created": 1492481783.0, "created_utc": 1492452983.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65uq99", "likes": null, "replies": "", "user_reports": [], "id": "dgeklki", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DamnPurpleDress", "parent_id": "t3_65uq99", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "It could be a hymen situation if you've not been sexually active.  If you are using non applicator tampons like the brand OB - to get used to inserting on your first day of a period lightly coat it in vaseline or lube - it will be less absorbent but will help you be comfortable with the motion, and if you can wear it for a few hours you can get comfortable with it there (which it really shouldn't feel like anything is there if it's the right absorbency - or maybe you can kind of feel it but it should be sort of forgettable?)  If you're inserting/taking out multiple times it will not be comfortable - the dry fiber of the tampon pulls against your vaginal walls and will irritate it so next period try the lube/vaseline with the smallest OB tampon and see how that feels.  Later if using OB you'll want to fan the base of the tampon out but you'll get to that. (and to be honest I have a heavy flow so I wear the highest absorbency tampon and I have to wear a pad but the tampons kind of give me an hour or so before leaks start)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It could be a hymen situation if you&amp;#39;ve not been sexually active.  If you are using non applicator tampons like the brand OB - to get used to inserting on your first day of a period lightly coat it in vaseline or lube - it will be less absorbent but will help you be comfortable with the motion, and if you can wear it for a few hours you can get comfortable with it there (which it really shouldn&amp;#39;t feel like anything is there if it&amp;#39;s the right absorbency - or maybe you can kind of feel it but it should be sort of forgettable?)  If you&amp;#39;re inserting/taking out multiple times it will not be comfortable - the dry fiber of the tampon pulls against your vaginal walls and will irritate it so next period try the lube/vaseline with the smallest OB tampon and see how that feels.  Later if using OB you&amp;#39;ll want to fan the base of the tampon out but you&amp;#39;ll get to that. (and to be honest I have a heavy flow so I wear the highest absorbency tampon and I have to wear a pad but the tampons kind of give me an hour or so before leaks start)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgeklki", "score_hidden": false, "stickied": false, "created": 1492512135.0, "created_utc": 1492483335.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]