[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Has anyone out there taken steps to recover from abuse? &lt;/p&gt;\n\n&lt;p&gt;I have been in a number of romantic relationships where I&amp;#39;ve noticed abusive behaviors occurred, and I got out sooner rather than later in one that ended this past Friday, because I felt all this old trauma bubbling up and behaviors that felt cruel that weren&amp;#39;t made up for or disapating. (And thanks to another post, I read the book &amp;quot;&lt;a href=\"http://unityandstruggle.org/wp-content/uploads/2016/04/Lundy_Why-does-he-do-that.pdf\"&gt;Why Does He Do That&lt;/a&gt;&amp;quot;). I&amp;#39;ve spent two separate evenings on crisis hotlines to deal with the depression and suicidal thoughts and found some suggestions to start with long and short term healing as well as taken some actions suggested by friends, but this road seems long and I am still grasping to find more solutions.  &lt;/p&gt;\n\n&lt;p&gt;Things that have been suggested (and I&amp;#39;ve done or am starting to do): \n1. Block and delete this person everywhere. You do not need to be in contact with them. What they did is unacceptable. Block and delete their friends and family too if you are still feeling afraid. ( I did this yesterday and it is so hard because I still &lt;em&gt;want&lt;/em&gt; to be able to connect with them even though I know I should not feel that way.)\n2. Make a list of why you did the right thing and put it somewhere where you can see it often\n3. Download an app for stress and anxiety (relax, stress and anxiety relief is what was recommended)\n4. Search for a therapist who specializes in trauma (this one sends the most necessary, yet also the hardest one to start)&lt;/p&gt;\n\n&lt;p&gt;What else is there? What else can I/ do I need to do to get past this?&lt;/p&gt;\n\n&lt;p&gt;❤️ &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Has anyone out there taken steps to recover from abuse? \n\nI have been in a number of romantic relationships where I've noticed abusive behaviors occurred, and I got out sooner rather than later in one that ended this past Friday, because I felt all this old trauma bubbling up and behaviors that felt cruel that weren't made up for or disapating. (And thanks to another post, I read the book \"[Why Does He Do That](http://unityandstruggle.org/wp-content/uploads/2016/04/Lundy_Why-does-he-do-that.pdf)\"). I've spent two separate evenings on crisis hotlines to deal with the depression and suicidal thoughts and found some suggestions to start with long and short term healing as well as taken some actions suggested by friends, but this road seems long and I am still grasping to find more solutions.  \n\nThings that have been suggested (and I've done or am starting to do): \n1. Block and delete this person everywhere. You do not need to be in contact with them. What they did is unacceptable. Block and delete their friends and family too if you are still feeling afraid. ( I did this yesterday and it is so hard because I still *want* to be able to connect with them even though I know I should not feel that way.)\n2. Make a list of why you did the right thing and put it somewhere where you can see it often\n3. Download an app for stress and anxiety (relax, stress and anxiety relief is what was recommended)\n4. Search for a therapist who specializes in trauma (this one sends the most necessary, yet also the hardest one to start)\n\nWhat else is there? What else can I/ do I need to do to get past this?\n\n❤️ ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65wbqw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "potatom0nster", "saved": false, "mod_reports": [], "name": "t3_65wbqw", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": 1492445032.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/65wbqw/recovering_from_abuse/", "num_reports": null, "locked": false, "stickied": false, "created": 1492472769.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/65wbqw/recovering_from_abuse/", "author_flair_text": null, "quarantine": false, "title": "Recovering from Abuse", "created_utc": 1492443969.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65wbqw", "likes": null, "replies": "", "user_reports": [], "id": "dge8itt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nippleduster7", "parent_id": "t3_65wbqw", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I am also recovering from abusive relationships in my past. Your list of things you are doing/going to do is great. Some things that helped me in recovery;\n\n• taking a self-defense class (this left me feeling empowered, strong and safe, which for me was huge as I was now on my own). \n\n• making decisions solely for myself/learning to say no to things I don't want to do. This one has been a huuuuuge help for me. I don't do anything anymore that I don't want to do, nor do I allow myself to feel guilty for saying no. \n\n• finding a creative outlet; journaling, painting, music, etc. This can help with healing and expressing yourself in a positive way. \n\n• \"TREAT YO' SELF,\"- doing at least one fun thing per week for myself, by myself. Whether it be taking myself to a museum, or splurging on that ice cream sundae I'd been craving, this can be wonderful. This part was hugely helpful for me as I struggled with being alone, which was a big part of what kept me from leaving my past abusers. This taught me that being alone can be F U N, and taught me how to love myself again. It also counts as self care, which is another BIG part of the recovery process. \n\n• SELF CARE!!! This can be a variety of things, I think it is different for every one. Things such as exercising, eating right, having a good relationship with sleep (going to bed on time, waking up on time, no screens in room, etc.), hygiene, face masks, getting my nails done.. a lot of things fall under this category and I love it. Now is the time for you to be putting yourself; your physical and mental health first. I am certain a therapist will bring, \"self care,\" up, too, and you should ask what they consider to be self care for more ideas. \n\nI hope some of these appeal to you and are able to help you some! I am very proud of you for getting out when you did. You are a very strong person for doing so. You are appreciated and inspiring!\n\nEdit: thought about this after I posted, but getting a pet if you don't already have one (if you like pets) was a really big help for me. Just having something to come home to that depended on me. Nothing says love more than a co-dependent relationship with a pet! \n\nSource: Been in two physically, verbally and mentally abusive long term relationships and have recovered after a very long road!\n\nIf you would like any more ideas or have any questions, let me know! ", "edited": 1492469028.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am also recovering from abusive relationships in my past. Your list of things you are doing/going to do is great. Some things that helped me in recovery;&lt;/p&gt;\n\n&lt;p&gt;• taking a self-defense class (this left me feeling empowered, strong and safe, which for me was huge as I was now on my own). &lt;/p&gt;\n\n&lt;p&gt;• making decisions solely for myself/learning to say no to things I don&amp;#39;t want to do. This one has been a huuuuuge help for me. I don&amp;#39;t do anything anymore that I don&amp;#39;t want to do, nor do I allow myself to feel guilty for saying no. &lt;/p&gt;\n\n&lt;p&gt;• finding a creative outlet; journaling, painting, music, etc. This can help with healing and expressing yourself in a positive way. &lt;/p&gt;\n\n&lt;p&gt;• &amp;quot;TREAT YO&amp;#39; SELF,&amp;quot;- doing at least one fun thing per week for myself, by myself. Whether it be taking myself to a museum, or splurging on that ice cream sundae I&amp;#39;d been craving, this can be wonderful. This part was hugely helpful for me as I struggled with being alone, which was a big part of what kept me from leaving my past abusers. This taught me that being alone can be F U N, and taught me how to love myself again. It also counts as self care, which is another BIG part of the recovery process. &lt;/p&gt;\n\n&lt;p&gt;• SELF CARE!!! This can be a variety of things, I think it is different for every one. Things such as exercising, eating right, having a good relationship with sleep (going to bed on time, waking up on time, no screens in room, etc.), hygiene, face masks, getting my nails done.. a lot of things fall under this category and I love it. Now is the time for you to be putting yourself; your physical and mental health first. I am certain a therapist will bring, &amp;quot;self care,&amp;quot; up, too, and you should ask what they consider to be self care for more ideas. &lt;/p&gt;\n\n&lt;p&gt;I hope some of these appeal to you and are able to help you some! I am very proud of you for getting out when you did. You are a very strong person for doing so. You are appreciated and inspiring!&lt;/p&gt;\n\n&lt;p&gt;Edit: thought about this after I posted, but getting a pet if you don&amp;#39;t already have one (if you like pets) was a really big help for me. Just having something to come home to that depended on me. Nothing says love more than a co-dependent relationship with a pet! &lt;/p&gt;\n\n&lt;p&gt;Source: Been in two physically, verbally and mentally abusive long term relationships and have recovered after a very long road!&lt;/p&gt;\n\n&lt;p&gt;If you would like any more ideas or have any questions, let me know! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dge8itt", "score_hidden": false, "stickied": false, "created": 1492497016.0, "created_utc": 1492468216.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65wbqw", "likes": null, "replies": "", "user_reports": [], "id": "dgesq1b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ohletsrunaway", "parent_id": "t3_65wbqw", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I was in an emotionally abusive relationship about a year ago. It only lasted for a few months but I'm starting to realize now I really never took the time to heal myself. I don't have any tips but I just wanted to send my support. We are stronger than we take credit for &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in an emotionally abusive relationship about a year ago. It only lasted for a few months but I&amp;#39;m starting to realize now I really never took the time to heal myself. I don&amp;#39;t have any tips but I just wanted to send my support. We are stronger than we take credit for &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgesq1b", "score_hidden": false, "stickied": false, "created": 1492524997.0, "created_utc": 1492496197.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]