[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheGirlSurvivalGuide", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Please help me. I really need to get over this and clear my mind once and for all and I don&amp;#39;t know how. I&amp;#39;m embarrassed because I feel like I&amp;#39;ve been talking to him about it for days and he has the patience of a saint.&lt;/p&gt;\n\n&lt;p&gt;Months ago, I found out something about my boyfriend that made me feel uncomfortable. It is literally the only negative thing in our relationship and I hate myself so much for letting it affect me the way it has. Long story short: I found out that he fantasized about some of his coworkers while pleasuring himself. It&amp;#39;s a private thing and I wish I hadn&amp;#39;t found out but now that it&amp;#39;s out of the box, I&amp;#39;ve been feeling insecure and... cheated? &lt;/p&gt;\n\n&lt;p&gt;The thing is, I&amp;#39;ve read countless Reddit and Metafilter threads about similar topics. Other women like me have experienced this and questioned their feelings about it. I read different opinions by women, who say they would break up with the guy immediately, while some others say it&amp;#39;s harmless and that they do it too. Some men comment that it&amp;#39;s gross and they&amp;#39;d never do it while others comment that it&amp;#39;s common but that&amp;#39;s it&amp;#39;s an unspoken thing, that you don&amp;#39;t tell your girlfriend about it. I&amp;#39;m experiencing a lot of cognitive dissonance about it. I don&amp;#39;t want to &amp;quot;thought police&amp;quot; my boyfriend - he can think about whatever he wants, we all do that, but now that I know who he thought about and what they look like, I&amp;#39;m having trouble overcoming the bad feelings.&lt;/p&gt;\n\n&lt;p&gt;I do not want to break up with my boyfriend about this. Our 1 year anniversary is this week! He makes me so happy, he&amp;#39;s so gentle and sweet and understanding and our sex life is awesome. He&amp;#39;s very affectionate and loving and I can tell he loves me. I was with an abusive boyfriend for 4 years before him so I think my insecurity about other girls comes partly from that.&lt;/p&gt;\n\n&lt;p&gt;But seeing and knowing exactly who he masturbated to, while we were together, really hurt me and I feel bad every time I talk to him about it. He&amp;#39;s apologized. I don&amp;#39;t want to judge him for something he did privately, but the fact that he saw these women at work makes me feel inadequate. He no longer works with them and after realizing how much what he did hurt me, he promptly unfollowed them all and told he wouldn&amp;#39;t do it again. He was under the impression it was a harmless thing to do since it was just a fantasy and not something he wants in real life, but on same level he also knew it was wrong since he also hid it from me when browsing social media. &lt;/p&gt;\n\n&lt;p&gt;I read other guys perspectives on this situation and was crushed to find out that not everyone is like me. When I&amp;#39;m happy in a relationship, I can&amp;#39;t find think about other guys sexually. I&amp;#39;ll admit when I was with my ex I thought about other men that way, even a coworker of mine, but I was extremely unhappy. My boyfriend told me it&amp;#39;s not the same for him, and his fantasies had nothing to do with how he felt about me, it was just a quick way for him to get off, a habit he&amp;#39;d had because it was easy when he was horny.&lt;/p&gt;\n\n&lt;p&gt;I just need to know that I&amp;#39;m not crazy in wanting to get over this. I keep having obsessive thoughts about it and getting sad. I&amp;#39;m prone to anxiety which is making things worse. I don&amp;#39;t want to leave him over this, I just want to get over it and move on! I told him I forgave him since it wasn&amp;#39;t even something he&amp;#39;d lied to me about, and he was very open and communicative the whole time. But I can&amp;#39;t shake the anxiety and it&amp;#39;s affecting my mental health and the way I am with my boyfriend when we&amp;#39;re together.&lt;/p&gt;\n\n&lt;p&gt;What prompted me to post this is that I saw one of the girls at the grocery stores and the anxiety came back. I know I have self esteem issues but is this something that will just take time? What would you do? &lt;/p&gt;\n\n&lt;p&gt;I want things to go back to how we were when I didn&amp;#39;t even know about this! But I guess knowing is better, since it&amp;#39;s allowed us to have this conversation and he&amp;#39;s changed his behaviour and doesn&amp;#39;t do it anymore. We&amp;#39;re supposed to take a trip together in the summer and I&amp;#39;m moving into my own apartment which we were both so excited about, but now I feel lost in my own obsessive thoughts about what happened and I&amp;#39;m scared of not being enough for him despite what he told me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Please help me. I really need to get over this and clear my mind once and for all and I don't know how. I'm embarrassed because I feel like I've been talking to him about it for days and he has the patience of a saint.\n\nMonths ago, I found out something about my boyfriend that made me feel uncomfortable. It is literally the only negative thing in our relationship and I hate myself so much for letting it affect me the way it has. Long story short: I found out that he fantasized about some of his coworkers while pleasuring himself. It's a private thing and I wish I hadn't found out but now that it's out of the box, I've been feeling insecure and... cheated? \n\nThe thing is, I've read countless Reddit and Metafilter threads about similar topics. Other women like me have experienced this and questioned their feelings about it. I read different opinions by women, who say they would break up with the guy immediately, while some others say it's harmless and that they do it too. Some men comment that it's gross and they'd never do it while others comment that it's common but that's it's an unspoken thing, that you don't tell your girlfriend about it. I'm experiencing a lot of cognitive dissonance about it. I don't want to \"thought police\" my boyfriend - he can think about whatever he wants, we all do that, but now that I know who he thought about and what they look like, I'm having trouble overcoming the bad feelings.\n\nI do not want to break up with my boyfriend about this. Our 1 year anniversary is this week! He makes me so happy, he's so gentle and sweet and understanding and our sex life is awesome. He's very affectionate and loving and I can tell he loves me. I was with an abusive boyfriend for 4 years before him so I think my insecurity about other girls comes partly from that.\n\nBut seeing and knowing exactly who he masturbated to, while we were together, really hurt me and I feel bad every time I talk to him about it. He's apologized. I don't want to judge him for something he did privately, but the fact that he saw these women at work makes me feel inadequate. He no longer works with them and after realizing how much what he did hurt me, he promptly unfollowed them all and told he wouldn't do it again. He was under the impression it was a harmless thing to do since it was just a fantasy and not something he wants in real life, but on same level he also knew it was wrong since he also hid it from me when browsing social media. \n\nI read other guys perspectives on this situation and was crushed to find out that not everyone is like me. When I'm happy in a relationship, I can't find think about other guys sexually. I'll admit when I was with my ex I thought about other men that way, even a coworker of mine, but I was extremely unhappy. My boyfriend told me it's not the same for him, and his fantasies had nothing to do with how he felt about me, it was just a quick way for him to get off, a habit he'd had because it was easy when he was horny.\n\nI just need to know that I'm not crazy in wanting to get over this. I keep having obsessive thoughts about it and getting sad. I'm prone to anxiety which is making things worse. I don't want to leave him over this, I just want to get over it and move on! I told him I forgave him since it wasn't even something he'd lied to me about, and he was very open and communicative the whole time. But I can't shake the anxiety and it's affecting my mental health and the way I am with my boyfriend when we're together.\n\nWhat prompted me to post this is that I saw one of the girls at the grocery stores and the anxiety came back. I know I have self esteem issues but is this something that will just take time? What would you do? \n\nI want things to go back to how we were when I didn't even know about this! But I guess knowing is better, since it's allowed us to have this conversation and he's changed his behaviour and doesn't do it anymore. We're supposed to take a trip together in the summer and I'm moving into my own apartment which we were both so excited about, but now I feel lost in my own obsessive thoughts about what happened and I'm scared of not being enough for him despite what he told me.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65z6oj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "ihatemyselfomg", "saved": false, "mod_reports": [], "name": "t3_65z6oj", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "approved_by": null, "over_18": false, "domain": "self.TheGirlSurvivalGuide", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vfzu", "edited": 1492471932.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheGirlSurvivalGuide/comments/65z6oj/experiencing_anxiety_over_something_my_boyfriend/", "num_reports": null, "locked": false, "stickied": false, "created": 1492500473.0, "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/65z6oj/experiencing_anxiety_over_something_my_boyfriend/", "author_flair_text": null, "quarantine": false, "title": "Experiencing anxiety over something my boyfriend did and I can't talk to my friends about it", "created_utc": 1492471673.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65z6oj", "likes": null, "replies": "", "user_reports": [], "id": "dgebi9s", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "rusrslythatdumb", "parent_id": "t3_65z6oj", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "This is the thing: fantasies are fantasies for a reason. These girls he's fantasized about aren't girls he wants to be with. The ideal thing to be to a guy isn't someone he wants to bang, it's someone he wants to spend his time and life with. That's you. It absolutely doesn't mean he doesn't find you attractive. It could very well be that he feels guilty \"using\" your image in his mind to get off because he loves you for lots of different reasons. I can't really say.\n\nYou have to decide if this is something that's going to bother you forever, or if you decide that it's just not something you're going to waste your time with any longer. There's nothing you can do to change it, so its up to you to decide what to do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the thing: fantasies are fantasies for a reason. These girls he&amp;#39;s fantasized about aren&amp;#39;t girls he wants to be with. The ideal thing to be to a guy isn&amp;#39;t someone he wants to bang, it&amp;#39;s someone he wants to spend his time and life with. That&amp;#39;s you. It absolutely doesn&amp;#39;t mean he doesn&amp;#39;t find you attractive. It could very well be that he feels guilty &amp;quot;using&amp;quot; your image in his mind to get off because he loves you for lots of different reasons. I can&amp;#39;t really say.&lt;/p&gt;\n\n&lt;p&gt;You have to decide if this is something that&amp;#39;s going to bother you forever, or if you decide that it&amp;#39;s just not something you&amp;#39;re going to waste your time with any longer. There&amp;#39;s nothing you can do to change it, so its up to you to decide what to do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgebi9s", "score_hidden": false, "stickied": false, "created": 1492500926.0, "created_utc": 1492472126.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vfzu", "removal_reason": null, "link_id": "t3_65z6oj", "likes": null, "replies": "", "user_reports": [], "id": "dgedtoj", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "keakealani", "parent_id": "t3_65z6oj", "subreddit_name_prefixed": "r/TheGirlSurvivalGuide", "controversiality": 0, "body": "I think your boyfriend did his part - he apologized and took steps so that it wouldn't happen again. People accidentally do things that hurt others all the time, but what matters is how they react to it. At the same time, you also need to take steps to react. Part of this is taking time - it's totally understandable that you need to process what you learned and find ways to healthily cope with it. But, I don't think it makes sense to break up - your relationship otherwise seems happy and from what you said, it sounds like your boyfriend is genuinely sorry he hurt you this way. Now that he knows you consider it a violation, he won't do it again.\n\nSelf-esteem issues are nasty. They crop up at horrible times and make you behave irrationally. That's not to say your feelings are invalid, but they are motivated by insecurities that aren't healthy in the long term. I think now is a good time to find some way to consciously combat low self-esteem. There are many different strategies in books and online, and a therapist may also be helpful for working through it. \n\nUltimately, breaking up wouldn't solve the problem, it would just kick it down the road. the next time a similar issue crops up, you'll be at the same place anyway. You need to find a long-term strategy for dealing with jealousy or self esteem issues. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your boyfriend did his part - he apologized and took steps so that it wouldn&amp;#39;t happen again. People accidentally do things that hurt others all the time, but what matters is how they react to it. At the same time, you also need to take steps to react. Part of this is taking time - it&amp;#39;s totally understandable that you need to process what you learned and find ways to healthily cope with it. But, I don&amp;#39;t think it makes sense to break up - your relationship otherwise seems happy and from what you said, it sounds like your boyfriend is genuinely sorry he hurt you this way. Now that he knows you consider it a violation, he won&amp;#39;t do it again.&lt;/p&gt;\n\n&lt;p&gt;Self-esteem issues are nasty. They crop up at horrible times and make you behave irrationally. That&amp;#39;s not to say your feelings are invalid, but they are motivated by insecurities that aren&amp;#39;t healthy in the long term. I think now is a good time to find some way to consciously combat low self-esteem. There are many different strategies in books and online, and a therapist may also be helpful for working through it. &lt;/p&gt;\n\n&lt;p&gt;Ultimately, breaking up wouldn&amp;#39;t solve the problem, it would just kick it down the road. the next time a similar issue crops up, you&amp;#39;ll be at the same place anyway. You need to find a long-term strategy for dealing with jealousy or self esteem issues. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheGirlSurvivalGuide", "name": "t1_dgedtoj", "score_hidden": false, "stickied": false, "created": 1492503889.0, "created_utc": 1492475089.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]