[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "MealPrepSunday", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all!  The tl;dr: is I need help finding easy meals that will stay good in a freezer for as long as possible.&lt;/p&gt;\n\n&lt;p&gt;So my wife and I are expecting our first child in about a month, and in my wild panic to prep everything I can in advance I thought it would be really handy to have a freezer full of easy meals.   I have very little experience prepping and don&amp;#39;t have a great track record of finishing leftovers so I&amp;#39;m hoping that with some organization and advice I can plan some meals that will actually freeze well and know how to store them to best prevent freezer burn.&lt;/p&gt;\n\n&lt;p&gt;My number one priority is I want stuff that will stay good in the freezer for as long as possible.  Currently I only have a standup freezer, I almost have my wife talked into a deep freeze but that won&amp;#39;t come in time for this round.  Secondary priority is stuff that is easy to reheat and that minizimes mess afterwards.  (I can easily set aside a few days for cooking before the baby&amp;#39;s comes, so time spent cooking initially and dishes dirtied isn&amp;#39;t a huge issue).&lt;/p&gt;\n\n&lt;p&gt;Our tastes are pretty broad and there aren&amp;#39;t any significant dietary restrictions.  Basically I&amp;#39;m just looking for balanced meals, or parts of balanced meals that I can freeze.  I&amp;#39;m hoping to make regular trips to the farmers market so I can always supplement with fresh fruits and veggies.&lt;/p&gt;\n\n&lt;p&gt;To start off I have a post saved from a month back or so from someone prepping 5 dozen eggs worth of breakfast burritos that looks great.  From there I&amp;#39;ve though about doing meatballs or a nice meat sauce, but I&amp;#39;m not quite sure the best way to store these.  Also, does shepherds pie freeze well?  What about pulled pork or chicken?  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to be prepping about 2 weeks before the due date, and ideally would like stuff to stretch for a few months after birth, although I know that might stretch the limits of a stand up freezer.  (I also have a second stand up freezer that I can use as more long term and only open like once a week or so.&lt;/p&gt;\n\n&lt;p&gt;Any advice, recipes, or anything else is very much appreciated!  And I know once baby gets old enough to start eating food I&amp;#39;m going to actually have to cook balanced meals so I&amp;#39;ll definitely be coming back for more weekly prepping! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all!  The tl;dr: is I need help finding easy meals that will stay good in a freezer for as long as possible.\n\nSo my wife and I are expecting our first child in about a month, and in my wild panic to prep everything I can in advance I thought it would be really handy to have a freezer full of easy meals.   I have very little experience prepping and don't have a great track record of finishing leftovers so I'm hoping that with some organization and advice I can plan some meals that will actually freeze well and know how to store them to best prevent freezer burn.\n\nMy number one priority is I want stuff that will stay good in the freezer for as long as possible.  Currently I only have a standup freezer, I almost have my wife talked into a deep freeze but that won't come in time for this round.  Secondary priority is stuff that is easy to reheat and that minizimes mess afterwards.  (I can easily set aside a few days for cooking before the baby's comes, so time spent cooking initially and dishes dirtied isn't a huge issue).\n\nOur tastes are pretty broad and there aren't any significant dietary restrictions.  Basically I'm just looking for balanced meals, or parts of balanced meals that I can freeze.  I'm hoping to make regular trips to the farmers market so I can always supplement with fresh fruits and veggies.\n\n  To start off I have a post saved from a month back or so from someone prepping 5 dozen eggs worth of breakfast burritos that looks great.  From there I've though about doing meatballs or a nice meat sauce, but I'm not quite sure the best way to store these.  Also, does shepherds pie freeze well?  What about pulled pork or chicken?  \n\nI'm going to be prepping about 2 weeks before the due date, and ideally would like stuff to stretch for a few months after birth, although I know that might stretch the limits of a stand up freezer.  (I also have a second stand up freezer that I can use as more long term and only open like once a week or so.\n\nAny advice, recipes, or anything else is very much appreciated!  And I know once baby gets old enough to start eating food I'm going to actually have to cook balanced meals so I'll definitely be coming back for more weekly prepping! ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Advice Needed ", "id": "64woli", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "techiesgoboom", "saved": false, "mod_reports": [], "name": "t3_64woli", "subreddit_name_prefixed": "r/MealPrepSunday", "approved_by": null, "over_18": false, "domain": "self.MealPrepSunday", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_37cer", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/MealPrepSunday/comments/64woli/recipes_requests_tips_for_meals_that_survive_in_a/", "num_reports": null, "locked": false, "stickied": false, "created": 1492010160.0, "url": "https://www.reddit.com/r/MealPrepSunday/comments/64woli/recipes_requests_tips_for_meals_that_survive_in_a/", "author_flair_text": null, "quarantine": false, "title": "Recipes requests + tIps for meals that survive in a freezer", "created_utc": 1491981360.0, "distinguished": null, "media": null, "upvote_ratio": 0.6, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_37cer", "removal_reason": null, "link_id": "t3_64woli", "likes": null, "replies": "", "user_reports": [], "id": "dg6rmta", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Of_Chiefs", "parent_id": "t3_64woli", "subreddit_name_prefixed": "r/MealPrepSunday", "controversiality": 0, "body": "Here is my knock off Chipotle burrito recipe. I now replace all the spices other than salt with just adobo sauce with chipotle peppers in it though, I also now use 2 onions and more bell peppers and more beans. If kept in freezer bags these will be good for at least 2 months really 3. If you made some without meat it would be good for like 6+ months I imagine.\n\nYou could also make meat hand pies I imagine they freeze well.\n\nI like to freeze chili in small individual containers also then bust one out when I am making hot dogs or grilled cheese. I imagine it works with any thick soup if you guys like soup. I will do jambalaya soon. \n\nChili aside in general you want to take drain as much liquid from the food as possible before freezing to help it unfreeze nicely.\n\n\nhttps://www.reddit.com/r/MealPrepSunday/comments/5nt49j/what_do_you_mean_you_dont_have_a_burrito_shelf_so/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here is my knock off Chipotle burrito recipe. I now replace all the spices other than salt with just adobo sauce with chipotle peppers in it though, I also now use 2 onions and more bell peppers and more beans. If kept in freezer bags these will be good for at least 2 months really 3. If you made some without meat it would be good for like 6+ months I imagine.&lt;/p&gt;\n\n&lt;p&gt;You could also make meat hand pies I imagine they freeze well.&lt;/p&gt;\n\n&lt;p&gt;I like to freeze chili in small individual containers also then bust one out when I am making hot dogs or grilled cheese. I imagine it works with any thick soup if you guys like soup. I will do jambalaya soon. &lt;/p&gt;\n\n&lt;p&gt;Chili aside in general you want to take drain as much liquid from the food as possible before freezing to help it unfreeze nicely.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/MealPrepSunday/comments/5nt49j/what_do_you_mean_you_dont_have_a_burrito_shelf_so/\"&gt;https://www.reddit.com/r/MealPrepSunday/comments/5nt49j/what_do_you_mean_you_dont_have_a_burrito_shelf_so/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "MealPrepSunday", "name": "t1_dg6rmta", "score_hidden": false, "stickied": false, "created": 1492068962.0, "created_utc": 1492040162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]