[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "chemistry", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Right now, I&amp;#39;m debating to take an Intro to Chemistry class at my local CC that starts immediately after the Spring semester rather than waiting to take it in the Fall. However, it&amp;#39;s four weeks long, Mon-Thursday, 9-4pm. The instructor has excellent ratings and is highly recommended by students who&amp;#39;ve already taken Chem classes with her, so that&amp;#39;s assurance that I&amp;#39;ll learn something. &lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t taken a Chemistry class in over ten years. I did alright when I took chemistry in high school but had poor algebraic skills, but I&amp;#39;m doing very well in algebra now. I have no choice but to take this Intro to Chem class before taking Gen Chem 1. I&amp;#39;m completely fine with this since this class prepares me for Gen Chem 1 and I also knock out a lab requirement for my Associates. I also know my success in this class is going to be very dependent on my study habits and time management skills, but this is the only class I&amp;#39;ll be taking for four weeks followed by another eight weeks of Pre-Calculus.&lt;/p&gt;\n\n&lt;p&gt;Four weeks is going to cram a lot of information in such a short period. I&amp;#39;m considering doing this since it&amp;#39;ll free up my course load allowing me to take Gen Chem 1 this Fall fast tracking my transfer to a University for Electrical Engineering next year. &lt;/p&gt;\n\n&lt;p&gt;Has anybody done accelerated sessions like this and is it better taking science courses during the summer rather than during the Fall/Spring semesters? If I do go this route, what supplemental resources besides KhanAcademy can I use to help me with the material? I&amp;#39;m more of a visual learner with an &amp;quot;explain it like a 5th grader&amp;quot; teaching method when understanding the basics.&lt;/p&gt;\n\n&lt;p&gt;Edit: I counted the actual days of this class, and it&amp;#39;s going to be 14 days total. I&amp;#39;m still for it. However, there must be a catch to this as an intro class being this short. I&amp;#39;m thinking she&amp;#39;s going to cut through the filler stuff and focus on core concepts for Gen Chem 1. I&amp;#39;ll have to ask around and her personally to get a better idea. Thoughts?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Right now, I'm debating to take an Intro to Chemistry class at my local CC that starts immediately after the Spring semester rather than waiting to take it in the Fall. However, it's four weeks long, Mon-Thursday, 9-4pm. The instructor has excellent ratings and is highly recommended by students who've already taken Chem classes with her, so that's assurance that I'll learn something. \n\nI haven't taken a Chemistry class in over ten years. I did alright when I took chemistry in high school but had poor algebraic skills, but I'm doing very well in algebra now. I have no choice but to take this Intro to Chem class before taking Gen Chem 1. I'm completely fine with this since this class prepares me for Gen Chem 1 and I also knock out a lab requirement for my Associates. I also know my success in this class is going to be very dependent on my study habits and time management skills, but this is the only class I'll be taking for four weeks followed by another eight weeks of Pre-Calculus.\n\nFour weeks is going to cram a lot of information in such a short period. I'm considering doing this since it'll free up my course load allowing me to take Gen Chem 1 this Fall fast tracking my transfer to a University for Electrical Engineering next year. \n\nHas anybody done accelerated sessions like this and is it better taking science courses during the summer rather than during the Fall/Spring semesters? If I do go this route, what supplemental resources besides KhanAcademy can I use to help me with the material? I'm more of a visual learner with an \"explain it like a 5th grader\" teaching method when understanding the basics.\n\nEdit: I counted the actual days of this class, and it's going to be 14 days total. I'm still for it. However, there must be a catch to this as an intro class being this short. I'm thinking she's going to cut through the filler stuff and focus on core concepts for Gen Chem 1. I'll have to ask around and her personally to get a better idea. Thoughts?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64y6yl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "TheMajesticFreak", "saved": false, "mod_reports": [], "name": "t3_64y6yl", "subreddit_name_prefixed": "r/chemistry", "approved_by": null, "over_18": false, "domain": "self.chemistry", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhf9", "edited": 1492032973.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/chemistry/comments/64y6yl/condensed_intro_to_chem_summer_class/", "num_reports": null, "locked": false, "stickied": false, "created": 1492033181.0, "url": "https://www.reddit.com/r/chemistry/comments/64y6yl/condensed_intro_to_chem_summer_class/", "author_flair_text": null, "quarantine": false, "title": "Condensed Intro to Chem summer class", "created_utc": 1492004381.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": "", "user_reports": [], "id": "dg5ymfk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheMajesticFreak", "parent_id": "t1_dg5y3me", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "That's good to know since I'm currently in intermediate algebra with an A. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s good to know since I&amp;#39;m currently in intermediate algebra with an A. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg5ymfk", "score_hidden": false, "stickied": false, "created": 1492037339.0, "created_utc": 1492008539.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5y3me", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "patentedleeches", "parent_id": "t1_dg5wn35", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "Brush up on your algebra skills. In my opinion a solid understanding of algebra will get you though most of chemistry, at least up to physical chemistry. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Brush up on your algebra skills. In my opinion a solid understanding of algebra will get you though most of chemistry, at least up to physical chemistry. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg5y3me", "score_hidden": false, "stickied": false, "created": 1492036742.0, "created_utc": 1492007942.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": "", "user_reports": [], "id": "dg69n60", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lawyer_doctor", "parent_id": "t1_dg6574i", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "There's some basic algebra in stuff like concentration problems and sometimes equilibrium but those are usually really simple for anyone with a good grasp of algebra. The more advanced math doesn't come until physical chemistry and maaaaybe inorganic depending on how they cover it. Pchem has differential equations, calculus, and linear algebra through both semesters while inorganic technically has a big linear algebra component with character table use but a lot of classes either ignore that or brush over it at the undergraduate level", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s some basic algebra in stuff like concentration problems and sometimes equilibrium but those are usually really simple for anyone with a good grasp of algebra. The more advanced math doesn&amp;#39;t come until physical chemistry and maaaaybe inorganic depending on how they cover it. Pchem has differential equations, calculus, and linear algebra through both semesters while inorganic technically has a big linear algebra component with character table use but a lot of classes either ignore that or brush over it at the undergraduate level&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg69n60", "score_hidden": false, "stickied": false, "created": 1492048974.0, "created_utc": 1492020174.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": "", "user_reports": [], "id": "dg69pdk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ORGrown", "parent_id": "t1_dg6574i", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "101 is going to focus a lot on familiarizing yourself with the use of the periodic table. It wouldn't hurt to at least check out a video or something that gives you an overview of it. You'll need to have a good understanding of what the periodic table really tells you (that group #s = # of valence electrons, period # = # of electron shells, the xx.xx number below element symbols tells you the mass in grams of one mole of that element) All of this stuff is probably going to be what the class really focuses on, so don't be to worried if you don't completely grasp it going into 101. \n\nIf I was to lay out goals for 101, I would say learn to use the periodic table, and learn stoichiometry. Balancing equations is a big thing too, but that just goes back to the basic algebraic concepts, and with your success in algebra I don't think you'll have a hard time with it. 101 tends to be laid out in a way that you can go into it with zero prior knowledge of chemistry and succeed. Just make sure to pay attention and ask questions if something isn't making sense to you. Especially with the periodic table, stoichiometry, and balancing equations.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;101 is going to focus a lot on familiarizing yourself with the use of the periodic table. It wouldn&amp;#39;t hurt to at least check out a video or something that gives you an overview of it. You&amp;#39;ll need to have a good understanding of what the periodic table really tells you (that group #s = # of valence electrons, period # = # of electron shells, the xx.xx number below element symbols tells you the mass in grams of one mole of that element) All of this stuff is probably going to be what the class really focuses on, so don&amp;#39;t be to worried if you don&amp;#39;t completely grasp it going into 101. &lt;/p&gt;\n\n&lt;p&gt;If I was to lay out goals for 101, I would say learn to use the periodic table, and learn stoichiometry. Balancing equations is a big thing too, but that just goes back to the basic algebraic concepts, and with your success in algebra I don&amp;#39;t think you&amp;#39;ll have a hard time with it. 101 tends to be laid out in a way that you can go into it with zero prior knowledge of chemistry and succeed. Just make sure to pay attention and ask questions if something isn&amp;#39;t making sense to you. Especially with the periodic table, stoichiometry, and balancing equations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg69pdk", "score_hidden": false, "stickied": false, "created": 1492049035.0, "created_utc": 1492020235.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6574i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheMajesticFreak", "parent_id": "t1_dg647ss", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "I was hoping to hear something like this.\n\nBesides stoichiometry, any other topics I need to know and understand that'll carry over to Gen Chem 1?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was hoping to hear something like this.&lt;/p&gt;\n\n&lt;p&gt;Besides stoichiometry, any other topics I need to know and understand that&amp;#39;ll carry over to Gen Chem 1?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg6574i", "score_hidden": false, "stickied": false, "created": 1492044473.0, "created_utc": 1492015673.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg647ss", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ORGrown", "parent_id": "t1_dg5wn35", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "The algebra in che-101 is fairly basic. Exponents aren't a thing really except for plugging into a few formulas, but as far as chemical equations go it mostly has to do with coefficients and distributive properties. \n\nHere's a quick break down for you: If you were to see this compound in an equation \"2H*_2_*O\" the subscript only applies to the element immediately preceding it. Meaning that for every molecule of H*_2_*O there are 2 H's and 1 O (since there is no subscript following the O, it is automatically 1) The coefficient in front of the compound name applies to the entire compound, so in this case we have 2 total H*_2_*O's, meaning we have a total of 4 H's and 2 O's. (It's actually 2 moles of H*_2_*O, not 2 H*_2_*O's but you'll learn about that later, this is just the general principle to understand)\n\nIf you can understand that fairly easily then 101 shouldn't be too bad for you. Also manipulating equations to solve for x is fairly standard practice in chem. There is also a LOT of conversions, they aren't hard, but if you aren't too good at doing those it would be a great time to learn a little more. Stoichiometry is going to be the most important skill that you learn from the class, and it is basically stringing together a bunch of conversions. (eg: # of grams converted into moles, converted into moles of a different compound, converted back into grams of the new compound) It really isn't hard, and if you are getting an A in your algebra class I would not be worried about it. I only bring it up because going into 111 you will want to be spot on with stoichiometry.\n\nAlso, try not to be scared of big words (like stoichiometry) they are fancy/technical ways of saying something that's easier to do than it sounds. Don't get scared by the vocabulary!", "edited": 1492015133.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The algebra in che-101 is fairly basic. Exponents aren&amp;#39;t a thing really except for plugging into a few formulas, but as far as chemical equations go it mostly has to do with coefficients and distributive properties. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a quick break down for you: If you were to see this compound in an equation &amp;quot;2H&lt;em&gt;&lt;em&gt;2&lt;/em&gt;&lt;/em&gt;O&amp;quot; the subscript only applies to the element immediately preceding it. Meaning that for every molecule of H&lt;em&gt;&lt;em&gt;2&lt;/em&gt;&lt;/em&gt;O there are 2 H&amp;#39;s and 1 O (since there is no subscript following the O, it is automatically 1) The coefficient in front of the compound name applies to the entire compound, so in this case we have 2 total H&lt;em&gt;&lt;em&gt;2&lt;/em&gt;&lt;/em&gt;O&amp;#39;s, meaning we have a total of 4 H&amp;#39;s and 2 O&amp;#39;s. (It&amp;#39;s actually 2 moles of H&lt;em&gt;&lt;em&gt;2&lt;/em&gt;&lt;/em&gt;O, not 2 H&lt;em&gt;&lt;em&gt;2&lt;/em&gt;&lt;/em&gt;O&amp;#39;s but you&amp;#39;ll learn about that later, this is just the general principle to understand)&lt;/p&gt;\n\n&lt;p&gt;If you can understand that fairly easily then 101 shouldn&amp;#39;t be too bad for you. Also manipulating equations to solve for x is fairly standard practice in chem. There is also a LOT of conversions, they aren&amp;#39;t hard, but if you aren&amp;#39;t too good at doing those it would be a great time to learn a little more. Stoichiometry is going to be the most important skill that you learn from the class, and it is basically stringing together a bunch of conversions. (eg: # of grams converted into moles, converted into moles of a different compound, converted back into grams of the new compound) It really isn&amp;#39;t hard, and if you are getting an A in your algebra class I would not be worried about it. I only bring it up because going into 111 you will want to be spot on with stoichiometry.&lt;/p&gt;\n\n&lt;p&gt;Also, try not to be scared of big words (like stoichiometry) they are fancy/technical ways of saying something that&amp;#39;s easier to do than it sounds. Don&amp;#39;t get scared by the vocabulary!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg647ss", "score_hidden": false, "stickied": false, "created": 1492043454.0, "created_utc": 1492014654.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": "", "user_reports": [], "id": "dg8libp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_perpetual_student_", "parent_id": "t1_dg5wn35", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "Learn to do the ['train track' method](http://www.katmarsoftware.com/articles/railroad-track-unit-conversion.htm) for converting units.  You are doing the algebra, just in a more visual format that makes it easier to keep track of exactly what you are doing.  This is simply the easiest method for dimension (unit) conversions which will take you through every single science class and most of the engineering classes.\n\nI have no idea why they stopped teaching this method in high school, but this is how I learned to do it over twenty years ago and I've never once had a problem with units since.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Learn to do the &lt;a href=\"http://www.katmarsoftware.com/articles/railroad-track-unit-conversion.htm\"&gt;&amp;#39;train track&amp;#39; method&lt;/a&gt; for converting units.  You are doing the algebra, just in a more visual format that makes it easier to keep track of exactly what you are doing.  This is simply the easiest method for dimension (unit) conversions which will take you through every single science class and most of the engineering classes.&lt;/p&gt;\n\n&lt;p&gt;I have no idea why they stopped teaching this method in high school, but this is how I learned to do it over twenty years ago and I&amp;#39;ve never once had a problem with units since.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg8libp", "score_hidden": false, "stickied": false, "created": 1492164075.0, "created_utc": 1492135275.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wn35", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheMajesticFreak", "parent_id": "t1_dg5w6cz", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "Thanks for the quick response. Those are valid points.\n\nAny tips, mathematically speaking, on what to know before taking a chem class? I'm seeing exponents to be a big part of chemistry.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the quick response. Those are valid points.&lt;/p&gt;\n\n&lt;p&gt;Any tips, mathematically speaking, on what to know before taking a chem class? I&amp;#39;m seeing exponents to be a big part of chemistry.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg5wn35", "score_hidden": false, "stickied": false, "created": 1492035001.0, "created_utc": 1492006201.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5w6cz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Chemweeb", "parent_id": "t3_64y6yl", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "I recommend you take it. If you're not doing anything else in the summer season, it gives you extra chances on the exam. The sooner you are done with a subject, the better. Another good thing about courses which are given in one continuous go like this is that you're less likely to forget about concepts in between sessions. It should help you understand it better than if you were to take it spread out over a semester.\n\nMake sure you attend, put effort in your exercizes and you'll probably be more than fine. I mean... it's just an introductory course so I don't expect anything difficult. If your textbook or Khan doesn't help so much, feel free to ask specific questions at /r/chemhelp.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I recommend you take it. If you&amp;#39;re not doing anything else in the summer season, it gives you extra chances on the exam. The sooner you are done with a subject, the better. Another good thing about courses which are given in one continuous go like this is that you&amp;#39;re less likely to forget about concepts in between sessions. It should help you understand it better than if you were to take it spread out over a semester.&lt;/p&gt;\n\n&lt;p&gt;Make sure you attend, put effort in your exercizes and you&amp;#39;ll probably be more than fine. I mean... it&amp;#39;s just an introductory course so I don&amp;#39;t expect anything difficult. If your textbook or Khan doesn&amp;#39;t help so much, feel free to ask specific questions at &lt;a href=\"/r/chemhelp\"&gt;/r/chemhelp&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg5w6cz", "score_hidden": false, "stickied": false, "created": 1492034412.0, "created_utc": 1492005612.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": "", "user_reports": [], "id": "dg60hkq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FailedmyTest", "parent_id": "t3_64y6yl", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "With accelerated courses you have to keep on track with your work. One day of relaxing or otherwise not doing work in a summer session makes you fall behind much more than if you did so in a normal paced class. A benefit to summer courses is that class sizes are much lower, and professors are generally less busy during the summer, making it easier to get help. \n\nHowever personally, the most important factor is the quality of instruction. Regardless of a fast paced or normal paced course, having a better professor/TA will give you the opportunity to do better in the course. I have intentionally done this with organic chemistry, and I'm doing so with biochemistry this upcoming summer. \n\nAs for online resources, a fairly new one is the [Organic Chemistry Tutor](https://www.youtube.com/channel/UCEWpbFLzoYGPfuWUMFPSaoA/videos). Initially the channel was all about organic chemistry, but he does physical chem, general chem, general physics, introductory math/algebra, and so on. Some of his videos are incredibly long (like multiple hours), but I like the extra detail he goes in to during these videos. If you want a summary of the content, Khan Academy would be better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;With accelerated courses you have to keep on track with your work. One day of relaxing or otherwise not doing work in a summer session makes you fall behind much more than if you did so in a normal paced class. A benefit to summer courses is that class sizes are much lower, and professors are generally less busy during the summer, making it easier to get help. &lt;/p&gt;\n\n&lt;p&gt;However personally, the most important factor is the quality of instruction. Regardless of a fast paced or normal paced course, having a better professor/TA will give you the opportunity to do better in the course. I have intentionally done this with organic chemistry, and I&amp;#39;m doing so with biochemistry this upcoming summer. &lt;/p&gt;\n\n&lt;p&gt;As for online resources, a fairly new one is the &lt;a href=\"https://www.youtube.com/channel/UCEWpbFLzoYGPfuWUMFPSaoA/videos\"&gt;Organic Chemistry Tutor&lt;/a&gt;. Initially the channel was all about organic chemistry, but he does physical chem, general chem, general physics, introductory math/algebra, and so on. Some of his videos are incredibly long (like multiple hours), but I like the extra detail he goes in to during these videos. If you want a summary of the content, Khan Academy would be better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg60hkq", "score_hidden": false, "stickied": false, "created": 1492039430.0, "created_utc": 1492010630.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": "", "user_reports": [], "id": "dg6b21u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheMajesticFreak", "parent_id": "t3_64y6yl", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "Thanks for the responses so far. They've been really helpful and assuring.\n\nGeneral Chemistry 1 is going to be the only Chemistry class besides Chem 101 that I'm taking this summer that I'll be taking and looked at for transfer.\n\nI'm not sure what General Chemistry 1 entails, but I'm assuming it's everything I've already learned in Chem 101 but more in-depth. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the responses so far. They&amp;#39;ve been really helpful and assuring.&lt;/p&gt;\n\n&lt;p&gt;General Chemistry 1 is going to be the only Chemistry class besides Chem 101 that I&amp;#39;m taking this summer that I&amp;#39;ll be taking and looked at for transfer.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure what General Chemistry 1 entails, but I&amp;#39;m assuming it&amp;#39;s everything I&amp;#39;ve already learned in Chem 101 but more in-depth. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg6b21u", "score_hidden": false, "stickied": false, "created": 1492050427.0, "created_utc": 1492021627.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": "", "user_reports": [], "id": "dg7mm3u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheMajesticFreak", "parent_id": "t1_dg7ka41", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "That was the first thing I contemplated and will accept before attending. The class is 14 days longs total in instruction time.\n\nI should be okay as this is the only class I'll be taking during this timeframe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was the first thing I contemplated and will accept before attending. The class is 14 days longs total in instruction time.&lt;/p&gt;\n\n&lt;p&gt;I should be okay as this is the only class I&amp;#39;ll be taking during this timeframe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg7mm3u", "score_hidden": false, "stickied": false, "created": 1492122996.0, "created_utc": 1492094196.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ka41", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stripes_by_proxy", "parent_id": "t3_64y6yl", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "I've done accelerated summer stuff before for both physics and organic chemistry. They don't cut out anything, the catch is that you're sitting in a classroom for 3-4 hours a day and then you go study somewhere for another hour or two because the test on the material you just learned is coming up within a day or two. It's not terrible as long as you accept that it will own your life while it lasts. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve done accelerated summer stuff before for both physics and organic chemistry. They don&amp;#39;t cut out anything, the catch is that you&amp;#39;re sitting in a classroom for 3-4 hours a day and then you go study somewhere for another hour or two because the test on the material you just learned is coming up within a day or two. It&amp;#39;s not terrible as long as you accept that it will own your life while it lasts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg7ka41", "score_hidden": false, "stickied": false, "created": 1492120146.0, "created_utc": 1492091346.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": "", "user_reports": [], "id": "dg7mt4k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheMajesticFreak", "parent_id": "t1_dg7kwnr", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "I'm good with algebraic skills.\n\nIs there any sample world problems for introductory chemistry that I could look up and familiarize myself before hand? I'll look into unit conversion too. I've already looked at chemical balance equations so far and is not that all difficult.\n\nAnything else that can give me an edge?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m good with algebraic skills.&lt;/p&gt;\n\n&lt;p&gt;Is there any sample world problems for introductory chemistry that I could look up and familiarize myself before hand? I&amp;#39;ll look into unit conversion too. I&amp;#39;ve already looked at chemical balance equations so far and is not that all difficult.&lt;/p&gt;\n\n&lt;p&gt;Anything else that can give me an edge?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg7mt4k", "score_hidden": false, "stickied": false, "created": 1492123225.0, "created_utc": 1492094425.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kwnr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RubyPorto", "parent_id": "t3_64y6yl", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "I took both semesters of genchem back to back in 5 week summer sessions. It's fairly all consuming, but it's not that difficult. The condensed format means you don't have as much time to study, sure, but it also means that all the lectures are fresh in your memory.\n\nMake sure you're confident in your basic algebra skills and ability to read word problems.   \nIf you want to be ahead of the curve, familiarizing yourself with the process of unit conversion will speed up the homework and tests.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took both semesters of genchem back to back in 5 week summer sessions. It&amp;#39;s fairly all consuming, but it&amp;#39;s not that difficult. The condensed format means you don&amp;#39;t have as much time to study, sure, but it also means that all the lectures are fresh in your memory.&lt;/p&gt;\n\n&lt;p&gt;Make sure you&amp;#39;re confident in your basic algebra skills and ability to read word problems.&lt;br/&gt;\nIf you want to be ahead of the curve, familiarizing yourself with the process of unit conversion will speed up the homework and tests.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg7kwnr", "score_hidden": false, "stickied": false, "created": 1492120948.0, "created_utc": 1492092148.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_64y6yl", "likes": null, "replies": "", "user_reports": [], "id": "dg8q831", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "neonthai91", "parent_id": "t3_64y6yl", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "I took an intro to Chem class to get some terminology and practice down. I'm a chemistry major now, but I did poorly in high school. Personally I feel like the second time around was better because my high school self couldn't comprehend the concepts at the time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took an intro to Chem class to get some terminology and practice down. I&amp;#39;m a chemistry major now, but I did poorly in high school. Personally I feel like the second time around was better because my high school self couldn&amp;#39;t comprehend the concepts at the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dg8q831", "score_hidden": false, "stickied": false, "created": 1492171136.0, "created_utc": 1492142336.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]