[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "chemistry", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi guys,&lt;/p&gt;\n\n&lt;p&gt;So I am doing my PhD in organic chemistry with an emphasis on material science applications:&lt;/p&gt;\n\n&lt;p&gt;After finishing my MSc I stayed with my group for my PhD, because it was the easiest way to do it. (Not worrying about relocation, applications etc.) And I knew that my group is not the most productive, or well-organized. I thought, I will manage myself through that. So the group does not have a focus, but rather does everything. Total synthesis, bioactive molecules and material science stuff.&lt;/p&gt;\n\n&lt;p&gt;Now I am 16 months in and realize more and more, how bad the organization in the group is and that the PI is always fantasizing and motivating, but never providing the proper equipment, or considering recommendations for improvement. In the end my daily work is on-demand synthesis for numerous collaboration partners. I fear that have no real topic or story to tell, once I write my thesis.\nWhat really frustrates me is that I only learn about cooking, and never get hands-on experience in the science/measurements involved for materials or devices.&lt;/p&gt;\n\n&lt;p&gt;So now my questions:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Is this normal mid-PhD crisis, and should I work on my motivation/persistence, because that is how science works?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If I quit, how to do it properly? (Regarding to the talk with my PI)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Is there any disadvantages I need to consider, when applying to a new group? (I know, I will have the &amp;quot;quitter mark&amp;quot; for future applications. But will there be other disadvantages that I am not aware of?)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Now this is probably the most important set of questions: Did you/friends go through this? How did it turn out for you/your friends?&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi guys,\n\nSo I am doing my PhD in organic chemistry with an emphasis on material science applications:\n\nAfter finishing my MSc I stayed with my group for my PhD, because it was the easiest way to do it. (Not worrying about relocation, applications etc.) And I knew that my group is not the most productive, or well-organized. I thought, I will manage myself through that. So the group does not have a focus, but rather does everything. Total synthesis, bioactive molecules and material science stuff.\n\nNow I am 16 months in and realize more and more, how bad the organization in the group is and that the PI is always fantasizing and motivating, but never providing the proper equipment, or considering recommendations for improvement. In the end my daily work is on-demand synthesis for numerous collaboration partners. I fear that have no real topic or story to tell, once I write my thesis.\nWhat really frustrates me is that I only learn about cooking, and never get hands-on experience in the science/measurements involved for materials or devices.\n\nSo now my questions:\n\n1. Is this normal mid-PhD crisis, and should I work on my motivation/persistence, because that is how science works?\n\n2. If I quit, how to do it properly? (Regarding to the talk with my PI)\n\n3. Is there any disadvantages I need to consider, when applying to a new group? (I know, I will have the \"quitter mark\" for future applications. But will there be other disadvantages that I am not aware of?)\n\n4. Now this is probably the most important set of questions: Did you/friends go through this? How did it turn out for you/your friends?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ic8v", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "d0nus", "saved": false, "mod_reports": [], "name": "t3_65ic8v", "subreddit_name_prefixed": "r/chemistry", "approved_by": null, "over_18": false, "domain": "self.chemistry", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhf9", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/chemistry/comments/65ic8v/unhappy_with_my_phd_project_thinking_about/", "num_reports": null, "locked": false, "stickied": false, "created": 1492278511.0, "url": "https://www.reddit.com/r/chemistry/comments/65ic8v/unhappy_with_my_phd_project_thinking_about/", "author_flair_text": null, "quarantine": false, "title": "Unhappy with my PhD project, thinking about quitting and applying somewhere else. Anything I need to consider?", "created_utc": 1492249711.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_65ic8v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_65ic8v", "likes": null, "replies": "", "user_reports": [], "id": "dgauzay", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "blackrob", "parent_id": "t1_dgassx3", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "I agree with this, part of getting a Ph.D is forging your own way on projects and learning to make discoveries on your own. You already have a masters so you will not need as much guidance as a first year, but it is your job to take what you are working on and find a way to make it a story. If you don't have equipment for experiments consider opening collaborations with people in the department who do.  If you want to do the characterization, most collaborators would be happy to train you on their instruments rather than having to do all the work for you\n\nIt's also important to note that professors are not managers, and have no training in managing people even though they are thrust into the role, and moving to a new group may just be a lateral move in that regard. There are many ways in which a lab can be considered disorganized and most will be in some way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with this, part of getting a Ph.D is forging your own way on projects and learning to make discoveries on your own. You already have a masters so you will not need as much guidance as a first year, but it is your job to take what you are working on and find a way to make it a story. If you don&amp;#39;t have equipment for experiments consider opening collaborations with people in the department who do.  If you want to do the characterization, most collaborators would be happy to train you on their instruments rather than having to do all the work for you&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also important to note that professors are not managers, and have no training in managing people even though they are thrust into the role, and moving to a new group may just be a lateral move in that regard. There are many ways in which a lab can be considered disorganized and most will be in some way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dgauzay", "score_hidden": false, "stickied": false, "created": 1492303745.0, "created_utc": 1492274945.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgassx3", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "souls_at_zero", "parent_id": "t3_65ic8v", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "As a PhD student, the ball is in your court. You should never expect to have a perfect project handed to you, and take a back seat for your graduate life. If it's not going the way you like it, you need to take the wheel and steer it into the direction you need it to be heading. \n\nTowards that goal, have you discussed any of these concerns with your PI? Have you envisaged the kind of project you would like to be doing? Is there specific equipment you need that you have been denied? Is there no one else in the department with said equipment that you could use?\n\nThe quitter attitude will not get you anywhere. A proactive and aggressive approach to your goals will more likely succeed. Be the person to organize the group, request the materials you need, plan an approach. If your PI is recalcitrant to any plan that will see you to success, or unfairly denies you the materials you need to complete a project, then you have a fair reason to quit (doing so, by the way, is a last resort).", "edited": 1492272321.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a PhD student, the ball is in your court. You should never expect to have a perfect project handed to you, and take a back seat for your graduate life. If it&amp;#39;s not going the way you like it, you need to take the wheel and steer it into the direction you need it to be heading. &lt;/p&gt;\n\n&lt;p&gt;Towards that goal, have you discussed any of these concerns with your PI? Have you envisaged the kind of project you would like to be doing? Is there specific equipment you need that you have been denied? Is there no one else in the department with said equipment that you could use?&lt;/p&gt;\n\n&lt;p&gt;The quitter attitude will not get you anywhere. A proactive and aggressive approach to your goals will more likely succeed. Be the person to organize the group, request the materials you need, plan an approach. If your PI is recalcitrant to any plan that will see you to success, or unfairly denies you the materials you need to complete a project, then you have a fair reason to quit (doing so, by the way, is a last resort).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dgassx3", "score_hidden": false, "stickied": false, "created": 1492300696.0, "created_utc": 1492271896.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_65ic8v", "likes": null, "replies": "", "user_reports": [], "id": "dgal7vr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "thewizardofosmium", "parent_id": "t3_65ic8v", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "I am sorry you are in this situation.  I'm too far removed from grad school to give you advice.  But I've interviewed enough job candidates to tell you your intuition is spot on.  There are few jobs out there for a candidate who comes in and recites all the syntheses he/she has done without providing any context or characterization for the work.  Are your syntheses at least novel or are you just following literature preps?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sorry you are in this situation.  I&amp;#39;m too far removed from grad school to give you advice.  But I&amp;#39;ve interviewed enough job candidates to tell you your intuition is spot on.  There are few jobs out there for a candidate who comes in and recites all the syntheses he/she has done without providing any context or characterization for the work.  Are your syntheses at least novel or are you just following literature preps?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dgal7vr", "score_hidden": false, "stickied": false, "created": 1492287833.0, "created_utc": 1492259033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_65ic8v", "likes": null, "replies": "", "user_reports": [], "id": "dgasu9v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ceorl_Lounge", "parent_id": "t3_65ic8v", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "Some discouragement is absolutely normal, but you do need to consider the time invested already vs. time to exit. Sounds like you need to pick your own focus if the professor won't. PhD work is about depth not breadth, so dig in, get to the bottom, and get done.\n\nRe: the \"quitter mark\" what's your current advisor's reputation around the department? If it's a know \"problem group\" there won't be much judgement there. My wife switched groups and never heard about it again because the first advisor was a known problem and not well liked. \n\nIf you want to get into the functional application of the materials I think that's a very reasonable request and will yield a more comprehensive dissertation. We aren't talking years in another labs here, just enough time to include an application chapter. One of my wife's labmates got involved in the actual surgeries they used to implant their materials in animals. Tough stuff sometimes, but it certainly gave her a more complete view of the project. Time in another group might help your perspective too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some discouragement is absolutely normal, but you do need to consider the time invested already vs. time to exit. Sounds like you need to pick your own focus if the professor won&amp;#39;t. PhD work is about depth not breadth, so dig in, get to the bottom, and get done.&lt;/p&gt;\n\n&lt;p&gt;Re: the &amp;quot;quitter mark&amp;quot; what&amp;#39;s your current advisor&amp;#39;s reputation around the department? If it&amp;#39;s a know &amp;quot;problem group&amp;quot; there won&amp;#39;t be much judgement there. My wife switched groups and never heard about it again because the first advisor was a known problem and not well liked. &lt;/p&gt;\n\n&lt;p&gt;If you want to get into the functional application of the materials I think that&amp;#39;s a very reasonable request and will yield a more comprehensive dissertation. We aren&amp;#39;t talking years in another labs here, just enough time to include an application chapter. One of my wife&amp;#39;s labmates got involved in the actual surgeries they used to implant their materials in animals. Tough stuff sometimes, but it certainly gave her a more complete view of the project. Time in another group might help your perspective too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dgasu9v", "score_hidden": false, "stickied": false, "created": 1492300751.0, "created_utc": 1492271951.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_65ic8v", "likes": null, "replies": "", "user_reports": [], "id": "dgaorau", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ASDMEL", "parent_id": "t3_65ic8v", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "&gt;\n\nNow I am 16 months in and realize more and more, how bad the organization in the group is and that the PI is always fantasizing and motivating, but never providing the proper equipment, or considering recommendations for improvement. In the end my daily work is on-demand synthesis for numerous collaboration partners.          \n\nI think it depends on what kind of syntheses you're talking about. If it's smth along the lines of \"we need 2g of this novel, complex, natural product derivative, find a scalable method to do it\" it does not sound too bad.         \nIf its more \"we need some of this completely boring (synthetically) cpd, here's the literature prep, hand it in within 2 months\" you should really consider switching.           \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Now I am 16 months in and realize more and more, how bad the organization in the group is and that the PI is always fantasizing and motivating, but never providing the proper equipment, or considering recommendations for improvement. In the end my daily work is on-demand synthesis for numerous collaboration partners.          &lt;/p&gt;\n\n&lt;p&gt;I think it depends on what kind of syntheses you&amp;#39;re talking about. If it&amp;#39;s smth along the lines of &amp;quot;we need 2g of this novel, complex, natural product derivative, find a scalable method to do it&amp;quot; it does not sound too bad.&lt;br/&gt;\nIf its more &amp;quot;we need some of this completely boring (synthetically) cpd, here&amp;#39;s the literature prep, hand it in within 2 months&amp;quot; you should really consider switching.           &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dgaorau", "score_hidden": false, "stickied": false, "created": 1492294707.0, "created_utc": 1492265907.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhf9", "removal_reason": null, "link_id": "t3_65ic8v", "likes": null, "replies": "", "user_reports": [], "id": "dgbhqti", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CHEIVIIST", "parent_id": "t3_65ic8v", "subreddit_name_prefixed": "r/chemistry", "controversiality": 0, "body": "I started working in a bioinorganic lab and spent a year working in it before I realized that I wasn't happy. I talked to the head of the department who encouraged me to talk it out with my advisor but was really supportive. I ended up switching to a biomedical pchem group and couldn't have been happier. \n\nI had to essentially start at square one in terms of research but it only ended up taking me a little under four years after the switch to finish. Even though it added time, I was much happier on a day to day basis and it was absolutely worth it in my situation. \n\nYou may want to look around your department to see if another lab looks more appealing. In my case it took a few weeks to find a new lab, but I don't think there were any feelings of me quitting, I just needed a different atmosphere to thrive. \n\nThe first step though, is to voice your concerns to your advisor. It is possible that knowing how you are feeling will change the atmosphere and may not require switching. Either way, your education is about you training for the future. Take the steps necessary to ensure that you are getting the training that you need.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I started working in a bioinorganic lab and spent a year working in it before I realized that I wasn&amp;#39;t happy. I talked to the head of the department who encouraged me to talk it out with my advisor but was really supportive. I ended up switching to a biomedical pchem group and couldn&amp;#39;t have been happier. &lt;/p&gt;\n\n&lt;p&gt;I had to essentially start at square one in terms of research but it only ended up taking me a little under four years after the switch to finish. Even though it added time, I was much happier on a day to day basis and it was absolutely worth it in my situation. &lt;/p&gt;\n\n&lt;p&gt;You may want to look around your department to see if another lab looks more appealing. In my case it took a few weeks to find a new lab, but I don&amp;#39;t think there were any feelings of me quitting, I just needed a different atmosphere to thrive. &lt;/p&gt;\n\n&lt;p&gt;The first step though, is to voice your concerns to your advisor. It is possible that knowing how you are feeling will change the atmosphere and may not require switching. Either way, your education is about you training for the future. Take the steps necessary to ensure that you are getting the training that you need.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "chemistry", "name": "t1_dgbhqti", "score_hidden": false, "stickied": false, "created": 1492335391.0, "created_utc": 1492306591.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]