[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": true, "banned_by": null, "media_embed": {}, "subreddit": "legaladvice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;edit: I&amp;#39;m trying to x-post this to &lt;a href=\"/r/legaladviceofftopic\"&gt;r/legaladviceofftopic&lt;/a&gt; for discussion or if anybody has questions but the bot is giving me a tough time.&lt;/p&gt;\n\n&lt;p&gt;another edit: I think I finally got the x-post to &lt;a href=\"/r/legaladviceofftopic\"&gt;r/legaladviceofftopic&lt;/a&gt;. &lt;a href=\"https://www.reddit.com/r/legaladviceofftopic/comments/64szql/xpost_from_legaladvice_i_finally_got_some_sweet/?st=j1dxb1sz&amp;amp;sh=18c6b612\"&gt;If you have anything to say, questions, etc, feel free to click this link&lt;/a&gt; Enter at your own risk though, the saltiness level of some people is at an all time high it seems like right now. Everybody would have handled my situation their own way. I handled it my way. You don&amp;#39;t know why I did, but it&amp;#39;s in my best interests.&lt;/p&gt;\n\n&lt;p&gt;I suggest reading my &lt;a href=\"https://www.reddit.com/r/legaladvice/comments/5v65qw/neighbor_harassment_is_there_anything_i_can_do/?st=izk03ir1&amp;amp;sh=c279c49d\"&gt;initial post&lt;/a&gt; as well as my &lt;a href=\"https://www.reddit.com/r/legaladvice/comments/5vyaeo/pennsylvania_update_hello_fellow_redditors_im_the/?st=j1dr7shw&amp;amp;sh=0f1cee46\"&gt;follow up post&lt;/a&gt; so you can have some sort of backstory of what is happening to me.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR AT THE BOTTOM AS WELL&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;And for the lazy who won&amp;#39;t click the links, I&amp;#39;ll give a quick overview of whats happening: Bought my first home in December, neighbor likes to call the cops for everything you can imagine, neighbor infringes on our privacy whenever we are outside and threatens to call the cops on us for no reason.&lt;/p&gt;\n\n&lt;p&gt;Now bear with me here, I don&amp;#39;t have exact dates to go off of since I am at work and on my lunch break. I will guesstimate the best as possible with dates.&lt;/p&gt;\n\n&lt;p&gt;So we left my first update where me and my S/O caught our crazy neighbor lady in our front yard blowing leaves around. Nobody was home at the time and my S/O drove by the house and saw it. That&amp;#39;s how we know. A lot of people suggested getting a security camera system and I said I would be getting one as soon as possible. Other financial issues came up and I had to put off the camera system for a few weeks.&lt;/p&gt;\n\n&lt;p&gt;This is where the &lt;strong&gt;2nd update starts&lt;/strong&gt;. Fast forward from February to March 15th(?). It is around 9:45pm and I am out back smoking a cigarette. I see movement out of the corner of my eye and look over towards it and see this.... hand... throwing pieces of garbage into my yard over the fence. It&amp;#39;s Crazy Neighbor Lady. She didn&amp;#39;t know I was outside (just good timing on my part I guess). I played dumb and asked, &amp;quot;What are you doing Crazy Neighbor Lady&amp;quot; and she quick stops throwing the trash and quickly turns around to go inside of her house. As she gets closer to her door she turns around and says, &amp;quot;I&amp;#39;m sorry, what did you say?&amp;quot; With which I responded loudly, &amp;quot;&lt;em&gt;What are you doing Crazy Neighbor Lady?&lt;/em&gt;&amp;quot; She says she was just outside checking out her yard... Now mind you, it&amp;#39;s 9:45pm and it had just started to snow. We were projected to get 12+ inches of snow so I think her plan was to throw trash into my yard and then have it be covered up by the snow.&lt;/p&gt;\n\n&lt;p&gt;I went over to where I saw her hand coming over the fence and found a random piece of plastic and a soda lid (think of the ones that you get from fast food places with your drink. The kind you poke a straw through). They were laying neatly on top of the leaves and mulch bed that they were thrown on.&lt;/p&gt;\n\n&lt;p&gt;This had me LIVID. I caught her in the act and bought a security camera system that night on Amazon. It came within two days and I set it up over that weekend. &lt;/p&gt;\n\n&lt;p&gt;I set all of the cameras up inside of windows looking out towards my property. It took only THREE DAYS of having the cameras to find her throwing more little pieces of trash onto our property. It&amp;#39;s just little pieces of trash that end up in her yard. We live in a city along one of the busiest streets. It&amp;#39;s unfortunate that people litter out of their cars but it happens. If I see any trash in my yard, I&amp;#39;ll pick it up and throw it out. If Crazy Neighbor Lady sees any trash in her yard, she&amp;#39;ll throw it into her neighbors yards so it&amp;#39;s not her problem.&lt;/p&gt;\n\n&lt;p&gt;Over the period of a month I catch her 3 different times on camera throwing trash from her property on to mine. She physically picks it up, comes on to my property and sets it down well on to my side of the front yard when nobody is home. To some, it may sound like I&amp;#39;m going to the extremes to try and screw this lady over, but given her past history that I&amp;#39;ve heard from other neighbors, I&amp;#39;m stomping out the fire (her) before it (she) can even get started.&lt;/p&gt;\n\n&lt;p&gt;Last night, I catch her on camera for the 4th time coming on to my property to throw more trash into my yard. This time she has her dogs with her and are letting her dogs roam around without a leash in my yard. I had finally had enough and called the police to come out to look at my videos and see if there was anything I can do about her.&lt;/p&gt;\n\n&lt;p&gt;Police officer comes out looks at the videos and I read him the journal of all of the interactions of had with her and he&amp;#39;s kind of blown away with all of the work I&amp;#39;ve put into protecting myself. My neighbor is a huge PITA for my city&amp;#39;s police department (she&amp;#39;ll make calls to them for things like the kids being too loud in the playground across the street from us.. unnecessary stuff) and they have no problem slapping her with charges if legitimate charges can be made.&lt;/p&gt;\n\n&lt;p&gt;I could have pressed charges against her for trespassing, littering and not having her dog on a leash, but I opted to just have the police officer go over to her house and give her a warning. I don&amp;#39;t really have the time to take off from work to go to court. I told him to let her know that if she&amp;#39;s ever caught on my property or throwing trash on to my property, then I will press charges. He was licking his chops to go over there and ream her ass out. The city police HATE her and like many others have probably mentioned, they take all of her calls with a grain of salt.&lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m just waiting to see what the next chapter has in store for me. I&amp;#39;m sure she was told that she has been caught on camera so I&amp;#39;ll have to wait and see if she tries looking for my cameras. BTW these cameras are fun to watch. It&amp;#39;s like I&amp;#39;m living next to a 61 year old child.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR: Bought cameras, caught neighbor coming on to my property to throw trash on my property on 4 different occasions, finally got sick of her shit, called police, they verbally thrashed her&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;edit: Messaged mods to unlock this post for discussion... mods said no :(&lt;/p&gt;\n\n&lt;p&gt;edit 2: I&amp;#39;m not posting the videos in case I do have to take them to court in the future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "edit: I'm trying to x-post this to r/legaladviceofftopic for discussion or if anybody has questions but the bot is giving me a tough time.\n\nanother edit: I think I finally got the x-post to r/legaladviceofftopic. [If you have anything to say, questions, etc, feel free to click this link](https://www.reddit.com/r/legaladviceofftopic/comments/64szql/xpost_from_legaladvice_i_finally_got_some_sweet/?st=j1dxb1sz&amp;sh=18c6b612) Enter at your own risk though, the saltiness level of some people is at an all time high it seems like right now. Everybody would have handled my situation their own way. I handled it my way. You don't know why I did, but it's in my best interests.\n\nI suggest reading my [initial post](https://www.reddit.com/r/legaladvice/comments/5v65qw/neighbor_harassment_is_there_anything_i_can_do/?st=izk03ir1&amp;sh=c279c49d) as well as my [follow up post](https://www.reddit.com/r/legaladvice/comments/5vyaeo/pennsylvania_update_hello_fellow_redditors_im_the/?st=j1dr7shw&amp;sh=0f1cee46) so you can have some sort of backstory of what is happening to me.\n\n**TLDR AT THE BOTTOM AS WELL**\n\nAnd for the lazy who won't click the links, I'll give a quick overview of whats happening: Bought my first home in December, neighbor likes to call the cops for everything you can imagine, neighbor infringes on our privacy whenever we are outside and threatens to call the cops on us for no reason.\n\nNow bear with me here, I don't have exact dates to go off of since I am at work and on my lunch break. I will guesstimate the best as possible with dates.\n\nSo we left my first update where me and my S/O caught our crazy neighbor lady in our front yard blowing leaves around. Nobody was home at the time and my S/O drove by the house and saw it. That's how we know. A lot of people suggested getting a security camera system and I said I would be getting one as soon as possible. Other financial issues came up and I had to put off the camera system for a few weeks.\n\nThis is where the **2nd update starts**. Fast forward from February to March 15th(?). It is around 9:45pm and I am out back smoking a cigarette. I see movement out of the corner of my eye and look over towards it and see this.... hand... throwing pieces of garbage into my yard over the fence. It's Crazy Neighbor Lady. She didn't know I was outside (just good timing on my part I guess). I played dumb and asked, \"What are you doing Crazy Neighbor Lady\" and she quick stops throwing the trash and quickly turns around to go inside of her house. As she gets closer to her door she turns around and says, \"I'm sorry, what did you say?\" With which I responded loudly, \"*What are you doing Crazy Neighbor Lady?*\" She says she was just outside checking out her yard... Now mind you, it's 9:45pm and it had just started to snow. We were projected to get 12+ inches of snow so I think her plan was to throw trash into my yard and then have it be covered up by the snow.\n\nI went over to where I saw her hand coming over the fence and found a random piece of plastic and a soda lid (think of the ones that you get from fast food places with your drink. The kind you poke a straw through). They were laying neatly on top of the leaves and mulch bed that they were thrown on.\n\nThis had me LIVID. I caught her in the act and bought a security camera system that night on Amazon. It came within two days and I set it up over that weekend. \n\nI set all of the cameras up inside of windows looking out towards my property. It took only THREE DAYS of having the cameras to find her throwing more little pieces of trash onto our property. It's just little pieces of trash that end up in her yard. We live in a city along one of the busiest streets. It's unfortunate that people litter out of their cars but it happens. If I see any trash in my yard, I'll pick it up and throw it out. If Crazy Neighbor Lady sees any trash in her yard, she'll throw it into her neighbors yards so it's not her problem.\n\nOver the period of a month I catch her 3 different times on camera throwing trash from her property on to mine. She physically picks it up, comes on to my property and sets it down well on to my side of the front yard when nobody is home. To some, it may sound like I'm going to the extremes to try and screw this lady over, but given her past history that I've heard from other neighbors, I'm stomping out the fire (her) before it (she) can even get started.\n\nLast night, I catch her on camera for the 4th time coming on to my property to throw more trash into my yard. This time she has her dogs with her and are letting her dogs roam around without a leash in my yard. I had finally had enough and called the police to come out to look at my videos and see if there was anything I can do about her.\n\nPolice officer comes out looks at the videos and I read him the journal of all of the interactions of had with her and he's kind of blown away with all of the work I've put into protecting myself. My neighbor is a huge PITA for my city's police department (she'll make calls to them for things like the kids being too loud in the playground across the street from us.. unnecessary stuff) and they have no problem slapping her with charges if legitimate charges can be made.\n\nI could have pressed charges against her for trespassing, littering and not having her dog on a leash, but I opted to just have the police officer go over to her house and give her a warning. I don't really have the time to take off from work to go to court. I told him to let her know that if she's ever caught on my property or throwing trash on to my property, then I will press charges. He was licking his chops to go over there and ream her ass out. The city police HATE her and like many others have probably mentioned, they take all of her calls with a grain of salt.\n\nNow I'm just waiting to see what the next chapter has in store for me. I'm sure she was told that she has been caught on camera so I'll have to wait and see if she tries looking for my cameras. BTW these cameras are fun to watch. It's like I'm living next to a 61 year old child.\n\n**TLDR: Bought cameras, caught neighbor coming on to my property to throw trash on my property on 4 different occasions, finally got sick of her shit, called police, they verbally thrashed her**\n\nedit: Messaged mods to unlock this post for discussion... mods said no :(\n\nedit 2: I'm not posting the videos in case I do have to take them to court in the future.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64s2cv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1241, "report_reasons": null, "author": "kshucker", "saved": false, "mod_reports": [], "name": "t3_64s2cv", "subreddit_name_prefixed": "r/legaladvice", "approved_by": null, "over_18": false, "domain": "self.legaladvice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rawz", "edited": 1491940193.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/legaladvice/comments/64s2cv/update_2_and_hopefully_the_last_im_the_guy_with/", "num_reports": null, "locked": true, "stickied": false, "created": 1491958451.0, "url": "https://www.reddit.com/r/legaladvice/comments/64s2cv/update_2_and_hopefully_the_last_im_the_guy_with/", "author_flair_text": null, "quarantine": false, "title": "UPDATE #2 (and hopefully the last): I'm the guy with the really horrible neighbor.", "created_utc": 1491929651.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 1241}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64s2cv", "likes": null, "replies": "", "user_reports": [], "id": "dg4jhkc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_64s2cv", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you for posting an update!  All update posts are automatically locked due to a historical lack of on-topic discussion.  If your post also contains a new question, please [message the moderators](https://www.reddit.com/message/compose/?to=/r/legaladvice&amp;subject=Re-approve%20my%20comment&amp;message=https://www.reddit.com/r/legaladvice/comments/64s2cv/update_2_and_hopefully_the_last_im_the_guy_with/%20\\(please%20leave%20this%20so%20we%20can%20reference%20your%20comment\\)) for a review. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/legaladvice) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for posting an update!  All update posts are automatically locked due to a historical lack of on-topic discussion.  If your post also contains a new question, please &lt;a href=\"https://www.reddit.com/message/compose/?to=/r/legaladvice&amp;amp;subject=Re-approve%20my%20comment&amp;amp;message=https://www.reddit.com/r/legaladvice/comments/64s2cv/update_2_and_hopefully_the_last_im_the_guy_with/%20(please%20leave%20this%20so%20we%20can%20reference%20your%20comment)\"&gt;message the moderators&lt;/a&gt; for a review. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/legaladvice\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg4jhkc", "score_hidden": true, "stickied": true, "created": 1491958451.0, "created_utc": 1491929651.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]