[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": true, "banned_by": null, "media_embed": {}, "subreddit": "legaladvice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Original post: &lt;a href=\"https://np.reddit.com/r/legaladvice/comments/5iqley/nj_us_andor_the_netherlands_im_pregnant_unusual/\"&gt;https://np.reddit.com/r/legaladvice/comments/5iqley/nj_us_andor_the_netherlands_im_pregnant_unusual/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Almost 4 months since I posted that. The belly is starting to get noticeable, to say the least. Late second trimester. &lt;/p&gt;\n\n&lt;p&gt;A few weeks after I posted it, my aunt called to wish me a Merry Christmas. She&amp;#39;s about my age, my aunt from my grandfather&amp;#39;s second marriage (my dad was from the first). She still lives in the Netherlands, and we were super close when we were students but drifted apart a bit after that, and she calls a few times a year, or I call her. Her family (aunt, uncle, and their daughter) are my last living relatives from my dad&amp;#39;s side of the family. &lt;/p&gt;\n\n&lt;p&gt;Anyway, long story short; I wasn&amp;#39;t going to tell her that I was pregnant as it was too early in the pregnancy, but I did anyway. Just couldn&amp;#39;t help it or something like that. I just did. Before I knew it, she was ordering a ticket for me to come see her (it is a lot easier for me to come over because of my dual citizenship than it is for her). I went, spent two weeks with her (on the other side of the Netherlands essentially, so away from my old life in the sex industry) and before I left she offered me that I could come live near her and she would help with all kinds of practical things, including bills if things become too much to handle. &lt;/p&gt;\n\n&lt;p&gt;So I found an apartment near her. It&amp;#39;s not big but it&amp;#39;ll do. I&amp;#39;ll be moving back to the Netherlands in a week or so, staying at my aunt and uncle&amp;#39;s place while my new place gets painted by my uncle and some of his friends from church. I&amp;#39;ll move into it by May 1st. I&amp;#39;ll somehow manage the rest. Their church&amp;#39;s pastor has already told my aunt that he will arrange some baby clothes for me. I met him when I was visiting there in January; he seems like a really lovely and warm man. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been offered a desk job at a specialist doctor&amp;#39;s office. The doctor knows about my pregnancy but he is willing to hire me anyway. I&amp;#39;ll be having a final interview after I arrive in the Netherlands but that&amp;#39;s mostly a formality since we have already had two Skype interviews and they went well. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m excited about life again; something I definitely wasn&amp;#39;t 6 months ago. It&amp;#39;s a bit odd that something that made me so unhappy resulted in such a positive thing for me. Some people have been overwhelmingly kind to me. I&amp;#39;ve already sworn to myself that I will pay it forward one day. &lt;/p&gt;\n\n&lt;p&gt;Your advice in the original thread seemed a bit snarky at times. I think I deserved that really. I was - and probably still am - a bit on the naive side. It probably helped me get into gear and gave me a good starting point as to what I could expect. But what I definitely didn&amp;#39;t deserve was the 2 PMs from people telling me that I was a sinner and that they hoped I would miscarry (or words to that effect). I know I am a sinner, but jeezy creezy. Bit much, don&amp;#39;t you think?&lt;/p&gt;\n\n&lt;p&gt;Thanks to those who tried to help me. I really really appreciate it. &lt;/p&gt;\n\n&lt;p&gt;TL;DR: My aunt is awesome. Moving back to the Netherlands once again soon. People are good people... Except those who are not and PM people rude things on Reddit. Thanks. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Original post: https://np.reddit.com/r/legaladvice/comments/5iqley/nj_us_andor_the_netherlands_im_pregnant_unusual/\n\nAlmost 4 months since I posted that. The belly is starting to get noticeable, to say the least. Late second trimester. \n\nA few weeks after I posted it, my aunt called to wish me a Merry Christmas. She's about my age, my aunt from my grandfather's second marriage (my dad was from the first). She still lives in the Netherlands, and we were super close when we were students but drifted apart a bit after that, and she calls a few times a year, or I call her. Her family (aunt, uncle, and their daughter) are my last living relatives from my dad's side of the family. \n\nAnyway, long story short; I wasn't going to tell her that I was pregnant as it was too early in the pregnancy, but I did anyway. Just couldn't help it or something like that. I just did. Before I knew it, she was ordering a ticket for me to come see her (it is a lot easier for me to come over because of my dual citizenship than it is for her). I went, spent two weeks with her (on the other side of the Netherlands essentially, so away from my old life in the sex industry) and before I left she offered me that I could come live near her and she would help with all kinds of practical things, including bills if things become too much to handle. \n\nSo I found an apartment near her. It's not big but it'll do. I'll be moving back to the Netherlands in a week or so, staying at my aunt and uncle's place while my new place gets painted by my uncle and some of his friends from church. I'll move into it by May 1st. I'll somehow manage the rest. Their church's pastor has already told my aunt that he will arrange some baby clothes for me. I met him when I was visiting there in January; he seems like a really lovely and warm man. \n\nI've been offered a desk job at a specialist doctor's office. The doctor knows about my pregnancy but he is willing to hire me anyway. I'll be having a final interview after I arrive in the Netherlands but that's mostly a formality since we have already had two Skype interviews and they went well. \n\nI'm excited about life again; something I definitely wasn't 6 months ago. It's a bit odd that something that made me so unhappy resulted in such a positive thing for me. Some people have been overwhelmingly kind to me. I've already sworn to myself that I will pay it forward one day. \n\nYour advice in the original thread seemed a bit snarky at times. I think I deserved that really. I was - and probably still am - a bit on the naive side. It probably helped me get into gear and gave me a good starting point as to what I could expect. But what I definitely didn't deserve was the 2 PMs from people telling me that I was a sinner and that they hoped I would miscarry (or words to that effect). I know I am a sinner, but jeezy creezy. Bit much, don't you think?\n\nThanks to those who tried to help me. I really really appreciate it. \n\nTL;DR: My aunt is awesome. Moving back to the Netherlands once again soon. People are good people... Except those who are not and PM people rude things on Reddit. Thanks. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64t89y", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 201, "report_reasons": null, "author": "PregnantQuestionTime", "saved": false, "mod_reports": [], "name": "t3_64t89y", "subreddit_name_prefixed": "r/legaladvice", "approved_by": null, "over_18": false, "domain": "self.legaladvice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rawz", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/legaladvice/comments/64t89y/update_nj_us_andor_the_netherlands_im_pregnant/", "num_reports": null, "locked": true, "stickied": false, "created": 1491968822.0, "url": "https://www.reddit.com/r/legaladvice/comments/64t89y/update_nj_us_andor_the_netherlands_im_pregnant/", "author_flair_text": null, "quarantine": false, "title": "[update] [NJ, US and/or the Netherlands] I'm pregnant. Unusual situation. How will child support work?", "created_utc": 1491940022.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 201}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64t89y", "likes": null, "replies": "", "user_reports": [], "id": "dg4t23j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_64t89y", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you for posting an update!  All update posts are automatically locked due to a historical lack of on-topic discussion.  If your post also contains a new question, please [message the moderators](https://www.reddit.com/message/compose/?to=/r/legaladvice&amp;subject=Re-approve%20my%20comment&amp;message=https://www.reddit.com/r/legaladvice/comments/64t89y/update_nj_us_andor_the_netherlands_im_pregnant/%20\\(please%20leave%20this%20so%20we%20can%20reference%20your%20comment\\)) for a review. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/legaladvice) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for posting an update!  All update posts are automatically locked due to a historical lack of on-topic discussion.  If your post also contains a new question, please &lt;a href=\"https://www.reddit.com/message/compose/?to=/r/legaladvice&amp;amp;subject=Re-approve%20my%20comment&amp;amp;message=https://www.reddit.com/r/legaladvice/comments/64t89y/update_nj_us_andor_the_netherlands_im_pregnant/%20(please%20leave%20this%20so%20we%20can%20reference%20your%20comment)\"&gt;message the moderators&lt;/a&gt; for a review. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/legaladvice\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg4t23j", "score_hidden": true, "stickied": true, "created": 1491968822.0, "created_utc": 1491940022.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]