[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "legaladvice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been working and living in Japan since July of last year. I moved from &lt;strong&gt;San Diego, California&lt;/strong&gt;. Through my dog&amp;#39;s veterinarian, we (husband and I) have been preparing to move him here with us too. This process started in early July, before I left for Japan. &lt;/p&gt;\n\n&lt;p&gt;To bring a dog into Japan (a &amp;quot;rabies-free&amp;quot; country) from the US (a non rabies free country), the process is extremely long and extremely strict. &lt;/p&gt;\n\n&lt;p&gt;It includes:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;A particular microchip&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A certain number of rabies vaccines received within a certain time period of one another&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A rabies titer test that must be processed by one of 5 special rabies laboratories in the US (we went through Kansas State)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;At least 180 days must have passed before the dog can legally enter the country to be sure that no rabies has developed as a result of the test&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The original rabies titer test results with a white and purple sticker (no copy is acceptable)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;An exporter&amp;#39;s declaration form (owner fills this out)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A health certificate (a USDA accredited vet fills this out)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;40+ day notification of intent to import through the appropriate Japanese quarantine facility (we are going through KIX, Kansai International Airport, in Osaka)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;(within 10 days of departure) The exporter&amp;#39;s declaration form and the health certificate form must be endorsed by the USDA in order to receive official stamps and a certificate granting permission to take the dog out of the country and into Japan. Has a validity period of 10 days so this was the very last thing we had yet to do&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Any mistake, clerical or otherwise, on the paperwork could result in the quarantine or outright euthanization of my dog should I attempt to bring him to Japan&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;We have done everything aside from the USDA endorsement. The problem came when I started asking the vet for the original titer test results because I needed to send a photocopy to the Japanese Quarantine in KIX so they would have it ready to check with the original that I have to bring. &lt;/p&gt;\n\n&lt;p&gt;The vet told me that they do not receive the original results and that they are automatically sent to the USDA for safe keeping and that I could access it by going to the USDA when I need to get the other two documents endorsed. &lt;/p&gt;\n\n&lt;p&gt;This went against everything I knew about the process but when pressed, the vet insisted that they do not receive the original. So I called Kansas State, who processed the rabies test, and asked them. They said that the requesting vet clinic &lt;em&gt;does&lt;/em&gt; receive the original results but to call the USDA branches in Sacramento and LA just to be sure. &lt;/p&gt;\n\n&lt;p&gt;I called and they both confirmed that for travel to Japan, the original titer test results are &lt;strong&gt;always&lt;/strong&gt; sent back to the requesting vet clinic. &lt;/p&gt;\n\n&lt;p&gt;The vet still denies this and I decide to call Kansas State back who then puts out an email to Antech (a private entity who acts as a go-between for clinics and the rabies laboratory), me, the USDA, and the vet clinic to locate the original. &lt;/p&gt;\n\n&lt;p&gt;We were never able to track down the original but that&amp;#39;s not the least of our worries. &lt;/p&gt;\n\n&lt;p&gt;The copy that I received from Kansas State had a glaring error on it: my dog was marked as a female instead of a male. &lt;/p&gt;\n\n&lt;p&gt;I immediately called Kansas State back to ask and was told that the requesting vet clinic (my clinic...) submitted him as a female and if I want to reissue, it would be a $105 fee. &lt;/p&gt;\n\n&lt;p&gt;I fought the clinic to pay the fee even though they insisted that because it was the mistake of a former employee, they weren&amp;#39;t liable for it. &lt;/p&gt;\n\n&lt;p&gt;They put in a request to change info complete with a statement, the fee, and proof of my dog&amp;#39;s actual sex, last Friday. &lt;/p&gt;\n\n&lt;p&gt;But there&amp;#39;s no guarantee that it will be processed and back in time. The vet clinic says that if it isn&amp;#39;t, it isn&amp;#39;t their fault because they tried as hard as they could to &amp;quot;reunite&amp;quot; us. &lt;/p&gt;\n\n&lt;p&gt;In addition, the vet I spoke with who previously touted herself as the &amp;quot;expert in the office&amp;quot; on preparing animals for Japan confessed to me at our 3am (my time..) meeting that she has never done it before but is doing &amp;quot;what she can&amp;quot;. I feel lied to since this is the same woman who was so eager to not have me walk out the door to find someone demonstrably knowledgeable about the process.&lt;/p&gt;\n\n&lt;p&gt;Japan Quarantine has my dog&amp;#39;s arrival date on April 20th. He MUST be in Japan on that date or we have to redo the entire 40 day notification, which means buying &lt;em&gt;another&lt;/em&gt; plane ticket and taking more time off work. &lt;/p&gt;\n\n&lt;p&gt;At this point, my dog is being taken care of by my roommates in San Diego but they are not willing to look after him anymore since our agreement was until April, when I would take him home. &lt;/p&gt;\n\n&lt;p&gt;This means that I have to rehome him while I&amp;#39;m in the US next week if this paper doesn&amp;#39;t get there in time.&lt;/p&gt;\n\n&lt;p&gt;I leave in two days to go get him and due to a grievous error on the part of the vet clinic, I may not be able to bring him now. I&amp;#39;ve spent over USD 2000 on plane tickets, testing, and paperwork fees over the course of almost one year just to get my dog here.&lt;/p&gt;\n\n&lt;p&gt;I strongly feel that the vet clinic is responsible for this in every way and I do not want to let them get away with this if the worst happens, but I don&amp;#39;t know what kind of consultation to seek or even if I have a case. I&amp;#39;m 25 and have never even considered a lawsuit against anyone before so my question is: &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;If I have a case, how should I go about contacting someone to talk to? Is there a particular kind of category that this falls into?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have been working and living in Japan since July of last year. I moved from **San Diego, California**. Through my dog's veterinarian, we (husband and I) have been preparing to move him here with us too. This process started in early July, before I left for Japan. \n\nTo bring a dog into Japan (a \"rabies-free\" country) from the US (a non rabies free country), the process is extremely long and extremely strict. \n\nIt includes:\n \n* A particular microchip\n\n* A certain number of rabies vaccines received within a certain time period of one another\n\n* A rabies titer test that must be processed by one of 5 special rabies laboratories in the US (we went through Kansas State)\n\n* At least 180 days must have passed before the dog can legally enter the country to be sure that no rabies has developed as a result of the test\n\n* The original rabies titer test results with a white and purple sticker (no copy is acceptable)\n\n* An exporter's declaration form (owner fills this out)\n\n* A health certificate (a USDA accredited vet fills this out)\n\n* 40+ day notification of intent to import through the appropriate Japanese quarantine facility (we are going through KIX, Kansai International Airport, in Osaka)\n\n* (within 10 days of departure) The exporter's declaration form and the health certificate form must be endorsed by the USDA in order to receive official stamps and a certificate granting permission to take the dog out of the country and into Japan. Has a validity period of 10 days so this was the very last thing we had yet to do\n\n**Any mistake, clerical or otherwise, on the paperwork could result in the quarantine or outright euthanization of my dog should I attempt to bring him to Japan**\n\nWe have done everything aside from the USDA endorsement. The problem came when I started asking the vet for the original titer test results because I needed to send a photocopy to the Japanese Quarantine in KIX so they would have it ready to check with the original that I have to bring. \n\nThe vet told me that they do not receive the original results and that they are automatically sent to the USDA for safe keeping and that I could access it by going to the USDA when I need to get the other two documents endorsed. \n\nThis went against everything I knew about the process but when pressed, the vet insisted that they do not receive the original. So I called Kansas State, who processed the rabies test, and asked them. They said that the requesting vet clinic *does* receive the original results but to call the USDA branches in Sacramento and LA just to be sure. \n\nI called and they both confirmed that for travel to Japan, the original titer test results are **always** sent back to the requesting vet clinic. \n\nThe vet still denies this and I decide to call Kansas State back who then puts out an email to Antech (a private entity who acts as a go-between for clinics and the rabies laboratory), me, the USDA, and the vet clinic to locate the original. \n\nWe were never able to track down the original but that's not the least of our worries. \n\nThe copy that I received from Kansas State had a glaring error on it: my dog was marked as a female instead of a male. \n\nI immediately called Kansas State back to ask and was told that the requesting vet clinic (my clinic...) submitted him as a female and if I want to reissue, it would be a $105 fee. \n\nI fought the clinic to pay the fee even though they insisted that because it was the mistake of a former employee, they weren't liable for it. \n\nThey put in a request to change info complete with a statement, the fee, and proof of my dog's actual sex, last Friday. \n\nBut there's no guarantee that it will be processed and back in time. The vet clinic says that if it isn't, it isn't their fault because they tried as hard as they could to \"reunite\" us. \n\nIn addition, the vet I spoke with who previously touted herself as the \"expert in the office\" on preparing animals for Japan confessed to me at our 3am (my time..) meeting that she has never done it before but is doing \"what she can\". I feel lied to since this is the same woman who was so eager to not have me walk out the door to find someone demonstrably knowledgeable about the process.\n\nJapan Quarantine has my dog's arrival date on April 20th. He MUST be in Japan on that date or we have to redo the entire 40 day notification, which means buying *another* plane ticket and taking more time off work. \n\nAt this point, my dog is being taken care of by my roommates in San Diego but they are not willing to look after him anymore since our agreement was until April, when I would take him home. \n\nThis means that I have to rehome him while I'm in the US next week if this paper doesn't get there in time.\n\nI leave in two days to go get him and due to a grievous error on the part of the vet clinic, I may not be able to bring him now. I've spent over USD 2000 on plane tickets, testing, and paperwork fees over the course of almost one year just to get my dog here.\n\nI strongly feel that the vet clinic is responsible for this in every way and I do not want to let them get away with this if the worst happens, but I don't know what kind of consultation to seek or even if I have a case. I'm 25 and have never even considered a lawsuit against anyone before so my question is: \n\n**If I have a case, how should I go about contacting someone to talk to? Is there a particular kind of category that this falls into?**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Other Civil Matters", "id": "64y80q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 64, "report_reasons": null, "author": "DornishFox", "saved": false, "mod_reports": [], "name": "t3_64y80q", "subreddit_name_prefixed": "r/legaladvice", "approved_by": null, "over_18": false, "domain": "self.legaladvice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rawz", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/legaladvice/comments/64y80q/might_be_out_2k_plus_not_able_to_bring_my_dog_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492033504.0, "url": "https://www.reddit.com/r/legaladvice/comments/64y80q/might_be_out_2k_plus_not_able_to_bring_my_dog_to/", "author_flair_text": null, "quarantine": false, "title": "Might be out 2k plus not able to bring my dog to Japan; considering a consultation", "created_utc": 1492004704.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 64}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": "", "user_reports": [], "id": "dg6tm8s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DornishFox", "parent_id": "t1_dg6r1qw", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I have. They are very aware of my situation and they sympathize but they said they're going as fast as they can. \n\nI feel like there's nothing more I can do.. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have. They are very aware of my situation and they sympathize but they said they&amp;#39;re going as fast as they can. &lt;/p&gt;\n\n&lt;p&gt;I feel like there&amp;#39;s nothing more I can do.. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6tm8s", "score_hidden": false, "stickied": false, "created": 1492071434.0, "created_utc": 1492042634.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6r1qw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "blendedbanana", "parent_id": "t1_dg5zxgh", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I know this is hardly 'helpful' in a meaningful way, but if you were able to reliably get in contact with people at KS- giving them a desperation call and explaining everything again- there's always the possibility they can move you to the front of the line, essentially.\n\nIt's not impossible for them to reissue things without 'processing the request', as opposed to somebody personally making sure yours gets done right away and sent out without the normal workflow.\n\nWill they do this?  Who knows, they don't have to- the vet is the one who made this the situation, its not their fault.  Could somebody take pity on your cause and help out?  Potentially, if you really ask and hope they feel guilty for such a bad scenario.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know this is hardly &amp;#39;helpful&amp;#39; in a meaningful way, but if you were able to reliably get in contact with people at KS- giving them a desperation call and explaining everything again- there&amp;#39;s always the possibility they can move you to the front of the line, essentially.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not impossible for them to reissue things without &amp;#39;processing the request&amp;#39;, as opposed to somebody personally making sure yours gets done right away and sent out without the normal workflow.&lt;/p&gt;\n\n&lt;p&gt;Will they do this?  Who knows, they don&amp;#39;t have to- the vet is the one who made this the situation, its not their fault.  Could somebody take pity on your cause and help out?  Potentially, if you really ask and hope they feel guilty for such a bad scenario.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6r1qw", "score_hidden": false, "stickied": false, "created": 1492068251.0, "created_utc": 1492039451.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zxgh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DornishFox", "parent_id": "t1_dg5zdzb", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Even with it expedited, there is no guarantee that the results will be in before departure. I have money currently in transit to my US bank account to pay for it but it won't be in until Friday. \n\nThat's the problem. Even *if* I shell out the extra $75 on top of the already paid $105, there is **no** way to know if we'll get the results back in time. And that is coming from Kansas State, who processes the requests and issues the test results. They couldn't give me an ETA of any kind. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even with it expedited, there is no guarantee that the results will be in before departure. I have money currently in transit to my US bank account to pay for it but it won&amp;#39;t be in until Friday. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the problem. Even &lt;em&gt;if&lt;/em&gt; I shell out the extra $75 on top of the already paid $105, there is &lt;strong&gt;no&lt;/strong&gt; way to know if we&amp;#39;ll get the results back in time. And that is coming from Kansas State, who processes the requests and issues the test results. They couldn&amp;#39;t give me an ETA of any kind. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg5zxgh", "score_hidden": false, "stickied": false, "created": 1492038813.0, "created_utc": 1492010013.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zdzb", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "auriem", "parent_id": "t1_dg5z4cg", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "They are responsible for their employees actions. Nevertheless I recommend paying what they want to expedite the process. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They are responsible for their employees actions. Nevertheless I recommend paying what they want to expedite the process. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg5zdzb", "score_hidden": false, "stickied": false, "created": 1492038208.0, "created_utc": 1492009408.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5z4cg", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "DornishFox", "parent_id": "t1_dg5yj60", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Ah, I see. Thanks for clarifying. \n\nI feel like the vet clinic *did* clarify that their former employee was responsible when I was fighting with them to pay for the $105 fee for a corrected reissue. \n\nUnless you mean for the original titer test results that they lost. In which case, there is proof that it came to their office and then somehow disappeared thanks to the aforementioned email with Antech, the clinic, me, and Kansas State but that information was not shared with me. Should I make a request for it? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah, I see. Thanks for clarifying. &lt;/p&gt;\n\n&lt;p&gt;I feel like the vet clinic &lt;em&gt;did&lt;/em&gt; clarify that their former employee was responsible when I was fighting with them to pay for the $105 fee for a corrected reissue. &lt;/p&gt;\n\n&lt;p&gt;Unless you mean for the original titer test results that they lost. In which case, there is proof that it came to their office and then somehow disappeared thanks to the aforementioned email with Antech, the clinic, me, and Kansas State but that information was not shared with me. Should I make a request for it? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg5z4cg", "score_hidden": false, "stickied": false, "created": 1492037902.0, "created_utc": 1492009102.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5yj60", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "auriem", "parent_id": "t1_dg5y9ji", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You are getting two conflicting answers from them, getting them both on the phone might help clarify who is responsible for what.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are getting two conflicting answers from them, getting them both on the phone might help clarify who is responsible for what.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg5yj60", "score_hidden": false, "stickied": false, "created": 1492037238.0, "created_utc": 1492008438.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5y9ji", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "DornishFox", "parent_id": "t1_dg5xyti", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thanks for the reply!\n\nWhat should I be hoping to gain from a conference call with the two of them, in your opinion?\n\nI worry that the vet is just going to try and slag off the responsibility by admitting that they didn't know what they were doing but are trying now, which would then be putting the blame on me for blindly trusting them in the first place. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the reply!&lt;/p&gt;\n\n&lt;p&gt;What should I be hoping to gain from a conference call with the two of them, in your opinion?&lt;/p&gt;\n\n&lt;p&gt;I worry that the vet is just going to try and slag off the responsibility by admitting that they didn&amp;#39;t know what they were doing but are trying now, which would then be putting the blame on me for blindly trusting them in the first place. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg5y9ji", "score_hidden": false, "stickied": false, "created": 1492036934.0, "created_utc": 1492008134.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5xyti", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "auriem", "parent_id": "t3_64y80q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Conference call the vet and Kansas state ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Conference call the vet and Kansas state ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg5xyti", "score_hidden": false, "stickied": false, "created": 1492036589.0, "created_utc": 1492007789.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": "", "user_reports": [], "id": "dg61m4m", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "vasion123", "parent_id": "t3_64y80q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "This is out of my legal experience realm and I have no advice but wow Japan is not screwing around at all when it comes to keeping rabies out of their country.  I feel sorry for you and you clearly love Dogs as much as I do and wish you luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is out of my legal experience realm and I have no advice but wow Japan is not screwing around at all when it comes to keeping rabies out of their country.  I feel sorry for you and you clearly love Dogs as much as I do and wish you luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg61m4m", "score_hidden": false, "stickied": false, "created": 1492040667.0, "created_utc": 1492011867.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": "", "user_reports": [], "id": "dg71uva", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bookstore", "parent_id": "t1_dg6tjhc", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I think that's a normal part of international moving. I wish you and your pup the best!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s a normal part of international moving. I wish you and your pup the best!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg71uva", "score_hidden": false, "stickied": false, "created": 1492081662.0, "created_utc": 1492052862.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6tjhc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DornishFox", "parent_id": "t1_dg6rf4l", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "We're past the point where throwing money at it will expedite the process any faster than it's already going. \n\nThe people at Kansas State are very aware of my situation and have promised to do what they can.\n\nI don't know why it would take two to three weeks to reissue a piece of paper but there it is. \n\nNow it's just a waiting game as I slowly develop an ulcer and suffer from severe anxiety over the whole thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;re past the point where throwing money at it will expedite the process any faster than it&amp;#39;s already going. &lt;/p&gt;\n\n&lt;p&gt;The people at Kansas State are very aware of my situation and have promised to do what they can.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know why it would take two to three weeks to reissue a piece of paper but there it is. &lt;/p&gt;\n\n&lt;p&gt;Now it&amp;#39;s just a waiting game as I slowly develop an ulcer and suffer from severe anxiety over the whole thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6tjhc", "score_hidden": false, "stickied": false, "created": 1492071340.0, "created_utc": 1492042540.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rf4l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blendedbanana", "parent_id": "t1_dg605n1", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Is there nobody you know in the U.S. who could front the fee faster?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there nobody you know in the U.S. who could front the fee faster?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6rf4l", "score_hidden": false, "stickied": false, "created": 1492068701.0, "created_utc": 1492039901.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg605n1", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "DornishFox", "parent_id": "t1_dg5zh5k", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "It feels like they're not malicious; just incompetent to a fault. \n\nThe initial fee has already been paid and I'm sending money to my US bank account to have it expedited but it won't be in until Friday. All of my other funds in my US bank account are tied up. \n\n*If* my dog gets safely to Japan, I'll just be giving a detailed review and letting other people know that they should go somewhere else for moving animals overseas. \n\nBut I have no guarantee even with an expedited process that the rabies test results will get there in time. The representative at Kansas State could not give me any kind of ETA. That's the problem. If I expedite it and it still doesn't get there in time, then my dog can't go period full stop. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It feels like they&amp;#39;re not malicious; just incompetent to a fault. &lt;/p&gt;\n\n&lt;p&gt;The initial fee has already been paid and I&amp;#39;m sending money to my US bank account to have it expedited but it won&amp;#39;t be in until Friday. All of my other funds in my US bank account are tied up. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;If&lt;/em&gt; my dog gets safely to Japan, I&amp;#39;ll just be giving a detailed review and letting other people know that they should go somewhere else for moving animals overseas. &lt;/p&gt;\n\n&lt;p&gt;But I have no guarantee even with an expedited process that the rabies test results will get there in time. The representative at Kansas State could not give me any kind of ETA. That&amp;#39;s the problem. If I expedite it and it still doesn&amp;#39;t get there in time, then my dog can&amp;#39;t go period full stop. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg605n1", "score_hidden": false, "stickied": false, "created": 1492039064.0, "created_utc": 1492010264.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zh5k", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "bookstore", "parent_id": "t3_64y80q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Soo I brought a dog to Australia from the US so I understand your nightmare. If you've only spent 2k, you're doing *great* if it makes you feel any better. The original titre test was sent from Kansas back to our original vet, so I'm inclined to think your vet is a bit shady, especially since they claim to be \"an expert\" at moving dogs overseas and in fact have never done it before. They probably lost the paperwork. \n\nMy advice would have been to not waste time over arguing about $100 in fees and just get comfortable with bleeding money until the process is complete. You don't know if it will work out yet (it probably will). Make sure the vet (and everyone else at the clinic) knows they will be receiving the titre results and you need them *immediately*. Call them every day to ask if they are in. Be annoying. Don't wait for a phone call. \n\nI'm not a lawyer, but once your dog is safely in Japan I would just let it go and take it as a learning experience. In the future, expect it to be an expensive nightmare and go with someone who has experience moving an animal overseas. fwiw, it will be much easier and cheaper moving the dog back to the states if you end up back here. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Soo I brought a dog to Australia from the US so I understand your nightmare. If you&amp;#39;ve only spent 2k, you&amp;#39;re doing &lt;em&gt;great&lt;/em&gt; if it makes you feel any better. The original titre test was sent from Kansas back to our original vet, so I&amp;#39;m inclined to think your vet is a bit shady, especially since they claim to be &amp;quot;an expert&amp;quot; at moving dogs overseas and in fact have never done it before. They probably lost the paperwork. &lt;/p&gt;\n\n&lt;p&gt;My advice would have been to not waste time over arguing about $100 in fees and just get comfortable with bleeding money until the process is complete. You don&amp;#39;t know if it will work out yet (it probably will). Make sure the vet (and everyone else at the clinic) knows they will be receiving the titre results and you need them &lt;em&gt;immediately&lt;/em&gt;. Call them every day to ask if they are in. Be annoying. Don&amp;#39;t wait for a phone call. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a lawyer, but once your dog is safely in Japan I would just let it go and take it as a learning experience. In the future, expect it to be an expensive nightmare and go with someone who has experience moving an animal overseas. fwiw, it will be much easier and cheaper moving the dog back to the states if you end up back here. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg5zh5k", "score_hidden": false, "stickied": false, "created": 1492038306.0, "created_utc": 1492009506.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": "", "user_reports": [], "id": "dg66qnl", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "DornishFox", "parent_id": "t1_dg66fy2", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I would have had no problem spending the couple thousand dollars on a service like PetRelocation but all of the five biggest ones don't allow your pet to travel in cabin and since my dog is old and definitely small enough to fit in cabin, I opted for that for his comfort. \n\nConsidering we're flying UA, we both might be beaten and dragged off the plane anyway though.. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would have had no problem spending the couple thousand dollars on a service like PetRelocation but all of the five biggest ones don&amp;#39;t allow your pet to travel in cabin and since my dog is old and definitely small enough to fit in cabin, I opted for that for his comfort. &lt;/p&gt;\n\n&lt;p&gt;Considering we&amp;#39;re flying UA, we both might be beaten and dragged off the plane anyway though.. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg66qnl", "score_hidden": false, "stickied": false, "created": 1492046055.0, "created_utc": 1492017255.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 33}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66fy2", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "falling_grace", "parent_id": "t3_64y80q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "No advice on this situation, but for the future, because it seems like your dog might be traveling internationally again: there are companies that specialize in this.  They know exactly what needs to be done and some even provide care while the pet is waiting to be exported.  I'd go with one of those in the future instead of directly through your vet.  One of the more well known larger companies is PetRelocation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No advice on this situation, but for the future, because it seems like your dog might be traveling internationally again: there are companies that specialize in this.  They know exactly what needs to be done and some even provide care while the pet is waiting to be exported.  I&amp;#39;d go with one of those in the future instead of directly through your vet.  One of the more well known larger companies is PetRelocation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg66fy2", "score_hidden": false, "stickied": false, "created": 1492045753.0, "created_utc": 1492016953.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": "", "user_reports": [], "id": "dg6fpls", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "RubyPorto", "parent_id": "t1_dg684pf", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You might ask KIX ahead of time if you can have them quarantine the dog until all the paperwork comes in (emphasizing that the tests are all complete, but the vet mishandled the paperwork) rather than euthanizing it.  \nIn other words, see if they can tell you the result of the coinflip between quarentine and euthanasia before getting on the plane.\n\nIf they can't and the paperwork isn't fixed on time, you're going to have to repeat whatever part of the process you need to repeat.  \nJapan simply isn't under any obligation to make allowances for the vet's screwup, so your remedy is to sue the vet/lab for the additional costs you incurred. For that, you'll probably need a lawyer as the plane tickets to pursue this yourself in small claims will likely exceed any possible damages you could recover.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might ask KIX ahead of time if you can have them quarantine the dog until all the paperwork comes in (emphasizing that the tests are all complete, but the vet mishandled the paperwork) rather than euthanizing it.&lt;br/&gt;\nIn other words, see if they can tell you the result of the coinflip between quarentine and euthanasia before getting on the plane.&lt;/p&gt;\n\n&lt;p&gt;If they can&amp;#39;t and the paperwork isn&amp;#39;t fixed on time, you&amp;#39;re going to have to repeat whatever part of the process you need to repeat.&lt;br/&gt;\nJapan simply isn&amp;#39;t under any obligation to make allowances for the vet&amp;#39;s screwup, so your remedy is to sue the vet/lab for the additional costs you incurred. For that, you&amp;#39;ll probably need a lawyer as the plane tickets to pursue this yourself in small claims will likely exceed any possible damages you could recover.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6fpls", "score_hidden": false, "stickied": false, "created": 1492055219.0, "created_utc": 1492026419.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg684pf", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "DornishFox", "parent_id": "t1_dg67htr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thanks for the suggestion! \n\nI did already call the embassy and also spoke with an agent at KIX. Not having the rabies titer test is what results in euthansia since there's only one other way to prove that the animal doesn't have rabies (disection of the brain..). There's a small chance of him just being put through quarantine for 180 days again instead but it's not a risk I'm willing to take. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the suggestion! &lt;/p&gt;\n\n&lt;p&gt;I did already call the embassy and also spoke with an agent at KIX. Not having the rabies titer test is what results in euthansia since there&amp;#39;s only one other way to prove that the animal doesn&amp;#39;t have rabies (disection of the brain..). There&amp;#39;s a small chance of him just being put through quarantine for 180 days again instead but it&amp;#39;s not a risk I&amp;#39;m willing to take. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg684pf", "score_hidden": false, "stickied": false, "created": 1492047447.0, "created_utc": 1492018647.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67htr", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "mbn9890", "parent_id": "t3_64y80q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You may have already done so, but you may want to call the embassy for advice. I'm sure they've had many cases of pets arriving with incomplete requirements, and may have testing capabilities once you arrive. You may also want to ask about what makes a case go to quarantine vs euthanasia ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You may have already done so, but you may want to call the embassy for advice. I&amp;#39;m sure they&amp;#39;ve had many cases of pets arriving with incomplete requirements, and may have testing capabilities once you arrive. You may also want to ask about what makes a case go to quarantine vs euthanasia &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg67htr", "score_hidden": false, "stickied": false, "created": 1492046810.0, "created_utc": 1492018010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": "", "user_reports": [], "id": "dg6qhgz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cherriessplosh", "parent_id": "t3_64y80q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; Any mistake, clerical or otherwise, on the paperwork could result in the quarantine or outright euthanization of my dog should I attempt to bring him to Japan\n\n&gt; euthanization !!\n\n\nHoly shit i'm not sure I could ever do that :( Hope you guys get reunited safely.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Any mistake, clerical or otherwise, on the paperwork could result in the quarantine or outright euthanization of my dog should I attempt to bring him to Japan&lt;/p&gt;\n\n&lt;p&gt;euthanization !!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Holy shit i&amp;#39;m not sure I could ever do that :( Hope you guys get reunited safely.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6qhgz", "score_hidden": false, "stickied": false, "created": 1492067555.0, "created_utc": 1492038755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64y80q", "likes": null, "replies": "", "user_reports": [], "id": "dg6y6vy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DornishFox", "parent_id": "t1_dg6xz0n", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Hes a ten year old pomeranian with epilepsy. He no longer takes medication for his epilepsy but he has a siezure once every couple of months, which is about a 70% improvement from before the medication. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hes a ten year old pomeranian with epilepsy. He no longer takes medication for his epilepsy but he has a siezure once every couple of months, which is about a 70% improvement from before the medication. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6y6vy", "score_hidden": false, "stickied": false, "created": 1492076982.0, "created_utc": 1492048182.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xz0n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sapphyrre", "parent_id": "t3_64y80q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "What kind of dog is it? Does it have special needs? Maybe I can help you find a foster for it until the paperwork is straightened out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What kind of dog is it? Does it have special needs? Maybe I can help you find a foster for it until the paperwork is straightened out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6xz0n", "score_hidden": false, "stickied": false, "created": 1492076717.0, "created_utc": 1492047917.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]