[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": true, "banned_by": null, "media_embed": {}, "subreddit": "legaladvice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Here is the original posting: &lt;a href=\"https://www.reddit.com/r/legaladvice/comments/5sv8qu/gun_was_burgled_and_used_to_shoot_at_le_how_do_i/\"&gt;https://www.reddit.com/r/legaladvice/comments/5sv8qu/gun_was_burgled_and_used_to_shoot_at_le_how_do_i/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Cliffs: My store was burgled of a revolver. The thief ran, got pulled over and then in a chase, fled to his home, was surrounded, eventually came out shooting and was killed. The firearm had been the one he&amp;#39;d taken from me and was taken as evidence.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Update&lt;/strong&gt;: I was informed in June the case had been closed. I had not heard back from them, so this past month I really wanted to track it down, find exactly where it was, the judge who presided over the case, etc... basically do all the things I probably should have done from the start, but didn&amp;#39;t because I was told to be patient and wait. &lt;/p&gt;\n\n&lt;p&gt;I wasn&amp;#39;t getting anywhere, the local receptionist at the Texas Ranger&amp;#39;s office would not return my calls. The Ranger I&amp;#39;d spoken with in the past would not either. I sent an email to the local detective I work with and asked her how I could go about seeing if their office had my firearm and she didn&amp;#39;t get back with me either. I eventually called the main office in Austin and spoke with a woman. She took all my information and told me she&amp;#39;d send an email to the right people and that I should wait. I did. I got a call a couple days later from the Ranger who I&amp;#39;d spoken with last June and he says he&amp;#39;s coming by Thursday to release the firearm.&lt;/p&gt;\n\n&lt;p&gt;So, I&amp;#39;m about to call the lady in Austin and thank her. Looks like I should be getting it back soon. Thank you for those of you who advised me to be diligent and follow up on calling about it. A lot of people told me to forget about it and that I&amp;#39;d never get it back, not gloating, but they were clearly wrong and probably talking out of their ass and not legal expertise. Everyone should probably know that already when posting in this section. Alls well that ends well here, though.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Here is the original posting: https://www.reddit.com/r/legaladvice/comments/5sv8qu/gun_was_burgled_and_used_to_shoot_at_le_how_do_i/\n\nCliffs: My store was burgled of a revolver. The thief ran, got pulled over and then in a chase, fled to his home, was surrounded, eventually came out shooting and was killed. The firearm had been the one he'd taken from me and was taken as evidence.\n\n**Update**: I was informed in June the case had been closed. I had not heard back from them, so this past month I really wanted to track it down, find exactly where it was, the judge who presided over the case, etc... basically do all the things I probably should have done from the start, but didn't because I was told to be patient and wait. \n\nI wasn't getting anywhere, the local receptionist at the Texas Ranger's office would not return my calls. The Ranger I'd spoken with in the past would not either. I sent an email to the local detective I work with and asked her how I could go about seeing if their office had my firearm and she didn't get back with me either. I eventually called the main office in Austin and spoke with a woman. She took all my information and told me she'd send an email to the right people and that I should wait. I did. I got a call a couple days later from the Ranger who I'd spoken with last June and he says he's coming by Thursday to release the firearm.\n\nSo, I'm about to call the lady in Austin and thank her. Looks like I should be getting it back soon. Thank you for those of you who advised me to be diligent and follow up on calling about it. A lot of people told me to forget about it and that I'd never get it back, not gloating, but they were clearly wrong and probably talking out of their ass and not legal expertise. Everyone should probably know that already when posting in this section. Alls well that ends well here, though.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64yh6o", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1283, "report_reasons": null, "author": "ThrowAwayGunLost", "saved": false, "mod_reports": [], "name": "t3_64yh6o", "subreddit_name_prefixed": "r/legaladvice", "approved_by": null, "over_18": false, "domain": "self.legaladvice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rawz", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/legaladvice/comments/64yh6o/update_gun_was_burgled_and_used_to_shoot_at_le/", "num_reports": null, "locked": true, "stickied": false, "created": 1492036077.0, "url": "https://www.reddit.com/r/legaladvice/comments/64yh6o/update_gun_was_burgled_and_used_to_shoot_at_le/", "author_flair_text": null, "quarantine": false, "title": "UPDATE: Gun was burgled and used to shoot at LE, how do I get it back? [Texas]", "created_utc": 1492007277.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 1283}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_64yh6o", "likes": null, "replies": "", "user_reports": [], "id": "dg5xjaq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_64yh6o", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you for posting an update!  All update posts are automatically locked due to a historical lack of on-topic discussion.  If your post also contains a new question, please [message the moderators](https://www.reddit.com/message/compose/?to=/r/legaladvice&amp;subject=Re-approve%20my%20comment&amp;message=https://www.reddit.com/r/legaladvice/comments/64yh6o/update_gun_was_burgled_and_used_to_shoot_at_le/%20\\(please%20leave%20this%20so%20we%20can%20reference%20your%20comment\\)) for a review. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/legaladvice) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for posting an update!  All update posts are automatically locked due to a historical lack of on-topic discussion.  If your post also contains a new question, please &lt;a href=\"https://www.reddit.com/message/compose/?to=/r/legaladvice&amp;amp;subject=Re-approve%20my%20comment&amp;amp;message=https://www.reddit.com/r/legaladvice/comments/64yh6o/update_gun_was_burgled_and_used_to_shoot_at_le/%20(please%20leave%20this%20so%20we%20can%20reference%20your%20comment)\"&gt;message the moderators&lt;/a&gt; for a review. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/legaladvice\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg5xjaq", "score_hidden": true, "stickied": true, "created": 1492036078.0, "created_utc": 1492007278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]