[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "legaladvice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The following post is written and edited by a close friend of the victim who is a minor. Location: Arizona.&lt;/p&gt;\n\n&lt;p&gt;On March 30th, I was involved in a car accident where I rear-ended someone, and received a citation. I had a serious concussion, swollen thumbs, and a cut from the seatbelt. My parents took me eventually to the ER after the urgent care said the injuries are too serious. At the ER visit, my mother told the doctor that she gave me trazodone the night before without my knowledge which I have expressed to the doctor. I have never seen, heard, nor been prescribed the medication in my life. My parents have a long past history of verbal, emotional, and sometimes physical abuse. They have even withheld my medications because I &amp;quot;disrespected&amp;quot; them. My abusive parents swept it under the rug and have done the following: &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Told me that I was distracted driving which is what caused the accident&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Refused to show me the citation&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Refused to let me communicate with the insurance company&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Lied and told me there is no court hearing and that I was not allowed to go to the local court&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Took my license and told me they will do the traffic school with my information&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Refused to take me to see a general doctor for a follow-up even after I listed out my symptoms of confusion, memory problems, chronic headaches and nausea. I have been struggling extremely badly the past 2 weeks in school.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I went to the hospital last night by taking an Uber because I was scared that my injuries were getting worse as I would even get lost taking a walk in my neighborhood; I spoke to a social worker and police officers about everything that has happened so far. An additional police report was made at the hospital, and my parents took my wallet to take the police officer&amp;#39;s card and the written case number away from me. My mother has stated things that point to them intentionally drugging me and handing me the keys next day to crash their car for a payout on their car. I have broken the issue down to three parts that I am seeking answers to.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1 - Citation &amp;amp; Court Information&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I was made aware that an extension was filed on my behalf for the hearing and is set for May 26th. My parents pretend it does not exist or just adamantly refuse to let me even go to the court to request information. They threatened to kick me out if I ask about it any further. They insist that traffic school is the only option. What can I do to stop them from pretending to be me to do the traffic school? Can I seek out a lawyer even against my parents&amp;#39; consent? I plan to attend the court hearing and produce proof that I was drugged and I have reported the crime to the CPS hotline. How do I obtain my medical records which may have the doctor&amp;#39;s notes that I was given the medications when it requires parental signature? Can I still go to court even if they do the traffic school without my permission? I have proof of me explicitly not giving consent for them to do it in my name and proof that they are refusing to let me go to court or just giving general excuses saying there is no hearing date.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2 - Insurance Liability&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Is this accident considered my fault as I was not aware that I was drugged by my mother the night before? How do I prepare a proper statement to the insurance company so I don&amp;#39;t get taken advantage of? Can I report my parents for insurance fraud? I am afraid that the accident will ruin me financially for years...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3 – Safety&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;What else can I do to ensure my safety? I called the cps hotline a few days ago but I still haven&amp;#39;t heard anything back. My parents disabled my phone and also took away almost everything for me to communicate to friends or make phone calls. I am fearful of retaliation and just want to make sure that my own future is not destroyed due to this. Please provide me with any insight you may have. Thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The following post is written and edited by a close friend of the victim who is a minor. Location: Arizona.\n\nOn March 30th, I was involved in a car accident where I rear-ended someone, and received a citation. I had a serious concussion, swollen thumbs, and a cut from the seatbelt. My parents took me eventually to the ER after the urgent care said the injuries are too serious. At the ER visit, my mother told the doctor that she gave me trazodone the night before without my knowledge which I have expressed to the doctor. I have never seen, heard, nor been prescribed the medication in my life. My parents have a long past history of verbal, emotional, and sometimes physical abuse. They have even withheld my medications because I \"disrespected\" them. My abusive parents swept it under the rug and have done the following: \n\n- Told me that I was distracted driving which is what caused the accident\n\n- Refused to show me the citation\n\n- Refused to let me communicate with the insurance company\n\n- Lied and told me there is no court hearing and that I was not allowed to go to the local court\n\n- Took my license and told me they will do the traffic school with my information\n\n- Refused to take me to see a general doctor for a follow-up even after I listed out my symptoms of confusion, memory problems, chronic headaches and nausea. I have been struggling extremely badly the past 2 weeks in school.\n\nI went to the hospital last night by taking an Uber because I was scared that my injuries were getting worse as I would even get lost taking a walk in my neighborhood; I spoke to a social worker and police officers about everything that has happened so far. An additional police report was made at the hospital, and my parents took my wallet to take the police officer's card and the written case number away from me. My mother has stated things that point to them intentionally drugging me and handing me the keys next day to crash their car for a payout on their car. I have broken the issue down to three parts that I am seeking answers to.\n\n**1 - Citation &amp; Court Information**\n\nI was made aware that an extension was filed on my behalf for the hearing and is set for May 26th. My parents pretend it does not exist or just adamantly refuse to let me even go to the court to request information. They threatened to kick me out if I ask about it any further. They insist that traffic school is the only option. What can I do to stop them from pretending to be me to do the traffic school? Can I seek out a lawyer even against my parents' consent? I plan to attend the court hearing and produce proof that I was drugged and I have reported the crime to the CPS hotline. How do I obtain my medical records which may have the doctor's notes that I was given the medications when it requires parental signature? Can I still go to court even if they do the traffic school without my permission? I have proof of me explicitly not giving consent for them to do it in my name and proof that they are refusing to let me go to court or just giving general excuses saying there is no hearing date.\n\n**2 - Insurance Liability**\n\nIs this accident considered my fault as I was not aware that I was drugged by my mother the night before? How do I prepare a proper statement to the insurance company so I don't get taken advantage of? Can I report my parents for insurance fraud? I am afraid that the accident will ruin me financially for years...\n\n**3 – Safety**\n\nWhat else can I do to ensure my safety? I called the cps hotline a few days ago but I still haven't heard anything back. My parents disabled my phone and also took away almost everything for me to communicate to friends or make phone calls. I am fearful of retaliation and just want to make sure that my own future is not destroyed due to this. Please provide me with any insight you may have. Thank you.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6524ee", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 332, "report_reasons": null, "author": "druggedbymother", "saved": false, "mod_reports": [], "name": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "approved_by": null, "over_18": false, "domain": "self.legaladvice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rawz", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/legaladvice/comments/6524ee/az_i_was_drugged_by_abusive_mother_and_given_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492071493.0, "url": "https://www.reddit.com/r/legaladvice/comments/6524ee/az_i_was_drugged_by_abusive_mother_and_given_the/", "author_flair_text": null, "quarantine": false, "title": "[AZ] I was drugged by abusive mother and given the keys to drive her car the next day and got in a car wreck which she may have planned. My parents are denying me further healthcare and any information in an attempt to blame me for the accident. Please help!", "created_utc": 1492042693.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 97, "visited": false, "subreddit_type": "public", "ups": 332}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg81tc5", "gilded": 0, "archived": false, "score": 71, "report_reasons": null, "author": "cosmicsans", "parent_id": "t1_dg6xlw3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Shit, I'm an EMT in NY and I almost feel like reading this online makes me have to call it in, it's that bad.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shit, I&amp;#39;m an EMT in NY and I almost feel like reading this online makes me have to call it in, it&amp;#39;s that bad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg81tc5", "score_hidden": false, "stickied": false, "created": 1492139334.0, "created_utc": 1492110534.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 71}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xlw3", "gilded": 0, "archived": false, "score": 252, "report_reasons": null, "author": "LegallyBlonde001", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Find an adult at your school you trust, a teacher or guidance counselor. Tell them what is happening. They are mandated reporters and will have to call CPS. I know you already called, but you want as many reports as possible on record. \nIf you don't feel safe in your home, tell someone. Find a friend to stay with. Don't be somewhere you think your life is in danger. \n\nI'm not a lawyer, I'm still in law school. I used to work in a crisis center and dealt with child abuse situations almost daily. I've dealt with CPS too many times. I've seen these situations get bad and if you are being drugged, it seems like it's bad. Please be careful. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Find an adult at your school you trust, a teacher or guidance counselor. Tell them what is happening. They are mandated reporters and will have to call CPS. I know you already called, but you want as many reports as possible on record. \nIf you don&amp;#39;t feel safe in your home, tell someone. Find a friend to stay with. Don&amp;#39;t be somewhere you think your life is in danger. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a lawyer, I&amp;#39;m still in law school. I used to work in a crisis center and dealt with child abuse situations almost daily. I&amp;#39;ve dealt with CPS too many times. I&amp;#39;ve seen these situations get bad and if you are being drugged, it seems like it&amp;#39;s bad. Please be careful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6xlw3", "score_hidden": false, "stickied": false, "created": 1492076265.0, "created_utc": 1492047465.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 252}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg87vda", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "sirsius", "parent_id": "t1_dg85dmp", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "For sure dude, you can't do anything if you don't know you're taking them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For sure dude, you can&amp;#39;t do anything if you don&amp;#39;t know you&amp;#39;re taking them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg87vda", "score_hidden": false, "stickied": false, "created": 1492146016.0, "created_utc": 1492117216.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg85dmp", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Osric250", "parent_id": "t1_dg83geq", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "True, I apologize for generalizing. What I have always been told with those drugs is when that happens to stop taking them and consult my doctor immediately, who will then work with me to find the best course of action, which could include continuing to take them.\n\nObviously there might be some drugs that you don't want to stop taking cold turkey, but with situations like that consulting your doctor whenever there are serious side effects is always at the forefront of steps, and the patient needs to know to do that and not simply ignore the side effects.\n\nIf a patient doesn't even know they are on medication then they can't very well let a doctor know when a medication is screwing with their system.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True, I apologize for generalizing. What I have always been told with those drugs is when that happens to stop taking them and consult my doctor immediately, who will then work with me to find the best course of action, which could include continuing to take them.&lt;/p&gt;\n\n&lt;p&gt;Obviously there might be some drugs that you don&amp;#39;t want to stop taking cold turkey, but with situations like that consulting your doctor whenever there are serious side effects is always at the forefront of steps, and the patient needs to know to do that and not simply ignore the side effects.&lt;/p&gt;\n\n&lt;p&gt;If a patient doesn&amp;#39;t even know they are on medication then they can&amp;#39;t very well let a doctor know when a medication is screwing with their system.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg85dmp", "score_hidden": false, "stickied": false, "created": 1492143218.0, "created_utc": 1492114418.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8bqbi", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "KnightWhoSaysNi1", "parent_id": "t1_dg83geq", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Yes indeed. The psychiatrists I've seen have all been adamant about me not stopping my bipolar medication without consulting them first. Manic or depressive episodes are not fun.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes indeed. The psychiatrists I&amp;#39;ve seen have all been adamant about me not stopping my bipolar medication without consulting them first. Manic or depressive episodes are not fun.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8bqbi", "score_hidden": false, "stickied": false, "created": 1492150813.0, "created_utc": 1492122013.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83geq", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "sirsius", "parent_id": "t1_dg7xmtv", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Hold up.\n\nLetting someone know is great advice. Ideally the prescriber and their physician. \n\nHowever a blanket stop taking them is terrible advice.\n\nPsychiatric drugs have weird effects on brain chemistry and different effects on different people. Additionally the majority of them work once a certain concentration is reached in the body but the dosages have to be slowly ramped up to keep the body and the brain from freaking out. Depending on the drug and aggressiveness of dosing used by a prescriber this dosage can be reached in a week or two, but a proper assessment of the drugs effects can commonly take a  month or more. During this period reactions and side effects can both crop up AND disappear. None of these drugs is perfect, a careful balance has to be struck between its benefits and what are to be deemed tolerable side effects. \n\nUnfortunately the reverse is also true. If there are any unwanted reactions and side effects these drugs may also require a gradual reduction in doasge to keep the body from freaking out. A cold turkey approach can cause all sorts of issues, some of which can be worse than any effects you are trying to avoid. A personalized assessment and medical supervision is required on a case by case basis for this category of drug. \n\nSuicidal ideation can be dealt with and controlled. It may disappear in a week. A sudden seizure while you're doing a 100 on the highway or while chopping vegetables is significantly more difficult to deal with. Especially if the only warning you get is that you stopped taking a pill a week ago. \n\nAny psychiatrist worth his salt knows all of this and takes it into account when prescribing. The directions given should be along the lines of \"We're gonna try X. If you experience any side effects please let me know immediately and then we'll re-assess and go from there, but please follow your dosing schedule until I indicate otherwise.\"\n\nTL;DR\nPsychiatric drugs are medical equivalent of 'It's too nuanced to comment, what does your lawyer say'", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hold up.&lt;/p&gt;\n\n&lt;p&gt;Letting someone know is great advice. Ideally the prescriber and their physician. &lt;/p&gt;\n\n&lt;p&gt;However a blanket stop taking them is terrible advice.&lt;/p&gt;\n\n&lt;p&gt;Psychiatric drugs have weird effects on brain chemistry and different effects on different people. Additionally the majority of them work once a certain concentration is reached in the body but the dosages have to be slowly ramped up to keep the body and the brain from freaking out. Depending on the drug and aggressiveness of dosing used by a prescriber this dosage can be reached in a week or two, but a proper assessment of the drugs effects can commonly take a  month or more. During this period reactions and side effects can both crop up AND disappear. None of these drugs is perfect, a careful balance has to be struck between its benefits and what are to be deemed tolerable side effects. &lt;/p&gt;\n\n&lt;p&gt;Unfortunately the reverse is also true. If there are any unwanted reactions and side effects these drugs may also require a gradual reduction in doasge to keep the body from freaking out. A cold turkey approach can cause all sorts of issues, some of which can be worse than any effects you are trying to avoid. A personalized assessment and medical supervision is required on a case by case basis for this category of drug. &lt;/p&gt;\n\n&lt;p&gt;Suicidal ideation can be dealt with and controlled. It may disappear in a week. A sudden seizure while you&amp;#39;re doing a 100 on the highway or while chopping vegetables is significantly more difficult to deal with. Especially if the only warning you get is that you stopped taking a pill a week ago. &lt;/p&gt;\n\n&lt;p&gt;Any psychiatrist worth his salt knows all of this and takes it into account when prescribing. The directions given should be along the lines of &amp;quot;We&amp;#39;re gonna try X. If you experience any side effects please let me know immediately and then we&amp;#39;ll re-assess and go from there, but please follow your dosing schedule until I indicate otherwise.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;TL;DR\nPsychiatric drugs are medical equivalent of &amp;#39;It&amp;#39;s too nuanced to comment, what does your lawyer say&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg83geq", "score_hidden": false, "stickied": false, "created": 1492141113.0, "created_utc": 1492112313.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8enmp", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "justinistheory", "parent_id": "t1_dg88n1x", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "That's actually not as common as TV/movies make you believe.\n\nSource: Sold life insurance for a brief period of time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s actually not as common as TV/movies make you believe.&lt;/p&gt;\n\n&lt;p&gt;Source: Sold life insurance for a brief period of time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8enmp", "score_hidden": false, "stickied": false, "created": 1492154699.0, "created_utc": 1492125899.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8j5l0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "deedeethecat", "parent_id": "t1_dg88n1x", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Life insurance I looked into 15 years ago said that it would pay out for suicide, provided it was a year after the coverage started", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Life insurance I looked into 15 years ago said that it would pay out for suicide, provided it was a year after the coverage started&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8j5l0", "score_hidden": false, "stickied": false, "created": 1492160820.0, "created_utc": 1492132020.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg88n1x", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "blackbirdsongs", "parent_id": "t1_dg84zc9", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Don't many policies have a clause that says they don't pay out if the person kills themself?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t many policies have a clause that says they don&amp;#39;t pay out if the person kills themself?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg88n1x", "score_hidden": false, "stickied": false, "created": 1492146933.0, "created_utc": 1492118133.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dgbcvve", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hippo-Crates", "parent_id": "t1_dg84zc9", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "What if mom's intention is to treat someone who is severely mentally ill, and you're completely buying the story from the person who is severely mentally ill?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if mom&amp;#39;s intention is to treat someone who is severely mentally ill, and you&amp;#39;re completely buying the story from the person who is severely mentally ill?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgbcvve", "score_hidden": false, "stickied": false, "created": 1492328486.0, "created_utc": 1492299686.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84zc9", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "LinZ14", "parent_id": "t1_dg7xmtv", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Holy shit, here's a scary thought. What if mom's *intention* is to initiate suicidal ideation hoping her daughter carries it out for some type of life insurance payout? I desperately hope this is not the case, but if they are willing to risk her life for a car insurance claim, who knows what level of revulsion they would stoop to. ", "edited": 1492116334.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit, here&amp;#39;s a scary thought. What if mom&amp;#39;s &lt;em&gt;intention&lt;/em&gt; is to initiate suicidal ideation hoping her daughter carries it out for some type of life insurance payout? I desperately hope this is not the case, but if they are willing to risk her life for a car insurance claim, who knows what level of revulsion they would stoop to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg84zc9", "score_hidden": false, "stickied": false, "created": 1492142777.0, "created_utc": 1492113977.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xmtv", "gilded": 0, "archived": false, "score": 57, "report_reasons": null, "author": "Osric250", "parent_id": "t1_dg7m4lk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Psychoactive drugs always have the possibility of side effects causing suicidal ideation. No psychiatrist would ever prescribe it to anyone without them being aware that if they get these thoughts they need to ~~stop taking it and~~ let someone know and they can work out a course of action with their doctor.\n\nEdited to more properly frame the course of action to take.", "edited": 1492116988.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Psychoactive drugs always have the possibility of side effects causing suicidal ideation. No psychiatrist would ever prescribe it to anyone without them being aware that if they get these thoughts they need to &lt;del&gt;stop taking it and&lt;/del&gt; let someone know and they can work out a course of action with their doctor.&lt;/p&gt;\n\n&lt;p&gt;Edited to more properly frame the course of action to take.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7xmtv", "score_hidden": false, "stickied": false, "created": 1492134855.0, "created_utc": 1492106055.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 57}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7m4lk", "gilded": 0, "archived": false, "score": 98, "report_reasons": null, "author": "BullsLawDan", "parent_id": "t1_dg7lctz", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "The person is 16 or 17. I doubt any doctor would prescribe a psychoactive drug to a person that age without their full knowledge and consent. \n\nThere's a grey area at that age as to whose wishes would ultimately *control* if parent and child disagree on treatment, but there's no way a doctor would go forward without the child at least having *knowledge.* I mean, my kid's pediatrician speaks to him frankly about his care and he's 12.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The person is 16 or 17. I doubt any doctor would prescribe a psychoactive drug to a person that age without their full knowledge and consent. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a grey area at that age as to whose wishes would ultimately &lt;em&gt;control&lt;/em&gt; if parent and child disagree on treatment, but there&amp;#39;s no way a doctor would go forward without the child at least having &lt;em&gt;knowledge.&lt;/em&gt; I mean, my kid&amp;#39;s pediatrician speaks to him frankly about his care and he&amp;#39;s 12.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7m4lk", "score_hidden": false, "stickied": false, "created": 1492122425.0, "created_utc": 1492093625.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 98}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7sqi0", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "derspiny", "parent_id": "t1_dg7lctz", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "It's the lack of knowledge that's concerning. I can't think of many reasons OP's friend's parents _and doctor_ would arrange for her to be prescribed a fairly powerful sedative and antidepressant, to be administered secretly, when she's old enough to drive and capable enough to get a license. There would be serious questions of medical ethics, as well as of child abuse, with that scenario, and involving outside professionals would still be a good first step.\n\nCombined with her statements that her parents have withheld her actual medications from her when they were upset with her, it seems more likely that the medication was not prescribed.\n\nHonestly, we'll never know for sure. We're not there. However, there's generally little to no harm in stating facts to the police or to CPS: if OP's friend really was prescribed this weird-ass regimen, CPS can find that out from her parents.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s the lack of knowledge that&amp;#39;s concerning. I can&amp;#39;t think of many reasons OP&amp;#39;s friend&amp;#39;s parents &lt;em&gt;and doctor&lt;/em&gt; would arrange for her to be prescribed a fairly powerful sedative and antidepressant, to be administered secretly, when she&amp;#39;s old enough to drive and capable enough to get a license. There would be serious questions of medical ethics, as well as of child abuse, with that scenario, and involving outside professionals would still be a good first step.&lt;/p&gt;\n\n&lt;p&gt;Combined with her statements that her parents have withheld her actual medications from her when they were upset with her, it seems more likely that the medication was not prescribed.&lt;/p&gt;\n\n&lt;p&gt;Honestly, we&amp;#39;ll never know for sure. We&amp;#39;re not there. However, there&amp;#39;s generally little to no harm in stating facts to the police or to CPS: if OP&amp;#39;s friend really was prescribed this weird-ass regimen, CPS can find that out from her parents.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7sqi0", "score_hidden": false, "stickied": false, "created": 1492129637.0, "created_utc": 1492100837.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg89z8j", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "The_Black_Scorpion", "parent_id": "t1_dg7lctz", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt;I have never seen, heard, nor been prescribed the medication in my life.  \n\nFrom the first paragraph.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have never seen, heard, nor been prescribed the medication in my life.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;From the first paragraph.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg89z8j", "score_hidden": false, "stickied": false, "created": 1492148573.0, "created_utc": 1492119773.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7lctz", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "zumatech", "parent_id": "t1_dg6u1xf", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Since OP is a minor, it's possible that s/he was prescribed the medication. Are minor children ever given psychiatric drugs with only parental consent? If this is true, would this change your thinking?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since OP is a minor, it&amp;#39;s possible that s/he was prescribed the medication. Are minor children ever given psychiatric drugs with only parental consent? If this is true, would this change your thinking?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7lctz", "score_hidden": false, "stickied": false, "created": 1492121511.0, "created_utc": 1492092711.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 46}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8bijb", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "chocolate_mussolini", "parent_id": "t1_dg6u1xf", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Trazodone is a potentially dangerous drug that has a lot of interactions. I was on it for less than a week and it ended with me fainting and my huge head leaving a big dent in the wall my head hit. \n\nThe fact that they'd give it to you without your knowledge is appalling. I am so sorry for what you're going through.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trazodone is a potentially dangerous drug that has a lot of interactions. I was on it for less than a week and it ended with me fainting and my huge head leaving a big dent in the wall my head hit. &lt;/p&gt;\n\n&lt;p&gt;The fact that they&amp;#39;d give it to you without your knowledge is appalling. I am so sorry for what you&amp;#39;re going through.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8bijb", "score_hidden": false, "stickied": false, "created": 1492150524.0, "created_utc": 1492121724.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8ex7a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "myownfunusername", "parent_id": "t1_dg89kxb", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "First sentence....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First sentence....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8ex7a", "score_hidden": false, "stickied": false, "created": 1492155054.0, "created_utc": 1492126254.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg89kxb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6u1xf", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg89kxb", "score_hidden": false, "stickied": false, "created": 1492148078.0, "created_utc": 1492119278.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7omjp", "gilded": 0, "archived": false, "score": -19, "report_reasons": null, "author": "HEONTHETOILET", "parent_id": "t1_dg7og6l", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I don't know those exact numbers so I can't comment on it. The point was that if OP really can't stand her parents and if they are truly out poisoning her/cutting her brake lines/whatever else it is she thinks they do, then she would find a way to make it happen. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know those exact numbers so I can&amp;#39;t comment on it. The point was that if OP really can&amp;#39;t stand her parents and if they are truly out poisoning her/cutting her brake lines/whatever else it is she thinks they do, then she would find a way to make it happen. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7omjp", "score_hidden": false, "stickied": false, "created": 1492125258.0, "created_utc": 1492096458.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": -19}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7og6l", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "TzarKazm", "parent_id": "t1_dg7mh6a", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "How many minors are financially self sufficient though? 1%? Maybe less? Because of that, there isn't a lot of \"looking into \" to be done. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How many minors are financially self sufficient though? 1%? Maybe less? Because of that, there isn&amp;#39;t a lot of &amp;quot;looking into &amp;quot; to be done. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7og6l", "score_hidden": false, "stickied": false, "created": 1492125064.0, "created_utc": 1492096264.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg815p1", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "FirstWaveMasculinist", "parent_id": "t1_dg7mh6a", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt;based on what? OPs word? \n\nyeah? duh? The car accident happening isnt even a presented fact because all we have to prove it happened is... You guessed it, OP's word. If you're assuming shes lying about the abuse then who's to say she isnt lying about the car accident? About it being a friend's sitiation instead of just some made up story theyre testing out on reddit before putting into their novel? \n\nThis whole subs premise is \"people explain their situation and ask for advice on how to move forward\". It all falls apart when you start assuming everyone is lying, without any evidence beyond \"teenagers lie all the time\". Abusive parents exist. It's a big ass world out there. Reddit is a very popular site. It's absolutely not impossible for an abused teen to be drugged by her abusive parents somewhere in the world, and then tell her friend who decides to post to legaladvice on her behalf. \n\nOP's word is all we have to go on for 99.99% of the posts on this sub. The other .01% is from times when theres a news article involved, but usually that involves doxxing and is frowned upon. or i guess megathreads where uninvolved randos ask about what United will do. But If you want to participate in this sub then you gotta assume good faith when OP isnt contradicting themself or something like that. Theres nothing inherently unbelievable about abusive parents. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;based on what? OPs word? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;yeah? duh? The car accident happening isnt even a presented fact because all we have to prove it happened is... You guessed it, OP&amp;#39;s word. If you&amp;#39;re assuming shes lying about the abuse then who&amp;#39;s to say she isnt lying about the car accident? About it being a friend&amp;#39;s sitiation instead of just some made up story theyre testing out on reddit before putting into their novel? &lt;/p&gt;\n\n&lt;p&gt;This whole subs premise is &amp;quot;people explain their situation and ask for advice on how to move forward&amp;quot;. It all falls apart when you start assuming everyone is lying, without any evidence beyond &amp;quot;teenagers lie all the time&amp;quot;. Abusive parents exist. It&amp;#39;s a big ass world out there. Reddit is a very popular site. It&amp;#39;s absolutely not impossible for an abused teen to be drugged by her abusive parents somewhere in the world, and then tell her friend who decides to post to legaladvice on her behalf. &lt;/p&gt;\n\n&lt;p&gt;OP&amp;#39;s word is all we have to go on for 99.99% of the posts on this sub. The other .01% is from times when theres a news article involved, but usually that involves doxxing and is frowned upon. or i guess megathreads where uninvolved randos ask about what United will do. But If you want to participate in this sub then you gotta assume good faith when OP isnt contradicting themself or something like that. Theres nothing inherently unbelievable about abusive parents. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg815p1", "score_hidden": false, "stickied": false, "created": 1492138611.0, "created_utc": 1492109811.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7mh6a", "gilded": 0, "archived": false, "score": -33, "report_reasons": null, "author": "HEONTHETOILET", "parent_id": "t1_dg7m7lu", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; assuming that someone is full of shit when it comes to a situation where it's not blatant\n\nCompletely subjective. \n\n&gt; In any case, the OP is about a drugging, a car accident and a history of measured abuse.\n\nBased on what? OP's word? Ok. Realistically the only facts presented are that a car accident happened.\n\n&gt; to label it exaggerated when you can't back it up is a stupid move\n\nAnd leveling these types of accusations against OPs parents without anything backing it up isn't stupid? Got it. \n\nedit:\n\n&gt; Simply saying she should be emancipated doesn't address the first two issues, is poor advice for the last issue (I'm pretty sure you need approval from the parents themselves for this)\n\nI didn't say she should be emancipated. I said she should look into it:\n\n&gt; On August 12, 2005, an Arizona law went into effect that permits minors who are at least 16 but not yet 18, to apply to be emancipated or to be declared legally an adult. The minor must prove they are financially self-sufficient and able to provide their own food, housing and medical care without parental assistance.\n", "edited": 1492095799.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;assuming that someone is full of shit when it comes to a situation where it&amp;#39;s not blatant&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Completely subjective. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In any case, the OP is about a drugging, a car accident and a history of measured abuse.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Based on what? OP&amp;#39;s word? Ok. Realistically the only facts presented are that a car accident happened.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;to label it exaggerated when you can&amp;#39;t back it up is a stupid move&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And leveling these types of accusations against OPs parents without anything backing it up isn&amp;#39;t stupid? Got it. &lt;/p&gt;\n\n&lt;p&gt;edit:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Simply saying she should be emancipated doesn&amp;#39;t address the first two issues, is poor advice for the last issue (I&amp;#39;m pretty sure you need approval from the parents themselves for this)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I didn&amp;#39;t say she should be emancipated. I said she should look into it:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;On August 12, 2005, an Arizona law went into effect that permits minors who are at least 16 but not yet 18, to apply to be emancipated or to be declared legally an adult. The minor must prove they are financially self-sufficient and able to provide their own food, housing and medical care without parental assistance.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7mh6a", "score_hidden": false, "stickied": false, "created": 1492122840.0, "created_utc": 1492094040.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -33}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7m7lu", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "LunarGolbez", "parent_id": "t1_dg7jf04", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I've just been lurking around here and from what I understand is that the point of this sub is to give legal advice according to the situation presented. It is not a place to judge stories, so assuming that someone is full of shit when it comes to a situation where it's not blatant is not something you get to do with out being criticized for it. The point is to provide legal advice, not to give judgment.\n\nIn any case, the OP is about a drugging, a car accident and a history of measured abuse. None of these are off the wall situations. These are common things to happen, so to label it exaggerated when you can't back it up is a stupid move.\n\nThe person needs advice on how to proceed to treat her injuries, to deal with the legal matters of the accident, and possibly to deal with the situation they are in with their parents.\n\nSimply saying she should be emancipated doesn't address the first two issues, is poor advice for the last issue (I'm pretty sure you need approval from the parents themselves for this) and probably hurts their chances on getting the first two solved feasibly.\n\nSo you deserve every downvote you're getting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve just been lurking around here and from what I understand is that the point of this sub is to give legal advice according to the situation presented. It is not a place to judge stories, so assuming that someone is full of shit when it comes to a situation where it&amp;#39;s not blatant is not something you get to do with out being criticized for it. The point is to provide legal advice, not to give judgment.&lt;/p&gt;\n\n&lt;p&gt;In any case, the OP is about a drugging, a car accident and a history of measured abuse. None of these are off the wall situations. These are common things to happen, so to label it exaggerated when you can&amp;#39;t back it up is a stupid move.&lt;/p&gt;\n\n&lt;p&gt;The person needs advice on how to proceed to treat her injuries, to deal with the legal matters of the accident, and possibly to deal with the situation they are in with their parents.&lt;/p&gt;\n\n&lt;p&gt;Simply saying she should be emancipated doesn&amp;#39;t address the first two issues, is poor advice for the last issue (I&amp;#39;m pretty sure you need approval from the parents themselves for this) and probably hurts their chances on getting the first two solved feasibly.&lt;/p&gt;\n\n&lt;p&gt;So you deserve every downvote you&amp;#39;re getting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7m7lu", "score_hidden": false, "stickied": false, "created": 1492122522.0, "created_utc": 1492093722.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7n834", "gilded": 0, "archived": false, "score": -15, "report_reasons": null, "author": "HEONTHETOILET", "parent_id": "t1_dg7m6wr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I didn't say she should be emancipated. I said she should look into it if it's really \"that bad\", which I doubt it is. I don't know what Arizona's application for emancipation looks like, nor do I know OPs full situation (nobody else does, either) so I can't comment on whether she would qualify for it or not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t say she should be emancipated. I said she should look into it if it&amp;#39;s really &amp;quot;that bad&amp;quot;, which I doubt it is. I don&amp;#39;t know what Arizona&amp;#39;s application for emancipation looks like, nor do I know OPs full situation (nobody else does, either) so I can&amp;#39;t comment on whether she would qualify for it or not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7n834", "score_hidden": false, "stickied": false, "created": 1492123700.0, "created_utc": 1492094900.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7m6wr", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "BullsLawDan", "parent_id": "t1_dg7jf04", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "The downvoters are because OP, like every other teen who posts here about the topic, would not qualify for emancipation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The downvoters are because OP, like every other teen who posts here about the topic, would not qualify for emancipation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7m6wr", "score_hidden": false, "stickied": false, "created": 1492122500.0, "created_utc": 1492093700.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg83ksm", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Rambosherbet", "parent_id": "t1_dg7jf04", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Here's another way of thinking about this. You (and everyone else here) have nothing to lose by believing the story as it's told and basing your advice off that. On the other hand, if the story being told is true, OP has a great deal to lose if she doesn't get the advice she needs. You can walk away and forget about this thread but it could be vitally important to her. So don't be surprised if people aren't appreciative of your condescending skepticism.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s another way of thinking about this. You (and everyone else here) have nothing to lose by believing the story as it&amp;#39;s told and basing your advice off that. On the other hand, if the story being told is true, OP has a great deal to lose if she doesn&amp;#39;t get the advice she needs. You can walk away and forget about this thread but it could be vitally important to her. So don&amp;#39;t be surprised if people aren&amp;#39;t appreciative of your condescending skepticism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg83ksm", "score_hidden": false, "stickied": false, "created": 1492141246.0, "created_utc": 1492112446.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jf04", "gilded": 0, "archived": false, "score": -40, "report_reasons": null, "author": "HEONTHETOILET", "parent_id": "t1_dg7igk8", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "This. If OP hates her parents so much she needs to look into emancipation. \n\nedit: Not sure what's up with the downvotes? You have a 16 year old minor who is leveling serious accusations against their parents, creating a narrative which paints them out to be some sort of evil monsters. Has anyone known any 16 year old who didn't embellish events, didn't exaggerate, and wasn't self-centered to some degree? Come on people - just because someone posts something here doesn't automatically preclude them from being completely full of shit. ", "edited": 1492091997.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. If OP hates her parents so much she needs to look into emancipation. &lt;/p&gt;\n\n&lt;p&gt;edit: Not sure what&amp;#39;s up with the downvotes? You have a 16 year old minor who is leveling serious accusations against their parents, creating a narrative which paints them out to be some sort of evil monsters. Has anyone known any 16 year old who didn&amp;#39;t embellish events, didn&amp;#39;t exaggerate, and wasn&amp;#39;t self-centered to some degree? Come on people - just because someone posts something here doesn&amp;#39;t automatically preclude them from being completely full of shit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7jf04", "score_hidden": false, "stickied": false, "created": 1492119003.0, "created_utc": 1492090203.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -40}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7igk8", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6u1xf", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 1, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7igk8", "score_hidden": false, "stickied": false, "created": 1492117648.0, "created_utc": 1492088848.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7hoc4", "gilded": 0, "archived": false, "score": 84, "report_reasons": null, "author": "Gas_monkey", "parent_id": "t1_dg7gbm3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; I don't believe Trazadone is either psychoactive or a poison\n\n&gt; I take it as an antidepressant\n\nI don't think you understand what the word 'psychoactive' means. \n\nIf a drug alters your mood, thoughts, or level of consciousness, then it is psychoactive. \n\nRegardless, your experience adds no value to interpreting the OP's situation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t believe Trazadone is either psychoactive or a poison&lt;/p&gt;\n\n&lt;p&gt;I take it as an antidepressant&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think you understand what the word &amp;#39;psychoactive&amp;#39; means. &lt;/p&gt;\n\n&lt;p&gt;If a drug alters your mood, thoughts, or level of consciousness, then it is psychoactive. &lt;/p&gt;\n\n&lt;p&gt;Regardless, your experience adds no value to interpreting the OP&amp;#39;s situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7hoc4", "score_hidden": false, "stickied": false, "created": 1492116454.0, "created_utc": 1492087654.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 84}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7simr", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "immortalbeloved_des", "parent_id": "t1_dg7hg37", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "We had a co-worker no-show to work one morning. Punctual always, and in her role at an animal clinic, the show didn't go on without her leading the day. Tried calling all day, we're beyond worried and getting ready to head to her house and then the phone rang. She had *just* then woken up. It was her first time taking Trazadone. They told her to take 2/3, she did and didn't feel anything, so popped the other 1/3. Overslept by 10 hours. It's some seriously stong stuff if you're not used to it. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We had a co-worker no-show to work one morning. Punctual always, and in her role at an animal clinic, the show didn&amp;#39;t go on without her leading the day. Tried calling all day, we&amp;#39;re beyond worried and getting ready to head to her house and then the phone rang. She had &lt;em&gt;just&lt;/em&gt; then woken up. It was her first time taking Trazadone. They told her to take 2/3, she did and didn&amp;#39;t feel anything, so popped the other 1/3. Overslept by 10 hours. It&amp;#39;s some seriously stong stuff if you&amp;#39;re not used to it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7simr", "score_hidden": false, "stickied": false, "created": 1492129409.0, "created_utc": 1492100609.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7t6sy", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "dorothy_zbornak_esq", "parent_id": "t1_dg7hg37", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "My doctor prescribed it to me as a sleep aid. I have a very low dose and still need to halve it otherwise I'm groggy all morning after taking it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My doctor prescribed it to me as a sleep aid. I have a very low dose and still need to halve it otherwise I&amp;#39;m groggy all morning after taking it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7t6sy", "score_hidden": false, "stickied": false, "created": 1492130127.0, "created_utc": 1492101327.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg86dxb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "163511942", "parent_id": "t1_dg7hg37", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I was briefly on trazodone as an anti-anxiety measure. It helped, but during the initial adjustment period it made me very confused all the time, for about a week. It was like I just forgot how to think. That tapered off, but even a relatively small dose like mine was (50mg before bed) can really do a number on you if you're not used to it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was briefly on trazodone as an anti-anxiety measure. It helped, but during the initial adjustment period it made me very confused all the time, for about a week. It was like I just forgot how to think. That tapered off, but even a relatively small dose like mine was (50mg before bed) can really do a number on you if you&amp;#39;re not used to it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg86dxb", "score_hidden": false, "stickied": false, "created": 1492144327.0, "created_utc": 1492115527.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7rvdf", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Bittersweetfeline", "parent_id": "t1_dg7hg37", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "It really depends on what dose.  I take it nightly and I'm more than fine to drive to work the next day, zero grogginess.   I really don't feel it is up to us one way or another to determine if her dose is responsible for the accident, or if it is a clever scapegoat.   A doctor and some blood work would be more appropriate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It really depends on what dose.  I take it nightly and I&amp;#39;m more than fine to drive to work the next day, zero grogginess.   I really don&amp;#39;t feel it is up to us one way or another to determine if her dose is responsible for the accident, or if it is a clever scapegoat.   A doctor and some blood work would be more appropriate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7rvdf", "score_hidden": false, "stickied": false, "created": 1492128727.0, "created_utc": 1492099927.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7hg37", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "GraphicDesignMonkey", "parent_id": "t1_dg7gbm3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I'm on trazodone, it's not just an antidepressant, it's also an anti-anxiety pill with a sedative effect. That stuff can make you seriously groggy the next day if it hits your system and you've never had it / not used to it. When I was first prescribed it, I was like a groggy confused zombie for weeks - I struggled to stay awake, I was confused, and had memory problems.  I take one pill before bed, and it knocks me out completely. Even after 3 years, I still need insanely strong coffee in the mornings to wake up, and I sleep in for work at least twice a month.\n\nTrazodone is strong stuff, and it can seriously impair you for 12-24 hours if someone doses you with it.", "edited": 1492090650.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m on trazodone, it&amp;#39;s not just an antidepressant, it&amp;#39;s also an anti-anxiety pill with a sedative effect. That stuff can make you seriously groggy the next day if it hits your system and you&amp;#39;ve never had it / not used to it. When I was first prescribed it, I was like a groggy confused zombie for weeks - I struggled to stay awake, I was confused, and had memory problems.  I take one pill before bed, and it knocks me out completely. Even after 3 years, I still need insanely strong coffee in the mornings to wake up, and I sleep in for work at least twice a month.&lt;/p&gt;\n\n&lt;p&gt;Trazodone is strong stuff, and it can seriously impair you for 12-24 hours if someone doses you with it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7hg37", "score_hidden": false, "stickied": false, "created": 1492116088.0, "created_utc": 1492087288.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 55}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7gk3j", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "Arielyssa", "parent_id": "t1_dg7gbm3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Giving someone a drug. Any drug. Especially a mind-altering drug, without that person's knowledge or consent is poisoning. OP could have an allergic reaction or it could conflict with other medications OP is prescribed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Giving someone a drug. Any drug. Especially a mind-altering drug, without that person&amp;#39;s knowledge or consent is poisoning. OP could have an allergic reaction or it could conflict with other medications OP is prescribed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7gk3j", "score_hidden": false, "stickied": false, "created": 1492114569.0, "created_utc": 1492085769.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 46}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7jy0v", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "GraphicDesignMonkey", "parent_id": "t1_dg7ghdc", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "When my doc gave me this she said I should be medically exempt from driving or using machinery, not just for a few weeks, but for the entire duration of me being on it. I can see why, it's groggy, spacy stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When my doc gave me this she said I should be medically exempt from driving or using machinery, not just for a few weeks, but for the entire duration of me being on it. I can see why, it&amp;#39;s groggy, spacy stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7jy0v", "score_hidden": false, "stickied": false, "created": 1492119707.0, "created_utc": 1492090907.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7ug5o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ClassBShareHolder", "parent_id": "t1_dg7ghdc", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I see. Pretty sure I'm taking 50. Just recently doubled what I was taking. Apparently I've got a ways to go before I start to worry. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see. Pretty sure I&amp;#39;m taking 50. Just recently doubled what I was taking. Apparently I&amp;#39;ve got a ways to go before I start to worry. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7ug5o", "score_hidden": false, "stickied": false, "created": 1492131468.0, "created_utc": 1492102668.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ghdc", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "Doctor0000", "parent_id": "t1_dg7gbm3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I was put on trazodone as a long term trauma patient, it was to help me sleep. \n\nTherapeutic range is really wide with this drug, a single dose at the upper range 400+mg can easily impair your ability to drive for 24+ hours. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was put on trazodone as a long term trauma patient, it was to help me sleep. &lt;/p&gt;\n\n&lt;p&gt;Therapeutic range is really wide with this drug, a single dose at the upper range 400+mg can easily impair your ability to drive for 24+ hours. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7ghdc", "score_hidden": false, "stickied": false, "created": 1492114437.0, "created_utc": 1492085637.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8kb6d", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "tac0sandtequila", "parent_id": "t1_dg881ov", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "What? No, trazodone is NOT a benzodiazepine... It's an atypical antidepressant. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What? No, trazodone is NOT a benzodiazepine... It&amp;#39;s an atypical antidepressant. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8kb6d", "score_hidden": false, "stickied": false, "created": 1492162415.0, "created_utc": 1492133615.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8defp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ClassBShareHolder", "parent_id": "t1_dg881ov", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Holy shit, I had no idea. Thanks. I assumed it was just another antidepressant when they switched my night one to morning and Trazadone at night. All I ever read on the labels was hydrochloride and hydrobromide. I assumed they were just variants. \n\nTried to get my daughter to try them. She has similar sleep issues. Good thing she's pigheaded like her parents. \n\nI had no idea they have \"street value.\"  I laughed about the ads on the radio about kids getting drugs from their parents. I was always amused about kids stealing my pills all the kids getting less angsty. \n\n\"Psst.. kid.. wanna sleep better.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit, I had no idea. Thanks. I assumed it was just another antidepressant when they switched my night one to morning and Trazadone at night. All I ever read on the labels was hydrochloride and hydrobromide. I assumed they were just variants. &lt;/p&gt;\n\n&lt;p&gt;Tried to get my daughter to try them. She has similar sleep issues. Good thing she&amp;#39;s pigheaded like her parents. &lt;/p&gt;\n\n&lt;p&gt;I had no idea they have &amp;quot;street value.&amp;quot;  I laughed about the ads on the radio about kids getting drugs from their parents. I was always amused about kids stealing my pills all the kids getting less angsty. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Psst.. kid.. wanna sleep better.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8defp", "score_hidden": false, "stickied": false, "created": 1492153022.0, "created_utc": 1492124222.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8p0h4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "panrestrial", "parent_id": "t1_dg881ov", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "as others have said, trazodone is NOT a benzo, its a serotonin antagonist and reuptake inhibitor class anti depressant (SARI)\nhttps://en.wikipedia.org/wiki/Trazodone", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;as others have said, trazodone is NOT a benzo, its a serotonin antagonist and reuptake inhibitor class anti depressant (SARI)\n&lt;a href=\"https://en.wikipedia.org/wiki/Trazodone\"&gt;https://en.wikipedia.org/wiki/Trazodone&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8p0h4", "score_hidden": false, "stickied": false, "created": 1492169200.0, "created_utc": 1492140400.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg881ov", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "tuxedo_jack", "parent_id": "t1_dg7gbm3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Trazodone is a controlled substance with very well known side effects and it isn't even remotely available outside of a pharmacy unless you're turning to dealers.\n\nThis is a clear-cut case of poisoning.\n\nEDIT: [Here's what Epocrates has to say about this stuff](https://online.epocrates.com/drugs/8410/trazodone/Monograph). There's a reason they say that you should ask your doctor about side effects - [it has a shit-ton of them](https://online.epocrates.com/drugs/8405/trazodone/Adverse-Reactions), and the [list of contraindications / cautions](https://online.epocrates.com/drugs/8403/trazodone/Contradindications-Cautions) are almost as long.\n\nEdited to remove benzo tag.", "edited": 1492140624.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trazodone is a controlled substance with very well known side effects and it isn&amp;#39;t even remotely available outside of a pharmacy unless you&amp;#39;re turning to dealers.&lt;/p&gt;\n\n&lt;p&gt;This is a clear-cut case of poisoning.&lt;/p&gt;\n\n&lt;p&gt;EDIT: &lt;a href=\"https://online.epocrates.com/drugs/8410/trazodone/Monograph\"&gt;Here&amp;#39;s what Epocrates has to say about this stuff&lt;/a&gt;. There&amp;#39;s a reason they say that you should ask your doctor about side effects - &lt;a href=\"https://online.epocrates.com/drugs/8405/trazodone/Adverse-Reactions\"&gt;it has a shit-ton of them&lt;/a&gt;, and the &lt;a href=\"https://online.epocrates.com/drugs/8403/trazodone/Contradindications-Cautions\"&gt;list of contraindications / cautions&lt;/a&gt; are almost as long.&lt;/p&gt;\n\n&lt;p&gt;Edited to remove benzo tag.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg881ov", "score_hidden": false, "stickied": false, "created": 1492146220.0, "created_utc": 1492117420.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8qbox", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ClassBShareHolder", "parent_id": "t1_dg8omre", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Warfarin is not labeled as poison when taken as a blood thinner, yet is used to kill rats. \n\nI'd say you poisoned the infant if it died. Otherwise you're just being reckless and neglectful. I know it's a fine line. Going back to the original post, I don't see a single dose of Trazadone as poisoning. \n\nWhen people talk about date rape drugs, they don't refer to it as poisoning the victims. I'm sure a high enough dose could be lethal. I guess that's where I draw the line. If it takes an OD to kill you, that's not poison in my mind. If a regular dosage will kill you, or it's intended use is killing, that's poison. \n\nInsecticides, drain cleaners, that's what I refer to as poison. Correct or not, that's my reference point. \n\nI'm not saying you can't poison someone with regular every day stuff, I just don't consider giving someone a non-lethal dose of an FDA approved medication poisoning them. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Warfarin is not labeled as poison when taken as a blood thinner, yet is used to kill rats. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d say you poisoned the infant if it died. Otherwise you&amp;#39;re just being reckless and neglectful. I know it&amp;#39;s a fine line. Going back to the original post, I don&amp;#39;t see a single dose of Trazadone as poisoning. &lt;/p&gt;\n\n&lt;p&gt;When people talk about date rape drugs, they don&amp;#39;t refer to it as poisoning the victims. I&amp;#39;m sure a high enough dose could be lethal. I guess that&amp;#39;s where I draw the line. If it takes an OD to kill you, that&amp;#39;s not poison in my mind. If a regular dosage will kill you, or it&amp;#39;s intended use is killing, that&amp;#39;s poison. &lt;/p&gt;\n\n&lt;p&gt;Insecticides, drain cleaners, that&amp;#39;s what I refer to as poison. Correct or not, that&amp;#39;s my reference point. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying you can&amp;#39;t poison someone with regular every day stuff, I just don&amp;#39;t consider giving someone a non-lethal dose of an FDA approved medication poisoning them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8qbox", "score_hidden": false, "stickied": false, "created": 1492171297.0, "created_utc": 1492142497.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8omre", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "panrestrial", "parent_id": "t1_dg8f17t", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "None of my assorted medications are *labeled* as poisons, but if I ground them all up and fed them to an infant would you or would you not say that I poisoned the baby?  Even if I was just trying to make it feel better?  Poison just means capable of causing death or illness if ingested. Like how chocolate is delicious to me but poison to dogs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;None of my assorted medications are &lt;em&gt;labeled&lt;/em&gt; as poisons, but if I ground them all up and fed them to an infant would you or would you not say that I poisoned the baby?  Even if I was just trying to make it feel better?  Poison just means capable of causing death or illness if ingested. Like how chocolate is delicious to me but poison to dogs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8omre", "score_hidden": false, "stickied": false, "created": 1492168609.0, "created_utc": 1492139809.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8f17t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ClassBShareHolder", "parent_id": "t1_dg8eb4l", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Fair enough. I try to keep minimum dosages of anything. Taking what I do was really a last ditch effort. I realized if it took something addictive to give me my life back I'd be willing to do it. Once I discovered how clear my mind was with a good nights sleep, then I looked for something non-addictive. The Trazadone got added by a student doctor during a regular visit because my regular pill could cause insomnia. \n\nBut I digress. I view poisoning as trying to kill someone. They have a category for poison in WHMIS. Water and Trazadone do not have that symbol on them. Warfarin (rat poison) does, but is a blood thinner if you don't take enough to let your blood leak out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair enough. I try to keep minimum dosages of anything. Taking what I do was really a last ditch effort. I realized if it took something addictive to give me my life back I&amp;#39;d be willing to do it. Once I discovered how clear my mind was with a good nights sleep, then I looked for something non-addictive. The Trazadone got added by a student doctor during a regular visit because my regular pill could cause insomnia. &lt;/p&gt;\n\n&lt;p&gt;But I digress. I view poisoning as trying to kill someone. They have a category for poison in WHMIS. Water and Trazadone do not have that symbol on them. Warfarin (rat poison) does, but is a blood thinner if you don&amp;#39;t take enough to let your blood leak out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8f17t", "score_hidden": false, "stickied": false, "created": 1492155191.0, "created_utc": 1492126391.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8eb4l", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "tecrogue", "parent_id": "t1_dg8dv4y", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You don't even have to try to OD really. Liver damage (among other things) an be caused by the use of some of them.\n\nNot to say you shouldn't take them if you need them, but any medicine can cause harm, even antidepressants.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t even have to try to OD really. Liver damage (among other things) an be caused by the use of some of them.&lt;/p&gt;\n\n&lt;p&gt;Not to say you shouldn&amp;#39;t take them if you need them, but any medicine can cause harm, even antidepressants.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8eb4l", "score_hidden": false, "stickied": false, "created": 1492154239.0, "created_utc": 1492125439.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8n1wo", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Zzinthos", "parent_id": "t1_dg8dv4y", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; I've just never heard of anyone trying to OD on their antidepressants.\n\nIt happens quite a bit, really. This includes typical SSRIs and SNRIs, atypicals like trazodone and mirtazapine, and the older TCAs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ve just never heard of anyone trying to OD on their antidepressants.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It happens quite a bit, really. This includes typical SSRIs and SNRIs, atypicals like trazodone and mirtazapine, and the older TCAs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8n1wo", "score_hidden": false, "stickied": false, "created": 1492166275.0, "created_utc": 1492137475.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8n4kn", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Lethario", "parent_id": "t1_dg8ifbm", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Sometimes people plan to commit suicide, sometimes they are just feeling trapped and desperate and use whatever is in arms reach. The patients I'm thinking of generally told us they were overcome with depression rather suddenly and just had the pills near them. It's definitely hard to understand, especially if you want it to make logical sense. Suicide is almost never logical.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes people plan to commit suicide, sometimes they are just feeling trapped and desperate and use whatever is in arms reach. The patients I&amp;#39;m thinking of generally told us they were overcome with depression rather suddenly and just had the pills near them. It&amp;#39;s definitely hard to understand, especially if you want it to make logical sense. Suicide is almost never logical.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8n4kn", "score_hidden": false, "stickied": false, "created": 1492166379.0, "created_utc": 1492137579.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8pusx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ClassBShareHolder", "parent_id": "t1_dg8nvq5", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I still don't \"get\" it. But thanks for the insight. I guess I've gone through that as well. I want peaceful and pain free. I just haven't figured out how to eliminate the evidence of it being self inflicted. I'm not planning anything so there's really no rush. \n\nI also have a prescription for sleeping pills so if I was gonna OD I'd use them. Not understanding exactly what I was taking or the risks of excessive quantities didn't help either. I just assumed I'd take too many and they'd basically do nothing. Much like taking excessive vitamins, I thought you just peed out the excess or they just kept floating around until they were metabolized. \n\nThey've honestly had zero negative effects on me. I've doubled my dosage, skipped a dose or 4. All that happens is if I miss one, I'm awake at 3:00 AM. After an extended run of not taking them, my sleep suffers and I turn back into the cranky bastard I was before I started taking them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I still don&amp;#39;t &amp;quot;get&amp;quot; it. But thanks for the insight. I guess I&amp;#39;ve gone through that as well. I want peaceful and pain free. I just haven&amp;#39;t figured out how to eliminate the evidence of it being self inflicted. I&amp;#39;m not planning anything so there&amp;#39;s really no rush. &lt;/p&gt;\n\n&lt;p&gt;I also have a prescription for sleeping pills so if I was gonna OD I&amp;#39;d use them. Not understanding exactly what I was taking or the risks of excessive quantities didn&amp;#39;t help either. I just assumed I&amp;#39;d take too many and they&amp;#39;d basically do nothing. Much like taking excessive vitamins, I thought you just peed out the excess or they just kept floating around until they were metabolized. &lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;ve honestly had zero negative effects on me. I&amp;#39;ve doubled my dosage, skipped a dose or 4. All that happens is if I miss one, I&amp;#39;m awake at 3:00 AM. After an extended run of not taking them, my sleep suffers and I turn back into the cranky bastard I was before I started taking them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8pusx", "score_hidden": false, "stickied": false, "created": 1492170533.0, "created_utc": 1492141733.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nvq5", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "swarexs985", "parent_id": "t1_dg8ifbm", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "So, as someone who attempted suicide via medication overdose, perhaps I can shed light on this. \n\nWhen you decide to kill yourself, a lot of thought goes into it. That's why they call it \"idealization.\" You don't just think, \"I want to die.\" You plan out how you want to die, what kind of impact you'd want it to have on people, all the way down to how much work it's going to be for whoever has to clean it up. That's why a lot of \"in the moment\" decisions about suicide are.... perhaps dirty is the wrong word... messy, maybe? A shotgun can be very effective, but it leaves a lot to clean up, and may not cause the reaction you want it to. Bleeding out (whether through the wrists, neck, or anywhere, really) is similarly messy. Overdosing via medications (well, certain ones) is an otherwise clean ordeal. \n\nIn addition, the chosen method of suicide frequently follows the thought process of the individual. Someone who's prone to changing their mind a lot will probably choose a quick (but dirty) method, because they're worried they may change their mind. On the other hand, people who are worried about the \"stigma\" of suicide may choose to overdose on a medication, believing it would allow people to convince themselves it may have been an accident. \n\nAfter choosing the method, one who idealizes suicide will frequently obsess over the exact steps. If it's a hanging, where do I hang myself? Someone who's going for shock (perhaps as a last \"fuck you\") would choose somewhere rather public, or at least somewhere frequented by who they wish to see. If it's medication, do I die in my own bed? On the floor in the kitchen? Somewhere random in an ally? All of this is thought out by these people. \n\nIn addition, for many people who choose to die by medication, they believe it to be a more \"peaceful\" way to leave this life. They convince themselves that they'll simply go to sleep and not wake up. Once you've downed the pills (apart from throwing them back up), the decision is made, and now the only thing to do is get comfy and wait for death. \n\nWhen I was obsessed with dying, I chose medication overdose. It was easy to do (the doctor who writes the prescription gave me a 90 day supply, which was 180 pills. I downed around 100 of them). I also think I chose the medication because, at the time, I felt it was truly the only thing helping. My therapist was horrendous, my parents weren't supportive and believed it was all made up by the pharmaceutical companies to push more drugs, Id lost most of my \"friends\" in a bad breakup, and I truly felt alone. These little pills were all that was supposed to help me. If 2 a day couldn't help me feel better, 100 at once might permanently take the pain and suffering and insomnia and horrible thoughts away. I chose to die on a Monday night, because then my family would get a week away from work, school, etc. to process it, have the weekend to ease themselves back up, and be back to normal by next week. I wanted to die in my bed, so that it looked peaceful. I didn't want them to believe I was suffering at all. Doing it via pills would mean they wouldn't see fresh cuts on my body, and no one would have to clean anything up, meaning they could forget about me faster. The exact pills I chose were Trazadone. I figured overloading the brain with an antidepressant would at least make me deliriously happy while death overtook me. My note was succinct, and didn't mention anyone by name. I didn't want anyone to feel like they were at fault, because the problems existed in my head. And I wanted it to be memorable, but not a memoir that would end up in a book somewhere. \n\nThat Monday was the happiest point in my life, up till then. I woke up early in the day, ate a great breakfast, even hugged my parents before heading to school. At school, my teachers all seemed to be suddenly more interesting. The classes felt more fun. More people talked to me that day than had in the previous month. I was upbeat by the time school got out. \n\nI went home to an empty house (my parents would frequently work until 8 or 9 at night). Grabbed my iPod and my pills and laid back. I'd had a good day. It's always best to end on a high note, right? So I dumped the pills into my hand, threw them back, and chased it with a swig of Jack Daniels I stole from my parents' liquor cabinet (after all, one drink calms the nerves, right? And it wasn't like I had to worry about any side effects of mixing antidepressants and alcohol anymore). More relaxed than I'd been in months, I laid back and waited for death to make this my last hurrah. \n\nThankfully, my dog knew something was up. That big dumbass of a Labrador decided that she was going to be allowed on my bed, and helped herself to squeezing between my legs and resting her head on my lap. The look she gave me told me she knew something was up, and she wasn't going to be told to go away. \n\nAnd I cried. And cried. And realized I'd just made a huge mistake. All that planning. All the forethought. The hour I spent meticulously writing a note with my best handwriting. And, in that moment, I realized I wasn't ready to throw it all away. \n\nSomething they don't mention much, is that suicide by *certain* medications is peaceful. Xanax, Ambien, Hydro, things like that are relatively painless and peaceful. You go to sleep and don't ever wake up. But suicide via antidepressants or certain pain medications (*cough cough* Tylenol) are incredibly excruciating. With SSRIs, your brain is suddenly unable to process all of the input it's receiving, and goes into a state of delirium. You forget where you are, who you're with, all of it. You panic and hyperventilate and death comes slowly as your brain practically melts trying to figure out what's going on. With pain meds, you effectively rip holes through your intestinal tract, internally bleeding as your body races to close the wounds, only to find your blood pressure plummeting, heart rate increasing, and your brain goes into a panic. You die either when you bleed out or your heart goes into arrest because it literally can't beat fast enough. \n\nIf you've never counted the pills being wretched from your stomach to make sure you got them all out, let me be the first to say it's an eye opening experience. You're crying, your throat is raw from the excretion, your stomach is in knots trying to hurl itself through your throat, and you're panicking that you didn't get all of them so you call 911 on yourself so that at least someone with some sort of medical experience is watching over you. \n\nSorry this turned into basically an internal monologue gone rogue, but perhaps it can shed some light on the thought process behind \"these\" people and their choice for their end. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, as someone who attempted suicide via medication overdose, perhaps I can shed light on this. &lt;/p&gt;\n\n&lt;p&gt;When you decide to kill yourself, a lot of thought goes into it. That&amp;#39;s why they call it &amp;quot;idealization.&amp;quot; You don&amp;#39;t just think, &amp;quot;I want to die.&amp;quot; You plan out how you want to die, what kind of impact you&amp;#39;d want it to have on people, all the way down to how much work it&amp;#39;s going to be for whoever has to clean it up. That&amp;#39;s why a lot of &amp;quot;in the moment&amp;quot; decisions about suicide are.... perhaps dirty is the wrong word... messy, maybe? A shotgun can be very effective, but it leaves a lot to clean up, and may not cause the reaction you want it to. Bleeding out (whether through the wrists, neck, or anywhere, really) is similarly messy. Overdosing via medications (well, certain ones) is an otherwise clean ordeal. &lt;/p&gt;\n\n&lt;p&gt;In addition, the chosen method of suicide frequently follows the thought process of the individual. Someone who&amp;#39;s prone to changing their mind a lot will probably choose a quick (but dirty) method, because they&amp;#39;re worried they may change their mind. On the other hand, people who are worried about the &amp;quot;stigma&amp;quot; of suicide may choose to overdose on a medication, believing it would allow people to convince themselves it may have been an accident. &lt;/p&gt;\n\n&lt;p&gt;After choosing the method, one who idealizes suicide will frequently obsess over the exact steps. If it&amp;#39;s a hanging, where do I hang myself? Someone who&amp;#39;s going for shock (perhaps as a last &amp;quot;fuck you&amp;quot;) would choose somewhere rather public, or at least somewhere frequented by who they wish to see. If it&amp;#39;s medication, do I die in my own bed? On the floor in the kitchen? Somewhere random in an ally? All of this is thought out by these people. &lt;/p&gt;\n\n&lt;p&gt;In addition, for many people who choose to die by medication, they believe it to be a more &amp;quot;peaceful&amp;quot; way to leave this life. They convince themselves that they&amp;#39;ll simply go to sleep and not wake up. Once you&amp;#39;ve downed the pills (apart from throwing them back up), the decision is made, and now the only thing to do is get comfy and wait for death. &lt;/p&gt;\n\n&lt;p&gt;When I was obsessed with dying, I chose medication overdose. It was easy to do (the doctor who writes the prescription gave me a 90 day supply, which was 180 pills. I downed around 100 of them). I also think I chose the medication because, at the time, I felt it was truly the only thing helping. My therapist was horrendous, my parents weren&amp;#39;t supportive and believed it was all made up by the pharmaceutical companies to push more drugs, Id lost most of my &amp;quot;friends&amp;quot; in a bad breakup, and I truly felt alone. These little pills were all that was supposed to help me. If 2 a day couldn&amp;#39;t help me feel better, 100 at once might permanently take the pain and suffering and insomnia and horrible thoughts away. I chose to die on a Monday night, because then my family would get a week away from work, school, etc. to process it, have the weekend to ease themselves back up, and be back to normal by next week. I wanted to die in my bed, so that it looked peaceful. I didn&amp;#39;t want them to believe I was suffering at all. Doing it via pills would mean they wouldn&amp;#39;t see fresh cuts on my body, and no one would have to clean anything up, meaning they could forget about me faster. The exact pills I chose were Trazadone. I figured overloading the brain with an antidepressant would at least make me deliriously happy while death overtook me. My note was succinct, and didn&amp;#39;t mention anyone by name. I didn&amp;#39;t want anyone to feel like they were at fault, because the problems existed in my head. And I wanted it to be memorable, but not a memoir that would end up in a book somewhere. &lt;/p&gt;\n\n&lt;p&gt;That Monday was the happiest point in my life, up till then. I woke up early in the day, ate a great breakfast, even hugged my parents before heading to school. At school, my teachers all seemed to be suddenly more interesting. The classes felt more fun. More people talked to me that day than had in the previous month. I was upbeat by the time school got out. &lt;/p&gt;\n\n&lt;p&gt;I went home to an empty house (my parents would frequently work until 8 or 9 at night). Grabbed my iPod and my pills and laid back. I&amp;#39;d had a good day. It&amp;#39;s always best to end on a high note, right? So I dumped the pills into my hand, threw them back, and chased it with a swig of Jack Daniels I stole from my parents&amp;#39; liquor cabinet (after all, one drink calms the nerves, right? And it wasn&amp;#39;t like I had to worry about any side effects of mixing antidepressants and alcohol anymore). More relaxed than I&amp;#39;d been in months, I laid back and waited for death to make this my last hurrah. &lt;/p&gt;\n\n&lt;p&gt;Thankfully, my dog knew something was up. That big dumbass of a Labrador decided that she was going to be allowed on my bed, and helped herself to squeezing between my legs and resting her head on my lap. The look she gave me told me she knew something was up, and she wasn&amp;#39;t going to be told to go away. &lt;/p&gt;\n\n&lt;p&gt;And I cried. And cried. And realized I&amp;#39;d just made a huge mistake. All that planning. All the forethought. The hour I spent meticulously writing a note with my best handwriting. And, in that moment, I realized I wasn&amp;#39;t ready to throw it all away. &lt;/p&gt;\n\n&lt;p&gt;Something they don&amp;#39;t mention much, is that suicide by &lt;em&gt;certain&lt;/em&gt; medications is peaceful. Xanax, Ambien, Hydro, things like that are relatively painless and peaceful. You go to sleep and don&amp;#39;t ever wake up. But suicide via antidepressants or certain pain medications (&lt;em&gt;cough cough&lt;/em&gt; Tylenol) are incredibly excruciating. With SSRIs, your brain is suddenly unable to process all of the input it&amp;#39;s receiving, and goes into a state of delirium. You forget where you are, who you&amp;#39;re with, all of it. You panic and hyperventilate and death comes slowly as your brain practically melts trying to figure out what&amp;#39;s going on. With pain meds, you effectively rip holes through your intestinal tract, internally bleeding as your body races to close the wounds, only to find your blood pressure plummeting, heart rate increasing, and your brain goes into a panic. You die either when you bleed out or your heart goes into arrest because it literally can&amp;#39;t beat fast enough. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;ve never counted the pills being wretched from your stomach to make sure you got them all out, let me be the first to say it&amp;#39;s an eye opening experience. You&amp;#39;re crying, your throat is raw from the excretion, your stomach is in knots trying to hurl itself through your throat, and you&amp;#39;re panicking that you didn&amp;#39;t get all of them so you call 911 on yourself so that at least someone with some sort of medical experience is watching over you. &lt;/p&gt;\n\n&lt;p&gt;Sorry this turned into basically an internal monologue gone rogue, but perhaps it can shed some light on the thought process behind &amp;quot;these&amp;quot; people and their choice for their end. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8nvq5", "score_hidden": false, "stickied": false, "created": 1492167480.0, "created_utc": 1492138680.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ifbm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ClassBShareHolder", "parent_id": "t1_dg8g7ea", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "What could they possibly be thinking?\n\nObviously somebody's tried it. I just can't fathom it. I've never heard of them being used on the \"street.\"\n\nI guess if you're depressed and either seeking help or desperate you work with what you have. \n\nPerhaps not everyone is as well versed in easy ways to kill yourself. I can think of 2 clean, quick, and easy ways not involving taking too many pills. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What could they possibly be thinking?&lt;/p&gt;\n\n&lt;p&gt;Obviously somebody&amp;#39;s tried it. I just can&amp;#39;t fathom it. I&amp;#39;ve never heard of them being used on the &amp;quot;street.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I guess if you&amp;#39;re depressed and either seeking help or desperate you work with what you have. &lt;/p&gt;\n\n&lt;p&gt;Perhaps not everyone is as well versed in easy ways to kill yourself. I can think of 2 clean, quick, and easy ways not involving taking too many pills. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8ifbm", "score_hidden": false, "stickied": false, "created": 1492159827.0, "created_utc": 1492131027.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8g7ea", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lethario", "parent_id": "t1_dg8dv4y", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I am an emt, I've transported patients who intentionally overdosed on antidepressants. An overdose of ssri's can cause serotonin syndrome.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am an emt, I&amp;#39;ve transported patients who intentionally overdosed on antidepressants. An overdose of ssri&amp;#39;s can cause serotonin syndrome.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8g7ea", "score_hidden": false, "stickied": false, "created": 1492156778.0, "created_utc": 1492127978.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8dv4y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ClassBShareHolder", "parent_id": "t1_dg898wc", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Sure, you can OD on water. I've just never heard of anyone trying to OD on their antidepressants. I live a pretty sheltered life since I quit working with young drug users apparently. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure, you can OD on water. I&amp;#39;ve just never heard of anyone trying to OD on their antidepressants. I live a pretty sheltered life since I quit working with young drug users apparently. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8dv4y", "score_hidden": false, "stickied": false, "created": 1492153640.0, "created_utc": 1492124840.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg898wc", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "tecrogue", "parent_id": "t1_dg7gbm3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "The difference between a poison and a medicine is the usage and dose.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The difference between a poison and a medicine is the usage and dose.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg898wc", "score_hidden": false, "stickied": false, "created": 1492147668.0, "created_utc": 1492118868.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7k8hu", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "AtlantisSky", "parent_id": "t1_dg7gbm3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I take Effexor for my depression and anxiety. It is in fact a Psycoactive drug. Given someone any medication without their knowledge is poisoning. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I take Effexor for my depression and anxiety. It is in fact a Psycoactive drug. Given someone any medication without their knowledge is poisoning. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7k8hu", "score_hidden": false, "stickied": false, "created": 1492120086.0, "created_utc": 1492091286.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7lx02", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "NoddyBowWow", "parent_id": "t1_dg7iwhw", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "No, it's not. Are you sure you're not thinking of Tramadol?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, it&amp;#39;s not. Are you sure you&amp;#39;re not thinking of Tramadol?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7lx02", "score_hidden": false, "stickied": false, "created": 1492122180.0, "created_utc": 1492093380.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7iwhw", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg7gbm3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7iwhw", "score_hidden": false, "stickied": false, "created": 1492118294.0, "created_utc": 1492089494.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7gbm3", "gilded": 0, "archived": false, "score": -56, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6u1xf", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7gbm3", "score_hidden": false, "stickied": false, "created": 1492114139.0, "created_utc": 1492085339.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -56}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6u1xf", "gilded": 0, "archived": false, "score": 399, "report_reasons": null, "author": "derspiny", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; she gave me trazodone the night before without my knowledge\n\nThat, on its own, would merit an immediate police report. Intentionally dosing someone with a psychoactive drug, without their knowledge, is _poisoning_. If she's a minor, it may also be child abuse. Your friend needs to call the cops (and CPS, but she's on top of that) and report this.\n\nShe should call the police anyways, though. She can get a copy of the police report from the collision, or make one if none has been made, and find out about court dates that way. She can also share her suspicions that her parents may be trying to defraud their insurer; there's no guarantee that the police will see it that way, but in context of her poisoning, they may.\n\nFinally, she should follow up with CPS and tell them that her parents have taken her phone away after her last report, and that she's afraid of retaliation.", "edited": 1492044328.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;she gave me trazodone the night before without my knowledge&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That, on its own, would merit an immediate police report. Intentionally dosing someone with a psychoactive drug, without their knowledge, is &lt;em&gt;poisoning&lt;/em&gt;. If she&amp;#39;s a minor, it may also be child abuse. Your friend needs to call the cops (and CPS, but she&amp;#39;s on top of that) and report this.&lt;/p&gt;\n\n&lt;p&gt;She should call the police anyways, though. She can get a copy of the police report from the collision, or make one if none has been made, and find out about court dates that way. She can also share her suspicions that her parents may be trying to defraud their insurer; there&amp;#39;s no guarantee that the police will see it that way, but in context of her poisoning, they may.&lt;/p&gt;\n\n&lt;p&gt;Finally, she should follow up with CPS and tell them that her parents have taken her phone away after her last report, and that she&amp;#39;s afraid of retaliation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6u1xf", "score_hidden": false, "stickied": false, "created": 1492071964.0, "created_utc": 1492043164.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 399}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7jz60", "gilded": 0, "archived": false, "score": 54, "report_reasons": null, "author": "techiebabe", "parent_id": "t1_dg6xn4k", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "This. OP, store a grab bag with a trusted friend. It should contain enough for 48 hours in terms of clothes, medicines, cash if possible, and if you can't keep the originals of documents like passport etc, then copies. A burner phone is good too. Don't forget charger. A few light snacks like cereal bars are good too, but don't make the bag too heavy to run with. If you can't access your medicine, keep a script or at least the details of what you take. Have contact ID in that bag too so if you're found with it and are in a bad way, there's something that says who to call for you (that isn't your family). \n\nHave other things at your home ready to grab fast, or on your person, like any  small treasured item and your bank cards etc. So if you ever need to just run to get safe, you can just go out the door in what you're wearing right that moment. \n\nHave a codeword agreed with your friend so if you use it on the phone you both know it means \"in danger, call police / come get me now / meet me at x place\". \n\nI had this agreement and back up with a good friend throughout my childhood from 11-16 (not a friend my mother would ever expect me to go to) and although I never needed it, it really helped knowing it was there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. OP, store a grab bag with a trusted friend. It should contain enough for 48 hours in terms of clothes, medicines, cash if possible, and if you can&amp;#39;t keep the originals of documents like passport etc, then copies. A burner phone is good too. Don&amp;#39;t forget charger. A few light snacks like cereal bars are good too, but don&amp;#39;t make the bag too heavy to run with. If you can&amp;#39;t access your medicine, keep a script or at least the details of what you take. Have contact ID in that bag too so if you&amp;#39;re found with it and are in a bad way, there&amp;#39;s something that says who to call for you (that isn&amp;#39;t your family). &lt;/p&gt;\n\n&lt;p&gt;Have other things at your home ready to grab fast, or on your person, like any  small treasured item and your bank cards etc. So if you ever need to just run to get safe, you can just go out the door in what you&amp;#39;re wearing right that moment. &lt;/p&gt;\n\n&lt;p&gt;Have a codeword agreed with your friend so if you use it on the phone you both know it means &amp;quot;in danger, call police / come get me now / meet me at x place&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I had this agreement and back up with a good friend throughout my childhood from 11-16 (not a friend my mother would ever expect me to go to) and although I never needed it, it really helped knowing it was there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7jz60", "score_hidden": false, "stickied": false, "created": 1492119751.0, "created_utc": 1492090951.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 54}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7o7ff", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "PurePerfection_", "parent_id": "t1_dg7gikx", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "To give some perspective on what OP was dosed with -\n\nTrazodone is an older antidepressant, and the sedation side effect is so common that many doctors prescribe it off-label as a sleep aid or anti-anxiety drug because it is safer and less habit-forming than benzodiazepines. Side effects, especially at higher doses, can include psychomotor retardation - slower physical and emotional reaction times. \n\nI've taken it for years for insomnia. And holy shit can that stuff knock you out if you take more than you need. When I started it, my doctor and I spent some time titrating the dose so it was enough to help me fall asleep quickly but not so much that I was drowsy in the morning. At 100mg, it takes me a little longer to get out of bed in the morning, but after a shower and moving around for a bit I feel normal. At 200mg - half the maximum therapeutic dose - I was wasted the next morning, if I managed not to sleep through both of my alarm clocks. Clumsy, dizzy, sleepy, felt like lead weights were tied to my limbs and my brain. I'd have been a danger to myself traveling on foot for the first couple of hours, let alone driving a car. \n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To give some perspective on what OP was dosed with -&lt;/p&gt;\n\n&lt;p&gt;Trazodone is an older antidepressant, and the sedation side effect is so common that many doctors prescribe it off-label as a sleep aid or anti-anxiety drug because it is safer and less habit-forming than benzodiazepines. Side effects, especially at higher doses, can include psychomotor retardation - slower physical and emotional reaction times. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve taken it for years for insomnia. And holy shit can that stuff knock you out if you take more than you need. When I started it, my doctor and I spent some time titrating the dose so it was enough to help me fall asleep quickly but not so much that I was drowsy in the morning. At 100mg, it takes me a little longer to get out of bed in the morning, but after a shower and moving around for a bit I feel normal. At 200mg - half the maximum therapeutic dose - I was wasted the next morning, if I managed not to sleep through both of my alarm clocks. Clumsy, dizzy, sleepy, felt like lead weights were tied to my limbs and my brain. I&amp;#39;d have been a danger to myself traveling on foot for the first couple of hours, let alone driving a car. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7o7ff", "score_hidden": false, "stickied": false, "created": 1492124797.0, "created_utc": 1492095997.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7l4f4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "zumatech", "parent_id": "t1_dg7k50a", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Damn mobile.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn mobile.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7l4f4", "score_hidden": false, "stickied": false, "created": 1492121218.0, "created_utc": 1492092418.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7k50a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "improperlycited", "parent_id": "t1_dg7gikx", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You replied to the wrong person.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You replied to the wrong person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7k50a", "score_hidden": false, "stickied": false, "created": 1492119959.0, "created_utc": 1492091159.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7m7by", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "koalapants", "parent_id": "t1_dg7gikx", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "It's for depression and insomnia", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s for depression and insomnia&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7m7by", "score_hidden": false, "stickied": false, "created": 1492122514.0, "created_utc": 1492093714.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7gikx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "zumatech", "parent_id": "t1_dg6xn4k", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Who was the Trazadone prescribed for? Are you being treated for depression?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who was the Trazadone prescribed for? Are you being treated for depression?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7gikx", "score_hidden": false, "stickied": false, "created": 1492114495.0, "created_utc": 1492085695.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xn4k", "gilded": 0, "archived": false, "score": 98, "report_reasons": null, "author": "madommouselfefe", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "If you are in the US talk to a teacher that you trust. Teachers are mandatory reporters, they have to report abuse don't be afraid to beg for help. Let them know you fear for your safety at home, and that they are denying medical care as well as anything else you can prove. \n\nIANAL- but my best friend in high school had a similar problem. She kept a spare set of cloths in her back pack along with her treasured items. It took a few weeks for CPS to decide her parents where unfit, and she was removed from school and was never allowed to go home again. Keep this in mind, and please have a safe person who you talk to regularly, if they don't hear from you tell them to call the police. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you are in the US talk to a teacher that you trust. Teachers are mandatory reporters, they have to report abuse don&amp;#39;t be afraid to beg for help. Let them know you fear for your safety at home, and that they are denying medical care as well as anything else you can prove. &lt;/p&gt;\n\n&lt;p&gt;IANAL- but my best friend in high school had a similar problem. She kept a spare set of cloths in her back pack along with her treasured items. It took a few weeks for CPS to decide her parents where unfit, and she was removed from school and was never allowed to go home again. Keep this in mind, and please have a safe person who you talk to regularly, if they don&amp;#39;t hear from you tell them to call the police. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6xn4k", "score_hidden": false, "stickied": false, "created": 1492076309.0, "created_utc": 1492047509.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 98}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg6u852", "gilded": 0, "archived": false, "score": 63, "report_reasons": null, "author": "vasion123", "parent_id": "t1_dg6u4oo", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "right now, yesterday now", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;right now, yesterday now&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6u852", "score_hidden": false, "stickied": false, "created": 1492072168.0, "created_utc": 1492043368.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 63}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6u4oo", "gilded": 0, "archived": false, "score": 98, "report_reasons": null, "author": "xenokilla", "parent_id": "t1_dg6txi8", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": " Call that police,  now", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Call that police,  now&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6u4oo", "score_hidden": false, "stickied": false, "created": 1492072056.0, "created_utc": 1492043256.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 98}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg759gy", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "nionvox", "parent_id": "t1_dg6txi8", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Go to a neighbor you trust, or a friend's place. Hell, go to your school counselor or office. Tell them you feel unsafe at home and need to call the police.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go to a neighbor you trust, or a friend&amp;#39;s place. Hell, go to your school counselor or office. Tell them you feel unsafe at home and need to call the police.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg759gy", "score_hidden": false, "stickied": false, "created": 1492086691.0, "created_utc": 1492057891.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 38}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6txi8", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "druggedbymother", "parent_id": "t1_dg6twj7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I am 16.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am 16.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6txi8", "score_hidden": false, "stickied": false, "created": 1492071813.0, "created_utc": 1492043013.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg6txpv", "gilded": 0, "archived": false, "score": -29, "report_reasons": null, "author": "seaboard2", "parent_id": "t1_dg6twj7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I am glad you asked because I was dying to ask :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am glad you asked because I was dying to ask :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6txpv", "score_hidden": false, "stickied": false, "created": 1492071821.0, "created_utc": 1492043021.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -29}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6twj7", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "ThunderMountain", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "How old are you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How old are you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6twj7", "score_hidden": false, "stickied": false, "created": 1492071779.0, "created_utc": 1492042979.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8do34", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "NovaeDeArx", "parent_id": "t1_dg8c1q5", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Cool, thanks; just wanted to rule out any issues with reality perception, it's good to get that out of the way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cool, thanks; just wanted to rule out any issues with reality perception, it&amp;#39;s good to get that out of the way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8do34", "score_hidden": false, "stickied": false, "created": 1492153377.0, "created_utc": 1492124577.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8c1q5", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "FullMoonMother", "parent_id": "t1_dg88x0u", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "OP is thought to have Borderline Personality Disorder in addition to PTSD, but given her age BPD is not to be concretely diagnosed until later in life. Her move to AZ is recent and there have been multiple investigations levered against the parents from another state. Abuse is no new thing in this household, however there has been no concrete evidence prior to recently. So, while OP suffers from depression and generalized anxiety associated with PTSD, parents are withholding treatment for that as well and she is not prescribed medications. It'd be hard for anyone to believe if OP's mom hadn't stated that she gave it to her etc. and we didn't have multiple recordings of changing stories.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP is thought to have Borderline Personality Disorder in addition to PTSD, but given her age BPD is not to be concretely diagnosed until later in life. Her move to AZ is recent and there have been multiple investigations levered against the parents from another state. Abuse is no new thing in this household, however there has been no concrete evidence prior to recently. So, while OP suffers from depression and generalized anxiety associated with PTSD, parents are withholding treatment for that as well and she is not prescribed medications. It&amp;#39;d be hard for anyone to believe if OP&amp;#39;s mom hadn&amp;#39;t stated that she gave it to her etc. and we didn&amp;#39;t have multiple recordings of changing stories.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8c1q5", "score_hidden": false, "stickied": false, "created": 1492151232.0, "created_utc": 1492122432.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg88x0u", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "NovaeDeArx", "parent_id": "t1_dg87puc", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Quick pertinent question: does OP have any mental health issues? They referenced parents \"withholding meds\", and the whole thing sounds a little strange (mostly that a drug-someone-last-night-and-hope-they-crash-your-car-today plot sounds very fishy).\n\nSeriously, it's important. If the whole thing is a product of paranoid schizophrenia, this could cause a gigantic train wreck of problems for the family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Quick pertinent question: does OP have any mental health issues? They referenced parents &amp;quot;withholding meds&amp;quot;, and the whole thing sounds a little strange (mostly that a drug-someone-last-night-and-hope-they-crash-your-car-today plot sounds very fishy).&lt;/p&gt;\n\n&lt;p&gt;Seriously, it&amp;#39;s important. If the whole thing is a product of paranoid schizophrenia, this could cause a gigantic train wreck of problems for the family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg88x0u", "score_hidden": false, "stickied": false, "created": 1492147268.0, "created_utc": 1492118468.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dgad3dz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FullMoonMother", "parent_id": "t1_dg8irs9", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "OP has recently been assigned a case worker for CPS after multiple reports from personal and professional sources (thank goodness) who was originally told to discount OP's story, but thanks to recent verbal recordings that OP showed her is starting to become more of an advocate. Unfortunately, in OP's county a case number or some other number is needed to access the report for some reason. This is having gone through their government website personally as well. Any help on that issue would be appreciated as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP has recently been assigned a case worker for CPS after multiple reports from personal and professional sources (thank goodness) who was originally told to discount OP&amp;#39;s story, but thanks to recent verbal recordings that OP showed her is starting to become more of an advocate. Unfortunately, in OP&amp;#39;s county a case number or some other number is needed to access the report for some reason. This is having gone through their government website personally as well. Any help on that issue would be appreciated as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgad3dz", "score_hidden": false, "stickied": false, "created": 1492265017.0, "created_utc": 1492236217.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8irs9", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "geekgirl1225", "parent_id": "t1_dg87puc", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Anyone can (for any reason that does not have to be disclosed) request a copy of the police report associated with this case. Even though OP is a minor, you can request a copy of the report, probably for a small fee. Certain things, like name and age, may be redacted. Here's the \"should\" part: even if OP does not have the case number, they should be able to request it by her name. The police record's system should be able to find this (as long as the system is computer based). \n\nHowever, you CAN assist in a material manner by calling CPS. You are aware of these issues occurring. You do not have to be a mandatory reporter to report. You will also be adding credibility to OP's story by providing information associated with her case. Even if it is something that only she has told you, that you have no corroboration, that you have no physical evidence, you can (and should) make a report on OP's behalf. This is in addition to OP making outcry to someone at school, a physician, etc. \n\nOne final follow up comment: the legal issues can be handled when the OP gets a case worker due to the CPS investigation. They can talk to the city or district attorney (probably city based on the fact that it is a traffic issue) and work within the system to ensure it is handled appropriately. Even if she doesn't have a case worker yet, she has the right to look up the case, call the city or district attorney's office and talk to someone there to find out when her case is supposed to be heard. This would also be a perfect time to tell someone else in a position of authority about the abuse. Again, she can call without a case number and just her name and date of birth to find out the information. She also can go in person (if that is a safe option) to find out about her case.\n\nOne final comment: Please, please, PLEASE make sure OP gets help. \n\nSource: Not a lawyer but work in law enforcement.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anyone can (for any reason that does not have to be disclosed) request a copy of the police report associated with this case. Even though OP is a minor, you can request a copy of the report, probably for a small fee. Certain things, like name and age, may be redacted. Here&amp;#39;s the &amp;quot;should&amp;quot; part: even if OP does not have the case number, they should be able to request it by her name. The police record&amp;#39;s system should be able to find this (as long as the system is computer based). &lt;/p&gt;\n\n&lt;p&gt;However, you CAN assist in a material manner by calling CPS. You are aware of these issues occurring. You do not have to be a mandatory reporter to report. You will also be adding credibility to OP&amp;#39;s story by providing information associated with her case. Even if it is something that only she has told you, that you have no corroboration, that you have no physical evidence, you can (and should) make a report on OP&amp;#39;s behalf. This is in addition to OP making outcry to someone at school, a physician, etc. &lt;/p&gt;\n\n&lt;p&gt;One final follow up comment: the legal issues can be handled when the OP gets a case worker due to the CPS investigation. They can talk to the city or district attorney (probably city based on the fact that it is a traffic issue) and work within the system to ensure it is handled appropriately. Even if she doesn&amp;#39;t have a case worker yet, she has the right to look up the case, call the city or district attorney&amp;#39;s office and talk to someone there to find out when her case is supposed to be heard. This would also be a perfect time to tell someone else in a position of authority about the abuse. Again, she can call without a case number and just her name and date of birth to find out the information. She also can go in person (if that is a safe option) to find out about her case.&lt;/p&gt;\n\n&lt;p&gt;One final comment: Please, please, PLEASE make sure OP gets help. &lt;/p&gt;\n\n&lt;p&gt;Source: Not a lawyer but work in law enforcement.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8irs9", "score_hidden": false, "stickied": false, "created": 1492160294.0, "created_utc": 1492131494.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dgaczmd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FullMoonMother", "parent_id": "t1_dg8m7ki", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "During the first time OP was unable to speak in confidence with a worker, however the mother disclosed the usage of unprescribed trazadone. The second visit in which OP went without parental knowledge and spoke with social services she divulged all information which warranted police involvement, however, she is still present in the home.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;During the first time OP was unable to speak in confidence with a worker, however the mother disclosed the usage of unprescribed trazadone. The second visit in which OP went without parental knowledge and spoke with social services she divulged all information which warranted police involvement, however, she is still present in the home.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgaczmd", "score_hidden": false, "stickied": false, "created": 1492264787.0, "created_utc": 1492235987.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8m7ki", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "black_phone", "parent_id": "t1_dg87puc", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Why did she never tell anyone in the ER during her two visits? Pretty sure they are required to ask about abuse, and self harm. They would've removed the parents and had the police come (besides the on duty security or police already there).\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why did she never tell anyone in the ER during her two visits? Pretty sure they are required to ask about abuse, and self harm. They would&amp;#39;ve removed the parents and had the police come (besides the on duty security or police already there).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8m7ki", "score_hidden": false, "stickied": false, "created": 1492165057.0, "created_utc": 1492136257.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87puc", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "FullMoonMother", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Clarification from an adult friend unable to assist in a material manner due to distance; OP has never been prescribed trazadone, and mother admitted to such to doctor in hospital after crash. OP had no knowledge of what trazadone was until she was able to look it up. Crash incident is public record, however we are unable to obtain full reports due to lack of information /consent. There are now multiple audio recordings dictating refusal of care, verbal abuse, threats of physical and financial abuse, and other worrisome statements that indicate they may be plotting some way to take advantage of her (IE previously stating she was required to do traffic school, and now stating that isn't the case or stating she has no traffic date when that is also public record). She is currently looking for assistance in how to proceed so she is not taken advantage of, her license isn't revoked, she isn't screwed financially, and so CPS may be expedited. Thank you all for your help so far.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Clarification from an adult friend unable to assist in a material manner due to distance; OP has never been prescribed trazadone, and mother admitted to such to doctor in hospital after crash. OP had no knowledge of what trazadone was until she was able to look it up. Crash incident is public record, however we are unable to obtain full reports due to lack of information /consent. There are now multiple audio recordings dictating refusal of care, verbal abuse, threats of physical and financial abuse, and other worrisome statements that indicate they may be plotting some way to take advantage of her (IE previously stating she was required to do traffic school, and now stating that isn&amp;#39;t the case or stating she has no traffic date when that is also public record). She is currently looking for assistance in how to proceed so she is not taken advantage of, her license isn&amp;#39;t revoked, she isn&amp;#39;t screwed financially, and so CPS may be expedited. Thank you all for your help so far.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg87puc", "score_hidden": false, "stickied": false, "created": 1492145845.0, "created_utc": 1492117045.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg73c4k", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "floridianreader", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "To get your medical records, you need to submit a request in writing to the ER that you went to (both times?) and possibly the urgent care clinic. You may have to pay (probably) a small amount for the actual photocopying of your record. I would do this as soon as you can. They will probably want to mail it to your home, but I suspect that you and I both know that is a bad idea. Ask them if  you can wait while they photocopy it or come back another day to pick it up. (I am a medical social worker; I know of which I speak). \n\nAnd get the police or someone you trust at school to call CPS on your behalf. The more, the merrier. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To get your medical records, you need to submit a request in writing to the ER that you went to (both times?) and possibly the urgent care clinic. You may have to pay (probably) a small amount for the actual photocopying of your record. I would do this as soon as you can. They will probably want to mail it to your home, but I suspect that you and I both know that is a bad idea. Ask them if  you can wait while they photocopy it or come back another day to pick it up. (I am a medical social worker; I know of which I speak). &lt;/p&gt;\n\n&lt;p&gt;And get the police or someone you trust at school to call CPS on your behalf. The more, the merrier. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg73c4k", "score_hidden": false, "stickied": false, "created": 1492083753.0, "created_utc": 1492054953.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg6upzl", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "YouCantSaveEveryone", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Call the police and make a report. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Call the police and make a report. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg6upzl", "score_hidden": false, "stickied": false, "created": 1492072745.0, "created_utc": 1492043945.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dgad5hr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FullMoonMother", "parent_id": "t1_dg8g11u", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "This is what it appears to be boiling down to. Recently OP has been able to get multiple voice recordings in which OP's father has explicitly stated that OP was to do traffic school and then later state OP was NOT to do traffic school. They also refuse to acknowledge a court date, possibly in an effort to do damage to her license and future finances in regards to auto insurance. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is what it appears to be boiling down to. Recently OP has been able to get multiple voice recordings in which OP&amp;#39;s father has explicitly stated that OP was to do traffic school and then later state OP was NOT to do traffic school. They also refuse to acknowledge a court date, possibly in an effort to do damage to her license and future finances in regards to auto insurance. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgad5hr", "score_hidden": false, "stickied": false, "created": 1492265146.0, "created_utc": 1492236346.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8g11u", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "CountofAccount", "parent_id": "t1_dg7tbkt", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "If op's story is accurate, it sounds like a plan by the parents to deprive her of mobility and independence. If she can't drive, she thus has to rely on the parents to go everywhere and tell them all of her plans. The timing checks out too, controlling parents tend to act up when their child starts acting like an adult.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If op&amp;#39;s story is accurate, it sounds like a plan by the parents to deprive her of mobility and independence. If she can&amp;#39;t drive, she thus has to rely on the parents to go everywhere and tell them all of her plans. The timing checks out too, controlling parents tend to act up when their child starts acting like an adult.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8g11u", "score_hidden": false, "stickied": false, "created": 1492156535.0, "created_utc": 1492127735.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7tbkt", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "BigPinkPanther", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Upvote for support.  You seem to be getting great answers here.  Your parents are dangerous to you.  It would be best if you could live somewhere else if possible.  This is outrageous.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Upvote for support.  You seem to be getting great answers here.  Your parents are dangerous to you.  It would be best if you could live somewhere else if possible.  This is outrageous.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7tbkt", "score_hidden": false, "stickied": false, "created": 1492130274.0, "created_utc": 1492101474.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dgadedu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Swedishpunsch", "parent_id": "t1_dgacwn8", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I'm glad to hear that CPS is involved. \n\nIf doctors are mandated reporters in your state/province, the doctor should be reported to the hospital.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad to hear that CPS is involved. &lt;/p&gt;\n\n&lt;p&gt;If doctors are mandated reporters in your state/province, the doctor should be reported to the hospital.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgadedu", "score_hidden": false, "stickied": false, "created": 1492265687.0, "created_utc": 1492236887.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgacwn8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FullMoonMother", "parent_id": "t1_dg8dsit", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Unfortunately, while OP was there for 13 hours, it did not appear that the doctor reported the abuse to the social services on staff or CPS. CPS is currently involved. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately, while OP was there for 13 hours, it did not appear that the doctor reported the abuse to the social services on staff or CPS. CPS is currently involved. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgacwn8", "score_hidden": false, "stickied": false, "created": 1492264606.0, "created_utc": 1492235806.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8dsit", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Swedishpunsch", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": ".....**At the ER visit, my mother told the doctor that she gave me trazodone the night before without my knowledge**.....\n\nThat is clearly abusive.  If you are in the US, OP, the doctor is also a mandated reporter.  It would be nice to think that he/she has already called CPS.  \n\nYou need to talk to people at school, and also to get some legal aid.  If the doctor didn't report this, your attorney should find out why not, and get a statement.  \n\nThe police should have called CPS too, as they are also mandated reporters.  I'm not sure whether the social worker is mandated, but one would hope that he/she would also call. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;.....&lt;strong&gt;At the ER visit, my mother told the doctor that she gave me trazodone the night before without my knowledge&lt;/strong&gt;.....&lt;/p&gt;\n\n&lt;p&gt;That is clearly abusive.  If you are in the US, OP, the doctor is also a mandated reporter.  It would be nice to think that he/she has already called CPS.  &lt;/p&gt;\n\n&lt;p&gt;You need to talk to people at school, and also to get some legal aid.  If the doctor didn&amp;#39;t report this, your attorney should find out why not, and get a statement.  &lt;/p&gt;\n\n&lt;p&gt;The police should have called CPS too, as they are also mandated reporters.  I&amp;#39;m not sure whether the social worker is mandated, but one would hope that he/she would also call. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8dsit", "score_hidden": false, "stickied": false, "created": 1492153542.0, "created_utc": 1492124742.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7xh59", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "recipriversexcluson", "parent_id": "t1_dg7l51w", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "THIS. Among all the other call-the-police, and have-school-call-CPS suggestions, DON'T let this fact slip by.\n\nIf the Trazadone was not prescribed to you it was given out in violation of federal law.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;THIS. Among all the other call-the-police, and have-school-call-CPS suggestions, DON&amp;#39;T let this fact slip by.&lt;/p&gt;\n\n&lt;p&gt;If the Trazadone was not prescribed to you it was given out in violation of federal law.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7xh59", "score_hidden": false, "stickied": false, "created": 1492134689.0, "created_utc": 1492105889.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dgad7a6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FullMoonMother", "parent_id": "t1_dg7l51w", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "OP's mother is the one prescribed Trazadone. She is a former RN and really should know better, but we currently have verbal admittance of her having given OP Trazadone. So, if we cannot form a solid case of abuse, we do have federal law as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP&amp;#39;s mother is the one prescribed Trazadone. She is a former RN and really should know better, but we currently have verbal admittance of her having given OP Trazadone. So, if we cannot form a solid case of abuse, we do have federal law as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgad7a6", "score_hidden": false, "stickied": false, "created": 1492265249.0, "created_utc": 1492236449.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8sxpf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "athennna", "parent_id": "t1_dg7l51w", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Just FYI it's also fairly commonly prescribed for insomnia. That's what I take it for. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just FYI it&amp;#39;s also fairly commonly prescribed for insomnia. That&amp;#39;s what I take it for. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8sxpf", "score_hidden": false, "stickied": false, "created": 1492175955.0, "created_utc": 1492147155.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7l51w", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "zumatech", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Who was the Trazadone prescribed for? Are you being treated for depression?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who was the Trazadone prescribed for? Are you being treated for depression?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7l51w", "score_hidden": false, "stickied": false, "created": 1492121240.0, "created_utc": 1492092440.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg72dj9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AutoModerator", "parent_id": "t1_dg728dv", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Your comment was automatically removed because you linked to reddit without using the \"no-participation\" np. domain.\nReddit links should be of the form \"np.reddit.com\" or \"np.redd.it.\"  Please edit the link, if possible, and [click here](https://www.reddit.com/message/compose/?to=/r/legaladvice&amp;subject=Re-approve%20my%20comment&amp;message=https://www.reddit.com/r/legaladvice/comments/6524ee/az_i_was_drugged_by_abusive_mother_and_given_the/dg728dv/%20\\(please%20leave%20this%20so%20we%20can%20reference%20your%20comment\\)) to notify us to re-approve your comment.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/legaladvice) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your comment was automatically removed because you linked to reddit without using the &amp;quot;no-participation&amp;quot; np. domain.\nReddit links should be of the form &amp;quot;np.reddit.com&amp;quot; or &amp;quot;np.redd.it.&amp;quot;  Please edit the link, if possible, and &lt;a href=\"https://www.reddit.com/message/compose/?to=/r/legaladvice&amp;amp;subject=Re-approve%20my%20comment&amp;amp;message=https://www.reddit.com/r/legaladvice/comments/6524ee/az_i_was_drugged_by_abusive_mother_and_given_the/dg728dv/%20(please%20leave%20this%20so%20we%20can%20reference%20your%20comment)\"&gt;click here&lt;/a&gt; to notify us to re-approve your comment.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/legaladvice\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg72dj9", "score_hidden": false, "stickied": false, "created": 1492082370.0, "created_utc": 1492053570.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg728dv", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "[removed]", "edited": 1492053817.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg728dv", "score_hidden": false, "stickied": false, "created": 1492082171.0, "created_utc": 1492053371.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg7rlve", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TotesMessenger", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/bestoflegaladvice] [I was drugged by abusive mother and given the keys to drive her car the next day and got in a car wreck which she may have planned.](https://np.reddit.com/r/bestoflegaladvice/comments/656dy2/i_was_drugged_by_abusive_mother_and_given_the/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a bot, &lt;em&gt;bleep&lt;/em&gt;, &lt;em&gt;bloop&lt;/em&gt;. Someone has linked to this thread from another place on reddit:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;[&lt;a href=\"/r/bestoflegaladvice\"&gt;/r/bestoflegaladvice&lt;/a&gt;] &lt;a href=\"https://np.reddit.com/r/bestoflegaladvice/comments/656dy2/i_was_drugged_by_abusive_mother_and_given_the/\"&gt;I was drugged by abusive mother and given the keys to drive her car the next day and got in a car wreck which she may have planned.&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;a href=\"#footer\"&gt;&lt;/a&gt;&lt;em&gt;&lt;sup&gt;If you follow any of the above links, please respect the rules of reddit and don&amp;#39;t vote in the other threads.&lt;/sup&gt; &lt;sup&gt;(&lt;a href=\"/r/TotesMessenger\"&gt;Info&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;/&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"/message/compose?to=/r/TotesMessenger\"&gt;Contact&lt;/a&gt;)&lt;/sup&gt;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"#bot\"&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7rlve", "score_hidden": false, "stickied": false, "created": 1492128447.0, "created_utc": 1492099647.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_6524ee", "likes": null, "replies": "", "user_reports": [], "id": "dg8p9fa", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "random_side_note", "parent_id": "t1_dg8c4i8", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Not to mention, that while a regular user of trazodone might not really feel the effects of the drug the next day, someone with no tolerance for it (OP) could very well have a bit of a \"hangover\", for lack of a better term.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not to mention, that while a regular user of trazodone might not really feel the effects of the drug the next day, someone with no tolerance for it (OP) could very well have a bit of a &amp;quot;hangover&amp;quot;, for lack of a better term.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8p9fa", "score_hidden": false, "stickied": false, "created": 1492169588.0, "created_utc": 1492140788.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8c4i8", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "FullMoonMother", "parent_id": "t1_dg891rc", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You obviously don't understand the implications that trazadone can have on individuals, especially minors. Even so, the fact remains that OP was illegally drugged. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You obviously don&amp;#39;t understand the implications that trazadone can have on individuals, especially minors. Even so, the fact remains that OP was illegally drugged. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8c4i8", "score_hidden": false, "stickied": false, "created": 1492151336.0, "created_utc": 1492122536.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg891rc", "gilded": 0, "archived": false, "score": -9, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_6524ee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg891rc", "score_hidden": false, "stickied": false, "created": 1492147426.0, "created_utc": 1492118626.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -9}}], "after": null, "before": null}}]