[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "legaladvice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Backstory: The company I work for has a lot of perks, the biggest of which is fully paid health insurance premiums. However, the last few months there has been a lot of speculation as to the company&amp;#39;s financial position. Financial statements used to be shared with all levels of employees and they have recently become private. There are &amp;quot;business expenses&amp;quot; that aren&amp;#39;t justifiably business related. Admin access and management positions have been gutted so that even fewer people have access to sensitive information. So on and so forth. &lt;/p&gt;\n\n&lt;p&gt;Now for the meat and potatoes. I recently learned that there is a chance I may have cancer. I requested my time off for doctor appointments and such with no explanation because I wanted to keep it private. However, when my most recent request for time off was ignored, I had to disclose the reason to my employer so they would grant the time off. &lt;/p&gt;\n\n&lt;p&gt;Two days after disclosing I may have cancer, my boss asks for a meeting. In the meeting they say that they&amp;#39;ve noticed some performance issues and that they&amp;#39;ve gotten feedback from other employees that my competency is in question and that I lack relationships with my coworkers. I have never been reprimanded for performance issues in any job I&amp;#39;ve held and have very strong relationships with nearly all my coworkers. When I asked for examples for what my boss was saying, I got the run around. I confided in a coworker who spoke privately to one of the managers. The manager said they were not aware of any such opinions of me and encouraged a meeting with our Chief of Operations (COO) as soon as possible. I emailed the COO and we are meeting next week. &lt;/p&gt;\n\n&lt;p&gt;Considering the lack of examples of incompetency and poor work relationships coupled with the fact that the company has come under financial scrutiny and pays for my healthcare premiums, the timing of this meeting and learning of my health issues has me seriously questioning the legitimacy of my employer&amp;#39;s word. &lt;/p&gt;\n\n&lt;p&gt;What are my options if I am fired? Would this be considered wrongful termination even though Missouri is an at-will state? What steps can I take to put myself in the best position possible? &lt;/p&gt;\n\n&lt;p&gt;UPDATE: Thanks for all the support! I had my biopsy done a couple days ago and should get the results soon. I have a meeting with our COO on the books and a separate meeting scheduled with a manager. The manager in particular has said he&amp;#39;s on my side and is willing to defend me and the coworker who also came to my defense. My current goals are as follows:&lt;/p&gt;\n\n&lt;p&gt;1) Gauge how likely it is that all this is directly related to my health issues and not just a poorly-timed coincidence \n2) Deescalate the situation\n3) Inquire about another position within the company that would make the cool manager my direct supervisor. I could look at other places but frankly given my health issues I do not want to risk losing my insurance unless I absolutely have to.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll post another update after my meetings! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Backstory: The company I work for has a lot of perks, the biggest of which is fully paid health insurance premiums. However, the last few months there has been a lot of speculation as to the company's financial position. Financial statements used to be shared with all levels of employees and they have recently become private. There are \"business expenses\" that aren't justifiably business related. Admin access and management positions have been gutted so that even fewer people have access to sensitive information. So on and so forth. \n\nNow for the meat and potatoes. I recently learned that there is a chance I may have cancer. I requested my time off for doctor appointments and such with no explanation because I wanted to keep it private. However, when my most recent request for time off was ignored, I had to disclose the reason to my employer so they would grant the time off. \n\nTwo days after disclosing I may have cancer, my boss asks for a meeting. In the meeting they say that they've noticed some performance issues and that they've gotten feedback from other employees that my competency is in question and that I lack relationships with my coworkers. I have never been reprimanded for performance issues in any job I've held and have very strong relationships with nearly all my coworkers. When I asked for examples for what my boss was saying, I got the run around. I confided in a coworker who spoke privately to one of the managers. The manager said they were not aware of any such opinions of me and encouraged a meeting with our Chief of Operations (COO) as soon as possible. I emailed the COO and we are meeting next week. \n\nConsidering the lack of examples of incompetency and poor work relationships coupled with the fact that the company has come under financial scrutiny and pays for my healthcare premiums, the timing of this meeting and learning of my health issues has me seriously questioning the legitimacy of my employer's word. \n\nWhat are my options if I am fired? Would this be considered wrongful termination even though Missouri is an at-will state? What steps can I take to put myself in the best position possible? \n\nUPDATE: Thanks for all the support! I had my biopsy done a couple days ago and should get the results soon. I have a meeting with our COO on the books and a separate meeting scheduled with a manager. The manager in particular has said he's on my side and is willing to defend me and the coworker who also came to my defense. My current goals are as follows:\n\n1) Gauge how likely it is that all this is directly related to my health issues and not just a poorly-timed coincidence \n2) Deescalate the situation\n3) Inquire about another position within the company that would make the cool manager my direct supervisor. I could look at other places but frankly given my health issues I do not want to risk losing my insurance unless I absolutely have to.\n\nI'll post another update after my meetings! ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Employment Law", "id": "653xpp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 188, "report_reasons": null, "author": "lazyladylurker", "saved": false, "mod_reports": [], "name": "t3_653xpp", "subreddit_name_prefixed": "r/legaladvice", "approved_by": null, "over_18": false, "domain": "self.legaladvice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rawz", "edited": 1492300685.0, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/legaladvice/comments/653xpp/missouri_us_boss_learns_of_my_medical_issues_2/", "num_reports": null, "locked": false, "stickied": false, "created": 1492095282.0, "url": "https://www.reddit.com/r/legaladvice/comments/653xpp/missouri_us_boss_learns_of_my_medical_issues_2/", "author_flair_text": null, "quarantine": false, "title": "Missouri, US - Boss learns of my medical issues, 2 days later boss implies I'm on thin ice", "created_utc": 1492066482.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 25, "visited": false, "subreddit_type": "public", "ups": 188}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": "", "user_reports": [], "id": "dgbdout", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lazyladylurker", "parent_id": "t1_dg7ig3n", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Absolutely. I've been so stressed about trying to be perfect the last few days, but I know I can't afford anything less. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely. I&amp;#39;ve been so stressed about trying to be perfect the last few days, but I know I can&amp;#39;t afford anything less. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgbdout", "score_hidden": false, "stickied": false, "created": 1492329588.0, "created_utc": 1492300788.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ig3n", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "horsenbuggy", "parent_id": "t1_dg7cfa8", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "In the meantime, you better cross all your Ts and dot all your Is. If they're looking to get rid of you, don't hand them a reason to, even if it's a soft reason or one they've ignored in the past.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the meantime, you better cross all your Ts and dot all your Is. If they&amp;#39;re looking to get rid of you, don&amp;#39;t hand them a reason to, even if it&amp;#39;s a soft reason or one they&amp;#39;ve ignored in the past.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7ig3n", "score_hidden": false, "stickied": false, "created": 1492117629.0, "created_utc": 1492088829.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": "", "user_reports": [], "id": "dgbdqud", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lazyladylurker", "parent_id": "t1_dg7jt4o", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Wow, it's terrible that happened to you. Thanks for sharing! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, it&amp;#39;s terrible that happened to you. Thanks for sharing! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgbdqud", "score_hidden": false, "stickied": false, "created": 1492329663.0, "created_utc": 1492300863.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jt4o", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "drainbameged", "parent_id": "t1_dg7cfa8", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Make sure to have a few copies of everything, keep in mind if you are terminated you will loose access to anything associated with your work credentials. I was terminated, for \"poor performance\" once after reporting some ethical issues. Because I saved everything externally I was able to negotiate a very nice severance package which included insurance and a hand written reference from the VP of my division.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make sure to have a few copies of everything, keep in mind if you are terminated you will loose access to anything associated with your work credentials. I was terminated, for &amp;quot;poor performance&amp;quot; once after reporting some ethical issues. Because I saved everything externally I was able to negotiate a very nice severance package which included insurance and a hand written reference from the VP of my division.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7jt4o", "score_hidden": false, "stickied": false, "created": 1492119527.0, "created_utc": 1492090727.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": "", "user_reports": [], "id": "dg7mcfj", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "clduab11", "parent_id": "t1_dg7cfa8", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Piggybacking to say to back them offsite and not just keep copies within your office/work/work email/etc. save them to a personal cloud or print them out and take them home with you (of course, use your best judgment and ensure you're not violating company policy by taking its internal documents outside the office).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Piggybacking to say to back them offsite and not just keep copies within your office/work/work email/etc. save them to a personal cloud or print them out and take them home with you (of course, use your best judgment and ensure you&amp;#39;re not violating company policy by taking its internal documents outside the office).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7mcfj", "score_hidden": false, "stickied": false, "created": 1492122682.0, "created_utc": 1492093882.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7cfa8", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "lazyladylurker", "parent_id": "t1_dg7brgq", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you, that is all good information. I have saved all emails and online conversations so far for this reason and will do my best to have all future interactions backed up in writing as well. I've also requested a meeting with the manager mentioned in my post. I want to ensure my coworker is safe from retaliation for sticking up for me and I'd also like to see if they'd be willing to help defend me if needed. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, that is all good information. I have saved all emails and online conversations so far for this reason and will do my best to have all future interactions backed up in writing as well. I&amp;#39;ve also requested a meeting with the manager mentioned in my post. I want to ensure my coworker is safe from retaliation for sticking up for me and I&amp;#39;d also like to see if they&amp;#39;d be willing to help defend me if needed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7cfa8", "score_hidden": false, "stickied": false, "created": 1492104009.0, "created_utc": 1492075209.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": "", "user_reports": [], "id": "dg7i5lc", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "IDontEvenKnowles", "parent_id": "t1_dg7brgq", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I want to add that if you go through the EEOC you can also request a right to sue letter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to add that if you go through the EEOC you can also request a right to sue letter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7i5lc", "score_hidden": false, "stickied": false, "created": 1492117190.0, "created_utc": 1492088390.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7brgq", "gilded": 0, "archived": false, "score": 146, "report_reasons": null, "author": "Zer0Summoner", "parent_id": "t3_653xpp", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "The federal ADA trumps at-willness, also any state version of the ADA. If you are fired, you can go to the EEOC or the state version of it. They will investigate, and if they think you have a case, they will sue on your behalf. If they don't think you have a case, they will give you a \"right to sue\" letter, and then you can sue the company yourself. \n\nYou would need to establish a prima facie case. This can be done by showing that you were a good employee, they became aware of your medical issues, then they took an adverse action against you. The burden then shifts to the company to plead non-discriminatory reasons for the adverse action. If they do, then it shifts back to you again to prove, by a preponderance (51%) that those reasons are pretextual (made up in order to protect themselves from your claim). This can be done by testimony from coworkers and managers that the things the company said were false, or documents that show your good work history and argument about the company's failure or inability to show documented incidents, or other means. Then the fact finder, be it judge or jury, will decide who they believe.\n\n\nTo out yourself in the best position possible, keep ALL relevant documents that you're allowed to keep. If it turns out you shouldn't have, your lawyer will know what to do. Also make sure you have contact information for anyone you may need to depose. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The federal ADA trumps at-willness, also any state version of the ADA. If you are fired, you can go to the EEOC or the state version of it. They will investigate, and if they think you have a case, they will sue on your behalf. If they don&amp;#39;t think you have a case, they will give you a &amp;quot;right to sue&amp;quot; letter, and then you can sue the company yourself. &lt;/p&gt;\n\n&lt;p&gt;You would need to establish a prima facie case. This can be done by showing that you were a good employee, they became aware of your medical issues, then they took an adverse action against you. The burden then shifts to the company to plead non-discriminatory reasons for the adverse action. If they do, then it shifts back to you again to prove, by a preponderance (51%) that those reasons are pretextual (made up in order to protect themselves from your claim). This can be done by testimony from coworkers and managers that the things the company said were false, or documents that show your good work history and argument about the company&amp;#39;s failure or inability to show documented incidents, or other means. Then the fact finder, be it judge or jury, will decide who they believe.&lt;/p&gt;\n\n&lt;p&gt;To out yourself in the best position possible, keep ALL relevant documents that you&amp;#39;re allowed to keep. If it turns out you shouldn&amp;#39;t have, your lawyer will know what to do. Also make sure you have contact information for anyone you may need to depose. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7brgq", "score_hidden": false, "stickied": false, "created": 1492101974.0, "created_utc": 1492073174.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 146}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": "", "user_reports": [], "id": "dg7pc5i", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "pimphandofthrawn", "parent_id": "t1_dg7jgeh", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "God bless America", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;God bless America&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7pc5i", "score_hidden": false, "stickied": false, "created": 1492126028.0, "created_utc": 1492097228.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jgeh", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "getsweirdfast", "parent_id": "t1_dg7j0ho", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "It's not uncommon for companies in financial trouble to fire people who may have years of experience (meaning higher salaries) and then hire entry level people who will work for less in those same positions. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not uncommon for companies in financial trouble to fire people who may have years of experience (meaning higher salaries) and then hire entry level people who will work for less in those same positions. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7jgeh", "score_hidden": false, "stickied": false, "created": 1492119054.0, "created_utc": 1492090254.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": "", "user_reports": [], "id": "dg8iwwn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lazyladylurker", "parent_id": "t1_dg7j0ho", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "They demoted a lot of people in management and restructured so there were fewer management positions. They didn't necessarily fire them, they just got rid of their access to certain information. The constant hiring is another source of financial concern for a lot of us though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They demoted a lot of people in management and restructured so there were fewer management positions. They didn&amp;#39;t necessarily fire them, they just got rid of their access to certain information. The constant hiring is another source of financial concern for a lot of us though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8iwwn", "score_hidden": false, "stickied": false, "created": 1492160489.0, "created_utc": 1492131689.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7j0ho", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "u-void", "parent_id": "t1_dg7cpra", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "In your post you stated they are currently gutting many positions, but they are hiring more people for other positions faster than they're closing them?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In your post you stated they are currently gutting many positions, but they are hiring more people for other positions faster than they&amp;#39;re closing them?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7j0ho", "score_hidden": false, "stickied": false, "created": 1492118451.0, "created_utc": 1492089651.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7cpra", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "lazyladylurker", "parent_id": "t1_dg7cdui", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "No worries. We are really close to the cut off and we are currently hiring. I'll keep an eye on it and make my move if we reach the threshold before I'm booted. Thanks for bringing it to my attention! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No worries. We are really close to the cut off and we are currently hiring. I&amp;#39;ll keep an eye on it and make my move if we reach the threshold before I&amp;#39;m booted. Thanks for bringing it to my attention! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7cpra", "score_hidden": false, "stickied": false, "created": 1492104901.0, "created_utc": 1492076101.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": "", "user_reports": [], "id": "dg7m25e", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "TzarKazm", "parent_id": "t1_dg7k1di", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I'm not saying it's right, but the thought is that at a certain size, allowing FMLA could cripple a company.    Picture a little Shop with an owner and an employee.  The employee has to be out for several weeks.  Does the employer work every day,  16 hours a day? Do they close early every day?  What if the owner is sick a couple days too? These kind of things can break a small business. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not saying it&amp;#39;s right, but the thought is that at a certain size, allowing FMLA could cripple a company.    Picture a little Shop with an owner and an employee.  The employee has to be out for several weeks.  Does the employer work every day,  16 hours a day? Do they close early every day?  What if the owner is sick a couple days too? These kind of things can break a small business. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7m25e", "score_hidden": false, "stickied": false, "created": 1492122345.0, "created_utc": 1492093545.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7k1di", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Krooked_Kangaroo", "parent_id": "t1_dg7cdui", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I don't understand why everyone isn't protected under such basic worker rights provisions?\n\nWhy do employees working for companies with less than 50 people not have the same rights?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t understand why everyone isn&amp;#39;t protected under such basic worker rights provisions?&lt;/p&gt;\n\n&lt;p&gt;Why do employees working for companies with less than 50 people not have the same rights?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7k1di", "score_hidden": false, "stickied": false, "created": 1492119829.0, "created_utc": 1492091029.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7cdui", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "just_the_tech", "parent_id": "t1_dg7cc1z", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Ah, dang.  Sorry to get your hopes up; 50 is the cutoff.\n\nhttps://en.wikipedia.org/wiki/Family_and_Medical_Leave_Act_of_1993#Non-eligible_workers_and_types_of_leave", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah, dang.  Sorry to get your hopes up; 50 is the cutoff.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Family_and_Medical_Leave_Act_of_1993#Non-eligible_workers_and_types_of_leave\"&gt;https://en.wikipedia.org/wiki/Family_and_Medical_Leave_Act_of_1993#Non-eligible_workers_and_types_of_leave&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7cdui", "score_hidden": false, "stickied": false, "created": 1492103883.0, "created_utc": 1492075083.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7cc1z", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "lazyladylurker", "parent_id": "t1_dg7c2xl", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you! I didn't even think of FMLA. We have fewer than 50 employees so I think there may be some limitations there, but I should definitely explore it! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! I didn&amp;#39;t even think of FMLA. We have fewer than 50 employees so I think there may be some limitations there, but I should definitely explore it! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7cc1z", "score_hidden": false, "stickied": false, "created": 1492103733.0, "created_utc": 1492074933.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7c2xl", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "just_the_tech", "parent_id": "t3_653xpp", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You should establish FMLA status immediately; r/askHR should be able to help with that.  By doing so, you gain the federally protected class of serious illness.  It won't give you any paid time off (you will still need to use your sick time or PTO or whatever, even possible short term disability), but it WILL protect your position for absences of a significant chunk of the year.\n\nIt requires you to fill out a form signifying that you meet certain medical test of severe illness, and a second form that you have your doctor certify.  This can be done without disclosing what the condition is; just that there is a qualifying condition, and your doctor confirms it applies to you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should establish FMLA status immediately; &lt;a href=\"/r/askHR\"&gt;r/askHR&lt;/a&gt; should be able to help with that.  By doing so, you gain the federally protected class of serious illness.  It won&amp;#39;t give you any paid time off (you will still need to use your sick time or PTO or whatever, even possible short term disability), but it WILL protect your position for absences of a significant chunk of the year.&lt;/p&gt;\n\n&lt;p&gt;It requires you to fill out a form signifying that you meet certain medical test of severe illness, and a second form that you have your doctor certify.  This can be done without disclosing what the condition is; just that there is a qualifying condition, and your doctor confirms it applies to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7c2xl", "score_hidden": false, "stickied": false, "created": 1492102951.0, "created_utc": 1492074151.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": "", "user_reports": [], "id": "dg8l0gl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SandpaperScrew", "parent_id": "t1_dg8itdx", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Welp, that explains it. Employees are often considered liabilities if they don't live, breathe and cuddle their job 24/7.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Welp, that explains it. Employees are often considered liabilities if they don&amp;#39;t live, breathe and cuddle their job 24/7.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8l0gl", "score_hidden": false, "stickied": false, "created": 1492163383.0, "created_utc": 1492134583.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8itdx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lazyladylurker", "parent_id": "t1_dg7m1mh", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "About the same area as Branson actually. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;About the same area as Branson actually. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8itdx", "score_hidden": false, "stickied": false, "created": 1492160356.0, "created_utc": 1492131556.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7m1mh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SandpaperScrew", "parent_id": "t1_dg7emam", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Just curious, what part of MO are you in? I'm in northern AR right under Branson and places around here do some of the same things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just curious, what part of MO are you in? I&amp;#39;m in northern AR right under Branson and places around here do some of the same things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7m1mh", "score_hidden": false, "stickied": false, "created": 1492122328.0, "created_utc": 1492093528.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7emam", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "lazyladylurker", "parent_id": "t1_dg7e2jg", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "That means a lot. :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That means a lot. :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7emam", "score_hidden": false, "stickied": false, "created": 1492110419.0, "created_utc": 1492081619.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7e2jg", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "brownbutterquiche", "parent_id": "t3_653xpp", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "No legal advice, just wishing you all the best. Fuck cancer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No legal advice, just wishing you all the best. Fuck cancer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg7e2jg", "score_hidden": false, "stickied": false, "created": 1492108936.0, "created_utc": 1492080136.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_653xpp", "likes": null, "replies": "", "user_reports": [], "id": "dg8iuc9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lazyladylurker", "parent_id": "t1_dg8hrmw", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Best of luck to her!\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Best of luck to her!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8iuc9", "score_hidden": false, "stickied": false, "created": 1492160392.0, "created_utc": 1492131592.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8hrmw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "stephoswalk", "parent_id": "t3_653xpp", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you for posting this and thank you for everyone giving advice. My mother in law was just fired from her job yesterday. She's never had a write up or any problems at work but recently she was diagnosed with cancer. (Luckily, they got it all and she doesn't need chemotherapy.) Your post caught my eye and I sent her a link. She had no idea what to do and was unprepared since there was no warning.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for posting this and thank you for everyone giving advice. My mother in law was just fired from her job yesterday. She&amp;#39;s never had a write up or any problems at work but recently she was diagnosed with cancer. (Luckily, they got it all and she doesn&amp;#39;t need chemotherapy.) Your post caught my eye and I sent her a link. She had no idea what to do and was unprepared since there was no warning.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8hrmw", "score_hidden": false, "stickied": false, "created": 1492158934.0, "created_utc": 1492130134.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]