[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "legaladvice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;EDIT: Thank you all so much for your help, advice and tips! I believe I have collected all the information I needed, however, you never you need something until you don&amp;#39;t have it. So if any new commenters or previous commenters have any more tips, suggestions or help feel free to post it. Thanks again for all your help!&lt;/p&gt;\n\n&lt;p&gt;Alright....This is a bad situation and a very complicated one but we are in desperate need of help.&lt;/p&gt;\n\n&lt;p&gt;I live in Utah as does my soon to be roommate, neither of us are Mormon but his parents are and they are absolutely insane. He forgot to pay his tithing (10% of your money you can choose to donate to the church, standard in Christian churches) to the church for one week so his parents locked his bank account and are forcefully moving his money into savings and tithing, the money he needs to move out.&lt;/p&gt;\n\n&lt;p&gt;If that&amp;#39;s not enough to show you how crazy they are, he suggested that he might want to move out and they screamed at him for over an hour (while i waited in the car, we we&amp;#39;re supposed to go to a movie), for even suggesting the idea of leaving them, he once was 7 minutes late to class so they shut off his phone, he scored a 98% on a math final and they took away his bed and door. They have also done things like his dad physically forces him into cold showers when he says things they don&amp;#39;t agree with and other crazy disciplines that other parents have gotten accused of child abuse for....&lt;/p&gt;\n\n&lt;p&gt;That should be enough to explain what kind of crazy they are. This is our situation...He is 18 and can move out whenever he damn well feels like it but since his parents are so crazy we don&amp;#39;t want them to know where my apartment is. So on a Sunday he is going to sneak out of church, run home, i&amp;#39;m gonna meet him there, we are gonna throw his clothes in my car and leave. He&amp;#39;s leaving all his other stuff, i&amp;#39;ve bought a bed for him but thats all he&amp;#39;ll have. We don&amp;#39;t have time to bring anything else.&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s leaving his truck there because its in their name and we don&amp;#39;t want them to accuse us of Stolen Property, we&amp;#39;re leaving a note for the parents saying that he left to come live with me willingly (which again he can do being over 18) and we carefully went through everything, down to every shirt and sock he had to determine what he paid for and what they paid for so we are careful not to &amp;quot;steal&amp;quot; anything.&lt;/p&gt;\n\n&lt;p&gt;This is what we need to know.&lt;/p&gt;\n\n&lt;p&gt;1) Is there anything they can do to force him to come back?&lt;/p&gt;\n\n&lt;p&gt;2) I heard something about parents not being allowed to kick you off medical insurance &amp;#39;til you&amp;#39;re 25, is this true? If so, is this true in Utah?&lt;/p&gt;\n\n&lt;p&gt;3) If they show up at his school and force him to come back, could I file a viable police report for kidnapping? That wouldn&amp;#39;t be a false police report right?&lt;/p&gt;\n\n&lt;p&gt;4) We can go into his bank, switch the account to an adult account instead of a child one and withdraw all his money in cash, is there anything wrong with this plan? I don&amp;#39;t want to break any laws. (we except fees but neither of us see any laws being broken)&lt;/p&gt;\n\n&lt;p&gt;5) How easily can i get a restraining order? Because his parents will try to track him down and if they find us I need to be able to threaten them with something.&lt;/p&gt;\n\n&lt;p&gt;6) If i tell someone to leave my apartment and that they are not welcome to come back or communicate with either of us, am i allowed to take forceful physical action against them legally? I own an AR-15, I don&amp;#39;t plan to shoot anyone, if theres any conflict it&amp;#39;ll be a fist fight, would this be allowed? His dad is also a very big dude who doesn&amp;#39;t take no for an answer, so on the slight chance it escalates to the point where I&amp;#39;m forced, for my health and safety to fight him (or god forbid, shoot him), are there any legal repercussions i should expect?&lt;/p&gt;\n\n&lt;p&gt;7) If we leave a note and they file a kidnapping or missing person report anyway (which they are crazy enough to do), how do i counteract that? Filing a false police report is a crime i know that, but what do I need to do to tell the cops that he&amp;#39;s with me, safe, by his own will, prove we left a note all without being tazed?&lt;/p&gt;\n\n&lt;p&gt;8) Lastly, is there anything they could do that would be considered within the law that can hurt us? He isn&amp;#39;t going to have belongings for them to take from him anymore, just his clothes. But is there anything they could charge us with legally or anything they could physically do that wouldn&amp;#39;t be against the law that could harm us?&lt;/p&gt;\n\n&lt;p&gt;Our Go-Time date is April 30th, 2017 at 10 A.M. \nThanks in advance for any help. Any help, tips and advice for anything listed above, anything related or anything we might have missed in our plan is welcome. Anything is appreciated. Thank you for your time.&lt;/p&gt;\n\n&lt;p&gt;EDIT: OKAY. I Think I need to clear things up. This plan is preparing for the worst because his parents have proven through their actions that they can and most likely will make any situation that they don&amp;#39;t agree with worse for everyone. I do not plan to fight them. I do not plan to invite them in my home, let alone invite them in and shoot them. I do not plan for them to see my firearm. I do not plan to take it out of its secure box. I do not plan to assault anyone in any way. I do not plan to be rude or confrontational. \nIf anything its his DAD that needs to grow up. His dad runs straight to fighting physically, he has in the past, he will in the future. His dad is a violent person. His dad has, in the past, tried to assault me. They do not like me. All of what I said about a gun, legal consequences for shooting, fighting, anything along those lines, I am just getting information for because his dad has swung at me before and its likely he will again and I don&amp;#39;t know how severe it will be. I am JUST PREPARING.&lt;/p&gt;\n\n&lt;p&gt;I am a safe gun owner, I have been using firearms at ranges and hunting since I was a child. I&amp;#39;ve gone through multiple classes, the gun is locked up, I know how to handle a firearm and when and when not to use it. I&amp;#39;ve only EVER had to draw one of my firearms 3 times in my life, all 3 times my life was in critical danger. And yes, i know what critical danger means. My life was threatened on 3 separate occasions, twice by the same violent felon and once in Atlanta where the other guy had a firearm chambered and aimed at me. Alright? I do not need to sell my gun, i do not need to give it away or put it in storage. I appreciate your concern, it was my fault for not clarifying this in the first place. Sorry for the confusion.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "EDIT: Thank you all so much for your help, advice and tips! I believe I have collected all the information I needed, however, you never you need something until you don't have it. So if any new commenters or previous commenters have any more tips, suggestions or help feel free to post it. Thanks again for all your help!\n\nAlright....This is a bad situation and a very complicated one but we are in desperate need of help.\n\nI live in Utah as does my soon to be roommate, neither of us are Mormon but his parents are and they are absolutely insane. He forgot to pay his tithing (10% of your money you can choose to donate to the church, standard in Christian churches) to the church for one week so his parents locked his bank account and are forcefully moving his money into savings and tithing, the money he needs to move out.\n\nIf that's not enough to show you how crazy they are, he suggested that he might want to move out and they screamed at him for over an hour (while i waited in the car, we we're supposed to go to a movie), for even suggesting the idea of leaving them, he once was 7 minutes late to class so they shut off his phone, he scored a 98% on a math final and they took away his bed and door. They have also done things like his dad physically forces him into cold showers when he says things they don't agree with and other crazy disciplines that other parents have gotten accused of child abuse for....\n\nThat should be enough to explain what kind of crazy they are. This is our situation...He is 18 and can move out whenever he damn well feels like it but since his parents are so crazy we don't want them to know where my apartment is. So on a Sunday he is going to sneak out of church, run home, i'm gonna meet him there, we are gonna throw his clothes in my car and leave. He's leaving all his other stuff, i've bought a bed for him but thats all he'll have. We don't have time to bring anything else.\n\nHe's leaving his truck there because its in their name and we don't want them to accuse us of Stolen Property, we're leaving a note for the parents saying that he left to come live with me willingly (which again he can do being over 18) and we carefully went through everything, down to every shirt and sock he had to determine what he paid for and what they paid for so we are careful not to \"steal\" anything.\n\nThis is what we need to know.\n\n1) Is there anything they can do to force him to come back?\n\n2) I heard something about parents not being allowed to kick you off medical insurance 'til you're 25, is this true? If so, is this true in Utah?\n\n3) If they show up at his school and force him to come back, could I file a viable police report for kidnapping? That wouldn't be a false police report right?\n\n4) We can go into his bank, switch the account to an adult account instead of a child one and withdraw all his money in cash, is there anything wrong with this plan? I don't want to break any laws. (we except fees but neither of us see any laws being broken)\n\n5) How easily can i get a restraining order? Because his parents will try to track him down and if they find us I need to be able to threaten them with something.\n\n6) If i tell someone to leave my apartment and that they are not welcome to come back or communicate with either of us, am i allowed to take forceful physical action against them legally? I own an AR-15, I don't plan to shoot anyone, if theres any conflict it'll be a fist fight, would this be allowed? His dad is also a very big dude who doesn't take no for an answer, so on the slight chance it escalates to the point where I'm forced, for my health and safety to fight him (or god forbid, shoot him), are there any legal repercussions i should expect?\n\n7) If we leave a note and they file a kidnapping or missing person report anyway (which they are crazy enough to do), how do i counteract that? Filing a false police report is a crime i know that, but what do I need to do to tell the cops that he's with me, safe, by his own will, prove we left a note all without being tazed?\n\n8) Lastly, is there anything they could do that would be considered within the law that can hurt us? He isn't going to have belongings for them to take from him anymore, just his clothes. But is there anything they could charge us with legally or anything they could physically do that wouldn't be against the law that could harm us?\n\nOur Go-Time date is April 30th, 2017 at 10 A.M. \nThanks in advance for any help. Any help, tips and advice for anything listed above, anything related or anything we might have missed in our plan is welcome. Anything is appreciated. Thank you for your time.\n\nEDIT: OKAY. I Think I need to clear things up. This plan is preparing for the worst because his parents have proven through their actions that they can and most likely will make any situation that they don't agree with worse for everyone. I do not plan to fight them. I do not plan to invite them in my home, let alone invite them in and shoot them. I do not plan for them to see my firearm. I do not plan to take it out of its secure box. I do not plan to assault anyone in any way. I do not plan to be rude or confrontational. \nIf anything its his DAD that needs to grow up. His dad runs straight to fighting physically, he has in the past, he will in the future. His dad is a violent person. His dad has, in the past, tried to assault me. They do not like me. All of what I said about a gun, legal consequences for shooting, fighting, anything along those lines, I am just getting information for because his dad has swung at me before and its likely he will again and I don't know how severe it will be. I am JUST PREPARING.\n\nI am a safe gun owner, I have been using firearms at ranges and hunting since I was a child. I've gone through multiple classes, the gun is locked up, I know how to handle a firearm and when and when not to use it. I've only EVER had to draw one of my firearms 3 times in my life, all 3 times my life was in critical danger. And yes, i know what critical danger means. My life was threatened on 3 separate occasions, twice by the same violent felon and once in Atlanta where the other guy had a firearm chambered and aimed at me. Alright? I do not need to sell my gun, i do not need to give it away or put it in storage. I appreciate your concern, it was my fault for not clarifying this in the first place. Sorry for the confusion.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657tr4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 217, "report_reasons": null, "author": "fsck-this", "saved": false, "mod_reports": [], "name": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "approved_by": null, "over_18": false, "domain": "self.legaladvice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rawz", "edited": 1492189853.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/legaladvice/comments/657tr4/utah_my_19m_soontobe_roommate_18m_is_being/", "num_reports": null, "locked": false, "stickied": false, "created": 1492141657.0, "url": "https://www.reddit.com/r/legaladvice/comments/657tr4/utah_my_19m_soontobe_roommate_18m_is_being/", "author_flair_text": null, "quarantine": false, "title": "[Utah] My (19/m) Soon-to-be Roommate (18/m) is being restricted by parents, what can we do?", "created_utc": 1492112857.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 122, "visited": false, "subreddit_type": "public", "ups": 217}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9uitz", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "AtomicSamuraiCyborg", "parent_id": "t1_dg9sk48", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Shit, you're right. Well at least it should be a qualifying event for him to get new insurance. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shit, you&amp;#39;re right. Well at least it should be a qualifying event for him to get new insurance. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9uitz", "score_hidden": false, "stickied": false, "created": 1492237150.0, "created_utc": 1492208350.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9sk48", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "elizabethan", "parent_id": "t1_dg9mgt9", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Anyone can discontinue insurance for their dependents without a qualifying event. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anyone can discontinue insurance for their dependents without a qualifying event. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9sk48", "score_hidden": false, "stickied": false, "created": 1492234592.0, "created_utc": 1492205792.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9mgt9", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "AtomicSamuraiCyborg", "parent_id": "t1_dg9gaau", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 1, "body": "Yeah, he could in that instance. But I don't think they can drop him until their open enrollment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, he could in that instance. But I don&amp;#39;t think they can drop him until their open enrollment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9mgt9", "score_hidden": false, "stickied": false, "created": 1492227133.0, "created_utc": 1492198333.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9gaau", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "KBCme", "parent_id": "t1_dg9f0xi", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Oh, I meant if the parents drop him. Losing other coverage is a qualifying event. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, I meant if the parents drop him. Losing other coverage is a qualifying event. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9gaau", "score_hidden": false, "stickied": false, "created": 1492219778.0, "created_utc": 1492190978.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 36}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9f0xi", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "AtomicSamuraiCyborg", "parent_id": "t1_dg8mlw9", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I worked in health insurance customer service for awhile, him moving out isn't usually a qualifying event. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I worked in health insurance customer service for awhile, him moving out isn&amp;#39;t usually a qualifying event. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9f0xi", "score_hidden": false, "stickied": false, "created": 1492218324.0, "created_utc": 1492189524.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mlw9", "gilded": 0, "archived": false, "score": 105, "report_reasons": null, "author": "KBCme", "parent_id": "t1_dg8ef0q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Actually, if his parents drop him when he moves out it becomes a qualifying 'event' and he can enroll at that time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually, if his parents drop him when he moves out it becomes a qualifying &amp;#39;event&amp;#39; and he can enroll at that time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8mlw9", "score_hidden": false, "stickied": false, "created": 1492165624.0, "created_utc": 1492136824.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 105}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg8ldls", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "Elfich47", "parent_id": "t1_dg8ef0q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "File a change of address to the PO box. From what you said above the parents will \"forget to forward his mail\" ie withhold his mail until your roomie goes to get it. He will then have to deal with the folks on their terms.\n\nEdit: Gods I'm a dope tonight.", "edited": 1492135889.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;File a change of address to the PO box. From what you said above the parents will &amp;quot;forget to forward his mail&amp;quot; ie withhold his mail until your roomie goes to get it. He will then have to deal with the folks on their terms.&lt;/p&gt;\n\n&lt;p&gt;Edit: Gods I&amp;#39;m a dope tonight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8ldls", "score_hidden": false, "stickied": false, "created": 1492163891.0, "created_utc": 1492135091.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dgacf84", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "free-state", "parent_id": "t1_dga2cba", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You could also get a Protective Order from a judge. Don't get a Restraining order - it's practically useless in Utah.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could also get a Protective Order from a judge. Don&amp;#39;t get a Restraining order - it&amp;#39;s practically useless in Utah.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgacf84", "score_hidden": false, "stickied": false, "created": 1492263559.0, "created_utc": 1492234759.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dga2cba", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "MarkNutt25", "parent_id": "t1_dg9hv71", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Absolutely this! \n\nAlso, if it starts looking like the door won't hold, go into another room and lock that door too. Ideally, go into the master bedroom, lock the door behind you, then go into the master bath and lock that door too. Put as many barriers as possible between you and that confrontation. Give the police as much time as possible for them to handle it, its what they're trained to do!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely this! &lt;/p&gt;\n\n&lt;p&gt;Also, if it starts looking like the door won&amp;#39;t hold, go into another room and lock that door too. Ideally, go into the master bedroom, lock the door behind you, then go into the master bath and lock that door too. Put as many barriers as possible between you and that confrontation. Give the police as much time as possible for them to handle it, its what they&amp;#39;re trained to do!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dga2cba", "score_hidden": false, "stickied": false, "created": 1492247596.0, "created_utc": 1492218796.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9hv71", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "fooliam", "parent_id": "t1_dg8pfjn", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt;  then I will open it and make it very clear to them that they are not welcome at or in my home and that the police are on the way\n\nDumb.  Fucking.  Idea.  Let them damage the door and wait for the police to show up, then sue them for any replacement costs.  By opening the door you are asking for a violent altercation which would have an incredibly unpredictable outcome, which could very well land you in jail, could land you in the hospital, or could wind up with someone dead.  Don't.  Be.  Fucking.  Stupid.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;then I will open it and make it very clear to them that they are not welcome at or in my home and that the police are on the way&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Dumb.  Fucking.  Idea.  Let them damage the door and wait for the police to show up, then sue them for any replacement costs.  By opening the door you are asking for a violent altercation which would have an incredibly unpredictable outcome, which could very well land you in jail, could land you in the hospital, or could wind up with someone dead.  Don&amp;#39;t.  Be.  Fucking.  Stupid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9hv71", "score_hidden": false, "stickied": false, "created": 1492221614.0, "created_utc": 1492192814.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9by5q", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg92yjb", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Yeah I got him a phone and I'll be putting it on my cell plan, its cheaper for him that way, new emails, new number, new everything.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I got him a phone and I&amp;#39;ll be putting it on my cell plan, its cheaper for him that way, new emails, new number, new everything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9by5q", "score_hidden": false, "stickied": false, "created": 1492214895.0, "created_utc": 1492186095.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dgany6m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Daleth2", "parent_id": "t1_dga1ttn", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; if he doesn't want his parents to have your address, he needs to get a PO box. \n\nIn my experience PO boxes in conveniently located post offices are hard to find. Go to a UPS store or something like that--they usually have mailboxes you can rent. This is VERY IMPORTANT for someone in his position, who doesn't want his parents to be able to find him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;if he doesn&amp;#39;t want his parents to have your address, he needs to get a PO box. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In my experience PO boxes in conveniently located post offices are hard to find. Go to a UPS store or something like that--they usually have mailboxes you can rent. This is VERY IMPORTANT for someone in his position, who doesn&amp;#39;t want his parents to be able to find him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgany6m", "score_hidden": false, "stickied": false, "created": 1492293334.0, "created_utc": 1492264534.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga1ttn", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Erin1976", "parent_id": "t1_dg92yjb", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Agreed.  OP, if he doesn't want his parents to have your address, he needs to get a PO box.  All his parents have to do is send a letter to themselves with his name on it and \"Return Service Requested\" and the post office will send it back with a yellow sticker with his new address.\n\nThis is well-known to church members, as it's a common tactic to track down less active members.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed.  OP, if he doesn&amp;#39;t want his parents to have your address, he needs to get a PO box.  All his parents have to do is send a letter to themselves with his name on it and &amp;quot;Return Service Requested&amp;quot; and the post office will send it back with a yellow sticker with his new address.&lt;/p&gt;\n\n&lt;p&gt;This is well-known to church members, as it&amp;#39;s a common tactic to track down less active members.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dga1ttn", "score_hidden": false, "stickied": false, "created": 1492246886.0, "created_utc": 1492218086.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92yjb", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "unreliablepinwheel", "parent_id": "t1_dg8pfjn", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I don't know what the procedure is right now, but when I last filed a mail forwarding request, they sent a post card to my old address to let me know it was happening.  Same with all bank accounts and credit cards (though opening a new one with the new address on file won't trigger that). It may be because I did it online, but I had a post card with my old address and new address on it, which is basically all the info they would need.\n\nAlso, change his email password/iCloud password so they can't locate his new phone using old credentials if they have them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what the procedure is right now, but when I last filed a mail forwarding request, they sent a post card to my old address to let me know it was happening.  Same with all bank accounts and credit cards (though opening a new one with the new address on file won&amp;#39;t trigger that). It may be because I did it online, but I had a post card with my old address and new address on it, which is basically all the info they would need.&lt;/p&gt;\n\n&lt;p&gt;Also, change his email password/iCloud password so they can&amp;#39;t locate his new phone using old credentials if they have them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg92yjb", "score_hidden": false, "stickied": false, "created": 1492202684.0, "created_utc": 1492173884.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg96tpi", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Jilly_Bean16", "parent_id": "t1_dg96gkf", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You'll find that in every religion. There are some amazing catholic priests out there but you only hear about the ones who are touching altar boys. I know JWs that are caring and spiritual people and I know some that have a twisted view of reality and what is right. I grew up in the United Methodist church and there's hypocrisy and violence there too. What's ridiculous is when the people that insert their beliefs into everybody's lives around them make it their personal mission to squash opposition. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ll find that in every religion. There are some amazing catholic priests out there but you only hear about the ones who are touching altar boys. I know JWs that are caring and spiritual people and I know some that have a twisted view of reality and what is right. I grew up in the United Methodist church and there&amp;#39;s hypocrisy and violence there too. What&amp;#39;s ridiculous is when the people that insert their beliefs into everybody&amp;#39;s lives around them make it their personal mission to squash opposition. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg96tpi", "score_hidden": false, "stickied": false, "created": 1492208667.0, "created_utc": 1492179867.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg96wlo", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "jftitan", "parent_id": "t1_dg96gkf", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Upvote for having same experience.  This is often all too common.  But alike I know there are good bishops and good Mormons out there. \n\nI have a close friend in SLC Utah and he is an advocate for people in your roommate's situation. The advice is still legit, but you are absolutely right. \n\nI call it a crapshoot.  Roll me a seven!  The odds of that is about the same with finding a bishop what goes to bat for ya. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Upvote for having same experience.  This is often all too common.  But alike I know there are good bishops and good Mormons out there. &lt;/p&gt;\n\n&lt;p&gt;I have a close friend in SLC Utah and he is an advocate for people in your roommate&amp;#39;s situation. The advice is still legit, but you are absolutely right. &lt;/p&gt;\n\n&lt;p&gt;I call it a crapshoot.  Roll me a seven!  The odds of that is about the same with finding a bishop what goes to bat for ya. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg96wlo", "score_hidden": false, "stickied": false, "created": 1492208774.0, "created_utc": 1492179974.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg96gkf", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "ooogoodlawd", "parent_id": "t1_dg95lp2", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "This advice only works if you have a good bishop and a good leadership. I have had friends in Utah going to their bishops about their brothers raping them. The victims were blamed and their brothers went on church missions, bishop approved them to go. This was two separate friends in different Utah towns. \nDuring my time in ex Mormon forums as I escaped the church myself, I read horror stories of going to the bishop. I would never suggest someone leaving the church even attempt this route.\nI know many wonderful Mormons and wonderful Bishops. I'm not trying to say they are all bad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This advice only works if you have a good bishop and a good leadership. I have had friends in Utah going to their bishops about their brothers raping them. The victims were blamed and their brothers went on church missions, bishop approved them to go. This was two separate friends in different Utah towns. \nDuring my time in ex Mormon forums as I escaped the church myself, I read horror stories of going to the bishop. I would never suggest someone leaving the church even attempt this route.\nI know many wonderful Mormons and wonderful Bishops. I&amp;#39;m not trying to say they are all bad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg96gkf", "score_hidden": false, "stickied": false, "created": 1492208178.0, "created_utc": 1492179378.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dga1xth", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Erin1976", "parent_id": "t1_dg95lp2", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Under no circumstances should this guy give his bishop or any bishop the new address.  Contrary to popular belief, LDS bishops are not bound by confidentiality and are largely untrained in these types of situations.  This leads to what is known as \"leadership roulette.\"  The bishop could be sensitive or he could drive the kid's parents to the new address and participate in the intimidation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Under no circumstances should this guy give his bishop or any bishop the new address.  Contrary to popular belief, LDS bishops are not bound by confidentiality and are largely untrained in these types of situations.  This leads to what is known as &amp;quot;leadership roulette.&amp;quot;  The bishop could be sensitive or he could drive the kid&amp;#39;s parents to the new address and participate in the intimidation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dga1xth", "score_hidden": false, "stickied": false, "created": 1492247035.0, "created_utc": 1492218235.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95lp2", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "jftitan", "parent_id": "t1_dg933m1", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Until you want to leave, then that whole individualism ends and the whole group then goes out of their way to make your life miserable.  \n\nNot all Jehovah's are like that.  I'm just trying to help one right now where her whole family and her church up north (New York) are spreading the word about her leaving to everyone down here in Texas. \n\nMormons on the other hand, the bishop should be the only one to obtain the records of a member who moves into their ward. (And that is 'if' they are updated of a members move) I told my new bishop that I was no longer a member and wished to leave it at that.  I was invited to always be welcome to attend future Sundays and events.  I had a few calls over the years. But nothing that seemed like the whole fucking lot of them are out to make sure I remember I'm excommunicated and even my family wants me dead.  *Looking at JWs*\n\nFor OP, OP should report this whole situation to the bishop his roommate ward(church) his parents belong to. If not the bishop but a first or second counselor.  By phone or email.  His parents actions are very much frowned upon. If these people are temple recommended, then that can be pulled for their behavior. At least a few meetings with the bishop.\n\nI know from personal experience if that process doesn't work, the you hit up the high priests (stake) president, and get this reported up the chain.  They should help with roommates parent's behaving like grown adults. \n\nIf all those avenues fail to set the parents straight, then essentially calling the church a \"crapshoot\" is where I left off.  As a ex-mormon, the whole situation on my end was getting the church to remind my father to \"grow the fuck up\".  By the time my father left the family the whole church pretty much took a blind eye to our family's situation.  We reported the problems throughout the years and with no help from those who knew better.  Then when it all blew up and my father left, then the church opened up with arms wide open to help.  Not that I blame them, I just saw the 'pick n choose' mentality of morals. \n\nI met a few JWs throughout the years, and I still to this day do not know why one took it upon herself to make it her life mission to \"save\" me. \n\n/Sorry for long post \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Until you want to leave, then that whole individualism ends and the whole group then goes out of their way to make your life miserable.  &lt;/p&gt;\n\n&lt;p&gt;Not all Jehovah&amp;#39;s are like that.  I&amp;#39;m just trying to help one right now where her whole family and her church up north (New York) are spreading the word about her leaving to everyone down here in Texas. &lt;/p&gt;\n\n&lt;p&gt;Mormons on the other hand, the bishop should be the only one to obtain the records of a member who moves into their ward. (And that is &amp;#39;if&amp;#39; they are updated of a members move) I told my new bishop that I was no longer a member and wished to leave it at that.  I was invited to always be welcome to attend future Sundays and events.  I had a few calls over the years. But nothing that seemed like the whole fucking lot of them are out to make sure I remember I&amp;#39;m excommunicated and even my family wants me dead.  &lt;em&gt;Looking at JWs&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;For OP, OP should report this whole situation to the bishop his roommate ward(church) his parents belong to. If not the bishop but a first or second counselor.  By phone or email.  His parents actions are very much frowned upon. If these people are temple recommended, then that can be pulled for their behavior. At least a few meetings with the bishop.&lt;/p&gt;\n\n&lt;p&gt;I know from personal experience if that process doesn&amp;#39;t work, the you hit up the high priests (stake) president, and get this reported up the chain.  They should help with roommates parent&amp;#39;s behaving like grown adults. &lt;/p&gt;\n\n&lt;p&gt;If all those avenues fail to set the parents straight, then essentially calling the church a &amp;quot;crapshoot&amp;quot; is where I left off.  As a ex-mormon, the whole situation on my end was getting the church to remind my father to &amp;quot;grow the fuck up&amp;quot;.  By the time my father left the family the whole church pretty much took a blind eye to our family&amp;#39;s situation.  We reported the problems throughout the years and with no help from those who knew better.  Then when it all blew up and my father left, then the church opened up with arms wide open to help.  Not that I blame them, I just saw the &amp;#39;pick n choose&amp;#39; mentality of morals. &lt;/p&gt;\n\n&lt;p&gt;I met a few JWs throughout the years, and I still to this day do not know why one took it upon herself to make it her life mission to &amp;quot;save&amp;quot; me. &lt;/p&gt;\n\n&lt;p&gt;/Sorry for long post &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg95lp2", "score_hidden": false, "stickied": false, "created": 1492206969.0, "created_utc": 1492178169.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dg933m1", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Jilly_Bean16", "parent_id": "t1_dg910k5", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Interestingly enough, so are Jehovahs Witnesses. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interestingly enough, so are Jehovahs Witnesses. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg933m1", "score_hidden": false, "stickied": false, "created": 1492202950.0, "created_utc": 1492174150.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg97ra4", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "WMWMWMWMW", "parent_id": "t1_dg910k5", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I love that only Mormons have Blood Atonement for sins so bad that even Jesus can't forgive.  Plus dying and becoming god of your own planet is also nice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love that only Mormons have Blood Atonement for sins so bad that even Jesus can&amp;#39;t forgive.  Plus dying and becoming god of your own planet is also nice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg97ra4", "score_hidden": false, "stickied": false, "created": 1492209886.0, "created_utc": 1492181086.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg910k5", "gilded": 0, "archived": false, "score": 72, "report_reasons": null, "author": "AprilSpektra", "parent_id": "t1_dg8y32k", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You may be surprised to learn that Mormons are individual people with different personalities and everything.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You may be surprised to learn that Mormons are individual people with different personalities and everything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg910k5", "score_hidden": false, "stickied": false, "created": 1492198469.0, "created_utc": 1492169669.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 72}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9xdmn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Caladbolg_Prometheus", "parent_id": "t1_dg9x9nc", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "The problem comes from believing no matter how your terrible your actions, the goal (salvation, nirvana, ect) makes it justified. Often in contradiction to their scriptures.\n\nEdit: grammar, a 'how' was missing", "edited": 1492213606.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem comes from believing no matter how your terrible your actions, the goal (salvation, nirvana, ect) makes it justified. Often in contradiction to their scriptures.&lt;/p&gt;\n\n&lt;p&gt;Edit: grammar, a &amp;#39;how&amp;#39; was missing&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9xdmn", "score_hidden": false, "stickied": false, "created": 1492240977.0, "created_utc": 1492212177.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9x9nc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FireHazard11", "parent_id": "t1_dg8y32k", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Religious people make the absolute worst assholes. There's nothing quite like having your god condone your actions to bring out the abuse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Religious people make the absolute worst assholes. There&amp;#39;s nothing quite like having your god condone your actions to bring out the abuse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9x9nc", "score_hidden": false, "stickied": false, "created": 1492240831.0, "created_utc": 1492212031.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8y32k", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Caladbolg_Prometheus", "parent_id": "t1_dg8pfjn", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "My experiences with Mormons is like Jehovah's witnesses. Somewhat annoying but peaceful. But it's a wide world...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My experiences with Mormons is like Jehovah&amp;#39;s witnesses. Somewhat annoying but peaceful. But it&amp;#39;s a wide world...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8y32k", "score_hidden": false, "stickied": false, "created": 1492189424.0, "created_utc": 1492160624.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8pfjn", "gilded": 0, "archived": false, "score": 43, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg8ef0q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Awesome. Thank you for this. As far as the address goes, he's just gonna switch his mailing address to the apartment. If his parents do happen to find it and show up, I plan to not answer the door and call the police. If they start doing damage to the door or they are breaking it (shitty door), then I will open it and make it very clear to them that they are not welcome at or in my home and that the police are on the way.\nNow, like I stated in my edit, his dad is violent...but hey its not like I've never got the shit kicked out of me before. The station is fairly close to my apartment, I think we'll be okay.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome. Thank you for this. As far as the address goes, he&amp;#39;s just gonna switch his mailing address to the apartment. If his parents do happen to find it and show up, I plan to not answer the door and call the police. If they start doing damage to the door or they are breaking it (shitty door), then I will open it and make it very clear to them that they are not welcome at or in my home and that the police are on the way.\nNow, like I stated in my edit, his dad is violent...but hey its not like I&amp;#39;ve never got the shit kicked out of me before. The station is fairly close to my apartment, I think we&amp;#39;ll be okay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8pfjn", "score_hidden": false, "stickied": false, "created": 1492169859.0, "created_utc": 1492141059.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 43}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg8ne7a", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "pgh9fan", "parent_id": "t1_dg8ef0q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "For insurance OP should take new roommate to his state representative's office. Roommate may qualify for state insurance and other benefits. The representative's office will cut through the paperwork for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For insurance OP should take new roommate to his state representative&amp;#39;s office. Roommate may qualify for state insurance and other benefits. The representative&amp;#39;s office will cut through the paperwork for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8ne7a", "score_hidden": false, "stickied": false, "created": 1492166767.0, "created_utc": 1492137967.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg92gjl", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "TheyMakeMeWearPants", "parent_id": "t1_dg8zpjc", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "If he's 18 and still in HS he's probably a senior.  Most (all?) schools will let you finish the school year once it's already started, even if you move out of it.  Given that it's mid-April and there's not much of the school year left, I doubt this would be a problem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If he&amp;#39;s 18 and still in HS he&amp;#39;s probably a senior.  Most (all?) schools will let you finish the school year once it&amp;#39;s already started, even if you move out of it.  Given that it&amp;#39;s mid-April and there&amp;#39;s not much of the school year left, I doubt this would be a problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg92gjl", "score_hidden": false, "stickied": false, "created": 1492201725.0, "created_utc": 1492172925.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zpjc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "shiny_turd", "parent_id": "t1_dg8ef0q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Changing his address to a PO box may make him intelligible to continue going to school. Generally school district enrollment is generally based on county/district residence...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Changing his address to a PO box may make him intelligible to continue going to school. Generally school district enrollment is generally based on county/district residence...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8zpjc", "score_hidden": false, "stickied": false, "created": 1492194730.0, "created_utc": 1492165930.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ef0q", "gilded": 0, "archived": false, "score": 179, "report_reasons": null, "author": "alex_moose", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Other commenters have offered some good advice. Additional suggestions:  \n  \n- Move the money before he moves out of the house. Otherwise his parents may take the money before he can get to the bank.   Take the money to a different bank and open a new account.  If he can't close the original account he should simply withdraw the maximum allowed. \n\n- After he has moved, have him call the police himself and let them know he has moved out, and that any reports from his parents about him may be ignored.  \n  \n- If he's still in high school, then after he moves out let the school office know that he has done so, and that as an adult he is choosing that his parents not have access to his educational records or be given any information about him.  I would avoid giving the school your apartment address, since someone there may still talk to his parents.   \n   \n- He should set up a PO Box through the post office or a pack &amp; mail store. That way he can provide a mailing address to the school and anyone else who needs it without revealing his physical address. Less likely his parents will locate him that way.  If they're likely to guess he's with you, it may be wise for you to use a PO Box as well.   \n   \nMedical insurance companies must allow his parents to insure him if they want to. His parents do not have to do so once he turns 18.  Look up ACA open enrollment and put the date on your calendar, as he may need to sign up for insurance himself this fall.   If he isn't sure if he's still covered by his parents insurance, he can call the insurance company to confirm coverage.  Don't tell them the whole story, just ask a simple question like what the co-pay amount for a specialist is.  If he's no longer covered, they'll tell him.   \n  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Other commenters have offered some good advice. Additional suggestions:  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Move the money before he moves out of the house. Otherwise his parents may take the money before he can get to the bank.   Take the money to a different bank and open a new account.  If he can&amp;#39;t close the original account he should simply withdraw the maximum allowed. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;After he has moved, have him call the police himself and let them know he has moved out, and that any reports from his parents about him may be ignored.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If he&amp;#39;s still in high school, then after he moves out let the school office know that he has done so, and that as an adult he is choosing that his parents not have access to his educational records or be given any information about him.  I would avoid giving the school your apartment address, since someone there may still talk to his parents.   &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;He should set up a PO Box through the post office or a pack &amp;amp; mail store. That way he can provide a mailing address to the school and anyone else who needs it without revealing his physical address. Less likely his parents will locate him that way.  If they&amp;#39;re likely to guess he&amp;#39;s with you, it may be wise for you to use a PO Box as well.   &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Medical insurance companies must allow his parents to insure him if they want to. His parents do not have to do so once he turns 18.  Look up ACA open enrollment and put the date on your calendar, as he may need to sign up for insurance himself this fall.   If he isn&amp;#39;t sure if he&amp;#39;s still covered by his parents insurance, he can call the insurance company to confirm coverage.  Don&amp;#39;t tell them the whole story, just ask a simple question like what the co-pay amount for a specialist is.  If he&amp;#39;s no longer covered, they&amp;#39;ll tell him.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8ef0q", "score_hidden": false, "stickied": false, "created": 1492154384.0, "created_utc": 1492125584.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 179}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dgaqzeh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BananaFrappe", "parent_id": "t1_dgaqszh", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "[*Kingsman: The Secret Service*](https://en.wikipedia.org/wiki/Kingsman:_The_Secret_Service)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Kingsman:_The_Secret_Service\"&gt;&lt;em&gt;Kingsman: The Secret Service&lt;/em&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgaqzeh", "score_hidden": false, "stickied": false, "created": 1492298119.0, "created_utc": 1492269319.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaqszh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "smallwonkydachshund", "parent_id": "t1_dg8ttjo", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Is this actually from a movie? Bc I may need to see it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is this actually from a movie? Bc I may need to see it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgaqszh", "score_hidden": false, "stickied": false, "created": 1492297870.0, "created_utc": 1492269070.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9ykgz", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Tunalic", "parent_id": "t1_dg9wp2h", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "It means sex.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It means sex.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9ykgz", "score_hidden": false, "stickied": false, "created": 1492242536.0, "created_utc": 1492213736.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9ycri", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "retrogradeorbiter", "parent_id": "t1_dg9wp2h", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "No. It means having sex with someone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No. It means having sex with someone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9ycri", "score_hidden": false, "stickied": false, "created": 1492242250.0, "created_utc": 1492213450.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9yb6x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MycroftNext", "parent_id": "t1_dg9wp2h", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "http://www.thefreedictionary.com/sexual+congress", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.thefreedictionary.com/sexual+congress\"&gt;http://www.thefreedictionary.com/sexual+congress&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9yb6x", "score_hidden": false, "stickied": false, "created": 1492242191.0, "created_utc": 1492213391.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9yp9j", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "BananaFrappe", "parent_id": "t1_dg9wp2h", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Uh.... no.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uh.... no.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9yp9j", "score_hidden": false, "stickied": false, "created": 1492242718.0, "created_utc": 1492213918.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9wp2h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SexyReddit9000", "parent_id": "t1_dg8ttjo", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 1, "body": "Congress? Is that a typo?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congress? Is that a typo?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9wp2h", "score_hidden": false, "stickied": false, "created": 1492240067.0, "created_utc": 1492211267.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ttjo", "gilded": 0, "archived": false, "score": 115, "report_reasons": null, "author": "BananaFrappe", "parent_id": "t1_dg84j6j", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; After that he can tell his parents to fuck off, hail Satan, etc. \n\nI like your thought, but I liked [Harry Hart's](http://i.imgur.com/qis3tJm.jpg) response better:\n\n&gt;  I'm a Catholic whore, currently enjoying congress out of wedlock with my black Jewish boyfriend who works at a military abortion clinic. So, hail Satan, and have a lovely afternoon, madam.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;After that he can tell his parents to fuck off, hail Satan, etc. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I like your thought, but I liked &lt;a href=\"http://i.imgur.com/qis3tJm.jpg\"&gt;Harry Hart&amp;#39;s&lt;/a&gt; response better:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m a Catholic whore, currently enjoying congress out of wedlock with my black Jewish boyfriend who works at a military abortion clinic. So, hail Satan, and have a lovely afternoon, madam.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8ttjo", "score_hidden": false, "stickied": false, "created": 1492177737.0, "created_utc": 1492148937.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 115}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg8g2v0", "gilded": 0, "archived": false, "score": 178, "report_reasons": null, "author": "thetreece", "parent_id": "t1_dg88lwu", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Tell them the tl;dr version when trying to get a police escort.  Cut out all the bullshit.\n\n\"I'm an 18 y/o living in my parents' home.  They have been very abusive and threatening toward me, and I'm worried they might harm me when I try to move out.  Would it be possible for an officer to escort me in and out of the house as I move out my things?\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell them the tl;dr version when trying to get a police escort.  Cut out all the bullshit.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m an 18 y/o living in my parents&amp;#39; home.  They have been very abusive and threatening toward me, and I&amp;#39;m worried they might harm me when I try to move out.  Would it be possible for an officer to escort me in and out of the house as I move out my things?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8g2v0", "score_hidden": false, "stickied": false, "created": 1492156602.0, "created_utc": 1492127802.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 178}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg8vaa2", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "funnyfaceking", "parent_id": "t1_dg88p4y", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Just call the non-emergency line and the police will be happy to escort the ~~kid~~ young man out once.", "edited": 1492202878.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just call the non-emergency line and the police will be happy to escort the &lt;del&gt;kid&lt;/del&gt; young man out once.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8vaa2", "score_hidden": false, "stickied": false, "created": 1492181174.0, "created_utc": 1492152374.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, "user_reports": [], "id": "dg88p4y", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg88lwu", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Alright. I'll bring that up, thank you for that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Alright. I&amp;#39;ll bring that up, thank you for that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg88p4y", "score_hidden": false, "stickied": false, "created": 1492147003.0, "created_utc": 1492118203.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 40}}], "after": null, "before": null}}, "user_reports": [], "id": "dg88lwu", "gilded": 0, "archived": false, "score": 117, "report_reasons": null, "author": "rhomboidus", "parent_id": "t1_dg88a8k", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt;  I assumed the police would be too busy to escort an 18 year old around.\n\nThey may just blow him off, but if he goes in and explains things and seems like a generally sane/decent person they may be willing to help him, especially if he's flexible on the time and date.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I assumed the police would be too busy to escort an 18 year old around.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They may just blow him off, but if he goes in and explains things and seems like a generally sane/decent person they may be willing to help him, especially if he&amp;#39;s flexible on the time and date.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg88lwu", "score_hidden": false, "stickied": false, "created": 1492146894.0, "created_utc": 1492118094.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 117}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg88t3y", "gilded": 0, "archived": false, "score": 47, "report_reasons": null, "author": "entropys_child", "parent_id": "t1_dg88a8k", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Ask around locally about how the police are about parents in this sort of situation, they could be pals of the parents. Maybe ask for advice in /r/exmormon", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ask around locally about how the police are about parents in this sort of situation, they could be pals of the parents. Maybe ask for advice in &lt;a href=\"/r/exmormon\"&gt;/r/exmormon&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg88t3y", "score_hidden": false, "stickied": false, "created": 1492147137.0, "created_utc": 1492118337.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 47}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dga247f", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dga1b1d", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Yeah, new developments have arisen and I think I'm gonna have to have an officer help us...I also have a lot of friends in the military and my friend said some of his ranger buddies would be happy to escort us in marked vehicles as well. But I think I'll go with the cops.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, new developments have arisen and I think I&amp;#39;m gonna have to have an officer help us...I also have a lot of friends in the military and my friend said some of his ranger buddies would be happy to escort us in marked vehicles as well. But I think I&amp;#39;ll go with the cops.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dga247f", "score_hidden": false, "stickied": false, "created": 1492247280.0, "created_utc": 1492218480.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dga1b1d", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "therest", "parent_id": "t1_dg88a8k", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "OP, this is truly solid advice, please take it for both yours and your friend's sake. I had to leave a nasty living situation once myself (my ex landlady/roomate was fucking *crazy* and a gun nut to boot and did NOT take it well when I told her I was going to move out), I called the non emergency police line, explained to them that my landlady was not outright dangerous, but very threatening and that I would like it if they could send an escort while I packed my things in my boyfriends car. I told them I didn't want any trouble or drama, that I just wanted to leave as peacefully and as quickly as possible.\n\nWithin the hour a police officer showed up and she hung out while I loaded up the car. She was very nice and understanding (and even mentioned as an aside that she agreed that my landlady was loony haha), and took off when I did. The police are there to help you in situations like this. Best of luck to both of you, you're a good friend for helping your buddy out like this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, this is truly solid advice, please take it for both yours and your friend&amp;#39;s sake. I had to leave a nasty living situation once myself (my ex landlady/roomate was fucking &lt;em&gt;crazy&lt;/em&gt; and a gun nut to boot and did NOT take it well when I told her I was going to move out), I called the non emergency police line, explained to them that my landlady was not outright dangerous, but very threatening and that I would like it if they could send an escort while I packed my things in my boyfriends car. I told them I didn&amp;#39;t want any trouble or drama, that I just wanted to leave as peacefully and as quickly as possible.&lt;/p&gt;\n\n&lt;p&gt;Within the hour a police officer showed up and she hung out while I loaded up the car. She was very nice and understanding (and even mentioned as an aside that she agreed that my landlady was loony haha), and took off when I did. The police are there to help you in situations like this. Best of luck to both of you, you&amp;#39;re a good friend for helping your buddy out like this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dga1b1d", "score_hidden": false, "stickied": false, "created": 1492246192.0, "created_utc": 1492217392.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dga4jzw", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Spaceblaster", "parent_id": "t1_dg9q2j6", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You can try the sheriff's office, they're county instead of city.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can try the sheriff&amp;#39;s office, they&amp;#39;re county instead of city.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dga4jzw", "score_hidden": false, "stickied": false, "created": 1492250662.0, "created_utc": 1492221862.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9q2j6", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg9jacp", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Also as the reply above you states, I don't want a cop who is friends with his parents...which is quite common in Utah.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also as the reply above you states, I don&amp;#39;t want a cop who is friends with his parents...which is quite common in Utah.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9q2j6", "score_hidden": false, "stickied": false, "created": 1492231471.0, "created_utc": 1492202671.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jacp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Lose__Not__Loose", "parent_id": "t1_dg88a8k", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Maybe in a place like detroit they would blow you off but that's something most police departments deal with regularly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe in a place like detroit they would blow you off but that&amp;#39;s something most police departments deal with regularly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9jacp", "score_hidden": false, "stickied": false, "created": 1492223297.0, "created_utc": 1492194497.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg88a8k", "gilded": 0, "archived": false, "score": 124, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg886qd", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "That's a fantastic idea. I assumed the police would be too busy to escort an 18 year old around. I'll talk with him about that next time I have the chance.\nThe goal is to be in and out quick, no interaction with his parents before, during or after.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a fantastic idea. I assumed the police would be too busy to escort an 18 year old around. I&amp;#39;ll talk with him about that next time I have the chance.\nThe goal is to be in and out quick, no interaction with his parents before, during or after.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg88a8k", "score_hidden": false, "stickied": false, "created": 1492146504.0, "created_utc": 1492117704.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 124}}], "after": null, "before": null}}, "user_reports": [], "id": "dg886qd", "gilded": 0, "archived": false, "score": 214, "report_reasons": null, "author": "rhomboidus", "parent_id": "t1_dg87y04", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "If you know his father to be violent he should go to the local police station and ask if they would be willing to send an officer with him when he goes to get his things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you know his father to be violent he should go to the local police station and ask if they would be willing to send an officer with him when he goes to get his things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg886qd", "score_hidden": false, "stickied": false, "created": 1492146388.0, "created_utc": 1492117588.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 214}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87y04", "gilded": 0, "archived": false, "score": 131, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg84j6j", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Yep, I agree this is very dramatic and stupid. The only reason i'm planning everything down to the detail is because his parents are so crazy. Specifically his dad. I clarified in a post edit that he is violent, i know he is violent because he has attacked me personally in the past.\n\nIm preparing for any sort of backlash his parents, specifically his dad, could come at me or him with. Thank you for your reply.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, I agree this is very dramatic and stupid. The only reason i&amp;#39;m planning everything down to the detail is because his parents are so crazy. Specifically his dad. I clarified in a post edit that he is violent, i know he is violent because he has attacked me personally in the past.&lt;/p&gt;\n\n&lt;p&gt;Im preparing for any sort of backlash his parents, specifically his dad, could come at me or him with. Thank you for your reply.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg87y04", "score_hidden": false, "stickied": false, "created": 1492146101.0, "created_utc": 1492117301.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 131}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84j6j", "gilded": 0, "archived": false, "score": 362, "report_reasons": null, "author": "rhomboidus", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "This is all a terrible, overly dramatic plan.\n\n1. He should gather up his important documents. Birth certificate, IDs, Passport, SS card, etc.\n2. He should go to a bank of his choosing, open an account, and then transfer the funds from his joint account with his parents into the new account.\n3. He should move out. If his parents attempt to stop him he should call the police.\n\nAfter that he can tell his parents to fuck off, hail Satan, etc. If they come looking for him you can similarly tell them to fuck off. If they contact the police he can just tell the cops he's fine, and they'll drop it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is all a terrible, overly dramatic plan.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;He should gather up his important documents. Birth certificate, IDs, Passport, SS card, etc.&lt;/li&gt;\n&lt;li&gt;He should go to a bank of his choosing, open an account, and then transfer the funds from his joint account with his parents into the new account.&lt;/li&gt;\n&lt;li&gt;He should move out. If his parents attempt to stop him he should call the police.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;After that he can tell his parents to fuck off, hail Satan, etc. If they come looking for him you can similarly tell them to fuck off. If they contact the police he can just tell the cops he&amp;#39;s fine, and they&amp;#39;ll drop it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg84j6j", "score_hidden": false, "stickied": false, "created": 1492142276.0, "created_utc": 1492113476.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 362}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dga670g", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "PM_Your_Cowboy_Hats", "parent_id": "t1_dg9i2zx", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "That's true, the problem with Utah in particular is that it's so culturally homogenous and lots of things that are just Utah mormon culture start getting conflated with being actual mormon doctrine. And with lots of people growing up sheltered from the non-Utah Mormon world you end up with lots of people that aren't able to handle people and things outside that bubble. It's not that Utah is all bad and everywhere else is all good, just that Utah has it's unique brand of bad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s true, the problem with Utah in particular is that it&amp;#39;s so culturally homogenous and lots of things that are just Utah mormon culture start getting conflated with being actual mormon doctrine. And with lots of people growing up sheltered from the non-Utah Mormon world you end up with lots of people that aren&amp;#39;t able to handle people and things outside that bubble. It&amp;#39;s not that Utah is all bad and everywhere else is all good, just that Utah has it&amp;#39;s unique brand of bad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dga670g", "score_hidden": false, "stickied": false, "created": 1492253034.0, "created_utc": 1492224234.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9i2zx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MoshPotato", "parent_id": "t1_dg8ppyf", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "There are bad Mormons everywhere. \n\nI would be tempted to say that you met the exception. \n\nMost seem nice on the surface but I have seen so much abuse by \"leaders\" that I steer clear.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are bad Mormons everywhere. &lt;/p&gt;\n\n&lt;p&gt;I would be tempted to say that you met the exception. &lt;/p&gt;\n\n&lt;p&gt;Most seem nice on the surface but I have seen so much abuse by &amp;quot;leaders&amp;quot; that I steer clear.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9i2zx", "score_hidden": false, "stickied": false, "created": 1492221869.0, "created_utc": 1492193069.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dgcied0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dgci9np", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Yeah I'm in Utah County... SLC I've ran into some gooks but not as many for sure, I can agree with that. Honestly if everyone in Utah just learned to mind their own business I wouldn't hate living here so much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I&amp;#39;m in Utah County... SLC I&amp;#39;ve ran into some gooks but not as many for sure, I can agree with that. Honestly if everyone in Utah just learned to mind their own business I wouldn&amp;#39;t hate living here so much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgcied0", "score_hidden": false, "stickied": false, "created": 1492402528.0, "created_utc": 1492373728.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgci9np", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "krikit386", "parent_id": "t1_dg8ppyf", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "In my experience it's not so much utah Mormons, but Utah County mormons....i live south of Salt LAKE and everyone is cool, but man, Utah County? Send help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my experience it&amp;#39;s not so much utah Mormons, but Utah County mormons....i live south of Salt LAKE and everyone is cool, but man, Utah County? Send help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgci9np", "score_hidden": false, "stickied": false, "created": 1492402366.0, "created_utc": 1492373566.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ppyf", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg8pitd", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Nope. LDS and LDS. In Utah there is such a high Mormon population that it becomes expected that you're Mormon and that you're perfect. And if you're not perfect by their standards they shun you and hate you.\n\nWhereas Mormons down in Georgia where I used to live are amazing people. So kind, so helpful. They knew I wasn't Mormon and invited me on fun trips anyway. They knew my mom was having a hard time after my dad left us so they brought us dinner every night for 5 months and the bishop paid our rent (I paid utilities and misc bills though). \n\nThey never pressured us to come to church, they invited us once or twice and left it at that. When my dad stole and sold my moms car, the Bishops wife actually lended my mom her personal car so she could get to work. For 2 months. Then I helped my mom buy a Carolla which she still owns I believe.\n\nThere is a HUGE difference between the LDS church in Utah and the LDS church everywhere else. Hell half my neighbors in this apartment won't even come near me. \n\nGranted there are still very good and wholesome Mormons here in Utah....but its about a 1:20 ratio.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nope. LDS and LDS. In Utah there is such a high Mormon population that it becomes expected that you&amp;#39;re Mormon and that you&amp;#39;re perfect. And if you&amp;#39;re not perfect by their standards they shun you and hate you.&lt;/p&gt;\n\n&lt;p&gt;Whereas Mormons down in Georgia where I used to live are amazing people. So kind, so helpful. They knew I wasn&amp;#39;t Mormon and invited me on fun trips anyway. They knew my mom was having a hard time after my dad left us so they brought us dinner every night for 5 months and the bishop paid our rent (I paid utilities and misc bills though). &lt;/p&gt;\n\n&lt;p&gt;They never pressured us to come to church, they invited us once or twice and left it at that. When my dad stole and sold my moms car, the Bishops wife actually lended my mom her personal car so she could get to work. For 2 months. Then I helped my mom buy a Carolla which she still owns I believe.&lt;/p&gt;\n\n&lt;p&gt;There is a HUGE difference between the LDS church in Utah and the LDS church everywhere else. Hell half my neighbors in this apartment won&amp;#39;t even come near me. &lt;/p&gt;\n\n&lt;p&gt;Granted there are still very good and wholesome Mormons here in Utah....but its about a 1:20 ratio.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8ppyf", "score_hidden": false, "stickied": false, "created": 1492170319.0, "created_utc": 1492141519.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dga28os", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Erin1976", "parent_id": "t1_dg8pitd", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "No it's more like the following:\n\nChurch members are like manure.  When spread thinly over a wide area (pretty much everywhere but UT/ID/AZ/WY), they are useful.  They make things happen and blend into the rest of the community.\n\nWhere there's a lot of them, they're just a big stinking pile of manure that attracts flies.\n\n", "edited": 1492219030.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No it&amp;#39;s more like the following:&lt;/p&gt;\n\n&lt;p&gt;Church members are like manure.  When spread thinly over a wide area (pretty much everywhere but UT/ID/AZ/WY), they are useful.  They make things happen and blend into the rest of the community.&lt;/p&gt;\n\n&lt;p&gt;Where there&amp;#39;s a lot of them, they&amp;#39;re just a big stinking pile of manure that attracts flies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dga28os", "score_hidden": false, "stickied": false, "created": 1492247454.0, "created_utc": 1492218654.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg8s1up", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg8rsj8", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Yeah....that's a sad truth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah....that&amp;#39;s a sad truth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8s1up", "score_hidden": false, "stickied": false, "created": 1492174252.0, "created_utc": 1492145452.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8rsj8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Evan_Th", "parent_id": "t1_dg8q8es", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; ALL FLDS are insane\n\nExcept, at least, the ones who're wanting to get out. :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;ALL FLDS are insane&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Except, at least, the ones who&amp;#39;re wanting to get out. :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8rsj8", "score_hidden": false, "stickied": false, "created": 1492173782.0, "created_utc": 1492144982.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8q8es", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg8pitd", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "In addition, ALL FLDS are insane....if there is such thing as a Mormon cult, its the FLDS church.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In addition, ALL FLDS are insane....if there is such thing as a Mormon cult, its the FLDS church.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8q8es", "score_hidden": false, "stickied": false, "created": 1492171151.0, "created_utc": 1492142351.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8pitd", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "NighthawkFoo", "parent_id": "t1_dg8ozy3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; (Real Mormons, not Utah Mormons\n\nWhat's the difference?  LDS vs. FLDS?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;(Real Mormons, not Utah Mormons&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What&amp;#39;s the difference?  LDS vs. FLDS?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8pitd", "score_hidden": false, "stickied": false, "created": 1492170002.0, "created_utc": 1492141202.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ozy3", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg8l4vn", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "That's a good idea...I hadn't thought of that. /r/exmormon tends not to like me very much cause I defend Mormons. (Real Mormons, not Utah Mormons. Utah Mormons are shitheads). Or maybe its /r/Atheism who doesn't like me....either way I'll check it out. Thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a good idea...I hadn&amp;#39;t thought of that. &lt;a href=\"/r/exmormon\"&gt;/r/exmormon&lt;/a&gt; tends not to like me very much cause I defend Mormons. (Real Mormons, not Utah Mormons. Utah Mormons are shitheads). Or maybe its &lt;a href=\"/r/Atheism\"&gt;/r/Atheism&lt;/a&gt; who doesn&amp;#39;t like me....either way I&amp;#39;ll check it out. Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8ozy3", "score_hidden": false, "stickied": false, "created": 1492169178.0, "created_utc": 1492140378.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8l4vn", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "FlannanLight", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I can't help with any of the questions you've raised, but it sounds like you and your friend are doing this alone.  Even if your friend doesn't plan to leave the church, the folks over at /r/exmormon may be able to give you help, whether that's advice on relations, emotional support over the abuse, or even just a physical hand moving out of the parents' house.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t help with any of the questions you&amp;#39;ve raised, but it sounds like you and your friend are doing this alone.  Even if your friend doesn&amp;#39;t plan to leave the church, the folks over at &lt;a href=\"/r/exmormon\"&gt;/r/exmormon&lt;/a&gt; may be able to give you help, whether that&amp;#39;s advice on relations, emotional support over the abuse, or even just a physical hand moving out of the parents&amp;#39; house.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8l4vn", "score_hidden": false, "stickied": false, "created": 1492163552.0, "created_utc": 1492134752.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg87d0y", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg85f7d", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you for your concern. I appreciate it. If have clarified via a post edit (end of the post) why i asked those things. His dad has tried to assault me before, hence my concern that he will try again. I can assure you that I have never ever started a fight and I have never in my life done anything violent with my hands or gun that wasn't justified.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your concern. I appreciate it. If have clarified via a post edit (end of the post) why i asked those things. His dad has tried to assault me before, hence my concern that he will try again. I can assure you that I have never ever started a fight and I have never in my life done anything violent with my hands or gun that wasn&amp;#39;t justified.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg87d0y", "score_hidden": false, "stickied": false, "created": 1492145443.0, "created_utc": 1492116643.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9m69x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JakeFortune", "parent_id": "t1_dg9id4l", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You're still wrong, though this is the wrong forum.  \n\n* The exterior (physical) dimensions of .223 and 5.56 ammunition are effectively identical.\n* 5.56 ammunition may be loaded to higher pressures than .223 ammunition.  Although this is actually not as true as you think it is, because the pressures are measured in different ways (CUP vs PSI), making absolute comparison measurements all but impossible.\n* 5.56mm chambers are dimensionally larger in certain critical areas than .223 chambers.\n* Given the same ammunition, 5.56 chambers will have lower pressures than .223 chambers.  Again the key here is: you'll have potentially the same variability between 5.56 and .223 as you will between 2 of the same type, due to how the chambers are reamed and if your particular barrel was made with a newly sharpened reamer or one that has been through several other barrels already.\n\nHigher twist rates don't have correlation to calibers.  You get twist rates like 1:9.  But here's what you're missing.  The higher twist rate for 1:7 makes lighter grain bullets like 55gr more unstable.  1:7 is better for 77gr stability than 1:12 which is why it's more common in 5.56 rifles, typically milspec, firing the heavier bullets.  \n\nBottom line:  Firing ANY firearm in a home shouldn't be done, but in an emergency, you use what you have, because the alternative is worse.  He's talking about an attacker with a high likelihood of causing a confrontation resulting in serious injury or death.  \n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re still wrong, though this is the wrong forum.  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The exterior (physical) dimensions of .223 and 5.56 ammunition are effectively identical.&lt;/li&gt;\n&lt;li&gt;5.56 ammunition may be loaded to higher pressures than .223 ammunition.  Although this is actually not as true as you think it is, because the pressures are measured in different ways (CUP vs PSI), making absolute comparison measurements all but impossible.&lt;/li&gt;\n&lt;li&gt;5.56mm chambers are dimensionally larger in certain critical areas than .223 chambers.&lt;/li&gt;\n&lt;li&gt;Given the same ammunition, 5.56 chambers will have lower pressures than .223 chambers.  Again the key here is: you&amp;#39;ll have potentially the same variability between 5.56 and .223 as you will between 2 of the same type, due to how the chambers are reamed and if your particular barrel was made with a newly sharpened reamer or one that has been through several other barrels already.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Higher twist rates don&amp;#39;t have correlation to calibers.  You get twist rates like 1:9.  But here&amp;#39;s what you&amp;#39;re missing.  The higher twist rate for 1:7 makes lighter grain bullets like 55gr more unstable.  1:7 is better for 77gr stability than 1:12 which is why it&amp;#39;s more common in 5.56 rifles, typically milspec, firing the heavier bullets.  &lt;/p&gt;\n\n&lt;p&gt;Bottom line:  Firing ANY firearm in a home shouldn&amp;#39;t be done, but in an emergency, you use what you have, because the alternative is worse.  He&amp;#39;s talking about an attacker with a high likelihood of causing a confrontation resulting in serious injury or death.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9m69x", "score_hidden": false, "stickied": false, "created": 1492226787.0, "created_utc": 1492197987.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dgamkba", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Thewilltosucceed", "parent_id": "t1_dg9yqm1", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "In my admittedly limited experience that is correct. Everyone I know that has an AR has it chambered in .223.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my admittedly limited experience that is correct. Everyone I know that has an AR has it chambered in .223.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgamkba", "score_hidden": false, "stickied": false, "created": 1492290736.0, "created_utc": 1492261936.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9yqm1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sunfried", "parent_id": "t1_dg9jse9", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; almost no one uses 5.56 in an AR\n\nWAT\n\nHead over to /r/ar15 and see if you can find someone to agree with you on that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;almost no one uses 5.56 in an AR&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;WAT&lt;/p&gt;\n\n&lt;p&gt;Head over to &lt;a href=\"/r/ar15\"&gt;/r/ar15&lt;/a&gt; and see if you can find someone to agree with you on that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9yqm1", "score_hidden": false, "stickied": false, "created": 1492242766.0, "created_utc": 1492213966.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jse9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lose__Not__Loose", "parent_id": "t1_dg9id4l", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "The vast majority of AR owners think that 5.56 is bad for their rifle and won't use it. While it may not be true that it's bad for the rifle, almost no one uses 5.56 in an AR. It definitely isn't the most common ammo for an AR. \n\nI would like to see your stats on 5.56 being more common. I have never known anyone to shoot 5.56 over.223 unless they got a deal.\n\nEven if you are correct, you can just suggest OP to change out is 5.56 for .223.", "edited": 1492195291.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The vast majority of AR owners think that 5.56 is bad for their rifle and won&amp;#39;t use it. While it may not be true that it&amp;#39;s bad for the rifle, almost no one uses 5.56 in an AR. It definitely isn&amp;#39;t the most common ammo for an AR. &lt;/p&gt;\n\n&lt;p&gt;I would like to see your stats on 5.56 being more common. I have never known anyone to shoot 5.56 over.223 unless they got a deal.&lt;/p&gt;\n\n&lt;p&gt;Even if you are correct, you can just suggest OP to change out is 5.56 for .223.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9jse9", "score_hidden": false, "stickied": false, "created": 1492223905.0, "created_utc": 1492195105.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9id4l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fooliam", "parent_id": "t1_dg9b9bz", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Umm...most ARs are chambered in 5.56/.223, but the 5.56 rounds are much more common.  They are loaded to higher pressure than the Remington .223, which means higher muzzle velocity and greater risk of over-penetration.  Furthermore, most barrels chambered in 5.56 have a rifling ration of 1:7 compared to 1:12 in .223 chambers, meaning that there is less chance of tumbling, once again raising the risk of overpenetration.  \n\nBottom line: Firing a rifle indoors as a means of self defense is stupid and incredibly likely to result in unintended damage, harm, or death.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Umm...most ARs are chambered in 5.56/.223, but the 5.56 rounds are much more common.  They are loaded to higher pressure than the Remington .223, which means higher muzzle velocity and greater risk of over-penetration.  Furthermore, most barrels chambered in 5.56 have a rifling ration of 1:7 compared to 1:12 in .223 chambers, meaning that there is less chance of tumbling, once again raising the risk of overpenetration.  &lt;/p&gt;\n\n&lt;p&gt;Bottom line: Firing a rifle indoors as a means of self defense is stupid and incredibly likely to result in unintended damage, harm, or death.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9id4l", "score_hidden": false, "stickied": false, "created": 1492222203.0, "created_utc": 1492193403.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9b9bz", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "JakeFortune", "parent_id": "t1_dg85f7d", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "The AR-15 is actually the best firearm for reducing over penetration through walls.  Handguns and shotguns will have more over penetration through multiple levels of drywall.  The 223 bullet will tumble past the first drywall level and most likely will hit the second side flat and not fully penetrate.  This has been proven over and over.  You are simply completely incorrect in your assertion.\n\nI heavily disagree with your statement about protecting himself too.  He's isn't even 20 years old, and he is potentially going to defend himself from a larger, known to be violent person.  The discussion isn't about him going down to hunt down the father.  It's about potentially defending himself.  This is precisely what firearms are for.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The AR-15 is actually the best firearm for reducing over penetration through walls.  Handguns and shotguns will have more over penetration through multiple levels of drywall.  The 223 bullet will tumble past the first drywall level and most likely will hit the second side flat and not fully penetrate.  This has been proven over and over.  You are simply completely incorrect in your assertion.&lt;/p&gt;\n\n&lt;p&gt;I heavily disagree with your statement about protecting himself too.  He&amp;#39;s isn&amp;#39;t even 20 years old, and he is potentially going to defend himself from a larger, known to be violent person.  The discussion isn&amp;#39;t about him going down to hunt down the father.  It&amp;#39;s about potentially defending himself.  This is precisely what firearms are for.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9b9bz", "score_hidden": false, "stickied": false, "created": 1492214112.0, "created_utc": 1492185312.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg85f7d", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "derspiny", "parent_id": "t1_dg859sr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Don't even have it out. An AR-15 is not something you should even try to aim with in an apartment. If you fire, the odds of you either missing or overpenetrating your target and [striking someone in another unit](http://www.theboxotruth.com/the-box-o-truth-1-the-original-box-o-truth/) are just too high. If you know you're not going to fire, brandishing it is just a way to escalate the situation and risk some quite serious unintended consequences.\n\nI agree with the other poster: that you're even considering using your firearm in a domestic dispute means you may want to consider putting it in a range safe or selling it, and holding off on firearms ownership until you grow up a bit.", "edited": 1492114685.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t even have it out. An AR-15 is not something you should even try to aim with in an apartment. If you fire, the odds of you either missing or overpenetrating your target and &lt;a href=\"http://www.theboxotruth.com/the-box-o-truth-1-the-original-box-o-truth/\"&gt;striking someone in another unit&lt;/a&gt; are just too high. If you know you&amp;#39;re not going to fire, brandishing it is just a way to escalate the situation and risk some quite serious unintended consequences.&lt;/p&gt;\n\n&lt;p&gt;I agree with the other poster: that you&amp;#39;re even considering using your firearm in a domestic dispute means you may want to consider putting it in a range safe or selling it, and holding off on firearms ownership until you grow up a bit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg85f7d", "score_hidden": false, "stickied": false, "created": 1492143269.0, "created_utc": 1492114469.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 42}}], "after": null, "before": null}}, "user_reports": [], "id": "dg859sr", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg84gnb", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you for your feedback. I never intend to shoot anyone unless there is no other option. I am a responsible gun owner and I know to never squeeze that trigger or even threaten with the gun until my life is at stake. Thank you again for your feedback.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your feedback. I never intend to shoot anyone unless there is no other option. I am a responsible gun owner and I know to never squeeze that trigger or even threaten with the gun until my life is at stake. Thank you again for your feedback.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg859sr", "score_hidden": false, "stickied": false, "created": 1492143099.0, "created_utc": 1492114299.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84gnb", "gilded": 0, "archived": false, "score": 47, "report_reasons": null, "author": "derspiny", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "He's an adult, and can live where he pleases. A police report about kidnapping or about a missing person will lead to a wellness check, and nothing further. His parents can't legally force him to do anything, and if they lay a hand on him or detain him against his will he should call the police.\n\nIf his parents have taken his money from his accounts, he may have to sue them to force them to return it. If he takes money out that legally belongs to his parents, they can sue him. If the money's still in the accounts and he's only lost access to phone or internet banking, then he should be able to take his money out by going to a branch in person. He should not have joint accounts with his parents, now that he's an adult, so closing those accounts and opening his own would be a good idea.\n\nIt is not \"self-defence\" to get into a fist-fight with someone who won't leave your home. Call the police if you have a trespasser, rather than escalating to violence, or you may face charges. _Absolutely_ do not shoot a trespasser unless you are in imminent danger of death or serious bodily harm yourself - you could face a whole litany of criminal charges.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s an adult, and can live where he pleases. A police report about kidnapping or about a missing person will lead to a wellness check, and nothing further. His parents can&amp;#39;t legally force him to do anything, and if they lay a hand on him or detain him against his will he should call the police.&lt;/p&gt;\n\n&lt;p&gt;If his parents have taken his money from his accounts, he may have to sue them to force them to return it. If he takes money out that legally belongs to his parents, they can sue him. If the money&amp;#39;s still in the accounts and he&amp;#39;s only lost access to phone or internet banking, then he should be able to take his money out by going to a branch in person. He should not have joint accounts with his parents, now that he&amp;#39;s an adult, so closing those accounts and opening his own would be a good idea.&lt;/p&gt;\n\n&lt;p&gt;It is not &amp;quot;self-defence&amp;quot; to get into a fist-fight with someone who won&amp;#39;t leave your home. Call the police if you have a trespasser, rather than escalating to violence, or you may face charges. &lt;em&gt;Absolutely&lt;/em&gt; do not shoot a trespasser unless you are in imminent danger of death or serious bodily harm yourself - you could face a whole litany of criminal charges.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg84gnb", "score_hidden": false, "stickied": false, "created": 1492142198.0, "created_utc": 1492113398.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 47}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg8oxw5", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg8mi0f", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "That's a great idea, there's a cop who works in the design department that I'm friends with. I'll ask him for advice and to help us out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a great idea, there&amp;#39;s a cop who works in the design department that I&amp;#39;m friends with. I&amp;#39;ll ask him for advice and to help us out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8oxw5", "score_hidden": false, "stickied": false, "created": 1492169089.0, "created_utc": 1492140289.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mi0f", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "KBCme", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Once he leave, pre-emptively tell the police that he is moving out, that he is 18 and that his parents will likely try to file some report that he is 'missing'. If you let the police know this, when his parents go to file a report they will tell them that he is safe and has moved and to let it go.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Once he leave, pre-emptively tell the police that he is moving out, that he is 18 and that his parents will likely try to file some report that he is &amp;#39;missing&amp;#39;. If you let the police know this, when his parents go to file a report they will tell them that he is safe and has moved and to let it go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8mi0f", "score_hidden": false, "stickied": false, "created": 1492165465.0, "created_utc": 1492136665.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9d49w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg9ctey", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Fair enough haha. I don't attend church very often at all and by the sound of it, he wont want to either. But thank you for your advice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair enough haha. I don&amp;#39;t attend church very often at all and by the sound of it, he wont want to either. But thank you for your advice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9d49w", "score_hidden": false, "stickied": false, "created": 1492216174.0, "created_utc": 1492187374.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dgdzijh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jftitan", "parent_id": "t1_dgaf7yu", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "A very supportive troop, and the 'overachiever' push to obtain merit badges.  What slowed me down was technically, the 6 month waits between rank advancement.  I nailed as many Required merit badges first, then finished nearly twice as many elective badges.  I switched between troops after cub scouts. \r\n\r\n I wasn't the youngest Eagle Scout though (1996), Texas.  I also joined the Order of the Arrow, during that adventure once lumped with mostly older, many lower ranked Scouts I was nearly singled out to be hazed, until a 12 year old showed up bragging he beat me.  It boils down to, my parents were very supportive (obtained an aviation badge, which how do you get a few scouts in a place these days?.. for free).  The troops I was in, were very well funded and supportive.  A key decider in some peoples lives, as to whether or not they are on the 'right side of the railroad tracks' can attribute to the BSA program. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A very supportive troop, and the &amp;#39;overachiever&amp;#39; push to obtain merit badges.  What slowed me down was technically, the 6 month waits between rank advancement.  I nailed as many Required merit badges first, then finished nearly twice as many elective badges.  I switched between troops after cub scouts. &lt;/p&gt;\n\n&lt;p&gt;I wasn&amp;#39;t the youngest Eagle Scout though (1996), Texas.  I also joined the Order of the Arrow, during that adventure once lumped with mostly older, many lower ranked Scouts I was nearly singled out to be hazed, until a 12 year old showed up bragging he beat me.  It boils down to, my parents were very supportive (obtained an aviation badge, which how do you get a few scouts in a place these days?.. for free).  The troops I was in, were very well funded and supportive.  A key decider in some peoples lives, as to whether or not they are on the &amp;#39;right side of the railroad tracks&amp;#39; can attribute to the BSA program. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdzijh", "score_hidden": false, "stickied": false, "created": 1492486439.0, "created_utc": 1492457639.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaf7yu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GinAndMangoJuice", "parent_id": "t1_dg9ctey", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Eagle scout at 13?  How? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eagle scout at 13?  How? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgaf7yu", "score_hidden": false, "stickied": false, "created": 1492270141.0, "created_utc": 1492241341.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ctey", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jftitan", "parent_id": "t1_dg9c4n5", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I began studying religion because of the Mormon church. Born and raised in it, I never knew the \"whole\" world until 18.  When the world hits you like a ton of bricks. Coming from Texas, we had a reasonable Bishopric that I became a Eagle Scout at 13.  Had excellent leaders.  But at the same time, things changed throughout the years and we also had our shitty ones too.  Y'all being in Utah, I understand matters are even more complicated.  I have cousins in Utah, and it surprises me some Mormons are Associate Degrees by 17.  But then you have those that are like the \"lowest life expectancies\", they will scream the loudest, and inflict damage early that even reporting to the higher ups. No one will listen to the one who is targeted. \r\n\r\n Although I am now Atheist, I don't deny my upbringings, I think when I was 13, I liked Polytheism over Mono...  I mean..  Today's God is more like Ares. I could pray to Ares, and since he is the God of War, who am I wrong when the USA is the best at it. Huh?    -I digress, and totally off topic. \r\n\r\n Two Thumbs up for You and your Roommate.  Check out the Singles Ward, at least most of those Mormon girls will still judge you by standards that they themselves broke long ago. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I began studying religion because of the Mormon church. Born and raised in it, I never knew the &amp;quot;whole&amp;quot; world until 18.  When the world hits you like a ton of bricks. Coming from Texas, we had a reasonable Bishopric that I became a Eagle Scout at 13.  Had excellent leaders.  But at the same time, things changed throughout the years and we also had our shitty ones too.  Y&amp;#39;all being in Utah, I understand matters are even more complicated.  I have cousins in Utah, and it surprises me some Mormons are Associate Degrees by 17.  But then you have those that are like the &amp;quot;lowest life expectancies&amp;quot;, they will scream the loudest, and inflict damage early that even reporting to the higher ups. No one will listen to the one who is targeted. &lt;/p&gt;\n\n&lt;p&gt;Although I am now Atheist, I don&amp;#39;t deny my upbringings, I think when I was 13, I liked Polytheism over Mono...  I mean..  Today&amp;#39;s God is more like Ares. I could pray to Ares, and since he is the God of War, who am I wrong when the USA is the best at it. Huh?    -I digress, and totally off topic. &lt;/p&gt;\n\n&lt;p&gt;Two Thumbs up for You and your Roommate.  Check out the Singles Ward, at least most of those Mormon girls will still judge you by standards that they themselves broke long ago. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9ctey", "score_hidden": false, "stickied": false, "created": 1492215836.0, "created_utc": 1492187036.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9c4n5", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg95ypp", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Oh they've told the bishop and stake president as well as first and second counselors to the bishop AND his young men's leaders a whole different story. They would never believe is. My friend has tried and they just call him a liar. \nHe doesn't have an interest in the church anymore, neither of us do, but I still attend the ward down the street from my apartment every few weeks or so, my mom is now Mormon so its nice to keep up with the news. Plus I've been studying all types of religions since I was a kid. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh they&amp;#39;ve told the bishop and stake president as well as first and second counselors to the bishop AND his young men&amp;#39;s leaders a whole different story. They would never believe is. My friend has tried and they just call him a liar. \nHe doesn&amp;#39;t have an interest in the church anymore, neither of us do, but I still attend the ward down the street from my apartment every few weeks or so, my mom is now Mormon so its nice to keep up with the news. Plus I&amp;#39;ve been studying all types of religions since I was a kid. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9c4n5", "score_hidden": false, "stickied": false, "created": 1492215097.0, "created_utc": 1492186297.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95ypp", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "jftitan", "parent_id": "t1_dg8pa4q", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You are a awesome friend OP.  \n\nAlso help your roommate if he wishes to continue being an active Mormon, he should report all his parents actions to their bishop.  If not with the Bishop but with the President of stake their ward is apart of. \n\nSomeday the bishop or \"the church\" will want to find out, why.  Knowing so far what your roommates parent's have done, it wouldnt be a surprise the parents have told the bishop a whole different story, or even the bishop doesn't even know what is going on. \n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are a awesome friend OP.  &lt;/p&gt;\n\n&lt;p&gt;Also help your roommate if he wishes to continue being an active Mormon, he should report all his parents actions to their bishop.  If not with the Bishop but with the President of stake their ward is apart of. &lt;/p&gt;\n\n&lt;p&gt;Someday the bishop or &amp;quot;the church&amp;quot; will want to find out, why.  Knowing so far what your roommates parent&amp;#39;s have done, it wouldnt be a surprise the parents have told the bishop a whole different story, or even the bishop doesn&amp;#39;t even know what is going on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg95ypp", "score_hidden": false, "stickied": false, "created": 1492207483.0, "created_utc": 1492178683.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8pa4q", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg8f6rj", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you so much. That's very helpful. He currently has a good....300$ to his name. His parents have stolen the rest...he's getting a new bank (we're working on that tomorrow). I don't think pulling 300$ out is gonna be a problem but that's also good to know.\n\nHe DOES have a savings account that they locked him out of. We're hoping the banker will at LEAST give him his 300$ so he can pay to have his name added to the lease (costs 200$) if not, I'll just pay for it and lend him 100$ to makeup the difference.\n\nMy bank let me change my account from a child account to an adult account without any parental consent or knowledge, my mother made the account for me when I was 14 or so because I started helping her pay bills around that time. Luckily, I love my mom and she isn't insane like his. So it wouldn't have mattered anyway.\n\nOh and for the record I handle my finances very well and I'm only 19 thank you very much (; hahaha. \n\nThank you for your reply, very helpful.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much. That&amp;#39;s very helpful. He currently has a good....300$ to his name. His parents have stolen the rest...he&amp;#39;s getting a new bank (we&amp;#39;re working on that tomorrow). I don&amp;#39;t think pulling 300$ out is gonna be a problem but that&amp;#39;s also good to know.&lt;/p&gt;\n\n&lt;p&gt;He DOES have a savings account that they locked him out of. We&amp;#39;re hoping the banker will at LEAST give him his 300$ so he can pay to have his name added to the lease (costs 200$) if not, I&amp;#39;ll just pay for it and lend him 100$ to makeup the difference.&lt;/p&gt;\n\n&lt;p&gt;My bank let me change my account from a child account to an adult account without any parental consent or knowledge, my mother made the account for me when I was 14 or so because I started helping her pay bills around that time. Luckily, I love my mom and she isn&amp;#39;t insane like his. So it wouldn&amp;#39;t have mattered anyway.&lt;/p&gt;\n\n&lt;p&gt;Oh and for the record I handle my finances very well and I&amp;#39;m only 19 thank you very much (; hahaha. &lt;/p&gt;\n\n&lt;p&gt;Thank you for your reply, very helpful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8pa4q", "score_hidden": false, "stickied": false, "created": 1492169620.0, "created_utc": 1492140820.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8f6rj", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "chasingthunder", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Okay, so I can't speak about the legalities of most of your issues here, but I can help with your banking concerns/questions.\n\nThere's a lot of federal regulations when it comes to taking out large amounts of cash, so I would be very, very careful about withdrawing his funds in cash. Because, I mean, he's eighteen and I have yet to see many eighteen-year-olds with a strong grasp on budgeting and controlling cash flow. Plus, let's face it, it's super easy to spend money if it's in your wallet, as opposed to having it an account where it's slightly more tricky to access the funds.\n\nThat being said, any withdrawal or deposit at or over 10k in cash MUST be reported to the federal government in order to deter money laundering, because of the BSA (Bank Secrecy Act) that originated in 1970. If he has a large sum of money in his account now, and he takes it out suddenly, he's going to get a lot of questions about why. I'm not saying that anything fishy is going on, but I'd really, truly recommend transferring his money into another account, or get it in the form of a cashier's check (which is guaranteed funds) if you're deadset on getting a new account at another bank. Just some food for thought.\n\nAs far as closing out his account, you have to see how his account is titled. If it was opened ages ago, and his parents are listed as trustees or guardians, he can't do anything to get access to that money without his parents. And that's just the law, even though he isn't a minor anymore. He'll need one or both (depends on the bank) to come in and sign to withdraw the funds, and then close out the account. I would recommend this option. Have your friend open up a new checking account with himself listed as a SOW (sole owner). This will prohibit his parents from being able to get control of his money.\n\nIt can also depend on the type of account that he's in, as far as fees go. If he's in a savings account, be mindful of Reg D, which limits one's withdrawals/transfer transactions in a savings account to six per month. If you go over six transactions, you get fined. This fee depends on the bank. Some banks don't mess with Reg D at all, and if you exceed your six transactions in a month, you're converted to a checkings account, as you're clearly not using your savings to, well, save. Off of the top of my head, I can't think of any fees that are associated with closing out a checking account, but that really varies depending upon the bank.\n\nsource: IANAL, but I work in a bank.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, so I can&amp;#39;t speak about the legalities of most of your issues here, but I can help with your banking concerns/questions.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a lot of federal regulations when it comes to taking out large amounts of cash, so I would be very, very careful about withdrawing his funds in cash. Because, I mean, he&amp;#39;s eighteen and I have yet to see many eighteen-year-olds with a strong grasp on budgeting and controlling cash flow. Plus, let&amp;#39;s face it, it&amp;#39;s super easy to spend money if it&amp;#39;s in your wallet, as opposed to having it an account where it&amp;#39;s slightly more tricky to access the funds.&lt;/p&gt;\n\n&lt;p&gt;That being said, any withdrawal or deposit at or over 10k in cash MUST be reported to the federal government in order to deter money laundering, because of the BSA (Bank Secrecy Act) that originated in 1970. If he has a large sum of money in his account now, and he takes it out suddenly, he&amp;#39;s going to get a lot of questions about why. I&amp;#39;m not saying that anything fishy is going on, but I&amp;#39;d really, truly recommend transferring his money into another account, or get it in the form of a cashier&amp;#39;s check (which is guaranteed funds) if you&amp;#39;re deadset on getting a new account at another bank. Just some food for thought.&lt;/p&gt;\n\n&lt;p&gt;As far as closing out his account, you have to see how his account is titled. If it was opened ages ago, and his parents are listed as trustees or guardians, he can&amp;#39;t do anything to get access to that money without his parents. And that&amp;#39;s just the law, even though he isn&amp;#39;t a minor anymore. He&amp;#39;ll need one or both (depends on the bank) to come in and sign to withdraw the funds, and then close out the account. I would recommend this option. Have your friend open up a new checking account with himself listed as a SOW (sole owner). This will prohibit his parents from being able to get control of his money.&lt;/p&gt;\n\n&lt;p&gt;It can also depend on the type of account that he&amp;#39;s in, as far as fees go. If he&amp;#39;s in a savings account, be mindful of Reg D, which limits one&amp;#39;s withdrawals/transfer transactions in a savings account to six per month. If you go over six transactions, you get fined. This fee depends on the bank. Some banks don&amp;#39;t mess with Reg D at all, and if you exceed your six transactions in a month, you&amp;#39;re converted to a checkings account, as you&amp;#39;re clearly not using your savings to, well, save. Off of the top of my head, I can&amp;#39;t think of any fees that are associated with closing out a checking account, but that really varies depending upon the bank.&lt;/p&gt;\n\n&lt;p&gt;source: IANAL, but I work in a bank.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8f6rj", "score_hidden": false, "stickied": false, "created": 1492155389.0, "created_utc": 1492126589.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9z1xf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sunfried", "parent_id": "t1_dg9igih", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "What /u/JakeFortune claimed was documented was the actual penetration of simulated walls, and I've seen the same videos.  The ar-15 rounds did not penetrate as far as the 9mm and 12-gauge shot fired into the same walls, which were essentially standard interior walls in composition and thickness, but made in a portable size.\n\n.223 and 5.56 don't overpenetrate because they're still lightweight rounds, around 45-50% the mass of 9mm rounds.  As for tumbling, they definitely tumble as soon as they hit the first layer of wallboard. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What &lt;a href=\"/u/JakeFortune\"&gt;/u/JakeFortune&lt;/a&gt; claimed was documented was the actual penetration of simulated walls, and I&amp;#39;ve seen the same videos.  The ar-15 rounds did not penetrate as far as the 9mm and 12-gauge shot fired into the same walls, which were essentially standard interior walls in composition and thickness, but made in a portable size.&lt;/p&gt;\n\n&lt;p&gt;.223 and 5.56 don&amp;#39;t overpenetrate because they&amp;#39;re still lightweight rounds, around 45-50% the mass of 9mm rounds.  As for tumbling, they definitely tumble as soon as they hit the first layer of wallboard. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9z1xf", "score_hidden": false, "stickied": false, "created": 1492243190.0, "created_utc": 1492214390.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9igih", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "fooliam", "parent_id": "t1_dg9bpia", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "It isnt' a documented fact, its a perpetuated myth that .223 tumbles, as discussed here.\n\nhttp://www.ar15.com/forums/t_3_118/204514_Do__223_rounds_really_tumble_.html", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It isnt&amp;#39; a documented fact, its a perpetuated myth that .223 tumbles, as discussed here.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.ar15.com/forums/t_3_118/204514_Do__223_rounds_really_tumble_.html\"&gt;http://www.ar15.com/forums/t_3_118/204514_Do__223_rounds_really_tumble_.html&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9igih", "score_hidden": false, "stickied": false, "created": 1492222316.0, "created_utc": 1492193516.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9bpia", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "JakeFortune", "parent_id": "t1_dg8w39b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; (( (ASIDE - Not Legal Advice, Super Opinion Time) You sound like you live in an apartment complex. For all that is holy on God's green earth, please choose a different firearm for home protection. An AR-15 is a precision weapon meant for long-range firing; it has 'punch through' power, meaning that it won't just go through your target at the super-close ranges of an apartment, it'll go through the wall or the ceiling with incredible ease and right into a neighbor or child. Speak to a licensed gun dealer about short-ranged stoppers. ))\n\nI wish people would stop saying this.  Your are 100% incorrect.  The design of the .223 round is designed to tumble, and it has less penetration through levels of drywall than pistol rounds, shotgun pellets, everything else.  As it tumbles, it will most likely hit other levels of drywall flat and lose all velocity and fail to penetrate further.  \n\nThis is a documented fact, you can watch many videos of it on youtube where they fire all sorts of firearm through simulated walls and document penetration.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;(( (ASIDE - Not Legal Advice, Super Opinion Time) You sound like you live in an apartment complex. For all that is holy on God&amp;#39;s green earth, please choose a different firearm for home protection. An AR-15 is a precision weapon meant for long-range firing; it has &amp;#39;punch through&amp;#39; power, meaning that it won&amp;#39;t just go through your target at the super-close ranges of an apartment, it&amp;#39;ll go through the wall or the ceiling with incredible ease and right into a neighbor or child. Speak to a licensed gun dealer about short-ranged stoppers. ))&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I wish people would stop saying this.  Your are 100% incorrect.  The design of the .223 round is designed to tumble, and it has less penetration through levels of drywall than pistol rounds, shotgun pellets, everything else.  As it tumbles, it will most likely hit other levels of drywall flat and lose all velocity and fail to penetrate further.  &lt;/p&gt;\n\n&lt;p&gt;This is a documented fact, you can watch many videos of it on youtube where they fire all sorts of firearm through simulated walls and document penetration.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9bpia", "score_hidden": false, "stickied": false, "created": 1492214627.0, "created_utc": 1492185827.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8w39b", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "savageark", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "IANAL and this not legal advice, just life stuff:\n\nDon't be dramatic.  Don't overthink this.  You don't need to be playing tit-for-tat with these people, nor do you need to paint them as evil crazy demon-people, because they are either going to A: be forever crazy (in which case, oh well), or B: chill out in time when they own up to their baby not being a baby anymore.  Most parents eventually go with option 'B', so don't go telling your friend to start burning bridges by playing games of legal chicken with them.\n\nFirst off:  the cops aren't going to come hunting you down with a taser.  The first thing they're going to do is look at this report and go, \"Uh, he's 18.\"  Then they're going to do a welfare call or visit to your friend, which basically goes, \"Hey?  Are you being kidnapped?  Under duress?  No?  Cool, have a nice day, sir.\"  If a cop knocks on your door, be calm about it, because they're just going to be following up on the paperwork and this will not have been the first crazy parent they've dealt with.  \n\nSecondly:  Even though you mentioned you are a safe gun-owner, it's a red flag that you are considering an AR-15 as a defense to a confrontation that may or may not even happen.  You're \"priming\" yourself for that, so just don't.  Keep the gun put away and simply don't open your door.  In fact, call your apartment and request them to have a peephole installed in your door if you do not already have one, and use it.  If you think he's going to try and force through the door, brace it, call the apartment security AND the cops.  (Apartment security because they can get there first, 9 times out of 10, AND serve as highly credible witnesses.)  The amount of force it takes to Hulk-Smash your way through a wood door that's got deadbolts in the structure frame (which you can install yourself, or get the apartment to install) and a properly leveraged hardwood chair or door bar/brace is extremely high.  Also, a sufficient taser will drop even the burliest of \"Big Dudes.\"  So unless Dad is an avid user of coke and trained in the fine art of door breaching, I would stick to retreating from danger rather than facing it head-on.   \n\n((   **(ASIDE - Not Legal Advice, Super Opinion Time)**  You sound like you live in an apartment complex.  For all that is holy on God's green earth, please choose a different firearm for home protection.  An AR-15 is a precision weapon meant for long-range firing; it has 'punch through' power, meaning that it won't just go through your target at the super-close ranges of an apartment, it'll go through the wall or the ceiling with incredible ease and right into a neighbor or child.  Speak to a licensed gun dealer about short-ranged stoppers. ))\n \n\nAnother poster gave you wonderful advice -- basically, get the important ID documents, open a bank account, and move out.\n\nI will add on to this:\n\n*  When you go to set up the new bank account, pull it all in cash and close the account completely.  Do not leave it open if you don't have to.  Read up ahead of time on what the bank will need to do this.\n\n*  Withdraw in cash.  Your new account will be immediately funded with a cash deposit, as opposed to a transfer or check, which can take several days to clear.  BE FOREWARNED:  Some banks will freeze funds for 15-30 days on a new account, so deposit only enough to open the account if this will be the policy at your friend's new bank, and live on the rest of the cash or have it put on a buffer card (pre-paid credit card).\n\n\n\nAs for him sneaking out of church or leaving his belongings -- this is unnecessary, and honestly, makes it look sneakier than it needs to be.\n\nHe needs to call the police and tell them he'd like an escort to get his personal belongings.  This does two things: one, makes it safe for him to get ALL of his belongings, and two, establishes the fact that he is moving, hasn't stolen anything, and that his parents may try to be idiots and file false reports.  If he has too much stuff or large items that he's bought himself, you can rent a pull-trailer from Home Depot or UHaul.  (Even at 18.)  \n\n\nLast Bit of Advice:\n\nContrary to popular belief, compulsory tithing isn't normal OR standard in Christian churches.  If the church is a relatively normal one, he can contact them directly and let them know that the tithing is stolen, and that they should cancel and reject future requests for setting up automatic withdrawals (IF the tithing is being set up on the church's end).  They may even be willing to reverse the withdrawals.  Assuming they aren't some hole-in-the-wall cult-church, they should be willing to work with him to prevent future financial meddling.  ", "edited": 1492155629.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IANAL and this not legal advice, just life stuff:&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be dramatic.  Don&amp;#39;t overthink this.  You don&amp;#39;t need to be playing tit-for-tat with these people, nor do you need to paint them as evil crazy demon-people, because they are either going to A: be forever crazy (in which case, oh well), or B: chill out in time when they own up to their baby not being a baby anymore.  Most parents eventually go with option &amp;#39;B&amp;#39;, so don&amp;#39;t go telling your friend to start burning bridges by playing games of legal chicken with them.&lt;/p&gt;\n\n&lt;p&gt;First off:  the cops aren&amp;#39;t going to come hunting you down with a taser.  The first thing they&amp;#39;re going to do is look at this report and go, &amp;quot;Uh, he&amp;#39;s 18.&amp;quot;  Then they&amp;#39;re going to do a welfare call or visit to your friend, which basically goes, &amp;quot;Hey?  Are you being kidnapped?  Under duress?  No?  Cool, have a nice day, sir.&amp;quot;  If a cop knocks on your door, be calm about it, because they&amp;#39;re just going to be following up on the paperwork and this will not have been the first crazy parent they&amp;#39;ve dealt with.  &lt;/p&gt;\n\n&lt;p&gt;Secondly:  Even though you mentioned you are a safe gun-owner, it&amp;#39;s a red flag that you are considering an AR-15 as a defense to a confrontation that may or may not even happen.  You&amp;#39;re &amp;quot;priming&amp;quot; yourself for that, so just don&amp;#39;t.  Keep the gun put away and simply don&amp;#39;t open your door.  In fact, call your apartment and request them to have a peephole installed in your door if you do not already have one, and use it.  If you think he&amp;#39;s going to try and force through the door, brace it, call the apartment security AND the cops.  (Apartment security because they can get there first, 9 times out of 10, AND serve as highly credible witnesses.)  The amount of force it takes to Hulk-Smash your way through a wood door that&amp;#39;s got deadbolts in the structure frame (which you can install yourself, or get the apartment to install) and a properly leveraged hardwood chair or door bar/brace is extremely high.  Also, a sufficient taser will drop even the burliest of &amp;quot;Big Dudes.&amp;quot;  So unless Dad is an avid user of coke and trained in the fine art of door breaching, I would stick to retreating from danger rather than facing it head-on.   &lt;/p&gt;\n\n&lt;p&gt;((   &lt;strong&gt;(ASIDE - Not Legal Advice, Super Opinion Time)&lt;/strong&gt;  You sound like you live in an apartment complex.  For all that is holy on God&amp;#39;s green earth, please choose a different firearm for home protection.  An AR-15 is a precision weapon meant for long-range firing; it has &amp;#39;punch through&amp;#39; power, meaning that it won&amp;#39;t just go through your target at the super-close ranges of an apartment, it&amp;#39;ll go through the wall or the ceiling with incredible ease and right into a neighbor or child.  Speak to a licensed gun dealer about short-ranged stoppers. ))&lt;/p&gt;\n\n&lt;p&gt;Another poster gave you wonderful advice -- basically, get the important ID documents, open a bank account, and move out.&lt;/p&gt;\n\n&lt;p&gt;I will add on to this:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;When you go to set up the new bank account, pull it all in cash and close the account completely.  Do not leave it open if you don&amp;#39;t have to.  Read up ahead of time on what the bank will need to do this.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Withdraw in cash.  Your new account will be immediately funded with a cash deposit, as opposed to a transfer or check, which can take several days to clear.  BE FOREWARNED:  Some banks will freeze funds for 15-30 days on a new account, so deposit only enough to open the account if this will be the policy at your friend&amp;#39;s new bank, and live on the rest of the cash or have it put on a buffer card (pre-paid credit card).&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;As for him sneaking out of church or leaving his belongings -- this is unnecessary, and honestly, makes it look sneakier than it needs to be.&lt;/p&gt;\n\n&lt;p&gt;He needs to call the police and tell them he&amp;#39;d like an escort to get his personal belongings.  This does two things: one, makes it safe for him to get ALL of his belongings, and two, establishes the fact that he is moving, hasn&amp;#39;t stolen anything, and that his parents may try to be idiots and file false reports.  If he has too much stuff or large items that he&amp;#39;s bought himself, you can rent a pull-trailer from Home Depot or UHaul.  (Even at 18.)  &lt;/p&gt;\n\n&lt;p&gt;Last Bit of Advice:&lt;/p&gt;\n\n&lt;p&gt;Contrary to popular belief, compulsory tithing isn&amp;#39;t normal OR standard in Christian churches.  If the church is a relatively normal one, he can contact them directly and let them know that the tithing is stolen, and that they should cancel and reject future requests for setting up automatic withdrawals (IF the tithing is being set up on the church&amp;#39;s end).  They may even be willing to reverse the withdrawals.  Assuming they aren&amp;#39;t some hole-in-the-wall cult-church, they should be willing to work with him to prevent future financial meddling.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8w39b", "score_hidden": false, "stickied": false, "created": 1492183306.0, "created_utc": 1492154506.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg8shh7", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "triscuitzop", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; If they show up at his school and force him to come back...\n\n\"Force\" is a bit general. If the parent convince him to move back via words, then this friend needs to grow a spine. If they physically restrain him and lock him in a room, then it's probably assault and kidnapping.\n\nPerhaps have this friend practice saying \"no\", if you're worried?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If they show up at his school and force him to come back...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;Force&amp;quot; is a bit general. If the parent convince him to move back via words, then this friend needs to grow a spine. If they physically restrain him and lock him in a room, then it&amp;#39;s probably assault and kidnapping.&lt;/p&gt;\n\n&lt;p&gt;Perhaps have this friend practice saying &amp;quot;no&amp;quot;, if you&amp;#39;re worried?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8shh7", "score_hidden": false, "stickied": false, "created": 1492175075.0, "created_utc": 1492146275.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg8jzhy", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "thatsghastly", "parent_id": "t1_dg8g4a3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I'd also like to add that if he does get involuntarily dropped from his parents insurance, that is considered a \"Qualifying Life Event\" that would allow him to enroll in insurance outside of Open Enrollment. He can apply through his state exchange or healthcare.gov", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d also like to add that if he does get involuntarily dropped from his parents insurance, that is considered a &amp;quot;Qualifying Life Event&amp;quot; that would allow him to enroll in insurance outside of Open Enrollment. He can apply through his state exchange or healthcare.gov&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8jzhy", "score_hidden": false, "stickied": false, "created": 1492161967.0, "created_utc": 1492133167.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9txch", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedShirtDecoy", "parent_id": "t1_dg9cc00", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "No problem at all and Im glad I could help at least a little.  \n\nIf you want to read a little more about what information is protected now that he is a legal adult check out the [HIPAA wiki page](https://en.wikipedia.org/wiki/Health_Insurance_Portability_and_Accountability_Act). \n\nHIPAA is a federal law that made PHI what it is.   \n\nAlso... if either of you have any questions in the future regarding this specific aspect just let me know.  While I wont be able to answer specific questions about his plan I can help you out with what to ask and who to call regarding these issues.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem at all and Im glad I could help at least a little.  &lt;/p&gt;\n\n&lt;p&gt;If you want to read a little more about what information is protected now that he is a legal adult check out the &lt;a href=\"https://en.wikipedia.org/wiki/Health_Insurance_Portability_and_Accountability_Act\"&gt;HIPAA wiki page&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;HIPAA is a federal law that made PHI what it is.   &lt;/p&gt;\n\n&lt;p&gt;Also... if either of you have any questions in the future regarding this specific aspect just let me know.  While I wont be able to answer specific questions about his plan I can help you out with what to ask and who to call regarding these issues.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9txch", "score_hidden": false, "stickied": false, "created": 1492236357.0, "created_utc": 1492207557.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9z36y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fludru", "parent_id": "t1_dg9cc00", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "If he is of limited means then I would also encourage you to check out the requirements for Medicaid in your state. He may not be able to afford to buy coverage based on his income.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If he is of limited means then I would also encourage you to check out the requirements for Medicaid in your state. He may not be able to afford to buy coverage based on his income.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9z36y", "score_hidden": false, "stickied": false, "created": 1492243237.0, "created_utc": 1492214437.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cc00", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg9bpd9", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "That's awesome. This is all fantastic, he's coming over after I get off work today (I normally don't work Fridays which is why Friday is our meeting day, but they've asked me to come in for 3 hours to lead some training session). I'll pass all this information on to him. Thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s awesome. This is all fantastic, he&amp;#39;s coming over after I get off work today (I normally don&amp;#39;t work Fridays which is why Friday is our meeting day, but they&amp;#39;ve asked me to come in for 3 hours to lead some training session). I&amp;#39;ll pass all this information on to him. Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9cc00", "score_hidden": false, "stickied": false, "created": 1492215309.0, "created_utc": 1492186509.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9bpd9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedShirtDecoy", "parent_id": "t1_dg8pyel", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Sorry for the delay in response.  \n\nThe insurance company wont call his parents just to let them know he called to ask a question but each call is recorded and logged.  \n\nSo if his parents called the insurance company and inquired about previous calls the agent could tell them he called in but cannot give any [PHI \\(protected health information... diagnoses, procedures, ect).](https://en.wikipedia.org/wiki/Protected_health_information)  I believe this also includes his new address but you might want to double check this when you call.  \n\nI think they can also give the time and day that he called.  \n\nNow... what they absolutely cannot do...\n\nIf he has any pending claims while under their plan they cannot force the insurance company to deny those claims, they cannot give PHI to his parents, they cannot force the insurance to go against their contract with providers (ie, cant force the insurance company to process claims differently because they said so) , cannot interfere with authorizations or pre-determinations, ect. \n\nAs the legal policy holder his parent would be able to get certain information from claims however.  Ie, the amount owed, the amount applied to the deductible, and the doctors name.  \n\nThat said... even if they get the doctors name, as an adult dependent, his PHI is still protected at the doctors office.  So if his parents find out what doctor he is seeing they cannot give any information on future appointments, cannot have the parents cancel any services, ect.  \n\nAll this said... if he does stay on their plan and goes to the doctor *he needs to make sure to explain the situation to those in the office so they understand the gravity of the situation*.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for the delay in response.  &lt;/p&gt;\n\n&lt;p&gt;The insurance company wont call his parents just to let them know he called to ask a question but each call is recorded and logged.  &lt;/p&gt;\n\n&lt;p&gt;So if his parents called the insurance company and inquired about previous calls the agent could tell them he called in but cannot give any &lt;a href=\"https://en.wikipedia.org/wiki/Protected_health_information\"&gt;PHI (protected health information... diagnoses, procedures, ect).&lt;/a&gt;  I believe this also includes his new address but you might want to double check this when you call.  &lt;/p&gt;\n\n&lt;p&gt;I think they can also give the time and day that he called.  &lt;/p&gt;\n\n&lt;p&gt;Now... what they absolutely cannot do...&lt;/p&gt;\n\n&lt;p&gt;If he has any pending claims while under their plan they cannot force the insurance company to deny those claims, they cannot give PHI to his parents, they cannot force the insurance to go against their contract with providers (ie, cant force the insurance company to process claims differently because they said so) , cannot interfere with authorizations or pre-determinations, ect. &lt;/p&gt;\n\n&lt;p&gt;As the legal policy holder his parent would be able to get certain information from claims however.  Ie, the amount owed, the amount applied to the deductible, and the doctors name.  &lt;/p&gt;\n\n&lt;p&gt;That said... even if they get the doctors name, as an adult dependent, his PHI is still protected at the doctors office.  So if his parents find out what doctor he is seeing they cannot give any information on future appointments, cannot have the parents cancel any services, ect.  &lt;/p&gt;\n\n&lt;p&gt;All this said... if he does stay on their plan and goes to the doctor &lt;em&gt;he needs to make sure to explain the situation to those in the office so they understand the gravity of the situation&lt;/em&gt;.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9bpd9", "score_hidden": false, "stickied": false, "created": 1492214623.0, "created_utc": 1492185823.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8pyel", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg8g4a3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I'm currently getting him a job at my workplace. He's a little young to be an engineer but then again so am I. I'm good friends with the recruiting team and my work offers full coverage insurance.\n\nThank you for that, its very helpful. Would you happen to know the likelihood of his parents finding out about the call? That will determine when we call.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m currently getting him a job at my workplace. He&amp;#39;s a little young to be an engineer but then again so am I. I&amp;#39;m good friends with the recruiting team and my work offers full coverage insurance.&lt;/p&gt;\n\n&lt;p&gt;Thank you for that, its very helpful. Would you happen to know the likelihood of his parents finding out about the call? That will determine when we call.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8pyel", "score_hidden": false, "stickied": false, "created": 1492170697.0, "created_utc": 1492141897.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8g4a3", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "RedShirtDecoy", "parent_id": "t1_dg87ucp", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Hey OP... I am not a lawyer and I dont know what his parents plan says but I have worked customer service for a major health insurance company before and might be able to help you out with the insurance question.  \n\nWhat I can say for certain is that yes... the law says dependents can can stay on their parents plan until the age of 26 BUT...   \n\nif he can be removed by his parents it is entirely based on the plan.  \n\nThe plan I worked on if the parents wanted to remove the dependent without the dependents ok then it took hell or high water to do so.  But other plans they can just request that they be removed.  \n\nNow... there is a very high chance that even if they have a plan where they can remove him no questions asked that they cannot do so until that plans \"open season\".  Basically a 1-2 month time frame where insurance companies allow people to change their plans.  \n\nThe only other way to change a plan is for a \"qualifying lifetime event\".  ie... birth of a baby, divorce, death, marriage, ect.  \n\nHere is what he needs to do... call up the insurance company and ask them.  As a current adult dependent on the plan he is well within his rights to do so.  \n\nAsk them if his parents can remove him during open season no questions asked and ask when open season is.  This will give him an idea of how long he will stay on the plan so he can get his stuff in order.  Might even give him enough time to get a job that provides their own benefits.  \n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey OP... I am not a lawyer and I dont know what his parents plan says but I have worked customer service for a major health insurance company before and might be able to help you out with the insurance question.  &lt;/p&gt;\n\n&lt;p&gt;What I can say for certain is that yes... the law says dependents can can stay on their parents plan until the age of 26 BUT...   &lt;/p&gt;\n\n&lt;p&gt;if he can be removed by his parents it is entirely based on the plan.  &lt;/p&gt;\n\n&lt;p&gt;The plan I worked on if the parents wanted to remove the dependent without the dependents ok then it took hell or high water to do so.  But other plans they can just request that they be removed.  &lt;/p&gt;\n\n&lt;p&gt;Now... there is a very high chance that even if they have a plan where they can remove him no questions asked that they cannot do so until that plans &amp;quot;open season&amp;quot;.  Basically a 1-2 month time frame where insurance companies allow people to change their plans.  &lt;/p&gt;\n\n&lt;p&gt;The only other way to change a plan is for a &amp;quot;qualifying lifetime event&amp;quot;.  ie... birth of a baby, divorce, death, marriage, ect.  &lt;/p&gt;\n\n&lt;p&gt;Here is what he needs to do... call up the insurance company and ask them.  As a current adult dependent on the plan he is well within his rights to do so.  &lt;/p&gt;\n\n&lt;p&gt;Ask them if his parents can remove him during open season no questions asked and ask when open season is.  This will give him an idea of how long he will stay on the plan so he can get his stuff in order.  Might even give him enough time to get a job that provides their own benefits.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8g4a3", "score_hidden": false, "stickied": false, "created": 1492156656.0, "created_utc": 1492127856.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87ucp", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg84pwr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you for your reply. As far as your reply to 2 goes, He is asking, not me. I personally have issues with my father and I've since dropped myself from his medical insurance, phone plan, and any other ties to him.\n\nMy roommate has a job and I am in the works of trying to convince him to just pay for his own insurance, the less ties with his parents the better. I agree it is very much a dick move to leave without telling anyone then expect them to keep paying for shit.\n\nI noticed a trend in the comments so far about my gun, i've clarified why i asked these things in a post edit. I can assure you I am a safe gun owner and I know when and when not to use a firearm or any other form of physical defense for that matter. If you are still concerned please read my edit. I appreciate your concern, but rest assured I am responsible enough to own a firearm.\n\nAs far as growing up goes, I have grown up a lot quicker than I'd like to have grown up. I still have a long way to go and a lot to learn though. For example, I have been paying for my moms college since I was 14 years old. I worked whatever jobs I could get to help pay bills, for my moms college and I've had to take care of my siblings, by myself, since under the age of 10. I worked 40-80 hour weeks on-top of schooling. I raised my little brother. We lived in a very bad area and when my dad left us I was forced to grow up very quickly. It was uncomfortable but I had to do it. Being the oldest male, my family needed me.\n\nI hope this sheds light on my situation. I appreciate your concern but trust me, there is no need for concern.\n\nThank you again for your reply.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your reply. As far as your reply to 2 goes, He is asking, not me. I personally have issues with my father and I&amp;#39;ve since dropped myself from his medical insurance, phone plan, and any other ties to him.&lt;/p&gt;\n\n&lt;p&gt;My roommate has a job and I am in the works of trying to convince him to just pay for his own insurance, the less ties with his parents the better. I agree it is very much a dick move to leave without telling anyone then expect them to keep paying for shit.&lt;/p&gt;\n\n&lt;p&gt;I noticed a trend in the comments so far about my gun, i&amp;#39;ve clarified why i asked these things in a post edit. I can assure you I am a safe gun owner and I know when and when not to use a firearm or any other form of physical defense for that matter. If you are still concerned please read my edit. I appreciate your concern, but rest assured I am responsible enough to own a firearm.&lt;/p&gt;\n\n&lt;p&gt;As far as growing up goes, I have grown up a lot quicker than I&amp;#39;d like to have grown up. I still have a long way to go and a lot to learn though. For example, I have been paying for my moms college since I was 14 years old. I worked whatever jobs I could get to help pay bills, for my moms college and I&amp;#39;ve had to take care of my siblings, by myself, since under the age of 10. I worked 40-80 hour weeks on-top of schooling. I raised my little brother. We lived in a very bad area and when my dad left us I was forced to grow up very quickly. It was uncomfortable but I had to do it. Being the oldest male, my family needed me.&lt;/p&gt;\n\n&lt;p&gt;I hope this sheds light on my situation. I appreciate your concern but trust me, there is no need for concern.&lt;/p&gt;\n\n&lt;p&gt;Thank you again for your reply.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg87ucp", "score_hidden": false, "stickied": false, "created": 1492145985.0, "created_utc": 1492117185.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84pwr", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "theoriginalharbinger", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "So, google's your friend for most of these. I live in Utah, I'm ex-Mormon, so my first thought is that it sounds like everybody here is a bit high-strung. Going down your list:\n\n1) Sure. They can cut off all financial support to him. If he doesn't have a job, then that kinda leaves him with fewer options. Beyond that, unless they have guardianship - no.\n\n2)  ACA mandated dependent coverage until age 26. *However*, he could still get dropped from his parents' plan at his dad's request. Moreover, you can't both get insurance and not have a mailing address. I'd also add that it's rather forked-tongued of you to lambast his parents in one sentence then expect them to provide a lot of financial support in the other.\n\nYour friend's best bet is to get a job.\n\n3) Uh... none of this makes sense. \"Show up at his school?\" Are y'all in high school or in college? Kidnapping has explicit definitions. If they physically manhandle him, yeah, that's kidnapping. If they say \"We will not pay for your college if you don't come back with us,\" it's not. \"Force\" has a fairly explicit legal definition, which usually includes threat of grievous bodily harm. If that doesn't apply, then neither does any kind of force/kidnapping concern.\n\n4) Depends entirely on how the bank account was structured. Most of the time, no problem. Some credit unions require all accountholders' signatures in order to close an account.\n\n5) You getting a restraining order would be stupid and pointless. *He* can get one, but again, only if a fairly narrow set of circumstances apply. \"They're unpleasant people I happen to be related to\" is not one of them. \"Need to be able to threaten them with something\" is also foolhardy. You need to tell them to go away. *Then*, if they refuse, you call the police, who will trespass them. *Then* you can consider a restraining order. Otherwise, it's a lengthy judicial process where you'll have to present evidence that they're an imminent threat *to you*, which will irreparably harm your roommates' relationship with them.\n\n6) Depends entirely on how they gained entry. Break a window or door? Yes. If you invite them in and they refuse to leave, they're trespassing. Call the police.\n\n\"If there's a conflict it'll be a fistfight\"\n\nJesus, dude. Have somebody else hold onto your rifle until you get your head straightened out. Because you need to grow up, fast. If you can't comport yourself like an adult - which means hashing out disagreements without physical violence - then don't play with adult things.\n\nAs far as legal repercussions, if you permit someone inside your home *and then proceed to fight and/or shoot him*, you can expect to be arrested, arraigned, and need to post bail (for a shooting, it's not cheap).\n\nI'll reiterate: grow up. I have a wall of AR-15's, but part of responsible gun ownership is not indulging in wild flights of fancy about shooting 50+-year-old concerned parents.\n\n7) If they file a report, have your roomie answer the phone when the police call (first thing they'll do) and he'll tell said police he's safe, sound, and not under duress. The police may want to do a home/welfare visit. It's not filing a false report if they convey the facts as they know it.\n\n8) Legally, you're in the clear. However, I'd suggest that everyone has a lot of growing up to do first.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, google&amp;#39;s your friend for most of these. I live in Utah, I&amp;#39;m ex-Mormon, so my first thought is that it sounds like everybody here is a bit high-strung. Going down your list:&lt;/p&gt;\n\n&lt;p&gt;1) Sure. They can cut off all financial support to him. If he doesn&amp;#39;t have a job, then that kinda leaves him with fewer options. Beyond that, unless they have guardianship - no.&lt;/p&gt;\n\n&lt;p&gt;2)  ACA mandated dependent coverage until age 26. &lt;em&gt;However&lt;/em&gt;, he could still get dropped from his parents&amp;#39; plan at his dad&amp;#39;s request. Moreover, you can&amp;#39;t both get insurance and not have a mailing address. I&amp;#39;d also add that it&amp;#39;s rather forked-tongued of you to lambast his parents in one sentence then expect them to provide a lot of financial support in the other.&lt;/p&gt;\n\n&lt;p&gt;Your friend&amp;#39;s best bet is to get a job.&lt;/p&gt;\n\n&lt;p&gt;3) Uh... none of this makes sense. &amp;quot;Show up at his school?&amp;quot; Are y&amp;#39;all in high school or in college? Kidnapping has explicit definitions. If they physically manhandle him, yeah, that&amp;#39;s kidnapping. If they say &amp;quot;We will not pay for your college if you don&amp;#39;t come back with us,&amp;quot; it&amp;#39;s not. &amp;quot;Force&amp;quot; has a fairly explicit legal definition, which usually includes threat of grievous bodily harm. If that doesn&amp;#39;t apply, then neither does any kind of force/kidnapping concern.&lt;/p&gt;\n\n&lt;p&gt;4) Depends entirely on how the bank account was structured. Most of the time, no problem. Some credit unions require all accountholders&amp;#39; signatures in order to close an account.&lt;/p&gt;\n\n&lt;p&gt;5) You getting a restraining order would be stupid and pointless. &lt;em&gt;He&lt;/em&gt; can get one, but again, only if a fairly narrow set of circumstances apply. &amp;quot;They&amp;#39;re unpleasant people I happen to be related to&amp;quot; is not one of them. &amp;quot;Need to be able to threaten them with something&amp;quot; is also foolhardy. You need to tell them to go away. &lt;em&gt;Then&lt;/em&gt;, if they refuse, you call the police, who will trespass them. &lt;em&gt;Then&lt;/em&gt; you can consider a restraining order. Otherwise, it&amp;#39;s a lengthy judicial process where you&amp;#39;ll have to present evidence that they&amp;#39;re an imminent threat &lt;em&gt;to you&lt;/em&gt;, which will irreparably harm your roommates&amp;#39; relationship with them.&lt;/p&gt;\n\n&lt;p&gt;6) Depends entirely on how they gained entry. Break a window or door? Yes. If you invite them in and they refuse to leave, they&amp;#39;re trespassing. Call the police.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;If there&amp;#39;s a conflict it&amp;#39;ll be a fistfight&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Jesus, dude. Have somebody else hold onto your rifle until you get your head straightened out. Because you need to grow up, fast. If you can&amp;#39;t comport yourself like an adult - which means hashing out disagreements without physical violence - then don&amp;#39;t play with adult things.&lt;/p&gt;\n\n&lt;p&gt;As far as legal repercussions, if you permit someone inside your home &lt;em&gt;and then proceed to fight and/or shoot him&lt;/em&gt;, you can expect to be arrested, arraigned, and need to post bail (for a shooting, it&amp;#39;s not cheap).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll reiterate: grow up. I have a wall of AR-15&amp;#39;s, but part of responsible gun ownership is not indulging in wild flights of fancy about shooting 50+-year-old concerned parents.&lt;/p&gt;\n\n&lt;p&gt;7) If they file a report, have your roomie answer the phone when the police call (first thing they&amp;#39;ll do) and he&amp;#39;ll tell said police he&amp;#39;s safe, sound, and not under duress. The police may want to do a home/welfare visit. It&amp;#39;s not filing a false report if they convey the facts as they know it.&lt;/p&gt;\n\n&lt;p&gt;8) Legally, you&amp;#39;re in the clear. However, I&amp;#39;d suggest that everyone has a lot of growing up to do first.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg84pwr", "score_hidden": false, "stickied": false, "created": 1492142484.0, "created_utc": 1492113684.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9hnw5", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "fooliam", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt;1) Is there anything they can do to force him to come back?\n\nThey would need to have a court order extending guardianship. This would require the parents to prove to a court that your friend is unable to care for himself or make his own decisions.  Unless he has a major disability, this isn't going to happen.\n\n&gt;2) I heard something about parents not being allowed to kick you off medical insurance 'til you're 25, is this true? If so, is this true in Utah?\n\nParents *have the option* of retaining a child on their health insurance until the child is 26.  They are not required to do this.\n\n&gt;3) If they show up at his school and force him to come back, could I file a viable police report for kidnapping? That wouldn't be a false police report right?\n\nIf they show up and are trying to *force* him to do anything, you don't wait to file a police report.  You call the police then an there.  If they are trying to *convince* him to come back, the situation changes.  \n\n&gt;4) We can go into his bank, switch the account to an adult account instead of a child one and withdraw all his money in cash, is there anything wrong with this plan? I don't want to break any laws. (we except fees but neither of us see any laws being broken)\n\nThis may or may not be possible.  If the parents are alos listed on the account, he likely won't be able to make any changes to the account without their signing off on it.  Whether or not he will be able to withdraw a significant amount is also dependent on a lot of factors we don't have here.  Your friend might be better off just opening up a new account.\n\n&gt;5) How easily can i get a restraining order? Because his parents will try to track him down and if they find us I need to be able to threaten them with something.\n\nThat's not how it works.  Restraining orders are granted when there is evidence or good reason to believe that one person wishes harm to another.  \"His parents are nuts\" isn't likely to be a good enough reason.  If they show up and won't leave, call the police.  If you have a police report that says they showed up and were violent and/or aggressive, then you have grounds to seek a restraining order.  However, without evidence showing an intent to intimidate or harm your friend, he has virtually no grounds to get an order of protection.\n\n&gt;6) If i tell someone to leave my apartment and that they are not welcome to come back or communicate with either of us, am i allowed to take forceful physical action against them legally? I own an AR-15, I don't plan to shoot anyone, if theres any conflict it'll be a fist fight, would this be allowed? His dad is also a very big dude who doesn't take no for an answer, so on the slight chance it escalates to the point where I'm forced, for my health and safety to fight him (or god forbid, shoot him), are there any legal repercussions i should expect?\n\nIf you get into a fight or shoot someone, you can expect to be arrested for assault/battery, brandishing a weapon, attempted murder, and a range of other charges.  If he shows up, don't let him into your apartment.  If he won't leave, call the police.  Do not instigate any violence of any kind.  Unless you are in imminent fear for your life, you have the option to just *leave* and call the police.  DO not do something completely fucking stupid like answer the door with a gun in your hand, do not threaten to harm anyone, do not even make any statements that could generously be construed as threats.  Do not say anything that isn't a conservative variation on \"you need to leave\" or \"I am calling the police.\"  \n\n&gt;7) If we leave a note and they file a kidnapping or missing person report anyway (which they are crazy enough to do), how do i counteract that? Filing a false police report is a crime i know that, but what do I need to do to tell the cops that he's with me, safe, by his own will, prove we left a note all without being tazed?\n\nSettle down on the drama there, Capote. Cops aren't going to go storming into an apartment because a legal adult moved out of their parents' house of their own volition.  If the parents do want to say their son was kidnapped, and the cops show up at your apartment, just tell them that your friend voluntarily left, give the cops his cell phone number, and wait for them to confirm that he left of his own volition.  Also, watch fewer crime dramas.\n\n\n&gt;8) Lastly, is there anything they could do that would be considered within the law that can hurt us? He isn't going to have belongings for them to take from him anymore, just his clothes. But is there anything they could charge us with legally or anything they could physically do that wouldn't be against the law that could harm us?\n\nNope, not really.  They can cut their kid off from any support (cell phone bills, school tuition, health insurance, etc)\n\nPrior to leaving, your friend needs to gather up important documents: social security card and birth certificate being the most important among them.  He can leave a not, or not.  That doesn't really change anything.  There is no legal benefit to leaving a note, and no legal consequences to not leaving one.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;1) Is there anything they can do to force him to come back?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They would need to have a court order extending guardianship. This would require the parents to prove to a court that your friend is unable to care for himself or make his own decisions.  Unless he has a major disability, this isn&amp;#39;t going to happen.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;2) I heard something about parents not being allowed to kick you off medical insurance &amp;#39;til you&amp;#39;re 25, is this true? If so, is this true in Utah?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Parents &lt;em&gt;have the option&lt;/em&gt; of retaining a child on their health insurance until the child is 26.  They are not required to do this.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;3) If they show up at his school and force him to come back, could I file a viable police report for kidnapping? That wouldn&amp;#39;t be a false police report right?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If they show up and are trying to &lt;em&gt;force&lt;/em&gt; him to do anything, you don&amp;#39;t wait to file a police report.  You call the police then an there.  If they are trying to &lt;em&gt;convince&lt;/em&gt; him to come back, the situation changes.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;4) We can go into his bank, switch the account to an adult account instead of a child one and withdraw all his money in cash, is there anything wrong with this plan? I don&amp;#39;t want to break any laws. (we except fees but neither of us see any laws being broken)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This may or may not be possible.  If the parents are alos listed on the account, he likely won&amp;#39;t be able to make any changes to the account without their signing off on it.  Whether or not he will be able to withdraw a significant amount is also dependent on a lot of factors we don&amp;#39;t have here.  Your friend might be better off just opening up a new account.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;5) How easily can i get a restraining order? Because his parents will try to track him down and if they find us I need to be able to threaten them with something.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not how it works.  Restraining orders are granted when there is evidence or good reason to believe that one person wishes harm to another.  &amp;quot;His parents are nuts&amp;quot; isn&amp;#39;t likely to be a good enough reason.  If they show up and won&amp;#39;t leave, call the police.  If you have a police report that says they showed up and were violent and/or aggressive, then you have grounds to seek a restraining order.  However, without evidence showing an intent to intimidate or harm your friend, he has virtually no grounds to get an order of protection.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;6) If i tell someone to leave my apartment and that they are not welcome to come back or communicate with either of us, am i allowed to take forceful physical action against them legally? I own an AR-15, I don&amp;#39;t plan to shoot anyone, if theres any conflict it&amp;#39;ll be a fist fight, would this be allowed? His dad is also a very big dude who doesn&amp;#39;t take no for an answer, so on the slight chance it escalates to the point where I&amp;#39;m forced, for my health and safety to fight him (or god forbid, shoot him), are there any legal repercussions i should expect?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you get into a fight or shoot someone, you can expect to be arrested for assault/battery, brandishing a weapon, attempted murder, and a range of other charges.  If he shows up, don&amp;#39;t let him into your apartment.  If he won&amp;#39;t leave, call the police.  Do not instigate any violence of any kind.  Unless you are in imminent fear for your life, you have the option to just &lt;em&gt;leave&lt;/em&gt; and call the police.  DO not do something completely fucking stupid like answer the door with a gun in your hand, do not threaten to harm anyone, do not even make any statements that could generously be construed as threats.  Do not say anything that isn&amp;#39;t a conservative variation on &amp;quot;you need to leave&amp;quot; or &amp;quot;I am calling the police.&amp;quot;  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;7) If we leave a note and they file a kidnapping or missing person report anyway (which they are crazy enough to do), how do i counteract that? Filing a false police report is a crime i know that, but what do I need to do to tell the cops that he&amp;#39;s with me, safe, by his own will, prove we left a note all without being tazed?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Settle down on the drama there, Capote. Cops aren&amp;#39;t going to go storming into an apartment because a legal adult moved out of their parents&amp;#39; house of their own volition.  If the parents do want to say their son was kidnapped, and the cops show up at your apartment, just tell them that your friend voluntarily left, give the cops his cell phone number, and wait for them to confirm that he left of his own volition.  Also, watch fewer crime dramas.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;8) Lastly, is there anything they could do that would be considered within the law that can hurt us? He isn&amp;#39;t going to have belongings for them to take from him anymore, just his clothes. But is there anything they could charge us with legally or anything they could physically do that wouldn&amp;#39;t be against the law that could harm us?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nope, not really.  They can cut their kid off from any support (cell phone bills, school tuition, health insurance, etc)&lt;/p&gt;\n\n&lt;p&gt;Prior to leaving, your friend needs to gather up important documents: social security card and birth certificate being the most important among them.  He can leave a not, or not.  That doesn&amp;#39;t really change anything.  There is no legal benefit to leaving a note, and no legal consequences to not leaving one.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9hnw5", "score_hidden": false, "stickied": false, "created": 1492221380.0, "created_utc": 1492192580.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9q3sq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg9ho67", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Awesome, thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome, thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9q3sq", "score_hidden": false, "stickied": false, "created": 1492231512.0, "created_utc": 1492202712.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ho67", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tipster34", "parent_id": "t1_dg9cpts", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I am not a lawyer or even a FAFSA specialist, just someone who went to college and had to fill this out every year.\n\nAs far as I know, you need to fill out the FAFSA if you are applying for any federal financial aid or receiving any scholarships from the school. I don't believe it's possible to be able to fill it out without parents unless you meet [special circumstances](https://studentaid.ed.gov/sa/fafsa/filling-out/parent-info#special-circumstances). \n\nIf he doesn't qualify for independent status for the FAFSA, he should try and work with his school's financial aid department. There may also be some resources on /r/exmormon for people who have gone through something similar. \n\nBest of luck to you and your friend! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am not a lawyer or even a FAFSA specialist, just someone who went to college and had to fill this out every year.&lt;/p&gt;\n\n&lt;p&gt;As far as I know, you need to fill out the FAFSA if you are applying for any federal financial aid or receiving any scholarships from the school. I don&amp;#39;t believe it&amp;#39;s possible to be able to fill it out without parents unless you meet &lt;a href=\"https://studentaid.ed.gov/sa/fafsa/filling-out/parent-info#special-circumstances\"&gt;special circumstances&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;If he doesn&amp;#39;t qualify for independent status for the FAFSA, he should try and work with his school&amp;#39;s financial aid department. There may also be some resources on &lt;a href=\"/r/exmormon\"&gt;/r/exmormon&lt;/a&gt; for people who have gone through something similar. &lt;/p&gt;\n\n&lt;p&gt;Best of luck to you and your friend! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9ho67", "score_hidden": false, "stickied": false, "created": 1492221388.0, "created_utc": 1492192588.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dgdx4ys", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "legalgrl", "parent_id": "t1_dgach2u", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Whhhhat?! That's awesome. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whhhhat?! That&amp;#39;s awesome. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdx4ys", "score_hidden": false, "stickied": false, "created": 1492483734.0, "created_utc": 1492454934.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgach2u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dee_mill", "parent_id": "t1_dg9tf0h", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "FAFSA is actually open early now. You can fill it out starting in October using the previous years tax information", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;FAFSA is actually open early now. You can fill it out starting in October using the previous years tax information&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgach2u", "score_hidden": false, "stickied": false, "created": 1492263666.0, "created_utc": 1492234866.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9tf0h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "legalgrl", "parent_id": "t1_dg9cpts", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "The FAFSA data is dependent on the person's tax returns for the year. \n\nYour friend's tax return data is dependent on whether or not his parents claim him as a dependent. \n\nMost likely, they do. It would be very strange if they did not do so for 2016.  \n\nTherefore, for FAFSA consideration, he is a dependent of his parents, and his parents income is calculated into what he \"should\" be able to pay. The FAFSA people don't consider estrangement. Which means the FAFSA people consider dad's income his income. As if a 19 year old is making $60k a year or whatever. Meaning he will receive significantly less to no aid. \n\nI believe there is a way to appeal FAFSA automatically marking him as a dependent. But your friend will have to sit down with the financial aid office and walk them through the situation and ask for their help. It's a federal application.  \n\nThat's just right now.  You get a do-over each year.  In January 2018, when he files his 2017 tax return, it will be very important that he files as independent, listing contributions and resources from no one except his own income.  Which I'm sure will be the case. \n\nHis parents, to be jackasses or just because they think it's \"true\" may still try to claim him as a dependent on their 2017 return. Plus there is financial incentive to do so.  You asked about *legal* ways his parents could continue to harass him or make his life difficult.  This is one of them. \n\nIf he files as independent, and they file listing him as a dependent, the IRS will send letters requiring correction to both parties. The parents will probably be the ones required to amend their filing.  If they don't or refuse to?  I don't know. That's a good question for personalfinance.  \n\nMore to the point, the earlier he files (January and not waiting until April) he has a good chance of beating his parent's tax return by getting his in the hands of the IRS first.  Putting him in a better position to be in the right and for them to be in the wrong with the IRS. The IRS does not take kindly to filers who are in the wrong, especially if they won't correct their error. \n\nIn addition, filing in January means the FAFSA can be filled out and submitted in January, lining up all the necessary paperwork to get the jump on available money early. \n\nWhen I was in school not that long ago, there was one scholarship that if I did not have my FAFSA filed by the 3rd week of January, I would miss the money. It was gone. But if I got my taxes done and FAFSA in by January 15th or 20th, I would be awarded the scholarship. It can be financially worth it. (Taxes can be filed based on the data available on your final paystub of the year. *You do not actually have to wait until the employer produces the W-2.* Life pro tip.)\n\nSomeone may comment after me to say that filing taxes independently doesn't mean that FAFSA considers you independent.  And no, that's true.  They have a cutoff age at which they automatically consider you independent from your parent's money, regardless of how you file your tax returns.  I believe it's 25 and above. When you are 24 and below they automatically consider you dependent, regardless of how you file your tax returns. \n\nDoes this mean the feds penalize independent 20-somethings who are taking nothing from their families? Absolutely.  I was in that bucket.  I have lived it. \n\nBut having an explicitly independent tax return for 2017 will help him in the appeals process, making any kind of case that might need to be made with the feds via your school's financial aid department that he is in fact *independent* and they need to get off their 24-years-old rule in this case. \n\nAnd yes, the FAFSA is the key to all scholarships. Frequently even private ones. It is the master key that unlocks college money. It's not optional to go to school without filing one's yearly FAFSA.  Not even community college. Unless one is independently wealthy. I have lived that problem.  \n\nGood luck! You guys are doing the right thing. \n\nAlso, I saw it mentioned once but not strongly enough:  *DO NOT FILE THE MAIL FORWARDING TO YOUR APARTMENT.* \n\nDo not do that. Don't do it.  \n\nHe needs to go to a pack n ship store and rent a box there.  \n\nThese act like PO Boxes but have a regular street address.  Such as 1515 Flower Street, Suite 472.  Instead of PO Box 472. \n\nThe reason this is a necessity is because FedEx and UPS will not deliver to PO Boxes.  But they will deliver to these pack n ship mail store boxes. \n\nThe point being that when he needs to order his birth certificate, send off for his passport, or conduct any kind of business to get his legal documentation straight (which his parents will almost definitely have tried to keep him from having access to), he does not need to be screwed by having a PO Box that FedEx can't deliver to. \n\nSame with an apartment.  How many FedEx envelopes get picked up off apartment doorsteps? How frequently do people move apartments?  His address needs to be independent from yours.\n\nHe needs a pack n ship address he can keep for the next 3-4 years.  It looks like a home address, it acts like a home address. For resumes, tax returns, FAFSA, school records, medical records, everything. Do this. \n\nAnd for obvious reasons his family does NOT need to get that friendly postcard confirming his address has been changed with the new address - yours.  Fuck that noise and save yourself the issue.  I know you have plans to deal with it if the issue arises, but the best way to win a fight is not to be available to engage in one.  Don't give them the information in the first place.  \n\nThey will get the new address, they will try to go there, it will be a pack n ship address, and the pack n ship store manager will laugh at them when they try to find out more from him. ", "edited": 1492207587.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The FAFSA data is dependent on the person&amp;#39;s tax returns for the year. &lt;/p&gt;\n\n&lt;p&gt;Your friend&amp;#39;s tax return data is dependent on whether or not his parents claim him as a dependent. &lt;/p&gt;\n\n&lt;p&gt;Most likely, they do. It would be very strange if they did not do so for 2016.  &lt;/p&gt;\n\n&lt;p&gt;Therefore, for FAFSA consideration, he is a dependent of his parents, and his parents income is calculated into what he &amp;quot;should&amp;quot; be able to pay. The FAFSA people don&amp;#39;t consider estrangement. Which means the FAFSA people consider dad&amp;#39;s income his income. As if a 19 year old is making $60k a year or whatever. Meaning he will receive significantly less to no aid. &lt;/p&gt;\n\n&lt;p&gt;I believe there is a way to appeal FAFSA automatically marking him as a dependent. But your friend will have to sit down with the financial aid office and walk them through the situation and ask for their help. It&amp;#39;s a federal application.  &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s just right now.  You get a do-over each year.  In January 2018, when he files his 2017 tax return, it will be very important that he files as independent, listing contributions and resources from no one except his own income.  Which I&amp;#39;m sure will be the case. &lt;/p&gt;\n\n&lt;p&gt;His parents, to be jackasses or just because they think it&amp;#39;s &amp;quot;true&amp;quot; may still try to claim him as a dependent on their 2017 return. Plus there is financial incentive to do so.  You asked about &lt;em&gt;legal&lt;/em&gt; ways his parents could continue to harass him or make his life difficult.  This is one of them. &lt;/p&gt;\n\n&lt;p&gt;If he files as independent, and they file listing him as a dependent, the IRS will send letters requiring correction to both parties. The parents will probably be the ones required to amend their filing.  If they don&amp;#39;t or refuse to?  I don&amp;#39;t know. That&amp;#39;s a good question for personalfinance.  &lt;/p&gt;\n\n&lt;p&gt;More to the point, the earlier he files (January and not waiting until April) he has a good chance of beating his parent&amp;#39;s tax return by getting his in the hands of the IRS first.  Putting him in a better position to be in the right and for them to be in the wrong with the IRS. The IRS does not take kindly to filers who are in the wrong, especially if they won&amp;#39;t correct their error. &lt;/p&gt;\n\n&lt;p&gt;In addition, filing in January means the FAFSA can be filled out and submitted in January, lining up all the necessary paperwork to get the jump on available money early. &lt;/p&gt;\n\n&lt;p&gt;When I was in school not that long ago, there was one scholarship that if I did not have my FAFSA filed by the 3rd week of January, I would miss the money. It was gone. But if I got my taxes done and FAFSA in by January 15th or 20th, I would be awarded the scholarship. It can be financially worth it. (Taxes can be filed based on the data available on your final paystub of the year. &lt;em&gt;You do not actually have to wait until the employer produces the W-2.&lt;/em&gt; Life pro tip.)&lt;/p&gt;\n\n&lt;p&gt;Someone may comment after me to say that filing taxes independently doesn&amp;#39;t mean that FAFSA considers you independent.  And no, that&amp;#39;s true.  They have a cutoff age at which they automatically consider you independent from your parent&amp;#39;s money, regardless of how you file your tax returns.  I believe it&amp;#39;s 25 and above. When you are 24 and below they automatically consider you dependent, regardless of how you file your tax returns. &lt;/p&gt;\n\n&lt;p&gt;Does this mean the feds penalize independent 20-somethings who are taking nothing from their families? Absolutely.  I was in that bucket.  I have lived it. &lt;/p&gt;\n\n&lt;p&gt;But having an explicitly independent tax return for 2017 will help him in the appeals process, making any kind of case that might need to be made with the feds via your school&amp;#39;s financial aid department that he is in fact &lt;em&gt;independent&lt;/em&gt; and they need to get off their 24-years-old rule in this case. &lt;/p&gt;\n\n&lt;p&gt;And yes, the FAFSA is the key to all scholarships. Frequently even private ones. It is the master key that unlocks college money. It&amp;#39;s not optional to go to school without filing one&amp;#39;s yearly FAFSA.  Not even community college. Unless one is independently wealthy. I have lived that problem.  &lt;/p&gt;\n\n&lt;p&gt;Good luck! You guys are doing the right thing. &lt;/p&gt;\n\n&lt;p&gt;Also, I saw it mentioned once but not strongly enough:  &lt;em&gt;DO NOT FILE THE MAIL FORWARDING TO YOUR APARTMENT.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;Do not do that. Don&amp;#39;t do it.  &lt;/p&gt;\n\n&lt;p&gt;He needs to go to a pack n ship store and rent a box there.  &lt;/p&gt;\n\n&lt;p&gt;These act like PO Boxes but have a regular street address.  Such as 1515 Flower Street, Suite 472.  Instead of PO Box 472. &lt;/p&gt;\n\n&lt;p&gt;The reason this is a necessity is because FedEx and UPS will not deliver to PO Boxes.  But they will deliver to these pack n ship mail store boxes. &lt;/p&gt;\n\n&lt;p&gt;The point being that when he needs to order his birth certificate, send off for his passport, or conduct any kind of business to get his legal documentation straight (which his parents will almost definitely have tried to keep him from having access to), he does not need to be screwed by having a PO Box that FedEx can&amp;#39;t deliver to. &lt;/p&gt;\n\n&lt;p&gt;Same with an apartment.  How many FedEx envelopes get picked up off apartment doorsteps? How frequently do people move apartments?  His address needs to be independent from yours.&lt;/p&gt;\n\n&lt;p&gt;He needs a pack n ship address he can keep for the next 3-4 years.  It looks like a home address, it acts like a home address. For resumes, tax returns, FAFSA, school records, medical records, everything. Do this. &lt;/p&gt;\n\n&lt;p&gt;And for obvious reasons his family does NOT need to get that friendly postcard confirming his address has been changed with the new address - yours.  Fuck that noise and save yourself the issue.  I know you have plans to deal with it if the issue arises, but the best way to win a fight is not to be available to engage in one.  Don&amp;#39;t give them the information in the first place.  &lt;/p&gt;\n\n&lt;p&gt;They will get the new address, they will try to go there, it will be a pack n ship address, and the pack n ship store manager will laugh at them when they try to find out more from him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9tf0h", "score_hidden": false, "stickied": false, "created": 1492235697.0, "created_utc": 1492206897.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cpts", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg98ioz", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thats a good idea. I was thinking about that because I had to fill out my FAFSA a few months ago. A few questions regarding that...1) is a FAFSA required? 2) Is there any way we can fill out a FAFSA without his parents info? For example if he were to legally disown his parents what would he do then?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thats a good idea. I was thinking about that because I had to fill out my FAFSA a few months ago. A few questions regarding that...1) is a FAFSA required? 2) Is there any way we can fill out a FAFSA without his parents info? For example if he were to legally disown his parents what would he do then?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9cpts", "score_hidden": false, "stickied": false, "created": 1492215730.0, "created_utc": 1492186930.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98ioz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Tipster34", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I haven't seen anyone suggest this yet, OP, but is your friend enrolled or planning on enrolling at a university? If he's receiving a scholarship or financial aid, he needs to fill out the FAFSA, which requires information about his parents and their income. Your friend might want to start figuring out the steps to take for the FAFSA every year. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t seen anyone suggest this yet, OP, but is your friend enrolled or planning on enrolling at a university? If he&amp;#39;s receiving a scholarship or financial aid, he needs to fill out the FAFSA, which requires information about his parents and their income. Your friend might want to start figuring out the steps to take for the FAFSA every year. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg98ioz", "score_hidden": false, "stickied": false, "created": 1492210852.0, "created_utc": 1492182052.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg8v3du", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "commonproblemss", "parent_id": "t1_dg8ouq7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "He needs a new bank acccount, his documents secured, then he can just leave.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He needs a new bank acccount, his documents secured, then he can just leave.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8v3du", "score_hidden": false, "stickied": false, "created": 1492180692.0, "created_utc": 1492151892.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ouq7", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg8nsl9", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "That's the thing, even when he's acting like the perfect child, they still discipline him. It never ends. Its never good enough for them. They'll come up with SOMETHING he could be better at. Oh you got a 100% on your math score? Well you got 99.7 on your English one. Do better.\nOh you're going to school and working 2 jobs? Well we only want you working 1.\n\nYes both of those are real scenarios...the job one just unfolded last week.\n\nAnd I will NOT be telling them where I live. The note will say he's moving in with me. That's it as far as where he's going. There will be no address, no city, not even a state...as far as they are concerned I moved him back to Atlanta where I used to live.\n\nHis parents are borderline....just evil. Nothing is ever good enough for them.\n\nI'm a respectable person I like to think. I'm kind, I'm living on my own with no help at all at 19, I work as an engineer, I graduated highschool a year early with an associates degree and I'm working on a bachelors now, I make a LOT more than most kids my age, I donate to charities, all these good things right? But I'm not Mormon so he's not allowed to hang out with me.\nTo organize this runaway plan, or rather, escape plan...he lied to them about doing a religious studies after school thing, he drops by for an hour, we get as far as we can, then he drives home.\n\nLast time we \"officially\" hung out was 4 months ago. In my edit I said his dad assaulted me, his dad assaulted me because he thought I was corrupting him with my atheism...these people are bat shit insane.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the thing, even when he&amp;#39;s acting like the perfect child, they still discipline him. It never ends. Its never good enough for them. They&amp;#39;ll come up with SOMETHING he could be better at. Oh you got a 100% on your math score? Well you got 99.7 on your English one. Do better.\nOh you&amp;#39;re going to school and working 2 jobs? Well we only want you working 1.&lt;/p&gt;\n\n&lt;p&gt;Yes both of those are real scenarios...the job one just unfolded last week.&lt;/p&gt;\n\n&lt;p&gt;And I will NOT be telling them where I live. The note will say he&amp;#39;s moving in with me. That&amp;#39;s it as far as where he&amp;#39;s going. There will be no address, no city, not even a state...as far as they are concerned I moved him back to Atlanta where I used to live.&lt;/p&gt;\n\n&lt;p&gt;His parents are borderline....just evil. Nothing is ever good enough for them.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a respectable person I like to think. I&amp;#39;m kind, I&amp;#39;m living on my own with no help at all at 19, I work as an engineer, I graduated highschool a year early with an associates degree and I&amp;#39;m working on a bachelors now, I make a LOT more than most kids my age, I donate to charities, all these good things right? But I&amp;#39;m not Mormon so he&amp;#39;s not allowed to hang out with me.\nTo organize this runaway plan, or rather, escape plan...he lied to them about doing a religious studies after school thing, he drops by for an hour, we get as far as we can, then he drives home.&lt;/p&gt;\n\n&lt;p&gt;Last time we &amp;quot;officially&amp;quot; hung out was 4 months ago. In my edit I said his dad assaulted me, his dad assaulted me because he thought I was corrupting him with my atheism...these people are bat shit insane.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8ouq7", "score_hidden": false, "stickied": false, "created": 1492168949.0, "created_utc": 1492140149.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nsl9", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "commonproblemss", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "His parents are horrible sinners to treat their kid like this.     \n\nBefore he moves out, he should play along, be nice to them.  Get his money back.  Then he needs to make his own bank account and deposit his money into there so they cant get it.   \nHe needs to get all his documents.  \n\nAfter that then leave and move out. I also would not leave a note saying he moved in with you.  There is no reason to tell them where you live.      \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;His parents are horrible sinners to treat their kid like this.     &lt;/p&gt;\n\n&lt;p&gt;Before he moves out, he should play along, be nice to them.  Get his money back.  Then he needs to make his own bank account and deposit his money into there so they cant get it.&lt;br/&gt;\nHe needs to get all his documents.  &lt;/p&gt;\n\n&lt;p&gt;After that then leave and move out. I also would not leave a note saying he moved in with you.  There is no reason to tell them where you live.      &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8nsl9", "score_hidden": false, "stickied": false, "created": 1492167350.0, "created_utc": 1492138550.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg8ptul", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg8ppzd", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Well of course not. But if I see a gun the doors is gonna shut and if he busts in I have 3 loaded clips of 5.56 NATO Hollowpoint, a 1911 .45 and a 12g all loaded...I doubt it will come to that and I really hope it doesn't, but if it ever did come down to my life versus his....it sure as hell isn't gonna be mine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well of course not. But if I see a gun the doors is gonna shut and if he busts in I have 3 loaded clips of 5.56 NATO Hollowpoint, a 1911 .45 and a 12g all loaded...I doubt it will come to that and I really hope it doesn&amp;#39;t, but if it ever did come down to my life versus his....it sure as hell isn&amp;#39;t gonna be mine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8ptul", "score_hidden": false, "stickied": false, "created": 1492170491.0, "created_utc": 1492141691.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ppzd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Leiryn", "parent_id": "t1_dg8pile", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Well, given that this is Utah, and the type of people here, I wouldn't rule that out", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, given that this is Utah, and the type of people here, I wouldn&amp;#39;t rule that out&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8ppzd", "score_hidden": false, "stickied": false, "created": 1492170320.0, "created_utc": 1492141520.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8pile", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg8p9v5", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 1, "body": "Yep! I think religion is an important thing for society, diversity and for a lot of individuals. People like me can just accept the fact that life is nothing but science and there is no purpose. A lot of people can't. It gives them the hope they need to get through life and I think that's important.\n\nBut when 90% of the population is the same religion and there's an expectation and standard that you follow that religion? Problems arise....\n\nHe'll get out okay. I'll make sure of it. Nothing short of a bullet is gonna stop us.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep! I think religion is an important thing for society, diversity and for a lot of individuals. People like me can just accept the fact that life is nothing but science and there is no purpose. A lot of people can&amp;#39;t. It gives them the hope they need to get through life and I think that&amp;#39;s important.&lt;/p&gt;\n\n&lt;p&gt;But when 90% of the population is the same religion and there&amp;#39;s an expectation and standard that you follow that religion? Problems arise....&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;ll get out okay. I&amp;#39;ll make sure of it. Nothing short of a bullet is gonna stop us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8pile", "score_hidden": false, "stickied": false, "created": 1492169992.0, "created_utc": 1492141192.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8p9v5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Leiryn", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Oh religion, it really attracts the crazies\n\nHope your friend gets out OK!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh religion, it really attracts the crazies&lt;/p&gt;\n\n&lt;p&gt;Hope your friend gets out OK!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg8p9v5", "score_hidden": false, "stickied": false, "created": 1492169607.0, "created_utc": 1492140807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg92xhv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TotesMessenger", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/bestoflegaladvice] [19 yo gun owner plots elaborate plan to move friend away from Mormon parents](https://np.reddit.com/r/bestoflegaladvice/comments/65ca1u/19_yo_gun_owner_plots_elaborate_plan_to_move/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a bot, &lt;em&gt;bleep&lt;/em&gt;, &lt;em&gt;bloop&lt;/em&gt;. Someone has linked to this thread from another place on reddit:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;[&lt;a href=\"/r/bestoflegaladvice\"&gt;/r/bestoflegaladvice&lt;/a&gt;] &lt;a href=\"https://np.reddit.com/r/bestoflegaladvice/comments/65ca1u/19_yo_gun_owner_plots_elaborate_plan_to_move/\"&gt;19 yo gun owner plots elaborate plan to move friend away from Mormon parents&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;a href=\"#footer\"&gt;&lt;/a&gt;&lt;em&gt;&lt;sup&gt;If you follow any of the above links, please respect the rules of reddit and don&amp;#39;t vote in the other threads.&lt;/sup&gt; &lt;sup&gt;(&lt;a href=\"/r/TotesMessenger\"&gt;Info&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;/&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"/message/compose?to=/r/TotesMessenger\"&gt;Contact&lt;/a&gt;)&lt;/sup&gt;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"#bot\"&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg92xhv", "score_hidden": false, "stickied": false, "created": 1492202630.0, "created_utc": 1492173830.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dga4qin", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RooHound", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I'd like to recommend you and your friend start recording conversations starting soon. Utah is a \"one party consent state\" so as long as one person being recorded is aware the recording is taking place (you) it is legal even if no one else present knows of the recording. If you have a smart phone get an app that records every single phone call automatically. Then get a basic sound recorder app that can run while the screen is off which you can start on demand for in person conversations. \n\nRecord everything including discussions between the two of you about your plans. Continue audio recording everything for weeks or months until you are sure everything has calmed down. Don't take unnecessary chances to use the recorder. DO NOT secretly record conversations you are not part of or you are breaking the law. You can only legally record when you personally are a party to the conversation.\n\nIf you have a smartphone I'd have it ready to take video as well in case of a confrontational event.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to recommend you and your friend start recording conversations starting soon. Utah is a &amp;quot;one party consent state&amp;quot; so as long as one person being recorded is aware the recording is taking place (you) it is legal even if no one else present knows of the recording. If you have a smart phone get an app that records every single phone call automatically. Then get a basic sound recorder app that can run while the screen is off which you can start on demand for in person conversations. &lt;/p&gt;\n\n&lt;p&gt;Record everything including discussions between the two of you about your plans. Continue audio recording everything for weeks or months until you are sure everything has calmed down. Don&amp;#39;t take unnecessary chances to use the recorder. DO NOT secretly record conversations you are not part of or you are breaking the law. You can only legally record when you personally are a party to the conversation.&lt;/p&gt;\n\n&lt;p&gt;If you have a smartphone I&amp;#39;d have it ready to take video as well in case of a confrontational event.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dga4qin", "score_hidden": false, "stickied": false, "created": 1492250932.0, "created_utc": 1492222132.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg941xl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Mettephysics", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Not legal advice.. just wanted to say wow you guys have thought this out on detail and sound very prepared and mature if not rather afraid.   You are a good friend.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not legal advice.. just wanted to say wow you guys have thought this out on detail and sound very prepared and mature if not rather afraid.   You are a good friend.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg941xl", "score_hidden": false, "stickied": false, "created": 1492204618.0, "created_utc": 1492175818.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9ucj3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pickleweede", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Get as far away from those bat shit crazy people as possible. We have a whole corner of Reddit for exmormons who did exactly that! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get as far away from those bat shit crazy people as possible. We have a whole corner of Reddit for exmormons who did exactly that! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9ucj3", "score_hidden": false, "stickied": false, "created": 1492236919.0, "created_utc": 1492208119.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dga8ma9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ChemKnits", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Contact /u/FearlessFixxer and the Underground Handcart Company -  they can help.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Contact &lt;a href=\"/u/FearlessFixxer\"&gt;/u/FearlessFixxer&lt;/a&gt; and the Underground Handcart Company -  they can help.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dga8ma9", "score_hidden": false, "stickied": false, "created": 1492256751.0, "created_utc": 1492227951.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_657tr4", "likes": null, "replies": "", "user_reports": [], "id": "dg9yjyp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fsck-this", "parent_id": "t1_dg9yi0z", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Not his type of thing hahaha.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not his type of thing hahaha.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9yjyp", "score_hidden": false, "stickied": false, "created": 1492242518.0, "created_utc": 1492213718.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9yi0z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShittyTBMResponsebot", "parent_id": "t3_657tr4", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "18? Shouldn't he be preparing for a mission?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;18? Shouldn&amp;#39;t he be preparing for a mission?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dg9yi0z", "score_hidden": false, "stickied": false, "created": 1492242446.0, "created_utc": 1492213646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]