[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "legaladvice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My wife and I live in an apartment complex in NJ. We have been here for about 8 months now, and I would say about 4 months ago, a new couple moved in below us. Ever since then, they have complained constantly to the landlord about us being loud on the weekends. What they are referring to is when we have guests over. They do stay late, and stay over sometimes in our apartment on Saturdays but we have since done everything we can to mitigate this issue including:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Only using a small bluetooth speaker for music. We verified with our landlord that the music CANNOT be heard downstairs in their apartment.&lt;/li&gt;\n&lt;li&gt;Installed hundreds of dollars in area rugs on the floor, which was inspected by the landlord&lt;/li&gt;\n&lt;li&gt;Requested all of our guests take their shoes off when they arrive&lt;/li&gt;\n&lt;li&gt;Made sure we do not stomp around when we walk&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I have also taken off work, to stay home and work through this issue with the landlord. My wife and I are trying as best we can to mitigate this issue. We are not college kids having wild parties. We have a few guests, maybe 3-6 over at a time and we are usually just talking in the kitchen or playing cards.  &lt;/p&gt;\n\n&lt;p&gt;Last night, the downstairs neighbors were BANGING on their ceiling while we were talking in the kitchen. This afternoon, we received a letter on our door stating that they will go to the police if the &amp;quot;heavy walking, hard banging on the floors, and loud talking with guests&amp;quot; continues.&lt;/p&gt;\n\n&lt;p&gt;My wife and I have lived below people before, and know it can be a nightmare. Throughout the week we are EXTREMELY quiet, to the point of almost library quiet. We do not have kids running around, we do not walk on our heals, but once a week we will have guests over on a Friday or Saturday.&lt;/p&gt;\n\n&lt;p&gt;I really do want the police to come. We have not received complaints from anyone else, and we are not having wild loud parties that would be anything reportable. I just purchased a decibel meter so I can use it to prove we are not being out of control. At this point, I am not sure what else to do. We have honestly tried everything we can short of not having guests over and not talking at all. We truly have tried to do what we can to mitigate the issue, and it feels like we are walking on egg shells all the time and may disturb them at any moment. I feel almost harassed now that I have received this letter.&lt;/p&gt;\n\n&lt;p&gt;What should my course of action be? Should I reply to the letter? Can I call the police myself next time we have guests over to show we are not being unreasonable? I sent an email to the landlord this morning outlining most of what I said here, and explained we have done everything we can short of not having any guests over.&lt;/p&gt;\n\n&lt;p&gt;Edit: Well I have an update. I spoke to the landlord(when I say landlord, it&amp;#39;s the woman who works in the office and has been dealing with this issue, it&amp;#39;s a larger complex EDIT: Shes the property manager, sorry if I confused anyone) she said that she&amp;#39;s sending these complaints to their legal department so that they can send me a legal cease letter and will have to take action if it doesnt stop. What she is referring to is walking and talking in the apartment. I told her we have not played music after quiet hours and she said there have never been complaints about music, just walking and talking after quiet hours with guests. I don&amp;#39;t know what to do. She also said we had a complaint from a neighbor 8 months ago across the street who called the police. I asked why we never heard anything of this or had police come and she said they didn&amp;#39;t know what apartment​ it was and the police didn&amp;#39;t know what apartment it was. I have no idea how she can pin that on us when there are multiple other apartments within the building. I have a group legal plan with my work. I contacted an attorney but haven&amp;#39;t heard back yet. Thanks for the help so far everyone. This is extremely stressful and my wife is very upset.&lt;/p&gt;\n\n&lt;p&gt;Edit2: Here is the follow up email from the property manager:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I hope you had a good Holiday. I wanted to follow-up on my conversation we had this morning regarding the noise complaints and the email I received below. I am sending you this notice in response to the various communications we have had regarding disrupting noise that I have received from other tenants after quiet time hours of 9:30 pm through 9:30 am coming from your apartment. To reiterate on our conversation, I explained to you the noise that is happening that is coming out of your apartment is too loud for 11:30 p. m through the early hours of the morning. I inspected your apartment Monday April 10, 2017, and advised you could use another runner and additional area rug around the front of your bar area in the kitchen going into the living room to be in compliance with the 80% of wood floors in apartment covered. I was hoping this would resolve the issue. However it has not. I have experience myself coming home late (early mornings) laughing , loud voices . This would not be in unusual if it was 8pm at night, but not at quiet time hours especially after 11 p.m. \nAfter you received the new carpet this past weekend I have received another complaint as discussed today regarding noise on Saturday 4/15/17 from 11:00 p.m. through 2 a.m. It seems the complaint noise such as loud laughing, loud voices and heavy walking and banging. Not music. What you might think is just a normal get together at that hour 11 p.m. to early morning hours loud laughing talking loud could be perceived completely different. I hope you understand the sensitivity of this situation. If you have some sort of fan or something that has a vibration that can affect the apartment below please put it on a chair or piece of furniture not directly on the floor. Page 19 -#21.5. Tenant shall not interfere with or disturb the comfort and rights of other tenants. No annoying sounds, lights, odors shall be permitted. Tenant shall not violate any noise or nuisance ordinance of the “Township of ***** and shall be responsible and shall be responsible for any non-compliance by tenants guests. \nI know we can work together on this to make sure all are happy and living in the comfort of their homes without loud disturbances. This will be sent to our legal department to serve that the rules and regulations are being exercised. &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;These are the parts that really drives me insane:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I have experience myself coming home late (early mornings) laughing , loud voices&amp;quot; She stated she had heard laughing before when she was walking outside. We have a balcony, so I imagine what she heard was people out there talking. Regardless, even if this is at 11pm and during quiet hours, this STILL seems reasonable to me! As you can see there is no screaming or yelling. She is reporting us for guests who are talking or laughing outside. Maybe I am wrong but I just can&amp;#39;t understand this. Again you can see, music is NOT the issue. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;If you have some sort of fan or something that has a vibration that can affect the apartment below please put it on a chair or piece of furniture not directly on the floor.&amp;quot; This seems so petty to me, that we have to place our standing fan on a piece of furniture and not directly on the floor. Again, maybe I&amp;#39;m wrong and its really not that difficult to do but my god. It is hard to live somewhere when everything you do is scrutinized to such an extreme point. It is so stressful, I never know what I can and can&amp;#39;t do that will anger the downstairs neighbors, or now, the property manager who has fully taken their side.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My wife and I live in an apartment complex in NJ. We have been here for about 8 months now, and I would say about 4 months ago, a new couple moved in below us. Ever since then, they have complained constantly to the landlord about us being loud on the weekends. What they are referring to is when we have guests over. They do stay late, and stay over sometimes in our apartment on Saturdays but we have since done everything we can to mitigate this issue including:\n\n1. Only using a small bluetooth speaker for music. We verified with our landlord that the music CANNOT be heard downstairs in their apartment.\n2. Installed hundreds of dollars in area rugs on the floor, which was inspected by the landlord\n3. Requested all of our guests take their shoes off when they arrive\n4. Made sure we do not stomp around when we walk\n\nI have also taken off work, to stay home and work through this issue with the landlord. My wife and I are trying as best we can to mitigate this issue. We are not college kids having wild parties. We have a few guests, maybe 3-6 over at a time and we are usually just talking in the kitchen or playing cards.  \n\nLast night, the downstairs neighbors were BANGING on their ceiling while we were talking in the kitchen. This afternoon, we received a letter on our door stating that they will go to the police if the \"heavy walking, hard banging on the floors, and loud talking with guests\" continues.\n\nMy wife and I have lived below people before, and know it can be a nightmare. Throughout the week we are EXTREMELY quiet, to the point of almost library quiet. We do not have kids running around, we do not walk on our heals, but once a week we will have guests over on a Friday or Saturday.\n\nI really do want the police to come. We have not received complaints from anyone else, and we are not having wild loud parties that would be anything reportable. I just purchased a decibel meter so I can use it to prove we are not being out of control. At this point, I am not sure what else to do. We have honestly tried everything we can short of not having guests over and not talking at all. We truly have tried to do what we can to mitigate the issue, and it feels like we are walking on egg shells all the time and may disturb them at any moment. I feel almost harassed now that I have received this letter.\n\nWhat should my course of action be? Should I reply to the letter? Can I call the police myself next time we have guests over to show we are not being unreasonable? I sent an email to the landlord this morning outlining most of what I said here, and explained we have done everything we can short of not having any guests over.\n\nEdit: Well I have an update. I spoke to the landlord(when I say landlord, it's the woman who works in the office and has been dealing with this issue, it's a larger complex EDIT: Shes the property manager, sorry if I confused anyone) she said that she's sending these complaints to their legal department so that they can send me a legal cease letter and will have to take action if it doesnt stop. What she is referring to is walking and talking in the apartment. I told her we have not played music after quiet hours and she said there have never been complaints about music, just walking and talking after quiet hours with guests. I don't know what to do. She also said we had a complaint from a neighbor 8 months ago across the street who called the police. I asked why we never heard anything of this or had police come and she said they didn't know what apartment​ it was and the police didn't know what apartment it was. I have no idea how she can pin that on us when there are multiple other apartments within the building. I have a group legal plan with my work. I contacted an attorney but haven't heard back yet. Thanks for the help so far everyone. This is extremely stressful and my wife is very upset.\n\nEdit2: Here is the follow up email from the property manager:\n\n\"I hope you had a good Holiday. I wanted to follow-up on my conversation we had this morning regarding the noise complaints and the email I received below. I am sending you this notice in response to the various communications we have had regarding disrupting noise that I have received from other tenants after quiet time hours of 9:30 pm through 9:30 am coming from your apartment. To reiterate on our conversation, I explained to you the noise that is happening that is coming out of your apartment is too loud for 11:30 p. m through the early hours of the morning. I inspected your apartment Monday April 10, 2017, and advised you could use another runner and additional area rug around the front of your bar area in the kitchen going into the living room to be in compliance with the 80% of wood floors in apartment covered. I was hoping this would resolve the issue. However it has not. I have experience myself coming home late (early mornings) laughing , loud voices . This would not be in unusual if it was 8pm at night, but not at quiet time hours especially after 11 p.m. \nAfter you received the new carpet this past weekend I have received another complaint as discussed today regarding noise on Saturday 4/15/17 from 11:00 p.m. through 2 a.m. It seems the complaint noise such as loud laughing, loud voices and heavy walking and banging. Not music. What you might think is just a normal get together at that hour 11 p.m. to early morning hours loud laughing talking loud could be perceived completely different. I hope you understand the sensitivity of this situation. If you have some sort of fan or something that has a vibration that can affect the apartment below please put it on a chair or piece of furniture not directly on the floor. Page 19 -#21.5. Tenant shall not interfere with or disturb the comfort and rights of other tenants. No annoying sounds, lights, odors shall be permitted. Tenant shall not violate any noise or nuisance ordinance of the “Township of ***** and shall be responsible and shall be responsible for any non-compliance by tenants guests. \nI know we can work together on this to make sure all are happy and living in the comfort of their homes without loud disturbances. This will be sent to our legal department to serve that the rules and regulations are being exercised. \"\n\nThese are the parts that really drives me insane:\n\n\"I have experience myself coming home late (early mornings) laughing , loud voices\" She stated she had heard laughing before when she was walking outside. We have a balcony, so I imagine what she heard was people out there talking. Regardless, even if this is at 11pm and during quiet hours, this STILL seems reasonable to me! As you can see there is no screaming or yelling. She is reporting us for guests who are talking or laughing outside. Maybe I am wrong but I just can't understand this. Again you can see, music is NOT the issue. \n\n\"If you have some sort of fan or something that has a vibration that can affect the apartment below please put it on a chair or piece of furniture not directly on the floor.\" This seems so petty to me, that we have to place our standing fan on a piece of furniture and not directly on the floor. Again, maybe I'm wrong and its really not that difficult to do but my god. It is hard to live somewhere when everything you do is scrutinized to such an extreme point. It is so stressful, I never know what I can and can't do that will anger the downstairs neighbors, or now, the property manager who has fully taken their side.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65sbdk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 79, "report_reasons": null, "author": "username0304", "saved": false, "mod_reports": [], "name": "t3_65sbdk", "subreddit_name_prefixed": "r/legaladvice", "approved_by": null, "over_18": false, "domain": "self.legaladvice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rawz", "edited": 1492465780.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/legaladvice/comments/65sbdk/nj_downstairs_neighbors_are_constantly/", "num_reports": null, "locked": false, "stickied": false, "created": 1492416463.0, "url": "https://www.reddit.com/r/legaladvice/comments/65sbdk/nj_downstairs_neighbors_are_constantly/", "author_flair_text": null, "quarantine": false, "title": "[NJ] Downstairs neighbors are constantly complaining about us making noise. They have now started banging on the ceiling", "created_utc": 1492387663.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 46, "visited": false, "subreddit_type": "public", "ups": 79}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgdaga5", "gilded": 0, "archived": false, "score": 53, "report_reasons": null, "author": "dkcs", "parent_id": "t3_65sbdk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I'd tell the downstairs neighbor to ask the building owner to install thick carpeting with a soundproof pad in your unit. Let them fight with the office for a resolution.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d tell the downstairs neighbor to ask the building owner to install thick carpeting with a soundproof pad in your unit. Let them fight with the office for a resolution.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdaga5", "score_hidden": false, "stickied": false, "created": 1492447658.0, "created_utc": 1492418858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 53}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgdsyel", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "username0304", "parent_id": "t1_dgdrx27", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Will do", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Will do&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdsyel", "score_hidden": false, "stickied": false, "created": 1492479079.0, "created_utc": 1492450279.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrx27", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hayasaka-chan", "parent_id": "t1_dgdme3j", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You should edit that into your OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should edit that into your OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdrx27", "score_hidden": false, "stickied": false, "created": 1492477925.0, "created_utc": 1492449125.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dge2lud", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "staples11", "parent_id": "t1_dgdxenv", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Ask the management to have the neighbor record and provide evidence of the occurrences. If it's indeed baseless, they won't be able to prove it. Not everyone may recommend this, it's my opinion of what could be done, as evidence can be tampered or made to reflect what they want to portray. ", "edited": 1492461663.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ask the management to have the neighbor record and provide evidence of the occurrences. If it&amp;#39;s indeed baseless, they won&amp;#39;t be able to prove it. Not everyone may recommend this, it&amp;#39;s my opinion of what could be done, as evidence can be tampered or made to reflect what they want to portray. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge2lud", "score_hidden": false, "stickied": false, "created": 1492489897.0, "created_utc": 1492461097.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdxenv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "username0304", "parent_id": "t1_dgdwxbu", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I've been trying to corporate and we have done everything they asked. We have purchased everything they wished and met them for multiple inspections, but they still side with our downstairs neighbors because they keep writing very emotional emails to them. It really isn't looking good but I'll have to see what the lawyer says. If I have to buy a house then I guess that's what I will do. It seems insane and really at this point we are not ready for a home purchase, hence why we are renting ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been trying to corporate and we have done everything they asked. We have purchased everything they wished and met them for multiple inspections, but they still side with our downstairs neighbors because they keep writing very emotional emails to them. It really isn&amp;#39;t looking good but I&amp;#39;ll have to see what the lawyer says. If I have to buy a house then I guess that&amp;#39;s what I will do. It seems insane and really at this point we are not ready for a home purchase, hence why we are renting &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdxenv", "score_hidden": false, "stickied": false, "created": 1492484041.0, "created_utc": 1492455241.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdwxbu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "staples11", "parent_id": "t1_dgdv6ov", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "A successful judgement in eviction will most certainly affect your ability to rent elsewhere in NJ. The only plus side is an eviction for noise violation is a lot better than nonpayment of rent. A lot of places have it in policy to not to rent to anyone that has been evicted, or even served an eviction notice before.\n\nIt can be a pretty ugly situation, because some LL's do not rent to people who have ever been simply served with an eviction notice, and it's not so hard for an LL to find a reason to serve an eviction notice on flimsy/no evidence which then significantly disadvantages the tenant. \n\nCooperate as much as you can with management. The situation probably will not go that far, but it certainly can.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A successful judgement in eviction will most certainly affect your ability to rent elsewhere in NJ. The only plus side is an eviction for noise violation is a lot better than nonpayment of rent. A lot of places have it in policy to not to rent to anyone that has been evicted, or even served an eviction notice before.&lt;/p&gt;\n\n&lt;p&gt;It can be a pretty ugly situation, because some LL&amp;#39;s do not rent to people who have ever been simply served with an eviction notice, and it&amp;#39;s not so hard for an LL to find a reason to serve an eviction notice on flimsy/no evidence which then significantly disadvantages the tenant. &lt;/p&gt;\n\n&lt;p&gt;Cooperate as much as you can with management. The situation probably will not go that far, but it certainly can.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdwxbu", "score_hidden": false, "stickied": false, "created": 1492483492.0, "created_utc": 1492454692.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdv6ov", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "username0304", "parent_id": "t1_dgdu20e", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thanks. Our walking and talking even after those hours is definitely not over 50db. As I said, music or something is not the issue, it is literally walking and talking. If we are evicted, will it seriously affect our ability to rent somewhere else? This is what I'm most afraid of", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. Our walking and talking even after those hours is definitely not over 50db. As I said, music or something is not the issue, it is literally walking and talking. If we are evicted, will it seriously affect our ability to rent somewhere else? This is what I&amp;#39;m most afraid of&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdv6ov", "score_hidden": false, "stickied": false, "created": 1492481532.0, "created_utc": 1492452732.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdu20e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "staples11", "parent_id": "t1_dgdme3j", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Here you go:\nhttp://www.nj.gov/dep/enforcement/NoiseOrdinancevsNuisanceCodeAug08.pdf\n\nFurthermore, find any bylaws the complex has. I bet it uses the same language. Sounds like they are just salty, sour neighbors. They are in their right to complain if of course there is excessive noise during those periods.\n\nPoint out that they are the new tenants and likely do not have experience living in a lower unit. As a result they are disrupting your quiet enjoyment of the property (they will likely claim the same). There are just some realities one has to accept with apartment living and that is you're going to hear your neighbors sometimes.\n\nIf they get the law involved, you'll have to do the same.\n\nEdit: Ask any neighbors if they would like to go on record if they have any evidence of noise from your apartment. Try and document your interactions, and document that you've been reasonable and accommodating. Also document your proof and refute any claims against you. Furthermore, request a sit down meeting with the management and neighbor. You can also document what are doing during the time periods they are complaining about - not presently in apartment (working), sleeping, lounging etc, and how many guests are over. Also, ask the management to have the neighbor provide a/v evidence as proof.\n\nUnfortunately, they can keep making bogus noise complaints until you are served with an eviction notice, if the landlord sides with the neighbors. I've seen it happen several times. An elderly tenant lived next door to a a woman in her early 30s. Elderly tenant apparently had issue with the sexual orientation of the woman, so as a result the elderly tenant would claim the woman was smoking and listening to loud music. After so many complaints, the management was fed up and unfortunately sided with the elderly tenant. The woman was served with a notice to quit, followed up subsequent fabricated complaints, which was then followed by a notice to evict.\n\nYou can also file a complaint against them for their own noise generation, fight fire with fire, if it violated state/complex codes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here you go:\n&lt;a href=\"http://www.nj.gov/dep/enforcement/NoiseOrdinancevsNuisanceCodeAug08.pdf\"&gt;http://www.nj.gov/dep/enforcement/NoiseOrdinancevsNuisanceCodeAug08.pdf&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Furthermore, find any bylaws the complex has. I bet it uses the same language. Sounds like they are just salty, sour neighbors. They are in their right to complain if of course there is excessive noise during those periods.&lt;/p&gt;\n\n&lt;p&gt;Point out that they are the new tenants and likely do not have experience living in a lower unit. As a result they are disrupting your quiet enjoyment of the property (they will likely claim the same). There are just some realities one has to accept with apartment living and that is you&amp;#39;re going to hear your neighbors sometimes.&lt;/p&gt;\n\n&lt;p&gt;If they get the law involved, you&amp;#39;ll have to do the same.&lt;/p&gt;\n\n&lt;p&gt;Edit: Ask any neighbors if they would like to go on record if they have any evidence of noise from your apartment. Try and document your interactions, and document that you&amp;#39;ve been reasonable and accommodating. Also document your proof and refute any claims against you. Furthermore, request a sit down meeting with the management and neighbor. You can also document what are doing during the time periods they are complaining about - not presently in apartment (working), sleeping, lounging etc, and how many guests are over. Also, ask the management to have the neighbor provide a/v evidence as proof.&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, they can keep making bogus noise complaints until you are served with an eviction notice, if the landlord sides with the neighbors. I&amp;#39;ve seen it happen several times. An elderly tenant lived next door to a a woman in her early 30s. Elderly tenant apparently had issue with the sexual orientation of the woman, so as a result the elderly tenant would claim the woman was smoking and listening to loud music. After so many complaints, the management was fed up and unfortunately sided with the elderly tenant. The woman was served with a notice to quit, followed up subsequent fabricated complaints, which was then followed by a notice to evict.&lt;/p&gt;\n\n&lt;p&gt;You can also file a complaint against them for their own noise generation, fight fire with fire, if it violated state/complex codes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdu20e", "score_hidden": false, "stickied": false, "created": 1492480288.0, "created_utc": 1492451488.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdme3j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "username0304", "parent_id": "t1_dgd91do", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thanks. This is reassuring. It's​ just stressful because every time we have guests now, which is 2-3 times a month, we get a complaint or banging. I cannot believe these people have the audacity to write a letter to us, telling us to limit our walking in our own apartment. I could not imagine being that much of an asshole where I would go upstairs to my neighbors and ask them to stop walking to much. They are lucky at this point we are reasonable people and we aren't retaliating making their life a living hell", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. This is reassuring. It&amp;#39;s​ just stressful because every time we have guests now, which is 2-3 times a month, we get a complaint or banging. I cannot believe these people have the audacity to write a letter to us, telling us to limit our walking in our own apartment. I could not imagine being that much of an asshole where I would go upstairs to my neighbors and ask them to stop walking to much. They are lucky at this point we are reasonable people and we aren&amp;#39;t retaliating making their life a living hell&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdme3j", "score_hidden": false, "stickied": false, "created": 1492471693.0, "created_utc": 1492442893.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgdm0da", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HEONTHETOILET", "parent_id": "t1_dgdlapf", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Confirmed. Was always curious about that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed. Was always curious about that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdm0da", "score_hidden": false, "stickied": false, "created": 1492471246.0, "created_utc": 1492442446.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlapf", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "8246962", "parent_id": "t1_dgddquk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Landlord's can only access criminal records. I doubt the police visiting OPs address will come up on any kind of background/criminal record check.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Landlord&amp;#39;s can only access criminal records. I doubt the police visiting OPs address will come up on any kind of background/criminal record check.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdlapf", "score_hidden": false, "stickied": false, "created": 1492470378.0, "created_utc": 1492441578.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgddquk", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "HEONTHETOILET", "parent_id": "t1_dgd91do", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; If your landlord doesn't care (and I'm sure the police aren't going to care, even if they do investigate the first or second time) then why do you care?\n\nI am not sure how it works in NJ, but here in IN if the cops come to your place then it's logged in their system. Even if nothing comes of it, there is still a log of the cops having to come to your house/apartment.\n\nI am not a cop, lawyer or landlord, but if OP decides to rent elsewhere, will another landlord be able to get access to that sort of information (if NJ logs it), and if they do, could another landlord refuse to rent to them for seeing that there have been constant complaints about noise?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If your landlord doesn&amp;#39;t care (and I&amp;#39;m sure the police aren&amp;#39;t going to care, even if they do investigate the first or second time) then why do you care?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I am not sure how it works in NJ, but here in IN if the cops come to your place then it&amp;#39;s logged in their system. Even if nothing comes of it, there is still a log of the cops having to come to your house/apartment.&lt;/p&gt;\n\n&lt;p&gt;I am not a cop, lawyer or landlord, but if OP decides to rent elsewhere, will another landlord be able to get access to that sort of information (if NJ logs it), and if they do, could another landlord refuse to rent to them for seeing that there have been constant complaints about noise?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgddquk", "score_hidden": false, "stickied": false, "created": 1492458008.0, "created_utc": 1492429208.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dge7ak3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "username0304", "parent_id": "t1_dgd91do", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "BTW I updated the top post. The property manager(sorry I called her the landlord before), has now fully taken their side.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;BTW I updated the top post. The property manager(sorry I called her the landlord before), has now fully taken their side.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge7ak3", "score_hidden": false, "stickied": false, "created": 1492495454.0, "created_utc": 1492466654.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd91do", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "robertatlaw", "parent_id": "t3_65sbdk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "If your landlord doesn't care (and I'm sure the police aren't going to care, even if they do investigate the first or second time) then why do you care? Your neighbors sound like miserable people. Let them be miserable. Apologize to your guests that you have to live above such cranky sourpusses, but beyond that, what's the upside of engaging with them? You've got no reason to change your life because of crazy. If the neighbors hate it enough, eventually they'll move.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If your landlord doesn&amp;#39;t care (and I&amp;#39;m sure the police aren&amp;#39;t going to care, even if they do investigate the first or second time) then why do you care? Your neighbors sound like miserable people. Let them be miserable. Apologize to your guests that you have to live above such cranky sourpusses, but beyond that, what&amp;#39;s the upside of engaging with them? You&amp;#39;ve got no reason to change your life because of crazy. If the neighbors hate it enough, eventually they&amp;#39;ll move.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd91do", "score_hidden": false, "stickied": false, "created": 1492443099.0, "created_utc": 1492414299.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 55}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dge92hq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WeylandTheDwarf", "parent_id": "t1_dge8gyu", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "It doesn't sound like they sided. Most of the changes sound like they were implemented by OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t sound like they sided. Most of the changes sound like they were implemented by OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge92hq", "score_hidden": false, "stickied": false, "created": 1492497734.0, "created_utc": 1492468934.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8gyu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Yinonormal", "parent_id": "t1_dgdnb52", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "People pay extra for downstairs unit and the bitch property manager sided with newer tenants, if I was them I would call corperate and complain about having to be quiet church mice.  \n\nI'm not a lawyer, but I worked as a maintenance tech at several apartments, most property managers are not the best people and had to go higher up to put them in check", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People pay extra for downstairs unit and the bitch property manager sided with newer tenants, if I was them I would call corperate and complain about having to be quiet church mice.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a lawyer, but I worked as a maintenance tech at several apartments, most property managers are not the best people and had to go higher up to put them in check&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge8gyu", "score_hidden": false, "stickied": false, "created": 1492496950.0, "created_utc": 1492468150.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnb52", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "WeylandTheDwarf", "parent_id": "t1_dgd2w2r", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "If OP moves apartments, someone else will live above the neighbor and probably be just as loud/louder then OP. It sounds like the only solution for everyone is moving the neighbor to an upstairs unit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If OP moves apartments, someone else will live above the neighbor and probably be just as loud/louder then OP. It sounds like the only solution for everyone is moving the neighbor to an upstairs unit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdnb52", "score_hidden": false, "stickied": false, "created": 1492472751.0, "created_utc": 1492443951.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2w2r", "gilded": 0, "archived": false, "score": 48, "report_reasons": null, "author": "Yinonormal", "parent_id": "t3_65sbdk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Have you considered asking the leasing office if you could switch apartments? If the office doesn't allow it, call corporate and explain the situation.  I'm sure the office would like this squashed as much as you do, but I'm sure the downstairs neighbors will bitch about the any other tenants moving in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you considered asking the leasing office if you could switch apartments? If the office doesn&amp;#39;t allow it, call corporate and explain the situation.  I&amp;#39;m sure the office would like this squashed as much as you do, but I&amp;#39;m sure the downstairs neighbors will bitch about the any other tenants moving in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd2w2r", "score_hidden": false, "stickied": false, "created": 1492430429.0, "created_utc": 1492401629.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 48}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgdsylp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "username0304", "parent_id": "t1_dgdrtuy", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I will thanks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will thanks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdsylp", "score_hidden": false, "stickied": false, "created": 1492479085.0, "created_utc": 1492450285.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrtuy", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "shidarin", "parent_id": "t1_dgdrkxs", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "If you actually get a cease and desist you'll need to consult with your own lawyer. Not allowing you to walk or talk normally after \"quiet\" seems....\n\nAfter you get a lawyer, follow their instructions. If you don't feel like your lawyer is representing you well or caring about your issues, find a new lawyer.", "edited": 1492449281.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you actually get a cease and desist you&amp;#39;ll need to consult with your own lawyer. Not allowing you to walk or talk normally after &amp;quot;quiet&amp;quot; seems....&lt;/p&gt;\n\n&lt;p&gt;After you get a lawyer, follow their instructions. If you don&amp;#39;t feel like your lawyer is representing you well or caring about your issues, find a new lawyer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdrtuy", "score_hidden": false, "stickied": false, "created": 1492477826.0, "created_utc": 1492449026.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dge1zfq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lockssocksboxfox", "parent_id": "t1_dgdrkxs", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "If the other party is involving legal departments, you need to talk to a lawyer.\nFirst, check for local tenant's rights organizations.   They can give you solid guidelines on noise complaints, and put you in touch with lawyers who specialize in tenant law.\n\nSecond, even if you go no further, talk to a lawyer and see if they see value in sending a letter to your property management co.   You have a fairly well-defined set of rights to live in your home, leased or owned, and a C&amp;D based on baseless complaining may violate those.   Walking and talking is not unreasonable.   Walking loudly and talking loudly outside of quiet hours is not unreasonable.  Playing loud music and having pets that don't exceed noise ordinance is NOT unreasonable.   Your neighbors are being unreasonable, and you absolutely should fight back.\n\nYour landlord just wants the problem to go away, they don't care how.   Having a lawyer on your side might help convince landlord to demand proof from tender-ear neighbors instead of just trying to bully you.\n\nThe first demand letter is cheap.   And it's far, far cheaper than having an eviction on your record.   That will, long-run, cost you thousands and untold headaches, and a very noticeable decline in the quality of apartment (and neighborhood) you can rent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the other party is involving legal departments, you need to talk to a lawyer.\nFirst, check for local tenant&amp;#39;s rights organizations.   They can give you solid guidelines on noise complaints, and put you in touch with lawyers who specialize in tenant law.&lt;/p&gt;\n\n&lt;p&gt;Second, even if you go no further, talk to a lawyer and see if they see value in sending a letter to your property management co.   You have a fairly well-defined set of rights to live in your home, leased or owned, and a C&amp;amp;D based on baseless complaining may violate those.   Walking and talking is not unreasonable.   Walking loudly and talking loudly outside of quiet hours is not unreasonable.  Playing loud music and having pets that don&amp;#39;t exceed noise ordinance is NOT unreasonable.   Your neighbors are being unreasonable, and you absolutely should fight back.&lt;/p&gt;\n\n&lt;p&gt;Your landlord just wants the problem to go away, they don&amp;#39;t care how.   Having a lawyer on your side might help convince landlord to demand proof from tender-ear neighbors instead of just trying to bully you.&lt;/p&gt;\n\n&lt;p&gt;The first demand letter is cheap.   And it&amp;#39;s far, far cheaper than having an eviction on your record.   That will, long-run, cost you thousands and untold headaches, and a very noticeable decline in the quality of apartment (and neighborhood) you can rent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge1zfq", "score_hidden": false, "stickied": false, "created": 1492489209.0, "created_utc": 1492460409.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrkxs", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "username0304", "parent_id": "t1_dgdp4es", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Well I have an update. I spoke to the landlord and she said that she's sending these complaints to their legal department so that they can send me a level cease letter and will have to take action if it doesnt stop. What she is referring to is walking and talking in the apartment. I told her we have not played music after quiet hours and she said there have never been complaints about music, just walking and talking after quiet hours. I don't know what to do", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I have an update. I spoke to the landlord and she said that she&amp;#39;s sending these complaints to their legal department so that they can send me a level cease letter and will have to take action if it doesnt stop. What she is referring to is walking and talking in the apartment. I told her we have not played music after quiet hours and she said there have never been complaints about music, just walking and talking after quiet hours. I don&amp;#39;t know what to do&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdrkxs", "score_hidden": false, "stickied": false, "created": 1492477546.0, "created_utc": 1492448746.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdp4es", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "shidarin", "parent_id": "t3_65sbdk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Stop tiptoeing around. You've tried to be reasonable, it hasn't worked so just live your life normally. Don't hold raging parties but you don't need to be silent either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop tiptoeing around. You&amp;#39;ve tried to be reasonable, it hasn&amp;#39;t worked so just live your life normally. Don&amp;#39;t hold raging parties but you don&amp;#39;t need to be silent either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdp4es", "score_hidden": false, "stickied": false, "created": 1492474820.0, "created_utc": 1492446020.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgda66b", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "marcoroman3", "parent_id": "t3_65sbdk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Until what's time of night are you guys sitting around talking? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Until what&amp;#39;s time of night are you guys sitting around talking? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgda66b", "score_hidden": false, "stickied": false, "created": 1492446688.0, "created_utc": 1492417888.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgdl6rx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jeff744", "parent_id": "t3_65sbdk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You do nothing, your recourse is only through your landlord telling them to stop trying to damage his walls and ceiling. It may not even be your fault if it's a wooden building. I've managed to get noise complaints at my old apartment while I was out of town for the week (I lived alone). Sound travels in funny ways.\n\nIgnore them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You do nothing, your recourse is only through your landlord telling them to stop trying to damage his walls and ceiling. It may not even be your fault if it&amp;#39;s a wooden building. I&amp;#39;ve managed to get noise complaints at my old apartment while I was out of town for the week (I lived alone). Sound travels in funny ways.&lt;/p&gt;\n\n&lt;p&gt;Ignore them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdl6rx", "score_hidden": false, "stickied": false, "created": 1492470241.0, "created_utc": 1492441441.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgd5ewq", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "d4rkph03n1x", "parent_id": "t1_dgcstws", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You don't deserve the downvotes, my little bot friend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t deserve the downvotes, my little bot friend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd5ewq", "score_hidden": false, "stickied": false, "created": 1492434944.0, "created_utc": 1492406144.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcstws", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_65sbdk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 1, "body": "Please review the [Landlord Tenant Questions](https://www.reddit.com/r/legaladvice/wiki/landlord) section of the /r/LegalAdvice Wiki for common questions and answers regarding landlord tenant issues.  If this does not apply to your question, please disregard\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/legaladvice) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please review the &lt;a href=\"https://www.reddit.com/r/legaladvice/wiki/landlord\"&gt;Landlord Tenant Questions&lt;/a&gt; section of the &lt;a href=\"/r/LegalAdvice\"&gt;/r/LegalAdvice&lt;/a&gt; Wiki for common questions and answers regarding landlord tenant issues.  If this does not apply to your question, please disregard&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/legaladvice\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgcstws", "score_hidden": false, "stickied": false, "created": 1492416464.0, "created_utc": 1492387664.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dge7muh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hotmetalslugs", "parent_id": "t1_dge66am", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Good luck my good man.  You'll get it sorted, it just may not feel like it right now.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck my good man.  You&amp;#39;ll get it sorted, it just may not feel like it right now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge7muh", "score_hidden": false, "stickied": false, "created": 1492495880.0, "created_utc": 1492467080.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge66am", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "username0304", "parent_id": "t1_dge0mhe", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thanks. At this point I would rather be in their shoes. Knowing there may be noise upstairs one day a week is better than having to tip-toe around at all times of the day, with fear of bothering your downstairs sensitive neighbors. \n\nOn the topic of the subfloor. I found out that there are local building codes for sound isolation between units in multi-family dwellings. I don't know for sure, but perhaps they are not meeting code. From what I found, the code is usually \"met\" by using the designs from the architect to justify the isolation, but an actual test is never done. I will send it to my lawyer to see what he thinks and if it would be something the apartment could be required to test.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. At this point I would rather be in their shoes. Knowing there may be noise upstairs one day a week is better than having to tip-toe around at all times of the day, with fear of bothering your downstairs sensitive neighbors. &lt;/p&gt;\n\n&lt;p&gt;On the topic of the subfloor. I found out that there are local building codes for sound isolation between units in multi-family dwellings. I don&amp;#39;t know for sure, but perhaps they are not meeting code. From what I found, the code is usually &amp;quot;met&amp;quot; by using the designs from the architect to justify the isolation, but an actual test is never done. I will send it to my lawyer to see what he thinks and if it would be something the apartment could be required to test.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge66am", "score_hidden": false, "stickied": false, "created": 1492494062.0, "created_utc": 1492465262.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0mhe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hotmetalslugs", "parent_id": "t3_65sbdk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I feel your pain, and am not able to offer legal advice for your situation, but I was in a situation where I was the top-floor tenant of an owner-occupied 2 story house.  (Landlords on the first floor).  It was an older, wood-frame house, with creaky as shit stairs and floors everywhere.  Barefoot or in sneakers, they'd hear me walking.  I was once the downstairs guys so I knew the drill:  don't stomp around, don't walk on my heels, just be super respectful.  It doesn't matter.  Sound waves will hit the floor and transfer immediately through the hard surface, to the joist, which transfers perfectly to the ceiling below.  The ceiling then vibrates with each sound wave, like a speaker.  Wall-to-wall carpet helps a little, with the localized walking right on that spot, but does little else for general walking about or voice transmission.\n\nYour apt. would need to have thick underlayment for a subfloor, and padding, and carpet, for this to stop being an issue.\n\nThey will never be happy there, and you sound like a decent couple, you may never be happy there either.\n\nGood luck.\n\n(BTW, there is a solution, but it involves isolating their ceiling from your floor.  Nobody is going to do that.)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel your pain, and am not able to offer legal advice for your situation, but I was in a situation where I was the top-floor tenant of an owner-occupied 2 story house.  (Landlords on the first floor).  It was an older, wood-frame house, with creaky as shit stairs and floors everywhere.  Barefoot or in sneakers, they&amp;#39;d hear me walking.  I was once the downstairs guys so I knew the drill:  don&amp;#39;t stomp around, don&amp;#39;t walk on my heels, just be super respectful.  It doesn&amp;#39;t matter.  Sound waves will hit the floor and transfer immediately through the hard surface, to the joist, which transfers perfectly to the ceiling below.  The ceiling then vibrates with each sound wave, like a speaker.  Wall-to-wall carpet helps a little, with the localized walking right on that spot, but does little else for general walking about or voice transmission.&lt;/p&gt;\n\n&lt;p&gt;Your apt. would need to have thick underlayment for a subfloor, and padding, and carpet, for this to stop being an issue.&lt;/p&gt;\n\n&lt;p&gt;They will never be happy there, and you sound like a decent couple, you may never be happy there either.&lt;/p&gt;\n\n&lt;p&gt;Good luck.&lt;/p&gt;\n\n&lt;p&gt;(BTW, there is a solution, but it involves isolating their ceiling from your floor.  Nobody is going to do that.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge0mhe", "score_hidden": false, "stickied": false, "created": 1492487681.0, "created_utc": 1492458881.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgdo8am", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deeyenda", "parent_id": "t3_65sbdk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Invite the neighbors to the next party.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Invite the neighbors to the next party.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdo8am", "score_hidden": false, "stickied": false, "created": 1492473808.0, "created_utc": 1492445008.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dge7dec", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "username0304", "parent_id": "t1_dgdciee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "This is so reassuring. Going through all of this for months now I couldn't imagine what we were doing was wrong, but I'm constantly being told the opposite. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is so reassuring. Going through all of this for months now I couldn&amp;#39;t imagine what we were doing was wrong, but I&amp;#39;m constantly being told the opposite. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge7dec", "score_hidden": false, "stickied": false, "created": 1492495551.0, "created_utc": 1492466751.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dge7030", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "username0304", "parent_id": "t1_dgddg9n", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "This is 100% what goes on. None of my friends like to drink and drive, and we either take Ubers everywhere if its relatively close by, or stay at each others houses/apartments. We rent a two bedroom which we use for this purpose as well as an office. We like to have guests stay, and go out to breakfast in the morning. There are also times when I am on call for work, so I need to stay close by incase of an emergency. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is 100% what goes on. None of my friends like to drink and drive, and we either take Ubers everywhere if its relatively close by, or stay at each others houses/apartments. We rent a two bedroom which we use for this purpose as well as an office. We like to have guests stay, and go out to breakfast in the morning. There are also times when I am on call for work, so I need to stay close by incase of an emergency. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge7030", "score_hidden": false, "stickied": false, "created": 1492495096.0, "created_utc": 1492466296.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgdu2ca", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MoJoJoEmbiid", "parent_id": "t1_dgdkvqd", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Fair enough. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair enough. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdu2ca", "score_hidden": false, "stickied": false, "created": 1492480299.0, "created_utc": 1492451499.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgdn161", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jilly_Bean16", "parent_id": "t1_dgdkvqd", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I thought I had somehow fallen into Relationships and was waiting for someone to suggest going to therapy. Or divorce.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought I had somehow fallen into Relationships and was waiting for someone to suggest going to therapy. Or divorce.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdn161", "score_hidden": false, "stickied": false, "created": 1492472436.0, "created_utc": 1492443636.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkvqd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Lushington", "parent_id": "t1_dgddh92", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Is this *legal* advice?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is this &lt;em&gt;legal&lt;/em&gt; advice?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdkvqd", "score_hidden": false, "stickied": false, "created": 1492469861.0, "created_utc": 1492441061.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgddh92", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "MoJoJoEmbiid", "parent_id": "t1_dgddg9n", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 1, "body": "You are right- and I never said they shouldn't throw parties. I SUGGESTED having parties at their friends house every once in a while as opposed to throwing these parties every weekend, because it's obviously not working out well for them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are right- and I never said they shouldn&amp;#39;t throw parties. I SUGGESTED having parties at their friends house every once in a while as opposed to throwing these parties every weekend, because it&amp;#39;s obviously not working out well for them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgddh92", "score_hidden": false, "stickied": false, "created": 1492457339.0, "created_utc": 1492428539.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgddg9n", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "horsenbuggy", "parent_id": "t1_dgdcssw", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "But that's a \"feeling.\" It could also be friends who live an hour away and don't want to drive home after 4 glasses of wine. A large metro area, like the one I live in, is very spread out. This would be very common here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But that&amp;#39;s a &amp;quot;feeling.&amp;quot; It could also be friends who live an hour away and don&amp;#39;t want to drive home after 4 glasses of wine. A large metro area, like the one I live in, is very spread out. This would be very common here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgddg9n", "score_hidden": false, "stickied": false, "created": 1492457270.0, "created_utc": 1492428470.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcssw", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "MoJoJoEmbiid", "parent_id": "t1_dgdciee", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 1, "body": "I mean I agree parties are fine- but when the guests end up staying the night I have a feeling they are loud pretty late in to the night. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean I agree parties are fine- but when the guests end up staying the night I have a feeling they are loud pretty late in to the night. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdcssw", "score_hidden": false, "stickied": false, "created": 1492455478.0, "created_utc": 1492426678.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdciee", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "horsenbuggy", "parent_id": "t1_dgd4dpa", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "It's ridiculous to say an apartment dweller shouldn't throw weekly parties. Especially when we're just talking about dinner and cards. This is their home and they have every right to be sociable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s ridiculous to say an apartment dweller shouldn&amp;#39;t throw weekly parties. Especially when we&amp;#39;re just talking about dinner and cards. This is their home and they have every right to be sociable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdciee", "score_hidden": false, "stickied": false, "created": 1492454611.0, "created_utc": 1492425811.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgddwo0", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "positivecontent", "parent_id": "t1_dgdcppy", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Just got out of living in a bottom floor apartment for 10 years. I only had to call the police once in 10 years due to noise. It wasn't even noise from the apartment above me, their party had spilled out into the breezeway and it was 3 am. Other people complained to the office afterward but no one wanted to make it stop at the time. \n\nOver the years I lived under all kinds of people. I only had one that I asked the apartment complex to talk to, other than the police incident, was a guy in his 20s that loved CSI. I mean I loved watching the show just as much as the next person but when it came on I would hear the theme music blare and the entire show. \n\nI talked to the office a couple times and he didn't want to turn it down. I have a very good surround sound system I really never got to use to its full capacity until the day it stopped. CSI was about to start so I loaded up call of duty or some other shooter game. \n\nRight as it started I cranked the volume of the surround sound way up. I played one 10 minute match and turned it down. He never did it again. I don't think he realized that the sound would make it through until I showed him. \n\nTL:DR Apartment life can suck but bad neighbors can make it worse. If they are unhappy they will leave soon. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just got out of living in a bottom floor apartment for 10 years. I only had to call the police once in 10 years due to noise. It wasn&amp;#39;t even noise from the apartment above me, their party had spilled out into the breezeway and it was 3 am. Other people complained to the office afterward but no one wanted to make it stop at the time. &lt;/p&gt;\n\n&lt;p&gt;Over the years I lived under all kinds of people. I only had one that I asked the apartment complex to talk to, other than the police incident, was a guy in his 20s that loved CSI. I mean I loved watching the show just as much as the next person but when it came on I would hear the theme music blare and the entire show. &lt;/p&gt;\n\n&lt;p&gt;I talked to the office a couple times and he didn&amp;#39;t want to turn it down. I have a very good surround sound system I really never got to use to its full capacity until the day it stopped. CSI was about to start so I loaded up call of duty or some other shooter game. &lt;/p&gt;\n\n&lt;p&gt;Right as it started I cranked the volume of the surround sound way up. I played one 10 minute match and turned it down. He never did it again. I don&amp;#39;t think he realized that the sound would make it through until I showed him. &lt;/p&gt;\n\n&lt;p&gt;TL:DR Apartment life can suck but bad neighbors can make it worse. If they are unhappy they will leave soon. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgddwo0", "score_hidden": false, "stickied": false, "created": 1492458401.0, "created_utc": 1492429601.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65sbdk", "likes": null, "replies": "", "user_reports": [], "id": "dgddabr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MoJoJoEmbiid", "parent_id": "t1_dgdczd5", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Sure, but I also believe the people below him deserve to sleep in their apartment on the weekends. It sounds like these parties are impeding on that right. \n\nAfter all, they pay rent too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure, but I also believe the people below him deserve to sleep in their apartment on the weekends. It sounds like these parties are impeding on that right. &lt;/p&gt;\n\n&lt;p&gt;After all, they pay rent too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgddabr", "score_hidden": false, "stickied": false, "created": 1492456842.0, "created_utc": 1492428042.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdczd5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "derekgpierce", "parent_id": "t1_dgdcte3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "And? It is still their residence. Not owning the physical building in which they live makes no difference. The people below them should not be able to bully OP and his wife into submission. Honestly, it all depends what the lease agreement states pertaining to this issue. That will be what is referenced when choosing who is in the wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And? It is still their residence. Not owning the physical building in which they live makes no difference. The people below them should not be able to bully OP and his wife into submission. Honestly, it all depends what the lease agreement states pertaining to this issue. That will be what is referenced when choosing who is in the wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdczd5", "score_hidden": false, "stickied": false, "created": 1492456016.0, "created_utc": 1492427216.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcte3", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "MoJoJoEmbiid", "parent_id": "t1_dgdcppy", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 1, "body": "No they don't- they rent it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No they don&amp;#39;t- they rent it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdcte3", "score_hidden": false, "stickied": false, "created": 1492455525.0, "created_utc": 1492426725.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcppy", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "derekgpierce", "parent_id": "t1_dgd4dpa", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "The point is that they shouldn't have to bend to the will of the dwellers below them. OP and his wife own the place, it is theirs to do with as they please as long as they aren't excessive with the noise. This is coming from someone who has lived with a roommate who complained to the landlord about the \"loudness of a keyboard.\" People like this are insufferable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The point is that they shouldn&amp;#39;t have to bend to the will of the dwellers below them. OP and his wife own the place, it is theirs to do with as they please as long as they aren&amp;#39;t excessive with the noise. This is coming from someone who has lived with a roommate who complained to the landlord about the &amp;quot;loudness of a keyboard.&amp;quot; People like this are insufferable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdcppy", "score_hidden": false, "stickied": false, "created": 1492455228.0, "created_utc": 1492426428.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd4dpa", "gilded": 0, "archived": false, "score": -30, "report_reasons": null, "author": "MoJoJoEmbiid", "parent_id": "t3_65sbdk", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "How late are you and your guests partying on the weekends? If you live above someone in an apartment, I don't know that I would be throwing weekly parties. \n\nI'd suggest going to your friends every once in a while and reserving weekly parties for when you own your own house and don't live immediately above others. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How late are you and your guests partying on the weekends? If you live above someone in an apartment, I don&amp;#39;t know that I would be throwing weekly parties. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d suggest going to your friends every once in a while and reserving weekly parties for when you own your own house and don&amp;#39;t live immediately above others. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd4dpa", "score_hidden": false, "stickied": false, "created": 1492432950.0, "created_utc": 1492404150.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -30}}], "after": null, "before": null}}]