[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "legaladvice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ve been married for 26 months. He is an alcoholic, a cocaine addict, and has outbursts where he yells, insults me, and eventually comes after me physically (pushing, twisting my arm, hitting me in the chest, tearing my phone out of my hand). The cops came once when we lived in NYC and I stupidly asked them not to arrest him. I do fight back when he gets like that- I have thrown small things at him and left marks on his arm once when trying to wrench his hands off my arm when he was twisting it. I&amp;#39;m not perfect. I react to him more than I should. But when someone comes after you like that, as a human being, how can you not react and fight back? So when it comes to the physical stuff, I don&amp;#39;t feel like I have a great case. Plus I&amp;#39;ve never documented the bruises or gone to the doctor. He never hits my face so no one has seen, but I have told co-workers I trust about what has happened. &lt;/p&gt;\n\n&lt;p&gt;When he flies into these rages he threatens to destroy me in a divorce (and destroy my whole family, which I know is not possible). Right now I am the sole breadwinner. I make $235k a year before taxes, but I have $265k in student loans. I don&amp;#39;t have any other debt. We don&amp;#39;t own a house. The leased car (we only have the one) is in my name but he threatens to just take it. He has a lot of credit card debt in his name. Until July of last year he was also an attorney making more than I do now, but he quit his job to pursue his dream of being a writer and I agreed to support him. He was a partner at a large NY law firm and he can get another partner job in a month if he wanted to. He has the ability to make more than twice as much as I do but simply chooses not to. I have been paying his credit card debt and all the bills for over 8 months. &lt;/p&gt;\n\n&lt;p&gt;I know his alimony wouldn&amp;#39;t last long with such a short marriage but I am terrified. I make a lot, but with supporting him and his credit card debt and drug habit, we don&amp;#39;t have much left at the end of the month. I even put my loans into forbearance so that I could keep up with his credit card payments (of about $5k a month) and so the principal is just going up. How can I protect myself? Can he use facts from my distant past with the court to paint me in a bad light? Can he really get alimony from me when his income before he stopped working was so high, and given that he is choosing not to work? I&amp;#39;m sorry for the wall of text. I don&amp;#39;t know what&amp;#39;s going to happen- his moods are fickle and despite everything I do love him (I miss how he used to be). Help?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "We've been married for 26 months. He is an alcoholic, a cocaine addict, and has outbursts where he yells, insults me, and eventually comes after me physically (pushing, twisting my arm, hitting me in the chest, tearing my phone out of my hand). The cops came once when we lived in NYC and I stupidly asked them not to arrest him. I do fight back when he gets like that- I have thrown small things at him and left marks on his arm once when trying to wrench his hands off my arm when he was twisting it. I'm not perfect. I react to him more than I should. But when someone comes after you like that, as a human being, how can you not react and fight back? So when it comes to the physical stuff, I don't feel like I have a great case. Plus I've never documented the bruises or gone to the doctor. He never hits my face so no one has seen, but I have told co-workers I trust about what has happened. \n\nWhen he flies into these rages he threatens to destroy me in a divorce (and destroy my whole family, which I know is not possible). Right now I am the sole breadwinner. I make $235k a year before taxes, but I have $265k in student loans. I don't have any other debt. We don't own a house. The leased car (we only have the one) is in my name but he threatens to just take it. He has a lot of credit card debt in his name. Until July of last year he was also an attorney making more than I do now, but he quit his job to pursue his dream of being a writer and I agreed to support him. He was a partner at a large NY law firm and he can get another partner job in a month if he wanted to. He has the ability to make more than twice as much as I do but simply chooses not to. I have been paying his credit card debt and all the bills for over 8 months. \n\nI know his alimony wouldn't last long with such a short marriage but I am terrified. I make a lot, but with supporting him and his credit card debt and drug habit, we don't have much left at the end of the month. I even put my loans into forbearance so that I could keep up with his credit card payments (of about $5k a month) and so the principal is just going up. How can I protect myself? Can he use facts from my distant past with the court to paint me in a bad light? Can he really get alimony from me when his income before he stopped working was so high, and given that he is choosing not to work? I'm sorry for the wall of text. I don't know what's going to happen- his moods are fickle and despite everything I do love him (I miss how he used to be). Help?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65si5b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 162, "report_reasons": null, "author": "throwaway_babyseal", "saved": false, "mod_reports": [], "name": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "approved_by": null, "over_18": false, "domain": "self.legaladvice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rawz", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/legaladvice/comments/65si5b/fl_my_husband_is_mentally_unstable_emotionally/", "num_reports": null, "locked": false, "stickied": false, "created": 1492418730.0, "url": "https://www.reddit.com/r/legaladvice/comments/65si5b/fl_my_husband_is_mentally_unstable_emotionally/", "author_flair_text": null, "quarantine": false, "title": "[FL] My husband is mentally unstable, emotionally and physically abusive, and keeps threatening to destroy me in a divorce. I'm an attorney but not in family law, so I don't know what to do and I am afraid.", "created_utc": 1492389930.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 70, "visited": false, "subreddit_type": "public", "ups": 162}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd4v1r", "gilded": 0, "archived": false, "score": 74, "report_reasons": null, "author": "Buttstache", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Two quick things: you're never too old to start again with someone else. And even if you don't find that person very soon, you're still better off being alone than being a victim. Also, this IS the man you fell in love with. By that I mean, this was probably always under the surface. But the \"honeymoon\" period is over, and people get familiar and comfortable after a couple years. You've now seen the real him. The shitty abusive drug addict him. It's best to forget the fake him you married and remember the real him who abused you. I'm sorry this is happening. I feel you though. My ex wife was manipulative and mentally abusive. I was SO MUCH happier after we ended our six year marriage. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Two quick things: you&amp;#39;re never too old to start again with someone else. And even if you don&amp;#39;t find that person very soon, you&amp;#39;re still better off being alone than being a victim. Also, this IS the man you fell in love with. By that I mean, this was probably always under the surface. But the &amp;quot;honeymoon&amp;quot; period is over, and people get familiar and comfortable after a couple years. You&amp;#39;ve now seen the real him. The shitty abusive drug addict him. It&amp;#39;s best to forget the fake him you married and remember the real him who abused you. I&amp;#39;m sorry this is happening. I feel you though. My ex wife was manipulative and mentally abusive. I was SO MUCH happier after we ended our six year marriage. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd4v1r", "score_hidden": false, "stickied": false, "created": 1492433852.0, "created_utc": 1492405052.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 74}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd91ss", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "Floomby", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Don't get overwhelmed. You feel overwheled because you are under such an awful stress. \n\nYou are not doing this all at once. Step by step. One step at a time. That's why I wrote it out in steps. \n\nSo start with Step One. You will find someplace different to stay tomorrow night, even if it's just a motel. When you go to work tomorrow, start looking for a new place. But all you have to do immediately is get a place for the next night or so. \n\nMight as well get a new phone and phone plan on your lunch hour. Have them dumo your contacts into the new phone. Leave your current phone at work. \n\nAt the end of the day, change all of your passwords to mail, etc. \n\nThen when work is done, have the police escort you to your apartment while you gather your essentials as described in Steps Three. **Do not go there and face him alone**. \n\nThe next day at lunch get a P.O. box and have all your mail forwarded to it. \n\nOnce you're out, **do not contact him**. \n\nThat's how you get started. \n\nP.S. You're not too old to start again. I got a lovely boyfriend at age 52 and I'm not even that hot. But even if you never ever had another man again, anything would be better than this guy who is going to kill you or severely maim you. \n\nHe is never going to change and you know it. Abusers always escalate. That nice guy who you knew 4 years ago? That was an act to rope you in. The abusive asshole? That's the real him. \n\nAfter you leave him, **no contact**. Seriously. Contacting him is your lawyer's job. He will promise you every single thing you most dearly want to hear and if you go back, he will punish you for trying to leave and you will be more screwed than ever. \n\n\n\n\n\n", "edited": 1492414716.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t get overwhelmed. You feel overwheled because you are under such an awful stress. &lt;/p&gt;\n\n&lt;p&gt;You are not doing this all at once. Step by step. One step at a time. That&amp;#39;s why I wrote it out in steps. &lt;/p&gt;\n\n&lt;p&gt;So start with Step One. You will find someplace different to stay tomorrow night, even if it&amp;#39;s just a motel. When you go to work tomorrow, start looking for a new place. But all you have to do immediately is get a place for the next night or so. &lt;/p&gt;\n\n&lt;p&gt;Might as well get a new phone and phone plan on your lunch hour. Have them dumo your contacts into the new phone. Leave your current phone at work. &lt;/p&gt;\n\n&lt;p&gt;At the end of the day, change all of your passwords to mail, etc. &lt;/p&gt;\n\n&lt;p&gt;Then when work is done, have the police escort you to your apartment while you gather your essentials as described in Steps Three. &lt;strong&gt;Do not go there and face him alone&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;The next day at lunch get a P.O. box and have all your mail forwarded to it. &lt;/p&gt;\n\n&lt;p&gt;Once you&amp;#39;re out, &lt;strong&gt;do not contact him&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s how you get started. &lt;/p&gt;\n\n&lt;p&gt;P.S. You&amp;#39;re not too old to start again. I got a lovely boyfriend at age 52 and I&amp;#39;m not even that hot. But even if you never ever had another man again, anything would be better than this guy who is going to kill you or severely maim you. &lt;/p&gt;\n\n&lt;p&gt;He is never going to change and you know it. Abusers always escalate. That nice guy who you knew 4 years ago? That was an act to rope you in. The abusive asshole? That&amp;#39;s the real him. &lt;/p&gt;\n\n&lt;p&gt;After you leave him, &lt;strong&gt;no contact&lt;/strong&gt;. Seriously. Contacting him is your lawyer&amp;#39;s job. He will promise you every single thing you most dearly want to hear and if you go back, he will punish you for trying to leave and you will be more screwed than ever. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd91ss", "score_hidden": false, "stickied": false, "created": 1492443132.0, "created_utc": 1492414332.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdlcbb", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "recipriversexcluson", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Among all the excellent advice here, let me add a small candle, the Three C's....\n\nYou didn't Cause his problems.\n\nYou can't Control his behavior.\n\nYou can't Cure him.\n\nProtect yourself and move on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Among all the excellent advice here, let me add a small candle, the Three C&amp;#39;s....&lt;/p&gt;\n\n&lt;p&gt;You didn&amp;#39;t Cause his problems.&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t Control his behavior.&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t Cure him.&lt;/p&gt;\n\n&lt;p&gt;Protect yourself and move on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdlcbb", "score_hidden": false, "stickied": false, "created": 1492470434.0, "created_utc": 1492441634.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgddime", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "CatsandSucculents", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Adding onto their list-change all passwords (even if you don't think he knows them or knows about the account) and then set up 2 step authentication whenever possible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Adding onto their list-change all passwords (even if you don&amp;#39;t think he knows them or knows about the account) and then set up 2 step authentication whenever possible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgddime", "score_hidden": false, "stickied": false, "created": 1492457434.0, "created_utc": 1492428634.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdednf", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Time_to_go_viking", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "There is no old him to get back. It was a mask. You have the real him now. Regardless of what you fear financially the correct and only decision is to leave him and divorce him immediately. You will be happier and safer in the long run. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no old him to get back. It was a mask. You have the real him now. Regardless of what you fear financially the correct and only decision is to leave him and divorce him immediately. You will be happier and safer in the long run. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdednf", "score_hidden": false, "stickied": false, "created": 1492459502.0, "created_utc": 1492430702.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdhlr4", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "vintagephone", "parent_id": "t1_dgdhg0p", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "PS:  Please don't get pregnant with this man, either.  You don't want to subject future children to him.  And you'd never be able to get him out of your life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PS:  Please don&amp;#39;t get pregnant with this man, either.  You don&amp;#39;t want to subject future children to him.  And you&amp;#39;d never be able to get him out of your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdhlr4", "score_hidden": false, "stickied": false, "created": 1492465341.0, "created_utc": 1492436541.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhg0p", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "vintagephone", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I have been in this exact situation.  I kept taking him back, too because with each new start I hoped he changed back to the wonderful person I met.  I'm going to be blunt:  He will not ever be that person again.  This behavior can only escalate.  This is a classic example of the cycle of domestic violence.  \n\nPlease follow the list above and get it done.  Leave this person behind you.  In my case, the police had to take my ex away.  Don't let it get that far.  As a lawyer, you have the smarts to step out of the emotion and view this objectively for a moment and see what you need to do.  Just take it one step at a time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have been in this exact situation.  I kept taking him back, too because with each new start I hoped he changed back to the wonderful person I met.  I&amp;#39;m going to be blunt:  He will not ever be that person again.  This behavior can only escalate.  This is a classic example of the cycle of domestic violence.  &lt;/p&gt;\n\n&lt;p&gt;Please follow the list above and get it done.  Leave this person behind you.  In my case, the police had to take my ex away.  Don&amp;#39;t let it get that far.  As a lawyer, you have the smarts to step out of the emotion and view this objectively for a moment and see what you need to do.  Just take it one step at a time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdhg0p", "score_hidden": false, "stickied": false, "created": 1492465094.0, "created_utc": 1492436294.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd9rjq", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "vasion123", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You're a god damn lawyer with a great paying job and enough cash in hand to get out, just leave.  Your husband has been taken from you by cocaine, there is no coming back from what you described as daily use as that stuff has screwed his brain for good.  What will happen is a downward spiral of drug use, at some point the coke isn't going to do anything for him anymore and he'll turn to harder drugs.  Leave now while it's just cocaine and booze get yourself a lawyer and drop him.  You're better then this, you are stronger then you think just accept that the husband you love has been lost.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re a god damn lawyer with a great paying job and enough cash in hand to get out, just leave.  Your husband has been taken from you by cocaine, there is no coming back from what you described as daily use as that stuff has screwed his brain for good.  What will happen is a downward spiral of drug use, at some point the coke isn&amp;#39;t going to do anything for him anymore and he&amp;#39;ll turn to harder drugs.  Leave now while it&amp;#39;s just cocaine and booze get yourself a lawyer and drop him.  You&amp;#39;re better then this, you are stronger then you think just accept that the husband you love has been lost.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd9rjq", "score_hidden": false, "stickied": false, "created": 1492445335.0, "created_utc": 1492416535.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdr7ph", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "KoperKat", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Here's [a post from a couple of months ago](https://www.reddit.com/r/legaladvice/comments/4xu0yy/my_girlfriend_elaborately_made_me_homeless/) from the other side, when a girlfriend left an abuser in a textbook fashion to protect herself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s &lt;a href=\"https://www.reddit.com/r/legaladvice/comments/4xu0yy/my_girlfriend_elaborately_made_me_homeless/\"&gt;a post from a couple of months ago&lt;/a&gt; from the other side, when a girlfriend left an abuser in a textbook fashion to protect herself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdr7ph", "score_hidden": false, "stickied": false, "created": 1492477137.0, "created_utc": 1492448337.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdlxzt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "redditlady999", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; He's never gone from the apartment because he just sits here writing and doing coke all day, unless he goes to LA to work with his producer. \n\nThis sounds like a person with a serious drug problem. Truly serious. Scary serious.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;He&amp;#39;s never gone from the apartment because he just sits here writing and doing coke all day, unless he goes to LA to work with his producer. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This sounds like a person with a serious drug problem. Truly serious. Scary serious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdlxzt", "score_hidden": false, "stickied": false, "created": 1492471169.0, "created_utc": 1492442369.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdmg1k", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Volume_six", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "That's what abusers do. Everything is right and great at first and then the abuse starts and they manipulate you into thinking *you're* crazy. So you try to change thinking if you just did or said something different on a daily basis that they would go back to how it was before. \n\nIt will never go back to how it was before. It's not your fault. There is something psychologically wrong with him; he's a cruel and abusive person. Get away from him before he does irreparable damage to you. Be thankful you don't have kids because he would abuse them too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what abusers do. Everything is right and great at first and then the abuse starts and they manipulate you into thinking &lt;em&gt;you&amp;#39;re&lt;/em&gt; crazy. So you try to change thinking if you just did or said something different on a daily basis that they would go back to how it was before. &lt;/p&gt;\n\n&lt;p&gt;It will never go back to how it was before. It&amp;#39;s not your fault. There is something psychologically wrong with him; he&amp;#39;s a cruel and abusive person. Get away from him before he does irreparable damage to you. Be thankful you don&amp;#39;t have kids because he would abuse them too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdmg1k", "score_hidden": false, "stickied": false, "created": 1492471757.0, "created_utc": 1492442957.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdqr6k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "2manymans", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "The person you met isn't who he is. That was the bait on his fish hook. He could only maintain that facade for so long until he showed you who he really was. Is. He won't ever change and he won't ever go back to being the man he was. Because he was never that person. That was an act and now it's over. Move forward knowing you are not giving that person up because that person never existed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The person you met isn&amp;#39;t who he is. That was the bait on his fish hook. He could only maintain that facade for so long until he showed you who he really was. Is. He won&amp;#39;t ever change and he won&amp;#39;t ever go back to being the man he was. Because he was never that person. That was an act and now it&amp;#39;s over. Move forward knowing you are not giving that person up because that person never existed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdqr6k", "score_hidden": false, "stickied": false, "created": 1492476625.0, "created_utc": 1492447825.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dge3y0k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ashton-renee", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "IANAL, and I would consult with a domestic violence advocate before proceeding in this direction, but why not just call the police on him for the drugs? He will be arrested, file for a divorce and restraining order, and that will give you some time to get away. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IANAL, and I would consult with a domestic violence advocate before proceeding in this direction, but why not just call the police on him for the drugs? He will be arrested, file for a divorce and restraining order, and that will give you some time to get away. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge3y0k", "score_hidden": false, "stickied": false, "created": 1492491395.0, "created_utc": 1492462595.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgeel6n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TastyFace", "parent_id": "t1_dgd13m7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Just to back up this thing /u/Buttstache said:\n\n&gt;this IS the man you fell in love with. By that I mean, this was probably always under the surface.\n\nYou yourself mentioned how he's able to instantly turn on the charm for the cops.  Is it such a stretch to ask if he might have been turning on the charm for your entire relationship?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just to back up this thing &lt;a href=\"/u/Buttstache\"&gt;/u/Buttstache&lt;/a&gt; said:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;this IS the man you fell in love with. By that I mean, this was probably always under the surface.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You yourself mentioned how he&amp;#39;s able to instantly turn on the charm for the cops.  Is it such a stretch to ask if he might have been turning on the charm for your entire relationship?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgeel6n", "score_hidden": false, "stickied": false, "created": 1492504835.0, "created_utc": 1492476035.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd13m7", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "throwaway_babyseal", "parent_id": "t1_dgd04a2", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you so much for writing all that out. Just reading through it, it seems like so much. It overwhelms me. I have about $15k in savings in my own account so I think I could get a place- we actually have no joint accounts. He's never gone from the apartment because he just sits here writing and doing coke all day, unless he goes to LA to work with his producer. He actually just got back from a trip, and I thought about leaving while he was gone, but I was holding out hope that he would somehow change and would be nice when he got back. But no. Today he flew into a rage when I told him I killed a roach in the kitchen (because I had previously told him I thought I killed them all, and the fact that I didn't makes me a liar). He pushed me with such force that I hit the bed and bounced in the air, then he tackled me and took my phone (for no apparent reason) i tried to get it back and now have a sprained wrist to show for it. Then he calms down and tries to act normal. I hide in the bedroom crying. \n\nIt's so pathetic but all I want is him back- the person I fell madly in love with 4 years ago. The person who would do anything for me and treated me like a princess. I think there is something psychologically wrong with him and there is a part of me that just wishes we could get him some help and he would go back to how he was. I feel like I'm too old to start over again. I think talking to a lawyer to just understand my options and what he can and can't do will help. I need to start somewhere and I don't feel strong enough to just leave right now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for writing all that out. Just reading through it, it seems like so much. It overwhelms me. I have about $15k in savings in my own account so I think I could get a place- we actually have no joint accounts. He&amp;#39;s never gone from the apartment because he just sits here writing and doing coke all day, unless he goes to LA to work with his producer. He actually just got back from a trip, and I thought about leaving while he was gone, but I was holding out hope that he would somehow change and would be nice when he got back. But no. Today he flew into a rage when I told him I killed a roach in the kitchen (because I had previously told him I thought I killed them all, and the fact that I didn&amp;#39;t makes me a liar). He pushed me with such force that I hit the bed and bounced in the air, then he tackled me and took my phone (for no apparent reason) i tried to get it back and now have a sprained wrist to show for it. Then he calms down and tries to act normal. I hide in the bedroom crying. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s so pathetic but all I want is him back- the person I fell madly in love with 4 years ago. The person who would do anything for me and treated me like a princess. I think there is something psychologically wrong with him and there is a part of me that just wishes we could get him some help and he would go back to how he was. I feel like I&amp;#39;m too old to start over again. I think talking to a lawyer to just understand my options and what he can and can&amp;#39;t do will help. I need to start somewhere and I don&amp;#39;t feel strong enough to just leave right now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd13m7", "score_hidden": false, "stickied": false, "created": 1492427721.0, "created_utc": 1492398921.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdbg8j", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "ReggieJ", "parent_id": "t1_dgd04a2", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt;Do a factory reset on your current phone so that all data is erased.\n\nI would recommend against this. Instead, power it down and have the divorce attorney hold on to it in such a way that the camera and the speakers are obscured. It might need to be forensically examined at some point. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Do a factory reset on your current phone so that all data is erased.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I would recommend against this. Instead, power it down and have the divorce attorney hold on to it in such a way that the camera and the speakers are obscured. It might need to be forensically examined at some point. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdbg8j", "score_hidden": false, "stickied": false, "created": 1492451140.0, "created_utc": 1492422340.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdqm9p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "2manymans", "parent_id": "t1_dgd04a2", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "This is outstanding practical concrete advice. I have nothing more to add to this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is outstanding practical concrete advice. I have nothing more to add to this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdqm9p", "score_hidden": false, "stickied": false, "created": 1492476473.0, "created_utc": 1492447673.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dge34bk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DiceDemi", "parent_id": "t1_dgdtx8x", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You still have to be acting with intent to have bad faith. And 15 attorneys is nothing. That's barely doing your homework. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You still have to be acting with intent to have bad faith. And 15 attorneys is nothing. That&amp;#39;s barely doing your homework. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dge34bk", "score_hidden": false, "stickied": false, "created": 1492490474.0, "created_utc": 1492461674.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtx8x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "2manymans", "parent_id": "t1_dgds43z", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "It's a civil case and bad faith is sanctionable.  A judge who sees someone \"interview\" 15 attorneys isn't going to be kind to that person. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a civil case and bad faith is sanctionable.  A judge who sees someone &amp;quot;interview&amp;quot; 15 attorneys isn&amp;#39;t going to be kind to that person. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdtx8x", "score_hidden": false, "stickied": false, "created": 1492480144.0, "created_utc": 1492451344.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgds43z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DiceDemi", "parent_id": "t1_dgdr1a6", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Still something you'd have to prove the intent of.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Still something you&amp;#39;d have to prove the intent of.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgds43z", "score_hidden": false, "stickied": false, "created": 1492478141.0, "created_utc": 1492449341.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdr1a6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "2manymans", "parent_id": "t1_dgdf13i", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Interviewing a few to find the best fit, yes. Interviewing 10 to create a conflict, definitely no. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interviewing a few to find the best fit, yes. Interviewing 10 to create a conflict, definitely no. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdr1a6", "score_hidden": false, "stickied": false, "created": 1492476937.0, "created_utc": 1492448137.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdf13i", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "DiceDemi", "parent_id": "t1_dgdeego", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "That's if they interview *every* lawyer in the area. Interviewing four or five of the ones you've received references for is definitely not something actionable by any court. It's what people *should* be doing anyways ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s if they interview &lt;em&gt;every&lt;/em&gt; lawyer in the area. Interviewing four or five of the ones you&amp;#39;ve received references for is definitely not something actionable by any court. It&amp;#39;s what people &lt;em&gt;should&lt;/em&gt; be doing anyways &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdf13i", "score_hidden": false, "stickied": false, "created": 1492460869.0, "created_utc": 1492432069.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdz187", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "mblueskies", "parent_id": "t1_dgdeego", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "There is that side effect - but interviewing several lawyers to see which one you are comfortable with is very reasonable, and especially so in her case, when she appears to be suffering some pretty severe ptsd-like symptoms as a result of this man's abuse.  She needs a lawyer that she will be comfortable with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is that side effect - but interviewing several lawyers to see which one you are comfortable with is very reasonable, and especially so in her case, when she appears to be suffering some pretty severe ptsd-like symptoms as a result of this man&amp;#39;s abuse.  She needs a lawyer that she will be comfortable with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdz187", "score_hidden": false, "stickied": false, "created": 1492485892.0, "created_utc": 1492457092.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdeego", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "JackStargazer", "parent_id": "t1_dgddq26", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; Interview 4 or 5 of the very best divorce lawyers and choose the one that will work best for you. The other very good divorce lawyers won't be taking his case.\n\nIf you're implying that she should do this in order to prevent him from retaining those lawyers due to conflict of interest that is actually a *horrible idea* which could lead to costs and, as she's a lawyer herself, potentially sanctions, suspension or disbarment.\n\nThe courts and law societies take a dim view of manipulating the legal system to someone's detriment in this manner, even when that person is a huge asshole. We've had people come on here saying that their spouse did this, and it never ends well for that party. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Interview 4 or 5 of the very best divorce lawyers and choose the one that will work best for you. The other very good divorce lawyers won&amp;#39;t be taking his case.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you&amp;#39;re implying that she should do this in order to prevent him from retaining those lawyers due to conflict of interest that is actually a &lt;em&gt;horrible idea&lt;/em&gt; which could lead to costs and, as she&amp;#39;s a lawyer herself, potentially sanctions, suspension or disbarment.&lt;/p&gt;\n\n&lt;p&gt;The courts and law societies take a dim view of manipulating the legal system to someone&amp;#39;s detriment in this manner, even when that person is a huge asshole. We&amp;#39;ve had people come on here saying that their spouse did this, and it never ends well for that party. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdeego", "score_hidden": false, "stickied": false, "created": 1492459555.0, "created_utc": 1492430755.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dgddq26", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mblueskies", "parent_id": "t1_dgd04a2", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 1, "body": "Step Four:  Laptops are cheap.  Buy a new one.\n\nStep Six:  You're a lawyer, you should know this:  Interview 4 or 5 of the very best divorce lawyers and choose the one that will work best for you.  The other very good divorce lawyers won't be taking his case.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Step Four:  Laptops are cheap.  Buy a new one.&lt;/p&gt;\n\n&lt;p&gt;Step Six:  You&amp;#39;re a lawyer, you should know this:  Interview 4 or 5 of the very best divorce lawyers and choose the one that will work best for you.  The other very good divorce lawyers won&amp;#39;t be taking his case.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgddq26", "score_hidden": false, "stickied": false, "created": 1492457954.0, "created_utc": 1492429154.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd04a2", "gilded": 0, "archived": false, "score": 236, "report_reasons": null, "author": "Floomby", "parent_id": "t1_dgcwin3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "**Step One**. Arrange a new place to live, even if it's just a small rental room or motel room. \n\n**Step Two**. Take out half of the money in any joint accounts and open new accounts at a different bank. Get current statements on every account, all stocks, and all debts of any kind. Get a freeze on your credit. \n\n**Step Three**. When is he out of the house? At that time, move your things out. Prioritize what is really essential. You should be okay with a suitcase of clothes, medications, toiletries, and your vital documents such as birth certificate, passport, social security card, etc, and any jewelry and other small valuable things that were gifts, inheritances, or acquired before marriage. If he rarely leaves the house or you think he might come home while you are there, have a police officer be there while you take your stuff. \n\n**Step Four**. Get a new phone and a new phone number that is a secret to all but your most trusted friends and family. Do a factory reset on your current phone so that all data is erased. Get your laptop tested for tracking devices and keyloggers. Erase your social media presence. \n\n**Step Five**. Inform work that you are separating from your husband and that they should not accept talk to him on the phone or let him in the building. \n\n**Step Six** Ask your work friends for a reference for the best divorce lawyer in the city. That way, when you file for divorce, he won't know what your new address is. \n\n**Step Seven**. File for divorce. Listen to your excellent lawyer. \n\n**Step Eight**. Therapy from someone who has experience helping people recover from abusive relationships. You should also order some of the excellent books out there about divorcing high conflict people, and about sociopaths, narcissists, and abusers. \n\nHe is not Lex Luthor. He is not Sauron. He is a shitty, terrible human, but he is just an ordinary human. He does not have magic superpowers. \n\nDo not waste your time and energy blaming yourself for this situation. People from all walks of life have ended up in abusive situations. Please do not call yourself stupid. It is not fair to paint all abuse victims as stupid. It can happen to anyone. \n\nFortunately, you are an insightful person with some important resources. You have a job with decent pay and you know lawyers. \n\n**You can do this, girl**! \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Step One&lt;/strong&gt;. Arrange a new place to live, even if it&amp;#39;s just a small rental room or motel room. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Step Two&lt;/strong&gt;. Take out half of the money in any joint accounts and open new accounts at a different bank. Get current statements on every account, all stocks, and all debts of any kind. Get a freeze on your credit. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Step Three&lt;/strong&gt;. When is he out of the house? At that time, move your things out. Prioritize what is really essential. You should be okay with a suitcase of clothes, medications, toiletries, and your vital documents such as birth certificate, passport, social security card, etc, and any jewelry and other small valuable things that were gifts, inheritances, or acquired before marriage. If he rarely leaves the house or you think he might come home while you are there, have a police officer be there while you take your stuff. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Step Four&lt;/strong&gt;. Get a new phone and a new phone number that is a secret to all but your most trusted friends and family. Do a factory reset on your current phone so that all data is erased. Get your laptop tested for tracking devices and keyloggers. Erase your social media presence. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Step Five&lt;/strong&gt;. Inform work that you are separating from your husband and that they should not accept talk to him on the phone or let him in the building. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Step Six&lt;/strong&gt; Ask your work friends for a reference for the best divorce lawyer in the city. That way, when you file for divorce, he won&amp;#39;t know what your new address is. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Step Seven&lt;/strong&gt;. File for divorce. Listen to your excellent lawyer. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Step Eight&lt;/strong&gt;. Therapy from someone who has experience helping people recover from abusive relationships. You should also order some of the excellent books out there about divorcing high conflict people, and about sociopaths, narcissists, and abusers. &lt;/p&gt;\n\n&lt;p&gt;He is not Lex Luthor. He is not Sauron. He is a shitty, terrible human, but he is just an ordinary human. He does not have magic superpowers. &lt;/p&gt;\n\n&lt;p&gt;Do not waste your time and energy blaming yourself for this situation. People from all walks of life have ended up in abusive situations. Please do not call yourself stupid. It is not fair to paint all abuse victims as stupid. It can happen to anyone. &lt;/p&gt;\n\n&lt;p&gt;Fortunately, you are an insightful person with some important resources. You have a job with decent pay and you know lawyers. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;You can do this, girl&lt;/strong&gt;! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd04a2", "score_hidden": false, "stickied": false, "created": 1492426322.0, "created_utc": 1492397522.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 236}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgcx122", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "BlushingDragon", "parent_id": "t1_dgcwin3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You need to call the domestic violence hotline again and come up with an escape plan. If he's going to escalate, you need to get out. Your physical safety has to come first.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to call the domestic violence hotline again and come up with an escape plan. If he&amp;#39;s going to escalate, you need to get out. Your physical safety has to come first.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgcx122", "score_hidden": false, "stickied": false, "created": 1492422014.0, "created_utc": 1492393214.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdbegr", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "ReggieJ", "parent_id": "t1_dgcwin3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt;Thanks. I did contact the domestic violence hotline and it was like they knew everything he did before I even told them. It just makes me feel like a stereotype.\n\nYou're not the stereotype. He is. He is just a dime-a-dozen piece of shit abuser who hasn't the brain to be original about it. You're a highly-educated, professionally successful, relatively affluent woman and we are just not primed to see people like you as being vulnerable to a bell-end like him. Men who are victims of domestic abuse also suffer from this kind of blindness. As do many people around them. \n\nYour husband's sole purpose in life is to keep you believing that he is superman + god. He knows all, sees all, can do all. He has all the control and you have none. He needs you to believe that because his whole happiness depends on it. \n\nLast time you called the police on him, you had to talk them out of pressing charges against him. He isn't invulnerable. \n\nCall back the domestic abuse hotline and trust the fact that they seemed to know your husband as well as you do and they haven't ever met him to prove to you that he isn't some extraordinary omnipotent villain but just an abusive trash human and allow them to use their expertise with just such unoriginal piles of shit to get you out of this situation.\n\nBest of luck and please check back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Thanks. I did contact the domestic violence hotline and it was like they knew everything he did before I even told them. It just makes me feel like a stereotype.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re not the stereotype. He is. He is just a dime-a-dozen piece of shit abuser who hasn&amp;#39;t the brain to be original about it. You&amp;#39;re a highly-educated, professionally successful, relatively affluent woman and we are just not primed to see people like you as being vulnerable to a bell-end like him. Men who are victims of domestic abuse also suffer from this kind of blindness. As do many people around them. &lt;/p&gt;\n\n&lt;p&gt;Your husband&amp;#39;s sole purpose in life is to keep you believing that he is superman + god. He knows all, sees all, can do all. He has all the control and you have none. He needs you to believe that because his whole happiness depends on it. &lt;/p&gt;\n\n&lt;p&gt;Last time you called the police on him, you had to talk them out of pressing charges against him. He isn&amp;#39;t invulnerable. &lt;/p&gt;\n\n&lt;p&gt;Call back the domestic abuse hotline and trust the fact that they seemed to know your husband as well as you do and they haven&amp;#39;t ever met him to prove to you that he isn&amp;#39;t some extraordinary omnipotent villain but just an abusive trash human and allow them to use their expertise with just such unoriginal piles of shit to get you out of this situation.&lt;/p&gt;\n\n&lt;p&gt;Best of luck and please check back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdbegr", "score_hidden": false, "stickied": false, "created": 1492450970.0, "created_utc": 1492422170.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd607v", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "dwarf_ewok", "parent_id": "t1_dgcwin3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Hire the most talented divorce lawyer in your city.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hire the most talented divorce lawyer in your city.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd607v", "score_hidden": false, "stickied": false, "created": 1492436142.0, "created_utc": 1492407342.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd8p36", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cookingachicken", "parent_id": "t1_dgcwin3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Right now get the book \"The Sociopath Next Door\". You need this to understand what you're dealing with. Please. It's a quick read. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right now get the book &amp;quot;The Sociopath Next Door&amp;quot;. You need this to understand what you&amp;#39;re dealing with. Please. It&amp;#39;s a quick read. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd8p36", "score_hidden": false, "stickied": false, "created": 1492442148.0, "created_utc": 1492413348.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgebvww", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TexMexBazooka", "parent_id": "t1_dgebpa2", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Anything you record, save on a cloud service like Google Drive, onedrive, Dropbox. I think there may even be an app designed to record things then store them on another device but I'm not entirely sure. \n\nWhat I'm saying is whatever you record, make sure it's saved where only you have​ access to it. Good luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anything you record, save on a cloud service like Google Drive, onedrive, Dropbox. I think there may even be an app designed to record things then store them on another device but I&amp;#39;m not entirely sure. &lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m saying is whatever you record, make sure it&amp;#39;s saved where only you have​ access to it. Good luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgebvww", "score_hidden": false, "stickied": false, "created": 1492501403.0, "created_utc": 1492472603.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgeeprk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "legaladvicethrow3842", "parent_id": "t1_dgeefsu", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "If he can't see you recording anything, that greatly alleviates some of the risks.\n\nNothing stops you from making new accounts and locking things down very tightly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If he can&amp;#39;t see you recording anything, that greatly alleviates some of the risks.&lt;/p&gt;\n\n&lt;p&gt;Nothing stops you from making new accounts and locking things down very tightly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgeeprk", "score_hidden": false, "stickied": false, "created": 1492504995.0, "created_utc": 1492476195.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeefsu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throwaway_babyseal", "parent_id": "t1_dgee9o7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thanks. I actually don't have any social media- I deleted it all over 3 years ago because my husband was too jealous. Red flag number 100. Anyways, I may have to do audio so I can hide my phone. He's been locking himself in the guest bedroom though and shouting through the door, so I may not get a chance. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. I actually don&amp;#39;t have any social media- I deleted it all over 3 years ago because my husband was too jealous. Red flag number 100. Anyways, I may have to do audio so I can hide my phone. He&amp;#39;s been locking himself in the guest bedroom though and shouting through the door, so I may not get a chance. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgeefsu", "score_hidden": false, "stickied": false, "created": 1492504647.0, "created_utc": 1492475847.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgee9o7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "legaladvicethrow3842", "parent_id": "t1_dgebpa2", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You can easily livestream to things like facebook from your phone these days which makes the destruction of the device more or less irrelevant.\n\nI wouldn't advise putting yourself in a position where he knows though. Even pure audio goes a long ways, so you can just leave something in a pocket/lying on a table. No need to wave cameras around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can easily livestream to things like facebook from your phone these days which makes the destruction of the device more or less irrelevant.&lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t advise putting yourself in a position where he knows though. Even pure audio goes a long ways, so you can just leave something in a pocket/lying on a table. No need to wave cameras around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgee9o7", "score_hidden": false, "stickied": false, "created": 1492504443.0, "created_utc": 1492475643.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgebpa2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throwaway_babyseal", "parent_id": "t1_dgeayx0", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I may try that tonight but it's dangerous. On my old work phone (I accidentally returned it without taking this off) I had a voice recording of him screaming at me and after he realized I was taking it, he forcibly took my phone, threw it on the ground and stomped on it multiple times. Surprisingly it survived that. But you're right, I feel like I just need some kind of evidence to prove he's psychotic because he presents so well when he needs to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I may try that tonight but it&amp;#39;s dangerous. On my old work phone (I accidentally returned it without taking this off) I had a voice recording of him screaming at me and after he realized I was taking it, he forcibly took my phone, threw it on the ground and stomped on it multiple times. Surprisingly it survived that. But you&amp;#39;re right, I feel like I just need some kind of evidence to prove he&amp;#39;s psychotic because he presents so well when he needs to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgebpa2", "score_hidden": false, "stickied": false, "created": 1492501166.0, "created_utc": 1492472366.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeayx0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TexMexBazooka", "parent_id": "t1_dgcwin3", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Get him on video when he flips his shit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get him on video when he flips his shit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgeayx0", "score_hidden": false, "stickied": false, "created": 1492500231.0, "created_utc": 1492471431.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwin3", "gilded": 0, "archived": false, "score": 68, "report_reasons": null, "author": "throwaway_babyseal", "parent_id": "t1_dgcvkni", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thanks. I did contact the domestic violence hotline and it was like they knew everything he did before I even told them. It just makes me feel like a stereotype. I know a paper trail would help me, but you wouldn't believe what he's like when the cops come- he immediately transforms into this charming gentle person who's \"so sorry the cops had to come out of their way to come here.\" It's unbelievable how he can be a raging maniac one second and totally normal the next. \n\nHe has threatened me that if I get the police involved he will come after me even worse. I have no confidence that the cops can stop him because a few years ago he was arrested for buying coke (bought from a dealer under police surveillance) and got out of it- he got the most famous criminal defense lawyer in the city (literally) and got the charges dropped. I have no doubt he'd do it again If arrested for something else. He has connections, he's smart, and he is totally narcissistic. He will do anything and everything to paint me in a bad light and get off Scott free. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. I did contact the domestic violence hotline and it was like they knew everything he did before I even told them. It just makes me feel like a stereotype. I know a paper trail would help me, but you wouldn&amp;#39;t believe what he&amp;#39;s like when the cops come- he immediately transforms into this charming gentle person who&amp;#39;s &amp;quot;so sorry the cops had to come out of their way to come here.&amp;quot; It&amp;#39;s unbelievable how he can be a raging maniac one second and totally normal the next. &lt;/p&gt;\n\n&lt;p&gt;He has threatened me that if I get the police involved he will come after me even worse. I have no confidence that the cops can stop him because a few years ago he was arrested for buying coke (bought from a dealer under police surveillance) and got out of it- he got the most famous criminal defense lawyer in the city (literally) and got the charges dropped. I have no doubt he&amp;#39;d do it again If arrested for something else. He has connections, he&amp;#39;s smart, and he is totally narcissistic. He will do anything and everything to paint me in a bad light and get off Scott free. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgcwin3", "score_hidden": false, "stickied": false, "created": 1492421334.0, "created_utc": 1492392534.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 68}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcvkni", "gilded": 0, "archived": false, "score": 163, "report_reasons": null, "author": "rhomboidus", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; How can I protect myself? \n\nContact a local organization that helps victims of abuse. They can get you started down the right path and put you in contact with an attorney. Start calling the cops when he starts making threats. The bigger the paper trail you have on him the better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;How can I protect myself? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Contact a local organization that helps victims of abuse. They can get you started down the right path and put you in contact with an attorney. Start calling the cops when he starts making threats. The bigger the paper trail you have on him the better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgcvkni", "score_hidden": false, "stickied": false, "created": 1492420133.0, "created_utc": 1492391333.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 163}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgeb0kv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "flamedarkfire", "parent_id": "t1_dgd15wn", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Even if they can't provide direct support maybe they can recommend the divorce lawyer with the most experience with domestic violence situations.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even if they can&amp;#39;t provide direct support maybe they can recommend the divorce lawyer with the most experience with domestic violence situations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgeb0kv", "score_hidden": false, "stickied": false, "created": 1492500292.0, "created_utc": 1492471492.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd15wn", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "throwaway_babyseal", "parent_id": "t1_dgczan7", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you for suggesting that. I am not actually admitted in Florida yet (only in NY). I just passed the bar here, but I still have to take the MRPE in August. Maybe they can help anyways though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for suggesting that. I am not actually admitted in Florida yet (only in NY). I just passed the bar here, but I still have to take the MRPE in August. Maybe they can help anyways though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd15wn", "score_hidden": false, "stickied": false, "created": 1492427816.0, "created_utc": 1492399016.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dgczan7", "gilded": 0, "archived": false, "score": 43, "report_reasons": null, "author": "choriste", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "If you are a member of the local bar association,reach out to whoever chairs the committee for lawyers with crisis situations.  Most problems have to do with substance abuse but the folks who volunteer for committees like that are mindful of privacy.  They are also going to know other lawyers in the bar you could speak to about family law.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you are a member of the local bar association,reach out to whoever chairs the committee for lawyers with crisis situations.  Most problems have to do with substance abuse but the folks who volunteer for committees like that are mindful of privacy.  They are also going to know other lawyers in the bar you could speak to about family law.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgczan7", "score_hidden": false, "stickied": false, "created": 1492425179.0, "created_utc": 1492396379.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 43}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd8wq4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cookingachicken", "parent_id": "t1_dgd8617", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "And vary your routines constantly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And vary your routines constantly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd8wq4", "score_hidden": false, "stickied": false, "created": 1492442727.0, "created_utc": 1492413927.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8617", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "forwardseat", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "On a practical, non legal level, make damned sure you are in possession of and control of your birth control at all times.  People like this will do anything to get you stay, including trying to get you pregnant, and they're not above tampering with your birth control to do it (unless you have an iud or something, of course)\n\nAnd once you set up a new place to live, get a p.o. Box and forward any mail there, do not use your new address. Document everything as much a possible- if not with calls to police, at the very least keep a detailed journal with dates and times of each incident.\n\nDo not let fear of being \"destroyed\" in a divorce stop you from making a better life for yourself. Even if he could (doubtful), better off living off ramen for a while than dead. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On a practical, non legal level, make damned sure you are in possession of and control of your birth control at all times.  People like this will do anything to get you stay, including trying to get you pregnant, and they&amp;#39;re not above tampering with your birth control to do it (unless you have an iud or something, of course)&lt;/p&gt;\n\n&lt;p&gt;And once you set up a new place to live, get a p.o. Box and forward any mail there, do not use your new address. Document everything as much a possible- if not with calls to police, at the very least keep a detailed journal with dates and times of each incident.&lt;/p&gt;\n\n&lt;p&gt;Do not let fear of being &amp;quot;destroyed&amp;quot; in a divorce stop you from making a better life for yourself. Even if he could (doubtful), better off living off ramen for a while than dead. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd8617", "score_hidden": false, "stickied": false, "created": 1492440935.0, "created_utc": 1492412135.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdgn1y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jmurphy42", "parent_id": "t1_dgd5yc1", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "They're married, the police will say it's a civil matter. She can, however, have the car rekeyed at any time so he can't get into it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re married, the police will say it&amp;#39;s a civil matter. She can, however, have the car rekeyed at any time so he can&amp;#39;t get into it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdgn1y", "score_hidden": false, "stickied": false, "created": 1492463808.0, "created_utc": 1492435008.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd5yc1", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "dwarf_ewok", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; [Car] is in my name but he threatens to just take it.\n\nIf he does so, contact the police and report the theft of your car.  Likewise, save any documentation you have of his drug use.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;[Car] is in my name but he threatens to just take it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If he does so, contact the police and report the theft of your car.  Likewise, save any documentation you have of his drug use.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd5yc1", "score_hidden": false, "stickied": false, "created": 1492436032.0, "created_utc": 1492407232.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd0q35", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "BobTheHeavy", "parent_id": "t1_dgd0ahr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "A good attorney will help you with the what ifs and develops a battle plan for them.\n\nSounds like he is great at mind games. If you want your apartment, car, and life to remain the same as much as possible talk to attorney and see what they think is feasible. \n\nBeing ashamed is normal even if there is nothing to be ashamed about. Therapy can help with it. You can find someone that makes you happy that won't care.\n\nAnyone that calls you an whore or an idiot is someone not worth your time. Morn what was but move on from abuse.", "edited": 1492398591.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A good attorney will help you with the what ifs and develops a battle plan for them.&lt;/p&gt;\n\n&lt;p&gt;Sounds like he is great at mind games. If you want your apartment, car, and life to remain the same as much as possible talk to attorney and see what they think is feasible. &lt;/p&gt;\n\n&lt;p&gt;Being ashamed is normal even if there is nothing to be ashamed about. Therapy can help with it. You can find someone that makes you happy that won&amp;#39;t care.&lt;/p&gt;\n\n&lt;p&gt;Anyone that calls you an whore or an idiot is someone not worth your time. Morn what was but move on from abuse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd0q35", "score_hidden": false, "stickied": false, "created": 1492427177.0, "created_utc": 1492398377.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgddznv", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "choriste", "parent_id": "t1_dgd8atz", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "^^^this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;this.&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgddznv", "score_hidden": false, "stickied": false, "created": 1492458598.0, "created_utc": 1492429798.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8atz", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Eeech", "parent_id": "t1_dgd0ahr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I don't practice family law either, but know enough about family law to know that there is essentiallt zero chance between the length of your marriage and the even shorter time your husband willingly left his high paying job to be supported by you. Alimony is generally awarded to allow the other partner to get an education/training to put themselves in a position to be able to support themselves. It is not awarded to people who left mid six figure jobs to become a creative - regardless of potential for opportunity. \n\nYou are fortunate that you rent and lease a single car; you will ultimately have very little marital property and debt, which means that a majority of the split will be you keeping what was the individual of each of  yours before and half of what was the collective yours, both assets and debt.\n\nYou can stop his allowance for cocaine after placing half your shared accounts (assuring it is enough to cover rent and bills) immediately. Please, please use as many domestic violence resources you can find - therapy, legal assistance for attorneys in DV situations, whatever you can find; this is for your mental health. \n\nThere is nothing wrong or abnormal about you staying in a horrible situation knowing better pragmatically. This is in fact the normal average response and I forget the number of attempts it usually takes to leave an abuser for good, but I remember it is higher than the number of attempts at quitting heroin and cigarettes combined. The man he acted to get you into the man in control of you is who you love, not the man he is, and out brains are not wired to resist that. It produces chemicals similar to opiate highs when around the nice version of him and is similar to an addiction. \n\nI left an abuser, my first real relationship around age 20. Actually, he left me for another woman. I honestly believe I would have stayed and married him and be a shell of the woman I grew into, which could not be more different. I even stayed after he threw his 3 year old daughter into a chair hard enough to require stitches, believing I could protect them if I stayed (the  mom had a drug problem so he had full custody.) He was so charming my own mother did not believe me when I went to her about being beaten as the babies were, and she founded a shelter program for victims of abuse and said I was overreacting. He was that good. \n\nYou need a LOT of support backing you, which you will find in the crisis centers and other people who escaped, including me. I would be honored if you would keep me posted privately about your progress as I am up past the time I promised myself I would get in bed just to write to you as this is one of a few topics I don't care what I am late for or it causes, I need to reply as I empathize so strongly I can't stop thinking about it until I do reach out. \n\nYou can do this. Please feel no shame in any of this, and fake that you don't until it is real. Take any and all support offered; you will need it. But most of all, remove the idea you'll be buying his skiing trips any longer or legally required to. No court would view him as genuinely dependent on you in a manner that alimony would be awarded.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t practice family law either, but know enough about family law to know that there is essentiallt zero chance between the length of your marriage and the even shorter time your husband willingly left his high paying job to be supported by you. Alimony is generally awarded to allow the other partner to get an education/training to put themselves in a position to be able to support themselves. It is not awarded to people who left mid six figure jobs to become a creative - regardless of potential for opportunity. &lt;/p&gt;\n\n&lt;p&gt;You are fortunate that you rent and lease a single car; you will ultimately have very little marital property and debt, which means that a majority of the split will be you keeping what was the individual of each of  yours before and half of what was the collective yours, both assets and debt.&lt;/p&gt;\n\n&lt;p&gt;You can stop his allowance for cocaine after placing half your shared accounts (assuring it is enough to cover rent and bills) immediately. Please, please use as many domestic violence resources you can find - therapy, legal assistance for attorneys in DV situations, whatever you can find; this is for your mental health. &lt;/p&gt;\n\n&lt;p&gt;There is nothing wrong or abnormal about you staying in a horrible situation knowing better pragmatically. This is in fact the normal average response and I forget the number of attempts it usually takes to leave an abuser for good, but I remember it is higher than the number of attempts at quitting heroin and cigarettes combined. The man he acted to get you into the man in control of you is who you love, not the man he is, and out brains are not wired to resist that. It produces chemicals similar to opiate highs when around the nice version of him and is similar to an addiction. &lt;/p&gt;\n\n&lt;p&gt;I left an abuser, my first real relationship around age 20. Actually, he left me for another woman. I honestly believe I would have stayed and married him and be a shell of the woman I grew into, which could not be more different. I even stayed after he threw his 3 year old daughter into a chair hard enough to require stitches, believing I could protect them if I stayed (the  mom had a drug problem so he had full custody.) He was so charming my own mother did not believe me when I went to her about being beaten as the babies were, and she founded a shelter program for victims of abuse and said I was overreacting. He was that good. &lt;/p&gt;\n\n&lt;p&gt;You need a LOT of support backing you, which you will find in the crisis centers and other people who escaped, including me. I would be honored if you would keep me posted privately about your progress as I am up past the time I promised myself I would get in bed just to write to you as this is one of a few topics I don&amp;#39;t care what I am late for or it causes, I need to reply as I empathize so strongly I can&amp;#39;t stop thinking about it until I do reach out. &lt;/p&gt;\n\n&lt;p&gt;You can do this. Please feel no shame in any of this, and fake that you don&amp;#39;t until it is real. Take any and all support offered; you will need it. But most of all, remove the idea you&amp;#39;ll be buying his skiing trips any longer or legally required to. No court would view him as genuinely dependent on you in a manner that alimony would be awarded.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd8atz", "score_hidden": false, "stickied": false, "created": 1492441242.0, "created_utc": 1492412442.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd3a9x", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "legaladvicethrow3842", "parent_id": "t1_dgd0ahr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Why do you care what a cokehead thinks and says of you?\n\nBreak it down. You care because you are allowing yourself to be held to some self inflicted absurd standards. Maybe there's some personal insecurities underlying this. Maybe you've just been browbeaten into a power struggle where you can't see the forest for the trees. You should definitely talk with a therapist experienced in abuse and drug use, but at the end of the day what he says doesn't matter.\n\nI mean seriously, can you truthfully come up with a logical reason for why a drug addict's view on you should matter? Even if you completely disregard the possibility that he's just saying things to condition you? Why should anyone give a shit?", "edited": 1492427451.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why do you care what a cokehead thinks and says of you?&lt;/p&gt;\n\n&lt;p&gt;Break it down. You care because you are allowing yourself to be held to some self inflicted absurd standards. Maybe there&amp;#39;s some personal insecurities underlying this. Maybe you&amp;#39;ve just been browbeaten into a power struggle where you can&amp;#39;t see the forest for the trees. You should definitely talk with a therapist experienced in abuse and drug use, but at the end of the day what he says doesn&amp;#39;t matter.&lt;/p&gt;\n\n&lt;p&gt;I mean seriously, can you truthfully come up with a logical reason for why a drug addict&amp;#39;s view on you should matter? Even if you completely disregard the possibility that he&amp;#39;s just saying things to condition you? Why should anyone give a shit?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd3a9x", "score_hidden": false, "stickied": false, "created": 1492431070.0, "created_utc": 1492402270.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdg0xn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "myownfunusername", "parent_id": "t1_dgd46uw", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I don't think that calculator is working right. For supported spouse $10k/yr, paying spouse 25k/yr,  marriage between 1-3 years and age between 21 and 40, 39k in annual alimony?? Trying less than 1 year comes up with a huge number. \n\nEdit: maybe just my numbers are too small. Adding a zero to make 100k and 250k gives 39k as the result too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think that calculator is working right. For supported spouse $10k/yr, paying spouse 25k/yr,  marriage between 1-3 years and age between 21 and 40, 39k in annual alimony?? Trying less than 1 year comes up with a huge number. &lt;/p&gt;\n\n&lt;p&gt;Edit: maybe just my numbers are too small. Adding a zero to make 100k and 250k gives 39k as the result too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdg0xn", "score_hidden": false, "stickied": false, "created": 1492462744.0, "created_utc": 1492433944.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd46uw", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "WafflesTheDuck", "parent_id": "t1_dgd0ahr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Florida alimony calculator.\n\nhttp://alimonycalculator.us/florida/\n\nYour marriage is pretty short.  I doubt it would be more than half the life if your marriage if that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Florida alimony calculator.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://alimonycalculator.us/florida/\"&gt;http://alimonycalculator.us/florida/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Your marriage is pretty short.  I doubt it would be more than half the life if your marriage if that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd46uw", "score_hidden": false, "stickied": false, "created": 1492432606.0, "created_utc": 1492403806.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd3z5j", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "fakeprewarbook", "parent_id": "t1_dgd0ahr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Losing half your money matters less than staying alive. Don't delude yourself. He's hitting you so your head bounces off things. He will kill you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Losing half your money matters less than staying alive. Don&amp;#39;t delude yourself. He&amp;#39;s hitting you so your head bounces off things. He will kill you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd3z5j", "score_hidden": false, "stickied": false, "created": 1492432229.0, "created_utc": 1492403429.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd7y4j", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Carensza", "parent_id": "t1_dgd0ahr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You say you don't want to give him the satisfaction of ending the marriage but why on earth would he want a divorce? He loves having a wife that he can blame all of his woes upon, when he falls on his arse as a writer because his coke habit makes his writing shit, he'll just blame you for making him give up his high income job and for being such a bitch wife that he has to take drugs just to cope. You've moved to Florida so you're isolated from friends and family, you are so used to listening to his gaslighting that you are willing to cut off your nose to spite your face.\n\n\nTake your $15k in your bank account. Go to a hotel for a few nights. Call into the emergency room get your wrist x-rayed. Order room service in your swanky hotel room, have someone else look after you like a princess even if it's just the hotel staff.\n\n\nHe thinks you're an idiot? (Actually I bet he doesn't, he just has you convinced that you're a moron); well that's just ridiculous, you have 7/8 years of university, you're smart and educated and obviously kind to have gotten a leech to hang on so tight.\n\n\nAs for second marriage breaking up, that is a blow to your self esteem, I know, I have been in the exact same situation.   Was convinced I was unlovable, two failed relationships by 29. However when I was 30 and totally done with relationships I met my best friend​ and now husband, we've been happily married for 11 years. If I had stayed in the second abusive one I never would have had my life turn out so awesome. Also my ex treats his wife like shit too now. She's 35 ish and she looks a decade older because it is exhausting dealing with his crap.", "edited": 1492426380.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You say you don&amp;#39;t want to give him the satisfaction of ending the marriage but why on earth would he want a divorce? He loves having a wife that he can blame all of his woes upon, when he falls on his arse as a writer because his coke habit makes his writing shit, he&amp;#39;ll just blame you for making him give up his high income job and for being such a bitch wife that he has to take drugs just to cope. You&amp;#39;ve moved to Florida so you&amp;#39;re isolated from friends and family, you are so used to listening to his gaslighting that you are willing to cut off your nose to spite your face.&lt;/p&gt;\n\n&lt;p&gt;Take your $15k in your bank account. Go to a hotel for a few nights. Call into the emergency room get your wrist x-rayed. Order room service in your swanky hotel room, have someone else look after you like a princess even if it&amp;#39;s just the hotel staff.&lt;/p&gt;\n\n&lt;p&gt;He thinks you&amp;#39;re an idiot? (Actually I bet he doesn&amp;#39;t, he just has you convinced that you&amp;#39;re a moron); well that&amp;#39;s just ridiculous, you have 7/8 years of university, you&amp;#39;re smart and educated and obviously kind to have gotten a leech to hang on so tight.&lt;/p&gt;\n\n&lt;p&gt;As for second marriage breaking up, that is a blow to your self esteem, I know, I have been in the exact same situation.   Was convinced I was unlovable, two failed relationships by 29. However when I was 30 and totally done with relationships I met my best friend​ and now husband, we&amp;#39;ve been happily married for 11 years. If I had stayed in the second abusive one I never would have had my life turn out so awesome. Also my ex treats his wife like shit too now. She&amp;#39;s 35 ish and she looks a decade older because it is exhausting dealing with his crap.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd7y4j", "score_hidden": false, "stickied": false, "created": 1492440406.0, "created_utc": 1492411606.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdjxln", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "forwardseat", "parent_id": "t1_dgd0ahr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt;what if he drains all my money in a bitter legal battle?\n\nYou'll be alive.\n\n&gt;What if he gets half my salary in alimony?\n\nYou'll eat ramen for a while, and be alive.  (though with your salary, you should do fine even if he does do this - it will seem like a lot but you won't be specifically having to worry about his credit debt and all that other shit.)\n\n&gt;What if he ruins my reputation?\n\nThe only reputation he'll be ruining is his own.  \n\n&gt;What if he goes to people at my firm and tries to get me fired so I lose everything I have (he has threatened that, of course)? \n\nTell your management/firm/security that he is not allowed in the building. Consider a restraining order.  If you work with a bunch of lawyers, chances are at some point they've seen/heard of crazier people than your husband.  If a few people know what's going on and know to call the cops if he shows his face, they're far less likely to take him seriously.\n\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;what if he drains all my money in a bitter legal battle?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;ll be alive.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What if he gets half my salary in alimony?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;ll eat ramen for a while, and be alive.  (though with your salary, you should do fine even if he does do this - it will seem like a lot but you won&amp;#39;t be specifically having to worry about his credit debt and all that other shit.)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What if he ruins my reputation?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The only reputation he&amp;#39;ll be ruining is his own.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What if he goes to people at my firm and tries to get me fired so I lose everything I have (he has threatened that, of course)? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Tell your management/firm/security that he is not allowed in the building. Consider a restraining order.  If you work with a bunch of lawyers, chances are at some point they&amp;#39;ve seen/heard of crazier people than your husband.  If a few people know what&amp;#39;s going on and know to call the cops if he shows his face, they&amp;#39;re far less likely to take him seriously.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdjxln", "score_hidden": false, "stickied": false, "created": 1492468648.0, "created_utc": 1492439848.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdqq6x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jupitaur9", "parent_id": "t1_dgd0ahr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "What if you stay and he continues to abuse you?  What if eventually he kills you? \n\n&gt;I'm not going to give him the satisfaction of leaving and letting him talk about how I broke my promise (and not tell anyone about all the shit he does to push me away)\n\nDon't be a victim of your own pride, or some \"principle\" that he should be the one embarrassed.  People like this don't get embarrassed.  They lie, and you can't stop them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if you stay and he continues to abuse you?  What if eventually he kills you? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m not going to give him the satisfaction of leaving and letting him talk about how I broke my promise (and not tell anyone about all the shit he does to push me away)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Don&amp;#39;t be a victim of your own pride, or some &amp;quot;principle&amp;quot; that he should be the one embarrassed.  People like this don&amp;#39;t get embarrassed.  They lie, and you can&amp;#39;t stop them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdqq6x", "score_hidden": false, "stickied": false, "created": 1492476594.0, "created_utc": 1492447794.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdrq9y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "2manymans", "parent_id": "t1_dgd0ahr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt;I'm just so scared of the what ifs- what if he drains all my money in a bitter legal battle? What if he gets half my salary in alimony? \n\n\nIt's only money. Would you really rather stay in a relationship with a man who *assaults* you than lose some money?  Hopefully you keep your money, but even if you don't? So what? Let your attorney worry about it. \n\n\n&gt;What if he ruins my reputation? \n\n\nWith who? Your friends and family? They won't listen to him, and if they do, they share the same abusive tendencies. With your profession?  That's possible, but let your attorney worry about it. \n\n\n&gt;What if he goes to people at my firm and tries to get me fired so I lose everything I have (he has threatened that, of course)? \n\n\nNeed prepared that he may try to harm you this way. Hopefully he doesn't know about too many of your skeletons. Let your attorney worry about this. \n\n\n&gt;What if he drains me with alimony payments and hides assets from the court (it's possible he may have some success on the writing front and the payments would go to an LLC)?\n\nAs above. \n\n\n&gt;He wants me to leave him so he looks like the good guy- like I'm the one who abandoned him when I promised I never would. \n\nWhy does this matter to you? Who cares what he thinks or what anyone else thinks? Relationships end all the time for a million different reasons. \n\n&gt;And I don't want to give him the satisfaction. If he wants to divorce me, I want him to have to do it himself. I'm not going to give him the satisfaction of leaving and letting him talk about how I broke my promise (and not tell anyone about all the shit he does to push me away).\n\nHuh? He doesn't want a divorce. You are his meal ticket and his doormat. Why would he ever want to divorce you? Why do you care about him getting \"satisfaction?\" \n\n\n&gt;And I don't want to leave my apartment. We just moved to FL last year and I like our apartment and my car and my job and my life here. Both our names are on the lease and there is almost a year left on it. \n\nLegitimate concern, but not nearly enough to stay in a relationship where you are physically and emotionally abused. There are other cars and condos and jobs. \n\n&gt;This is also my second marriage, so I feel bad about it not working out. At my age, to go through two marriages just makes me feel ashamed. \n\nIs it worse to leave an abusive marriage than to stay and get assaulted? Really? The only \"shame\" you should experience is being in a relationship with him in the first place. That ship has sailed and its time to stop throwing good money after bad. Walk away from this shit head with your head held high. \n\n&gt;And despite it all, I still love him. Maybe it's just loving the idea of him, how he used to be- he used to do everything for me. He adored me. And now he just calls me a whore and an idiot.  \n\n\nYes. You loved the mask he wore. And then he threw the mask on the ground and stomped on it and you want him to put it back on as if it isn't broken in 1000 pieces. You need to accept that the person you love is not real and the only real person is the monster. It's OK to mourn that loss. Just do it after you get the hell away from him and have a divorce action pending. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m just so scared of the what ifs- what if he drains all my money in a bitter legal battle? What if he gets half my salary in alimony? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s only money. Would you really rather stay in a relationship with a man who &lt;em&gt;assaults&lt;/em&gt; you than lose some money?  Hopefully you keep your money, but even if you don&amp;#39;t? So what? Let your attorney worry about it. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What if he ruins my reputation? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;With who? Your friends and family? They won&amp;#39;t listen to him, and if they do, they share the same abusive tendencies. With your profession?  That&amp;#39;s possible, but let your attorney worry about it. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What if he goes to people at my firm and tries to get me fired so I lose everything I have (he has threatened that, of course)? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Need prepared that he may try to harm you this way. Hopefully he doesn&amp;#39;t know about too many of your skeletons. Let your attorney worry about this. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What if he drains me with alimony payments and hides assets from the court (it&amp;#39;s possible he may have some success on the writing front and the payments would go to an LLC)?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As above. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He wants me to leave him so he looks like the good guy- like I&amp;#39;m the one who abandoned him when I promised I never would. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why does this matter to you? Who cares what he thinks or what anyone else thinks? Relationships end all the time for a million different reasons. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And I don&amp;#39;t want to give him the satisfaction. If he wants to divorce me, I want him to have to do it himself. I&amp;#39;m not going to give him the satisfaction of leaving and letting him talk about how I broke my promise (and not tell anyone about all the shit he does to push me away).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Huh? He doesn&amp;#39;t want a divorce. You are his meal ticket and his doormat. Why would he ever want to divorce you? Why do you care about him getting &amp;quot;satisfaction?&amp;quot; &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And I don&amp;#39;t want to leave my apartment. We just moved to FL last year and I like our apartment and my car and my job and my life here. Both our names are on the lease and there is almost a year left on it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Legitimate concern, but not nearly enough to stay in a relationship where you are physically and emotionally abused. There are other cars and condos and jobs. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This is also my second marriage, so I feel bad about it not working out. At my age, to go through two marriages just makes me feel ashamed. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is it worse to leave an abusive marriage than to stay and get assaulted? Really? The only &amp;quot;shame&amp;quot; you should experience is being in a relationship with him in the first place. That ship has sailed and its time to stop throwing good money after bad. Walk away from this shit head with your head held high. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And despite it all, I still love him. Maybe it&amp;#39;s just loving the idea of him, how he used to be- he used to do everything for me. He adored me. And now he just calls me a whore and an idiot.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes. You loved the mask he wore. And then he threw the mask on the ground and stomped on it and you want him to put it back on as if it isn&amp;#39;t broken in 1000 pieces. You need to accept that the person you love is not real and the only real person is the monster. It&amp;#39;s OK to mourn that loss. Just do it after you get the hell away from him and have a divorce action pending. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdrq9y", "score_hidden": false, "stickied": false, "created": 1492477713.0, "created_utc": 1492448913.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd8u5t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cookingachicken", "parent_id": "t1_dgd0ahr", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You're gIvinghim a lot of power. You may find he's only a childish bully. But you can't let him terrorize you into living in a jail without bars. Your are ensnared with a sociopath. They are so charming and sweet. But it was intentional. Just to win you over and now use you. Find your strength! Get women to surround you with and protect yourself. He doesn't have any power you don't give him. Take your money out. Load up your car when he's out, take your stuff, hire rye best attorney you can find, go no contact, and start decompressing with a good therapist. So many people have been hurt by this type of person. Don't feel foolish. Now you will know what to watch out for. But PLEASE get the book. Understanding the dynamics of what's happening between you will help you see it from a different point of view. You can do this!\n\nETA:  really, really bad typos. I'm sorry!", "edited": 1492431594.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re gIvinghim a lot of power. You may find he&amp;#39;s only a childish bully. But you can&amp;#39;t let him terrorize you into living in a jail without bars. Your are ensnared with a sociopath. They are so charming and sweet. But it was intentional. Just to win you over and now use you. Find your strength! Get women to surround you with and protect yourself. He doesn&amp;#39;t have any power you don&amp;#39;t give him. Take your money out. Load up your car when he&amp;#39;s out, take your stuff, hire rye best attorney you can find, go no contact, and start decompressing with a good therapist. So many people have been hurt by this type of person. Don&amp;#39;t feel foolish. Now you will know what to watch out for. But PLEASE get the book. Understanding the dynamics of what&amp;#39;s happening between you will help you see it from a different point of view. You can do this!&lt;/p&gt;\n\n&lt;p&gt;ETA:  really, really bad typos. I&amp;#39;m sorry!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd8u5t", "score_hidden": false, "stickied": false, "created": 1492442529.0, "created_utc": 1492413729.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0ahr", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "throwaway_babyseal", "parent_id": "t1_dgcz1ur", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thanks I think I will consult an attorney this week. I'm just so scared of the what ifs- what if he drains all my money in a bitter legal battle? What if he gets half my salary in alimony? What if he ruins my reputation? What if he goes to people at my firm and tries to get me fired so I lose everything I have (he has threatened that, of course)? What if he drains me with alimony payments and hides assets from the court (it's possible he may have some success on the writing front and the payments would go to an LLC)?\n\nAs for why I stay- if I'm honest, it's a combination of of misguided love and stubbornness. He wants me to leave him so he looks like the good guy- like I'm the one who abandoned him when I promised I never would. And I don't want to give him the satisfaction. If he wants to divorce me, I want him to have to do it himself. I'm not going to give him the satisfaction of leaving and letting him talk about how I broke my promise (and not tell anyone about all the shit he does to push me away). And I don't want to leave my apartment. We just moved to FL last year and I like our apartment and my car and my job and my life here. Both our names are on the lease and there is almost a year left on it. This is also my second marriage, so I feel bad about it not working out. At my age, to go through two marriages just makes me feel ashamed. And despite it all, I still love him. Maybe it's just loving the idea of him, how he used to be- he used to do everything for me. He adored me. And now he just calls me a whore and an idiot. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks I think I will consult an attorney this week. I&amp;#39;m just so scared of the what ifs- what if he drains all my money in a bitter legal battle? What if he gets half my salary in alimony? What if he ruins my reputation? What if he goes to people at my firm and tries to get me fired so I lose everything I have (he has threatened that, of course)? What if he drains me with alimony payments and hides assets from the court (it&amp;#39;s possible he may have some success on the writing front and the payments would go to an LLC)?&lt;/p&gt;\n\n&lt;p&gt;As for why I stay- if I&amp;#39;m honest, it&amp;#39;s a combination of of misguided love and stubbornness. He wants me to leave him so he looks like the good guy- like I&amp;#39;m the one who abandoned him when I promised I never would. And I don&amp;#39;t want to give him the satisfaction. If he wants to divorce me, I want him to have to do it himself. I&amp;#39;m not going to give him the satisfaction of leaving and letting him talk about how I broke my promise (and not tell anyone about all the shit he does to push me away). And I don&amp;#39;t want to leave my apartment. We just moved to FL last year and I like our apartment and my car and my job and my life here. Both our names are on the lease and there is almost a year left on it. This is also my second marriage, so I feel bad about it not working out. At my age, to go through two marriages just makes me feel ashamed. And despite it all, I still love him. Maybe it&amp;#39;s just loving the idea of him, how he used to be- he used to do everything for me. He adored me. And now he just calls me a whore and an idiot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd0ahr", "score_hidden": false, "stickied": false, "created": 1492426567.0, "created_utc": 1492397767.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcz1ur", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "BobTheHeavy", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "&gt; Can he use facts from my distant past with the court to paint me in a bad light?\n\nHiring the appropriate attorney should alleviate these concerns. Talk to them about the specifics.\n\n&gt; Can he really get alimony from me when his income before he stopped working was so high, and given that he is choosing not to work? \n\nPossibly. Talk to your attorney about it.\n\n&gt;I'm sorry for the wall of text. I don't know what's going to happen- his moods are fickle and despite everything I do love him (I miss how he used to be). Help?\n\nYou should contact an attorney and get divorce proceedings started.\n\nYou should also consider leaving, either to a hotel, friends, or a shelter. Talk to your attorney about this.\n\nAsk yourself what is keeping me here besides fear? Seems like your are buying a lot of his bullshit. How can you love someone that terrifies and abuses you. It's ok to feel like a stereotype and hate it. They are stereotypes for a reason, because dickbags are not uncommon.\n", "edited": 1492396287.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Can he use facts from my distant past with the court to paint me in a bad light?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hiring the appropriate attorney should alleviate these concerns. Talk to them about the specifics.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Can he really get alimony from me when his income before he stopped working was so high, and given that he is choosing not to work? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Possibly. Talk to your attorney about it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m sorry for the wall of text. I don&amp;#39;t know what&amp;#39;s going to happen- his moods are fickle and despite everything I do love him (I miss how he used to be). Help?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You should contact an attorney and get divorce proceedings started.&lt;/p&gt;\n\n&lt;p&gt;You should also consider leaving, either to a hotel, friends, or a shelter. Talk to your attorney about this.&lt;/p&gt;\n\n&lt;p&gt;Ask yourself what is keeping me here besides fear? Seems like your are buying a lot of his bullshit. How can you love someone that terrifies and abuses you. It&amp;#39;s ok to feel like a stereotype and hate it. They are stereotypes for a reason, because dickbags are not uncommon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgcz1ur", "score_hidden": false, "stickied": false, "created": 1492424833.0, "created_utc": 1492396033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgd8fa4", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Cookingachicken", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Stop telling yourself you love him. You have an unkind, unhealthy, fear-based codependent relationship that is masquerading as love. Re:\"love\" ... none of what he is doing is loving. Please stop using that word. You are being used and abused. And you are a strong, intelligent, amazing woman with so much to offer the world. \n\nIt seems you may need a good advocate... a Counselor or therapist, to help you find your strength; and a great family lawyer to advise you. The best advice I could give is for you to follow your lawyer's advice. You know that's good advice! But I suspect it will be hard for you to take. Lawyers are tough clients! But if you could find one you'll trust, it would help you a lot with the uncertainty portion of this situation. \n\nAre you a romantic type of person? Are you afraid to be alone? Do you think you'll never find anyone else, and this is better than nothing? What's going on in you that you're allowing these threats to cause you fear?  If he takes the car, report it stolen! If he sues for alimony, laugh!  He'll never get it. He's not dependent on you due to rearing your children or suffering from an illness..so a judge would see right through that!\n\nWhat would you tell your best friend if she were you? You might need to become your best friend and also reach out for professional women to help you through this. Best of wishes to you. ", "edited": 1492431647.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop telling yourself you love him. You have an unkind, unhealthy, fear-based codependent relationship that is masquerading as love. Re:&amp;quot;love&amp;quot; ... none of what he is doing is loving. Please stop using that word. You are being used and abused. And you are a strong, intelligent, amazing woman with so much to offer the world. &lt;/p&gt;\n\n&lt;p&gt;It seems you may need a good advocate... a Counselor or therapist, to help you find your strength; and a great family lawyer to advise you. The best advice I could give is for you to follow your lawyer&amp;#39;s advice. You know that&amp;#39;s good advice! But I suspect it will be hard for you to take. Lawyers are tough clients! But if you could find one you&amp;#39;ll trust, it would help you a lot with the uncertainty portion of this situation. &lt;/p&gt;\n\n&lt;p&gt;Are you a romantic type of person? Are you afraid to be alone? Do you think you&amp;#39;ll never find anyone else, and this is better than nothing? What&amp;#39;s going on in you that you&amp;#39;re allowing these threats to cause you fear?  If he takes the car, report it stolen! If he sues for alimony, laugh!  He&amp;#39;ll never get it. He&amp;#39;s not dependent on you due to rearing your children or suffering from an illness..so a judge would see right through that!&lt;/p&gt;\n\n&lt;p&gt;What would you tell your best friend if she were you? You might need to become your best friend and also reach out for professional women to help you through this. Best of wishes to you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgd8fa4", "score_hidden": false, "stickied": false, "created": 1492441511.0, "created_utc": 1492412711.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgduesu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NeedsToShutUp", "parent_id": "t1_dgdcyyq", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I second this, and we can be more direct there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I second this, and we can be more direct there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgduesu", "score_hidden": false, "stickied": false, "created": 1492480674.0, "created_utc": 1492451874.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcyyq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Rabl", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Come join us at r/lawyers, my learned friend. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Come join us at &lt;a href=\"/r/lawyers\"&gt;r/lawyers&lt;/a&gt;, my learned friend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdcyyq", "score_hidden": false, "stickied": false, "created": 1492455985.0, "created_utc": 1492427185.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdh6yo", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Daleth2", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "You are a lawyer. Go see a divorce lawyer. It's that simple. I'm really sorry you're going through this. It is clearly already affecting your ability to think through solutions to your problems--usually any lawyer, when faced with a possible legal problem in an unfamiliar area of law, will know immediately that the solution to their problem starts with seeing a lawyer who practices in that area. He must really be affecting you badly if you didn't reach that conclusion by yourself. But it is the right conclusion--go see a great divorce lawyer in your area.\n\nAlso, in case this isn't already how things are, separate your money. If your paycheck is deposited into a joint account, change that--open an individual account (if you don't already have one) and have it deposited there. Actually even if you do already have an individual account, open a new one at a different bank, have your pay deposited there, and arrange to have any statements from that new bank sent to somewhere he doesn't have access to--either a mailbox (UPS stores often have mailboxes you can rent, like PO boxes but more convenient, for about $15-$20/mo) or electronically to a new email address that he doesn't know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are a lawyer. Go see a divorce lawyer. It&amp;#39;s that simple. I&amp;#39;m really sorry you&amp;#39;re going through this. It is clearly already affecting your ability to think through solutions to your problems--usually any lawyer, when faced with a possible legal problem in an unfamiliar area of law, will know immediately that the solution to their problem starts with seeing a lawyer who practices in that area. He must really be affecting you badly if you didn&amp;#39;t reach that conclusion by yourself. But it is the right conclusion--go see a great divorce lawyer in your area.&lt;/p&gt;\n\n&lt;p&gt;Also, in case this isn&amp;#39;t already how things are, separate your money. If your paycheck is deposited into a joint account, change that--open an individual account (if you don&amp;#39;t already have one) and have it deposited there. Actually even if you do already have an individual account, open a new one at a different bank, have your pay deposited there, and arrange to have any statements from that new bank sent to somewhere he doesn&amp;#39;t have access to--either a mailbox (UPS stores often have mailboxes you can rent, like PO boxes but more convenient, for about $15-$20/mo) or electronically to a new email address that he doesn&amp;#39;t know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdh6yo", "score_hidden": false, "stickied": false, "created": 1492464695.0, "created_utc": 1492435895.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdawqq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Absolut_Iceland", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "OP, a quick word since you're worried about finances, but alimony likely won't be too terrible of a burden for you.  Once you've split his drug habit is his problem, so you only need to worry about yourself.  The credit card bills will be tricky, that will be up to your lawyer to figure out.  One positive for you will be the short duration of the marriage.  The other big one will be that the ability of the spouse receiving support to work is usually factored into alimony awards, and to be more precise the earning potential of that spouse regardless of what amount they actually earn.  Because he is able to earn significantly more than you, even though he chooses not to, that should reduce if not eliminate any amount of alimony you would owe him.  But the best person to answer that would definitely be your lawyer.\n\nAs far as painting you in a bad light, that's almost entirely irrelevant.  He can, and it sounds like he might do that just because he is a nasty individual, but that won't affect the relevant facts of the divorce.  The moral attributes of the opposing parties, if you want to put it like that, don't usually matter.  For instance, if one partner in a relationship was unfaithful and that is the cause for divorce, there is no penalty levied against them for their actions.  (They don't get less alimony than otherwise, or have to pay more alimony than otherwise, etc)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, a quick word since you&amp;#39;re worried about finances, but alimony likely won&amp;#39;t be too terrible of a burden for you.  Once you&amp;#39;ve split his drug habit is his problem, so you only need to worry about yourself.  The credit card bills will be tricky, that will be up to your lawyer to figure out.  One positive for you will be the short duration of the marriage.  The other big one will be that the ability of the spouse receiving support to work is usually factored into alimony awards, and to be more precise the earning potential of that spouse regardless of what amount they actually earn.  Because he is able to earn significantly more than you, even though he chooses not to, that should reduce if not eliminate any amount of alimony you would owe him.  But the best person to answer that would definitely be your lawyer.&lt;/p&gt;\n\n&lt;p&gt;As far as painting you in a bad light, that&amp;#39;s almost entirely irrelevant.  He can, and it sounds like he might do that just because he is a nasty individual, but that won&amp;#39;t affect the relevant facts of the divorce.  The moral attributes of the opposing parties, if you want to put it like that, don&amp;#39;t usually matter.  For instance, if one partner in a relationship was unfaithful and that is the cause for divorce, there is no penalty levied against them for their actions.  (They don&amp;#39;t get less alimony than otherwise, or have to pay more alimony than otherwise, etc)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdawqq", "score_hidden": false, "stickied": false, "created": 1492449266.0, "created_utc": 1492420466.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdoyfl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BallisticWinter", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I should preface this with the fact that I'm not a lawyer. I'm sorry this is happening to you. \n\n&gt; The cops came once when we lived in NYC and I stupidly asked them not to arrest him. I do fight back when he gets like that- I have thrown small things at him and left marks on his arm once when trying to wrench his hands off my arm when he was twisting it.\n\nLeaving marks trying to get him to get his hands off you could work in your favor. \n\nI imagine a lot depends on what was documented when the cops showed up. You'll want to talk with an attorney about this. \n\nGet a note book and take it everywhere with you.Write down all of the things you think that might be relevant to this case. Write down all of the questions you have. Take that with you when you meet your attorney.  Otherwise you might forget something. \n\n&gt;  Plus I've never documented the bruises or gone to the doctor. He never hits my face so no one has seen, but I have told co-workers I trust about what has happened.\n\nIf he ever touches or threatens you again, call the cops. \n\n&gt;  The leased car (we only have the one) is in my name but he threatens to just take it. \n\nIf it's solely in your name, he can pound sand. Check with the dealership. \n\nIf he's on the paperwork you can have him struck off for a fee with the dealership that leased the car to you (there might be a bit more to it than that though). I don't know why the fuck white out is so expensive.\n\n If he tries to take YOUR car, call the cops. \n\n&gt; I make a lot, but with supporting him and his credit card debt and drug habit, we don't have much left at the end of the month. \n\nYou don't support him, you don't have credit card debt or a drug habit. \n\n\n&gt;  Can he use facts from my distant past with the court to paint me in a bad light? \n\nThat sounds like something you should bring up with your attorney and talk about how you're gonna handle that. You'll do fine.  \n\n&gt; Can he really get alimony from me when his income before he stopped working was so high, and given that he is choosing not to work? \n\nI'm not an attorney but given his potential income as an attorney, the abuse, and the short duration of the marriage I would imagine his odds are about as good as me winning an arm wrestling match with The Mountain. Talk with an attorney. \n\nRight now, follow Floomby's advice. It's spot on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I should preface this with the fact that I&amp;#39;m not a lawyer. I&amp;#39;m sorry this is happening to you. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The cops came once when we lived in NYC and I stupidly asked them not to arrest him. I do fight back when he gets like that- I have thrown small things at him and left marks on his arm once when trying to wrench his hands off my arm when he was twisting it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Leaving marks trying to get him to get his hands off you could work in your favor. &lt;/p&gt;\n\n&lt;p&gt;I imagine a lot depends on what was documented when the cops showed up. You&amp;#39;ll want to talk with an attorney about this. &lt;/p&gt;\n\n&lt;p&gt;Get a note book and take it everywhere with you.Write down all of the things you think that might be relevant to this case. Write down all of the questions you have. Take that with you when you meet your attorney.  Otherwise you might forget something. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Plus I&amp;#39;ve never documented the bruises or gone to the doctor. He never hits my face so no one has seen, but I have told co-workers I trust about what has happened.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If he ever touches or threatens you again, call the cops. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The leased car (we only have the one) is in my name but he threatens to just take it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If it&amp;#39;s solely in your name, he can pound sand. Check with the dealership. &lt;/p&gt;\n\n&lt;p&gt;If he&amp;#39;s on the paperwork you can have him struck off for a fee with the dealership that leased the car to you (there might be a bit more to it than that though). I don&amp;#39;t know why the fuck white out is so expensive.&lt;/p&gt;\n\n&lt;p&gt;If he tries to take YOUR car, call the cops. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I make a lot, but with supporting him and his credit card debt and drug habit, we don&amp;#39;t have much left at the end of the month. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You don&amp;#39;t support him, you don&amp;#39;t have credit card debt or a drug habit. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Can he use facts from my distant past with the court to paint me in a bad light? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That sounds like something you should bring up with your attorney and talk about how you&amp;#39;re gonna handle that. You&amp;#39;ll do fine.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Can he really get alimony from me when his income before he stopped working was so high, and given that he is choosing not to work? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not an attorney but given his potential income as an attorney, the abuse, and the short duration of the marriage I would imagine his odds are about as good as me winning an arm wrestling match with The Mountain. Talk with an attorney. &lt;/p&gt;\n\n&lt;p&gt;Right now, follow Floomby&amp;#39;s advice. It&amp;#39;s spot on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdoyfl", "score_hidden": false, "stickied": false, "created": 1492474629.0, "created_utc": 1492445829.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgdtd48", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TotesMessenger", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/bestoflegaladvice] [Actual good process for getting out of abusive life situation. No snark, no idiocy, just good advice.](https://np.reddit.com/r/bestoflegaladvice/comments/65x16n/actual_good_process_for_getting_out_of_abusive/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a bot, &lt;em&gt;bleep&lt;/em&gt;, &lt;em&gt;bloop&lt;/em&gt;. Someone has linked to this thread from another place on reddit:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;[&lt;a href=\"/r/bestoflegaladvice\"&gt;/r/bestoflegaladvice&lt;/a&gt;] &lt;a href=\"https://np.reddit.com/r/bestoflegaladvice/comments/65x16n/actual_good_process_for_getting_out_of_abusive/\"&gt;Actual good process for getting out of abusive life situation. No snark, no idiocy, just good advice.&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;a href=\"#footer\"&gt;&lt;/a&gt;&lt;em&gt;&lt;sup&gt;If you follow any of the above links, please respect the rules of reddit and don&amp;#39;t vote in the other threads.&lt;/sup&gt; &lt;sup&gt;(&lt;a href=\"/r/TotesMessenger\"&gt;Info&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;/&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"/message/compose?to=/r/TotesMessenger\"&gt;Contact&lt;/a&gt;)&lt;/sup&gt;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"#bot\"&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdtd48", "score_hidden": false, "stickied": false, "created": 1492479528.0, "created_utc": 1492450728.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65si5b", "likes": null, "replies": "", "user_reports": [], "id": "dgeeeyj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "legaladvicethrow3842", "parent_id": "t1_dgdunui", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Let things go to voicemail, or setup recording (there's tons of applications for android that can do this). Save the texts.\n\nHe's literally giving you exactly what you want.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let things go to voicemail, or setup recording (there&amp;#39;s tons of applications for android that can do this). Save the texts.&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s literally giving you exactly what you want.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgeeeyj", "score_hidden": false, "stickied": false, "created": 1492504619.0, "created_utc": 1492475819.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdunui", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throwaway_babyseal", "parent_id": "t3_65si5b", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you to everyone for your kind and thoughtful advice. I never thought that I would get any responses at all, let alone this many empathetic and helpful responses. And I appreciate everything you've said. \n\nI'm sitting at work struggling to get things done because I'm getting multiple calls and texts from my husband, who is screaming and completely off the rails. I think it's probable he will file divorce papers soon. He may draw it out a bit to torture me, but from how he's acting, I think it's likely he will file. I'm going to call a divorce lawyer today to prepare for what he might do. I am afraid of what he may do in the meantime- he is now threatening my friends who have advised me to leave him as well as threatening me. I don't want to run away and lose everything all over again. I am afraid of so many things. I feel paralyzed and helpless. I know he's not superhuman, but he is maniacal and motivated and fueled by stimulants. It's like something out of a horror movie. He won't kill me- despite his outbursts, I'm convinced he has total control over what he does and he won't do anything to put himself in jeopardy. And I do fight back, as stupid as that may be, so I'm not just a punching bag. To him, I'm the abuser because I fight back. And I feel certain he will paint me in that light if it comes to it. I am going to start taking steps to protect myself. One thing at a time. I can't do it all at once. Thank you again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you to everyone for your kind and thoughtful advice. I never thought that I would get any responses at all, let alone this many empathetic and helpful responses. And I appreciate everything you&amp;#39;ve said. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sitting at work struggling to get things done because I&amp;#39;m getting multiple calls and texts from my husband, who is screaming and completely off the rails. I think it&amp;#39;s probable he will file divorce papers soon. He may draw it out a bit to torture me, but from how he&amp;#39;s acting, I think it&amp;#39;s likely he will file. I&amp;#39;m going to call a divorce lawyer today to prepare for what he might do. I am afraid of what he may do in the meantime- he is now threatening my friends who have advised me to leave him as well as threatening me. I don&amp;#39;t want to run away and lose everything all over again. I am afraid of so many things. I feel paralyzed and helpless. I know he&amp;#39;s not superhuman, but he is maniacal and motivated and fueled by stimulants. It&amp;#39;s like something out of a horror movie. He won&amp;#39;t kill me- despite his outbursts, I&amp;#39;m convinced he has total control over what he does and he won&amp;#39;t do anything to put himself in jeopardy. And I do fight back, as stupid as that may be, so I&amp;#39;m not just a punching bag. To him, I&amp;#39;m the abuser because I fight back. And I feel certain he will paint me in that light if it comes to it. I am going to start taking steps to protect myself. One thing at a time. I can&amp;#39;t do it all at once. Thank you again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdunui", "score_hidden": false, "stickied": false, "created": 1492480948.0, "created_utc": 1492452148.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]