[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": true, "banned_by": null, "media_embed": {}, "subreddit": "legaladvice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;crossposted in &lt;a href=\"/r/divorce\"&gt;r/divorce&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/legaladvice/comments/5rhvbd/got_served_for_cs_one_of_the_kids_is_not_mine/\"&gt;https://www.reddit.com/r/legaladvice/comments/5rhvbd/got_served_for_cs_one_of_the_kids_is_not_mine/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Original Post:&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 42, she&amp;#39;s 35 we were married in 2002 in Michigan. We have two kids that I am the biological father of. In 2010 we kinda sorta separated, she moved to Arizona and I stayed in Michigan. The original intention was that I would move to Arizona eventually. While in Arizona she got a new boyfriend and got pregnant by him. That child was born in 2012. In 2013 she and all three kids moved back to Michigan. We never got back together, I have never lived with her since she moved back. I never lived under the same roof as this new child, I never acted like his father, I want nothing to do with him. Apparently the child&amp;#39;s biological father doesn&amp;#39;t want anything to do with him either. So now I&amp;#39;m trying to fill out paperwork on my own for a DIY divorce and while I&amp;#39;m at the website LawHelpInteractive.org filling out the divorce paperwork. I just got served court papers from my wife and MDHHS for child support on all three kids. I have been paying her child support that I calculated using an online calculator for two kids. $170 a week. I&amp;#39;m venting but I&amp;#39;m also lost and could use any advice. I know I need a lawyer, I actually talked to two recently, they both wanted about $3000 up front to start the divorce. I don&amp;#39;t have any money. I live paycheck to paycheck and have less than $100 right now.&lt;/p&gt;\n\n&lt;p&gt;UPDATE:&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t get a lawyer.  I filed for the divorce on my own.  I also sent a letter to the assistant prosecuting attorney that is representing my ex and the State of Michigan in the case for child support.  I told him that I filed for divorce in another county and I requested that he drop his case and that the matter of child support be handled through the divorce process.  He rejected my request.  Today we went before the judge.  The assistant prosecuting attorney asked the judge to order me to pay child support on all three kids, including the child that is not mine.  I told the judge that I have filed for divorce in another county and that I intend to file a motion to revoke my paternity of the child that I am not the biological father of.  The judge sided with me and ordered that I DO NOT have to pay child support for the child that I am not the biological father to.&lt;/p&gt;\n\n&lt;p&gt;I still have to go through with the divorce process, our first hearing with that case is in three weeks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "crossposted in r/divorce\n\nhttps://www.reddit.com/r/legaladvice/comments/5rhvbd/got_served_for_cs_one_of_the_kids_is_not_mine/\n\nOriginal Post:\n\nI'm 42, she's 35 we were married in 2002 in Michigan. We have two kids that I am the biological father of. In 2010 we kinda sorta separated, she moved to Arizona and I stayed in Michigan. The original intention was that I would move to Arizona eventually. While in Arizona she got a new boyfriend and got pregnant by him. That child was born in 2012. In 2013 she and all three kids moved back to Michigan. We never got back together, I have never lived with her since she moved back. I never lived under the same roof as this new child, I never acted like his father, I want nothing to do with him. Apparently the child's biological father doesn't want anything to do with him either. So now I'm trying to fill out paperwork on my own for a DIY divorce and while I'm at the website LawHelpInteractive.org filling out the divorce paperwork. I just got served court papers from my wife and MDHHS for child support on all three kids. I have been paying her child support that I calculated using an online calculator for two kids. $170 a week. I'm venting but I'm also lost and could use any advice. I know I need a lawyer, I actually talked to two recently, they both wanted about $3000 up front to start the divorce. I don't have any money. I live paycheck to paycheck and have less than $100 right now.\n\nUPDATE:\n\nI didn't get a lawyer.  I filed for the divorce on my own.  I also sent a letter to the assistant prosecuting attorney that is representing my ex and the State of Michigan in the case for child support.  I told him that I filed for divorce in another county and I requested that he drop his case and that the matter of child support be handled through the divorce process.  He rejected my request.  Today we went before the judge.  The assistant prosecuting attorney asked the judge to order me to pay child support on all three kids, including the child that is not mine.  I told the judge that I have filed for divorce in another county and that I intend to file a motion to revoke my paternity of the child that I am not the biological father of.  The judge sided with me and ordered that I DO NOT have to pay child support for the child that I am not the biological father to.\n\nI still have to go through with the divorce process, our first hearing with that case is in three weeks.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65x7qj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 301, "report_reasons": null, "author": "throwaway132813", "saved": false, "mod_reports": [], "name": "t3_65x7qj", "subreddit_name_prefixed": "r/legaladvice", "approved_by": null, "over_18": false, "domain": "self.legaladvice", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rawz", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/legaladvice/comments/65x7qj/update_got_served_for_cs_one_of_the_kids_is_not/", "num_reports": null, "locked": true, "stickied": false, "created": 1492481062.0, "url": "https://www.reddit.com/r/legaladvice/comments/65x7qj/update_got_served_for_cs_one_of_the_kids_is_not/", "author_flair_text": null, "quarantine": false, "title": "update: got served for cs, one of the kids is not mine.", "created_utc": 1492452262.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 301}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rawz", "removal_reason": null, "link_id": "t3_65x7qj", "likes": null, "replies": "", "user_reports": [], "id": "dgdurmn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_65x7qj", "subreddit_name_prefixed": "r/legaladvice", "controversiality": 0, "body": "Thank you for posting an update!  All update posts are automatically locked due to a historical lack of on-topic discussion.  If your post also contains a new question, please [message the moderators](https://www.reddit.com/message/compose/?to=/r/legaladvice&amp;subject=Re-approve%20my%20comment&amp;message=https://www.reddit.com/r/legaladvice/comments/65x7qj/update_got_served_for_cs_one_of_the_kids_is_not/%20\\(please%20leave%20this%20so%20we%20can%20reference%20your%20comment\\)) for a review. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/legaladvice) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for posting an update!  All update posts are automatically locked due to a historical lack of on-topic discussion.  If your post also contains a new question, please &lt;a href=\"https://www.reddit.com/message/compose/?to=/r/legaladvice&amp;amp;subject=Re-approve%20my%20comment&amp;amp;message=https://www.reddit.com/r/legaladvice/comments/65x7qj/update_got_served_for_cs_one_of_the_kids_is_not/%20(please%20leave%20this%20so%20we%20can%20reference%20your%20comment)\"&gt;message the moderators&lt;/a&gt; for a review. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/legaladvice\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "legaladvice", "name": "t1_dgdurmn", "score_hidden": true, "stickied": true, "created": 1492481062.0, "created_utc": 1492452262.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]