[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "SandersForPresident", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64rlml", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 66, "report_reasons": null, "author": "johnmountain", "saved": false, "mod_reports": [], "name": "t3_64rlml", "subreddit_name_prefixed": "r/SandersForPresident", "approved_by": null, "over_18": false, "domain": "commondreams.org", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/HZjBMVizOhhEhwWYQcgFwPjNu7ef1-6XMrlLMRw8PzU.jpg?s=7e64bf561f334ce352f9157b4b27eb2c", "width": 692, "height": 362}, "resolutions": [{"url": "https://i.redditmedia.com/HZjBMVizOhhEhwWYQcgFwPjNu7ef1-6XMrlLMRw8PzU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=bf69f234758f27f5e1a63f86ee4b7ade", "width": 108, "height": 56}, {"url": "https://i.redditmedia.com/HZjBMVizOhhEhwWYQcgFwPjNu7ef1-6XMrlLMRw8PzU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=15f254eea902535892b0c761662bd8d4", "width": 216, "height": 112}, {"url": "https://i.redditmedia.com/HZjBMVizOhhEhwWYQcgFwPjNu7ef1-6XMrlLMRw8PzU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=8eff61e212881f4fd4c080d80e2b3825", "width": 320, "height": 167}, {"url": "https://i.redditmedia.com/HZjBMVizOhhEhwWYQcgFwPjNu7ef1-6XMrlLMRw8PzU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=d527a70709c638afe6985787d4b36197", "width": 640, "height": 334}], "variants": {}, "id": "Lnzih_Pu58IcLI9L1XX7bRZCtGNo2p8ei7l4Yb2sBL0"}], "enabled": false}, "thumbnail": "https://b.thumbs.redditmedia.com/-zXgyGDw6qpyFG9KwPSHNHosdr3D8kJ7BFwdnbGuRcs.jpg", "subreddit_id": "t5_2zbq7", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "link", "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/SandersForPresident/comments/64rlml/thunderous_applause_welcomes_sanders_call_for/", "num_reports": null, "locked": false, "stickied": false, "created": 1491954078.0, "url": "https://www.commondreams.org/news/2017/03/27/thunderous-applause-welcomes-sanders-call-medicare-all/", "author_flair_text": null, "quarantine": false, "title": "\"Thunderous Applause\" Welcomes Sanders' Call for Medicare-for-All", "created_utc": 1491925278.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 66}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2zbq7", "removal_reason": null, "link_id": "t3_64rlml", "likes": null, "replies": "", "user_reports": [], "id": "dg4fofz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Chartis", "parent_id": "t3_64rlml", "subreddit_name_prefixed": "r/SandersForPresident", "controversiality": 0, "body": "Video: https://www.youtube.com/watch?v=MULoJw1bFzI  \n\n&gt;It is an honor to be with Jane, and Patrick, Peter on the podium here. These are, as Senator Leahy just indicated, tough times, unprecedented times for our country. No getting around that. But I woke up this morning, I must say, feeling pretty good. And I felt pretty good not just because we defeated this Trump-Ryan disastrous healthcare proposal. And I want to thank congressman Welch for being on the right side of the issue from day one. It wasn't just that we defeated them, it was how we defeated them. And the reason we defeated them is that in Vermont and all over this country there were rallies, there were town meetings, and people stood up and they fought back and they told Trump and Ryan 'No. We're not going to give 300 billion dollars in tax breaks to the top 2% and then throw 24 million American off of health insurance. Ain't going to happen!'    \n\n&gt;What I felt good about is that I think that all over this country, in blue states and in red states, people are catching on that we're not going to accept a government dominated by the 1%. We want a government that represents all of us. And it terms of healthcare let me say here at Hazen Union what I've said all over Vermont for decades and what I've said all over this country. And that is we have got to end the international disgrace of being the only major country on Earth not to guarantee healthcare to all people as a right, not a privilege.   \n\n&gt;It makes no sense to me that today that we still have 28 million Americans with no health insurance. Millions of other Americans, including people in this room, are under-insured with high deductibles and high co-payments. We pay the highest prices in the world by far for prescription drugs because of the greed of the pharmaceutical industry. We pay the highest prices in the world by far for prescription drugs because of the greed of the pharmaceutical industry.   \n\n&gt;**In a couple of weeks I’m going to be introducing legislation calling for a Medicare-for-All single payer program.**  \n\n&gt;This might be known to some of us but let me just repeat it, we won a victory yesterday but we have to keep fighting. Number Two: We’re looking at a grotesque budget coming down the pipe which says that despite the fact that we spend more on defense than the next twelve nations combined, Trump wants to increase military spending by 80 billion dollars over the next two years and he wants to pay for that with massive cuts to the programs that the working people, the elderly, the children, the sick and the poor depend upon. Can you imagine building new bloated weapons systems, and then cutting back on the LIHEAP program? Cutting back on Meals on Wheels? I mean what kind of mentality is this? It is a sick mentality! That says we give tax breaks to billionaires and we don’t have the money to provide a hot lunch to an elderly person in hard way for a month.   \n\n&gt;We’ve got to deal with a budget that is wrong, we’ve got to deal with so called 'tax reform' coming down the pipe. You know what Ryan and Trump mean by 'tax reform'? What they mean, I am sure you do know, you’re a smart audience. In a time of massive income and wealth inequality where the top of one tenth of one percent now owns almost as much wealth as the bottom 90%. Where the top 1% earns as much new income, new income, as the bottom 52%. What we’re looking at is massive tax breaks for millionaires and billionaires. Trump and his friends want to repeal the estate tax which applies only to the top 2/10s of 1%. Since 2000 we have seen a tenfold increase in the number of billionaires in this country. We have billionaires like Donald Trump who probably pay nothing in federal taxes. You got large profitable corporations making billions a year in profit not paying a nickel in federal taxes. Billionaires and large corporations do not need more tax breaks, they need to start paying their fair share of federal taxes.  \n\n&gt;We have a president and a new EPA administrator that debate, {boo} (you've heard about Mr. Pruitt) the debate, the discussion, regarding climate change is over. The only place where it still exists is on Fox television. But other than that, within the scientific community, the conclusions are overwhelming. Climate Change is real. It is caused by yuman activity. It is causing devastating problems today. In our country and around the world those problems will only get worse if we do not have the guts to take on the fossil fuel industry, transform our energy system away from fossil fuel to efficiency and sustainable energy.  \n\n&gt;It is frightening, it is frightening the degree to which we have an administration that rejects science. You cannot run a society if you reject science, which is what they are doing. What we have to do in Vermont, where we have done a pretty good job but we can do better, but We have to work state by state to move to wind and solar and geothermal and energy efficiency. What is at stake is the future of our planet and the quality of life that our kids and grandkids will have. This is a moral issue.  \n\n&gt;Not only do we have to take on Trump’s right wing extremist agenda, we have got to hold all our heads high and fight for a progressive agenda which is what the American people want. Very few people know that if you work 40 hours a week, you should not be living in poverty. We’ve got to raise the minimum wage to 15 bucks an hour. It is a disgrace that women are still making 79 cents to the dollar compared to men. Equal pay for equal work. In Vermont and around the country, our infrastructure: roads, bridges, water systems, waste water plants, levies, dams, airports, are collapsing. We can put over 13 million people back to work rebuilding our crumbling infrastructure.  \n\n&gt;In our highly competitive global economy, we are going to make public colleges and universities tuition free and Wall Street is going to pay for that. Trump's agenda of tax breaks for billionaires and cuts in Medicare and Medicade that’s an extremist agenda. The people by and large, most Americans, working people understand, we have got to come together, create a government and public policy that works for us all. So my request of you, my ask of you, is in these difficult times stand up, fight back, get involved in the political process in a way that you have never done before. Thank you all very much.\n  \n-Bernie Sanders, March 25th. Emphasis added.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Video: &lt;a href=\"https://www.youtube.com/watch?v=MULoJw1bFzI\"&gt;https://www.youtube.com/watch?v=MULoJw1bFzI&lt;/a&gt;  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It is an honor to be with Jane, and Patrick, Peter on the podium here. These are, as Senator Leahy just indicated, tough times, unprecedented times for our country. No getting around that. But I woke up this morning, I must say, feeling pretty good. And I felt pretty good not just because we defeated this Trump-Ryan disastrous healthcare proposal. And I want to thank congressman Welch for being on the right side of the issue from day one. It wasn&amp;#39;t just that we defeated them, it was how we defeated them. And the reason we defeated them is that in Vermont and all over this country there were rallies, there were town meetings, and people stood up and they fought back and they told Trump and Ryan &amp;#39;No. We&amp;#39;re not going to give 300 billion dollars in tax breaks to the top 2% and then throw 24 million American off of health insurance. Ain&amp;#39;t going to happen!&amp;#39;    &lt;/p&gt;\n\n&lt;p&gt;What I felt good about is that I think that all over this country, in blue states and in red states, people are catching on that we&amp;#39;re not going to accept a government dominated by the 1%. We want a government that represents all of us. And it terms of healthcare let me say here at Hazen Union what I&amp;#39;ve said all over Vermont for decades and what I&amp;#39;ve said all over this country. And that is we have got to end the international disgrace of being the only major country on Earth not to guarantee healthcare to all people as a right, not a privilege.   &lt;/p&gt;\n\n&lt;p&gt;It makes no sense to me that today that we still have 28 million Americans with no health insurance. Millions of other Americans, including people in this room, are under-insured with high deductibles and high co-payments. We pay the highest prices in the world by far for prescription drugs because of the greed of the pharmaceutical industry. We pay the highest prices in the world by far for prescription drugs because of the greed of the pharmaceutical industry.   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;In a couple of weeks I’m going to be introducing legislation calling for a Medicare-for-All single payer program.&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;This might be known to some of us but let me just repeat it, we won a victory yesterday but we have to keep fighting. Number Two: We’re looking at a grotesque budget coming down the pipe which says that despite the fact that we spend more on defense than the next twelve nations combined, Trump wants to increase military spending by 80 billion dollars over the next two years and he wants to pay for that with massive cuts to the programs that the working people, the elderly, the children, the sick and the poor depend upon. Can you imagine building new bloated weapons systems, and then cutting back on the LIHEAP program? Cutting back on Meals on Wheels? I mean what kind of mentality is this? It is a sick mentality! That says we give tax breaks to billionaires and we don’t have the money to provide a hot lunch to an elderly person in hard way for a month.   &lt;/p&gt;\n\n&lt;p&gt;We’ve got to deal with a budget that is wrong, we’ve got to deal with so called &amp;#39;tax reform&amp;#39; coming down the pipe. You know what Ryan and Trump mean by &amp;#39;tax reform&amp;#39;? What they mean, I am sure you do know, you’re a smart audience. In a time of massive income and wealth inequality where the top of one tenth of one percent now owns almost as much wealth as the bottom 90%. Where the top 1% earns as much new income, new income, as the bottom 52%. What we’re looking at is massive tax breaks for millionaires and billionaires. Trump and his friends want to repeal the estate tax which applies only to the top 2/10s of 1%. Since 2000 we have seen a tenfold increase in the number of billionaires in this country. We have billionaires like Donald Trump who probably pay nothing in federal taxes. You got large profitable corporations making billions a year in profit not paying a nickel in federal taxes. Billionaires and large corporations do not need more tax breaks, they need to start paying their fair share of federal taxes.  &lt;/p&gt;\n\n&lt;p&gt;We have a president and a new EPA administrator that debate, {boo} (you&amp;#39;ve heard about Mr. Pruitt) the debate, the discussion, regarding climate change is over. The only place where it still exists is on Fox television. But other than that, within the scientific community, the conclusions are overwhelming. Climate Change is real. It is caused by yuman activity. It is causing devastating problems today. In our country and around the world those problems will only get worse if we do not have the guts to take on the fossil fuel industry, transform our energy system away from fossil fuel to efficiency and sustainable energy.  &lt;/p&gt;\n\n&lt;p&gt;It is frightening, it is frightening the degree to which we have an administration that rejects science. You cannot run a society if you reject science, which is what they are doing. What we have to do in Vermont, where we have done a pretty good job but we can do better, but We have to work state by state to move to wind and solar and geothermal and energy efficiency. What is at stake is the future of our planet and the quality of life that our kids and grandkids will have. This is a moral issue.  &lt;/p&gt;\n\n&lt;p&gt;Not only do we have to take on Trump’s right wing extremist agenda, we have got to hold all our heads high and fight for a progressive agenda which is what the American people want. Very few people know that if you work 40 hours a week, you should not be living in poverty. We’ve got to raise the minimum wage to 15 bucks an hour. It is a disgrace that women are still making 79 cents to the dollar compared to men. Equal pay for equal work. In Vermont and around the country, our infrastructure: roads, bridges, water systems, waste water plants, levies, dams, airports, are collapsing. We can put over 13 million people back to work rebuilding our crumbling infrastructure.  &lt;/p&gt;\n\n&lt;p&gt;In our highly competitive global economy, we are going to make public colleges and universities tuition free and Wall Street is going to pay for that. Trump&amp;#39;s agenda of tax breaks for billionaires and cuts in Medicare and Medicade that’s an extremist agenda. The people by and large, most Americans, working people understand, we have got to come together, create a government and public policy that works for us all. So my request of you, my ask of you, is in these difficult times stand up, fight back, get involved in the political process in a way that you have never done before. Thank you all very much.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;-Bernie Sanders, March 25th. Emphasis added.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SandersForPresident", "name": "t1_dg4fofz", "score_hidden": false, "stickied": false, "created": 1491954285.0, "created_utc": 1491925485.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]