[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Christianity", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone. &lt;/p&gt;\n\n&lt;p&gt;I am having trouble in my marriage. There&amp;#39;s a lot to unwrap, so I just want to focus on the issue that arose this morning because I feel it is very symbolic.&lt;/p&gt;\n\n&lt;p&gt;We have a very unequal partnership, and not by choice. I think a little background is important: I am from a very low-income background and my husband was raised upper middle class. I had never had a relationship before him, but I had the sense that still being a student while he was a working man might cause some issues in our relationship. I wanted to hold off on pursuing it until we were on more even-footing. But then a hurricane hit the area I was living in and I lost my home and the things that unfolded (being turned on by family) kind of brought us closer together. He offered to lend me some money to help see me through a situation and I wanted nothing more than to reject it. My mother had a friend when I was growing up who was &amp;quot;taken care of&amp;quot; by men in exchange for sexual favors (a form of prostitution, essentially -- though she maintained &amp;#39;relationships&amp;#39; with them, sometimes all at once) and I felt like accepting money from him, even though we were not sexually active at that point, could only lead down a bad road. But he convinced me that it was an act of care by a friend and I desperately needed it. I was so grateful. I remember telling my mother about it and that I hoped to marry him because he came through for me like no one else ever had. &lt;/p&gt;\n\n&lt;p&gt;As our relationship progressed, it took a long time for him to tell me he loved me (it turned out, far longer than any other girl). I had to kind of bring it up first, because I started to feel like I was being played and certainly loved him at that point and had for a very long time (6 months in at this point). He told me he loved me. I was struggling trying to get through life, continually facing adversity that people who grow up disadvantaged often do, but he was like this stable rock in a sea of constant commotion. Still, I didn&amp;#39;t want to get more serious until I was on my feet. And then I got sick. Really sick. I got down to 80 lbs and was recommended to withdraw from school because the doctor was worried I was going to have a heart attack just exerting myself physically at the campus, let alone the stress. I was literally a pound away from being hospitalized before I started to make improvements. My then boyfriend sent me more money, which I did not want to take, but it helped me see a nutritionist who helped me begin to regain my health. But I could barely afford to eat. Our relationship was progressing and we&amp;#39;d discussed living together but somewhere else. He then seemed to back off and I stated my intentions; that I saw this being a long-term thing. That day we talked for 11 hours straight and decided we would get married. He said on more than one occasion that it was my desperate situation more than genuine love that inspired him to consider marriage that &amp;quot;soon.&amp;quot; I thought it was genuine love, though. It was for me. I felt very betrayed when I learned that wasn&amp;#39;t the case. &lt;/p&gt;\n\n&lt;p&gt;We got engaged, I moved to live with him, but I was still sick. I could not work or go back to school immediately. I couldn&amp;#39;t do a lot, but he convinced me that it was right for him to care for me. We got legally married a few months later and didn&amp;#39;t tell most people, so I could get insurance, and then got publicly married a few months after that. I started to get better, but I decided to wait to return to school to save money, so I could qualify for in-state tuition. I finally got back in the swing of things, working full-time and school full-time when I got pregnant. I had a very troubled pregnancy and had to withdraw once again. I started back as soon as possible online and am now heading back to work, but I am so far behind that I am looking at low paying jobs and internships to get my foot in the door. I want to contribute monetarily so badly, but it will be awhile. &lt;/p&gt;\n\n&lt;p&gt;I take care of our son full-time, though. That is my contribution right now; however, it is not valued (even though childcare is insanely expensive and less safe). Admittedly, I am not a great &amp;quot;Suzie Homemaker,&amp;quot; and never desired to be one, but I do my best to juggle all the responsibilities of my son and a full-time school load. I think I am a great mother, but he doesn&amp;#39;t agree. I have no family in the area, and the only person I can get to help sometimes is his mother. I feel like I get a lot of negative feedback from her as well, because I don&amp;#39;t stack up to her homemaking (though she never juggled school and a baby, and a house) and our living situation, I think, is not helping matters. We rent a home from her at an offensive rate, frankly. It was supposed to be short-term, a few months, from when I first moved here, because my husband was living above his garage, and the main house which had an issue had not been fixed and then could not be in time for the schedule we decided to meld our lives together on. It&amp;#39;s been 4 years. &lt;/p&gt;\n\n&lt;p&gt;My husband, as said, owns a home. My MIL is aware of this asset obviously, and can only muster so much compassion for the situation. I told my husband that I felt we needed to make a decision to sell or renovate by the time our son was 4 months, that the situation wasn&amp;#39;t fair to anyone, and he agreed, but then he reneged, citing work and grad school pressures. There&amp;#39;s more to that story, but fair enough. Dealing with that will consume time we don&amp;#39;t currently have. However, we have been married almost 4 years and have a son. It took my husband a year to put me on his bank account. I used to have to borrow cash from my MIL and his aunt, and I learned today that it was only his mother&amp;#39;s council (my first major issue -- a wife should be one&amp;#39;s council, not their mother, right?) that he put me on the account, as she was &amp;quot;horrified.&amp;quot; He apologized for this last year, and said it wasn&amp;#39;t right he did this. He didn&amp;#39;t say it was because he didn&amp;#39;t trust me, but it was implied. It was a difficult way to live, but I had more trust in him then. I thought if I could just show him I truly loved him... He would finally see my heart and my intentions (keep in mind that I never knew what he made or the extent of his assets until we were married). But trying to make him understand me, rather than setting firm boundaries, was a mistake. Many of our troubles I&amp;#39;ve come to see stem from this. &lt;/p&gt;\n\n&lt;p&gt;Things have been rough lately but we had a lovely Easter and agreed to work on being better to each other. He didn&amp;#39;t get to bed early and woke up late and I had a feeling he&amp;#39;d be asking for the car. It&amp;#39;s the only asset I brought into the marriage -- a gift from a deceased great uncle who removed my drug-addicted, mentally ill father from his will and put me on instead. It&amp;#39;s not a fancy car. Its not worth more than 2,000. Probably less. But it runs and it&amp;#39;s all I have, monetarily speaking. When my husband did finally ask, I laid there after thinking how disordered this has all become. We are currently a one car family, but he prefers the train. The car is helpful to me with the baby, but when he needs it and I truly don&amp;#39;t, I have no issue with him using it. And asking on those grounds is one thing, but he asks largely because it&amp;#39;s &amp;quot;my&amp;quot; car. I offered on several occasions to make it our car, legally, but he was firm that it should be mine. It was from my inheritance. Eventually, I cottoned on that he wanted me to keep my asset because he wanted to keep his. Thinking about this, I was sad when I walked into the kitchen to see him off this morning. He noticed and asked what was wrong. I didn&amp;#39;t want to tell him and  suggested we talk about it another time, as he had to go, but he insisted. So, I told him. The conversation started of reasonable but then he started talking about divorce. I was like, what, really?? He essentially admitted he won&amp;#39;t make the home he owns ours because he is a afraid of divorce. He doesn&amp;#39;t want to fully invest in our marriage, because he&amp;#39;s a afraid of divorce. We have been married almost 4 years and I gave him a child... What more can one do? He&amp;#39;s painted me as some &amp;quot;gold-digger&amp;quot; when, a) HE offered to help me all those years ago and I initially refused but then he convinced me b) I never knew what he made or what he had c) and upon learning, it wasn&amp;#39;t a lot and if that was truly my goal, I would have figured that out sooner and surely could have found some rich old guy, but I only wanted to be with someone out of mutual love (hence why I was a virgin until i was 25 [and have only been with him]). I was genuinely shocked to learn this wasn&amp;#39;t some oversight. He wants to keep his easy out. Meanwhile, it might not be worth much monetarily, but I have given everything to this marriage. I risked my life carrying and birthing our child. I have gone beyond to prove my love and loyalty.&lt;/p&gt;\n\n&lt;p&gt;It should be noted that we both have threatened divorce before. He frequently did the entire first year, and around the time I got pregnant I started to say it back. I thought if he saw how insecure it made me and our marriage feel, he would stop. I was wrong. In more ways than one. &lt;/p&gt;\n\n&lt;p&gt;I wanted to stand my ground this time. This lack of symbolic investment is not only immensely hurtful and so different from how I view marriage (we are supposed to be one in every way; whats mine is yours, etc), it&amp;#39;s hurting my life in measurable ways. I think we are stuck in this living situation that is hurting our relationship with the only other family I have in the area because the hemming and hawing about selling or renovating the house is really because doing either would make the property legally ours. &lt;/p&gt;\n\n&lt;p&gt;I told him as he ended the conversation halfway out the door that I would gladly put him on my title if he puts me on his. He didn&amp;#39;t agree and still proceeded towards the car. I said, &amp;quot;I didn&amp;#39;t agree to that&amp;quot; and he turned around, threw the keys at me and told me to fuck off and walked towards the train. I tried to call him to get him to come back and not make a foolish choice to be hours late to work and he said in the most vile tone that I was useless and he hates me and I am not his wife.&lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t the first time he&amp;#39;s said such things, but I don&amp;#39;t know where to go from here. As I said, it might not have monetary value, but I have invested everything I had into him, into this. &lt;/p&gt;\n\n&lt;p&gt;Both of us are Christians, and neither of us truly believe in divorce in most cases, but where do I go from here? I have a hard time believing that God wants me to be someone&amp;#39;s unvalued, untrusted, unloved wife. I don&amp;#39;t want to &amp;quot;prove&amp;quot; myself anymore. I never did anything wrong. I never used anyone, in any way, in my life. I made tough choices to not engage in that behavior and had a weak social life and a non-existing love life, despite a lot of male interest, as a result.&lt;/p&gt;\n\n&lt;p&gt;I am seeking Christian council. What should I do? What is right? &lt;/p&gt;\n\n&lt;p&gt;I feel like I cannot escape this stereotype that because I am a female who was poor before this marriage that I am just a gold digger waiting to strike. I have never had my origins of poverty used so ruthlessly against me, and I was mercilessly bullied for it growing up. But this is my partner, my husband...I thought, my best friend. Who has no faith in me because my mom ended up a divorced single mother due to my mentally ill father and had trouble making ends meet, which made modern life as we know it so hard for me to compete at?? &lt;/p&gt;\n\n&lt;p&gt;I feel so worthless to him, but there&amp;#39;s this feeling also deep inside that says I am not worthless. I know my truth, even if he refuses to see it. To me, that&amp;#39;s my imprint from my creator. And I hear it, loud and clear. But what does he want me to do? &lt;/p&gt;\n\n&lt;p&gt;I love my husband. He makes more sad, and more angry than anyone I&amp;#39;ve ever known at times, but I genuinely love him. I came here instead of &lt;a href=\"/r/relationships\"&gt;r/relationships&lt;/a&gt; because a bunch of posts from atheists telling me to divorce him doesn&amp;#39;t help. And he refuses to go to even Christian-based counseling, or I would pursue that avenue. &lt;/p&gt;\n\n&lt;p&gt;But I am desperate for Christian insight.&lt;/p&gt;\n\n&lt;p&gt;Thanks so much in advance, and apologies for the length. It did require some framing, I think.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi everyone. \n\nI am having trouble in my marriage. There's a lot to unwrap, so I just want to focus on the issue that arose this morning because I feel it is very symbolic.\n\nWe have a very unequal partnership, and not by choice. I think a little background is important: I am from a very low-income background and my husband was raised upper middle class. I had never had a relationship before him, but I had the sense that still being a student while he was a working man might cause some issues in our relationship. I wanted to hold off on pursuing it until we were on more even-footing. But then a hurricane hit the area I was living in and I lost my home and the things that unfolded (being turned on by family) kind of brought us closer together. He offered to lend me some money to help see me through a situation and I wanted nothing more than to reject it. My mother had a friend when I was growing up who was \"taken care of\" by men in exchange for sexual favors (a form of prostitution, essentially -- though she maintained 'relationships' with them, sometimes all at once) and I felt like accepting money from him, even though we were not sexually active at that point, could only lead down a bad road. But he convinced me that it was an act of care by a friend and I desperately needed it. I was so grateful. I remember telling my mother about it and that I hoped to marry him because he came through for me like no one else ever had. \n\nAs our relationship progressed, it took a long time for him to tell me he loved me (it turned out, far longer than any other girl). I had to kind of bring it up first, because I started to feel like I was being played and certainly loved him at that point and had for a very long time (6 months in at this point). He told me he loved me. I was struggling trying to get through life, continually facing adversity that people who grow up disadvantaged often do, but he was like this stable rock in a sea of constant commotion. Still, I didn't want to get more serious until I was on my feet. And then I got sick. Really sick. I got down to 80 lbs and was recommended to withdraw from school because the doctor was worried I was going to have a heart attack just exerting myself physically at the campus, let alone the stress. I was literally a pound away from being hospitalized before I started to make improvements. My then boyfriend sent me more money, which I did not want to take, but it helped me see a nutritionist who helped me begin to regain my health. But I could barely afford to eat. Our relationship was progressing and we'd discussed living together but somewhere else. He then seemed to back off and I stated my intentions; that I saw this being a long-term thing. That day we talked for 11 hours straight and decided we would get married. He said on more than one occasion that it was my desperate situation more than genuine love that inspired him to consider marriage that \"soon.\" I thought it was genuine love, though. It was for me. I felt very betrayed when I learned that wasn't the case. \n\nWe got engaged, I moved to live with him, but I was still sick. I could not work or go back to school immediately. I couldn't do a lot, but he convinced me that it was right for him to care for me. We got legally married a few months later and didn't tell most people, so I could get insurance, and then got publicly married a few months after that. I started to get better, but I decided to wait to return to school to save money, so I could qualify for in-state tuition. I finally got back in the swing of things, working full-time and school full-time when I got pregnant. I had a very troubled pregnancy and had to withdraw once again. I started back as soon as possible online and am now heading back to work, but I am so far behind that I am looking at low paying jobs and internships to get my foot in the door. I want to contribute monetarily so badly, but it will be awhile. \n\nI take care of our son full-time, though. That is my contribution right now; however, it is not valued (even though childcare is insanely expensive and less safe). Admittedly, I am not a great \"Suzie Homemaker,\" and never desired to be one, but I do my best to juggle all the responsibilities of my son and a full-time school load. I think I am a great mother, but he doesn't agree. I have no family in the area, and the only person I can get to help sometimes is his mother. I feel like I get a lot of negative feedback from her as well, because I don't stack up to her homemaking (though she never juggled school and a baby, and a house) and our living situation, I think, is not helping matters. We rent a home from her at an offensive rate, frankly. It was supposed to be short-term, a few months, from when I first moved here, because my husband was living above his garage, and the main house which had an issue had not been fixed and then could not be in time for the schedule we decided to meld our lives together on. It's been 4 years. \n\nMy husband, as said, owns a home. My MIL is aware of this asset obviously, and can only muster so much compassion for the situation. I told my husband that I felt we needed to make a decision to sell or renovate by the time our son was 4 months, that the situation wasn't fair to anyone, and he agreed, but then he reneged, citing work and grad school pressures. There's more to that story, but fair enough. Dealing with that will consume time we don't currently have. However, we have been married almost 4 years and have a son. It took my husband a year to put me on his bank account. I used to have to borrow cash from my MIL and his aunt, and I learned today that it was only his mother's council (my first major issue -- a wife should be one's council, not their mother, right?) that he put me on the account, as she was \"horrified.\" He apologized for this last year, and said it wasn't right he did this. He didn't say it was because he didn't trust me, but it was implied. It was a difficult way to live, but I had more trust in him then. I thought if I could just show him I truly loved him... He would finally see my heart and my intentions (keep in mind that I never knew what he made or the extent of his assets until we were married). But trying to make him understand me, rather than setting firm boundaries, was a mistake. Many of our troubles I've come to see stem from this. \n\nThings have been rough lately but we had a lovely Easter and agreed to work on being better to each other. He didn't get to bed early and woke up late and I had a feeling he'd be asking for the car. It's the only asset I brought into the marriage -- a gift from a deceased great uncle who removed my drug-addicted, mentally ill father from his will and put me on instead. It's not a fancy car. Its not worth more than 2,000. Probably less. But it runs and it's all I have, monetarily speaking. When my husband did finally ask, I laid there after thinking how disordered this has all become. We are currently a one car family, but he prefers the train. The car is helpful to me with the baby, but when he needs it and I truly don't, I have no issue with him using it. And asking on those grounds is one thing, but he asks largely because it's \"my\" car. I offered on several occasions to make it our car, legally, but he was firm that it should be mine. It was from my inheritance. Eventually, I cottoned on that he wanted me to keep my asset because he wanted to keep his. Thinking about this, I was sad when I walked into the kitchen to see him off this morning. He noticed and asked what was wrong. I didn't want to tell him and  suggested we talk about it another time, as he had to go, but he insisted. So, I told him. The conversation started of reasonable but then he started talking about divorce. I was like, what, really?? He essentially admitted he won't make the home he owns ours because he is a afraid of divorce. He doesn't want to fully invest in our marriage, because he's a afraid of divorce. We have been married almost 4 years and I gave him a child... What more can one do? He's painted me as some \"gold-digger\" when, a) HE offered to help me all those years ago and I initially refused but then he convinced me b) I never knew what he made or what he had c) and upon learning, it wasn't a lot and if that was truly my goal, I would have figured that out sooner and surely could have found some rich old guy, but I only wanted to be with someone out of mutual love (hence why I was a virgin until i was 25 [and have only been with him]). I was genuinely shocked to learn this wasn't some oversight. He wants to keep his easy out. Meanwhile, it might not be worth much monetarily, but I have given everything to this marriage. I risked my life carrying and birthing our child. I have gone beyond to prove my love and loyalty.\n\nIt should be noted that we both have threatened divorce before. He frequently did the entire first year, and around the time I got pregnant I started to say it back. I thought if he saw how insecure it made me and our marriage feel, he would stop. I was wrong. In more ways than one. \n\nI wanted to stand my ground this time. This lack of symbolic investment is not only immensely hurtful and so different from how I view marriage (we are supposed to be one in every way; whats mine is yours, etc), it's hurting my life in measurable ways. I think we are stuck in this living situation that is hurting our relationship with the only other family I have in the area because the hemming and hawing about selling or renovating the house is really because doing either would make the property legally ours. \n\nI told him as he ended the conversation halfway out the door that I would gladly put him on my title if he puts me on his. He didn't agree and still proceeded towards the car. I said, \"I didn't agree to that\" and he turned around, threw the keys at me and told me to fuck off and walked towards the train. I tried to call him to get him to come back and not make a foolish choice to be hours late to work and he said in the most vile tone that I was useless and he hates me and I am not his wife.\n\nThis isn't the first time he's said such things, but I don't know where to go from here. As I said, it might not have monetary value, but I have invested everything I had into him, into this. \n\nBoth of us are Christians, and neither of us truly believe in divorce in most cases, but where do I go from here? I have a hard time believing that God wants me to be someone's unvalued, untrusted, unloved wife. I don't want to \"prove\" myself anymore. I never did anything wrong. I never used anyone, in any way, in my life. I made tough choices to not engage in that behavior and had a weak social life and a non-existing love life, despite a lot of male interest, as a result.\n\nI am seeking Christian council. What should I do? What is right? \n\nI feel like I cannot escape this stereotype that because I am a female who was poor before this marriage that I am just a gold digger waiting to strike. I have never had my origins of poverty used so ruthlessly against me, and I was mercilessly bullied for it growing up. But this is my partner, my husband...I thought, my best friend. Who has no faith in me because my mom ended up a divorced single mother due to my mentally ill father and had trouble making ends meet, which made modern life as we know it so hard for me to compete at?? \n\nI feel so worthless to him, but there's this feeling also deep inside that says I am not worthless. I know my truth, even if he refuses to see it. To me, that's my imprint from my creator. And I hear it, loud and clear. But what does he want me to do? \n\nI love my husband. He makes more sad, and more angry than anyone I've ever known at times, but I genuinely love him. I came here instead of r/relationships because a bunch of posts from atheists telling me to divorce him doesn't help. And he refuses to go to even Christian-based counseling, or I would pursue that avenue. \n\nBut I am desperate for Christian insight.\n\nThanks so much in advance, and apologies for the length. It did require some framing, I think.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Support", "id": "65wx5y", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "Inaswife", "saved": false, "mod_reports": [], "name": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "approved_by": null, "over_18": false, "domain": "self.Christianity", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh6c", "edited": 1492450649.0, "link_flair_css_class": "support", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Christianity/comments/65wx5y/marriage_trouble/", "num_reports": null, "locked": false, "stickied": false, "created": 1492478317.0, "url": "https://www.reddit.com/r/Christianity/comments/65wx5y/marriage_trouble/", "author_flair_text": null, "quarantine": false, "title": "Marriage Trouble", "created_utc": 1492449517.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": "", "user_reports": [], "id": "dgdv4yr", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "BitChick", "parent_id": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": " &gt;where do I go from here? I have a hard time believing that God wants me to be someone's unvalued, untrusted, unloved wife. I don't want to \"prove\" myself anymore.\n\nIn all of this, the sentence that jumped out at me the most was this one.  First of all, you are certainly valued and so very loved by Jesus!  Please go to the one that can give us our true value and worth, so much that he gave His life as a ransom for ours!  You are so precious to Him!  I am so sad that your husband has been blinded by fear and worry about money.  The Bible speaks of how the love of money is the root of all kinds of evil.  He is the one that is trapped in this actually.  You are in many ways a victim of his fears and anxiety and worry.   \n\nWe have an incredible way of making our worst fears reality if we dwell on them too much. He seems to be certainly be going down this path with all the talk of how he is worried about divorce.  And the way he focuses so much on money, keeping you separate from the money, is a fear and control issue as well.  It isn't healthy and causes great issues in relationships.  \n\nMy advice is just pray, read the Word, let Jesus love you and and seek the help of the Holy Spirit in the relationship.  You cannot change your spouse, but God can do a mighty work! I think having a marriage and family counselor would be great as well.  A third party, that can shed light on your husband's control issues and money issues would be very valuable at this point and would provide you some support as it is needed for you as well.  I pray you can find a good Christian one.  God bless!!!", "edited": 1492454743.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;where do I go from here? I have a hard time believing that God wants me to be someone&amp;#39;s unvalued, untrusted, unloved wife. I don&amp;#39;t want to &amp;quot;prove&amp;quot; myself anymore.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In all of this, the sentence that jumped out at me the most was this one.  First of all, you are certainly valued and so very loved by Jesus!  Please go to the one that can give us our true value and worth, so much that he gave His life as a ransom for ours!  You are so precious to Him!  I am so sad that your husband has been blinded by fear and worry about money.  The Bible speaks of how the love of money is the root of all kinds of evil.  He is the one that is trapped in this actually.  You are in many ways a victim of his fears and anxiety and worry.   &lt;/p&gt;\n\n&lt;p&gt;We have an incredible way of making our worst fears reality if we dwell on them too much. He seems to be certainly be going down this path with all the talk of how he is worried about divorce.  And the way he focuses so much on money, keeping you separate from the money, is a fear and control issue as well.  It isn&amp;#39;t healthy and causes great issues in relationships.  &lt;/p&gt;\n\n&lt;p&gt;My advice is just pray, read the Word, let Jesus love you and and seek the help of the Holy Spirit in the relationship.  You cannot change your spouse, but God can do a mighty work! I think having a marriage and family counselor would be great as well.  A third party, that can shed light on your husband&amp;#39;s control issues and money issues would be very valuable at this point and would provide you some support as it is needed for you as well.  I pray you can find a good Christian one.  God bless!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgdv4yr", "score_hidden": false, "stickied": false, "created": 1492481479.0, "created_utc": 1492452679.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": "", "user_reports": [], "id": "dgdv6cv", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "tom5tom86", "parent_id": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "[Mark Gungor's](http://www.markgungorshow.com/) Stuff and his [Laugh your way to a better Marriage](https://www.youtube.com/watch?v=ntk1Tl7dscI) stuff greatly helped my wife and I when we were going through a lot of marriage difficulties. One of his lines that really stuck with me is that marriages end in divorce because one or both people became selfish.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.markgungorshow.com/\"&gt;Mark Gungor&amp;#39;s&lt;/a&gt; Stuff and his &lt;a href=\"https://www.youtube.com/watch?v=ntk1Tl7dscI\"&gt;Laugh your way to a better Marriage&lt;/a&gt; stuff greatly helped my wife and I when we were going through a lot of marriage difficulties. One of his lines that really stuck with me is that marriages end in divorce because one or both people became selfish.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgdv6cv", "score_hidden": false, "stickied": false, "created": 1492481522.0, "created_utc": 1492452722.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": "", "user_reports": [], "id": "dge3rd5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "T0MB0MBADILL", "parent_id": "t1_dgdxcha", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "I agree ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dge3rd5", "score_hidden": false, "stickied": false, "created": 1492491187.0, "created_utc": 1492462387.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdxcha", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "arcbuffalo", "parent_id": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "A lot goes into this. Because, you do have a child, and that child does need to be cared for. You don't have a job, and your husband does, which creates a wrinkle. I would say, as a Christian, the way your husband treats you is despicable. He is a coward, a pig, and isn't worthy of an ounce of love you have for him. But...\n\nMarriage is important, it is a bond that shouldn't be broken, and only broken when the means fit the end. My advice? Look for a job, look hard, when you find one, separate. I am not saying divorce him, but take some time apart for counseling and self searching. Being a Christian is much like being a husband, its more than a title; which, in this case, I doubt either one being true. A God fearing man wouldn't treat his wife like this, because, a God fearing man would recognize a gift as it was. Pray for him, because it sounds like he is lost, both with his relationships and his faith. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot goes into this. Because, you do have a child, and that child does need to be cared for. You don&amp;#39;t have a job, and your husband does, which creates a wrinkle. I would say, as a Christian, the way your husband treats you is despicable. He is a coward, a pig, and isn&amp;#39;t worthy of an ounce of love you have for him. But...&lt;/p&gt;\n\n&lt;p&gt;Marriage is important, it is a bond that shouldn&amp;#39;t be broken, and only broken when the means fit the end. My advice? Look for a job, look hard, when you find one, separate. I am not saying divorce him, but take some time apart for counseling and self searching. Being a Christian is much like being a husband, its more than a title; which, in this case, I doubt either one being true. A God fearing man wouldn&amp;#39;t treat his wife like this, because, a God fearing man would recognize a gift as it was. Pray for him, because it sounds like he is lost, both with his relationships and his faith. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgdxcha", "score_hidden": false, "stickied": false, "created": 1492483970.0, "created_utc": 1492455170.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": "", "user_reports": [], "id": "dgejeaw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "executive313", "parent_id": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Look a ton of people in this sub are going to say horrible things about divorce but those people haven't lived through physical or psychological beatings before. Make no mistakes you are being abused here psychologically through finances. No God who loves you and cares for you wants you to be abused. Look for a woman's shelter near you and explain your situation to people who can actually help you and get out. Psychological abuse is every bit as bad as physical abuse you need to be gone. No true God would hold a divorce against you when you are being abused and if he does then that's not a God I want any part of. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look a ton of people in this sub are going to say horrible things about divorce but those people haven&amp;#39;t lived through physical or psychological beatings before. Make no mistakes you are being abused here psychologically through finances. No God who loves you and cares for you wants you to be abused. Look for a woman&amp;#39;s shelter near you and explain your situation to people who can actually help you and get out. Psychological abuse is every bit as bad as physical abuse you need to be gone. No true God would hold a divorce against you when you are being abused and if he does then that&amp;#39;s not a God I want any part of. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgejeaw", "score_hidden": false, "stickied": false, "created": 1492510684.0, "created_utc": 1492481884.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": "", "user_reports": [], "id": "dge44re", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "katarya18", "parent_id": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "I want to point out that your husband is breaking his vows to you as a Christian and as a husband. For better or worse, for richer or poorer, he is allowing you to be the poorer with little to no support. The best option would be counseling, but as he is not willing to go you should consider going by yourself. Speak to your pastor and a counselor and find support in friends, family, and members if you congregation. If ge continues to break his vows to you by refusing to be a supportive husband and working on your marriage with you, consider moving out to keep you and your child safe and happy. I will be praying for you and your family that your husband may see the damage he is doing to your marriage and the Lord gives him the strength to work with you to fix it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to point out that your husband is breaking his vows to you as a Christian and as a husband. For better or worse, for richer or poorer, he is allowing you to be the poorer with little to no support. The best option would be counseling, but as he is not willing to go you should consider going by yourself. Speak to your pastor and a counselor and find support in friends, family, and members if you congregation. If ge continues to break his vows to you by refusing to be a supportive husband and working on your marriage with you, consider moving out to keep you and your child safe and happy. I will be praying for you and your family that your husband may see the damage he is doing to your marriage and the Lord gives him the strength to work with you to fix it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dge44re", "score_hidden": false, "stickied": false, "created": 1492491608.0, "created_utc": 1492462808.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": "", "user_reports": [], "id": "dgdvckr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "One-Above_All", "parent_id": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "I am sorry this has been on you for so long. You are dealing with a very delicate issue, so different from all the others that have made their way into this subreddit. I will PM you, and will do my best to help you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sorry this has been on you for so long. You are dealing with a very delicate issue, so different from all the others that have made their way into this subreddit. I will PM you, and will do my best to help you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgdvckr", "score_hidden": false, "stickied": false, "created": 1492481717.0, "created_utc": 1492452917.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": "", "user_reports": [], "id": "dgel20e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BladeofSouls", "parent_id": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Well you're husband's a dick. \n\nI don't have any advice so I'll just pray that God help you on your path. May the Lord give you guidance, and protect you from your husband. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well you&amp;#39;re husband&amp;#39;s a dick. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have any advice so I&amp;#39;ll just pray that God help you on your path. May the Lord give you guidance, and protect you from your husband. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgel20e", "score_hidden": false, "stickied": false, "created": 1492512701.0, "created_utc": 1492483901.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": "", "user_reports": [], "id": "dgen5sf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MagicLauren", "parent_id": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "You tell him that all of these earthly things he cares about: inheritance, class, cars, are nothing compared to what God could give. And  God gave you an eternal bond between your 2 hearts. And that bond should be whole. \n\nIf you remind your  husband that he is the biggest thing you care about and that hurting each other would devastate each other,  then he might  just stop fearing divorce.\n\nAnd I pray for your father as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You tell him that all of these earthly things he cares about: inheritance, class, cars, are nothing compared to what God could give. And  God gave you an eternal bond between your 2 hearts. And that bond should be whole. &lt;/p&gt;\n\n&lt;p&gt;If you remind your  husband that he is the biggest thing you care about and that hurting each other would devastate each other,  then he might  just stop fearing divorce.&lt;/p&gt;\n\n&lt;p&gt;And I pray for your father as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgen5sf", "score_hidden": false, "stickied": false, "created": 1492515496.0, "created_utc": 1492486696.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": "", "user_reports": [], "id": "dge1z3j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "T0MB0MBADILL", "parent_id": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "You are both Christians and divorce is not a option. Never even say the \"divorce\" word. What you need to do is habitually reading ur bible daily if you are not and pray. Also find a biblical church and seek Christian marriage council. \n\nOn the matters of his mom. Mother's tend to be protective for their babies and ultimately ur man needs to stand up for u when you are being wronged. There is a saying \"a daughter is a daughter all of her life, a son is a son till he takes a wife\" he needs to just stop talking about you to his mother, and you need to pray that God will help you to love her as he does. \n\nTaking care of a kid is hard, I'm the father and the primary care taker of our son because my work schedule leaves me more free time, try and think of it as \" I get to take care of my son\" not \"I have to take care of my son\" but I understand ur feelings there. It's a conscious decision to keep that mindset. \n\nBank accounts and assets. Worry about the root of problem here... Which is not fully investing in the relationship. The only advice I can give u is pray and read ur bible, even if you don't feel like it.\n\nThe lack of trust here sounds like it is rooted by you guys not asking people for sound biblical advice, if you have problems it goes back to the most important thing I've said here . READ YOUR BIBLE DAILY AND PRAY not just when you feel like it or when your heart is heavy\n\nYou guys are both Christians. Actively go to a biblical church and encourage one another to seek wisdom from the Bible. There is hope though for u two, you are both children of God and kindred spirits WHEN you guys are walking with the LORD, how you walk with the Lord is actively coming to him through PRAYER and Reading HIS WORD. in a godly marriage you guys will have a unifying goal of pursuing to be like Christ. \n\nSummery: seek marriage counseling, read the word and pray.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are both Christians and divorce is not a option. Never even say the &amp;quot;divorce&amp;quot; word. What you need to do is habitually reading ur bible daily if you are not and pray. Also find a biblical church and seek Christian marriage council. &lt;/p&gt;\n\n&lt;p&gt;On the matters of his mom. Mother&amp;#39;s tend to be protective for their babies and ultimately ur man needs to stand up for u when you are being wronged. There is a saying &amp;quot;a daughter is a daughter all of her life, a son is a son till he takes a wife&amp;quot; he needs to just stop talking about you to his mother, and you need to pray that God will help you to love her as he does. &lt;/p&gt;\n\n&lt;p&gt;Taking care of a kid is hard, I&amp;#39;m the father and the primary care taker of our son because my work schedule leaves me more free time, try and think of it as &amp;quot; I get to take care of my son&amp;quot; not &amp;quot;I have to take care of my son&amp;quot; but I understand ur feelings there. It&amp;#39;s a conscious decision to keep that mindset. &lt;/p&gt;\n\n&lt;p&gt;Bank accounts and assets. Worry about the root of problem here... Which is not fully investing in the relationship. The only advice I can give u is pray and read ur bible, even if you don&amp;#39;t feel like it.&lt;/p&gt;\n\n&lt;p&gt;The lack of trust here sounds like it is rooted by you guys not asking people for sound biblical advice, if you have problems it goes back to the most important thing I&amp;#39;ve said here . READ YOUR BIBLE DAILY AND PRAY not just when you feel like it or when your heart is heavy&lt;/p&gt;\n\n&lt;p&gt;You guys are both Christians. Actively go to a biblical church and encourage one another to seek wisdom from the Bible. There is hope though for u two, you are both children of God and kindred spirits WHEN you guys are walking with the LORD, how you walk with the Lord is actively coming to him through PRAYER and Reading HIS WORD. in a godly marriage you guys will have a unifying goal of pursuing to be like Christ. &lt;/p&gt;\n\n&lt;p&gt;Summery: seek marriage counseling, read the word and pray.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dge1z3j", "score_hidden": false, "stickied": false, "created": 1492489197.0, "created_utc": 1492460397.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": "", "user_reports": [], "id": "dge0m72", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "opsomath", "parent_id": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Hello. Based on what you've written, you've been treated in a way that no one should be treated and may want to consider getting out of your living situation. Have you ever read the (Christian) book *Boundaries* by Cloud and Townsend? \n\nIf I knew a woman who was being treated in the way you describe, I would hope she would separate herself from her husband and take her son with her. And I believe that divorce is nearly always wrong, too. It's important for your soul to not be treated as worthless. It's important for your son's soul to not see his mother insulted and devalued. It's important for your husband's soul to not do that kind of violence to another person, because our Lord said that if you are angry with your brother, you have murdered them in your heart. Please think about ways you can create boundaries that will help all three of you. \n\nOne example would be to leave the area and go stay with a trusted person or a shelter, and leave a note that says \"You may not curse at me, throw things at me, or say you hate me. Please get counseling and contact me when you do.\"\n\nAnother example would be to say that first, and then to remove yourself from the situation if the boundary is crossed.\n\nPlease, take care of yourself and trust your instincts if you feel in danger. God's rules are for the healing and growth of your soul, not to force you to stay in a situation that harms you and your son.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello. Based on what you&amp;#39;ve written, you&amp;#39;ve been treated in a way that no one should be treated and may want to consider getting out of your living situation. Have you ever read the (Christian) book &lt;em&gt;Boundaries&lt;/em&gt; by Cloud and Townsend? &lt;/p&gt;\n\n&lt;p&gt;If I knew a woman who was being treated in the way you describe, I would hope she would separate herself from her husband and take her son with her. And I believe that divorce is nearly always wrong, too. It&amp;#39;s important for your soul to not be treated as worthless. It&amp;#39;s important for your son&amp;#39;s soul to not see his mother insulted and devalued. It&amp;#39;s important for your husband&amp;#39;s soul to not do that kind of violence to another person, because our Lord said that if you are angry with your brother, you have murdered them in your heart. Please think about ways you can create boundaries that will help all three of you. &lt;/p&gt;\n\n&lt;p&gt;One example would be to leave the area and go stay with a trusted person or a shelter, and leave a note that says &amp;quot;You may not curse at me, throw things at me, or say you hate me. Please get counseling and contact me when you do.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Another example would be to say that first, and then to remove yourself from the situation if the boundary is crossed.&lt;/p&gt;\n\n&lt;p&gt;Please, take care of yourself and trust your instincts if you feel in danger. God&amp;#39;s rules are for the healing and growth of your soul, not to force you to stay in a situation that harms you and your son.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dge0m72", "score_hidden": false, "stickied": false, "created": 1492487673.0, "created_utc": 1492458873.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65wx5y", "likes": null, "replies": "", "user_reports": [], "id": "dge04cr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "opsomath", "parent_id": "t1_dgdy723", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Just in case OP reads this, violence and abuse are plenty of cause for separation from a spouse, even if you take the strict position that divorce is always wrong or always wrong save for sexual infidelity. OP has described verbal abuse and the first hints of violence (throwing the keys) as well as extremely controlling behavior, and based on her account she should feel free to get away from the man if she has a place to go. \n\nFurthermore, the issue with this couple is almost certainly not that she should learn to make better \"baked treats\" or have sex with her husband more. Please consider the effects of your words on a potential abuse victim.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just in case OP reads this, violence and abuse are plenty of cause for separation from a spouse, even if you take the strict position that divorce is always wrong or always wrong save for sexual infidelity. OP has described verbal abuse and the first hints of violence (throwing the keys) as well as extremely controlling behavior, and based on her account she should feel free to get away from the man if she has a place to go. &lt;/p&gt;\n\n&lt;p&gt;Furthermore, the issue with this couple is almost certainly not that she should learn to make better &amp;quot;baked treats&amp;quot; or have sex with her husband more. Please consider the effects of your words on a potential abuse victim.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dge04cr", "score_hidden": false, "stickied": false, "created": 1492487116.0, "created_utc": 1492458316.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdy723", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "generallabourer", "parent_id": "t3_65wx5y", "subreddit_name_prefixed": "r/Christianity", "controversiality": 1, "body": "You should take divorce off of the table as an option to be at any point considered - at least on your end. Unless infidelity can be established there is no Biblical cause for divorce. Until that point God's will is that those within the marriage will always seek to mend it rather than end it.\n\nThe story of Ruth is perhaps something you should read. She had to put up with a generally mean, unloving, and uncaring husband because the law demanded it. She remained faithful even as her husband continued to treat her badly. She was in the end blessed for it after God saw fit to bring about the end of her husband's life by finding love with someone who did appreciate her.\n\nI am of course not saying that you should hope for your husband's death to free you. The point is that even if your husband does not value as he ought to, the right thing to do is to value him and the marriage as you ought to. Then maybe your husband will change in time.\n\nNow regarding your material inequality, Biblically it is the husband's duty to provide for the wife, and the family. It is only natural that there is inequality in terms of monetary income. Biblically it is the husband's duty to provide the income. You do not even have a duty in this regard at all. If you have an income then that is strictly optional, and it is generally not supposed to interfere with your primary duties within the marriage and in the home.\n\nWhat you do in the home saves your husband from having to do it. It would in theory allow him more time at work to make more money. Your time in the home is worth as much as his time at work is. The work you do at home is worth as much to the household as the work that he does at work.\n\nIt seems as though you both view this as an unequal partnership. The truth is that no marriage is going to be equal in every way - and nor is this a thing to even be desired. Marriages are complementary, just as we - male and female - are complementary.\n\nWhile you may not be able to equal your husband's finances, what you can do is invest yourself more in other things that you can do. Work on improving your cooking and baking. Speaking as a man I can say that most of us enjoy good food and baked treats. An easy way to improve is to just look up recipes online and follow the directions given.\n\nRegarding your property conflicts, there should not be such conflicts because the right way is for there to be one household and one family, but your husband's fears are not exactly baseless in general (looking at our societies). Given the existence of no-fault divorce losing one's assets is a concern that prevents many men from seeking marriage to begin with, and drives others to hold back from full investment into it. I am not justifying keeping things separate, but I do understand why such concerns exist.\n\nRegarding the hurtful things he said, this is certainly not something you should have to put up with. God tells men to love and cherish their wives. He commands it. You are in fact his wife, and words cannot change this fact. In the eyes of God a marriage is until death. The only allowance which Jesus gave for divorce is in the case of infidelity, in the case of fornication. Only a crime which God said in the law is worthy of death, only adultery, is the just cause to end a marriage. The truth according to God is that your husband has no right to divorce you. He has no right whatsoever.\n\nIn addition to embracing the things you can do for him in the home, which are indeed as valuable as what he does at work, I believe in such times as these it is even more important to be intimate with your husband. During long times apart, being physically distant, resentment for other issues can fester and grow all the more. Physical intimacy naturally brings you closer together. It naturally fosters feelings of affection. It helps remind each partner of what they share together.\n\nWhile things may be bad now, I hope you will keep faith that they can get better. While He certainly doesn't approve of some of the things either of you are doing, or have said, you should remember that God is ultimately hoping for the success rather than the failure of your marriage. His will is that you will work past this and hopefully find happiness together.", "edited": 1492456532.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should take divorce off of the table as an option to be at any point considered - at least on your end. Unless infidelity can be established there is no Biblical cause for divorce. Until that point God&amp;#39;s will is that those within the marriage will always seek to mend it rather than end it.&lt;/p&gt;\n\n&lt;p&gt;The story of Ruth is perhaps something you should read. She had to put up with a generally mean, unloving, and uncaring husband because the law demanded it. She remained faithful even as her husband continued to treat her badly. She was in the end blessed for it after God saw fit to bring about the end of her husband&amp;#39;s life by finding love with someone who did appreciate her.&lt;/p&gt;\n\n&lt;p&gt;I am of course not saying that you should hope for your husband&amp;#39;s death to free you. The point is that even if your husband does not value as he ought to, the right thing to do is to value him and the marriage as you ought to. Then maybe your husband will change in time.&lt;/p&gt;\n\n&lt;p&gt;Now regarding your material inequality, Biblically it is the husband&amp;#39;s duty to provide for the wife, and the family. It is only natural that there is inequality in terms of monetary income. Biblically it is the husband&amp;#39;s duty to provide the income. You do not even have a duty in this regard at all. If you have an income then that is strictly optional, and it is generally not supposed to interfere with your primary duties within the marriage and in the home.&lt;/p&gt;\n\n&lt;p&gt;What you do in the home saves your husband from having to do it. It would in theory allow him more time at work to make more money. Your time in the home is worth as much as his time at work is. The work you do at home is worth as much to the household as the work that he does at work.&lt;/p&gt;\n\n&lt;p&gt;It seems as though you both view this as an unequal partnership. The truth is that no marriage is going to be equal in every way - and nor is this a thing to even be desired. Marriages are complementary, just as we - male and female - are complementary.&lt;/p&gt;\n\n&lt;p&gt;While you may not be able to equal your husband&amp;#39;s finances, what you can do is invest yourself more in other things that you can do. Work on improving your cooking and baking. Speaking as a man I can say that most of us enjoy good food and baked treats. An easy way to improve is to just look up recipes online and follow the directions given.&lt;/p&gt;\n\n&lt;p&gt;Regarding your property conflicts, there should not be such conflicts because the right way is for there to be one household and one family, but your husband&amp;#39;s fears are not exactly baseless in general (looking at our societies). Given the existence of no-fault divorce losing one&amp;#39;s assets is a concern that prevents many men from seeking marriage to begin with, and drives others to hold back from full investment into it. I am not justifying keeping things separate, but I do understand why such concerns exist.&lt;/p&gt;\n\n&lt;p&gt;Regarding the hurtful things he said, this is certainly not something you should have to put up with. God tells men to love and cherish their wives. He commands it. You are in fact his wife, and words cannot change this fact. In the eyes of God a marriage is until death. The only allowance which Jesus gave for divorce is in the case of infidelity, in the case of fornication. Only a crime which God said in the law is worthy of death, only adultery, is the just cause to end a marriage. The truth according to God is that your husband has no right to divorce you. He has no right whatsoever.&lt;/p&gt;\n\n&lt;p&gt;In addition to embracing the things you can do for him in the home, which are indeed as valuable as what he does at work, I believe in such times as these it is even more important to be intimate with your husband. During long times apart, being physically distant, resentment for other issues can fester and grow all the more. Physical intimacy naturally brings you closer together. It naturally fosters feelings of affection. It helps remind each partner of what they share together.&lt;/p&gt;\n\n&lt;p&gt;While things may be bad now, I hope you will keep faith that they can get better. While He certainly doesn&amp;#39;t approve of some of the things either of you are doing, or have said, you should remember that God is ultimately hoping for the success rather than the failure of your marriage. His will is that you will work past this and hopefully find happiness together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgdy723", "score_hidden": false, "stickied": false, "created": 1492484932.0, "created_utc": 1492456132.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]