[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Christianity", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know that this is a multi-denomination sub. But I really wanted to share some great news. I grew up non-denominational. The apologetics did more good than harm growing up, and so many people were very bad examples of Christians. I stopped going to church at the age of 14, and quickly became an Atheist. And not a kind one. I lived a very immoral life. &lt;/p&gt;\n\n&lt;p&gt;Saturday I became a Catholic. And here&amp;#39;s what that means to me. It means that I pledge my entire life to Jesus Christ. It means that through all of the tradition I can do more than just go to church, but cover my entire life in Christianity. I first came to the church seeking to be a better person, but now my motive is to be close to God. To know, love, and serve him.&lt;/p&gt;\n\n&lt;p&gt;It was through the Church that I found an ability that I started to seek. To become devout. Confirmation was me not just joining the church. But me giving my life up to God. Letting God use me as a blank check. I&amp;#39;m excited for whats to come. And I&amp;#39;m thankful for all the gift that is the Church.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I know that this is a multi-denomination sub. But I really wanted to share some great news. I grew up non-denominational. The apologetics did more good than harm growing up, and so many people were very bad examples of Christians. I stopped going to church at the age of 14, and quickly became an Atheist. And not a kind one. I lived a very immoral life. \n\nSaturday I became a Catholic. And here's what that means to me. It means that I pledge my entire life to Jesus Christ. It means that through all of the tradition I can do more than just go to church, but cover my entire life in Christianity. I first came to the church seeking to be a better person, but now my motive is to be close to God. To know, love, and serve him.\n\nIt was through the Church that I found an ability that I started to seek. To become devout. Confirmation was me not just joining the church. But me giving my life up to God. Letting God use me as a blank check. I'm excited for whats to come. And I'm thankful for all the gift that is the Church.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zrzd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 145, "report_reasons": null, "author": "St_Morrissey", "saved": false, "mod_reports": [], "name": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "approved_by": null, "over_18": false, "domain": "self.Christianity", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh6c", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "roca", "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Christianity/comments/65zrzd/before_this_year_i_was_an_atheist_and_saturday_i/", "num_reports": null, "locked": false, "stickied": false, "created": 1492507088.0, "url": "https://www.reddit.com/r/Christianity/comments/65zrzd/before_this_year_i_was_an_atheist_and_saturday_i/", "author_flair_text": "Roman Catholic", "quarantine": false, "title": "Before this year I was an Atheist, and Saturday I became a Catholic", "created_utc": 1492478288.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 65, "visited": false, "subreddit_type": "public", "ups": 145}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgegknz", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "liberties", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Welcome!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Welcome!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgegknz", "score_hidden": false, "stickied": false, "created": 1492507302.0, "created_utc": 1492478502.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgei4ym", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "PaedragGaidin", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Welcome home!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Welcome home!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgei4ym", "score_hidden": false, "stickied": false, "created": 1492509213.0, "created_utc": 1492480413.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgegmma", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "gnurdette", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Welcome, and God bless you!  You don't need to make excuses for embracing Christ through a different denomination than many of us.  Congratulations to, and blessings on, the RCC for bringing home to you what earlier churches failed to.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Welcome, and God bless you!  You don&amp;#39;t need to make excuses for embracing Christ through a different denomination than many of us.  Congratulations to, and blessings on, the RCC for bringing home to you what earlier churches failed to.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgegmma", "score_hidden": false, "stickied": false, "created": 1492507369.0, "created_utc": 1492478569.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgeqclk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mojosam", "parent_id": "t1_dgel7nz", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "&gt;Like if my dad sneezed right before my conception, I would not exist. If a single thing before my conception was changed, I would not exist. That's incredible to think that the entire world led up to my conception (and the conception of everyone else). The idea that if a single thing had been different, I wouldn't exist, just seems incredibly suspect to me. That the odds of me (or you) existing is so small.\n\nCan you explain this, because I'm not following your insight. Let's say your mom had married her high school sweetheart instead of your dad, you wouldn't exist. But she might have had kids with that husband, so those kids would have existed if that had happened. And if your mom's dad had decided to take a job ina different town she would have gone to a different high school, and had a different timeline that could have resulted in a third set of kids.\n\nSo yes, the specific you I'm talking to is the product of a nearly infinite set of decisions and events, but if any of those had been different, the world would still turn, albeit just with some different people on it.\n\nIt's like how, if you shuffle a card deck to play solitaire, the iodds of getting the deck in that particular order is very very small. But so what? if you had shuffled the deck differently, the chance of the deck being in that order would be just as small, and you could still play solitaire.\n\nSo what I'm missing is what this has to do with God? Are you saying parents and grandparents couldn't have made different choices in life, choices that would have resulted in you not existing?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Like if my dad sneezed right before my conception, I would not exist. If a single thing before my conception was changed, I would not exist. That&amp;#39;s incredible to think that the entire world led up to my conception (and the conception of everyone else). The idea that if a single thing had been different, I wouldn&amp;#39;t exist, just seems incredibly suspect to me. That the odds of me (or you) existing is so small.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Can you explain this, because I&amp;#39;m not following your insight. Let&amp;#39;s say your mom had married her high school sweetheart instead of your dad, you wouldn&amp;#39;t exist. But she might have had kids with that husband, so those kids would have existed if that had happened. And if your mom&amp;#39;s dad had decided to take a job ina different town she would have gone to a different high school, and had a different timeline that could have resulted in a third set of kids.&lt;/p&gt;\n\n&lt;p&gt;So yes, the specific you I&amp;#39;m talking to is the product of a nearly infinite set of decisions and events, but if any of those had been different, the world would still turn, albeit just with some different people on it.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like how, if you shuffle a card deck to play solitaire, the iodds of getting the deck in that particular order is very very small. But so what? if you had shuffled the deck differently, the chance of the deck being in that order would be just as small, and you could still play solitaire.&lt;/p&gt;\n\n&lt;p&gt;So what I&amp;#39;m missing is what this has to do with God? Are you saying parents and grandparents couldn&amp;#39;t have made different choices in life, choices that would have resulted in you not existing?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeqclk", "score_hidden": true, "stickied": false, "created": 1492520379.0, "created_utc": 1492491579.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgeqy43", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgep1ur", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "&gt;Correct me if I'm wrong, but it seems like you are saying that because the bible hasn't changed and it's morally superior it's \ncorrect. \n\nActually I meant the church on matters of faith and morals haven't changed. Compared to churches who have changed frequently and often. More of a why I am a Catholic vs Baptist rather than Christian vs Atheist\n\n&gt;Couldn't that be the case with a lot of things? If I decided to make a religion that gained a lot of traction in a few thousand years, and it was morally sound, does that make it true? How would you filter that out from Christianity?\n\nIt would be hard, absolutely. Look at Mormonism, how do you filter that out? They have most of the same morals. And seem like a pretty moral bunch. The difference is that faith isn't just placed on morality. There have been various arguments and experiences that made me a Christian. It's not just \"Oh look how moral it is.\"\n\n\n&gt;Agreed with one major caveat. It actually has to be a miracle, from God, with verifiable evidence. Arther Clarke makes a good point about this, \"Any sufficiently advanced technology is indistinguishable from magic\". How can you completely determine it was a god?\n\nWell sure it can be aliens. And supposed miracles happen elsewhere. But the bulk of it, in AD have happened in the Catholic Church. All of these miracles have led to good things. People coming to Christ. And the way miracles work isn't magic, but physics. I like to compare God to a programmer. To us we see certain laws of the program being run, we theorize various rules of the software, but then something different happens. But the programmer can make anything happen. \n\n&gt;Also, how do you reconcile with some of the more horrendous things that happened in the old testament? I realize that the rules don't apply anymore and that the message changed a lot, but they are still things that the bible claims happened.\n\nThe message didn't really change. A lot of people get hung up on the law, but it wasn't ever enforced to the degree the law required. Christians may say the point was to show they weren't perfect. And this is true but lazy. Sin is separation from God. And all sin required an atonement. This culturally was from sacrifice. And while there was a forgiveness of sorts (the psalms mention Gods forgiveness) it wasn't the same kind. Christ was the \"paschal lamb\" meaning he was the ultimate sacrifice. Because of this the law lost it's meaning. In addition to a point it was very cultural. Jesus says \"The sabbath was made for man, not man for the Sabbath.\" \n\nWhen it comes to God killing others, you have to be careful. The books of a bible all have a point, and they all tell them differently. John tells his point with a lot of allusion and hidden meaning. Luke tells the gospel from a very historical point of view, and matthew specifically to and from a jewish viewpoint. Let's look at Job. \n\nJob is an incredible jew. He loves God and has a ton of faith. He then loses literally everything and has the worst life a person can have. I believe many see this as a parable, but ultimately Job is given everything back. But he also has a stronger faith. Tragedy and bad things that happen all can strengthen us, or destroy us. I believe as someone who has been through hell, we have a choice in the matter. \n\nNow God does kill various people for various reasons. Like the flood for instance. But out of these bad things that happen, out of all the tragedy usually it is either someone directly disobeying God. Or it results in something good happening. Look at the first born being killed. That is because of free will, and the plagues started small and ended up being awful, because of pharaoh not obeying moses. Ultimately God never kills for the fun of it, he doesn't kill just to kill. It is usually to bring greater good, and it often could either be a myth or something that is exaggerated. He also shows great mercy. To Nineveh he spares the city despite Jonah waiting and wishing them to be destroyed. \n  \n&gt;What were your reasons for being an atheist?\n\nI think many atheists hate on \"experience\" that \"experience\" isn't evidence. Well I disagree. I was an atheist because of experience. I saw Christians as awful people. So I separated myself. Then I became an atheist because of poor biblical arguments (I thought the law of Leviticus was supposed to still be followed). But mainly it was because of a sense that nothing in our daily life supports this. Where can I see God outside of the bible? You look around and it's just life, and everything moves forward with no apparent God. \n\nWell if you are a Catholic, you got a lot of tradition, and history of God directly working. I feel like many atheist arguments about the bible and Christianity cannot touch catholicism because of the belief of the authority of the church. Combined with supposed miracles it answers many questions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Correct me if I&amp;#39;m wrong, but it seems like you are saying that because the bible hasn&amp;#39;t changed and it&amp;#39;s morally superior it&amp;#39;s \ncorrect. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Actually I meant the church on matters of faith and morals haven&amp;#39;t changed. Compared to churches who have changed frequently and often. More of a why I am a Catholic vs Baptist rather than Christian vs Atheist&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Couldn&amp;#39;t that be the case with a lot of things? If I decided to make a religion that gained a lot of traction in a few thousand years, and it was morally sound, does that make it true? How would you filter that out from Christianity?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It would be hard, absolutely. Look at Mormonism, how do you filter that out? They have most of the same morals. And seem like a pretty moral bunch. The difference is that faith isn&amp;#39;t just placed on morality. There have been various arguments and experiences that made me a Christian. It&amp;#39;s not just &amp;quot;Oh look how moral it is.&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Agreed with one major caveat. It actually has to be a miracle, from God, with verifiable evidence. Arther Clarke makes a good point about this, &amp;quot;Any sufficiently advanced technology is indistinguishable from magic&amp;quot;. How can you completely determine it was a god?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well sure it can be aliens. And supposed miracles happen elsewhere. But the bulk of it, in AD have happened in the Catholic Church. All of these miracles have led to good things. People coming to Christ. And the way miracles work isn&amp;#39;t magic, but physics. I like to compare God to a programmer. To us we see certain laws of the program being run, we theorize various rules of the software, but then something different happens. But the programmer can make anything happen. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Also, how do you reconcile with some of the more horrendous things that happened in the old testament? I realize that the rules don&amp;#39;t apply anymore and that the message changed a lot, but they are still things that the bible claims happened.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The message didn&amp;#39;t really change. A lot of people get hung up on the law, but it wasn&amp;#39;t ever enforced to the degree the law required. Christians may say the point was to show they weren&amp;#39;t perfect. And this is true but lazy. Sin is separation from God. And all sin required an atonement. This culturally was from sacrifice. And while there was a forgiveness of sorts (the psalms mention Gods forgiveness) it wasn&amp;#39;t the same kind. Christ was the &amp;quot;paschal lamb&amp;quot; meaning he was the ultimate sacrifice. Because of this the law lost it&amp;#39;s meaning. In addition to a point it was very cultural. Jesus says &amp;quot;The sabbath was made for man, not man for the Sabbath.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;When it comes to God killing others, you have to be careful. The books of a bible all have a point, and they all tell them differently. John tells his point with a lot of allusion and hidden meaning. Luke tells the gospel from a very historical point of view, and matthew specifically to and from a jewish viewpoint. Let&amp;#39;s look at Job. &lt;/p&gt;\n\n&lt;p&gt;Job is an incredible jew. He loves God and has a ton of faith. He then loses literally everything and has the worst life a person can have. I believe many see this as a parable, but ultimately Job is given everything back. But he also has a stronger faith. Tragedy and bad things that happen all can strengthen us, or destroy us. I believe as someone who has been through hell, we have a choice in the matter. &lt;/p&gt;\n\n&lt;p&gt;Now God does kill various people for various reasons. Like the flood for instance. But out of these bad things that happen, out of all the tragedy usually it is either someone directly disobeying God. Or it results in something good happening. Look at the first born being killed. That is because of free will, and the plagues started small and ended up being awful, because of pharaoh not obeying moses. Ultimately God never kills for the fun of it, he doesn&amp;#39;t kill just to kill. It is usually to bring greater good, and it often could either be a myth or something that is exaggerated. He also shows great mercy. To Nineveh he spares the city despite Jonah waiting and wishing them to be destroyed. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What were your reasons for being an atheist?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think many atheists hate on &amp;quot;experience&amp;quot; that &amp;quot;experience&amp;quot; isn&amp;#39;t evidence. Well I disagree. I was an atheist because of experience. I saw Christians as awful people. So I separated myself. Then I became an atheist because of poor biblical arguments (I thought the law of Leviticus was supposed to still be followed). But mainly it was because of a sense that nothing in our daily life supports this. Where can I see God outside of the bible? You look around and it&amp;#39;s just life, and everything moves forward with no apparent God. &lt;/p&gt;\n\n&lt;p&gt;Well if you are a Catholic, you got a lot of tradition, and history of God directly working. I feel like many atheist arguments about the bible and Christianity cannot touch catholicism because of the belief of the authority of the church. Combined with supposed miracles it answers many questions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeqy43", "score_hidden": true, "stickied": false, "created": 1492521393.0, "created_utc": 1492492593.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgep1ur", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "emanymdegnahc", "parent_id": "t1_dgeniuc", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Thanks for the great reply! I love hearing why people believe and especially why they convert or deconvert. It's interesting that you were leaning towards Islam at one point. The ages were similar for me just with the opposite conclusion (and without the Islam part, just Christianity).\n\nOn the same scale:\nAge:\n\n0-14: 0 (absolute belief in God)\n\n15-16:2\n\n17-now: 9 (most likely no God)\n\nCorrect me if I'm wrong, but it seems like you are saying that because the bible hasn't changed and it's morally superior it's correct. Couldn't that be the case with a lot of things? If I decided to make a religion that gained a lot of traction in a few thousand years, and it was morally sound, does that make it true? How would you filter that out from Christianity? Also, how do you reconcile with some of the more horrendous things that happened in the old testament? I realize that the rules don't apply anymore and that the message changed a lot, but they are still things that the bible claims happened.\n\n&gt; What I mean by that is that Christianity doesn't really make sense for a lot of the early Christians. Jesus was crucified (which there is evidence for), Peter and Paul the cornerstones of the faith were killed. Many more Christians were martyrs. Why would anyone make this up?\n\n&gt;if a single miracle is true, then it's all true.\n\nAgreed with one major caveat. It actually has to be a miracle, from God, with verifiable evidence. Arther Clarke makes a good point about this, \"Any sufficiently advanced technology is indistinguishable from magic\". How can you completely determine it was a god?\n\nSorry for all the questions, you don't have to answer them if you don't feel like it. There is one question I would really like you to answer though because I'm curious. What were your reasons for being an atheist?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the great reply! I love hearing why people believe and especially why they convert or deconvert. It&amp;#39;s interesting that you were leaning towards Islam at one point. The ages were similar for me just with the opposite conclusion (and without the Islam part, just Christianity).&lt;/p&gt;\n\n&lt;p&gt;On the same scale:\nAge:&lt;/p&gt;\n\n&lt;p&gt;0-14: 0 (absolute belief in God)&lt;/p&gt;\n\n&lt;p&gt;15-16:2&lt;/p&gt;\n\n&lt;p&gt;17-now: 9 (most likely no God)&lt;/p&gt;\n\n&lt;p&gt;Correct me if I&amp;#39;m wrong, but it seems like you are saying that because the bible hasn&amp;#39;t changed and it&amp;#39;s morally superior it&amp;#39;s correct. Couldn&amp;#39;t that be the case with a lot of things? If I decided to make a religion that gained a lot of traction in a few thousand years, and it was morally sound, does that make it true? How would you filter that out from Christianity? Also, how do you reconcile with some of the more horrendous things that happened in the old testament? I realize that the rules don&amp;#39;t apply anymore and that the message changed a lot, but they are still things that the bible claims happened.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What I mean by that is that Christianity doesn&amp;#39;t really make sense for a lot of the early Christians. Jesus was crucified (which there is evidence for), Peter and Paul the cornerstones of the faith were killed. Many more Christians were martyrs. Why would anyone make this up?&lt;/p&gt;\n\n&lt;p&gt;if a single miracle is true, then it&amp;#39;s all true.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Agreed with one major caveat. It actually has to be a miracle, from God, with verifiable evidence. Arther Clarke makes a good point about this, &amp;quot;Any sufficiently advanced technology is indistinguishable from magic&amp;quot;. How can you completely determine it was a god?&lt;/p&gt;\n\n&lt;p&gt;Sorry for all the questions, you don&amp;#39;t have to answer them if you don&amp;#39;t feel like it. There is one question I would really like you to answer though because I&amp;#39;m curious. What were your reasons for being an atheist?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgep1ur", "score_hidden": false, "stickied": false, "created": 1492518284.0, "created_utc": 1492489484.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeniuc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgempz4", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "On a scaled of 1-10. 1 Believing in God and 10 Absolutely believe there is no such thing as God\n\nAge: \n\n14-17: 10\n\n18:  8-9\n\n19: 6 (purely agnostic)\n\n20: 1\n\n\nI said that 17 I didn't believe in God at all. But for a few months I really looked into Islam. I thought I was going to be a muslim, I just didn't believe in God. \n\nBut basically the only religions that really go outside of their culture are islam and Christianity. Islam was really unable to justify a lot of their rules in my opinion. Another fact is that it seemed to be pointless in a way. There's a god, and here are how we are supposed to live the end. But ultimately to, is that it seemed to be more of a product.\n\nWhat I mean by that is that Christianity doesn't really make sense for a lot of the early Christians. Jesus was crucified (which there is evidence for), Peter, and Paul the cornerstones of the faith were killed. Many more Christians were martyrs. Why would anyone make this up? \n\nMohammed, ended up kind of gaining a lot. He gained a ton of religious and political power. In addition, it was incredibly progressive, women were finally able to get a job, women could leave the house, children had more rights. But we see that it's morals stopped being progressive, look at womens rights now. Finally a lot of islam seems like a cultural product.\n\nChristianity has not stopped having a radically progressive morality. The whole point of turning the other cheek, not seeking revenge, and showing everyone unconditional love and forgiveness. To me that speaks volumes that it is still relevant in it's morality. If God is good then Christianity's radical goodness makes sense. \n\nCombined with the Church, no organization, no country in the history of the world can compare. Not only has it never changed on matters of faith and morality, it has always stead the test of time. Consider all the bad clergy and awful popes that have existed. Not one of them changed the meaning, or reinterpreted the message to fit their personal goals. Compare that to leaders who taste power and destroy their nation/organization/party/etc. Look at the soviet union who had a head and then a body, every leader drastically changed a message. \n\nThen look at miracles that supposedly have happened, if a single miracle is true, then it's all true. The other big thing is that these miracles have caused millions to convert. Getting back to my original point. If there is a God. He either is hands off and doesn't think of us. Believing in that has no base, and it also doesn't accomplish anything (so no meaning). Or he is hands on. And if he is hands on, I think it becomes easier and easier to believe in the Christian God.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On a scaled of 1-10. 1 Believing in God and 10 Absolutely believe there is no such thing as God&lt;/p&gt;\n\n&lt;p&gt;Age: &lt;/p&gt;\n\n&lt;p&gt;14-17: 10&lt;/p&gt;\n\n&lt;p&gt;18:  8-9&lt;/p&gt;\n\n&lt;p&gt;19: 6 (purely agnostic)&lt;/p&gt;\n\n&lt;p&gt;20: 1&lt;/p&gt;\n\n&lt;p&gt;I said that 17 I didn&amp;#39;t believe in God at all. But for a few months I really looked into Islam. I thought I was going to be a muslim, I just didn&amp;#39;t believe in God. &lt;/p&gt;\n\n&lt;p&gt;But basically the only religions that really go outside of their culture are islam and Christianity. Islam was really unable to justify a lot of their rules in my opinion. Another fact is that it seemed to be pointless in a way. There&amp;#39;s a god, and here are how we are supposed to live the end. But ultimately to, is that it seemed to be more of a product.&lt;/p&gt;\n\n&lt;p&gt;What I mean by that is that Christianity doesn&amp;#39;t really make sense for a lot of the early Christians. Jesus was crucified (which there is evidence for), Peter, and Paul the cornerstones of the faith were killed. Many more Christians were martyrs. Why would anyone make this up? &lt;/p&gt;\n\n&lt;p&gt;Mohammed, ended up kind of gaining a lot. He gained a ton of religious and political power. In addition, it was incredibly progressive, women were finally able to get a job, women could leave the house, children had more rights. But we see that it&amp;#39;s morals stopped being progressive, look at womens rights now. Finally a lot of islam seems like a cultural product.&lt;/p&gt;\n\n&lt;p&gt;Christianity has not stopped having a radically progressive morality. The whole point of turning the other cheek, not seeking revenge, and showing everyone unconditional love and forgiveness. To me that speaks volumes that it is still relevant in it&amp;#39;s morality. If God is good then Christianity&amp;#39;s radical goodness makes sense. &lt;/p&gt;\n\n&lt;p&gt;Combined with the Church, no organization, no country in the history of the world can compare. Not only has it never changed on matters of faith and morality, it has always stead the test of time. Consider all the bad clergy and awful popes that have existed. Not one of them changed the meaning, or reinterpreted the message to fit their personal goals. Compare that to leaders who taste power and destroy their nation/organization/party/etc. Look at the soviet union who had a head and then a body, every leader drastically changed a message. &lt;/p&gt;\n\n&lt;p&gt;Then look at miracles that supposedly have happened, if a single miracle is true, then it&amp;#39;s all true. The other big thing is that these miracles have caused millions to convert. Getting back to my original point. If there is a God. He either is hands off and doesn&amp;#39;t think of us. Believing in that has no base, and it also doesn&amp;#39;t accomplish anything (so no meaning). Or he is hands on. And if he is hands on, I think it becomes easier and easier to believe in the Christian God.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeniuc", "score_hidden": false, "stickied": false, "created": 1492516024.0, "created_utc": 1492487224.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgempz4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "emanymdegnahc", "parent_id": "t1_dgel7nz", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Another atheist here. I'm not looking to argue, but I have a couple questions.\n\nOn a scale, how strongly would you say your disbelief in God was before you converted?\n\nYou mentioned a lot that there are too many coincidences for there not to be a God, but how did you determine that the Christian God was the correct one to solve this problem?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Another atheist here. I&amp;#39;m not looking to argue, but I have a couple questions.&lt;/p&gt;\n\n&lt;p&gt;On a scale, how strongly would you say your disbelief in God was before you converted?&lt;/p&gt;\n\n&lt;p&gt;You mentioned a lot that there are too many coincidences for there not to be a God, but how did you determine that the Christian God was the correct one to solve this problem?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgempz4", "score_hidden": false, "stickied": false, "created": 1492514882.0, "created_utc": 1492486082.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgel7nz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgekmcn", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Like if my dad sneezed right before my conception, I would not exist.  If a single thing before my conception was changed, I would not exist. That's incredible to think that the entire world led up to my conception (and the conception of everyone else). The idea that if a single thing had been different, I wouldn't exist, just seems incredibly suspect to me. That the odds of me (or you) existing is so small. \n\nNow what if the odds of us existing were not Dependant on matter. Rather there is a soul created that can theoretically fit any body. Then it doesn't matter what sperm or egg, I still exist. \n\nWe have a body, and a mind. But we also have an \"experience\" we experience ourselves. We experience our thoughts. That experience isn't necessarily tied to a body, and that's where the idea of a soul begins to make a whole lot of sense. \n\nAnyway, what problems with believing do you have?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like if my dad sneezed right before my conception, I would not exist.  If a single thing before my conception was changed, I would not exist. That&amp;#39;s incredible to think that the entire world led up to my conception (and the conception of everyone else). The idea that if a single thing had been different, I wouldn&amp;#39;t exist, just seems incredibly suspect to me. That the odds of me (or you) existing is so small. &lt;/p&gt;\n\n&lt;p&gt;Now what if the odds of us existing were not Dependant on matter. Rather there is a soul created that can theoretically fit any body. Then it doesn&amp;#39;t matter what sperm or egg, I still exist. &lt;/p&gt;\n\n&lt;p&gt;We have a body, and a mind. But we also have an &amp;quot;experience&amp;quot; we experience ourselves. We experience our thoughts. That experience isn&amp;#39;t necessarily tied to a body, and that&amp;#39;s where the idea of a soul begins to make a whole lot of sense. &lt;/p&gt;\n\n&lt;p&gt;Anyway, what problems with believing do you have?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgel7nz", "score_hidden": false, "stickied": false, "created": 1492512905.0, "created_utc": 1492484105.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekmcn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Red_Idiot", "parent_id": "t1_dgeis9j", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Thank you for the response. I had never read anything about those miracles, so I did a quick Wikipedia search on all 3 and found them to be quite interesting, especially the Miracles of Lourdes. I'm not quite sure about your point on the odds of it all though, why do you believe that in different circumstances you would still exist? I think I may be misreading it and if so I apologize. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the response. I had never read anything about those miracles, so I did a quick Wikipedia search on all 3 and found them to be quite interesting, especially the Miracles of Lourdes. I&amp;#39;m not quite sure about your point on the odds of it all though, why do you believe that in different circumstances you would still exist? I think I may be misreading it and if so I apologize. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgekmcn", "score_hidden": false, "stickied": false, "created": 1492512161.0, "created_utc": 1492483361.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeis9j", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgeh9v4", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Well I am new at this. But as an atheist a big problem was that you could make the bible say anything you want to. Or how \"it's in the bible\" is the biggest response. In the Catholic Church you just don't have that.\n\nBut when it comes to God. You have people desperately trying to prove that he exists, and people desperately trying to prove he doesn't. You can find a way for rational thinking to say he does exist or he doesn't. So let's start with what we do have.\n\n* The Bible\n\n* The Church\n\n* The History of the Jews and then Christianity\n\nThese are all evidence of something. It's like if you have a thousand people on a ship who all at once say they saw a humongous sea serpent, it's not only a claim, but also evidence. \n\nSo we know this is different from Santa Claus. Now I want to talk about two things, consciousness and philosophy.\n\nConsciousness is a huge problem. It's not just that we can think and make actions and our actions use thought as a medium. But you are you and I am I. Looking at chaos theory, if a single thing before your conception was different, you would not exist. This means there is a 1/100000000etc chance of you existing. \n\nWhat convinced me of being an agnostic, is that's a little too steep of a number for me to be alive right now. And the concept of a soul different from a body, but attached to one, makes a lot of sense. If a different sperm and egg could result in still a me, then there has to be something else. Otherwise it is near impossible that I am me. \n\nSecondly with philosophy, in the 1800s especially everyone talked about a lack of meaning. This was solved in various ways. From religion to Nietzsche many views, but what convinced me was Camus. He said that religion negated the problem of suicide. But if religion is correct then it solves it.\n\nReligion is a piece that solves philosophy. It gives meaning. For all of our desires there is something that can fill it, except the longing for meaning. Through Christianity God can fulfill this.\n\nFinally there are various miracles that have gone unexplained. Like the miracle of the sun, miraculous healings of lourdes, and even our lady of guadalupe have resulted in some pretty incredible things. Also take into account that the Catholic church is the longest surviving organization for 2000 years, and despite having awful terrible popes at times, a pope has never thrown the church off course. Not once has a doctrine on faith or morality changed.  \n\nFor me you have to look at the implications of things. You look at  the world, yourself, consciousness, philosophy, and it all implies something that we are missing. There is just something that we are missing. Something that philosophy since even before Taoism has acknowledged. If there is something missing, then it implies there is something to fill it. (A hole in a wall doesn't necessarily mean something is missing, but a missing puzzle piece implies something to fulfill that). And once we believe that \"There just has to be something more, something else\" it can either be something we don't know, or something we do know. If it's something we don't know, we cannot act on that and it's mostly up to fate. If it's something we do know, then our entire life is supposed to change. Now we have a bunch of religions. And I think the ones that make most sense are Islam and Christianity (as far as being able to fill that void). And looking at the arguments between the two I found Christianity to make the most sense. \n\nThis is a bad explanation of my entire thought process and various logical arguments that allowed me to believe. Are there any things you specifically have trouble with? I'd love to talk with you further about this because I was an atheist who after founding Christ found a lot of anxiety taken away. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I am new at this. But as an atheist a big problem was that you could make the bible say anything you want to. Or how &amp;quot;it&amp;#39;s in the bible&amp;quot; is the biggest response. In the Catholic Church you just don&amp;#39;t have that.&lt;/p&gt;\n\n&lt;p&gt;But when it comes to God. You have people desperately trying to prove that he exists, and people desperately trying to prove he doesn&amp;#39;t. You can find a way for rational thinking to say he does exist or he doesn&amp;#39;t. So let&amp;#39;s start with what we do have.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;The Bible&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The Church&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The History of the Jews and then Christianity&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;These are all evidence of something. It&amp;#39;s like if you have a thousand people on a ship who all at once say they saw a humongous sea serpent, it&amp;#39;s not only a claim, but also evidence. &lt;/p&gt;\n\n&lt;p&gt;So we know this is different from Santa Claus. Now I want to talk about two things, consciousness and philosophy.&lt;/p&gt;\n\n&lt;p&gt;Consciousness is a huge problem. It&amp;#39;s not just that we can think and make actions and our actions use thought as a medium. But you are you and I am I. Looking at chaos theory, if a single thing before your conception was different, you would not exist. This means there is a 1/100000000etc chance of you existing. &lt;/p&gt;\n\n&lt;p&gt;What convinced me of being an agnostic, is that&amp;#39;s a little too steep of a number for me to be alive right now. And the concept of a soul different from a body, but attached to one, makes a lot of sense. If a different sperm and egg could result in still a me, then there has to be something else. Otherwise it is near impossible that I am me. &lt;/p&gt;\n\n&lt;p&gt;Secondly with philosophy, in the 1800s especially everyone talked about a lack of meaning. This was solved in various ways. From religion to Nietzsche many views, but what convinced me was Camus. He said that religion negated the problem of suicide. But if religion is correct then it solves it.&lt;/p&gt;\n\n&lt;p&gt;Religion is a piece that solves philosophy. It gives meaning. For all of our desires there is something that can fill it, except the longing for meaning. Through Christianity God can fulfill this.&lt;/p&gt;\n\n&lt;p&gt;Finally there are various miracles that have gone unexplained. Like the miracle of the sun, miraculous healings of lourdes, and even our lady of guadalupe have resulted in some pretty incredible things. Also take into account that the Catholic church is the longest surviving organization for 2000 years, and despite having awful terrible popes at times, a pope has never thrown the church off course. Not once has a doctrine on faith or morality changed.  &lt;/p&gt;\n\n&lt;p&gt;For me you have to look at the implications of things. You look at  the world, yourself, consciousness, philosophy, and it all implies something that we are missing. There is just something that we are missing. Something that philosophy since even before Taoism has acknowledged. If there is something missing, then it implies there is something to fill it. (A hole in a wall doesn&amp;#39;t necessarily mean something is missing, but a missing puzzle piece implies something to fulfill that). And once we believe that &amp;quot;There just has to be something more, something else&amp;quot; it can either be something we don&amp;#39;t know, or something we do know. If it&amp;#39;s something we don&amp;#39;t know, we cannot act on that and it&amp;#39;s mostly up to fate. If it&amp;#39;s something we do know, then our entire life is supposed to change. Now we have a bunch of religions. And I think the ones that make most sense are Islam and Christianity (as far as being able to fill that void). And looking at the arguments between the two I found Christianity to make the most sense. &lt;/p&gt;\n\n&lt;p&gt;This is a bad explanation of my entire thought process and various logical arguments that allowed me to believe. Are there any things you specifically have trouble with? I&amp;#39;d love to talk with you further about this because I was an atheist who after founding Christ found a lot of anxiety taken away. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeis9j", "score_hidden": false, "stickied": false, "created": 1492509977.0, "created_utc": 1492481177.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgekz4u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "syfKOG", "parent_id": "t1_dgeh9v4", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "IMHO, travel on, explore, discover, enjoy the journey. Thank you for sharing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IMHO, travel on, explore, discover, enjoy the journey. Thank you for sharing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgekz4u", "score_hidden": false, "stickied": false, "created": 1492512598.0, "created_utc": 1492483798.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgejj84", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gdizzle01", "parent_id": "t1_dgeh9v4", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Before I begin, may I say that God has wonderful plans for you if you are willing to accept Him into your heart as your personal Lord and Savior. From what you've said here, I think that God has been waiting for you to come to Him and has plans for your life. I am obviously not the atheist-turned-Christian that you were asking to respond (and I'm sure that he would have a much more convincing testimony than me) and therefore I can't really help much to convince you to be a Christian, but here's my thoughts on actually becoming a Christian to help you out in that aspect: Although Christianity can help with anxiety and ultimately help you find peace, the way you find that peace is through faith in Christ. The first step in doing this would be to accept Jesus (as I mentioned earlier). If you would so choose to accept Him (which I pray that you do), then it's your job to grow closer to Him. Some simple examples of this would be praying, reading the Bible (I'd recommend starting with the book of Luke), joining a church, etc. I know it sounds cliche, but that's what I got for you. I just think of it like this: Jesus made the ultimate sacrifice of dying in the most brutal way possible just so that we may live forever if we believe in Him and the sacrifice He made for us. Maybe this helped, maybe it didn't, but I hope that one day you will one day find God and fulfill the great plans that he has in store for you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Before I begin, may I say that God has wonderful plans for you if you are willing to accept Him into your heart as your personal Lord and Savior. From what you&amp;#39;ve said here, I think that God has been waiting for you to come to Him and has plans for your life. I am obviously not the atheist-turned-Christian that you were asking to respond (and I&amp;#39;m sure that he would have a much more convincing testimony than me) and therefore I can&amp;#39;t really help much to convince you to be a Christian, but here&amp;#39;s my thoughts on actually becoming a Christian to help you out in that aspect: Although Christianity can help with anxiety and ultimately help you find peace, the way you find that peace is through faith in Christ. The first step in doing this would be to accept Jesus (as I mentioned earlier). If you would so choose to accept Him (which I pray that you do), then it&amp;#39;s your job to grow closer to Him. Some simple examples of this would be praying, reading the Bible (I&amp;#39;d recommend starting with the book of Luke), joining a church, etc. I know it sounds cliche, but that&amp;#39;s what I got for you. I just think of it like this: Jesus made the ultimate sacrifice of dying in the most brutal way possible just so that we may live forever if we believe in Him and the sacrifice He made for us. Maybe this helped, maybe it didn&amp;#39;t, but I hope that one day you will one day find God and fulfill the great plans that he has in store for you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgejj84", "score_hidden": false, "stickied": false, "created": 1492510845.0, "created_utc": 1492482045.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeh9v4", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Red_Idiot", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Hi, sorry to bother you, but I am an atheist and I would like to know what convinced you. I would really like to become a Christian because it would get rid of most of my anxiety, but I grew up in an anti-theist household and don't know if I could ever believe. I'm not a troll or looking to debate, just trying to understand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi, sorry to bother you, but I am an atheist and I would like to know what convinced you. I would really like to become a Christian because it would get rid of most of my anxiety, but I grew up in an anti-theist household and don&amp;#39;t know if I could ever believe. I&amp;#39;m not a troll or looking to debate, just trying to understand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeh9v4", "score_hidden": false, "stickied": false, "created": 1492508182.0, "created_utc": 1492479382.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgeoswi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Okcupidissumb", "parent_id": "t1_dgejar7", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Nothing radical about Christianity.\n\nPaul's letters indicate the Jesus stuff comes from \"the Scriptures\" aka the Septuagint.\n\nSeptuagint version of Zechariah 3 and 6 gives the exact name of Jesus, him confronting Satan and being crowned king in heaven.\n\nDaniel 9 describes a messiah dying before the end of the world.\n\nIsaiah 52-53 describes the cleansing of the world's sins by the death of a servant.\n\nPsalm 22-24, which Mark copies the language of, describes the 3 day death-resurrection cycle.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nothing radical about Christianity.&lt;/p&gt;\n\n&lt;p&gt;Paul&amp;#39;s letters indicate the Jesus stuff comes from &amp;quot;the Scriptures&amp;quot; aka the Septuagint.&lt;/p&gt;\n\n&lt;p&gt;Septuagint version of Zechariah 3 and 6 gives the exact name of Jesus, him confronting Satan and being crowned king in heaven.&lt;/p&gt;\n\n&lt;p&gt;Daniel 9 describes a messiah dying before the end of the world.&lt;/p&gt;\n\n&lt;p&gt;Isaiah 52-53 describes the cleansing of the world&amp;#39;s sins by the death of a servant.&lt;/p&gt;\n\n&lt;p&gt;Psalm 22-24, which Mark copies the language of, describes the 3 day death-resurrection cycle.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeoswi", "score_hidden": false, "stickied": false, "created": 1492517906.0, "created_utc": 1492489106.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgepbt2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gnurdette", "parent_id": "t1_dgejar7", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "I think some people think of liturgy as stiff, formal and inauthentic; and I think that POV was more common in past decades, when many liturgical churches were full of people going through the motions mostly out of tradition.  You can imagine that a building full of bored people plowing through a liturgy they didn't particularly believe would not feel very spiritually powerful.  That, I think, formed many people's impression of liturgy.\n\nNow that people who don't believe no longer feel obligated to show up and punch a time card, it's easier to feel the power of the experience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think some people think of liturgy as stiff, formal and inauthentic; and I think that POV was more common in past decades, when many liturgical churches were full of people going through the motions mostly out of tradition.  You can imagine that a building full of bored people plowing through a liturgy they didn&amp;#39;t particularly believe would not feel very spiritually powerful.  That, I think, formed many people&amp;#39;s impression of liturgy.&lt;/p&gt;\n\n&lt;p&gt;Now that people who don&amp;#39;t believe no longer feel obligated to show up and punch a time card, it&amp;#39;s easier to feel the power of the experience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgepbt2", "score_hidden": true, "stickied": false, "created": 1492518715.0, "created_utc": 1492489915.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgejar7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgeiey5", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Oh yes! I think if I wasn't Catholic or Orthodox I'd be Anglican. I came very close to becoming episcopal as I wanted to go to church there for about 6 months, but could never bring myself to it (just out of anxiety). I think that the lack of liturgy and tradition as a whole has in a way crippled the growth of Christianity in the united states. How does one become devout as the religion itself becomes dumbed down? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh yes! I think if I wasn&amp;#39;t Catholic or Orthodox I&amp;#39;d be Anglican. I came very close to becoming episcopal as I wanted to go to church there for about 6 months, but could never bring myself to it (just out of anxiety). I think that the lack of liturgy and tradition as a whole has in a way crippled the growth of Christianity in the united states. How does one become devout as the religion itself becomes dumbed down? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgejar7", "score_hidden": false, "stickied": false, "created": 1492510568.0, "created_utc": 1492481768.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeiey5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "barbecuedporkribs", "parent_id": "t1_dgehksu", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Your story sounds a little like mine. I became atheist in college and stayed that way for fifteen years. I visited an Episcopal church just out of a weird curiosity (a \"tug,\" I remember calling it, while my priest called it the Holy Spirit) and the liturgy just grabbed me by both lapels. It was a few months before I knew for sure I was a Christian, but when the realization hit me, again, it was the liturgy (this time, the creed) that called my attention to what had happened to me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your story sounds a little like mine. I became atheist in college and stayed that way for fifteen years. I visited an Episcopal church just out of a weird curiosity (a &amp;quot;tug,&amp;quot; I remember calling it, while my priest called it the Holy Spirit) and the liturgy just grabbed me by both lapels. It was a few months before I knew for sure I was a Christian, but when the realization hit me, again, it was the liturgy (this time, the creed) that called my attention to what had happened to me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeiey5", "score_hidden": false, "stickied": false, "created": 1492509554.0, "created_utc": 1492480754.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgeoolg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AbsoluteElsewhere", "parent_id": "t1_dgeocea", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "I'm lucky enough to attend a Methodist church that has good liturgy, though we only do communion once a month plus special services.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m lucky enough to attend a Methodist church that has good liturgy, though we only do communion once a month plus special services.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeoolg", "score_hidden": false, "stickied": false, "created": 1492517734.0, "created_utc": 1492488934.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeocea", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gnurdette", "parent_id": "t1_dgehksu", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "&gt; I went to a methodist church, and it seemed so void. It was older people who sang a few hymns, said a prayer, and read a few verses. The Sermon mentioned Jesus once. And before that there was a mini-sermon for children who would run up and listen, and it didn't seem to have anything to do with Christ. It was a service on \"how to be a better person.\"\n\nI'm bummed that we blew our chance with you, but I'm grateful that you kept checking out Christianity in general.\n\nI've heard some amazing Methodist preaching, but also some really mediocre stuff.  And our liturgy is flat-out feeble, no arguments there.  It's one reason I get to an Episcopal church when I can.  (There isn't one where I live.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I went to a methodist church, and it seemed so void. It was older people who sang a few hymns, said a prayer, and read a few verses. The Sermon mentioned Jesus once. And before that there was a mini-sermon for children who would run up and listen, and it didn&amp;#39;t seem to have anything to do with Christ. It was a service on &amp;quot;how to be a better person.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m bummed that we blew our chance with you, but I&amp;#39;m grateful that you kept checking out Christianity in general.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve heard some amazing Methodist preaching, but also some really mediocre stuff.  And our liturgy is flat-out feeble, no arguments there.  It&amp;#39;s one reason I get to an Episcopal church when I can.  (There isn&amp;#39;t one where I live.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeocea", "score_hidden": false, "stickied": false, "created": 1492517233.0, "created_utc": 1492488433.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgehksu", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgeguvh", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Well it began with a lot of different things. Various philosophical arguments. Various logic. But in all honesty it was a process of many things. \n\nI spoke to a priest randomly and he told me about the Catholic Church, and some of the cool things pope Francis has been doing (such as instructing us to protect the environment). Then for the next six months after that I constantly saw God in places. From a Christian character on a TV show or a campus missionary approaching me (he was ridiculously evangelical, I wouldn't have thrived in it).\n\nBut ultimately though I just felt empty. I felt like life had no meaning and even if I solved every political problem that matters to me, if I became famous, or make millions, in the end it doesn't matter. And it kind of wore on me, especially whenever bad things would happen. \n\nI started reading John, and I liked how radical Christianity is. I grew very weary during the election due to so much anger and hatred. And seeing unconditional love, and seeing a call to not be angry. I saw a call to help others and it really resonated with me. It seemed to have a missing piece that no other philosophy and religion has. It gave me purpose and I prayed a lot and found so much hope, love, and peace along the way.\n\nI went to a methodist church, and it seemed so void. It was older people who sang a few hymns, said a prayer, and read a few verses. The Sermon mentioned Jesus once. And before that there was a mini-sermon for children who would run up and listen, and it didn't seem to have anything to do with Christ. It was a service on \"how to be a better person.\"\n\nI started to long for him and he was missing in that service. I kind of felt a despair, I longed for Jesus and it felt like he wasn't real after that. Well the next Sunday I got invited to a mass. And the gloria hit and it was so beautiful. People had to stand because it was so full. Everything seemed so communal, so many call and responses, the readings, the psalm. The hymns. Then during the Eucharist I just loved seeing it, I loved going up every though I couldn't receive. I longed so much to find Jesus, and there I found him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well it began with a lot of different things. Various philosophical arguments. Various logic. But in all honesty it was a process of many things. &lt;/p&gt;\n\n&lt;p&gt;I spoke to a priest randomly and he told me about the Catholic Church, and some of the cool things pope Francis has been doing (such as instructing us to protect the environment). Then for the next six months after that I constantly saw God in places. From a Christian character on a TV show or a campus missionary approaching me (he was ridiculously evangelical, I wouldn&amp;#39;t have thrived in it).&lt;/p&gt;\n\n&lt;p&gt;But ultimately though I just felt empty. I felt like life had no meaning and even if I solved every political problem that matters to me, if I became famous, or make millions, in the end it doesn&amp;#39;t matter. And it kind of wore on me, especially whenever bad things would happen. &lt;/p&gt;\n\n&lt;p&gt;I started reading John, and I liked how radical Christianity is. I grew very weary during the election due to so much anger and hatred. And seeing unconditional love, and seeing a call to not be angry. I saw a call to help others and it really resonated with me. It seemed to have a missing piece that no other philosophy and religion has. It gave me purpose and I prayed a lot and found so much hope, love, and peace along the way.&lt;/p&gt;\n\n&lt;p&gt;I went to a methodist church, and it seemed so void. It was older people who sang a few hymns, said a prayer, and read a few verses. The Sermon mentioned Jesus once. And before that there was a mini-sermon for children who would run up and listen, and it didn&amp;#39;t seem to have anything to do with Christ. It was a service on &amp;quot;how to be a better person.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I started to long for him and he was missing in that service. I kind of felt a despair, I longed for Jesus and it felt like he wasn&amp;#39;t real after that. Well the next Sunday I got invited to a mass. And the gloria hit and it was so beautiful. People had to stand because it was so full. Everything seemed so communal, so many call and responses, the readings, the psalm. The hymns. Then during the Eucharist I just loved seeing it, I loved going up every though I couldn&amp;#39;t receive. I longed so much to find Jesus, and there I found him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgehksu", "score_hidden": false, "stickied": false, "created": 1492508547.0, "created_utc": 1492479747.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeguvh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "number9muses", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "What caused you to believe?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What caused you to believe?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeguvh", "score_hidden": false, "stickied": false, "created": 1492507659.0, "created_utc": 1492478859.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgeju4a", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "throwawayCath9013", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Congrats and welcome :) My friend who I had the privildge of being a sponsor for was also confirmed and received his first communion. Participating in RCIA (even just as a sponsor) and seeing all of the lead up to the Vigil Service was very beautiful and extremely powerful. It was definitely spiritually renewing.\n\nI am glad you have found your spiritual footing and thank you for sharing your testimony :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congrats and welcome :) My friend who I had the privildge of being a sponsor for was also confirmed and received his first communion. Participating in RCIA (even just as a sponsor) and seeing all of the lead up to the Vigil Service was very beautiful and extremely powerful. It was definitely spiritually renewing.&lt;/p&gt;\n\n&lt;p&gt;I am glad you have found your spiritual footing and thank you for sharing your testimony :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeju4a", "score_hidden": false, "stickied": false, "created": 1492511202.0, "created_utc": 1492482402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgeprfh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgeodxr", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "The word used for elder is presbyter, which is an ordained role. Early texts of Christianity confirms this. \n\nI was pointing out that presbyters had a role different from everyone else, this is where we get the sacrament of the anointing of the sick.  \n\nMiracles in the Catholic church are pretty widespread and common. In the bible it seems like miracles are extremely common, but they aren't. As we often times forget about the masses who didn't perform or witness miracles, but merely heart about them. But in the Catholic church miracles are seen all the time. Padre Pio was a priest who had many accounts of miracles. There were countless stories of healings, the miracle of the sun, or our lady of guadalupe. There have been eucharistic miracles where supposedly the eucharist has turned into flesh in front of many. In fact every time that has happened, it's been a tissue from heart that was taken while someone was alive, and has all been of the same blood type. There also has been prophecy in the Catholic church. So it's kind of hard to attack that point. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The word used for elder is presbyter, which is an ordained role. Early texts of Christianity confirms this. &lt;/p&gt;\n\n&lt;p&gt;I was pointing out that presbyters had a role different from everyone else, this is where we get the sacrament of the anointing of the sick.  &lt;/p&gt;\n\n&lt;p&gt;Miracles in the Catholic church are pretty widespread and common. In the bible it seems like miracles are extremely common, but they aren&amp;#39;t. As we often times forget about the masses who didn&amp;#39;t perform or witness miracles, but merely heart about them. But in the Catholic church miracles are seen all the time. Padre Pio was a priest who had many accounts of miracles. There were countless stories of healings, the miracle of the sun, or our lady of guadalupe. There have been eucharistic miracles where supposedly the eucharist has turned into flesh in front of many. In fact every time that has happened, it&amp;#39;s been a tissue from heart that was taken while someone was alive, and has all been of the same blood type. There also has been prophecy in the Catholic church. So it&amp;#39;s kind of hard to attack that point. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeprfh", "score_hidden": true, "stickied": false, "created": 1492519399.0, "created_utc": 1492490599.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeodxr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RedneckT", "parent_id": "t1_dgent6j", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Right, Jesus gave them the gifts of the Holy Spirit there in John 20. Perhaps there's a different meaning here, but we'll just take it at face value. This is where me and you will encounter a disagreement in doctrine. I do not believe that these gifts were passed down until today. I think they died out sometime in the first (or perhaps second) century. Because of this, I do not believe priests have the ability to forgive sins. Also, where does that leave all of the other gifts? Why aren't people prophesying or performing such obvious miracles that we see in the Bible?\n\nElders. Right. So, an elder is just a more seasoned Christian. A faithful servant of Christ that is appointed by the church. Yes, I think churches need this wisdom, guidance, and faith that they can provide. I do not think that a priest and an elder are the same thing.\n\nAs for your passage from James: it specifically says that by their prayers he will be saved. They're praying and asking God to save him. Not so that they can save him. It says the Lord will lift him up and then mentions forgiveness. Following the grammar, this forgiving of sins would appear to be done by the most recent person mentioned, The Lord.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right, Jesus gave them the gifts of the Holy Spirit there in John 20. Perhaps there&amp;#39;s a different meaning here, but we&amp;#39;ll just take it at face value. This is where me and you will encounter a disagreement in doctrine. I do not believe that these gifts were passed down until today. I think they died out sometime in the first (or perhaps second) century. Because of this, I do not believe priests have the ability to forgive sins. Also, where does that leave all of the other gifts? Why aren&amp;#39;t people prophesying or performing such obvious miracles that we see in the Bible?&lt;/p&gt;\n\n&lt;p&gt;Elders. Right. So, an elder is just a more seasoned Christian. A faithful servant of Christ that is appointed by the church. Yes, I think churches need this wisdom, guidance, and faith that they can provide. I do not think that a priest and an elder are the same thing.&lt;/p&gt;\n\n&lt;p&gt;As for your passage from James: it specifically says that by their prayers he will be saved. They&amp;#39;re praying and asking God to save him. Not so that they can save him. It says the Lord will lift him up and then mentions forgiveness. Following the grammar, this forgiving of sins would appear to be done by the most recent person mentioned, The Lord.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeodxr", "score_hidden": false, "stickied": false, "created": 1492517298.0, "created_utc": 1492488498.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgent6j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgemsvk", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Actually it does say they can forgive sins.\n\nJohn 20:23 \"If you forgive the sins of any, they are forgiven; if you retain the sins of any, they are retained.”\n\nJames 5:14-15 \"Let him call for the elders of the church, and let them pray over him, anointing him with oil in the name of the Lord; 15 and the prayer of faith will save the sick man, and the Lord will raise him up; and if he has committed sins, he will be forgiven.\" \n\nThis shows the importance of the elders (Priests are the same things as elders). The apostles could forgive sins, the apostles also grew in number. They appointed elders, and the elders seemed to have something a little bit different than the laity. Why would James say \"elder\" and not \"a member of the church\" or \"someone in high regard in the church.\" It's clear throughout the bible that the priests/elders/presbyters play a different role than everyone else.\n\nThe problem though is other churches to us catholics have fallen away from the truth. At a certain point after cutting things out, you fall away.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually it does say they can forgive sins.&lt;/p&gt;\n\n&lt;p&gt;John 20:23 &amp;quot;If you forgive the sins of any, they are forgiven; if you retain the sins of any, they are retained.”&lt;/p&gt;\n\n&lt;p&gt;James 5:14-15 &amp;quot;Let him call for the elders of the church, and let them pray over him, anointing him with oil in the name of the Lord; 15 and the prayer of faith will save the sick man, and the Lord will raise him up; and if he has committed sins, he will be forgiven.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;This shows the importance of the elders (Priests are the same things as elders). The apostles could forgive sins, the apostles also grew in number. They appointed elders, and the elders seemed to have something a little bit different than the laity. Why would James say &amp;quot;elder&amp;quot; and not &amp;quot;a member of the church&amp;quot; or &amp;quot;someone in high regard in the church.&amp;quot; It&amp;#39;s clear throughout the bible that the priests/elders/presbyters play a different role than everyone else.&lt;/p&gt;\n\n&lt;p&gt;The problem though is other churches to us catholics have fallen away from the truth. At a certain point after cutting things out, you fall away.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgent6j", "score_hidden": false, "stickied": false, "created": 1492516434.0, "created_utc": 1492487634.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemsvk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RedneckT", "parent_id": "t1_dgemg14", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "I get that we are to give out best to God. I think there's a difference to that when everything around it may literally be falling apart but there is a spotless and shiny cathedral in the town square. I also think it's more about what I or you give to God, not what the Catholic Church gives. Sure we can give as a group and help and work as a church, but as for our offering to God, it's between me and God.\n\nAlso we are told to confess to each other. It doesn't say to confess to a trained priest. It says each other. And it doesn't say to confess so that they will forgive our sins, because we can't do that. Only God can do that.\n\nI specifically stated churches that you agree with in doctrine and all. Not \"bad\" churches which have fallen away from the Truth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get that we are to give out best to God. I think there&amp;#39;s a difference to that when everything around it may literally be falling apart but there is a spotless and shiny cathedral in the town square. I also think it&amp;#39;s more about what I or you give to God, not what the Catholic Church gives. Sure we can give as a group and help and work as a church, but as for our offering to God, it&amp;#39;s between me and God.&lt;/p&gt;\n\n&lt;p&gt;Also we are told to confess to each other. It doesn&amp;#39;t say to confess to a trained priest. It says each other. And it doesn&amp;#39;t say to confess so that they will forgive our sins, because we can&amp;#39;t do that. Only God can do that.&lt;/p&gt;\n\n&lt;p&gt;I specifically stated churches that you agree with in doctrine and all. Not &amp;quot;bad&amp;quot; churches which have fallen away from the Truth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgemsvk", "score_hidden": false, "stickied": false, "created": 1492514990.0, "created_utc": 1492486190.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemg14", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgelqp3", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Well with confession I meant how it's wide spread and commonplace. I believe most churches you can go and confess. But it's certainly not common. And there is a difference in confessing to a friend, and confessing with someone who has been trained for that. With friends it can be very hard to be sincere and honest, but with a priest you can really dig deep down in what you regret and are ashamed and be granted that forgiveness and given that peace. It's incredible.\n\nWhen it comes to the gold and cathedrals. We could scrap everything and give it to the poor absolutely. But when Jesus was anointed with oil that cost about a years worth of wages, Judas (yes that Judas) condemned the woman who was doing so and requested it be sold so the money could be given to the poor (which as the treasurer, he would have been able to keep it). Jesus then scolded him and said \"the poor will always be among you.\" Combine this with historical worship not just with Christianity but with Jews. Money should not be diverted from the poor to pay for these things. But there is nothing wrong with helping the poor and offering our best in honor of God. Because we do things like incense and expensive oils as a way of giving God our all. \n\nIn addition things like these have attracted many people to Christ. Including myself. Seeing Cathedrals, the traditions, and all that is ornate made me see it as something more serious. Consider the ceiling of the Sistine chapel. It's basically a big way of honoring God. But the Catholic church is one of the largest charities in both volunteer time and money donated. The Church does an incredible amount of Good too.\n\nI think some churches will be better than others. I think it's entirely possible to have a bad church. And since the Catholic Church believes itself to have an authority beyond other churches, it's kind of hard to see ourselves as one of everyone else. Since that's not our belief. \n\nThere are a lot of cultural catholics, and some weird traditions in latin america, asia and africa. But ultimately it is united. The universalness of the church comes from it not being a church just of the jews, not of the rich, not of the men, it's a church for everyone. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well with confession I meant how it&amp;#39;s wide spread and commonplace. I believe most churches you can go and confess. But it&amp;#39;s certainly not common. And there is a difference in confessing to a friend, and confessing with someone who has been trained for that. With friends it can be very hard to be sincere and honest, but with a priest you can really dig deep down in what you regret and are ashamed and be granted that forgiveness and given that peace. It&amp;#39;s incredible.&lt;/p&gt;\n\n&lt;p&gt;When it comes to the gold and cathedrals. We could scrap everything and give it to the poor absolutely. But when Jesus was anointed with oil that cost about a years worth of wages, Judas (yes that Judas) condemned the woman who was doing so and requested it be sold so the money could be given to the poor (which as the treasurer, he would have been able to keep it). Jesus then scolded him and said &amp;quot;the poor will always be among you.&amp;quot; Combine this with historical worship not just with Christianity but with Jews. Money should not be diverted from the poor to pay for these things. But there is nothing wrong with helping the poor and offering our best in honor of God. Because we do things like incense and expensive oils as a way of giving God our all. &lt;/p&gt;\n\n&lt;p&gt;In addition things like these have attracted many people to Christ. Including myself. Seeing Cathedrals, the traditions, and all that is ornate made me see it as something more serious. Consider the ceiling of the Sistine chapel. It&amp;#39;s basically a big way of honoring God. But the Catholic church is one of the largest charities in both volunteer time and money donated. The Church does an incredible amount of Good too.&lt;/p&gt;\n\n&lt;p&gt;I think some churches will be better than others. I think it&amp;#39;s entirely possible to have a bad church. And since the Catholic Church believes itself to have an authority beyond other churches, it&amp;#39;s kind of hard to see ourselves as one of everyone else. Since that&amp;#39;s not our belief. &lt;/p&gt;\n\n&lt;p&gt;There are a lot of cultural catholics, and some weird traditions in latin america, asia and africa. But ultimately it is united. The universalness of the church comes from it not being a church just of the jews, not of the rich, not of the men, it&amp;#39;s a church for everyone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgemg14", "score_hidden": false, "stickied": false, "created": 1492514503.0, "created_utc": 1492485703.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgelqp3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedneckT", "parent_id": "t1_dgekxtd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "I get what you're saying on some, but other times I don't agree.\n\nIf someone in a church doesn't have a friend or mentor they can confess things to privately (or sometimes publicly), then they aren't in the right place or possibly aren't looking or asking enough. Confession is not only possible in a cubicle with an anonymous priest and it is certainly not copyrighted by the Catholic Church.\n\nI understand the pride of the church and being thankful for the church and its gifts. However, I think many people cross a very dangerous line when their church is better than another. Sure there may be differences, but if you agree with another church or denomination theologically, I probably wouldn't enter the realm of putting their church down or yours higher.\n\nWhere I am from a lot of people see the Catholic cathedrals as these massive, beautiful, and historic buildings. Adorned with gold, they think of the good that could have been done with the money and resources put into the building itself instead of the church (...the people).\n\nAnd then there's this weird idea that Catholicism is exactly the same all around the world. I think not. Where I am, there is Saint Death while other places there is not. Some claim she has been condemned by the Catholic Church and that she is an idol. I find that interesting when there are so many other \"saints\" in the Catholic Church, yet they aren't idols. There are several other differences that I just don't understand while it is the \"one universal\" church.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get what you&amp;#39;re saying on some, but other times I don&amp;#39;t agree.&lt;/p&gt;\n\n&lt;p&gt;If someone in a church doesn&amp;#39;t have a friend or mentor they can confess things to privately (or sometimes publicly), then they aren&amp;#39;t in the right place or possibly aren&amp;#39;t looking or asking enough. Confession is not only possible in a cubicle with an anonymous priest and it is certainly not copyrighted by the Catholic Church.&lt;/p&gt;\n\n&lt;p&gt;I understand the pride of the church and being thankful for the church and its gifts. However, I think many people cross a very dangerous line when their church is better than another. Sure there may be differences, but if you agree with another church or denomination theologically, I probably wouldn&amp;#39;t enter the realm of putting their church down or yours higher.&lt;/p&gt;\n\n&lt;p&gt;Where I am from a lot of people see the Catholic cathedrals as these massive, beautiful, and historic buildings. Adorned with gold, they think of the good that could have been done with the money and resources put into the building itself instead of the church (...the people).&lt;/p&gt;\n\n&lt;p&gt;And then there&amp;#39;s this weird idea that Catholicism is exactly the same all around the world. I think not. Where I am, there is Saint Death while other places there is not. Some claim she has been condemned by the Catholic Church and that she is an idol. I find that interesting when there are so many other &amp;quot;saints&amp;quot; in the Catholic Church, yet they aren&amp;#39;t idols. There are several other differences that I just don&amp;#39;t understand while it is the &amp;quot;one universal&amp;quot; church.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgelqp3", "score_hidden": false, "stickied": false, "created": 1492513592.0, "created_utc": 1492484792.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekxtd", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgekack", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "I more or less mean that Catholicism places being devout in very high regard. Catholicism is the largest denomination. So there will be more devout Catholics, rather than baptists, or presbyterian.\n\nIf you take 5 devout Christians and 2 are Catholic and the other 3 are different protestant denominations. Then it will look like there are more catholics than there should be.  \n\nAs far as the pride of being catholic being not great. I think it's not out of the same kind of nationalism or patriotism you might see. While the church doesn't really think there should be other denominations and we should all be united (Because everyone basically broke off from it, and we were first). I think a lot of the pride comes from how much we love the \"gifts\" of the church. \n\nThe Catholic Church offers more \"things\" than any other church. We have the real presence, adoration, the rosary, the cathedrals, the history, confession, etc. Not that other churches don't have a lot to offer. But many people are really grateful for these things. I fell in love with confession. And it's something I am so happy to be a catholic for! I can't really get that same experience in a baptist church. Or the campus ministry, it's one of the few at my campus and it's incredible. \n\nI know some people have a pride that is similar to loving a sports team or loving your country in vain. But a lot of it is a deep deep gratitude for the church. Because a lot of us know where we would be without it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I more or less mean that Catholicism places being devout in very high regard. Catholicism is the largest denomination. So there will be more devout Catholics, rather than baptists, or presbyterian.&lt;/p&gt;\n\n&lt;p&gt;If you take 5 devout Christians and 2 are Catholic and the other 3 are different protestant denominations. Then it will look like there are more catholics than there should be.  &lt;/p&gt;\n\n&lt;p&gt;As far as the pride of being catholic being not great. I think it&amp;#39;s not out of the same kind of nationalism or patriotism you might see. While the church doesn&amp;#39;t really think there should be other denominations and we should all be united (Because everyone basically broke off from it, and we were first). I think a lot of the pride comes from how much we love the &amp;quot;gifts&amp;quot; of the church. &lt;/p&gt;\n\n&lt;p&gt;The Catholic Church offers more &amp;quot;things&amp;quot; than any other church. We have the real presence, adoration, the rosary, the cathedrals, the history, confession, etc. Not that other churches don&amp;#39;t have a lot to offer. But many people are really grateful for these things. I fell in love with confession. And it&amp;#39;s something I am so happy to be a catholic for! I can&amp;#39;t really get that same experience in a baptist church. Or the campus ministry, it&amp;#39;s one of the few at my campus and it&amp;#39;s incredible. &lt;/p&gt;\n\n&lt;p&gt;I know some people have a pride that is similar to loving a sports team or loving your country in vain. But a lot of it is a deep deep gratitude for the church. Because a lot of us know where we would be without it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgekxtd", "score_hidden": false, "stickied": false, "created": 1492512554.0, "created_utc": 1492483754.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgemw7l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SnakeGandhi", "parent_id": "t1_dgemu6b", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Perfect! And those people, arranged in groups doctrinally, would you perhaps call those...denominations? I think we are in agreement! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perfect! And those people, arranged in groups doctrinally, would you perhaps call those...denominations? I think we are in agreement! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgemw7l", "score_hidden": false, "stickied": false, "created": 1492515118.0, "created_utc": 1492486318.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemu6b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedneckT", "parent_id": "t1_dgemhyq", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Uh... people?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uh... people?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgemu6b", "score_hidden": false, "stickied": false, "created": 1492515041.0, "created_utc": 1492486241.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemhyq", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SnakeGandhi", "parent_id": "t1_dgelvqr", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Oh yeah smarty-pants? Well what was it objectively talking about? \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh yeah smarty-pants? Well what was it objectively talking about? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgemhyq", "score_hidden": false, "stickied": false, "created": 1492514576.0, "created_utc": 1492485776.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgelvqr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedneckT", "parent_id": "t1_dgel5t5", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Pretty sure that verse wasn't talking about rooms for denominations. Lol.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pretty sure that verse wasn&amp;#39;t talking about rooms for denominations. Lol.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgelvqr", "score_hidden": false, "stickied": false, "created": 1492513771.0, "created_utc": 1492484971.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgel5t5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SnakeGandhi", "parent_id": "t1_dgekvxb", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "There are many rooms in my father's house. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are many rooms in my father&amp;#39;s house. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgel5t5", "score_hidden": false, "stickied": false, "created": 1492512837.0, "created_utc": 1492484037.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgemhce", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgeluv7", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Oh no, I just thought that's what you were implying. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh no, I just thought that&amp;#39;s what you were implying. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgemhce", "score_hidden": false, "stickied": false, "created": 1492514551.0, "created_utc": 1492485751.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeluv7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RedneckT", "parent_id": "t1_dgelo2l", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "No one is trying to kick anyone out, however if you are caught up on being \"first,\" you may have some bigger fish to fry. If someone has to leave the \"Christianity\" label, I'll be the first to do so since it has become so vague and confusing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No one is trying to kick anyone out, however if you are caught up on being &amp;quot;first,&amp;quot; you may have some bigger fish to fry. If someone has to leave the &amp;quot;Christianity&amp;quot; label, I&amp;#39;ll be the first to do so since it has become so vague and confusing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeluv7", "score_hidden": false, "stickied": false, "created": 1492513741.0, "created_utc": 1492484941.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgelo2l", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgekvxb", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Well I don't think you can kick out Catholics of being Christian. We were first. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I don&amp;#39;t think you can kick out Catholics of being Christian. We were first. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgelo2l", "score_hidden": false, "stickied": false, "created": 1492513500.0, "created_utc": 1492484700.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgen16q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheThirdWaluigi", "parent_id": "t1_dgemht4", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "The problem is that there is a reason we don't equate \"heretic\" with \"non-Christian\" anymore. With the Chalcedonian Schism, and then the Great Schism, how different do we actually need to be from each other to be able to say \"thse guys are not Christians\"? The Oriental Orthodox only broke away from the rest of the Church on the basis of Christology. The Catholic Church and the Eastern Orthodox Church went separate ways on the basis of the Filioque. But they kept the same structure they had prior to their schism otherwise, and importantly, they all agreed to and recited the Nicene-Constantinopolitan Creed (with a small 'heretic' addition made by the Catholics).\n\nAnd they all went on to survive for centuries upon centuries, until now, while groups like the Arians appeared and vanished here and there. And they can all trace their authority and dogma to the 1st century, while groups like the Arians clearly gained traction based off the teachings of a certain individual that held onto heresy. And because they still exist today, we have to talk to each other, and how are we going to talk to each other if we don't even accept to say we all follow Jesus Christ even if we disagree on the specifics?\n\nIt is similar for Protestants, except that they also grew so quickly that it became difficult to outright say they are simply not Christians without alienating them even further. And nowadays, there are so many major Protestant sects (about 6-7 of them) that make up such a large part of Christendom (put together, Protestantism is the second biggest Christian sect) that calling them non-Christians would be the perfect opposite of ecumenical dialogue done right (and besides, some Protestants already call Catholics non-Christians, it would be un-Christ-like to return the favor).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem is that there is a reason we don&amp;#39;t equate &amp;quot;heretic&amp;quot; with &amp;quot;non-Christian&amp;quot; anymore. With the Chalcedonian Schism, and then the Great Schism, how different do we actually need to be from each other to be able to say &amp;quot;thse guys are not Christians&amp;quot;? The Oriental Orthodox only broke away from the rest of the Church on the basis of Christology. The Catholic Church and the Eastern Orthodox Church went separate ways on the basis of the Filioque. But they kept the same structure they had prior to their schism otherwise, and importantly, they all agreed to and recited the Nicene-Constantinopolitan Creed (with a small &amp;#39;heretic&amp;#39; addition made by the Catholics).&lt;/p&gt;\n\n&lt;p&gt;And they all went on to survive for centuries upon centuries, until now, while groups like the Arians appeared and vanished here and there. And they can all trace their authority and dogma to the 1st century, while groups like the Arians clearly gained traction based off the teachings of a certain individual that held onto heresy. And because they still exist today, we have to talk to each other, and how are we going to talk to each other if we don&amp;#39;t even accept to say we all follow Jesus Christ even if we disagree on the specifics?&lt;/p&gt;\n\n&lt;p&gt;It is similar for Protestants, except that they also grew so quickly that it became difficult to outright say they are simply not Christians without alienating them even further. And nowadays, there are so many major Protestant sects (about 6-7 of them) that make up such a large part of Christendom (put together, Protestantism is the second biggest Christian sect) that calling them non-Christians would be the perfect opposite of ecumenical dialogue done right (and besides, some Protestants already call Catholics non-Christians, it would be un-Christ-like to return the favor).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgen16q", "score_hidden": false, "stickied": false, "created": 1492515311.0, "created_utc": 1492486511.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemht4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedneckT", "parent_id": "t1_dgema0j", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Right. And that's how it is today. And that's what will continue to happen. We are even warned about that in the Bible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right. And that&amp;#39;s how it is today. And that&amp;#39;s what will continue to happen. We are even warned about that in the Bible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgemht4", "score_hidden": false, "stickied": false, "created": 1492514570.0, "created_utc": 1492485770.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgema0j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheThirdWaluigi", "parent_id": "t1_dgem250", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "But that's what all heretics claimed to do, too. Some of them, like the Arians, used the same canon as everyone else and many bishops were in fact Arians, to the point the condamnation of Arianism had to be repeated at the second Ecumenical Council.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But that&amp;#39;s what all heretics claimed to do, too. Some of them, like the Arians, used the same canon as everyone else and many bishops were in fact Arians, to the point the condamnation of Arianism had to be repeated at the second Ecumenical Council.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgema0j", "score_hidden": false, "stickied": false, "created": 1492514272.0, "created_utc": 1492485472.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgem250", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedneckT", "parent_id": "t1_dgel970", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "I believe that the word originally came to describe people who were trying to be like Christ, or follow Christ.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe that the word originally came to describe people who were trying to be like Christ, or follow Christ.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgem250", "score_hidden": false, "stickied": false, "created": 1492513991.0, "created_utc": 1492485191.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgel970", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TheThirdWaluigi", "parent_id": "t1_dgekvxb", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "To be Christian originally meant to be a part of the one true Church. Heretics were called Nestorians, Arians, Valentinians, etc. because they were not Christians - they weren't followers of the true teachings of Christ, but of someone else.\n\nBut with all the Christian sects we have today, such a definition of \"Christian\" is only used by the most rad and trad of the radtrads. Nowadays, a secular definition of a Christian would be: one who tries to emulate the 1st-century Church, based off what was written down about it and its beliefs - in other words, one who follows the New Testament. This would mean Catholics, Orthodox, Protestants, and some restorationist movements like Mormons and Jehova's Witnesses. If the New Testament is scripture to you, you are under the umbrella of Christianity, from a secular perspective at least.\n\nFrom a religious perspective, the way \"Christian\" was used by the early Church, is how \"Catholic\" or \"Orthodox\", etc. is used now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be Christian originally meant to be a part of the one true Church. Heretics were called Nestorians, Arians, Valentinians, etc. because they were not Christians - they weren&amp;#39;t followers of the true teachings of Christ, but of someone else.&lt;/p&gt;\n\n&lt;p&gt;But with all the Christian sects we have today, such a definition of &amp;quot;Christian&amp;quot; is only used by the most rad and trad of the radtrads. Nowadays, a secular definition of a Christian would be: one who tries to emulate the 1st-century Church, based off what was written down about it and its beliefs - in other words, one who follows the New Testament. This would mean Catholics, Orthodox, Protestants, and some restorationist movements like Mormons and Jehova&amp;#39;s Witnesses. If the New Testament is scripture to you, you are under the umbrella of Christianity, from a secular perspective at least.&lt;/p&gt;\n\n&lt;p&gt;From a religious perspective, the way &amp;quot;Christian&amp;quot; was used by the early Church, is how &amp;quot;Catholic&amp;quot; or &amp;quot;Orthodox&amp;quot;, etc. is used now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgel970", "score_hidden": false, "stickied": false, "created": 1492512961.0, "created_utc": 1492484161.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekvxb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedneckT", "parent_id": "t1_dgeksw8", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "And this is the reason why I wonder why they can all still be under the same umbrella of Christianity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And this is the reason why I wonder why they can all still be under the same umbrella of Christianity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgekvxb", "score_hidden": false, "stickied": false, "created": 1492512487.0, "created_utc": 1492483687.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeksw8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheThirdWaluigi", "parent_id": "t1_dgekack", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "The thing is, Catholics/Orthodox and Protestants disagree on the most fundamental of things: what saves us? How holy can tradition be? And so on. In a sense, we are disciples of different Christs because we follow fundamentally different teachings.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is, Catholics/Orthodox and Protestants disagree on the most fundamental of things: what saves us? How holy can tradition be? And so on. In a sense, we are disciples of different Christs because we follow fundamentally different teachings.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeksw8", "score_hidden": false, "stickied": false, "created": 1492512387.0, "created_utc": 1492483587.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekack", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "RedneckT", "parent_id": "t1_dgek3qk", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "I think the emphasis on the church is great but a pride of being catholic is not great. It's not about being a Catholic or Methodist or Baptist. It's about being a Disciple of Christ. It's about being a Child of God. So that whole thing just kinda irks me.\n\nAs far as \"there are many very devout Catholics,\" I think that's only because there are so many people that claim to be Catholic. I would imagine that their percent would be relatively the same or perhaps even lower (based on what I've seen and whom I've met).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the emphasis on the church is great but a pride of being catholic is not great. It&amp;#39;s not about being a Catholic or Methodist or Baptist. It&amp;#39;s about being a Disciple of Christ. It&amp;#39;s about being a Child of God. So that whole thing just kinda irks me.&lt;/p&gt;\n\n&lt;p&gt;As far as &amp;quot;there are many very devout Catholics,&amp;quot; I think that&amp;#39;s only because there are so many people that claim to be Catholic. I would imagine that their percent would be relatively the same or perhaps even lower (based on what I&amp;#39;ve seen and whom I&amp;#39;ve met).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgekack", "score_hidden": false, "stickied": false, "created": 1492511745.0, "created_utc": 1492482945.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgek3qk", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "St_Morrissey", "parent_id": "t1_dgejxgp", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Well I think a lot of Christians are going to opposite ends of the spectrum, either becoming more and more modernist, or more and more traditional. I also think that Catholics place a huge emphasis on the church and have a pride of being a Catholic. Combine with the fact that there are many very devout Catholics, I think it makes sense that they would have a large presence where only people with a voice are seen. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I think a lot of Christians are going to opposite ends of the spectrum, either becoming more and more modernist, or more and more traditional. I also think that Catholics place a huge emphasis on the church and have a pride of being a Catholic. Combine with the fact that there are many very devout Catholics, I think it makes sense that they would have a large presence where only people with a voice are seen. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgek3qk", "score_hidden": false, "stickied": false, "created": 1492511520.0, "created_utc": 1492482720.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgekcdk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RedneckT", "parent_id": "t1_dgekb5c", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "This gave me a good chuckle.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This gave me a good chuckle.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgekcdk", "score_hidden": false, "stickied": false, "created": 1492511815.0, "created_utc": 1492483015.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgeo4rj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chamric", "parent_id": "t1_dgemrvy", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "You have to remember that you are on reddit, which generally isn't kind to evangelicals... especially since the term has been politicized in the US.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have to remember that you are on reddit, which generally isn&amp;#39;t kind to evangelicals... especially since the term has been politicized in the US.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeo4rj", "score_hidden": false, "stickied": false, "created": 1492516916.0, "created_utc": 1492488116.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemrvy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "OBasileus", "parent_id": "t1_dgekb5c", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Other than in places where Evangelicalism is mainstream, most Evangelicals are pretty crypto about their faith. They care a lot about not being associated with radical, judgmental people, which makes them somewhat timid. They're also pretty nice to Catholics, for what it's worth. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Other than in places where Evangelicalism is mainstream, most Evangelicals are pretty crypto about their faith. They care a lot about not being associated with radical, judgmental people, which makes them somewhat timid. They&amp;#39;re also pretty nice to Catholics, for what it&amp;#39;s worth. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgemrvy", "score_hidden": false, "stickied": false, "created": 1492514951.0, "created_utc": 1492486151.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekb5c", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Jefftopia", "parent_id": "t1_dgejxgp", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Right? Even as a Catholic I find it odd. Where are all those evangelicals I hear about on the news?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right? Even as a Catholic I find it odd. Where are all those evangelicals I hear about on the news?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgekb5c", "score_hidden": false, "stickied": false, "created": 1492511773.0, "created_utc": 1492482973.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgejxgp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "RedneckT", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "It always surprises me the amount of Catholics there are on this sub.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It always surprises me the amount of Catholics there are on this sub.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgejxgp", "score_hidden": false, "stickied": false, "created": 1492511311.0, "created_utc": 1492482511.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgenstq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nomosolo", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Congratulations! Now read the book of Romans so you can hurry up and become Lutheran... jk, just happy God has given you the faith and you and I can commune together for eternity!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congratulations! Now read the book of Romans so you can hurry up and become Lutheran... jk, just happy God has given you the faith and you and I can commune together for eternity!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgenstq", "score_hidden": false, "stickied": false, "created": 1492516420.0, "created_utc": 1492487620.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgemmdr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OBasileus", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Welcome to Christianity. Remember to keep your eyes fixed upon Jesus with all your might, and rest in him for all your comforts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Welcome to Christianity. Remember to keep your eyes fixed upon Jesus with all your might, and rest in him for all your comforts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgemmdr", "score_hidden": false, "stickied": false, "created": 1492514742.0, "created_utc": 1492485942.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgep206", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IUPCaleb", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "I assure you that many of us are former atheists.  Thanks for the story! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I assure you that many of us are former atheists.  Thanks for the story! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgep206", "score_hidden": false, "stickied": false, "created": 1492518291.0, "created_utc": 1492489491.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgeqwfa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Michael7123", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Welcome!\n\nBy the way, there is a specifically catholic subredit, /r/Catholicism. There are a lot of folks over there who recently became Catholic, so you'll be in good company there :)\n\nTry to avoid /r/Catholic though, as it's actually run by anti-Catholic trolls.\n\nOnce again, welcome :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Welcome!&lt;/p&gt;\n\n&lt;p&gt;By the way, there is a specifically catholic subredit, &lt;a href=\"/r/Catholicism\"&gt;/r/Catholicism&lt;/a&gt;. There are a lot of folks over there who recently became Catholic, so you&amp;#39;ll be in good company there :)&lt;/p&gt;\n\n&lt;p&gt;Try to avoid &lt;a href=\"/r/Catholic\"&gt;/r/Catholic&lt;/a&gt; though, as it&amp;#39;s actually run by anti-Catholic trolls.&lt;/p&gt;\n\n&lt;p&gt;Once again, welcome :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgeqwfa", "score_hidden": true, "stickied": false, "created": 1492521312.0, "created_utc": 1492492512.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgerenc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Anglicanweasel", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Wherever the catholic sun doth shine, \nThere's laughter and good red wine. \nAt least I've always found it so,\nBenedicamus dominino.\n\nCongratulations!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wherever the catholic sun doth shine, \nThere&amp;#39;s laughter and good red wine. \nAt least I&amp;#39;ve always found it so,\nBenedicamus dominino.&lt;/p&gt;\n\n&lt;p&gt;Congratulations!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgerenc", "score_hidden": true, "stickied": false, "created": 1492522211.0, "created_utc": 1492493411.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh6c", "removal_reason": null, "link_id": "t3_65zrzd", "likes": null, "replies": "", "user_reports": [], "id": "dgenxc3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LaserBees", "parent_id": "t3_65zrzd", "subreddit_name_prefixed": "r/Christianity", "controversiality": 0, "body": "Eh close enough.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh close enough.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Christianity", "name": "t1_dgenxc3", "score_hidden": false, "stickied": false, "created": 1492516604.0, "created_utc": 1492487804.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]