[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WritingPrompts", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Writing Prompt", "id": "64rlqo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 96, "report_reasons": null, "author": "SlapMePlease4Fun", "saved": false, "mod_reports": [], "name": "t3_64rlqo", "subreddit_name_prefixed": "r/WritingPrompts", "approved_by": null, "over_18": false, "domain": "self.WritingPrompts", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s3nb", "edited": false, "link_flair_css_class": "flairwp", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WritingPrompts/comments/64rlqo/wpfree_will_is_an_illusion_every_action_word_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1491954109.0, "url": "https://www.reddit.com/r/WritingPrompts/comments/64rlqo/wpfree_will_is_an_illusion_every_action_word_and/", "author_flair_text": null, "quarantine": false, "title": "[WP]Free will is an illusion, every action, word and event is predetermined. Humans are just complex machines, except you and The Universe doesn't like this. Attempting to correct it's mistake, hires interdimensional assassins to off you. Problem is, you're unintentionally unpredictable.", "created_utc": 1491925309.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 96}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64rlqo", "likes": null, "replies": "", "user_reports": [], "id": "dg4fjnt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WritingPromptsRobot", "parent_id": "t3_64rlqo", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\n**Off-Topic Discussion**: All top-level comments must be a story or poem. Reply here for other comments.\n\n#####Reminder for Writers and Readers:\n* Prompts are meant to inspire new writing.  Responses don't have to fulfill every detail.\n\n* Please remember to [be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback.\n\n---\n\n[](#icon-help)[^(What Is This?)](https://www.reddit.com/r/WritingPrompts/wiki/off_topic) [](#icon-information)[^(First Time Here?)](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) [](#icon-exclamation)[^(Special Announcements)](https://www.reddit.com/r/WritingPrompts/wiki/announcements) [](#icon-comments)[^(Click For Our Chatroom)](https://www.reddit.com/r/WritingPrompts/wiki/chat)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Off-Topic Discussion&lt;/strong&gt;: All top-level comments must be a story or poem. Reply here for other comments.&lt;/p&gt;\n\n&lt;h5&gt;Reminder for Writers and Readers:&lt;/h5&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Prompts are meant to inspire new writing.  Responses don&amp;#39;t have to fulfill every detail.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Please remember to &lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil\"&gt;be civil&lt;/a&gt; in any feedback.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"#icon-help\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/off_topic\"&gt;&lt;sup&gt;What Is This?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-information\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/user_guide\"&gt;&lt;sup&gt;First Time Here?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-exclamation\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/announcements\"&gt;&lt;sup&gt;Special Announcements&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-comments\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/chat\"&gt;&lt;sup&gt;Click For Our Chatroom&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg4fjnt", "score_hidden": true, "stickied": true, "created": 1491954141.0, "created_utc": 1491925341.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64rlqo", "likes": null, "replies": "", "user_reports": [], "id": "dg4kxiz", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "SteelPanMan", "parent_id": "t3_64rlqo", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Would you prefer a blissful illusion or the cold reality? It's easy on paper isn't it? Things get hard in the living. It gets messy. Questions without answers sprout up and you feel like killing yourself. But you hardly know me. I must be sharing too much.\n\n\nMy life is my own except I hardly own it. I am chaos. I am freedom. That ideal that you worship, that virtue of civilization. I am freedom. And I am trapped.\n\n\nMy life is normal. I live as man. Or I have lived as man. I have felt love and sadness, sorrow and joy. The world turned for me as it did for you. Then things changed. I don't control myself. I know you might feel as if you can't control yourself either, but it is different. Fate takes me on its unknown path. I do things I never think of. I test the limits of this existence.\n\n\nThis may be all hard to follow. What it means is that I am unpredictable. I'm sure you've met the type. But I am truly unpredictable. I have killed a man. His name was Warren and his wallet was bloody, his torso leaking, feeling soft as sponge cake. I killed him and I don't know why. I felt my knife slide inside and wondered at how easy it was. I felt powerful knowing his experience, all his memories, and all the memories of him, were destroyed and ended so easily. I killed a man and that is only the start of it.\n\n\nI have run from the police. I have set fire to men and women. Buildings have been destroyed. Hearts have been broken. Why? Who am I to say. I am guided by boredom, Driven by nothing. The compulsion of idleness makes me do things. Am I free? Perhaps. I feel damned.\n\n\nAnd so I am chased. You may think you are free. Let me tell you that you are not. The world moves. Time marches. Who the fuck are you? Everything happens and the reasons are arbitrary. They happen. You are a pawn.\n\n\nBut isn't that great? Think about it. Think of your life. How bad is it? How doomed are your horizons? Can it be as broken as mines? Could you feel as selfish as me?\n\n\nIf you do then that's your own fault. You have done things but they are your own. I am free and so I am compelled. The anarchy of *trueness*; that complete unpredictably that underlies this existence, I am merely its pawn. Such freedom. Such liberty.\n\n\nBut I ramble. My thoughts haunt me and so I apologize. There are worse things in this world. I am sure you have your problems. I understand.\n\n\nI am hunted and the world narrows. The universe is planned. It has purpose. My name varies, but it is Chaos and I am truly an enemy. And so I am hunted. Beings that defy time and space come for me. Beings with great teeth, apetites for worlds and a promise of nothing. They come for me. God's paradise and the Universe's plans are precluded. These beings are shadows. They are the rules manifested, monsters of order. They come for me and I will be destroyed.\n\n\nI know how it sounds. We have never met. We have never shared that bond as the slaves share. I understand. But I am you, free and unshackled and I am afraid. This may all seem as some far fetched rantings of a mad man, but I tell you it is true. I am free and chained. Your golden cage is bliss. The monsters come and I fear the worse. Enjoy your horizons, however planted they may be. Nothingness awaits me. That is the way of being free. Pray you never experience as much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would you prefer a blissful illusion or the cold reality? It&amp;#39;s easy on paper isn&amp;#39;t it? Things get hard in the living. It gets messy. Questions without answers sprout up and you feel like killing yourself. But you hardly know me. I must be sharing too much.&lt;/p&gt;\n\n&lt;p&gt;My life is my own except I hardly own it. I am chaos. I am freedom. That ideal that you worship, that virtue of civilization. I am freedom. And I am trapped.&lt;/p&gt;\n\n&lt;p&gt;My life is normal. I live as man. Or I have lived as man. I have felt love and sadness, sorrow and joy. The world turned for me as it did for you. Then things changed. I don&amp;#39;t control myself. I know you might feel as if you can&amp;#39;t control yourself either, but it is different. Fate takes me on its unknown path. I do things I never think of. I test the limits of this existence.&lt;/p&gt;\n\n&lt;p&gt;This may be all hard to follow. What it means is that I am unpredictable. I&amp;#39;m sure you&amp;#39;ve met the type. But I am truly unpredictable. I have killed a man. His name was Warren and his wallet was bloody, his torso leaking, feeling soft as sponge cake. I killed him and I don&amp;#39;t know why. I felt my knife slide inside and wondered at how easy it was. I felt powerful knowing his experience, all his memories, and all the memories of him, were destroyed and ended so easily. I killed a man and that is only the start of it.&lt;/p&gt;\n\n&lt;p&gt;I have run from the police. I have set fire to men and women. Buildings have been destroyed. Hearts have been broken. Why? Who am I to say. I am guided by boredom, Driven by nothing. The compulsion of idleness makes me do things. Am I free? Perhaps. I feel damned.&lt;/p&gt;\n\n&lt;p&gt;And so I am chased. You may think you are free. Let me tell you that you are not. The world moves. Time marches. Who the fuck are you? Everything happens and the reasons are arbitrary. They happen. You are a pawn.&lt;/p&gt;\n\n&lt;p&gt;But isn&amp;#39;t that great? Think about it. Think of your life. How bad is it? How doomed are your horizons? Can it be as broken as mines? Could you feel as selfish as me?&lt;/p&gt;\n\n&lt;p&gt;If you do then that&amp;#39;s your own fault. You have done things but they are your own. I am free and so I am compelled. The anarchy of &lt;em&gt;trueness&lt;/em&gt;; that complete unpredictably that underlies this existence, I am merely its pawn. Such freedom. Such liberty.&lt;/p&gt;\n\n&lt;p&gt;But I ramble. My thoughts haunt me and so I apologize. There are worse things in this world. I am sure you have your problems. I understand.&lt;/p&gt;\n\n&lt;p&gt;I am hunted and the world narrows. The universe is planned. It has purpose. My name varies, but it is Chaos and I am truly an enemy. And so I am hunted. Beings that defy time and space come for me. Beings with great teeth, apetites for worlds and a promise of nothing. They come for me. God&amp;#39;s paradise and the Universe&amp;#39;s plans are precluded. These beings are shadows. They are the rules manifested, monsters of order. They come for me and I will be destroyed.&lt;/p&gt;\n\n&lt;p&gt;I know how it sounds. We have never met. We have never shared that bond as the slaves share. I understand. But I am you, free and unshackled and I am afraid. This may all seem as some far fetched rantings of a mad man, but I tell you it is true. I am free and chained. Your golden cage is bliss. The monsters come and I fear the worse. Enjoy your horizons, however planted they may be. Nothingness awaits me. That is the way of being free. Pray you never experience as much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg4kxiz", "score_hidden": false, "stickied": false, "created": 1491960033.0, "created_utc": 1491931233.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64rlqo", "likes": null, "replies": "", "user_reports": [], "id": "dg589ev", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "TheRedChair21", "parent_id": "t3_64rlqo", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\"Why can't I see you?\" the Mindseer asked. She furrowed her brow, scrunching the empty eye sockets underneath. \"I hear your breathing. I smell your sweat. I taste your sorrows. But I *see* nothing. My third eye detects *nothing*.\"\n\nI checked my watch and then looked back to her.\n\n\"I'm the Pariah,\" I explained. No use lying now. A hybrid look of disgust, shock and amazement wandered across her face.\n\n\"The Pariah... at last...\" She took her pipe out and offered me Miracle, but I didn't use and I declined. \"You're the last of your kind, isn't that right? Me too. The Sages are extinct, now, and my time is soon coming as well. You found me and I figured I'd do a reading, but... I never would have thought...\"\n\n\"They're coming for me, now,\" I interrupted. I checked my watch.\n\n\"What do you have to worry about? Isn't it true: you've seen Fate's Writ? You know all of the tireless machinations of the Universe, all of its threads and all of its bends and curves. Why should you fear them?\"\n\n\"They are practically gods. I am only human. I can run, but I can't hide, and one day... maybe they'll find me. Please, tell me how to stop this. Tell me how to beat the Universe.\"\n\nThe ancient oracle drew on her Miracle pipe, holding her breath for several seconds before blowing a stream of fragrant, spiced smoke into my face.\n\n\"You're the Pariah. I can't see you. Time can't find you. Every one of your actions reshapes the infinity thread of the Universe. What are a few dark gods going to do to you?\"\n\nShe wasn't giving me the answers I needed, and time was running out. I impatiently tapped two fingers on my watch. I could hear thunder closing in on the building, which was unusual since we were in Port Hisan, a trade post in the Greater Magellanic Cloud. There were no storms here.\n\n\"On second thought, I'll take some of that,\" I said, seizing the Mindseer's pipe. I took a deep drag as the door to the room exploded from its hinges.\n\nTime had already stopped. My eyes were sealed shut, but as the Miracle high set in I felt my mind's eye open for the first time. I saw the darkness in the doorway and beyond that, the Universe and its infinity thread, eternally pursuing my elimination. I was the final step in the creation of its perfect machine: existence, and nothing more.\n\n\"Good choice,\" the Mindseer said. In our joint intoxication, we now understood each other perfectly. I looked at her with my third eye and saw a seething ball of coruscating energy. \"Your unpredictability is key to your invincibility.\"\n\n\"Please,\" I said. \"How do I beat this? How do I stop the Universe?\"\n\n\"You already know your options, Pariah,\" she said. \"Keep running. Run the way you did when destiny wiped out your species and destroyed your planet. Run the way you did when you discovered Fate's Writ and all of Eternity's secrets. Run. Or don't run. The choice is yours.\"\n\n\"But if I don't run, I die.\"\n\n\"Who's to say that you should fear the Universe, Pariah? Perhaps the Universe should fear you.\"\n\nI mulled that over. A moment on a Miracle high feels like quite a long time, but the darkness in the doorway didn't seem to mind waiting. This was the answer I was looking for.\n\nThe Miracle wore off instantly. I turned to face my interdimensional pursuers. I looked into the Abyss, and the Abyss looked away in terror.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Why can&amp;#39;t I see you?&amp;quot; the Mindseer asked. She furrowed her brow, scrunching the empty eye sockets underneath. &amp;quot;I hear your breathing. I smell your sweat. I taste your sorrows. But I &lt;em&gt;see&lt;/em&gt; nothing. My third eye detects &lt;em&gt;nothing&lt;/em&gt;.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I checked my watch and then looked back to her.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m the Pariah,&amp;quot; I explained. No use lying now. A hybrid look of disgust, shock and amazement wandered across her face.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The Pariah... at last...&amp;quot; She took her pipe out and offered me Miracle, but I didn&amp;#39;t use and I declined. &amp;quot;You&amp;#39;re the last of your kind, isn&amp;#39;t that right? Me too. The Sages are extinct, now, and my time is soon coming as well. You found me and I figured I&amp;#39;d do a reading, but... I never would have thought...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;They&amp;#39;re coming for me, now,&amp;quot; I interrupted. I checked my watch.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What do you have to worry about? Isn&amp;#39;t it true: you&amp;#39;ve seen Fate&amp;#39;s Writ? You know all of the tireless machinations of the Universe, all of its threads and all of its bends and curves. Why should you fear them?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;They are practically gods. I am only human. I can run, but I can&amp;#39;t hide, and one day... maybe they&amp;#39;ll find me. Please, tell me how to stop this. Tell me how to beat the Universe.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The ancient oracle drew on her Miracle pipe, holding her breath for several seconds before blowing a stream of fragrant, spiced smoke into my face.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re the Pariah. I can&amp;#39;t see you. Time can&amp;#39;t find you. Every one of your actions reshapes the infinity thread of the Universe. What are a few dark gods going to do to you?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She wasn&amp;#39;t giving me the answers I needed, and time was running out. I impatiently tapped two fingers on my watch. I could hear thunder closing in on the building, which was unusual since we were in Port Hisan, a trade post in the Greater Magellanic Cloud. There were no storms here.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;On second thought, I&amp;#39;ll take some of that,&amp;quot; I said, seizing the Mindseer&amp;#39;s pipe. I took a deep drag as the door to the room exploded from its hinges.&lt;/p&gt;\n\n&lt;p&gt;Time had already stopped. My eyes were sealed shut, but as the Miracle high set in I felt my mind&amp;#39;s eye open for the first time. I saw the darkness in the doorway and beyond that, the Universe and its infinity thread, eternally pursuing my elimination. I was the final step in the creation of its perfect machine: existence, and nothing more.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Good choice,&amp;quot; the Mindseer said. In our joint intoxication, we now understood each other perfectly. I looked at her with my third eye and saw a seething ball of coruscating energy. &amp;quot;Your unpredictability is key to your invincibility.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Please,&amp;quot; I said. &amp;quot;How do I beat this? How do I stop the Universe?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You already know your options, Pariah,&amp;quot; she said. &amp;quot;Keep running. Run the way you did when destiny wiped out your species and destroyed your planet. Run the way you did when you discovered Fate&amp;#39;s Writ and all of Eternity&amp;#39;s secrets. Run. Or don&amp;#39;t run. The choice is yours.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But if I don&amp;#39;t run, I die.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Who&amp;#39;s to say that you should fear the Universe, Pariah? Perhaps the Universe should fear you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I mulled that over. A moment on a Miracle high feels like quite a long time, but the darkness in the doorway didn&amp;#39;t seem to mind waiting. This was the answer I was looking for.&lt;/p&gt;\n\n&lt;p&gt;The Miracle wore off instantly. I turned to face my interdimensional pursuers. I looked into the Abyss, and the Abyss looked away in terror.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg589ev", "score_hidden": false, "stickied": false, "created": 1491987750.0, "created_utc": 1491958950.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64rlqo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64rlqo", "likes": null, "replies": "", "user_reports": [], "id": "dg5jv50", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheWurstOfReddit", "parent_id": "t1_dg5jltf", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\nAs i walked toward my bunk i heard Rick call\n\n\"If you didn't get those fucking cigarettes Danny I swear! I'm gonna give you a fucking beating!\"\n\nI hadn't remembered the cigarettes. I forgot why the fuck i went to the store. I spent the last 20 minutes digging up my past and trying to piece together where the fuck everything had gone so wrong, while eating a fucking chocolate bar Rick paid for. There was only one logical option. Cut the ties, lose all fucking connection to this shit. Turn around. And just fucking run. Don't look back, ditch these deadly hobos, and get the fuck out of here.\n\n\"Rick you idiot the stores fucking closed! It's 2:00AM!\"\n\nI responded, hoping that the green crack and liquor hit him in just the right way where he would forget it's a 24/7 shop that we frequent. Lying has to be the best alternative to running right?\n\n\"Well than you better find me a store thats open Danny! I'm your best shot at survival now and you remember that! Now find me some fucking cigarettes!\"\n\nThe plan had worked. Albeit due to the generalized inebriation of the group, the available supply of cigarettes, and Ricks growing desire to feed his own ego with a show of force. Thankfully with the stars aligning I was granted an opportunity to redeem myself and obtain Ricks cigarettes.\n\nKNOCK KNOCK KNOCK\n\n\"Hey man! You better stop fucking whacking it in there! the fuckings cops are coming!\"\n\nI awoke face down on a blue tile floor. The grout was a mix between Sand Brown and Piss Yellow. Given the fact that i was staring directly at the business end of a toilet plunger i deduced that only the Sand Brown may have been a synthetic color. As i peeled my face away from the second most disguising thing it had ever been glued to i came to a terrifying realization. I can't possibly have a serious conversation with a police officer with piss crust all over my face?. I crashed out of the door of the bathroom so quickly and loudly i'm almost sure the station attendant involuntarily evacuated their bowels. After i ran the third block i was panting and wheezing. The only way to calm myself down was to spark up one of Ricks cigarettes. The way i see it that son of a bitch owes me one for almost getting me pinched by the 5-0. I reach for one of my well-deserved cigarettes and a shock rips over my body. No money, No Smokes, Nothing but some shit receipt. Rick is going to kill me.\n\nThat was the last day i spent homeless. As i had later found out it was not a receipt. In my green crack fueled haze i had decided for no real reason to spend Ricks cigarette money on a PowerBall ticket. I later found out the jackpot was at $218 Million that week. And it turned out that Rick was the lucky bastard to pay for the ticket. I happened to purchase it, and claim it. But Rick was the lucky fuck to pay for it! Needless to say i never saw Rick again. Or my family. Granted i HEARD from them via my lawyers. They didn't mind leaving me in the streets to die, but you throw a few million dollars into the mix and suddenly i'm the fucking center of attention again. Not only was i responsible for my parents death but i somehow orchestrated a con targeting the lottery? And somehow everyone in my family tree is entitled to some of it? Thankfully these blood suckers come from the same fucking destitute gene pool i do so theres no fucking way ill ever see a day in court. I've got a legal team and they have 2 lawyers. Representing 11 of them. And again i'm left in a spot where things have just kind of worked themselves out.\n\nI wish my parents were still with me. I wish I could see them again. I wish I could tell them. I wish I could tell them I don't need them. I wish they could see me. I wish they could see all that i have and everything they said i would never be. I wish they could see how I didn't need to be what they said i should be. Is it right? No, I know this. But i will never forgive them. Did i chose to ditch on dinner that night? Did i chose to kick myself out of the house? Where does the impact of one decision on another begin or end. Did i kill my parents? Would they have been there if i showed up? I beat myself up over these questions for a long while. Until the cocaine killed the need to do so.\n\nI was doing fine until 2 weeks ago. I was walking home taking the same street i always take home from the club. I saw a guy just standing there on the other side of the street as i was walking. He looked at me and I him, then i kept walking. For once in my life, I didn't have that uncomfortable feeling like someone is watching me when i look away. I looked back up at the stranger, and he was running directly at me. By the time i had seen him again he was a mere 10 feet away. He lunged for me and i panicked, I reached into my pocket to find a weapon of some kind to defend myself. Unfortunately the only Thing i found in my pocket was three handfuls of cornmeal.\n\nEarlier in the night i had been talking with one of my club buddies. or clubuddies as i like to say these days. Manny bet me $2G that i could not take a girl home by propositioning her to reach into my pocket. In my mind a pocket full of cornmeal seems like almost the perfect kind of thing to have in your pocket for that pick up to work. As evidenced by my 1V1 street brawl it didn't work. And as the lunatic leaped directly at me i filled my fist with a cornmeal filler and put every ounce of seething deep seeded unwarranted misguided hatred for the homeless directly into one punch square into the center of the nose.\n\nWhat followed was an explosion of corn dust and blood splatter. My opponent began to writhe in pain reaffirming my own belief in my strengths. He then began to gasp for air, beginning to make me question my belief in my strengths. It was when the anaphylaxis set in that I was positive I was but a mere mortal. And my opponent was allergic to corn, and merely had an allergic reaction to my pocket full of poison. I pulled out a cigarette to relax and assess the situation. Cigarettes taste better when you finally pay for them, but this one tasted wrong. I wondered why this fellow seemed to look so intently upon me and randomly attack. Thats when i saw them, and thats when the memories started flooding back.\n\nHis eyes. They were so dark. They weren't Jet Black, but there was just no life. When you look someone in the eyes you can get a sense of something behind them. Behind his there was nothing. I had only seen it a few times before. That time I was attacked in the alley. That time my helicopter shitnado caused a deranged homeless man who was ready to kill a child, to vomit uncontrollably. And to fall down the underpass knife and all. I've heard about it. That maniac that ran into that restaurant that night my parents were killed. Witnesses said his eyes were hollow. Claimed he looked, empty. And this would-be murderer who just so happened to be allergic to my bad bet.\n\nThat was all i had known of them. Until 3 nights ago. I was taking the elevator to my suite at my favorite casino. I had been knee deep into the blow that night so i can't be positive of the events. But i know it was one of them. He was going up. I was too but his elevator seemed to be on the lucky side of the building without all the assholes waiting on every second floor for a lift. I watched him go from 21 to 24. And he watched me. As i watched him watch me my equilibrium went on the fucking fritz and i dropped sideways like Rick after way too much green crack. My phone flew out the doors past the three obvious prostitutes i knocked past. I grabbed my phone and quickly tried to re-enter the elevator before being abandoned by sex workers, and i looked up to see the stranger. Traveling from floor 44 to 38. Then 38 to 28 getting closer and closer. As i lunged back out of the door of the elevator there was an explosion of glass and bone.\n\nI awoke in the hospital with minor scratches to the face and severe bruising to almost every other part of the body. It turns out the staring stranger in the other elevator decided to turn himself into a projectile to impact the opposing elevator. Some argue it was an elaborate suicide attempt as a protest. Some say gambling debts. At first i tried to convince myself it was simply the most high stakes game of lawn darts ever. If it wasn't for that stare i could live the rest of my life uncomfortably believing that. But that is a stare that i have seen before. And it is nothing i want to be accepted by.\n\nI have begun questioning everything. I no longer know what exactly I can even say is true. I can't say for sure what it is, but something is after me. Why me? What can i do to stop it? Have my actions led me here? They are watching me. They have been gone for so long. They took my parents. Why are they back? There was this guy in the street. He found me... How did he find me? I moved miles from where it all happened. Different name, different city, different fucking face. How the fuck did he find me?\n\nWe all want to be accepted. Its Human nature. But accepted into what? When i stray away everything is taken? My family is taken? People are trying to take my life? I don't want to do whats expected of me. I don't want to blend in. I want to do what i want to do. But thats all I've been doing. Is what i want to do. And now they have found me. How do i escape them? How have i escaped them? If i do what i want to do wont they find me? If i don't do what i actually want to do what am i doing at all? Whats the purpose?\n\n40 minutes ago a man broke into my penthouse suite with a pump action shotgun. If it weren't for my neodymium coat rock he might have killed me instead of himself, the cleaning lady and 2 other residents. If i do what they tell me to do, i'm not doing what i want to do. If I do what i want to do, theres the potential for Dead-Eyes to hunt me for the rest of my life. Is either one a life worth living. Why are they hunting me? What did i do? What can i do? What would Daniel do?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As i walked toward my bunk i heard Rick call&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;If you didn&amp;#39;t get those fucking cigarettes Danny I swear! I&amp;#39;m gonna give you a fucking beating!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I hadn&amp;#39;t remembered the cigarettes. I forgot why the fuck i went to the store. I spent the last 20 minutes digging up my past and trying to piece together where the fuck everything had gone so wrong, while eating a fucking chocolate bar Rick paid for. There was only one logical option. Cut the ties, lose all fucking connection to this shit. Turn around. And just fucking run. Don&amp;#39;t look back, ditch these deadly hobos, and get the fuck out of here.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Rick you idiot the stores fucking closed! It&amp;#39;s 2:00AM!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I responded, hoping that the green crack and liquor hit him in just the right way where he would forget it&amp;#39;s a 24/7 shop that we frequent. Lying has to be the best alternative to running right?&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well than you better find me a store thats open Danny! I&amp;#39;m your best shot at survival now and you remember that! Now find me some fucking cigarettes!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The plan had worked. Albeit due to the generalized inebriation of the group, the available supply of cigarettes, and Ricks growing desire to feed his own ego with a show of force. Thankfully with the stars aligning I was granted an opportunity to redeem myself and obtain Ricks cigarettes.&lt;/p&gt;\n\n&lt;p&gt;KNOCK KNOCK KNOCK&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey man! You better stop fucking whacking it in there! the fuckings cops are coming!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I awoke face down on a blue tile floor. The grout was a mix between Sand Brown and Piss Yellow. Given the fact that i was staring directly at the business end of a toilet plunger i deduced that only the Sand Brown may have been a synthetic color. As i peeled my face away from the second most disguising thing it had ever been glued to i came to a terrifying realization. I can&amp;#39;t possibly have a serious conversation with a police officer with piss crust all over my face?. I crashed out of the door of the bathroom so quickly and loudly i&amp;#39;m almost sure the station attendant involuntarily evacuated their bowels. After i ran the third block i was panting and wheezing. The only way to calm myself down was to spark up one of Ricks cigarettes. The way i see it that son of a bitch owes me one for almost getting me pinched by the 5-0. I reach for one of my well-deserved cigarettes and a shock rips over my body. No money, No Smokes, Nothing but some shit receipt. Rick is going to kill me.&lt;/p&gt;\n\n&lt;p&gt;That was the last day i spent homeless. As i had later found out it was not a receipt. In my green crack fueled haze i had decided for no real reason to spend Ricks cigarette money on a PowerBall ticket. I later found out the jackpot was at $218 Million that week. And it turned out that Rick was the lucky bastard to pay for the ticket. I happened to purchase it, and claim it. But Rick was the lucky fuck to pay for it! Needless to say i never saw Rick again. Or my family. Granted i HEARD from them via my lawyers. They didn&amp;#39;t mind leaving me in the streets to die, but you throw a few million dollars into the mix and suddenly i&amp;#39;m the fucking center of attention again. Not only was i responsible for my parents death but i somehow orchestrated a con targeting the lottery? And somehow everyone in my family tree is entitled to some of it? Thankfully these blood suckers come from the same fucking destitute gene pool i do so theres no fucking way ill ever see a day in court. I&amp;#39;ve got a legal team and they have 2 lawyers. Representing 11 of them. And again i&amp;#39;m left in a spot where things have just kind of worked themselves out.&lt;/p&gt;\n\n&lt;p&gt;I wish my parents were still with me. I wish I could see them again. I wish I could tell them. I wish I could tell them I don&amp;#39;t need them. I wish they could see me. I wish they could see all that i have and everything they said i would never be. I wish they could see how I didn&amp;#39;t need to be what they said i should be. Is it right? No, I know this. But i will never forgive them. Did i chose to ditch on dinner that night? Did i chose to kick myself out of the house? Where does the impact of one decision on another begin or end. Did i kill my parents? Would they have been there if i showed up? I beat myself up over these questions for a long while. Until the cocaine killed the need to do so.&lt;/p&gt;\n\n&lt;p&gt;I was doing fine until 2 weeks ago. I was walking home taking the same street i always take home from the club. I saw a guy just standing there on the other side of the street as i was walking. He looked at me and I him, then i kept walking. For once in my life, I didn&amp;#39;t have that uncomfortable feeling like someone is watching me when i look away. I looked back up at the stranger, and he was running directly at me. By the time i had seen him again he was a mere 10 feet away. He lunged for me and i panicked, I reached into my pocket to find a weapon of some kind to defend myself. Unfortunately the only Thing i found in my pocket was three handfuls of cornmeal.&lt;/p&gt;\n\n&lt;p&gt;Earlier in the night i had been talking with one of my club buddies. or clubuddies as i like to say these days. Manny bet me $2G that i could not take a girl home by propositioning her to reach into my pocket. In my mind a pocket full of cornmeal seems like almost the perfect kind of thing to have in your pocket for that pick up to work. As evidenced by my 1V1 street brawl it didn&amp;#39;t work. And as the lunatic leaped directly at me i filled my fist with a cornmeal filler and put every ounce of seething deep seeded unwarranted misguided hatred for the homeless directly into one punch square into the center of the nose.&lt;/p&gt;\n\n&lt;p&gt;What followed was an explosion of corn dust and blood splatter. My opponent began to writhe in pain reaffirming my own belief in my strengths. He then began to gasp for air, beginning to make me question my belief in my strengths. It was when the anaphylaxis set in that I was positive I was but a mere mortal. And my opponent was allergic to corn, and merely had an allergic reaction to my pocket full of poison. I pulled out a cigarette to relax and assess the situation. Cigarettes taste better when you finally pay for them, but this one tasted wrong. I wondered why this fellow seemed to look so intently upon me and randomly attack. Thats when i saw them, and thats when the memories started flooding back.&lt;/p&gt;\n\n&lt;p&gt;His eyes. They were so dark. They weren&amp;#39;t Jet Black, but there was just no life. When you look someone in the eyes you can get a sense of something behind them. Behind his there was nothing. I had only seen it a few times before. That time I was attacked in the alley. That time my helicopter shitnado caused a deranged homeless man who was ready to kill a child, to vomit uncontrollably. And to fall down the underpass knife and all. I&amp;#39;ve heard about it. That maniac that ran into that restaurant that night my parents were killed. Witnesses said his eyes were hollow. Claimed he looked, empty. And this would-be murderer who just so happened to be allergic to my bad bet.&lt;/p&gt;\n\n&lt;p&gt;That was all i had known of them. Until 3 nights ago. I was taking the elevator to my suite at my favorite casino. I had been knee deep into the blow that night so i can&amp;#39;t be positive of the events. But i know it was one of them. He was going up. I was too but his elevator seemed to be on the lucky side of the building without all the assholes waiting on every second floor for a lift. I watched him go from 21 to 24. And he watched me. As i watched him watch me my equilibrium went on the fucking fritz and i dropped sideways like Rick after way too much green crack. My phone flew out the doors past the three obvious prostitutes i knocked past. I grabbed my phone and quickly tried to re-enter the elevator before being abandoned by sex workers, and i looked up to see the stranger. Traveling from floor 44 to 38. Then 38 to 28 getting closer and closer. As i lunged back out of the door of the elevator there was an explosion of glass and bone.&lt;/p&gt;\n\n&lt;p&gt;I awoke in the hospital with minor scratches to the face and severe bruising to almost every other part of the body. It turns out the staring stranger in the other elevator decided to turn himself into a projectile to impact the opposing elevator. Some argue it was an elaborate suicide attempt as a protest. Some say gambling debts. At first i tried to convince myself it was simply the most high stakes game of lawn darts ever. If it wasn&amp;#39;t for that stare i could live the rest of my life uncomfortably believing that. But that is a stare that i have seen before. And it is nothing i want to be accepted by.&lt;/p&gt;\n\n&lt;p&gt;I have begun questioning everything. I no longer know what exactly I can even say is true. I can&amp;#39;t say for sure what it is, but something is after me. Why me? What can i do to stop it? Have my actions led me here? They are watching me. They have been gone for so long. They took my parents. Why are they back? There was this guy in the street. He found me... How did he find me? I moved miles from where it all happened. Different name, different city, different fucking face. How the fuck did he find me?&lt;/p&gt;\n\n&lt;p&gt;We all want to be accepted. Its Human nature. But accepted into what? When i stray away everything is taken? My family is taken? People are trying to take my life? I don&amp;#39;t want to do whats expected of me. I don&amp;#39;t want to blend in. I want to do what i want to do. But thats all I&amp;#39;ve been doing. Is what i want to do. And now they have found me. How do i escape them? How have i escaped them? If i do what i want to do wont they find me? If i don&amp;#39;t do what i actually want to do what am i doing at all? Whats the purpose?&lt;/p&gt;\n\n&lt;p&gt;40 minutes ago a man broke into my penthouse suite with a pump action shotgun. If it weren&amp;#39;t for my neodymium coat rock he might have killed me instead of himself, the cleaning lady and 2 other residents. If i do what they tell me to do, i&amp;#39;m not doing what i want to do. If I do what i want to do, theres the potential for Dead-Eyes to hunt me for the rest of my life. Is either one a life worth living. Why are they hunting me? What did i do? What can i do? What would Daniel do?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg5jv50", "score_hidden": false, "stickied": false, "created": 1492005925.0, "created_utc": 1491977125.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jltf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheWurstOfReddit", "parent_id": "t3_64rlqo", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "We all just want to be accepted. It just human nature.\n\nThis is one of the fundamental ideas that has always stuck in my mind. Its easy to understand and it makes things easy to understand.\n\n-*Why did i chug those 6 beers at Jennys party in 9th grade?*\n\n\"I wanted to impress Stacey\"\n\n-*Why did i dress like some Fuck-Wit hobo with holes in my jeans and my ass hanging out?*\n\n\"It was trendy when i was trying to bang Stacey\"\n\nWe all have a justification for our actions, we can all explain why we did what we did. But the fact of the matter is we all just wanted to be accepted. Whether its by our co-workers, our friends, our family. Or in Staceys case, complete fucking strangers. I've never really thought much of it until these last few weeks. Accepted by who? Accepted by *what*? And now the only question i have been able to ask myself all day is: What would Daniel do?\n\nThe truth is I've never given any real thought to peoples acceptance. During high-school RAP was the big thing, I didn't give a fuck. I couldn't stand the shit and would certainly voice it. Obviously being ostracized due to that voice. I would end up sitting alone, jamming out to classic rock and smoking weed until i awoke in a stupor the next morning covered in Dorito crumbs and 3 hours late for my second class. Suffice it to say, school didn't pan out the way it should have. Then again nothing in my life has ever seemed to pan out the way it *should* have. It has always just kind of, ended up panning out?\n\nTake for instance, my high-school career. One would assume an 18 year old with 13 high-school credits would go nowhere in life... One would be absolutely correct in thinking so. Thats the same thing my parents told me.\n\n\"18 years old! 18 years old and you still don't have your grade 9 Math credit?!\"\n\nMy father would scream in the weeks before my leaving\n\n\"You're not fucking stupid! I know you're not stupid! So what the fuck are you doing Daniel?!\"\n\nMy mom was always a little softer with her words\n\n\"Do you want to grow up to be some kind of fucking loser just begging for change on the street? It doesn't matter how smart you *think* you are! If you don't have your high-school you're fucked!\"\n\nAnd as i sat there red-eyed and thinking about the blue Cool Ranch chip bag glistening ever so invitingly behind my parents it struck me, my mothers palm that is. I hadn't caught a single word dad had said after \"getting high\" and she and I both knew it. Her slap had brought me back and i had distinctly remembered hearing something about \"life being shit\" if i didn't get my act together. And i just couldn't care less. Perhaps it was apathy, perhaps it was complacency coupled with laziness. whatever it was i saw my future, my adulthood, my entire life. Going down the drain. And in the circumstance where everyone sees the light, I didn't.\n\nNine weeks later and i was just in the middle of walking back to my bunk. Arguably more of a \"old mattress atop a steel crate\" than a bunk but beauty is in the eye of the beholder. I had been sleeping behind an old factory downtown that had been long forgotten. The first 5 or 6 days i was kicked out it was easy. Sleeping at a buddies house, Crashing in some basements. It's really easy until your friend has to wake up for school, and you have nowhere to go because you're a drop out. Suddenly parents start to think its a bad idea to have that kind of person hanging around their child. I couldn't understand their narrow-minded mentality but then again it may have just been because i knew better than everyone else. Par for the course. After the first week i had resorted to pan-handling and finding some cozy place to bed down on my sweater and backpack each night. Sure beat swallowing my pride!\n\nThe first Time i was mugged was terrifying. This guy had a fucking blade on him that reminded me what it was like to be a young child again. Because when he pulled it out I immediately shit my pants and started crying uncontrollably. I was a mess, begging for my life while i threw the entirety of what *was* my life off of my back and towards his feet. If i hadn't done what I did next, I would be dead. I don't know what came over me, I may never know. But the only rational thought was to fight. Fight and defend, Now i'm not sure why but my idea was to kick. Not forward, not side. But Helicopter. My father had once told me \"You're not fucking stupid! I know you're not stupid!\", and as centrifugal force pulled the feces down my right leg toward my now bare feet. I began to question his credibility.\n\nAs i was walking towards my bunk i had been thinking a lot about my actions. The decisions i made, the decisions i didn't. \nWhat if i had stayed in school? \nWhat if i had chosen to stay at home? \nWhat if i had met them that night? \nWhy didn't i go to meet them that night? They had caved. They had completely agreed to **ALL** of my bullshit demands. Couldn't yell about the school shit. Couldn't yell about the drug shit. And all i had to do was get a part time job? I had the perfect set-up. I get to do what i want when i want to and all i have to do is hold some bullshit job i don't care about? And they pay for room and board?! Game. set. match. All i have to do is meet them for dinner, a dinner *they* are going to pay for. Easy Peasy.\n\nOn my way to the restaurant I had caught my reflection in a shop window. I came to the realization that i looked almost like i had been sleeping on the streets for the last 4 weeks. Though beneficial to my pity party i was intending to throw myself at tonights dinner, with the 10% chance their was an eligible bachelorette somewhere inside this restaurant i needed to transform from a disheveled and homeless look to more of a, disheveled hipster looking homeless intentionally. If i could find a slouch beanie it would be a breeze. As i was rummaging through the clothes donation bin i heard a voice call.\n\n\"Hey Fuckface!\"\n\nI turned and I saw a large man in a long brown coat. With a beard that belonged in ZZ Top, and a smell reminiscent of my encounter with the blade brandishing victim a few days before.\n\n\"What the fuck do you think you're doing going through **MY** bin?!\"\n\nAfter an explanation of my circumstance, and the bribe of my last .5 piece of chronic Rick was rather welcoming. He informed me that there was an abandoned factory not far from the parking lot we stood in.\n\n\"You ever tried *Green Crack*?\" Asked Rick.\n\n\"No, I can't say that i have\" I replied.\n\n\"Come party with us tonight! And when your parents take you back in, maybe you help Rick out in return for the good time!\"\n\nI had learned quite a bit in my last few weeks of living on the streets. I had my run-ins with folks i would never like to meet again, and I had learned exactly what to say when a strange homeless man offers you a substance casually referred to as *Green Crack*. I awoke the next afternoon tucked beneath my sweater, face pasted to a spring mattress with the saliva that had been pooling in my mouth all night. As i pulled the sweater past my face i saw the underside of a corrugated shack roof. Glancing outward i began to recognize the area, I was downtown. As i peeled my face away from the mattress i hoped that all of the stains i was looking at were the result of food and not bodily function. I could stifle my vomit thinking about being passed out mouth down on a 13 week old yogurt stain.\n\nAs i began to collect myself i began to rationalize. \n*When they don't know where i am it will only be easier to get home*\n*Fuck em, they want to kick me out. I'll show em whats what*\nTwo days later i was wondering why they hadn't called to set up another meet? Then i went by the restaurant we were supposed to meet to see if they had shown up. Thats when i saw it, the entire place had been tied off with police tape. Bullet holes through the windows, through the brick, through the furniture. Apparently some Drug addict ran in screaming about \"balance\" and \"The Error\". Then proceeded to unload 3 clips into anyone and everyone in the building. Until he eventually blew his own head off like the coward he was. 16 people were injured and 9 were killed. My parents were both murdered that night. And the only solution i could think of was some Green Crack.\n\nI spent the next 2 weeks smoking the worst weed i have ever encountered. I assumed it had gotten its name the way most of these strains do, some asshole spouting off whatever stupid shit he thinks sounds catchy. Later i began to wonder if its name derived from the amount of crack it actually contains? Had these hobos been slipping Crack into my Chronic? Do i really care at this point whether or not i'm smoking crack? I wonder when Rick will be back with more of that Green Crack? These were the questions flowing through my head. Eventually i had numbed the fact that my parents were gone. I had numbed the fact that i missed my chance to see them that night. My family would be there to help if they weren't positive that i was involved with the incident. Homeless man kills your parents while your brother is hanging out with the homeless? I couldn't grasp it, but they sure could. Enough to cut all contact with me. My life had fallen apart. And again i just couldn't find the energy to give a shit.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We all just want to be accepted. It just human nature.&lt;/p&gt;\n\n&lt;p&gt;This is one of the fundamental ideas that has always stuck in my mind. Its easy to understand and it makes things easy to understand.&lt;/p&gt;\n\n&lt;p&gt;-&lt;em&gt;Why did i chug those 6 beers at Jennys party in 9th grade?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I wanted to impress Stacey&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;-&lt;em&gt;Why did i dress like some Fuck-Wit hobo with holes in my jeans and my ass hanging out?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It was trendy when i was trying to bang Stacey&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;We all have a justification for our actions, we can all explain why we did what we did. But the fact of the matter is we all just wanted to be accepted. Whether its by our co-workers, our friends, our family. Or in Staceys case, complete fucking strangers. I&amp;#39;ve never really thought much of it until these last few weeks. Accepted by who? Accepted by &lt;em&gt;what&lt;/em&gt;? And now the only question i have been able to ask myself all day is: What would Daniel do?&lt;/p&gt;\n\n&lt;p&gt;The truth is I&amp;#39;ve never given any real thought to peoples acceptance. During high-school RAP was the big thing, I didn&amp;#39;t give a fuck. I couldn&amp;#39;t stand the shit and would certainly voice it. Obviously being ostracized due to that voice. I would end up sitting alone, jamming out to classic rock and smoking weed until i awoke in a stupor the next morning covered in Dorito crumbs and 3 hours late for my second class. Suffice it to say, school didn&amp;#39;t pan out the way it should have. Then again nothing in my life has ever seemed to pan out the way it &lt;em&gt;should&lt;/em&gt; have. It has always just kind of, ended up panning out?&lt;/p&gt;\n\n&lt;p&gt;Take for instance, my high-school career. One would assume an 18 year old with 13 high-school credits would go nowhere in life... One would be absolutely correct in thinking so. Thats the same thing my parents told me.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;18 years old! 18 years old and you still don&amp;#39;t have your grade 9 Math credit?!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My father would scream in the weeks before my leaving&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re not fucking stupid! I know you&amp;#39;re not stupid! So what the fuck are you doing Daniel?!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My mom was always a little softer with her words&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Do you want to grow up to be some kind of fucking loser just begging for change on the street? It doesn&amp;#39;t matter how smart you &lt;em&gt;think&lt;/em&gt; you are! If you don&amp;#39;t have your high-school you&amp;#39;re fucked!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And as i sat there red-eyed and thinking about the blue Cool Ranch chip bag glistening ever so invitingly behind my parents it struck me, my mothers palm that is. I hadn&amp;#39;t caught a single word dad had said after &amp;quot;getting high&amp;quot; and she and I both knew it. Her slap had brought me back and i had distinctly remembered hearing something about &amp;quot;life being shit&amp;quot; if i didn&amp;#39;t get my act together. And i just couldn&amp;#39;t care less. Perhaps it was apathy, perhaps it was complacency coupled with laziness. whatever it was i saw my future, my adulthood, my entire life. Going down the drain. And in the circumstance where everyone sees the light, I didn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;Nine weeks later and i was just in the middle of walking back to my bunk. Arguably more of a &amp;quot;old mattress atop a steel crate&amp;quot; than a bunk but beauty is in the eye of the beholder. I had been sleeping behind an old factory downtown that had been long forgotten. The first 5 or 6 days i was kicked out it was easy. Sleeping at a buddies house, Crashing in some basements. It&amp;#39;s really easy until your friend has to wake up for school, and you have nowhere to go because you&amp;#39;re a drop out. Suddenly parents start to think its a bad idea to have that kind of person hanging around their child. I couldn&amp;#39;t understand their narrow-minded mentality but then again it may have just been because i knew better than everyone else. Par for the course. After the first week i had resorted to pan-handling and finding some cozy place to bed down on my sweater and backpack each night. Sure beat swallowing my pride!&lt;/p&gt;\n\n&lt;p&gt;The first Time i was mugged was terrifying. This guy had a fucking blade on him that reminded me what it was like to be a young child again. Because when he pulled it out I immediately shit my pants and started crying uncontrollably. I was a mess, begging for my life while i threw the entirety of what &lt;em&gt;was&lt;/em&gt; my life off of my back and towards his feet. If i hadn&amp;#39;t done what I did next, I would be dead. I don&amp;#39;t know what came over me, I may never know. But the only rational thought was to fight. Fight and defend, Now i&amp;#39;m not sure why but my idea was to kick. Not forward, not side. But Helicopter. My father had once told me &amp;quot;You&amp;#39;re not fucking stupid! I know you&amp;#39;re not stupid!&amp;quot;, and as centrifugal force pulled the feces down my right leg toward my now bare feet. I began to question his credibility.&lt;/p&gt;\n\n&lt;p&gt;As i was walking towards my bunk i had been thinking a lot about my actions. The decisions i made, the decisions i didn&amp;#39;t. \nWhat if i had stayed in school? \nWhat if i had chosen to stay at home? \nWhat if i had met them that night? \nWhy didn&amp;#39;t i go to meet them that night? They had caved. They had completely agreed to &lt;strong&gt;ALL&lt;/strong&gt; of my bullshit demands. Couldn&amp;#39;t yell about the school shit. Couldn&amp;#39;t yell about the drug shit. And all i had to do was get a part time job? I had the perfect set-up. I get to do what i want when i want to and all i have to do is hold some bullshit job i don&amp;#39;t care about? And they pay for room and board?! Game. set. match. All i have to do is meet them for dinner, a dinner &lt;em&gt;they&lt;/em&gt; are going to pay for. Easy Peasy.&lt;/p&gt;\n\n&lt;p&gt;On my way to the restaurant I had caught my reflection in a shop window. I came to the realization that i looked almost like i had been sleeping on the streets for the last 4 weeks. Though beneficial to my pity party i was intending to throw myself at tonights dinner, with the 10% chance their was an eligible bachelorette somewhere inside this restaurant i needed to transform from a disheveled and homeless look to more of a, disheveled hipster looking homeless intentionally. If i could find a slouch beanie it would be a breeze. As i was rummaging through the clothes donation bin i heard a voice call.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey Fuckface!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I turned and I saw a large man in a long brown coat. With a beard that belonged in ZZ Top, and a smell reminiscent of my encounter with the blade brandishing victim a few days before.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What the fuck do you think you&amp;#39;re doing going through &lt;strong&gt;MY&lt;/strong&gt; bin?!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;After an explanation of my circumstance, and the bribe of my last .5 piece of chronic Rick was rather welcoming. He informed me that there was an abandoned factory not far from the parking lot we stood in.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You ever tried &lt;em&gt;Green Crack&lt;/em&gt;?&amp;quot; Asked Rick.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No, I can&amp;#39;t say that i have&amp;quot; I replied.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Come party with us tonight! And when your parents take you back in, maybe you help Rick out in return for the good time!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I had learned quite a bit in my last few weeks of living on the streets. I had my run-ins with folks i would never like to meet again, and I had learned exactly what to say when a strange homeless man offers you a substance casually referred to as &lt;em&gt;Green Crack&lt;/em&gt;. I awoke the next afternoon tucked beneath my sweater, face pasted to a spring mattress with the saliva that had been pooling in my mouth all night. As i pulled the sweater past my face i saw the underside of a corrugated shack roof. Glancing outward i began to recognize the area, I was downtown. As i peeled my face away from the mattress i hoped that all of the stains i was looking at were the result of food and not bodily function. I could stifle my vomit thinking about being passed out mouth down on a 13 week old yogurt stain.&lt;/p&gt;\n\n&lt;p&gt;As i began to collect myself i began to rationalize. \n&lt;em&gt;When they don&amp;#39;t know where i am it will only be easier to get home&lt;/em&gt;\n&lt;em&gt;Fuck em, they want to kick me out. I&amp;#39;ll show em whats what&lt;/em&gt;\nTwo days later i was wondering why they hadn&amp;#39;t called to set up another meet? Then i went by the restaurant we were supposed to meet to see if they had shown up. Thats when i saw it, the entire place had been tied off with police tape. Bullet holes through the windows, through the brick, through the furniture. Apparently some Drug addict ran in screaming about &amp;quot;balance&amp;quot; and &amp;quot;The Error&amp;quot;. Then proceeded to unload 3 clips into anyone and everyone in the building. Until he eventually blew his own head off like the coward he was. 16 people were injured and 9 were killed. My parents were both murdered that night. And the only solution i could think of was some Green Crack.&lt;/p&gt;\n\n&lt;p&gt;I spent the next 2 weeks smoking the worst weed i have ever encountered. I assumed it had gotten its name the way most of these strains do, some asshole spouting off whatever stupid shit he thinks sounds catchy. Later i began to wonder if its name derived from the amount of crack it actually contains? Had these hobos been slipping Crack into my Chronic? Do i really care at this point whether or not i&amp;#39;m smoking crack? I wonder when Rick will be back with more of that Green Crack? These were the questions flowing through my head. Eventually i had numbed the fact that my parents were gone. I had numbed the fact that i missed my chance to see them that night. My family would be there to help if they weren&amp;#39;t positive that i was involved with the incident. Homeless man kills your parents while your brother is hanging out with the homeless? I couldn&amp;#39;t grasp it, but they sure could. Enough to cut all contact with me. My life had fallen apart. And again i just couldn&amp;#39;t find the energy to give a shit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg5jltf", "score_hidden": false, "stickied": false, "created": 1492005326.0, "created_utc": 1491976526.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64rlqo", "likes": null, "replies": "", "user_reports": [], "id": "dg5nfqr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Doctorus", "parent_id": "t3_64rlqo", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\"\"Would you rather live happily in fake world or face harsh reality? If you don't give a damn about happiness like me, then obviously you prefer truth, be it bitter or not. Who cares about happiness? It's useless, you don't gain anything from it. All that matters is knowledge. I always wanted to know everything.\"\n\nThat's how I was thinking back then and this is how I still think. I supposedly were only person with free will, or let's say I was only person in this universe. \n\n\"There are various types of systems. Some systems are finite and simple, some are finite and complex, some are infinite and simple and some are infinite and complex. Our universe is vast, seemingly infinite but finite, complex system. It's like a single player game, where you seemingly are free, but outcome will remain same no matter what, even if you cheat, ending won't change. You might finish game easier with cheats but result remains same. Then how do you even change result? It's simple, you don't, I do, because I'm only free person in this universe. I'm like a programmer who can remake already made game and change how it ends. Cool, isn't it?\". That day I finished writing my note, sat in front of computer and started playing game. It was too easy, everyone was so predictable I was winning every single match. I lacked daily dose of victory so I played 24 matches that day. Then I was about to play 25th. \"Another machine has come to lose\", I said to myself, but it was weird. Someone challenged me. I never got challenged in a while, people hate losing you know. I picked fighter \"Metal Junker\" and then I saw what my opponent chose. \"What the hell? Thrill Buster? My fighter hardcounters him and he picked that? Must be a noob\". \n\n\"Prepare for brawl! Countdown, 3, 2, 1, GO!\" And the match started. Guess what happened. I won again. Hahaha! You expected me to lose and say I encountered someone like me or universe's personification? Nope, it would've been cliche and predictable. After that I went to shop, bought some drinks and started watching a movie. \"Huh, huge explosions, guns, that's another trash film with no plot, even universe has plot and film doesn't, stupid\".\n\n\"Oh, Do I?\" - I heard voice in my head. \"What the actual f...\" \"Stop there, children are reading\" I heard in my head again. No, it wasn't in my head, someone was in my house. He looked and sounded exactly like me.\n\n\"Are you someone in charge of this universe?\" I asked him. \"Indeed I am. To be more precise, I am universe itself.\" he answered. \"Why are you here?\" I asked. \"You really have to ask that? You know the answer. I'm here because you bug me. You disturb order in me. You are a glitch and shouldn't exist, but I can't help it, I just can observe\". We talked for several hours. In this time, I made sure he really was who he claimed to be. I wasn't high or drunk either. I bought orange and apple juice in shop, not alcohol. So basically universe is sentient but can only observe. Yet, this doesn't limit it from communicating with others. I also realized there were other universes and dimensions. There was a risk someone might've killed me, but chance of that someone being from our universe was low because everything was predetermined here. Universe was unable to change itself. It was like I was more powerful than universe and it envied me, hated me. I started researching various stuff. This day I decided to defeat the universe itself. \n\nI spent years researching. Decades passed, I managed to become immortal (doesn't means I lost ability to die though) and found a way to \"predict\" future. Then centuries passed, I became even more powerful. I became leader of humans, created intergalactic civilization and started \"exploiting\" weaknesses of universe. One day it appeared before me again, now without a form. It was like white bright sphere with dark core, that sounded like broken 20th century movie robot. \"So you decided to declare war on me. I thought we had truce, I expected you to live as you wished but without harming me, but you want to defeat and take control of me, you will regret that.\". After that before I could say anything, it disappeared. By that time I knew about existence of various other universes and dimensions. There was also interdimensional assassination organization. They were hired by powerful entities, just like our \"universe\" (give me a break, so powerful it needs to hire others to do his job inside him, haha.) to terminate \"reality glitches\" like me. They were called Reality Police, so ironic, they were murderers of freedom actually. \n\nOne day my fleet was assaulted by one of that assassins. He destroyed 10 out of 25 of my ships, but we badly damaged his one. I managed to capture him and started questioning. When we removed his mask, everyone froze in motion. He looked like me. Later we found out he was me from another universe. \n\n\"There are many universes. You're only free person in your universe, but not in multiverse. There are many free people like you and me. Some are dead, some work as assassins like me, some try to fight like you, some just give up and live normally.\" That's what Assassin me told me. After hours of questioning, I found out there was universe full of free people. I set my goal this day. I planned to find that universe, assemble army and start conquest. I decided to bring freedom to every singe universe. This is how my story began.\n\n\"What if everything I do is predetermined too? What if universe tricked me into believing I was free? What if I think i'm free but actually i'm not?\" That question is what kept me going. I aimed to break universe in order to find answer. I was ready to risk everything for truth. I kept living and working with robots, or that's at least how I thought back then. I considered others to be tools, machines. But what if they affected me. What if they, non-free machines changed path of my life? No, that can't be it. I controlled them, I stole them from universe. But that makes me no different from universe, or does it...\"\n\n- From Captain Dagon's personal notebook/diary, Commander of Forerunner Fleet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;&amp;quot;Would you rather live happily in fake world or face harsh reality? If you don&amp;#39;t give a damn about happiness like me, then obviously you prefer truth, be it bitter or not. Who cares about happiness? It&amp;#39;s useless, you don&amp;#39;t gain anything from it. All that matters is knowledge. I always wanted to know everything.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s how I was thinking back then and this is how I still think. I supposedly were only person with free will, or let&amp;#39;s say I was only person in this universe. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;There are various types of systems. Some systems are finite and simple, some are finite and complex, some are infinite and simple and some are infinite and complex. Our universe is vast, seemingly infinite but finite, complex system. It&amp;#39;s like a single player game, where you seemingly are free, but outcome will remain same no matter what, even if you cheat, ending won&amp;#39;t change. You might finish game easier with cheats but result remains same. Then how do you even change result? It&amp;#39;s simple, you don&amp;#39;t, I do, because I&amp;#39;m only free person in this universe. I&amp;#39;m like a programmer who can remake already made game and change how it ends. Cool, isn&amp;#39;t it?&amp;quot;. That day I finished writing my note, sat in front of computer and started playing game. It was too easy, everyone was so predictable I was winning every single match. I lacked daily dose of victory so I played 24 matches that day. Then I was about to play 25th. &amp;quot;Another machine has come to lose&amp;quot;, I said to myself, but it was weird. Someone challenged me. I never got challenged in a while, people hate losing you know. I picked fighter &amp;quot;Metal Junker&amp;quot; and then I saw what my opponent chose. &amp;quot;What the hell? Thrill Buster? My fighter hardcounters him and he picked that? Must be a noob&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Prepare for brawl! Countdown, 3, 2, 1, GO!&amp;quot; And the match started. Guess what happened. I won again. Hahaha! You expected me to lose and say I encountered someone like me or universe&amp;#39;s personification? Nope, it would&amp;#39;ve been cliche and predictable. After that I went to shop, bought some drinks and started watching a movie. &amp;quot;Huh, huge explosions, guns, that&amp;#39;s another trash film with no plot, even universe has plot and film doesn&amp;#39;t, stupid&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh, Do I?&amp;quot; - I heard voice in my head. &amp;quot;What the actual f...&amp;quot; &amp;quot;Stop there, children are reading&amp;quot; I heard in my head again. No, it wasn&amp;#39;t in my head, someone was in my house. He looked and sounded exactly like me.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Are you someone in charge of this universe?&amp;quot; I asked him. &amp;quot;Indeed I am. To be more precise, I am universe itself.&amp;quot; he answered. &amp;quot;Why are you here?&amp;quot; I asked. &amp;quot;You really have to ask that? You know the answer. I&amp;#39;m here because you bug me. You disturb order in me. You are a glitch and shouldn&amp;#39;t exist, but I can&amp;#39;t help it, I just can observe&amp;quot;. We talked for several hours. In this time, I made sure he really was who he claimed to be. I wasn&amp;#39;t high or drunk either. I bought orange and apple juice in shop, not alcohol. So basically universe is sentient but can only observe. Yet, this doesn&amp;#39;t limit it from communicating with others. I also realized there were other universes and dimensions. There was a risk someone might&amp;#39;ve killed me, but chance of that someone being from our universe was low because everything was predetermined here. Universe was unable to change itself. It was like I was more powerful than universe and it envied me, hated me. I started researching various stuff. This day I decided to defeat the universe itself. &lt;/p&gt;\n\n&lt;p&gt;I spent years researching. Decades passed, I managed to become immortal (doesn&amp;#39;t means I lost ability to die though) and found a way to &amp;quot;predict&amp;quot; future. Then centuries passed, I became even more powerful. I became leader of humans, created intergalactic civilization and started &amp;quot;exploiting&amp;quot; weaknesses of universe. One day it appeared before me again, now without a form. It was like white bright sphere with dark core, that sounded like broken 20th century movie robot. &amp;quot;So you decided to declare war on me. I thought we had truce, I expected you to live as you wished but without harming me, but you want to defeat and take control of me, you will regret that.&amp;quot;. After that before I could say anything, it disappeared. By that time I knew about existence of various other universes and dimensions. There was also interdimensional assassination organization. They were hired by powerful entities, just like our &amp;quot;universe&amp;quot; (give me a break, so powerful it needs to hire others to do his job inside him, haha.) to terminate &amp;quot;reality glitches&amp;quot; like me. They were called Reality Police, so ironic, they were murderers of freedom actually. &lt;/p&gt;\n\n&lt;p&gt;One day my fleet was assaulted by one of that assassins. He destroyed 10 out of 25 of my ships, but we badly damaged his one. I managed to capture him and started questioning. When we removed his mask, everyone froze in motion. He looked like me. Later we found out he was me from another universe. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;There are many universes. You&amp;#39;re only free person in your universe, but not in multiverse. There are many free people like you and me. Some are dead, some work as assassins like me, some try to fight like you, some just give up and live normally.&amp;quot; That&amp;#39;s what Assassin me told me. After hours of questioning, I found out there was universe full of free people. I set my goal this day. I planned to find that universe, assemble army and start conquest. I decided to bring freedom to every singe universe. This is how my story began.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What if everything I do is predetermined too? What if universe tricked me into believing I was free? What if I think i&amp;#39;m free but actually i&amp;#39;m not?&amp;quot; That question is what kept me going. I aimed to break universe in order to find answer. I was ready to risk everything for truth. I kept living and working with robots, or that&amp;#39;s at least how I thought back then. I considered others to be tools, machines. But what if they affected me. What if they, non-free machines changed path of my life? No, that can&amp;#39;t be it. I controlled them, I stole them from universe. But that makes me no different from universe, or does it...&amp;quot;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;From Captain Dagon&amp;#39;s personal notebook/diary, Commander of Forerunner Fleet.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg5nfqr", "score_hidden": false, "stickied": false, "created": 1492015778.0, "created_utc": 1491986978.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]