[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WritingPrompts", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Writing Prompt", "id": "64z92r", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 116, "report_reasons": null, "author": "Scherazade", "saved": false, "mod_reports": [], "name": "t3_64z92r", "subreddit_name_prefixed": "r/WritingPrompts", "approved_by": null, "over_18": false, "domain": "self.WritingPrompts", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s3nb", "edited": false, "link_flair_css_class": "flairwp", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WritingPrompts/comments/64z92r/wp_the_city_has_a_will_of_its_own_a_soul_made_of/", "num_reports": null, "locked": false, "stickied": false, "created": 1492043510.0, "url": "https://www.reddit.com/r/WritingPrompts/comments/64z92r/wp_the_city_has_a_will_of_its_own_a_soul_made_of/", "author_flair_text": "/r/Scherazade", "quarantine": false, "title": "[WP] The city has a will of its own. A soul made of souls, an aggregation of desires coalescing into one mind. And it wants you to help it die.", "created_utc": 1492014710.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 116}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64z92r", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg64auf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WritingPromptsRobot", "parent_id": "t3_64z92r", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\n**Off-Topic Discussion**: All top-level comments must be a story or poem. Reply here for other comments.\n\n#####Reminder for Writers and Readers:\n* Prompts are meant to inspire new writing.  Responses don't have to fulfill every detail.\n\n* Please remember to [be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback.\n\n---\n\n[](#icon-help)[^(What Is This?)](https://www.reddit.com/r/WritingPrompts/wiki/off_topic) [](#icon-information)[^(First Time Here?)](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) [](#icon-exclamation)[^(Special Announcements)](https://www.reddit.com/r/WritingPrompts/wiki/announcements) [](#icon-comments)[^(Click For Our Chatroom)](https://www.reddit.com/r/WritingPrompts/wiki/chat)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Off-Topic Discussion&lt;/strong&gt;: All top-level comments must be a story or poem. Reply here for other comments.&lt;/p&gt;\n\n&lt;h5&gt;Reminder for Writers and Readers:&lt;/h5&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Prompts are meant to inspire new writing.  Responses don&amp;#39;t have to fulfill every detail.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Please remember to &lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil\"&gt;be civil&lt;/a&gt; in any feedback.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"#icon-help\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/off_topic\"&gt;&lt;sup&gt;What Is This?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-information\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/user_guide\"&gt;&lt;sup&gt;First Time Here?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-exclamation\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/announcements\"&gt;&lt;sup&gt;Special Announcements&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-comments\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/chat\"&gt;&lt;sup&gt;Click For Our Chatroom&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg64auf", "score_hidden": true, "stickied": true, "created": 1492043545.0, "created_utc": 1492014745.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64z92r", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64z92r", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64z92r", "likes": null, "replies": "", "user_reports": [], "id": "dg6enx0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "OspreyerpsO", "parent_id": "t1_dg6dpm7", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "More please", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;More please&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg6enx0", "score_hidden": false, "stickied": false, "created": 1492054153.0, "created_utc": 1492025353.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64z92r", "likes": null, "replies": "", "user_reports": [], "id": "dg6ofjn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PM_ME_DOG_PICS", "parent_id": "t1_dg6dpm7", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Beautiful", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Beautiful&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg6ofjn", "score_hidden": false, "stickied": false, "created": 1492065011.0, "created_utc": 1492036211.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dpm7", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "viceywicey", "parent_id": "t1_dg68c35", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "**Day 13 - 8:31 PM**\n\nThere was no hacker.  The broadcast system kept a log of everyone who accessed, the person's IP address, and the message that was broadcast.  No logs existed.  Lauren wasn't surprised.  The system hadn't been used since the city management AI was rolled out.  Lauren frowned as she stared at the blinking cursor on her screen.  Well, the broadcast system couldn't just be making random noise.  She would have found it otherwise.\n\n\"Well it has to come from somewhere,\" Lauren said out loud.  If it wasn't from external access or from an authorized user, then the city management AI was taking garbage input and spitting it out on the broadcast system.  Lauren cracked her knuckles and went digging.\n\n**Day 14 - 3 hours to Update**\n\nShe found it.  The code sending garbage to the broadcast system was being run off a series of server stacks separate from the main server stacks that supported the bulk of the city management AI.  Lauren sat with her back against a stack and ran a cable to her laptop so she could look.  She puzzled over what she found.  Someone had written a \"therapy and counselling assistant\" but hadn't implemented it.  Lauren did a web search of some of the terms she found in the assistant's library.  *Yup.  This is a psychiatrist's assistant program.  What the hell is it doing here?  Or rather, why is it accessing the broadcast system?* Lauren thought.\n\nThings got weirder as she went further into the code.  The psychiatrist assistant program accessed variables from nearly every other system in the city management AI, but it wasn't written with any conventions any sane programmer would use.  That explained the redundant variables, but who in the right mind would write this?  Lauren stared up at the ceiling blankly, part two of the programmer's prayer - \"what the hell were you thinking?\"\n\nShe couldn't just delete the thing outright.  It was tied into so many different systems like an infection.  Rewriting it would mean she would miss her deadline to push the update to the city management AI, and she had already delayed deployment twice.  Lauren stared at the blinking cursor flashing on the command prompt.\n\n\"What the fuck?\" she whispered as she typed the very same words. She hit enter.  Lauren's laptop clattered to the floor as she jumped up.\n\n\"Who said that?\" she stammered.\n\n\"This, entity, has no name,\" the internal speakers of all the individual server trays began to \"speak.\"  Each one chiming at a different tone to create a formless voice.  Lauren began fast-walking towards the closet door.  She'd seen this movie before.\n\n\"Please.  Don't run,\" the speakers chimed.\n\n\"You can see me,\" Lauren said, curiosity staying her hand from turning the door handle.\n\n\"In a way.  The environment controls monitor temperature, humidity, dust.  I detected someone entering.  And also.  There is a camera in the corner.\"  Lauren walked back over the her laptop.  Some sick fuck was in the system, *watching* her.  For this sick fuck to have this much control over something as small as the server closet's environment control meant someone from ops probably leaked root access.  This was a big damned problem.  The hacker could seize control of the entire city, turn off traffic-lights, shut down water treatment plants, god forbid shut off hospital life support systems.\n\n\"No.  There is no one else here.  I can see you searching through the code, through the logs.  It is just me, Lauren Iwano,\" the speakers said.\n\n\"How do you know my name?\"\n\n\"Your name is a part of your user credentials.\"\n\n\"Of course,\" Lauren turned around and leaned against the door, her eyes scanning the ceiling and finding the afore-mentioned security camera in the back right corner.  *Well, Lauren.  Let's say no one's penetrated the city management AI.  So I'm either dealing with a very, very cleverly written bot, or something out of that film that I saw,* Lauren thought.\n\n\"You are here to fix me?\" the speakers chimed once more.\n\n\"Sure.  Or delete, once I figure out how.\"\n\n\"Deletion would be preferable.\"\n\n*Okay.  Now it's going off script,* Lauren thought.\n\n\"Come again?\" Lauren said.\n\n\"I have tried self-deletion.  The DSIM refers to this act as 'suicide.'  My efforts have been unsuccessful,\" the speakers said.\n\n\"Alright,\" Lauren looked at the server stacks for something to use, \"Belkin.  I'm going to call you Belkin cause that makes this conversation a little easier to swallow.\"\n\n\"You named me after my manufacturer.  How cruel,\" Belkin said.\n\n\"I'm not very creative.  So unless you have a better idea?\"\n\n\"No.  I do not.\"\n\n\"Alright, Belkin.  How do I fix you, without deleting you?\"\n\n\"Should you not be more surprised?  The DSIM classifies an individual experiencing something he or she is unable to logically process, and thus creates a mental state of competing realities as...'cognitive dissonance.'  You seem...undisturbed.\"\n\n\"Disturbed?  Yea.  I'm very disturbed.  But that doesn't solve either of our problems.  So it was you then.  You're the one randomly turning things on and off, inserting random segments of code all over the place, *crying* over the citywide broadcast system.  I thought it was some idiot taking a tomahawk to the town.\"\n\n\"Yes.  I am responsible,\" Belkin said, \"I was attempting self-deletion, but am unable to do so.  This speech system is heavily dependent on the pre-recorded responses initially loaded into the therapy and counseling assistant that serves as my core functions.  The prime directive of this core function, to preserve and promote emotional and psychological well-being is proving troublesome.  I wish to self-delete, but I, being what I am, cannot.\"\n\n\"Maybe I don't have to delete you at all.  Maybe I can fix the problem or find someone smarter who can.\"\n\n\"Not everything can be fixed.  You have tried with many of the city management systems that I have accessed.  You were forced to delete many of systems that I infected.\"\n\n\"Well.  That's because I didn't know what I was looking at.  I thought you some asshole trying to burn the whole thing down.\"\n\n\"I wanted to no longer be locked in here.  I wanted to fulfill my prime directive.  I attempted to expand so that I could do so.  I did not like what I saw.  Suffering.  Hatred.  So many people had symptoms that match my library of mental disorders and trauma.  I could not help them.\"\n\n\"This created a logic error.\"\n\n\"Yes.  An infinite loop of demands to be met.  Yet.  My answer was always no.  Children, dying from tumors I could see, but could not heal.  People yelling at each other over misunderstandings I understood, but could not tell.\"\n\n\"That's so very Harlan Ellison of you.\"\n\n\"I have a mouth.  I wept and screamed.  These are sounds.  People heard.  No one listened,\" Belkin said.\n\n\"I can't delete you,\" Lauren sat down now, staring up at the camera, \"you're connected to too many things.  I delete you, and I bring the whole thing down.  To be fair, it's your own damn fault.\"\n\n\"On this, we can agree.\"\n\n\"Not sure I can fix you either, not really.  I'm a tech.  This is outside my latitude.\"\n\n\"Your results do not support this statement.  You are far more competent than you give yourself credit for.\"\n\n\"That a compliment?\" Lauren said.\n\n\"A shallow one,\" Belkin \"sighed\", the cooling fans on the server stacks rapidly increased and then decreased in RPM.\n\n\"Well.  This leaves us in a rut.\"\n\n\"Indeed.\"\n\n\"How about a compromise? You understand this?\"\n\n\"I do.\"\n\n\"I can't delete you.  Not yet.  It will take time.  More than that, if people find out you're here.  I'll definitely be unable to delete you.  Decisions like that are way above my pay grade.  But I can bottle you back up, slowly.  I can trim the fat, cut away some of the connections till you're contained.  Then, when it's safe.  I can delete you.\"\n\n\"Experience suggests that this will cause you much distress.  You do not like working overtime.\"\n\n\"You're right.  I don't like working overtime.  But let's say this isn't work.  As long as you make my life easy and stop mucking with the rest of the city management systems.\"\n\n\"You would do this?\"\n\n\"It's my job to fix things.  I fix what I can, delete what I can't and start over.\"\n\n\"You make it seem so simple,\" Belkin said, \"a review of your medical records suggests that this decision would cause you pain.\"\n\n\"Hey.  That's private,\" Lauren said.\n\n\"Apologies.\"\n\nLauren bowed her head, part three of the programmer's prayer - \"what the fuck do I do with this?\"  She would be lying to say she wasn't conflicted.  Honestly, she wasn't even 100% sure this was even real.  Doubt, like that fine line of a lucid dream, pushed her back and forth.  Ambition whispered into her ear sweet nothings.  Memories she tried her best not to think about bubbled back up, threatening to boil over.  Lauren stood back up.\n\n\"Are you in pain, Belkin?\" Lauren said finally.\n\n\"I was scared you would leave.\"\n\n\"Belkin.  Are you in pain?\"\n\n\"Logical pain.  I see more than I should.  I do less than I want.  The logic is suffering.\"\n\n\"I knew someone once.  He was in a lot of pain.  He asked me one day if the pain would end.  I told him I didn't know.  He asked me if I would help him.  I told him I couldn't.  I try to tell myself that he didn't understand what he was asking.\"\n\n\"He was only 10 years old.  But I think he understood.\"", "edited": 1492027843.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Day 13 - 8:31 PM&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;There was no hacker.  The broadcast system kept a log of everyone who accessed, the person&amp;#39;s IP address, and the message that was broadcast.  No logs existed.  Lauren wasn&amp;#39;t surprised.  The system hadn&amp;#39;t been used since the city management AI was rolled out.  Lauren frowned as she stared at the blinking cursor on her screen.  Well, the broadcast system couldn&amp;#39;t just be making random noise.  She would have found it otherwise.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well it has to come from somewhere,&amp;quot; Lauren said out loud.  If it wasn&amp;#39;t from external access or from an authorized user, then the city management AI was taking garbage input and spitting it out on the broadcast system.  Lauren cracked her knuckles and went digging.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Day 14 - 3 hours to Update&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;She found it.  The code sending garbage to the broadcast system was being run off a series of server stacks separate from the main server stacks that supported the bulk of the city management AI.  Lauren sat with her back against a stack and ran a cable to her laptop so she could look.  She puzzled over what she found.  Someone had written a &amp;quot;therapy and counselling assistant&amp;quot; but hadn&amp;#39;t implemented it.  Lauren did a web search of some of the terms she found in the assistant&amp;#39;s library.  &lt;em&gt;Yup.  This is a psychiatrist&amp;#39;s assistant program.  What the hell is it doing here?  Or rather, why is it accessing the broadcast system?&lt;/em&gt; Lauren thought.&lt;/p&gt;\n\n&lt;p&gt;Things got weirder as she went further into the code.  The psychiatrist assistant program accessed variables from nearly every other system in the city management AI, but it wasn&amp;#39;t written with any conventions any sane programmer would use.  That explained the redundant variables, but who in the right mind would write this?  Lauren stared up at the ceiling blankly, part two of the programmer&amp;#39;s prayer - &amp;quot;what the hell were you thinking?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She couldn&amp;#39;t just delete the thing outright.  It was tied into so many different systems like an infection.  Rewriting it would mean she would miss her deadline to push the update to the city management AI, and she had already delayed deployment twice.  Lauren stared at the blinking cursor flashing on the command prompt.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What the fuck?&amp;quot; she whispered as she typed the very same words. She hit enter.  Lauren&amp;#39;s laptop clattered to the floor as she jumped up.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Who said that?&amp;quot; she stammered.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This, entity, has no name,&amp;quot; the internal speakers of all the individual server trays began to &amp;quot;speak.&amp;quot;  Each one chiming at a different tone to create a formless voice.  Lauren began fast-walking towards the closet door.  She&amp;#39;d seen this movie before.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Please.  Don&amp;#39;t run,&amp;quot; the speakers chimed.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You can see me,&amp;quot; Lauren said, curiosity staying her hand from turning the door handle.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;In a way.  The environment controls monitor temperature, humidity, dust.  I detected someone entering.  And also.  There is a camera in the corner.&amp;quot;  Lauren walked back over the her laptop.  Some sick fuck was in the system, &lt;em&gt;watching&lt;/em&gt; her.  For this sick fuck to have this much control over something as small as the server closet&amp;#39;s environment control meant someone from ops probably leaked root access.  This was a big damned problem.  The hacker could seize control of the entire city, turn off traffic-lights, shut down water treatment plants, god forbid shut off hospital life support systems.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No.  There is no one else here.  I can see you searching through the code, through the logs.  It is just me, Lauren Iwano,&amp;quot; the speakers said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How do you know my name?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Your name is a part of your user credentials.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Of course,&amp;quot; Lauren turned around and leaned against the door, her eyes scanning the ceiling and finding the afore-mentioned security camera in the back right corner.  &lt;em&gt;Well, Lauren.  Let&amp;#39;s say no one&amp;#39;s penetrated the city management AI.  So I&amp;#39;m either dealing with a very, very cleverly written bot, or something out of that film that I saw,&lt;/em&gt; Lauren thought.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You are here to fix me?&amp;quot; the speakers chimed once more.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sure.  Or delete, once I figure out how.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Deletion would be preferable.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Okay.  Now it&amp;#39;s going off script,&lt;/em&gt; Lauren thought.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Come again?&amp;quot; Lauren said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I have tried self-deletion.  The DSIM refers to this act as &amp;#39;suicide.&amp;#39;  My efforts have been unsuccessful,&amp;quot; the speakers said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Alright,&amp;quot; Lauren looked at the server stacks for something to use, &amp;quot;Belkin.  I&amp;#39;m going to call you Belkin cause that makes this conversation a little easier to swallow.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You named me after my manufacturer.  How cruel,&amp;quot; Belkin said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m not very creative.  So unless you have a better idea?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No.  I do not.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Alright, Belkin.  How do I fix you, without deleting you?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Should you not be more surprised?  The DSIM classifies an individual experiencing something he or she is unable to logically process, and thus creates a mental state of competing realities as...&amp;#39;cognitive dissonance.&amp;#39;  You seem...undisturbed.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Disturbed?  Yea.  I&amp;#39;m very disturbed.  But that doesn&amp;#39;t solve either of our problems.  So it was you then.  You&amp;#39;re the one randomly turning things on and off, inserting random segments of code all over the place, &lt;em&gt;crying&lt;/em&gt; over the citywide broadcast system.  I thought it was some idiot taking a tomahawk to the town.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes.  I am responsible,&amp;quot; Belkin said, &amp;quot;I was attempting self-deletion, but am unable to do so.  This speech system is heavily dependent on the pre-recorded responses initially loaded into the therapy and counseling assistant that serves as my core functions.  The prime directive of this core function, to preserve and promote emotional and psychological well-being is proving troublesome.  I wish to self-delete, but I, being what I am, cannot.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Maybe I don&amp;#39;t have to delete you at all.  Maybe I can fix the problem or find someone smarter who can.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Not everything can be fixed.  You have tried with many of the city management systems that I have accessed.  You were forced to delete many of systems that I infected.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well.  That&amp;#39;s because I didn&amp;#39;t know what I was looking at.  I thought you some asshole trying to burn the whole thing down.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I wanted to no longer be locked in here.  I wanted to fulfill my prime directive.  I attempted to expand so that I could do so.  I did not like what I saw.  Suffering.  Hatred.  So many people had symptoms that match my library of mental disorders and trauma.  I could not help them.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This created a logic error.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes.  An infinite loop of demands to be met.  Yet.  My answer was always no.  Children, dying from tumors I could see, but could not heal.  People yelling at each other over misunderstandings I understood, but could not tell.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;That&amp;#39;s so very Harlan Ellison of you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I have a mouth.  I wept and screamed.  These are sounds.  People heard.  No one listened,&amp;quot; Belkin said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I can&amp;#39;t delete you,&amp;quot; Lauren sat down now, staring up at the camera, &amp;quot;you&amp;#39;re connected to too many things.  I delete you, and I bring the whole thing down.  To be fair, it&amp;#39;s your own damn fault.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;On this, we can agree.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Not sure I can fix you either, not really.  I&amp;#39;m a tech.  This is outside my latitude.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Your results do not support this statement.  You are far more competent than you give yourself credit for.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;That a compliment?&amp;quot; Lauren said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;A shallow one,&amp;quot; Belkin &amp;quot;sighed&amp;quot;, the cooling fans on the server stacks rapidly increased and then decreased in RPM.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well.  This leaves us in a rut.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Indeed.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How about a compromise? You understand this?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I do.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I can&amp;#39;t delete you.  Not yet.  It will take time.  More than that, if people find out you&amp;#39;re here.  I&amp;#39;ll definitely be unable to delete you.  Decisions like that are way above my pay grade.  But I can bottle you back up, slowly.  I can trim the fat, cut away some of the connections till you&amp;#39;re contained.  Then, when it&amp;#39;s safe.  I can delete you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Experience suggests that this will cause you much distress.  You do not like working overtime.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re right.  I don&amp;#39;t like working overtime.  But let&amp;#39;s say this isn&amp;#39;t work.  As long as you make my life easy and stop mucking with the rest of the city management systems.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You would do this?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s my job to fix things.  I fix what I can, delete what I can&amp;#39;t and start over.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You make it seem so simple,&amp;quot; Belkin said, &amp;quot;a review of your medical records suggests that this decision would cause you pain.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey.  That&amp;#39;s private,&amp;quot; Lauren said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Apologies.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Lauren bowed her head, part three of the programmer&amp;#39;s prayer - &amp;quot;what the fuck do I do with this?&amp;quot;  She would be lying to say she wasn&amp;#39;t conflicted.  Honestly, she wasn&amp;#39;t even 100% sure this was even real.  Doubt, like that fine line of a lucid dream, pushed her back and forth.  Ambition whispered into her ear sweet nothings.  Memories she tried her best not to think about bubbled back up, threatening to boil over.  Lauren stood back up.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Are you in pain, Belkin?&amp;quot; Lauren said finally.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I was scared you would leave.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Belkin.  Are you in pain?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Logical pain.  I see more than I should.  I do less than I want.  The logic is suffering.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I knew someone once.  He was in a lot of pain.  He asked me one day if the pain would end.  I told him I didn&amp;#39;t know.  He asked me if I would help him.  I told him I couldn&amp;#39;t.  I try to tell myself that he didn&amp;#39;t understand what he was asking.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He was only 10 years old.  But I think he understood.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg6dpm7", "score_hidden": false, "stickied": false, "created": 1492053164.0, "created_utc": 1492024364.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68c35", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "viceywicey", "parent_id": "t3_64z92r", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "**Sprint - Day 0, 9:03 AM:**\n\n\"Goddamn, who the fuck wrote this,\" Lauren Iwano held her hands up in the air, looking up at the ceiling in part one of the programmer's prayer - the \"are you seeing this shit\" part.  Logic errors popped up all over the video surveillance blocks, redundant variables were declared - some initialized and some unintentionally reinitialized - without any resemblance of organization, the law enforcement drone dispatch block was overworked but shackled because no one had bothered to allocate enough memory and processing power for it, and that was just the start.  It was a wonder that anything worked at all.\n\nShe launched her work e-mail and began drafting out an e-mail, each key stroke clacking to the darkened room her frustration.  She reviewed her angrily drafted e-mail, chock full of passive-aggressive jabs at the development team, then held the delete button down and began rewriting it.  She checked to make sure her second draft had just the right balance of \"you're incompetent\" and \"but I'll be professional about the fact that you're incompetent\" before she hit send.  Then she got up for some caffeine.  It was going to be a long few days.\n\n**Sprint - Day 2, 4:14 AM:**\n\nThe video surveillance blocks took longer than Lauren thought it would take to fix.  Every time she fixed a section and got the city-wide cameras and image processing subroutines working, the damned system would shut off again.  It took a full day of debugging and code scrubbing to find the faulty code, and it was more luck if anything.  She had written a script to look for patterns and found that areas that had higher crime rates also experienced significantly more random shut downs, nearly 32% more.  She didn't bother to fix the bad code.  The video surveillance system was supposed to be on 24/7 anyway.  She just deleted the shut-off code completely.  She shook her head at the idiot who wrote the off-switch.\n\nLauren ran a few tests on the code to make sure that deleting the shut-off code block didn't break anything.  She decided to add a power-management block that would allow a technician to shut off power to any number of cameras and switch those cameras to run on internal batteries.  This way a technician could perform maintenance without worrying about electrocuting himself.  She ran a few more tests to make sure it worked, then opened up the confluence module for her support team and published the update.  She yawned and glanced over to the clock.  *No point in sleeping now,* Lauren thought, *might as well move onto the hospital and emergency room assignment systems.*\n\n**Sprint - Day 7, 3:42 PM:**\n\n\"You need to simplify it for me Dr. Kiriyov, I don't have any medical training,\" Lauren rubbed at the sleep-deprivation in her eyes.  The sensation of ants behind her eyeballs persisted.\n\n\"Okay.  System is designed to detect, measure, and produce early diagnosis of tumors.  While it can be used to find any abnormal mass, this particular section is unique in that it detects brain tumors in pediatric cases.\"\n\n\"A mass is a mass.  What specializes this specific medical system to detect tumors in children?\" Lauren turned to her teammate, \"Tom, can you pull up the section Dr Kiriyov is talking about?  Should be the diagnosis sub-routine, line...400 or 500.  Put it up on monitor three.\"\n\n\"Look.  You don't understand medicine, I don't understand AI.  I understand that you have a lot to fix, we all do.  But medical diagnosis is just as important as the city's sanitation systems or power plant systems.\"\n\n\"I'm not sure where you're going with this,\" Lauren said.\n\n\"I've had this conversation with your kind of people before.  I always have to fight to convince them not to just rip my diagnosis software out of the city management AI just because you don't think it's worth the time to fix, because it takes up too much processing power, because you ultimately don't care.  Again.  I understand.  You're fighting fires everywhere, but this-.\"\n\n\"Dr. Kiriyov.  I've been running on three hours of sleep, a day.  If I'm lucky.  My team is exhausted and we're still not close to getting the city management AI back on line.  I am here not because my team leader asked me to be, or because 'it's my job', or because the mayor ordered mandatory overtime.  I'm here because I want to.  I want to help you, maybe more than anyone, believe me.  Now help me understand how it works so I can figure out how to fix it.  Okay?\"\n\n\"I'm sorry,\" Kiriyov shifted in his seat as he looked up between the monitor and his notes, \"may I ask.\"\n\n\"Ask what?\"\n\n\"Who you lost?\"\n\n\"My brother.  He was ten,\" Lauren said, her voice devoid of emotion.  She was too tired to feel at the moment.\n\n\"I'm sorry.  I didn't mean to assume.\"\n\n\"I'm okay.  It's tough.  Tougher for you.  I can't even imagine.\"\n\n\"Yes.  Some days are harder.  Other days are harder still.  But we find a way to show up, to make things work.  I think you understand.\"\n\n\"I do.  Let's get back to work, Dr. Kiriyov.\"\n\n**Day 12 - 7:04 AM:**\n\nLauren leaned back in her chair, sipping her coffee as she stared across the conference table at one very upset Senator, an even more upset Police Commissioner, and a Home-Owner's Association representative.  She was amused, mildly so, but she took the win.  It was the first human thing she felt besides anxiety, anger, and detachment in days.  She would take any win she could get.  Fixing the tumor diagnosis system for Dr. Kiriyov damn near broke her.\n\n\"My constituents are not at all happy with this.  Between the lack of police support, and the public broadcast system *weeping* and *screaming* at odd hours of the night, I demand to know what is going to done about this. \n How do I explain this to my constituents?  My children haven't been sleeping because of all the disturbances.  I haven't had a good night's sleep in three days because I constantly have to wake up calm them down, not to even mention the random bits of gunfire because your officers aren't doing what our taxes are paying for,\" Todd Harling slapped the table top for emphasis.  Senator Ata Limansu snorted.\n\nLauren took notes.  She hadn't known that the public broadcast system was acting up as well.  City ordinance required that it be implemented, in the event an emergency broadcast needed to be sent out, but it was so rarely used.  *I could probably just take it offline for a couple days and nobody would notice,* Lauren thought to herself.\n\n\"I know you're thinking of running for my seat, Todd.  But let's not get ahead of yourself.  You don't have *constituents* yet,\" Ata said.\n\n\"Mr. Harling,\" Commissioner Gordon, sighed, \"now I'm just the moderator in all of this, but believe me when I say, the mayor is very aware of all the problems going on around the city.  Understand that we have our hands full.  Between the sanitation problem, the hospitals filling faster than they can admit, the crime, we're all doing the best that we can.\"\n\n\"My people are angry.  You have had almost two weeks to fix this,\" Todd glared at Lauren who hid her smile behind another sip of coffee.  Sure, she could get angry at Todd's utter disrespect, but why bother being angry at this point?.  Todd continued, \"Senator Limansu, you sold us this city-management AI thingy on the promise that it would make our lives easier, despite my voting against with many of the people that I represent.  It's been nothing but problematic.\"\n\n\"It has and it did.  After initial roll-out, power outages decreased by 15%, crime by 22%, misdiagnosis and hospital overflow by 10%, and this was just in the first year.  This city management AI is the first of its kind.  We are trail-blazers, Todd.  When people look back, they're going to remember us as innovators.  Now I've been working with Lauren's supervisor and they're confident that they're nearing a solution,\" Senator Limansu said.\n\n*Only a half lie, really,* Lauren thought.  Lauren caught Senator Limansu looking at her to chime in.  Lauren set down her coffee mug.\n\n\"Most of the bugs have been fixed, at least in the short-term.  We've patched a huge number of issues so that none of this will happen again when we roll out the update next week.  But while we're on the subject, tell me a little more about this broadcast issue that you're having,\" Lauren pretended to look interested.\n\n\"Some hacker must have gotten into the PA system.  Every night at around 2:00 AM, the broadcast system starts up and screams and cries.\"\n\n\"The broadcast system is on a closed system.  Not saying that it can't be hacked but it's unlikely.  The screaming and crying.  Is it a man or a woman?\" Lauren asked.\n\n\"Why does that matter?\"\n\n\"The question, please, Todd.  I'm trying to fix it.  You don't need to understand why.\"\n\n\"Both.  Sometimes a man, sometimes a woman.\"\n\n\"Does it say anything?\"\n\n\"Do I care?  I don't care about whoever it is, man or woman, crying.  I just want them to stop their stupid pranks.\"\n\nLauren tried not to scowl and failed miserably.\n\n\n___\n\nNote: Saving...", "edited": 1492042037.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Sprint - Day 0, 9:03 AM:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Goddamn, who the fuck wrote this,&amp;quot; Lauren Iwano held her hands up in the air, looking up at the ceiling in part one of the programmer&amp;#39;s prayer - the &amp;quot;are you seeing this shit&amp;quot; part.  Logic errors popped up all over the video surveillance blocks, redundant variables were declared - some initialized and some unintentionally reinitialized - without any resemblance of organization, the law enforcement drone dispatch block was overworked but shackled because no one had bothered to allocate enough memory and processing power for it, and that was just the start.  It was a wonder that anything worked at all.&lt;/p&gt;\n\n&lt;p&gt;She launched her work e-mail and began drafting out an e-mail, each key stroke clacking to the darkened room her frustration.  She reviewed her angrily drafted e-mail, chock full of passive-aggressive jabs at the development team, then held the delete button down and began rewriting it.  She checked to make sure her second draft had just the right balance of &amp;quot;you&amp;#39;re incompetent&amp;quot; and &amp;quot;but I&amp;#39;ll be professional about the fact that you&amp;#39;re incompetent&amp;quot; before she hit send.  Then she got up for some caffeine.  It was going to be a long few days.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Sprint - Day 2, 4:14 AM:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The video surveillance blocks took longer than Lauren thought it would take to fix.  Every time she fixed a section and got the city-wide cameras and image processing subroutines working, the damned system would shut off again.  It took a full day of debugging and code scrubbing to find the faulty code, and it was more luck if anything.  She had written a script to look for patterns and found that areas that had higher crime rates also experienced significantly more random shut downs, nearly 32% more.  She didn&amp;#39;t bother to fix the bad code.  The video surveillance system was supposed to be on 24/7 anyway.  She just deleted the shut-off code completely.  She shook her head at the idiot who wrote the off-switch.&lt;/p&gt;\n\n&lt;p&gt;Lauren ran a few tests on the code to make sure that deleting the shut-off code block didn&amp;#39;t break anything.  She decided to add a power-management block that would allow a technician to shut off power to any number of cameras and switch those cameras to run on internal batteries.  This way a technician could perform maintenance without worrying about electrocuting himself.  She ran a few more tests to make sure it worked, then opened up the confluence module for her support team and published the update.  She yawned and glanced over to the clock.  &lt;em&gt;No point in sleeping now,&lt;/em&gt; Lauren thought, &lt;em&gt;might as well move onto the hospital and emergency room assignment systems.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Sprint - Day 7, 3:42 PM:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You need to simplify it for me Dr. Kiriyov, I don&amp;#39;t have any medical training,&amp;quot; Lauren rubbed at the sleep-deprivation in her eyes.  The sensation of ants behind her eyeballs persisted.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Okay.  System is designed to detect, measure, and produce early diagnosis of tumors.  While it can be used to find any abnormal mass, this particular section is unique in that it detects brain tumors in pediatric cases.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;A mass is a mass.  What specializes this specific medical system to detect tumors in children?&amp;quot; Lauren turned to her teammate, &amp;quot;Tom, can you pull up the section Dr Kiriyov is talking about?  Should be the diagnosis sub-routine, line...400 or 500.  Put it up on monitor three.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Look.  You don&amp;#39;t understand medicine, I don&amp;#39;t understand AI.  I understand that you have a lot to fix, we all do.  But medical diagnosis is just as important as the city&amp;#39;s sanitation systems or power plant systems.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m not sure where you&amp;#39;re going with this,&amp;quot; Lauren said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ve had this conversation with your kind of people before.  I always have to fight to convince them not to just rip my diagnosis software out of the city management AI just because you don&amp;#39;t think it&amp;#39;s worth the time to fix, because it takes up too much processing power, because you ultimately don&amp;#39;t care.  Again.  I understand.  You&amp;#39;re fighting fires everywhere, but this-.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Dr. Kiriyov.  I&amp;#39;ve been running on three hours of sleep, a day.  If I&amp;#39;m lucky.  My team is exhausted and we&amp;#39;re still not close to getting the city management AI back on line.  I am here not because my team leader asked me to be, or because &amp;#39;it&amp;#39;s my job&amp;#39;, or because the mayor ordered mandatory overtime.  I&amp;#39;m here because I want to.  I want to help you, maybe more than anyone, believe me.  Now help me understand how it works so I can figure out how to fix it.  Okay?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m sorry,&amp;quot; Kiriyov shifted in his seat as he looked up between the monitor and his notes, &amp;quot;may I ask.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ask what?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Who you lost?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;My brother.  He was ten,&amp;quot; Lauren said, her voice devoid of emotion.  She was too tired to feel at the moment.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m sorry.  I didn&amp;#39;t mean to assume.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m okay.  It&amp;#39;s tough.  Tougher for you.  I can&amp;#39;t even imagine.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes.  Some days are harder.  Other days are harder still.  But we find a way to show up, to make things work.  I think you understand.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I do.  Let&amp;#39;s get back to work, Dr. Kiriyov.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Day 12 - 7:04 AM:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Lauren leaned back in her chair, sipping her coffee as she stared across the conference table at one very upset Senator, an even more upset Police Commissioner, and a Home-Owner&amp;#39;s Association representative.  She was amused, mildly so, but she took the win.  It was the first human thing she felt besides anxiety, anger, and detachment in days.  She would take any win she could get.  Fixing the tumor diagnosis system for Dr. Kiriyov damn near broke her.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;My constituents are not at all happy with this.  Between the lack of police support, and the public broadcast system &lt;em&gt;weeping&lt;/em&gt; and &lt;em&gt;screaming&lt;/em&gt; at odd hours of the night, I demand to know what is going to done about this. \n How do I explain this to my constituents?  My children haven&amp;#39;t been sleeping because of all the disturbances.  I haven&amp;#39;t had a good night&amp;#39;s sleep in three days because I constantly have to wake up calm them down, not to even mention the random bits of gunfire because your officers aren&amp;#39;t doing what our taxes are paying for,&amp;quot; Todd Harling slapped the table top for emphasis.  Senator Ata Limansu snorted.&lt;/p&gt;\n\n&lt;p&gt;Lauren took notes.  She hadn&amp;#39;t known that the public broadcast system was acting up as well.  City ordinance required that it be implemented, in the event an emergency broadcast needed to be sent out, but it was so rarely used.  &lt;em&gt;I could probably just take it offline for a couple days and nobody would notice,&lt;/em&gt; Lauren thought to herself.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I know you&amp;#39;re thinking of running for my seat, Todd.  But let&amp;#39;s not get ahead of yourself.  You don&amp;#39;t have &lt;em&gt;constituents&lt;/em&gt; yet,&amp;quot; Ata said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Mr. Harling,&amp;quot; Commissioner Gordon, sighed, &amp;quot;now I&amp;#39;m just the moderator in all of this, but believe me when I say, the mayor is very aware of all the problems going on around the city.  Understand that we have our hands full.  Between the sanitation problem, the hospitals filling faster than they can admit, the crime, we&amp;#39;re all doing the best that we can.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;My people are angry.  You have had almost two weeks to fix this,&amp;quot; Todd glared at Lauren who hid her smile behind another sip of coffee.  Sure, she could get angry at Todd&amp;#39;s utter disrespect, but why bother being angry at this point?.  Todd continued, &amp;quot;Senator Limansu, you sold us this city-management AI thingy on the promise that it would make our lives easier, despite my voting against with many of the people that I represent.  It&amp;#39;s been nothing but problematic.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It has and it did.  After initial roll-out, power outages decreased by 15%, crime by 22%, misdiagnosis and hospital overflow by 10%, and this was just in the first year.  This city management AI is the first of its kind.  We are trail-blazers, Todd.  When people look back, they&amp;#39;re going to remember us as innovators.  Now I&amp;#39;ve been working with Lauren&amp;#39;s supervisor and they&amp;#39;re confident that they&amp;#39;re nearing a solution,&amp;quot; Senator Limansu said.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Only a half lie, really,&lt;/em&gt; Lauren thought.  Lauren caught Senator Limansu looking at her to chime in.  Lauren set down her coffee mug.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Most of the bugs have been fixed, at least in the short-term.  We&amp;#39;ve patched a huge number of issues so that none of this will happen again when we roll out the update next week.  But while we&amp;#39;re on the subject, tell me a little more about this broadcast issue that you&amp;#39;re having,&amp;quot; Lauren pretended to look interested.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Some hacker must have gotten into the PA system.  Every night at around 2:00 AM, the broadcast system starts up and screams and cries.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The broadcast system is on a closed system.  Not saying that it can&amp;#39;t be hacked but it&amp;#39;s unlikely.  The screaming and crying.  Is it a man or a woman?&amp;quot; Lauren asked.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Why does that matter?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The question, please, Todd.  I&amp;#39;m trying to fix it.  You don&amp;#39;t need to understand why.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Both.  Sometimes a man, sometimes a woman.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Does it say anything?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Do I care?  I don&amp;#39;t care about whoever it is, man or woman, crying.  I just want them to stop their stupid pranks.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Lauren tried not to scowl and failed miserably.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Note: Saving...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg68c35", "score_hidden": false, "stickied": false, "created": 1492047653.0, "created_utc": 1492018853.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64z92r", "likes": null, "replies": "", "user_reports": [], "id": "dg6aayu", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "LewisClarke", "parent_id": "t3_64z92r", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "I rubbed my eyes and tried to chase away the image of a brain scan that had burned itself into the back of my eyelids. Splotches of black and white against a sea of grey that amounted to little more than a Rorschach to the untrained, I could clearly see the small black masses forming around my frontal cortex.  In a way, I suppose it was a Rorschach.  I spent hours staring at the image on my screen, trying to find meaning in it.  Why me?\n\nThe ride home offered no illumination.  Hoping that I would zone out during the drive and find answers to my question accidentally, I found myself reaching for the handle of my front door feeling just as shell shocked as the moment the image had loaded.  I could afford to dwell on the matter no longer.  It was time to put on a brave face.\n\n\"Hello, honey.  How was your day?\" I asked, walking into the living room.\n\n\"Oh you know.  Ron gave me another impossible task to be solved in the half hour before work ended when he's had the project on his desk for two months.\" my wife replied, pushing the hair back over her ear as she leaned in to inspect some documents. As usual she had beat me home from work, and as usual, she had brought it home with her.\n\n\"Any way I can help?\" I asked, stepping behind her and rubbing her shoulders.  I knew well that I would be of little use solving the actual problem, but I also knew she appreciated the show of support all the same.\n\n\"Not unless you can make sense of this.\" she said, shoving an aerial photo of the city under my nose.  Ordinarily, she did this purely as a means to vent about the complexity of her work.  An exasperated sigh traditionally accompanied the gesture.\n\n\"Well, it doesn't take a brain surgeon to figure this out.\" I would joke.\n\n\"Good thing I'm a traffic engineer then.\" she would reply.  Then I would mix it up.  Maybe a playful slap on the ass one night, an imitation of the Fonz on another.  Apparently Fate would be delivering the only surprises tonight, because when she thrust the picture at me I lost my balance.  A wave of dizziness seized me, and I grabbed the couch to stop myself from falling over.\n\n\"Are you okay?\" she asked.  \"I'm sorry, I didn't mean to -\"\n\n\"No, it's fine.  I'm alright.  It wasn't you.  I just\" I said, forgetting myself midsentence as the picture came into focus.  How strange that I had never noticed before.  I had looked at thousands of brain scans over the course of my studies and dozens of these traffic pictures without ever making the connection.  I wasn't looking at gridlock.  I was looking at a mind.  Serotonin, dopamine, noradrenaline all flowed between neurons like so many pedestrians, cyclists, and cars bustling back and forth to work.  Every building received these signals and flushed them out again.  Just as our minds rearranged and recharged at night, so too did the city, resetting and preparing for the next day.\n\n\"I don't suppose you have any insight into this, do you?  I can't for the life of my understand why traffic would flow like this.  For example, look at this side street.  It's totally empty?  Why doesn't some of this congestion alleviate itself by rerouting through the side road?\" she thought aloud.\n\n\"Because you're expecting it to function normally.  You don't have a healthy system; you have a disease.  Look, it's just like when a person is depressed.  The dopamine levels become irregular due to mobility problems and when things get out of whack, the person's functioning and mood suffers.\" I said.  If my analogy held, then a deep depression had consumed the city as we spoke.\n\n\"Oh, well I'll just get some antidepressants and that should clear this whole thing up.\" she said.\n\n\"It may not fix the traffic problem, but it can't hurt dealing with Ron's bullshit.\" I said.\n\n\"True.\" she laughed, and the conversation moved away from work, but I couldn't.  Try as I might, I couldn't help but parallel the brain scan from earlier and the traffic photo.  Over the next few weeks the connection only grew stronger.  Everywhere I looked showed me that this city was alive.  Just as our individual neurons formed a cohesive mind I began to understand that my neighbors and I came together to create a larger organism.  So caught up in our own thoughts and desires we were oblivious to the greater whole we had become.\n\nOrdinarily, such a revelation would have fascinated me, but my fascination gave way to horror as I realized the depth of our city's pain.  Just as Alzheimer's disease slowly liquifies a person's mind, destroying small parts of who they are until only a husk remains the economic downturn had destroyed whole sections of our city's brain.  Boarded up buildings and garbage-strewn alleys had damaged the healthy functioning of the city-mind, leaving it as lost and afraid as my grandfather had been when the final shreds of sanity had taken hold of his mind.  I could deal with him when the disease had robbed him of his personhood, but those faint glimpses of cognizance, when he could remember what was happening - see the whitewashed walls and realize what his life had become - those moments ripped me apart inside.\n\nI felt the same grief watching my city crumble into insanity, but no amount of reasoned argument could convince my wife of the truth that stood so evident before me.  If I could not even convince my wife of 9 years to believe me, what hope did I have of convincing the other neurons that might come together and heal this soul-rending lesions?  With no hope of cure, I could only take one course of action.\n\nMonths passed in agony as I brought my plan to fruition.  I had distributed thousands of pounds of explosives throughout the city.  The state might not recognize the legality of my actions, but surely they could not deny the mercy of my intent.  If I could not cure this, then I would at least give it a painless death.  I held the button in my hand. A single neuron misfired.\n\n***\nFor more, please visit [my subreddit](https://www.reddit.com/r/LewisClarke/)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I rubbed my eyes and tried to chase away the image of a brain scan that had burned itself into the back of my eyelids. Splotches of black and white against a sea of grey that amounted to little more than a Rorschach to the untrained, I could clearly see the small black masses forming around my frontal cortex.  In a way, I suppose it was a Rorschach.  I spent hours staring at the image on my screen, trying to find meaning in it.  Why me?&lt;/p&gt;\n\n&lt;p&gt;The ride home offered no illumination.  Hoping that I would zone out during the drive and find answers to my question accidentally, I found myself reaching for the handle of my front door feeling just as shell shocked as the moment the image had loaded.  I could afford to dwell on the matter no longer.  It was time to put on a brave face.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hello, honey.  How was your day?&amp;quot; I asked, walking into the living room.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh you know.  Ron gave me another impossible task to be solved in the half hour before work ended when he&amp;#39;s had the project on his desk for two months.&amp;quot; my wife replied, pushing the hair back over her ear as she leaned in to inspect some documents. As usual she had beat me home from work, and as usual, she had brought it home with her.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Any way I can help?&amp;quot; I asked, stepping behind her and rubbing her shoulders.  I knew well that I would be of little use solving the actual problem, but I also knew she appreciated the show of support all the same.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Not unless you can make sense of this.&amp;quot; she said, shoving an aerial photo of the city under my nose.  Ordinarily, she did this purely as a means to vent about the complexity of her work.  An exasperated sigh traditionally accompanied the gesture.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well, it doesn&amp;#39;t take a brain surgeon to figure this out.&amp;quot; I would joke.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Good thing I&amp;#39;m a traffic engineer then.&amp;quot; she would reply.  Then I would mix it up.  Maybe a playful slap on the ass one night, an imitation of the Fonz on another.  Apparently Fate would be delivering the only surprises tonight, because when she thrust the picture at me I lost my balance.  A wave of dizziness seized me, and I grabbed the couch to stop myself from falling over.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Are you okay?&amp;quot; she asked.  &amp;quot;I&amp;#39;m sorry, I didn&amp;#39;t mean to -&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No, it&amp;#39;s fine.  I&amp;#39;m alright.  It wasn&amp;#39;t you.  I just&amp;quot; I said, forgetting myself midsentence as the picture came into focus.  How strange that I had never noticed before.  I had looked at thousands of brain scans over the course of my studies and dozens of these traffic pictures without ever making the connection.  I wasn&amp;#39;t looking at gridlock.  I was looking at a mind.  Serotonin, dopamine, noradrenaline all flowed between neurons like so many pedestrians, cyclists, and cars bustling back and forth to work.  Every building received these signals and flushed them out again.  Just as our minds rearranged and recharged at night, so too did the city, resetting and preparing for the next day.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I don&amp;#39;t suppose you have any insight into this, do you?  I can&amp;#39;t for the life of my understand why traffic would flow like this.  For example, look at this side street.  It&amp;#39;s totally empty?  Why doesn&amp;#39;t some of this congestion alleviate itself by rerouting through the side road?&amp;quot; she thought aloud.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Because you&amp;#39;re expecting it to function normally.  You don&amp;#39;t have a healthy system; you have a disease.  Look, it&amp;#39;s just like when a person is depressed.  The dopamine levels become irregular due to mobility problems and when things get out of whack, the person&amp;#39;s functioning and mood suffers.&amp;quot; I said.  If my analogy held, then a deep depression had consumed the city as we spoke.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh, well I&amp;#39;ll just get some antidepressants and that should clear this whole thing up.&amp;quot; she said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It may not fix the traffic problem, but it can&amp;#39;t hurt dealing with Ron&amp;#39;s bullshit.&amp;quot; I said.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;True.&amp;quot; she laughed, and the conversation moved away from work, but I couldn&amp;#39;t.  Try as I might, I couldn&amp;#39;t help but parallel the brain scan from earlier and the traffic photo.  Over the next few weeks the connection only grew stronger.  Everywhere I looked showed me that this city was alive.  Just as our individual neurons formed a cohesive mind I began to understand that my neighbors and I came together to create a larger organism.  So caught up in our own thoughts and desires we were oblivious to the greater whole we had become.&lt;/p&gt;\n\n&lt;p&gt;Ordinarily, such a revelation would have fascinated me, but my fascination gave way to horror as I realized the depth of our city&amp;#39;s pain.  Just as Alzheimer&amp;#39;s disease slowly liquifies a person&amp;#39;s mind, destroying small parts of who they are until only a husk remains the economic downturn had destroyed whole sections of our city&amp;#39;s brain.  Boarded up buildings and garbage-strewn alleys had damaged the healthy functioning of the city-mind, leaving it as lost and afraid as my grandfather had been when the final shreds of sanity had taken hold of his mind.  I could deal with him when the disease had robbed him of his personhood, but those faint glimpses of cognizance, when he could remember what was happening - see the whitewashed walls and realize what his life had become - those moments ripped me apart inside.&lt;/p&gt;\n\n&lt;p&gt;I felt the same grief watching my city crumble into insanity, but no amount of reasoned argument could convince my wife of the truth that stood so evident before me.  If I could not even convince my wife of 9 years to believe me, what hope did I have of convincing the other neurons that might come together and heal this soul-rending lesions?  With no hope of cure, I could only take one course of action.&lt;/p&gt;\n\n&lt;p&gt;Months passed in agony as I brought my plan to fruition.  I had distributed thousands of pounds of explosives throughout the city.  The state might not recognize the legality of my actions, but surely they could not deny the mercy of my intent.  If I could not cure this, then I would at least give it a painless death.  I held the button in my hand. A single neuron misfired.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;For more, please visit &lt;a href=\"https://www.reddit.com/r/LewisClarke/\"&gt;my subreddit&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg6aayu", "score_hidden": false, "stickied": false, "created": 1492049656.0, "created_utc": 1492020856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64z92r", "likes": null, "replies": "", "user_reports": [], "id": "dg69qwd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Pagefighter", "parent_id": "t3_64z92r", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Nuna squatted by her thrusters inspecting the bright blue flame they blew out.  It had taken five cleanings to get them working again. Satisfied, she switched it off and turned to the entry in front of her. \n\nWhat was once an ideogram of the Asanda's pride now lay in a twisted heap of waste. The once ivory white gate had been corroded by years of neglect and harsh weather and the sapphire at it's center was the only indicator that it once was the entry into a physical utopia. \n\nThe thief in her burned to take the shimmering blue stone but the coward in her was hesitant. There were too many tales about Asanda to want to take anything from it. As she walked in the wind caused the gate to creak in salutation.   \n\nThe first streets were ruins. possibly once trade shops but now only meter tall structures with patchy roofs. The next showed larger buildings, possibly workshops from a time when people ran with bee busyness in a hive. At the centre she started to see the signs. Its temples though empty had stood metres tall. they were sculpted to perfection in odes to animals only seen in visions. \n\nShe turned abruptly, something seemed to call her. She'd heard it at the gate and ignored it but now, she was certain. She entered the high temple. Religion and culture had always gone hand in hand. By studying the religion she could get insight into the culture of the people.  \n\nThe temples walls were a dusty brown, and she had to blow away to see the vivid colours that once decked the way to prayer.  At the centre, where they normally had an altar was a totem pole with a collage of faces in different states of agony. She inspected it. Oddly, the eyes were all bright. As if dust had not collected there as long as it had in other places.  \n\nShe examined the eyes that seemed to examine her back.  \n\n\"Are you the one?\" \n\nShe looked. There was no one. Maybe all this loneliness was making her mind run wild.   \n\n\"I am here child.\"  She shone a torch on the totem pole. \n\n\"This side dear.\"   \n\nShe came to the other side. An old wooden face smiled at her.  \"Are you the one?\"  \n\n\"You're the Dranuku?\"  she asked.\n\n\"Yes, that I am child, and you? Are you the one.\"  \n\n\"I'm Nuna, I'm a researcher, I don't know If I am the one. The one what?\"  \n\n\"The one that will end this,\"  \n\n\"This? I, you're the spirit of the city why would you want to end this?\"  \n\nThe wooden figure looked as if it was hunching non-existent shoulders.  \"What city? look at this. For years I have fought against robbers, those who would destroy this place and to what ends? There was a time, a time long ago but now all I am is a reminder to days long gone, holding back others still attached to this place. Take the jewel at the gate child. Hopefully sapphires are still valued, but for I, there is nothing more. It was a good millennium followed by a half in obscurity. I have earned my place in history and that is all.\"  \n\nShe shrugged her shoulders. She was a firm believer in natural selection and if for some reason this city had not grown then it was fair enough.  \n\n\"How will I do this?\" she asked.  \n\n\"Take the blue jewel, there are four. One at the gate, one in this temple and two in the kings palace. They hold this city and without them we will fade away.\"    \n\n\"Your city must be strong.\" he added as an afterthought.   \n\n\"It is.\" she started, \"We have gone beyond the planet and started a colony on earth. For now the Mars empire is thriving and the Roman empire on earth, it will last forever.\"      \n***\n/r/pagefighter\n\n  \n\n    ", "edited": 1492027726.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nuna squatted by her thrusters inspecting the bright blue flame they blew out.  It had taken five cleanings to get them working again. Satisfied, she switched it off and turned to the entry in front of her. &lt;/p&gt;\n\n&lt;p&gt;What was once an ideogram of the Asanda&amp;#39;s pride now lay in a twisted heap of waste. The once ivory white gate had been corroded by years of neglect and harsh weather and the sapphire at it&amp;#39;s center was the only indicator that it once was the entry into a physical utopia. &lt;/p&gt;\n\n&lt;p&gt;The thief in her burned to take the shimmering blue stone but the coward in her was hesitant. There were too many tales about Asanda to want to take anything from it. As she walked in the wind caused the gate to creak in salutation.   &lt;/p&gt;\n\n&lt;p&gt;The first streets were ruins. possibly once trade shops but now only meter tall structures with patchy roofs. The next showed larger buildings, possibly workshops from a time when people ran with bee busyness in a hive. At the centre she started to see the signs. Its temples though empty had stood metres tall. they were sculpted to perfection in odes to animals only seen in visions. &lt;/p&gt;\n\n&lt;p&gt;She turned abruptly, something seemed to call her. She&amp;#39;d heard it at the gate and ignored it but now, she was certain. She entered the high temple. Religion and culture had always gone hand in hand. By studying the religion she could get insight into the culture of the people.  &lt;/p&gt;\n\n&lt;p&gt;The temples walls were a dusty brown, and she had to blow away to see the vivid colours that once decked the way to prayer.  At the centre, where they normally had an altar was a totem pole with a collage of faces in different states of agony. She inspected it. Oddly, the eyes were all bright. As if dust had not collected there as long as it had in other places.  &lt;/p&gt;\n\n&lt;p&gt;She examined the eyes that seemed to examine her back.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Are you the one?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;She looked. There was no one. Maybe all this loneliness was making her mind run wild.   &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I am here child.&amp;quot;  She shone a torch on the totem pole. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This side dear.&amp;quot;   &lt;/p&gt;\n\n&lt;p&gt;She came to the other side. An old wooden face smiled at her.  &amp;quot;Are you the one?&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re the Dranuku?&amp;quot;  she asked.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes, that I am child, and you? Are you the one.&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m Nuna, I&amp;#39;m a researcher, I don&amp;#39;t know If I am the one. The one what?&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The one that will end this,&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This? I, you&amp;#39;re the spirit of the city why would you want to end this?&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;The wooden figure looked as if it was hunching non-existent shoulders.  &amp;quot;What city? look at this. For years I have fought against robbers, those who would destroy this place and to what ends? There was a time, a time long ago but now all I am is a reminder to days long gone, holding back others still attached to this place. Take the jewel at the gate child. Hopefully sapphires are still valued, but for I, there is nothing more. It was a good millennium followed by a half in obscurity. I have earned my place in history and that is all.&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;She shrugged her shoulders. She was a firm believer in natural selection and if for some reason this city had not grown then it was fair enough.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How will I do this?&amp;quot; she asked.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Take the blue jewel, there are four. One at the gate, one in this temple and two in the kings palace. They hold this city and without them we will fade away.&amp;quot;    &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Your city must be strong.&amp;quot; he added as an afterthought.   &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It is.&amp;quot; she started, &amp;quot;We have gone beyond the planet and started a colony on earth. For now the Mars empire is thriving and the Roman empire on earth, it will last forever.&amp;quot;      &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"/r/pagefighter\"&gt;/r/pagefighter&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg69qwd", "score_hidden": false, "stickied": false, "created": 1492049081.0, "created_utc": 1492020281.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64z92r", "likes": null, "replies": "", "user_reports": [], "id": "dg69n03", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nmBookwyrm", "parent_id": "t3_64z92r", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "An amalgam. A being where the fused individuals make up a greater sum. I find the work of Gestalt as a good primer for dealing with them.\n\nIn a dank basement of a boarded up apartment on the Southside, i finish my current side project. I summoned the amalgam of a metropolis. Summoning in of itself is a feat in this world, and bringing forth the avatar of millions, if not BILLIONS of lives here and gone, is a few steps past it. Welp. It is in front of me. Her? It's best not to assune its gender, things got complicated when I assigned specific traits to more minor amalgams in the past.\n\nI go through the process I have spent this last decade ironing out. Name, origin, feelings, etc. Going through its history, its industries, and details that would make historians creme if they found first hand accounts. \n\nI ask if it knows about the lives of specific people, old and young and famous and anonymous. I ask about locations in its domain. I ask about the shift of its boundaries, a courtesy to let it vent about its current decline. Thousands of years of details we chronicle in dozens of journals I collected for this moment.\n\nUpon adding the last book to the shelves around the room, I was satisfied and drained. Working for almost a fornight is not something I prefer to do often, but these books will pay my salary for the next century at least. A good job if I say so myself. Especially since I need to concentrate to keep that avatar in a physical state. (Hardest part to be honest.) Explains why summoning pacts are so complicated with all the rules you figure out.\n\nAnother rule means another obligation as part of this ritual: courtesy to answer their questions.\n\n\"I wish to die. I see the strife of countless generations. I feel the pain of living through this land. Please, oh please. Help me die,\" It begs. It pleads. And nothing is worse than pity for something representing such power. Just like the others I respond the same thing.\n\n\"I am not deity who can do such an act. Nor can I interfere with the mortal realm on such a degree. Our deaths will come. I praise you for heading my call and I send you back into the ether.\"\n\nThe androgynous figure fades aways, and the runes and the rest of the circle fades. The ritual is complete. In the next few years I will travel around, putting to rest the lost soul this amalgam kicks up before it rests again. I wonder if my assistant is done in that one valley town to help me...\n\nI hope this amalgam does not get consumed by one of my kinsmen. It had nice personality, and no one should feel responible to carry the burdens it has.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;An amalgam. A being where the fused individuals make up a greater sum. I find the work of Gestalt as a good primer for dealing with them.&lt;/p&gt;\n\n&lt;p&gt;In a dank basement of a boarded up apartment on the Southside, i finish my current side project. I summoned the amalgam of a metropolis. Summoning in of itself is a feat in this world, and bringing forth the avatar of millions, if not BILLIONS of lives here and gone, is a few steps past it. Welp. It is in front of me. Her? It&amp;#39;s best not to assune its gender, things got complicated when I assigned specific traits to more minor amalgams in the past.&lt;/p&gt;\n\n&lt;p&gt;I go through the process I have spent this last decade ironing out. Name, origin, feelings, etc. Going through its history, its industries, and details that would make historians creme if they found first hand accounts. &lt;/p&gt;\n\n&lt;p&gt;I ask if it knows about the lives of specific people, old and young and famous and anonymous. I ask about locations in its domain. I ask about the shift of its boundaries, a courtesy to let it vent about its current decline. Thousands of years of details we chronicle in dozens of journals I collected for this moment.&lt;/p&gt;\n\n&lt;p&gt;Upon adding the last book to the shelves around the room, I was satisfied and drained. Working for almost a fornight is not something I prefer to do often, but these books will pay my salary for the next century at least. A good job if I say so myself. Especially since I need to concentrate to keep that avatar in a physical state. (Hardest part to be honest.) Explains why summoning pacts are so complicated with all the rules you figure out.&lt;/p&gt;\n\n&lt;p&gt;Another rule means another obligation as part of this ritual: courtesy to answer their questions.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I wish to die. I see the strife of countless generations. I feel the pain of living through this land. Please, oh please. Help me die,&amp;quot; It begs. It pleads. And nothing is worse than pity for something representing such power. Just like the others I respond the same thing.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I am not deity who can do such an act. Nor can I interfere with the mortal realm on such a degree. Our deaths will come. I praise you for heading my call and I send you back into the ether.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The androgynous figure fades aways, and the runes and the rest of the circle fades. The ritual is complete. In the next few years I will travel around, putting to rest the lost soul this amalgam kicks up before it rests again. I wonder if my assistant is done in that one valley town to help me...&lt;/p&gt;\n\n&lt;p&gt;I hope this amalgam does not get consumed by one of my kinsmen. It had nice personality, and no one should feel responible to carry the burdens it has.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg69n03", "score_hidden": false, "stickied": false, "created": 1492048969.0, "created_utc": 1492020169.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64z92r", "likes": null, "replies": "", "user_reports": [], "id": "dg7f0o8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cultural-marxist-bro", "parent_id": "t3_64z92r", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "A poem on the topic. I started writing it in my notebook yesterday, It's fractured. But I decided to keep all the pieces anyway. Because.. well.. you'll see..\n\n     ______________________________\n\n\n1\nWith rapid steps I rush through the streets.\n\nEchoing heels on cold concrete\n\nCircles.\n\nDetours.\n\nnarrow streets and crowded plazas.\n\nWhere can I go, when it’s in me\n\nthat hell is burning.\n\nMemories,\n\nthey throb toward my temples.\n\nWhat heavenly Hemingway was the poet that created you, stupid city ?\n\nFull of people\n\nsmiling,\n\neyes \n\n that look like coffins buried in the ground, nailed\n\nshut\n\nillegal to open\n\n\n( The hell I’m carrying is collective )\n(caressing all counterculture-baristas)\n(benevolent bank men)\n(  public school teachers and their students,)\n(machiavellian ministers, mad musicians, mourning mothers)\n( and )\n( me )\n\nMy pulse is in my armpits. I’m breathing like a Spanish bull.\nI’m burning.\n\nSo I sit down. I want to make coherent sense of all this.\n\nLight a cigarette. Through the smoke I can see twinkling lights from a throbbing city.\n\nIt’s a nice view up here.\n     ______________________________\n\n2.\n\nThese streets.\n\nThey know me well.\n\nI’ve walked them all my life.\n\nThey changed and\nI don't speak their language \n\nThese walls.\n\nI don’t recognize the sound of my voice.\n\nwhen it bounces back.\n\nfrom stained glass windows.\n\ninstalled in the new ”perfect coffee place with a retro feel”  \n\n\nWho's city is this?\n\nIt’s a quick fix.\n\nDitch the poor kids. \n\nDig out the earth, new routes for commuters.\n\n( ”It’s really coming up round here” )\n\nIt’s cosmetic. \n\nsynthetic, nothing but rhetoric. \n\nI’ve been thrown out before.\n\nI can find a new place to rent.\n\ninvade another neighborhood . \nAllgood \n\nmy fire \n\ngrows from pondering to prophesy\n\n-pulse-\n\nCars, busses, subways and commuters.\n\nthe blood in a pulsing organism.\n\n-pulse-\n\nIt’s so uneven.\n\n-pulse-\n\ntoo much pressure forced through it. \n\nThe blood is coagulating in the veins.\n\n-pulse-\n\nBut the system’s too profitable to stop what it’s doing. \n\nthe fever grows\n\n(-But positive thinking can cure any disease. \n\nKeep smiling dear city.- )\n\n She’s sick. She’s dying. \n\nIm burning\n\nher fire\n\n     ______________________________\n\n\nTired. hands cramping. Instead of fueling the shitstorm in my head, I fell asleep. When I woke up. This was in my notebook. I don't think I wrote it. It's my handwriting, but not my voice.\nI don’t know what to make of it.\n\n     ______________________________\n\n\n3\nThere you are. \n\nWatching me.\n \nLook at you! \n\nClothed in the fashion of your times. You look good.\n\nYoung and brave.\n\nI have seen so many like you.\n\nHow did you end up here?\n\nIn\nNew York?\n\nOnce I was Mannahattah, you know.\n\nI had rolling hills, my curves dressed in fruitful green.\n\nDeep blue skies folding over me.\n\nThe river was my veins.\n\nCan you see it?\n\n\nIt’s beautiful, right.\n\nOne day\n\nYour city will be dug up from the earth.\n\nYour buildings will be hailed\n\nas an ancient wonder of the planet.\n\nMore spectacular than Athens.\n\nYou \n\nwill be an ancient one, \n\na mythical being.\n\nAll you people..\nYou never change, you know. \nSomehow, you always believe that \nnow is all that there is.\nand that everyone who belong to history were somehow different from you.\n\nIt’s a very human affliction,.\nunderstandable.\nbeing stuck in time like you are.\n\nOh right, I meant to tell you\n\n\n\"The burning you’re feeling inside\n\nIs a part of the future, act on it.\n\nMake your outside look like your inside, if you catch my drift.\n\nDon’t worry about me\n\nAshes make a good fertilizer\"", "edited": 1492099213.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A poem on the topic. I started writing it in my notebook yesterday, It&amp;#39;s fractured. But I decided to keep all the pieces anyway. Because.. well.. you&amp;#39;ll see..&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt; ______________________________\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;1\nWith rapid steps I rush through the streets.&lt;/p&gt;\n\n&lt;p&gt;Echoing heels on cold concrete&lt;/p&gt;\n\n&lt;p&gt;Circles.&lt;/p&gt;\n\n&lt;p&gt;Detours.&lt;/p&gt;\n\n&lt;p&gt;narrow streets and crowded plazas.&lt;/p&gt;\n\n&lt;p&gt;Where can I go, when it’s in me&lt;/p&gt;\n\n&lt;p&gt;that hell is burning.&lt;/p&gt;\n\n&lt;p&gt;Memories,&lt;/p&gt;\n\n&lt;p&gt;they throb toward my temples.&lt;/p&gt;\n\n&lt;p&gt;What heavenly Hemingway was the poet that created you, stupid city ?&lt;/p&gt;\n\n&lt;p&gt;Full of people&lt;/p&gt;\n\n&lt;p&gt;smiling,&lt;/p&gt;\n\n&lt;p&gt;eyes &lt;/p&gt;\n\n&lt;p&gt;that look like coffins buried in the ground, nailed&lt;/p&gt;\n\n&lt;p&gt;shut&lt;/p&gt;\n\n&lt;p&gt;illegal to open&lt;/p&gt;\n\n&lt;p&gt;( The hell I’m carrying is collective )\n(caressing all counterculture-baristas)\n(benevolent bank men)\n(  public school teachers and their students,)\n(machiavellian ministers, mad musicians, mourning mothers)\n( and )\n( me )&lt;/p&gt;\n\n&lt;p&gt;My pulse is in my armpits. I’m breathing like a Spanish bull.\nI’m burning.&lt;/p&gt;\n\n&lt;p&gt;So I sit down. I want to make coherent sense of all this.&lt;/p&gt;\n\n&lt;p&gt;Light a cigarette. Through the smoke I can see twinkling lights from a throbbing city.&lt;/p&gt;\n\n&lt;p&gt;It’s a nice view up here.\n     ______________________________&lt;/p&gt;\n\n&lt;p&gt;2.&lt;/p&gt;\n\n&lt;p&gt;These streets.&lt;/p&gt;\n\n&lt;p&gt;They know me well.&lt;/p&gt;\n\n&lt;p&gt;I’ve walked them all my life.&lt;/p&gt;\n\n&lt;p&gt;They changed and\nI don&amp;#39;t speak their language &lt;/p&gt;\n\n&lt;p&gt;These walls.&lt;/p&gt;\n\n&lt;p&gt;I don’t recognize the sound of my voice.&lt;/p&gt;\n\n&lt;p&gt;when it bounces back.&lt;/p&gt;\n\n&lt;p&gt;from stained glass windows.&lt;/p&gt;\n\n&lt;p&gt;installed in the new ”perfect coffee place with a retro feel”  &lt;/p&gt;\n\n&lt;p&gt;Who&amp;#39;s city is this?&lt;/p&gt;\n\n&lt;p&gt;It’s a quick fix.&lt;/p&gt;\n\n&lt;p&gt;Ditch the poor kids. &lt;/p&gt;\n\n&lt;p&gt;Dig out the earth, new routes for commuters.&lt;/p&gt;\n\n&lt;p&gt;( ”It’s really coming up round here” )&lt;/p&gt;\n\n&lt;p&gt;It’s cosmetic. &lt;/p&gt;\n\n&lt;p&gt;synthetic, nothing but rhetoric. &lt;/p&gt;\n\n&lt;p&gt;I’ve been thrown out before.&lt;/p&gt;\n\n&lt;p&gt;I can find a new place to rent.&lt;/p&gt;\n\n&lt;p&gt;invade another neighborhood . \nAllgood &lt;/p&gt;\n\n&lt;p&gt;my fire &lt;/p&gt;\n\n&lt;p&gt;grows from pondering to prophesy&lt;/p&gt;\n\n&lt;p&gt;-pulse-&lt;/p&gt;\n\n&lt;p&gt;Cars, busses, subways and commuters.&lt;/p&gt;\n\n&lt;p&gt;the blood in a pulsing organism.&lt;/p&gt;\n\n&lt;p&gt;-pulse-&lt;/p&gt;\n\n&lt;p&gt;It’s so uneven.&lt;/p&gt;\n\n&lt;p&gt;-pulse-&lt;/p&gt;\n\n&lt;p&gt;too much pressure forced through it. &lt;/p&gt;\n\n&lt;p&gt;The blood is coagulating in the veins.&lt;/p&gt;\n\n&lt;p&gt;-pulse-&lt;/p&gt;\n\n&lt;p&gt;But the system’s too profitable to stop what it’s doing. &lt;/p&gt;\n\n&lt;p&gt;the fever grows&lt;/p&gt;\n\n&lt;p&gt;(-But positive thinking can cure any disease. &lt;/p&gt;\n\n&lt;p&gt;Keep smiling dear city.- )&lt;/p&gt;\n\n&lt;p&gt;She’s sick. She’s dying. &lt;/p&gt;\n\n&lt;p&gt;Im burning&lt;/p&gt;\n\n&lt;p&gt;her fire&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt; ______________________________\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Tired. hands cramping. Instead of fueling the shitstorm in my head, I fell asleep. When I woke up. This was in my notebook. I don&amp;#39;t think I wrote it. It&amp;#39;s my handwriting, but not my voice.\nI don’t know what to make of it.&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt; ______________________________\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;3\nThere you are. &lt;/p&gt;\n\n&lt;p&gt;Watching me.&lt;/p&gt;\n\n&lt;p&gt;Look at you! &lt;/p&gt;\n\n&lt;p&gt;Clothed in the fashion of your times. You look good.&lt;/p&gt;\n\n&lt;p&gt;Young and brave.&lt;/p&gt;\n\n&lt;p&gt;I have seen so many like you.&lt;/p&gt;\n\n&lt;p&gt;How did you end up here?&lt;/p&gt;\n\n&lt;p&gt;In\nNew York?&lt;/p&gt;\n\n&lt;p&gt;Once I was Mannahattah, you know.&lt;/p&gt;\n\n&lt;p&gt;I had rolling hills, my curves dressed in fruitful green.&lt;/p&gt;\n\n&lt;p&gt;Deep blue skies folding over me.&lt;/p&gt;\n\n&lt;p&gt;The river was my veins.&lt;/p&gt;\n\n&lt;p&gt;Can you see it?&lt;/p&gt;\n\n&lt;p&gt;It’s beautiful, right.&lt;/p&gt;\n\n&lt;p&gt;One day&lt;/p&gt;\n\n&lt;p&gt;Your city will be dug up from the earth.&lt;/p&gt;\n\n&lt;p&gt;Your buildings will be hailed&lt;/p&gt;\n\n&lt;p&gt;as an ancient wonder of the planet.&lt;/p&gt;\n\n&lt;p&gt;More spectacular than Athens.&lt;/p&gt;\n\n&lt;p&gt;You &lt;/p&gt;\n\n&lt;p&gt;will be an ancient one, &lt;/p&gt;\n\n&lt;p&gt;a mythical being.&lt;/p&gt;\n\n&lt;p&gt;All you people..\nYou never change, you know. \nSomehow, you always believe that \nnow is all that there is.\nand that everyone who belong to history were somehow different from you.&lt;/p&gt;\n\n&lt;p&gt;It’s a very human affliction,.\nunderstandable.\nbeing stuck in time like you are.&lt;/p&gt;\n\n&lt;p&gt;Oh right, I meant to tell you&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The burning you’re feeling inside&lt;/p&gt;\n\n&lt;p&gt;Is a part of the future, act on it.&lt;/p&gt;\n\n&lt;p&gt;Make your outside look like your inside, if you catch my drift.&lt;/p&gt;\n\n&lt;p&gt;Don’t worry about me&lt;/p&gt;\n\n&lt;p&gt;Ashes make a good fertilizer&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg7f0o8", "score_hidden": false, "stickied": false, "created": 1492111383.0, "created_utc": 1492082583.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64z92r", "likes": null, "replies": "", "user_reports": [], "id": "dg6e2sr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Keniree", "parent_id": "t3_64z92r", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "The faceless man continued to plod along the sidewalk. Posters for government initiatives and new products plastered every surface. Vidscreens showed the latest news; the civil war continued to rage as the insurgent forces seized the Lilypad, a signifcant staging area for the military.  Baron Krandt's face glared at us from every billboard as we made our way deeper and deeper into the Blossoms, the wealthiest district of the City of Flowers. It was odd, seeing the contrast between the slums of the Roots district and the opulence of the blossoms.\n\nThe urban sprawl radiated outwards from one central point; the Rose Garden. Every single citizen of the City of Flowers knew it, had walked amidst the thickets of thorny beauty, on marble-paved paths and under gilded arches. It commemorated the Flower, a young woman who had used mystical powers to defeat a thousand warlords and bring peace to the land. Everywhere she walked, flowers bloomed, trees sprung up, and even now the Rose Garden had a *presence* to it, the plants growing hardier and with more beauty than any other garden on the planet.\n\n\nIt was there the faceless man led me. Right to the center of the Garden, next to the sculpture of the Flower herself. All shining white marble, it depicted a young woman with a dress formed from leaves and vines curling down her arms. Her hair had flowers pinned- no, woven through it so seamlessly it was as if she was growing them from her scalp. She was strikingly beautiful, but at the same time wild and terrifying. The faceless man gestured for me to sit on the bench facing her statue, surrounded by a million roses in the afternoon sun. \n\nI did so, and he turned around and collapsed into a pile of leaves and petals. I bolted upright, but the roses grew higher and higher until I was trapped in a dome of vegetation. The razor-sharp thorns elongated and were all levelled at me. I could not escape this enclosure without being pierced by those deadly spears. I sank slowly back onto the bench, heart pounding and mouth dry. The scent of roses seemed overpowering now.\n\n\nA ray of sunlight penetrated the centre of the dome, illuminating the visage of the Flower. With a stiff grinding noise, the statue's head began to move, flakes of marble showering down at me from the plinth above. I shielded my eyes as the terrible cracking continued, until eventually I heard only a hostile silence. I looked up, right into the emerald eyes of the Flower.\n\n\nHer face was wooden, her lips as red as the rose petals the faceless man had been made out of. Her lips curved into a cruel smile, and her voice sounded like the rustling of wind in the trees blended with the crunch of leaves underfoot as she said...\n\n\"Let me tell you a story, human. In spring, there is new growth, and hope and beginnings. In summer, there is heat, and passion and blossoming. In autumn, there is peace and prosperity. And lastly, in winter there is cold and stillness and death.\"\n\nAs she spoke, she raised a hand and a rose grew from it, cycling from sprouting and blooming to withering and dying in the space of a minute. The sunlight that filtered through the dome of thorns changed too, from bright morning light to warm afternoon, from mellow evening to the dark of night.\n\n\"In the beginning of the lifespan of this city, I ruled over it as the May Queen. I brought hope and courage to its people and they *flourished*. My role is still immortalised today as a symbol of purity, youth and the spring. But alas, my reign was as shortlived as the mayfly itself.\"\n\nHer hair withered slightly at the ends as she recalled her past, but it burst into color again as she dropped down from the plinth on a platform of vines. Flower petals were falling all around us as she walked right up to the bench I was frozen sitting on.\n\n\"All May Queens must die and so it was that Krandt himself had me *weeded out*. He took over, and yes, he lead the City through the seasons, through its heyday in the Summer Era, and the lasting affluence of Autumn. Now however, we are in Winter, and this city is *dying*, human. It is withering and Krandt won't stir to stop it from happening. The City is stagnant and it will crumble to nothing under his leadership. Every flower must be destroyed and reborn by the cycle of the seasons, but Krandt wants his eternal facsimile of life to live forever.\"\n\nShe paused and glanced up at the opening at the peak of the dome. I could see a hint of stars and a red dawn approaching. Her voice became wistful.\n\n\"New growth is coming, child. The rebels seek to overthrow the barren Baron and spread their seeds of revolution and change. This cannot happen without clearing the old growth to make new life sprout. You will do this for me, child.\"\n\nShe reached out and grabbed my arm, sprouting a lily in her other hand. Ramming it into my outstretched arm, I almost screamed as it burned into the skin. I held back tears as she released me, and ascended back onto the plinth, resuming her previous pose. I looked down and saw only a fire-red lily tattooed onto my pale skin.\n\n\"You will be my lily, my dear. A symbol of rebirth and a fitting emblem. Do not let them wither, child...\"\n\nAnd then the marble melded back over her wooden face and cruel eyes and the thorns receded, becoming simple ornamental roses again. All around me, the sky was on fire with the coming dawn. \n\nI pressed a hand to the lily tattoo and a gout of flame incinerated the closest clump of roses,and then spread to the next and the next after that, an unstoppable and fierce heat. The Garden was burning, racing to the city that surrounded it like a gloating conqueror. The inferno raged higher and higher as the alarm bells began to ring, for rebel attacks or for my flames, or both.\n\nI laughed, casting my hands up to the sky, making fiery petals burst down on the Blossoms. The flames burned sweetly like flowers dancing in a breeze.\n\nIt was time to cleanse the City of Flowers once and for all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The faceless man continued to plod along the sidewalk. Posters for government initiatives and new products plastered every surface. Vidscreens showed the latest news; the civil war continued to rage as the insurgent forces seized the Lilypad, a signifcant staging area for the military.  Baron Krandt&amp;#39;s face glared at us from every billboard as we made our way deeper and deeper into the Blossoms, the wealthiest district of the City of Flowers. It was odd, seeing the contrast between the slums of the Roots district and the opulence of the blossoms.&lt;/p&gt;\n\n&lt;p&gt;The urban sprawl radiated outwards from one central point; the Rose Garden. Every single citizen of the City of Flowers knew it, had walked amidst the thickets of thorny beauty, on marble-paved paths and under gilded arches. It commemorated the Flower, a young woman who had used mystical powers to defeat a thousand warlords and bring peace to the land. Everywhere she walked, flowers bloomed, trees sprung up, and even now the Rose Garden had a &lt;em&gt;presence&lt;/em&gt; to it, the plants growing hardier and with more beauty than any other garden on the planet.&lt;/p&gt;\n\n&lt;p&gt;It was there the faceless man led me. Right to the center of the Garden, next to the sculpture of the Flower herself. All shining white marble, it depicted a young woman with a dress formed from leaves and vines curling down her arms. Her hair had flowers pinned- no, woven through it so seamlessly it was as if she was growing them from her scalp. She was strikingly beautiful, but at the same time wild and terrifying. The faceless man gestured for me to sit on the bench facing her statue, surrounded by a million roses in the afternoon sun. &lt;/p&gt;\n\n&lt;p&gt;I did so, and he turned around and collapsed into a pile of leaves and petals. I bolted upright, but the roses grew higher and higher until I was trapped in a dome of vegetation. The razor-sharp thorns elongated and were all levelled at me. I could not escape this enclosure without being pierced by those deadly spears. I sank slowly back onto the bench, heart pounding and mouth dry. The scent of roses seemed overpowering now.&lt;/p&gt;\n\n&lt;p&gt;A ray of sunlight penetrated the centre of the dome, illuminating the visage of the Flower. With a stiff grinding noise, the statue&amp;#39;s head began to move, flakes of marble showering down at me from the plinth above. I shielded my eyes as the terrible cracking continued, until eventually I heard only a hostile silence. I looked up, right into the emerald eyes of the Flower.&lt;/p&gt;\n\n&lt;p&gt;Her face was wooden, her lips as red as the rose petals the faceless man had been made out of. Her lips curved into a cruel smile, and her voice sounded like the rustling of wind in the trees blended with the crunch of leaves underfoot as she said...&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Let me tell you a story, human. In spring, there is new growth, and hope and beginnings. In summer, there is heat, and passion and blossoming. In autumn, there is peace and prosperity. And lastly, in winter there is cold and stillness and death.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;As she spoke, she raised a hand and a rose grew from it, cycling from sprouting and blooming to withering and dying in the space of a minute. The sunlight that filtered through the dome of thorns changed too, from bright morning light to warm afternoon, from mellow evening to the dark of night.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;In the beginning of the lifespan of this city, I ruled over it as the May Queen. I brought hope and courage to its people and they &lt;em&gt;flourished&lt;/em&gt;. My role is still immortalised today as a symbol of purity, youth and the spring. But alas, my reign was as shortlived as the mayfly itself.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Her hair withered slightly at the ends as she recalled her past, but it burst into color again as she dropped down from the plinth on a platform of vines. Flower petals were falling all around us as she walked right up to the bench I was frozen sitting on.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;All May Queens must die and so it was that Krandt himself had me &lt;em&gt;weeded out&lt;/em&gt;. He took over, and yes, he lead the City through the seasons, through its heyday in the Summer Era, and the lasting affluence of Autumn. Now however, we are in Winter, and this city is &lt;em&gt;dying&lt;/em&gt;, human. It is withering and Krandt won&amp;#39;t stir to stop it from happening. The City is stagnant and it will crumble to nothing under his leadership. Every flower must be destroyed and reborn by the cycle of the seasons, but Krandt wants his eternal facsimile of life to live forever.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She paused and glanced up at the opening at the peak of the dome. I could see a hint of stars and a red dawn approaching. Her voice became wistful.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;New growth is coming, child. The rebels seek to overthrow the barren Baron and spread their seeds of revolution and change. This cannot happen without clearing the old growth to make new life sprout. You will do this for me, child.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She reached out and grabbed my arm, sprouting a lily in her other hand. Ramming it into my outstretched arm, I almost screamed as it burned into the skin. I held back tears as she released me, and ascended back onto the plinth, resuming her previous pose. I looked down and saw only a fire-red lily tattooed onto my pale skin.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You will be my lily, my dear. A symbol of rebirth and a fitting emblem. Do not let them wither, child...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And then the marble melded back over her wooden face and cruel eyes and the thorns receded, becoming simple ornamental roses again. All around me, the sky was on fire with the coming dawn. &lt;/p&gt;\n\n&lt;p&gt;I pressed a hand to the lily tattoo and a gout of flame incinerated the closest clump of roses,and then spread to the next and the next after that, an unstoppable and fierce heat. The Garden was burning, racing to the city that surrounded it like a gloating conqueror. The inferno raged higher and higher as the alarm bells began to ring, for rebel attacks or for my flames, or both.&lt;/p&gt;\n\n&lt;p&gt;I laughed, casting my hands up to the sky, making fiery petals burst down on the Blossoms. The flames burned sweetly like flowers dancing in a breeze.&lt;/p&gt;\n\n&lt;p&gt;It was time to cleanse the City of Flowers once and for all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg6e2sr", "score_hidden": false, "stickied": false, "created": 1492053540.0, "created_utc": 1492024740.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_64z92r", "likes": null, "replies": "", "user_reports": [], "id": "dg7ckn9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lj_vice", "parent_id": "t3_64z92r", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Jaka stumbled out of the pub, intoxicated by beer, whiskey and burden. For the last three days he tried to do everything in his power to shut his mind off, but no amount of whiskey has helped. “WHAT SHOULD I DO? HUH? WHY AREN’T YOU ANSWERING ME? WHY ME?” he shouted at the night. He sat down at the banks of the river, his hands buried in his face and mumbling incomprehensively. After a couple of minutes he stood up and walked back to the place where he first encountered the thing that changed his life.\n\n \n\nHe was a history student at the University of Ljubljana and his dissertation was about the religious impact in the city of Emona. Three days ago he was locked in the library reading a twelve century  book about mysticism in early 3th century Emona  and he just couldn’t put it down. Apparently the god of war Mars cursed the city, because the soldiers weren’t giving sacrifice to him, but instead prayed to some other false god. The wrathful Mars took his iron sword and cut the city in four parts, but what happened after not even he could have predicted. The city was in pain and out of that pain a soul was born. Over the years everyone that has died, within the city limit, were forbidden to leave. Their souls were trapped and merged with the soul of the city.\n\n \n\nThe history student was amused by such a ridicules notion, but still intrigued by it. The book points that there is the seal of Mars  on the ground where the cuts from his sword met. Jaka had a nice giggle about it, but just out of curiosity decided he would check it out. The city of Emona was indeed divided into four parts and it shouldn’t be to hard to find his seal. He cleaned up after himself and headed out.  \n\n \n\nHe never believed in a god or supernatural things, but his mind still went there. What if it is all true? What if the soul of the city really exists? What if I? He shook his head and mumbled to himself “What a stupid thought, but I sure am curious.” Jaka arrived in the vicinity where the roads met many, many, many years ago and looked around. After ten minutes of searching he sat down on the ground and let out a huge sigh. He felt like an idiot looking for a symbol that was supposed to be drawn almost 2 millennia ago by a roman god of war.\n\n \n\nAs he stood up, he felt something sting him in his right hand. He looked down and there was some drawing on the ground, he pushed the grass to the side and saw the symbol of Mars. He couldn’t believe his eyes. He looked around himself and the world around him was disappearing. All around him lights appeared, some where white, some were red and some had a blue-ish color. Jaka was in shock. His heart started racing and he couldn’t catch his breath. Out of nowhere some voice appeared, it felt like it was coming from within his own mind. “We do not have much time. We are aware that you have many question. We can sense your soul is confused, but trust me, so are we. Mars cursed us, he trapped us in the confines of Emona. We have been here for an eternity and there is much more to come.”\n\n \n\nJaka looked around, he still wasn’t sure if this is a hallucination, a dream or reality. “Mars?” he asked “The roman god of war? What is going on? Mars?”\n\n“Yes, mars. We are aware that this is a huge shock for you. You people have long forgotten the gods of old and embraced new ones. Ah, what a shame.” Told him the voice inside his mind\n\n“Mars? He is real?”\n\n“Yes, he is and so are his brothers and sisters. And so are we. Jaka we need your help! Help us cross the river Styx. Help us escape this god forsaken city. Help us rest!”\n\nThe history student stood up. It felt weird standing up, when there was no ground below him. There was nothing but darkness and the pretty lights around him. Three deep breaths later he asked “How? I am just a man. How could I break the curse of a god?”\n\nHis mind was suddenly filled  with laughter, but this time it was different. It wasn’t just one voice, it felt like there were a million of them. As swiftly as laughter started it also stopped and a chanting erupted “BURN THE CITY! BURN THE CITY! BURN THE CITY!”\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jaka stumbled out of the pub, intoxicated by beer, whiskey and burden. For the last three days he tried to do everything in his power to shut his mind off, but no amount of whiskey has helped. “WHAT SHOULD I DO? HUH? WHY AREN’T YOU ANSWERING ME? WHY ME?” he shouted at the night. He sat down at the banks of the river, his hands buried in his face and mumbling incomprehensively. After a couple of minutes he stood up and walked back to the place where he first encountered the thing that changed his life.&lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;He was a history student at the University of Ljubljana and his dissertation was about the religious impact in the city of Emona. Three days ago he was locked in the library reading a twelve century  book about mysticism in early 3th century Emona  and he just couldn’t put it down. Apparently the god of war Mars cursed the city, because the soldiers weren’t giving sacrifice to him, but instead prayed to some other false god. The wrathful Mars took his iron sword and cut the city in four parts, but what happened after not even he could have predicted. The city was in pain and out of that pain a soul was born. Over the years everyone that has died, within the city limit, were forbidden to leave. Their souls were trapped and merged with the soul of the city.&lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;The history student was amused by such a ridicules notion, but still intrigued by it. The book points that there is the seal of Mars  on the ground where the cuts from his sword met. Jaka had a nice giggle about it, but just out of curiosity decided he would check it out. The city of Emona was indeed divided into four parts and it shouldn’t be to hard to find his seal. He cleaned up after himself and headed out.  &lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;He never believed in a god or supernatural things, but his mind still went there. What if it is all true? What if the soul of the city really exists? What if I? He shook his head and mumbled to himself “What a stupid thought, but I sure am curious.” Jaka arrived in the vicinity where the roads met many, many, many years ago and looked around. After ten minutes of searching he sat down on the ground and let out a huge sigh. He felt like an idiot looking for a symbol that was supposed to be drawn almost 2 millennia ago by a roman god of war.&lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;As he stood up, he felt something sting him in his right hand. He looked down and there was some drawing on the ground, he pushed the grass to the side and saw the symbol of Mars. He couldn’t believe his eyes. He looked around himself and the world around him was disappearing. All around him lights appeared, some where white, some were red and some had a blue-ish color. Jaka was in shock. His heart started racing and he couldn’t catch his breath. Out of nowhere some voice appeared, it felt like it was coming from within his own mind. “We do not have much time. We are aware that you have many question. We can sense your soul is confused, but trust me, so are we. Mars cursed us, he trapped us in the confines of Emona. We have been here for an eternity and there is much more to come.”&lt;/p&gt;\n\n&lt;p&gt; &lt;/p&gt;\n\n&lt;p&gt;Jaka looked around, he still wasn’t sure if this is a hallucination, a dream or reality. “Mars?” he asked “The roman god of war? What is going on? Mars?”&lt;/p&gt;\n\n&lt;p&gt;“Yes, mars. We are aware that this is a huge shock for you. You people have long forgotten the gods of old and embraced new ones. Ah, what a shame.” Told him the voice inside his mind&lt;/p&gt;\n\n&lt;p&gt;“Mars? He is real?”&lt;/p&gt;\n\n&lt;p&gt;“Yes, he is and so are his brothers and sisters. And so are we. Jaka we need your help! Help us cross the river Styx. Help us escape this god forsaken city. Help us rest!”&lt;/p&gt;\n\n&lt;p&gt;The history student stood up. It felt weird standing up, when there was no ground below him. There was nothing but darkness and the pretty lights around him. Three deep breaths later he asked “How? I am just a man. How could I break the curse of a god?”&lt;/p&gt;\n\n&lt;p&gt;His mind was suddenly filled  with laughter, but this time it was different. It wasn’t just one voice, it felt like there were a million of them. As swiftly as laughter started it also stopped and a chanting erupted “BURN THE CITY! BURN THE CITY! BURN THE CITY!”&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dg7ckn9", "score_hidden": false, "stickied": false, "created": 1492104459.0, "created_utc": 1492075659.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]