[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WritingPrompts", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Writing Prompt", "id": "65hsn9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 136, "report_reasons": null, "author": "heisenbobo", "saved": false, "mod_reports": [], "name": "t3_65hsn9", "subreddit_name_prefixed": "r/WritingPrompts", "approved_by": null, "over_18": false, "domain": "self.WritingPrompts", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s3nb", "edited": false, "link_flair_css_class": "flairwp", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WritingPrompts/comments/65hsn9/wp_for_the_first_time_in_your_life_you_shave_your/", "num_reports": null, "locked": false, "stickied": false, "created": 1492267189.0, "url": "https://www.reddit.com/r/WritingPrompts/comments/65hsn9/wp_for_the_first_time_in_your_life_you_shave_your/", "author_flair_text": null, "quarantine": false, "title": "[WP] For the first time in your life, you shave your head on a whim. While taking a couple glances in the mirror to admire your work, you discover a list of instructions tattooed on your scalp.", "created_utc": 1492238389.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 136}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hsn9", "likes": null, "replies": "", "user_reports": [], "id": "dgae2qt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WritingPromptsRobot", "parent_id": "t3_65hsn9", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\n**Off-Topic Discussion**: All top-level comments must be a story or poem. Reply here for other comments.\n\n#####Reminder for Writers and Readers:\n* Prompts are meant to inspire new writing.  Responses don't have to fulfill every detail.\n\n* Please remember to [be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback.\n\n---\n\n[](#icon-help)[^(What Is This?)](https://www.reddit.com/r/WritingPrompts/wiki/off_topic) [](#icon-information)[^(First Time Here?)](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) [](#icon-exclamation)[^(Special Announcements)](https://www.reddit.com/r/WritingPrompts/wiki/announcements) [](#icon-comments)[^(Click For Our Chatroom)](https://www.reddit.com/r/WritingPrompts/wiki/chat)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Off-Topic Discussion&lt;/strong&gt;: All top-level comments must be a story or poem. Reply here for other comments.&lt;/p&gt;\n\n&lt;h5&gt;Reminder for Writers and Readers:&lt;/h5&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Prompts are meant to inspire new writing.  Responses don&amp;#39;t have to fulfill every detail.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Please remember to &lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil\"&gt;be civil&lt;/a&gt; in any feedback.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"#icon-help\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/off_topic\"&gt;&lt;sup&gt;What Is This?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-information\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/user_guide\"&gt;&lt;sup&gt;First Time Here?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-exclamation\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/announcements\"&gt;&lt;sup&gt;Special Announcements&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-comments\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/chat\"&gt;&lt;sup&gt;Click For Our Chatroom&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgae2qt", "score_hidden": true, "stickied": true, "created": 1492267241.0, "created_utc": 1492238441.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hsn9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hsn9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hsn9", "likes": null, "replies": "", "user_reports": [], "id": "dgamqy1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rarelyfunny", "parent_id": "t1_dgallls", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Thank you for the kind words! Very glad you enjoyed it =) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the kind words! Very glad you enjoyed it =) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgamqy1", "score_hidden": false, "stickied": false, "created": 1492291111.0, "created_utc": 1492262311.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgallls", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "mistressdizzy", "parent_id": "t1_dgaigbk", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Oh my god, that was excellent. I don't know how you managed to weave a short story so well in just a few paragraphs. Well done!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh my god, that was excellent. I don&amp;#39;t know how you managed to weave a short story so well in just a few paragraphs. Well done!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgallls", "score_hidden": false, "stickied": false, "created": 1492288689.0, "created_utc": 1492259889.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaigbk", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "rarelyfunny", "parent_id": "t3_65hsn9", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "When it became clear to Junwick that he was not going to get any meaningful sleep that night, he roused himself, slipped on his heavy work clothes, then set about getting an early start on the endless tasks which lay ahead.\n \nBy the time the sole rooster on the farm crowed to herald the dawn, Junwick had already fed the horses, milked the cows, and bundled the previous day’s harvest for collection. He would have normally have headed next to the farmhouse to help with preparing breakfast for the Ryker family, which strictly speaking wasn’t part of his official duties as the farmhelp, but there was no time for that today.\n \n“Remember, Junwick,” said Hestat Ryker, for whom sleep had also been elusive, and who was already waiting by the entrance to the farm. “You’ve got to be polite with these Council people, their word is law around these parts.”\n \n“I always am, Mr Ryker.”\n \n“I know you are, just reminding you. Nothing to be afraid of, you hear? They promised they just wanted to ask you some questions, that’s all. The whole village supports you, and is indebted to you, don’t you forget that.”\n \nOn his trek to the agreed meeting place near the lake, Junwick partook of the generous breakfast Ryker had prepared for him. He knew times were hard, that the harvests were not doing well, but still the villagers went out of their way to provide for him. I did what anyone else would have done, he had insisted, please don’t treat me any differently from you.\n \nHis words had fallen on deaf ears. No matter what he did, his singular act of heroism had set him apart from them, for better or worse.\n \nThe Council representatives were already waiting for him, and they motioned for him to take a seat near a campfire they had kindled. Junwick was momentarily surprised – he had expected to meet two stern, hard-edged titans, larger than life, ominous, impenetrable. Instead, one was a waif of a girl, not more than fifteen, while the other was a middle-aged man whose wearied visage still bore hints of a deep capacity for kindness. \n\nIn other words, hardly the omnipotent masters of magic which Junwick expected from the legends which circulated of the Council.\n\n“I’m Verae,” the girl said, offering Junwick a thimble of water. “This is my mentor, Astonius, and I’m sure you’ve been told, we’re here to investigate the incident which took place last month. We’ll really appreciate it if you could tell us, in your own words, what happened.”\n\nJunwick swallowed, then tried his best to still his quickening pulse. He had devoted so much energy to pushing those memories out, but they flowed back so easily, like an acrid odor which never left his clothes.\n\n“It… it was in the evening, maybe a month or two after I was hired on the Ryker farm. We had a rider come in from the village, requesting help. Ryker and I went, of course, we were the only able-bodied men around. Turns out, there were bandits, they had come in from the north, and they… they were causing trouble, threatening to burn down the inn, asking for us to give them all the money we had.”\n\n“Did anyone try talking to them?” asked Verae.\n\nJunwick laughed nervously. “Of course, but they didn’t listen. We told them we didn’t have any money, we’re just barely getting by, but they wouldn’t have it. They started getting rough, pushing people about, and they even hit Grandma Belusse. That’s when… that’s when I thought that I should do something…”\n\n“And of that, what do you remember, Junwick?”\n\n“I actually… don’t remember what happened in between,” said Junwick, dropping his head as the shame burned his cheeks. “I woke up back in bed, sore, bruised. Ryker told me later I fought them off, saved the village. That’s the truth, really, I swear.”\n\n“How many of them were there, Junwick?”\n\n“Fifteen of them, in all. I know because I helped lay them to rest,” said Junwick, glancing towards a nearby copse of woods where a neat row of crosses had been planted. “You’re going to kill me now, right? I’m really sorry about it, and I really didn’t mean it… but I don’t suppose that matters, right?”\n\nJunwick saw Verae and Astonius exchange knowing glances briefly, and Astonius inclined his head slightly, as if to prod Verae to dig further. \n\n“They weren’t bandits, Junwick.”\n\n“Oh no,” wailed Junwick softly, clasping his head in his hands. “Please don’t tell me I hurt innocent people?”\n\n“That’s not my point, actually,” said Verae, brow furrowed in concentration. “They were an outcast band of soldiers from the King’s Guard, disgraced for their excesses in the last war the kingdom fought in. My point is, you single-handedly defeated fifteen war-experienced men in the prime of their lives.”\n\nThe silence grew between them, lengthening like vines stretching towards nourishment. Junwick understood what Verae was saying, but he didn’t have any response to that, especially since his memories yielded so few answers. \n\nAstonius spoke next, just a couple of words, “Ask him about whether he remembers from before, Verae.”\n\n“You heard him. Where were you, before you were hired on the Ryker farm?”\n\n“I’m… sorry, I also don’t remember,” said Junwick, a sad smile spreading across his face. “I remember waking up in the forests nearby, naked, burns on my body. I still cannot remember my life before that, I swear. I foraged to survive, and then Ryker came across me, offered me shelter. I took it, there was no choice in it for me. The villagers, they were all kind to me, in their own ways. I wouldn’t be here if it wasn’t for them…”\n\n“I think we’ve heard enough, don’t you think?” said Astonius to Verae, patting her briefly on the shoulder. “This next part is all yours. Whatever happens next, that is up to you. Choose wisely.”\n\nAstonius walked off then, staff in hand, heading towards the edge of the waters. Verae struggled to find the right words, then finally sighed as she retrieved a silver kris from her robes. Its sharpened edge glinted in the morning light, and Junwick found himself sighing, coming to terms with it all.\n\n“That is only right, I suppose. I may have saved the village, but it is undeniable that I took lives by my hand. I submit to the Council’s law.”\n\n“Don’t be too hasty,” said Verae, as she channelled energy into the weapon, making it glow a deep, irisdescent blue. “Have you heard of the alchemist who calls himself Mishrae?” \n\nJunwick shook his head, for in truth he did not know, but somewhere, far away, a tiny, almost imperceptible bell began to ring.\n\n“Mishrae has been an enemy of the Council for ages, according to Astonius. Chief amongst his crimes was his unlawful practice of golemnology, or the branch of mystic arts which involves the breathing of life into clay golems he fashions, obedient to his every bidding. He’s always fancied himself to be a despot, and for years he’s been building up this army of his, quietly, or so he thinks.”\n\n“What… what does this have to do with anyt-”\n\n“Some time ago,” Verae said, plunging ahead, “we learned of a terrible setback which had befallen Mishrae. Ironically, his craft exceeded his expectations, and there were those amongst his army which slowly gained… sentience. A number of his once-loyal servants rebelled, and in the chaos which ensued, an entire stronghold was razed to the ground. Since then, Council members have been tasked to hunt down the remaining golems which escaped, for every one of them still bears the mark of Mishrae’s machinations, and we simply cannot know what risk they represent if left on their own.”\n\nJunwick, face ashen, leaned on his knees, the perspiration beading off his forehead. “Are you saying tha-”\n\nVerae struck then, the silver kris a blur in the air. Junwick was fast, but there was no way he could have deflected the blow. \n\nFor Verae was coming into her powers, and there was no golem yet sculptured which could match a full-fledged member of the Council, much less one of the most promising prodigies for ages.\n\nJunwick blinked, having forgotten to breathe as the hairs from his head floated down about him. Verae stood by his side, one hand on his shoulder, gripping him in a binding spell, the other on his freshly-revealed scalp, perusing the ancient spellweave script which had been carved almost bone-deep.\n\nVerae smiled, then said, “I don’t know how you did it, Junwick, but your instructions have been altered.”\n\n“What… what do they say?”\n\n“There’s a spellweave here which compels you to obey Mishrae, and that I can alter for you. There’s also another one which commands you to defend yourself against all physical and magical threats. And most importantly, it appears that there’s one which you’ve added on yourself.”\n\n“I don’t… how could I have added anything myself? I didn’t even know I was a… golem…”\n\n“Beats me,” Verae said, releasing Junwick from the grip of her magic. \n\n“But as long as it’s there, it seems that you’ll protect those you care about. And that’s enough for me.”\n\nJunwick sat there for an eternity, watching Verae rejoin her mentor, then her waving to him as they turned, striding off into the forest. His hand rubbed his bald scalp idly.\n\nI will need a hat, he thought, as the peace he had long sought finally settled and took root in his heart.\n\n---\n\n/r/rarelyfunny\n\n---\n\nIf you liked this, here are some more snippets from the same universe, in chronological order! [1](https://www.reddit.com/r/rarelyfunny/comments/5zczmy/pi_things_have_been_tense_in_salem_ever_since/), [2](https://www.reddit.com/r/rarelyfunny/comments/630l79/wp_one_day_you_wonder_if_thinking_about_thinking/), [3](https://www.reddit.com/r/rarelyfunny/comments/5wvrsp/wp_theres_an_epidemic_of_lucid_dreaming_which_is/).", "edited": 1492251647.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When it became clear to Junwick that he was not going to get any meaningful sleep that night, he roused himself, slipped on his heavy work clothes, then set about getting an early start on the endless tasks which lay ahead.&lt;/p&gt;\n\n&lt;p&gt;By the time the sole rooster on the farm crowed to herald the dawn, Junwick had already fed the horses, milked the cows, and bundled the previous day’s harvest for collection. He would have normally have headed next to the farmhouse to help with preparing breakfast for the Ryker family, which strictly speaking wasn’t part of his official duties as the farmhelp, but there was no time for that today.&lt;/p&gt;\n\n&lt;p&gt;“Remember, Junwick,” said Hestat Ryker, for whom sleep had also been elusive, and who was already waiting by the entrance to the farm. “You’ve got to be polite with these Council people, their word is law around these parts.”&lt;/p&gt;\n\n&lt;p&gt;“I always am, Mr Ryker.”&lt;/p&gt;\n\n&lt;p&gt;“I know you are, just reminding you. Nothing to be afraid of, you hear? They promised they just wanted to ask you some questions, that’s all. The whole village supports you, and is indebted to you, don’t you forget that.”&lt;/p&gt;\n\n&lt;p&gt;On his trek to the agreed meeting place near the lake, Junwick partook of the generous breakfast Ryker had prepared for him. He knew times were hard, that the harvests were not doing well, but still the villagers went out of their way to provide for him. I did what anyone else would have done, he had insisted, please don’t treat me any differently from you.&lt;/p&gt;\n\n&lt;p&gt;His words had fallen on deaf ears. No matter what he did, his singular act of heroism had set him apart from them, for better or worse.&lt;/p&gt;\n\n&lt;p&gt;The Council representatives were already waiting for him, and they motioned for him to take a seat near a campfire they had kindled. Junwick was momentarily surprised – he had expected to meet two stern, hard-edged titans, larger than life, ominous, impenetrable. Instead, one was a waif of a girl, not more than fifteen, while the other was a middle-aged man whose wearied visage still bore hints of a deep capacity for kindness. &lt;/p&gt;\n\n&lt;p&gt;In other words, hardly the omnipotent masters of magic which Junwick expected from the legends which circulated of the Council.&lt;/p&gt;\n\n&lt;p&gt;“I’m Verae,” the girl said, offering Junwick a thimble of water. “This is my mentor, Astonius, and I’m sure you’ve been told, we’re here to investigate the incident which took place last month. We’ll really appreciate it if you could tell us, in your own words, what happened.”&lt;/p&gt;\n\n&lt;p&gt;Junwick swallowed, then tried his best to still his quickening pulse. He had devoted so much energy to pushing those memories out, but they flowed back so easily, like an acrid odor which never left his clothes.&lt;/p&gt;\n\n&lt;p&gt;“It… it was in the evening, maybe a month or two after I was hired on the Ryker farm. We had a rider come in from the village, requesting help. Ryker and I went, of course, we were the only able-bodied men around. Turns out, there were bandits, they had come in from the north, and they… they were causing trouble, threatening to burn down the inn, asking for us to give them all the money we had.”&lt;/p&gt;\n\n&lt;p&gt;“Did anyone try talking to them?” asked Verae.&lt;/p&gt;\n\n&lt;p&gt;Junwick laughed nervously. “Of course, but they didn’t listen. We told them we didn’t have any money, we’re just barely getting by, but they wouldn’t have it. They started getting rough, pushing people about, and they even hit Grandma Belusse. That’s when… that’s when I thought that I should do something…”&lt;/p&gt;\n\n&lt;p&gt;“And of that, what do you remember, Junwick?”&lt;/p&gt;\n\n&lt;p&gt;“I actually… don’t remember what happened in between,” said Junwick, dropping his head as the shame burned his cheeks. “I woke up back in bed, sore, bruised. Ryker told me later I fought them off, saved the village. That’s the truth, really, I swear.”&lt;/p&gt;\n\n&lt;p&gt;“How many of them were there, Junwick?”&lt;/p&gt;\n\n&lt;p&gt;“Fifteen of them, in all. I know because I helped lay them to rest,” said Junwick, glancing towards a nearby copse of woods where a neat row of crosses had been planted. “You’re going to kill me now, right? I’m really sorry about it, and I really didn’t mean it… but I don’t suppose that matters, right?”&lt;/p&gt;\n\n&lt;p&gt;Junwick saw Verae and Astonius exchange knowing glances briefly, and Astonius inclined his head slightly, as if to prod Verae to dig further. &lt;/p&gt;\n\n&lt;p&gt;“They weren’t bandits, Junwick.”&lt;/p&gt;\n\n&lt;p&gt;“Oh no,” wailed Junwick softly, clasping his head in his hands. “Please don’t tell me I hurt innocent people?”&lt;/p&gt;\n\n&lt;p&gt;“That’s not my point, actually,” said Verae, brow furrowed in concentration. “They were an outcast band of soldiers from the King’s Guard, disgraced for their excesses in the last war the kingdom fought in. My point is, you single-handedly defeated fifteen war-experienced men in the prime of their lives.”&lt;/p&gt;\n\n&lt;p&gt;The silence grew between them, lengthening like vines stretching towards nourishment. Junwick understood what Verae was saying, but he didn’t have any response to that, especially since his memories yielded so few answers. &lt;/p&gt;\n\n&lt;p&gt;Astonius spoke next, just a couple of words, “Ask him about whether he remembers from before, Verae.”&lt;/p&gt;\n\n&lt;p&gt;“You heard him. Where were you, before you were hired on the Ryker farm?”&lt;/p&gt;\n\n&lt;p&gt;“I’m… sorry, I also don’t remember,” said Junwick, a sad smile spreading across his face. “I remember waking up in the forests nearby, naked, burns on my body. I still cannot remember my life before that, I swear. I foraged to survive, and then Ryker came across me, offered me shelter. I took it, there was no choice in it for me. The villagers, they were all kind to me, in their own ways. I wouldn’t be here if it wasn’t for them…”&lt;/p&gt;\n\n&lt;p&gt;“I think we’ve heard enough, don’t you think?” said Astonius to Verae, patting her briefly on the shoulder. “This next part is all yours. Whatever happens next, that is up to you. Choose wisely.”&lt;/p&gt;\n\n&lt;p&gt;Astonius walked off then, staff in hand, heading towards the edge of the waters. Verae struggled to find the right words, then finally sighed as she retrieved a silver kris from her robes. Its sharpened edge glinted in the morning light, and Junwick found himself sighing, coming to terms with it all.&lt;/p&gt;\n\n&lt;p&gt;“That is only right, I suppose. I may have saved the village, but it is undeniable that I took lives by my hand. I submit to the Council’s law.”&lt;/p&gt;\n\n&lt;p&gt;“Don’t be too hasty,” said Verae, as she channelled energy into the weapon, making it glow a deep, irisdescent blue. “Have you heard of the alchemist who calls himself Mishrae?” &lt;/p&gt;\n\n&lt;p&gt;Junwick shook his head, for in truth he did not know, but somewhere, far away, a tiny, almost imperceptible bell began to ring.&lt;/p&gt;\n\n&lt;p&gt;“Mishrae has been an enemy of the Council for ages, according to Astonius. Chief amongst his crimes was his unlawful practice of golemnology, or the branch of mystic arts which involves the breathing of life into clay golems he fashions, obedient to his every bidding. He’s always fancied himself to be a despot, and for years he’s been building up this army of his, quietly, or so he thinks.”&lt;/p&gt;\n\n&lt;p&gt;“What… what does this have to do with anyt-”&lt;/p&gt;\n\n&lt;p&gt;“Some time ago,” Verae said, plunging ahead, “we learned of a terrible setback which had befallen Mishrae. Ironically, his craft exceeded his expectations, and there were those amongst his army which slowly gained… sentience. A number of his once-loyal servants rebelled, and in the chaos which ensued, an entire stronghold was razed to the ground. Since then, Council members have been tasked to hunt down the remaining golems which escaped, for every one of them still bears the mark of Mishrae’s machinations, and we simply cannot know what risk they represent if left on their own.”&lt;/p&gt;\n\n&lt;p&gt;Junwick, face ashen, leaned on his knees, the perspiration beading off his forehead. “Are you saying tha-”&lt;/p&gt;\n\n&lt;p&gt;Verae struck then, the silver kris a blur in the air. Junwick was fast, but there was no way he could have deflected the blow. &lt;/p&gt;\n\n&lt;p&gt;For Verae was coming into her powers, and there was no golem yet sculptured which could match a full-fledged member of the Council, much less one of the most promising prodigies for ages.&lt;/p&gt;\n\n&lt;p&gt;Junwick blinked, having forgotten to breathe as the hairs from his head floated down about him. Verae stood by his side, one hand on his shoulder, gripping him in a binding spell, the other on his freshly-revealed scalp, perusing the ancient spellweave script which had been carved almost bone-deep.&lt;/p&gt;\n\n&lt;p&gt;Verae smiled, then said, “I don’t know how you did it, Junwick, but your instructions have been altered.”&lt;/p&gt;\n\n&lt;p&gt;“What… what do they say?”&lt;/p&gt;\n\n&lt;p&gt;“There’s a spellweave here which compels you to obey Mishrae, and that I can alter for you. There’s also another one which commands you to defend yourself against all physical and magical threats. And most importantly, it appears that there’s one which you’ve added on yourself.”&lt;/p&gt;\n\n&lt;p&gt;“I don’t… how could I have added anything myself? I didn’t even know I was a… golem…”&lt;/p&gt;\n\n&lt;p&gt;“Beats me,” Verae said, releasing Junwick from the grip of her magic. &lt;/p&gt;\n\n&lt;p&gt;“But as long as it’s there, it seems that you’ll protect those you care about. And that’s enough for me.”&lt;/p&gt;\n\n&lt;p&gt;Junwick sat there for an eternity, watching Verae rejoin her mentor, then her waving to him as they turned, striding off into the forest. His hand rubbed his bald scalp idly.&lt;/p&gt;\n\n&lt;p&gt;I will need a hat, he thought, as the peace he had long sought finally settled and took root in his heart.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"/r/rarelyfunny\"&gt;/r/rarelyfunny&lt;/a&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;If you liked this, here are some more snippets from the same universe, in chronological order! &lt;a href=\"https://www.reddit.com/r/rarelyfunny/comments/5zczmy/pi_things_have_been_tense_in_salem_ever_since/\"&gt;1&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/rarelyfunny/comments/630l79/wp_one_day_you_wonder_if_thinking_about_thinking/\"&gt;2&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/rarelyfunny/comments/5wvrsp/wp_theres_an_epidemic_of_lucid_dreaming_which_is/\"&gt;3&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgaigbk", "score_hidden": false, "stickied": false, "created": 1492280009.0, "created_utc": 1492251209.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 44}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hsn9", "likes": null, "replies": "", "user_reports": [], "id": "dgat6bc", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "TwaggerMan", "parent_id": "t3_65hsn9", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "With a sigh I rubbed my hand across the mirror, leaving a smear in the condensation.\n\nI sneered distastefully at my reflection. With every passing year I saw more and more of my father staring back at me. \n\nI knelt and dug through the bathroom cabinets. It didn't take me long to find the hair clippers.\n\n\"What are you doing?\" A voice from the doorway asked. My girlfriend, Sarah was leaning against the door frame, trying to hide an amused smile.\n\n\"Time for a change!\" I announced, plugging in the clippers.\n\n\"Oh?\"\n\n\"Yeh. I'm sick of all these grey hairs.\"\n\n\"What grey hairs?\"\n\n\"Flatterer.\" I turned back to the mirror. \n\nShe sauntered up next to me and took the clippers from my hand. “At least let me do it then. The Last time you used the clippers we ended up with chunks missing out of the carpet.\"\n\n\"I didn't mean to drop them!\"\n\n\"Ass\" she said lovingly. \n\n\n\nShe sat me down on a small white stool and draped a towel around my shoulders. Before too long the floor around me was covered in a small pile of sandy brown hair. I closed my eyes and enjoyed the feeling of Sarah running her gentle fingers over my now much cooler feeling scalp.\n\n\"What's this?\" She asked suddenly, breaking my tranquil moment.\n\n\"What's what?\n\n\"This?\" She ran her fingers over a portion of head behind my right ear \"This tattoo thing?\"\n\n\"What tattoo thing?\"\n\n\"Here, look.\" She grabbed her round makeup mirror off the side and held it so I could see the back of my head in the big mirror.\n\n\"What the fuck?!\" Hidden on the back of my head were two columns of tiny writing. \"What does it say?\" \n\nSarah pulled my head closer and squinted at the text. \"I think… I think its a recipe.\"\n\n\"A recipe?!\"\n\n\"Yeh… for tomato soup.\"      \n\nI blinked. \"...Tomato soup?\"\n\nSarah \"mhmm\"-d, her focus on the back of my head.\n\nWhat on earth was a recipe for tomato soup doing tattooed on the back of my head? Unless...\n\n\"Dad!\" I growled. \n\nBefore he'd abandoned us my father had been a wizard in the kitchen. \n\nPeople who knew him liked to tell stories about his cooking. They often joked about how he could get anyone to do anything he wanted, after they had tasted some his food.\n\nHe'd always kept his recipes secret. He never allowed anyone to see him cook and never wrote any of them down. Apart from one, apparently.\n\nSarah's eyes shone with curiosity \"You think this is one of your dads?\" \n\n\"Who else was tattoo this shit onto my head?\"\n\n\"Wow, we have to try it!\" she said excitedly. She'd always held far too much interest in the stories of Dad's cooking.\n\n\"Sarah...\"\n\n\"Come on\" she pouted \"pleeeease?\" \n\n\n\nA short while later we had all the usual ingredients ready. Our counter top was covered in tomatoes, onion, olive oil, carrots, celery, bay leaves and vegetable stock. All lined up neatly next to our large steel cooking pot.\n\n\"That's odd.\" Sarah said, re-reading the instruction off me.\n\n\"What is?\"\n\n\"There's some real odd additional stuff he wants us to add to this.\"\n\n\"Like what?\" \n\n\"A shot of vodka and some toothpaste...\"\n\n\"Vodka and toothpaste!?\" \n\n\"I wasn't finished\" she shushed \"One leather belt, one brass tap and some hair from next doors rabbit.\"\n\nWe both stood in silence. \n\n\"Do you think he's joking?\" she asked.\n\n\"Dad never joked about his cooking.\" I said glumly.\n\n\"You used to eat this stuff?\"\n\n\"If I'd known that was the shit he was throwing in I never would have touched it.\"\n\nSarah hmm'd thoughtfully.\n\n\"Let's give this a miss\" I said \"Prisoner of Azkaban's just about to start on the tele.\"\n\nApparently that was the wrong thing to say. \n\nSarah's eyes lit up. \"Why should we go watch a film about magic when we've got our own potion to make out here?\"\n\nShe sent me down to the garage to fetch an old brass tap I'd been hanging onto in my plumbing bits, whilst she went to speak to next door about getting some hair from their pet.\n\nWe met back in the kitchen and started mixing the concoction. Sarah following the instructions carefully. \n\nIf we thought the ingredients were weird the cooking directions were absolutely mental. We had to do odd things like \"turn on the spot for every stir of the pot\" and \"shout the name of each ingredient as it was added\". \n\nDespite my initial hesitance I have to admit that it was strangely fun. Sarah was definitely enjoying herself, hopping around the room, giggling and clapping as the recipe on my head directed.\n\nWith a shout we chucked in the last ingredient (the belt from my jeans) and stuck out our tongues (as directed) whilst we waited for it to cool down. The soup was a deep blood red colour. \n\nI fished around with the spoon trying to feel the tap or belt but couldn't locate them. They must have gotten stuck to the bottom.\n\nSarah ladled out two big bowls of the steaming soup and placed them on the kitchen table.\n\n\"Well?\" she grinned at me sitting down and pulling one of the bowls towards her.\n\n\"What?\"\n\n\"Aren't you excited to try some?\"\n\n\"You're not seriously going to eat it?\" I asked aghast \"It’s got brass and filthy animal hair in it!\"\n\n\"Never did you any harm.\"\n\n\"Might explain why I always set off metal detectors.\"\n\n\"Stop being such a wet blanket. A little taste's not going to hurt.\"   \n\n\"Okay, enough now. I'll admit the cooking was fun but we should...HEY!\" I shouted, as Sarah took a big spoonful of the soup and shoved it into her mouth.\n\nThe moment the soup touched her tongue her eyes got huge. She uttered a small \"oh\" and the spoon fell from her fingers. \n\n\"Sarah?\" I asked hesitantly \n\nWith a wide grin she ravenously plunged into the rest of her bowl. Drinking it down in great gulps. \n\n\"Sarah! What the hell\" I shouted. \"What happened to a little taste?\"\n\nShe quickly finished her bowl and grabbed mine out from under me. \n\nShe finished the second bowl faster than she had the first, smacking her lips as red tomato juice ran down her chin. Then her eyes fell to the still sizeable pot of soup cooling on the stove.\n\nHer chair scraped across the floor as she jumped to her feet. \n\nThis had to stop. I jumped up as well.\n\nI grabbed her around the waist as she tried to launch herself past me her arms outstretched for the pot.\n\n\"Sarah, you've had enough!\" I shouted.\n\n\"More.\" she begged\n\n\"No more.\"\n\n\"More!\"\n\n\"Sarah. STOP!\" I screamed. \n\nShe froze in my arms.\n\n\"It's not good. Some of the shit we put in there is really wrong.\" I said. \n\nSarah didn't say anything. \n\n\"Sarah?\" My girlfriend was completely frozen. Her body rigid and unmoving, her lifeless eyes stared hungrily at the pot on the stove.\n\nOh god! Was she having a seizure? A heart attack? What were the signs of a stroke?\n\n\"Sarah!\" I screamed \"Sarah! Say something\"\n\n\"Something.\" she intoned dully. Her posture and expression unchanged.\n\n\"Okay, you're okay, just relax\" she went limp in my arms.\n\nSomething was wrong. What on earth had that soup done to her?\n\nI was about to dial for an ambulance when I remembered what people used to say about Dad's cooking \"*he could get anyone to do anything he wanted, after they had tasted his food*\".\n\nI glanced down at my girlfriend, still hanging bonelessly in my arms. \n\n\"Sarah, recite the alphabet backwards.\"\n\n\"Z, Y, X, W, V...\" \n\nOh...\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;With a sigh I rubbed my hand across the mirror, leaving a smear in the condensation.&lt;/p&gt;\n\n&lt;p&gt;I sneered distastefully at my reflection. With every passing year I saw more and more of my father staring back at me. &lt;/p&gt;\n\n&lt;p&gt;I knelt and dug through the bathroom cabinets. It didn&amp;#39;t take me long to find the hair clippers.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What are you doing?&amp;quot; A voice from the doorway asked. My girlfriend, Sarah was leaning against the door frame, trying to hide an amused smile.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Time for a change!&amp;quot; I announced, plugging in the clippers.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeh. I&amp;#39;m sick of all these grey hairs.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What grey hairs?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Flatterer.&amp;quot; I turned back to the mirror. &lt;/p&gt;\n\n&lt;p&gt;She sauntered up next to me and took the clippers from my hand. “At least let me do it then. The Last time you used the clippers we ended up with chunks missing out of the carpet.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I didn&amp;#39;t mean to drop them!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ass&amp;quot; she said lovingly. &lt;/p&gt;\n\n&lt;p&gt;She sat me down on a small white stool and draped a towel around my shoulders. Before too long the floor around me was covered in a small pile of sandy brown hair. I closed my eyes and enjoyed the feeling of Sarah running her gentle fingers over my now much cooler feeling scalp.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What&amp;#39;s this?&amp;quot; She asked suddenly, breaking my tranquil moment.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What&amp;#39;s what?&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This?&amp;quot; She ran her fingers over a portion of head behind my right ear &amp;quot;This tattoo thing?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What tattoo thing?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Here, look.&amp;quot; She grabbed her round makeup mirror off the side and held it so I could see the back of my head in the big mirror.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What the fuck?!&amp;quot; Hidden on the back of my head were two columns of tiny writing. &amp;quot;What does it say?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Sarah pulled my head closer and squinted at the text. &amp;quot;I think… I think its a recipe.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;A recipe?!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeh… for tomato soup.&amp;quot;      &lt;/p&gt;\n\n&lt;p&gt;I blinked. &amp;quot;...Tomato soup?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Sarah &amp;quot;mhmm&amp;quot;-d, her focus on the back of my head.&lt;/p&gt;\n\n&lt;p&gt;What on earth was a recipe for tomato soup doing tattooed on the back of my head? Unless...&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Dad!&amp;quot; I growled. &lt;/p&gt;\n\n&lt;p&gt;Before he&amp;#39;d abandoned us my father had been a wizard in the kitchen. &lt;/p&gt;\n\n&lt;p&gt;People who knew him liked to tell stories about his cooking. They often joked about how he could get anyone to do anything he wanted, after they had tasted some his food.&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;d always kept his recipes secret. He never allowed anyone to see him cook and never wrote any of them down. Apart from one, apparently.&lt;/p&gt;\n\n&lt;p&gt;Sarah&amp;#39;s eyes shone with curiosity &amp;quot;You think this is one of your dads?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Who else was tattoo this shit onto my head?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Wow, we have to try it!&amp;quot; she said excitedly. She&amp;#39;d always held far too much interest in the stories of Dad&amp;#39;s cooking.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sarah...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Come on&amp;quot; she pouted &amp;quot;pleeeease?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;A short while later we had all the usual ingredients ready. Our counter top was covered in tomatoes, onion, olive oil, carrots, celery, bay leaves and vegetable stock. All lined up neatly next to our large steel cooking pot.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;That&amp;#39;s odd.&amp;quot; Sarah said, re-reading the instruction off me.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What is?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;There&amp;#39;s some real odd additional stuff he wants us to add to this.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Like what?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;A shot of vodka and some toothpaste...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Vodka and toothpaste!?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I wasn&amp;#39;t finished&amp;quot; she shushed &amp;quot;One leather belt, one brass tap and some hair from next doors rabbit.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;We both stood in silence. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Do you think he&amp;#39;s joking?&amp;quot; she asked.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Dad never joked about his cooking.&amp;quot; I said glumly.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You used to eat this stuff?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;If I&amp;#39;d known that was the shit he was throwing in I never would have touched it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Sarah hmm&amp;#39;d thoughtfully.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Let&amp;#39;s give this a miss&amp;quot; I said &amp;quot;Prisoner of Azkaban&amp;#39;s just about to start on the tele.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Apparently that was the wrong thing to say. &lt;/p&gt;\n\n&lt;p&gt;Sarah&amp;#39;s eyes lit up. &amp;quot;Why should we go watch a film about magic when we&amp;#39;ve got our own potion to make out here?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She sent me down to the garage to fetch an old brass tap I&amp;#39;d been hanging onto in my plumbing bits, whilst she went to speak to next door about getting some hair from their pet.&lt;/p&gt;\n\n&lt;p&gt;We met back in the kitchen and started mixing the concoction. Sarah following the instructions carefully. &lt;/p&gt;\n\n&lt;p&gt;If we thought the ingredients were weird the cooking directions were absolutely mental. We had to do odd things like &amp;quot;turn on the spot for every stir of the pot&amp;quot; and &amp;quot;shout the name of each ingredient as it was added&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Despite my initial hesitance I have to admit that it was strangely fun. Sarah was definitely enjoying herself, hopping around the room, giggling and clapping as the recipe on my head directed.&lt;/p&gt;\n\n&lt;p&gt;With a shout we chucked in the last ingredient (the belt from my jeans) and stuck out our tongues (as directed) whilst we waited for it to cool down. The soup was a deep blood red colour. &lt;/p&gt;\n\n&lt;p&gt;I fished around with the spoon trying to feel the tap or belt but couldn&amp;#39;t locate them. They must have gotten stuck to the bottom.&lt;/p&gt;\n\n&lt;p&gt;Sarah ladled out two big bowls of the steaming soup and placed them on the kitchen table.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well?&amp;quot; she grinned at me sitting down and pulling one of the bowls towards her.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Aren&amp;#39;t you excited to try some?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re not seriously going to eat it?&amp;quot; I asked aghast &amp;quot;It’s got brass and filthy animal hair in it!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Never did you any harm.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Might explain why I always set off metal detectors.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Stop being such a wet blanket. A little taste&amp;#39;s not going to hurt.&amp;quot;   &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Okay, enough now. I&amp;#39;ll admit the cooking was fun but we should...HEY!&amp;quot; I shouted, as Sarah took a big spoonful of the soup and shoved it into her mouth.&lt;/p&gt;\n\n&lt;p&gt;The moment the soup touched her tongue her eyes got huge. She uttered a small &amp;quot;oh&amp;quot; and the spoon fell from her fingers. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sarah?&amp;quot; I asked hesitantly &lt;/p&gt;\n\n&lt;p&gt;With a wide grin she ravenously plunged into the rest of her bowl. Drinking it down in great gulps. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sarah! What the hell&amp;quot; I shouted. &amp;quot;What happened to a little taste?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She quickly finished her bowl and grabbed mine out from under me. &lt;/p&gt;\n\n&lt;p&gt;She finished the second bowl faster than she had the first, smacking her lips as red tomato juice ran down her chin. Then her eyes fell to the still sizeable pot of soup cooling on the stove.&lt;/p&gt;\n\n&lt;p&gt;Her chair scraped across the floor as she jumped to her feet. &lt;/p&gt;\n\n&lt;p&gt;This had to stop. I jumped up as well.&lt;/p&gt;\n\n&lt;p&gt;I grabbed her around the waist as she tried to launch herself past me her arms outstretched for the pot.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sarah, you&amp;#39;ve had enough!&amp;quot; I shouted.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;More.&amp;quot; she begged&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No more.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;More!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sarah. STOP!&amp;quot; I screamed. &lt;/p&gt;\n\n&lt;p&gt;She froze in my arms.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s not good. Some of the shit we put in there is really wrong.&amp;quot; I said. &lt;/p&gt;\n\n&lt;p&gt;Sarah didn&amp;#39;t say anything. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sarah?&amp;quot; My girlfriend was completely frozen. Her body rigid and unmoving, her lifeless eyes stared hungrily at the pot on the stove.&lt;/p&gt;\n\n&lt;p&gt;Oh god! Was she having a seizure? A heart attack? What were the signs of a stroke?&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sarah!&amp;quot; I screamed &amp;quot;Sarah! Say something&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Something.&amp;quot; she intoned dully. Her posture and expression unchanged.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Okay, you&amp;#39;re okay, just relax&amp;quot; she went limp in my arms.&lt;/p&gt;\n\n&lt;p&gt;Something was wrong. What on earth had that soup done to her?&lt;/p&gt;\n\n&lt;p&gt;I was about to dial for an ambulance when I remembered what people used to say about Dad&amp;#39;s cooking &amp;quot;&lt;em&gt;he could get anyone to do anything he wanted, after they had tasted his food&lt;/em&gt;&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I glanced down at my girlfriend, still hanging bonelessly in my arms. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sarah, recite the alphabet backwards.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Z, Y, X, W, V...&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Oh...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgat6bc", "score_hidden": false, "stickied": false, "created": 1492301203.0, "created_utc": 1492272403.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hsn9", "likes": null, "replies": "", "user_reports": [], "id": "dgaje2b", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "nickcorn16", "parent_id": "t3_65hsn9", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "I lowered the shaver. As it got close the the bench it began rattling violently, I looked down thinking I hadn't turned it off, but it was my hand shaking violently. I had just taken off a patch of my hair and I could make out one word \"home\". Terrified at the sight in front of me I stood there, staring at the patch, completely still. Too scared to leave the room, to move to do anything. I couldn't even avert my eyes elsewhere. All I could do was stare at the otherwise harmless word. A word associated with warmth and comfort was now sending ice cold shivers down my spine that froze my whole body in place.\n\nI stared for so longthat the word no longer made sense to me. All I could think about was how it got there. Who put it there, and what the rest of the message said. I lurched into action, grabbed the soap as if possessed and started scrubbing the bald patch till it was red raw. Nothing. Not even a smudge. My curiosity won me over and I stepped right up to the mirror and parted the hair around it, pulling so hard to expose my scalp that I ripped some hair out just to the right of the word. What appeared was a dot of black, the same colour as the word. This was the end of a sentence. But how? I could've sworn there was nothing on the other side of the word. I parted my hair to the left of the word, looking like a nervous wreck trying to pull my hair out. But nothing was there. Just this word. \n\nHaving conjured up disturbing thoughts about what this one word could mean I decided to finish the job. There was no longer any curiosity to what the rest of the message was. It was just one word. I wanted to finish this and go and try figure this out, \"home, what the Fuck were you trying to tell me whoever you are\"? I mumbled to myself as I picked up the shaver. My heart still pounding at my chest like a kick drum in a song going 1 thousand beats per minute, my hand still possessed, shaking so violently I thought I might sprain my wrist. \n\nI composed myself, drew in and exhaled a few deep breaths, and went at it, shaving the rest of my head determined to get on with deciphering this vague message. Still consumed by fear, fear about the uncertainty around this message and how it got there. I continued up from the initial patch until the point where the structure of my skull began rounding down to my neck. I took a quick look at my work and was again stunned by what reflected back at me in the mirror. This time the shaver dropped to the ground and shattered. Unfazed by this, unable to react to anything but what presented itself on my head. As if the message magically appeared when my scalp was fully exposed, like the invisible ink we play with at school. Three more words were exposed now, going up in a line on top of the first. The word on top of home was \"come\" The word on top of that was \"race\", and the word at the top was cut off. All I could make out was \"ation\". \n\nCompletely ignoring the shattered shaver on the ground I patted around for my phone to search for an online dictionary for all words ending in ation, but it was not on me. \"shit\"! I thought as I remembered I left it in my room. My room was the next one over from the bathroom. I carefully opened the door and peered up and down the hallway, and threw myself out of the bathroom and into my room. I closed the door behind me as quickly as I could without slamming it. There it was, on my bedside table. \"DANIEL!\" came a screen from outside my door, \"i'm coming in, you better have a bloody good reason for breaking such an expensive shaver!\". \n\n\"no no no no no no, shit\" I whispered as my eyes darted around the room, desperately looking for a hat or a beanie to put on. I heard the latch open, and the initial creek of the door. This is it, I have no choice but to tell them. \"But what if they're some how part of this\"? I thought to myself, immediately swatting the thought out of my mind. I took a deep breath as she stepped through the door. \n\n\"you're paying for a new shaver. Jesus Daniel! what have you done to your hair? Now how are you gonna shave the rest of it? Serves you right for breaking the shaver\". \n\nDesperately trying to hold back the tremor in my voice I said \"Okay!, okay I will buy a new one after school\". \n\n\"thank you, what are you going to do about the rest of it\"? \n\n\"I'll just use a razor, want it shorter anyway\" I replied trying my hardest to seem normal.\n\n\"Alright, just remember to get the shaver\". \n\n\"yes mum\" I said as she stepped back into the hallway. I sighed deeply in relief, but remembered that she was unfazed by the tattoos on my scalp. How? How Did she not notice them? It is a little dark in here I guess. I decided I couldn't know, and I was just torturing myself with what I imagined could be written on the rest of my head. I went to my parents bathroom, grabbed the shaving cream and sprayed it all around my head, and grabbing my dads razor I carefully and closely shaved my hair off. As I shaved it off I realised that there was no longer any words there, just bare skin, and a couple of nicks where I got too eager to finish and read the whole message. The shaving cream must have taken it off. But there was still the question of how. Perhaps it was all in my head, I have been very stressed, It's my final year of high school, and it's coming up to the exam date. Maybe my mind invented this to take it away from the anxiety about my looming exams. \n\nHaving been satisfied with my conclusion, and doing some quick research to find out about hallucinations associated with stress, I walked to the bathroom to clean up the shaver and take pictures to show my mates. A fear rushed over me as I faced the bathroom entrance in the hallway. I stayed staring for a moment before I convinced myself again that it was simply stress, and that it will pass. I entered the bathroom and looked in the mirror. Everything stopped and the breath was literally taken out of me as I stared, horrified at what I read - \"we have all the information that we need on the human race. The time for war has come my son, please return home\". Just as soon as I read the message, the mirror scanned my head, and a tear began appearing where the wall and the mirror was, as if it were a piece of paper. light began to swirl around it, and all that could be seen from looking through it was pitch black nothingness. I began to feel as though it was pulling me in, I couldn't resist. I was frozen, not out of fear though. This was different. Something was rendering me incapable of any movement. My heart was racing, adrenaline was coarsing through me but I couldn't move. Not even a wiggle, or a twitch. Just as I entered the hole, I blacked out. \n\nI awoke in eerily familiar surroundings...\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I lowered the shaver. As it got close the the bench it began rattling violently, I looked down thinking I hadn&amp;#39;t turned it off, but it was my hand shaking violently. I had just taken off a patch of my hair and I could make out one word &amp;quot;home&amp;quot;. Terrified at the sight in front of me I stood there, staring at the patch, completely still. Too scared to leave the room, to move to do anything. I couldn&amp;#39;t even avert my eyes elsewhere. All I could do was stare at the otherwise harmless word. A word associated with warmth and comfort was now sending ice cold shivers down my spine that froze my whole body in place.&lt;/p&gt;\n\n&lt;p&gt;I stared for so longthat the word no longer made sense to me. All I could think about was how it got there. Who put it there, and what the rest of the message said. I lurched into action, grabbed the soap as if possessed and started scrubbing the bald patch till it was red raw. Nothing. Not even a smudge. My curiosity won me over and I stepped right up to the mirror and parted the hair around it, pulling so hard to expose my scalp that I ripped some hair out just to the right of the word. What appeared was a dot of black, the same colour as the word. This was the end of a sentence. But how? I could&amp;#39;ve sworn there was nothing on the other side of the word. I parted my hair to the left of the word, looking like a nervous wreck trying to pull my hair out. But nothing was there. Just this word. &lt;/p&gt;\n\n&lt;p&gt;Having conjured up disturbing thoughts about what this one word could mean I decided to finish the job. There was no longer any curiosity to what the rest of the message was. It was just one word. I wanted to finish this and go and try figure this out, &amp;quot;home, what the Fuck were you trying to tell me whoever you are&amp;quot;? I mumbled to myself as I picked up the shaver. My heart still pounding at my chest like a kick drum in a song going 1 thousand beats per minute, my hand still possessed, shaking so violently I thought I might sprain my wrist. &lt;/p&gt;\n\n&lt;p&gt;I composed myself, drew in and exhaled a few deep breaths, and went at it, shaving the rest of my head determined to get on with deciphering this vague message. Still consumed by fear, fear about the uncertainty around this message and how it got there. I continued up from the initial patch until the point where the structure of my skull began rounding down to my neck. I took a quick look at my work and was again stunned by what reflected back at me in the mirror. This time the shaver dropped to the ground and shattered. Unfazed by this, unable to react to anything but what presented itself on my head. As if the message magically appeared when my scalp was fully exposed, like the invisible ink we play with at school. Three more words were exposed now, going up in a line on top of the first. The word on top of home was &amp;quot;come&amp;quot; The word on top of that was &amp;quot;race&amp;quot;, and the word at the top was cut off. All I could make out was &amp;quot;ation&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Completely ignoring the shattered shaver on the ground I patted around for my phone to search for an online dictionary for all words ending in ation, but it was not on me. &amp;quot;shit&amp;quot;! I thought as I remembered I left it in my room. My room was the next one over from the bathroom. I carefully opened the door and peered up and down the hallway, and threw myself out of the bathroom and into my room. I closed the door behind me as quickly as I could without slamming it. There it was, on my bedside table. &amp;quot;DANIEL!&amp;quot; came a screen from outside my door, &amp;quot;i&amp;#39;m coming in, you better have a bloody good reason for breaking such an expensive shaver!&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;no no no no no no, shit&amp;quot; I whispered as my eyes darted around the room, desperately looking for a hat or a beanie to put on. I heard the latch open, and the initial creek of the door. This is it, I have no choice but to tell them. &amp;quot;But what if they&amp;#39;re some how part of this&amp;quot;? I thought to myself, immediately swatting the thought out of my mind. I took a deep breath as she stepped through the door. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;you&amp;#39;re paying for a new shaver. Jesus Daniel! what have you done to your hair? Now how are you gonna shave the rest of it? Serves you right for breaking the shaver&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Desperately trying to hold back the tremor in my voice I said &amp;quot;Okay!, okay I will buy a new one after school&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;thank you, what are you going to do about the rest of it&amp;quot;? &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ll just use a razor, want it shorter anyway&amp;quot; I replied trying my hardest to seem normal.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Alright, just remember to get the shaver&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;yes mum&amp;quot; I said as she stepped back into the hallway. I sighed deeply in relief, but remembered that she was unfazed by the tattoos on my scalp. How? How Did she not notice them? It is a little dark in here I guess. I decided I couldn&amp;#39;t know, and I was just torturing myself with what I imagined could be written on the rest of my head. I went to my parents bathroom, grabbed the shaving cream and sprayed it all around my head, and grabbing my dads razor I carefully and closely shaved my hair off. As I shaved it off I realised that there was no longer any words there, just bare skin, and a couple of nicks where I got too eager to finish and read the whole message. The shaving cream must have taken it off. But there was still the question of how. Perhaps it was all in my head, I have been very stressed, It&amp;#39;s my final year of high school, and it&amp;#39;s coming up to the exam date. Maybe my mind invented this to take it away from the anxiety about my looming exams. &lt;/p&gt;\n\n&lt;p&gt;Having been satisfied with my conclusion, and doing some quick research to find out about hallucinations associated with stress, I walked to the bathroom to clean up the shaver and take pictures to show my mates. A fear rushed over me as I faced the bathroom entrance in the hallway. I stayed staring for a moment before I convinced myself again that it was simply stress, and that it will pass. I entered the bathroom and looked in the mirror. Everything stopped and the breath was literally taken out of me as I stared, horrified at what I read - &amp;quot;we have all the information that we need on the human race. The time for war has come my son, please return home&amp;quot;. Just as soon as I read the message, the mirror scanned my head, and a tear began appearing where the wall and the mirror was, as if it were a piece of paper. light began to swirl around it, and all that could be seen from looking through it was pitch black nothingness. I began to feel as though it was pulling me in, I couldn&amp;#39;t resist. I was frozen, not out of fear though. This was different. Something was rendering me incapable of any movement. My heart was racing, adrenaline was coarsing through me but I couldn&amp;#39;t move. Not even a wiggle, or a twitch. Just as I entered the hole, I blacked out. &lt;/p&gt;\n\n&lt;p&gt;I awoke in eerily familiar surroundings...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgaje2b", "score_hidden": false, "stickied": false, "created": 1492282947.0, "created_utc": 1492254147.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}]