[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WritingPrompts", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Writing Prompt", "id": "65hzlv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 180, "report_reasons": null, "author": "mistaque", "saved": false, "mod_reports": [], "name": "t3_65hzlv", "subreddit_name_prefixed": "r/WritingPrompts", "approved_by": null, "over_18": false, "domain": "self.WritingPrompts", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s3nb", "edited": false, "link_flair_css_class": "flairwp", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WritingPrompts/comments/65hzlv/wp_two_time_travelers_meet_one_is_a_wizard_trying/", "num_reports": null, "locked": false, "stickied": false, "created": 1492270954.0, "url": "https://www.reddit.com/r/WritingPrompts/comments/65hzlv/wp_two_time_travelers_meet_one_is_a_wizard_trying/", "author_flair_text": null, "quarantine": false, "title": "[WP] Two time travelers meet. One is a wizard trying out a new spell. The other is a scientist who created a machine.", "created_utc": 1492242154.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 180}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hzlv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgafj1g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WritingPromptsRobot", "parent_id": "t3_65hzlv", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\n**Off-Topic Discussion**: All top-level comments must be a story or poem. Reply here for other comments.\n\n#####Reminder for Writers and Readers:\n* Prompts are meant to inspire new writing.  Responses don't have to fulfill every detail.\n\n* Please remember to [be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback.\n\n---\n\n[](#icon-help)[^(What Is This?)](https://www.reddit.com/r/WritingPrompts/wiki/off_topic) [](#icon-information)[^(First Time Here?)](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) [](#icon-exclamation)[^(Special Announcements)](https://www.reddit.com/r/WritingPrompts/wiki/announcements) [](#icon-comments)[^(Click For Our Chatroom)](https://www.reddit.com/r/WritingPrompts/wiki/chat)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Off-Topic Discussion&lt;/strong&gt;: All top-level comments must be a story or poem. Reply here for other comments.&lt;/p&gt;\n\n&lt;h5&gt;Reminder for Writers and Readers:&lt;/h5&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Prompts are meant to inspire new writing.  Responses don&amp;#39;t have to fulfill every detail.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Please remember to &lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil\"&gt;be civil&lt;/a&gt; in any feedback.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"#icon-help\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/off_topic\"&gt;&lt;sup&gt;What Is This?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-information\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/user_guide\"&gt;&lt;sup&gt;First Time Here?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-exclamation\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/announcements\"&gt;&lt;sup&gt;Special Announcements&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-comments\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/chat\"&gt;&lt;sup&gt;Click For Our Chatroom&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgafj1g", "score_hidden": true, "stickied": true, "created": 1492270975.0, "created_utc": 1492242175.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hzlv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hzlv", "likes": null, "replies": "", "user_reports": [], "id": "dgawrqa", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Evaara", "parent_id": "t1_dgaro33", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Marty: Doc? Is that you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Marty: Doc? Is that you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgawrqa", "score_hidden": false, "stickied": false, "created": 1492306186.0, "created_utc": 1492277386.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hzlv", "likes": null, "replies": "", "user_reports": [], "id": "dgauns4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "suavewolf", "parent_id": "t1_dgaro33", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Please more!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please more!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgauns4", "score_hidden": false, "stickied": false, "created": 1492303295.0, "created_utc": 1492274495.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hzlv", "likes": null, "replies": "", "user_reports": [], "id": "dgb7yrt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Fiery1Phoenix", "parent_id": "t1_dgaro33", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "More please", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;More please&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgb7yrt", "score_hidden": false, "stickied": false, "created": 1492321426.0, "created_utc": 1492292626.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaro33", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "scrazerax", "parent_id": "t3_65hzlv", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "The old man stood up and wiped his chalky hands on his robe, not minding the markings it left on his favorite piece of clothing.\n\n\"Finally,\" He sighed stepping back to marvel at completed work. Across the stone floor laid an intricate design woven in chalk. It appeared to form two circles with numerous lines connecting the inner and outer circle as they crossed, intertwined, swerved and connected together. At regular intervals across the circle, various colored gems appeared to be inlaid, peppering the grey and white design with dazzling colors. After giving it one last sweeping look the man picked his long wooden cane off the floor and hobbled to the edge of the design, carefully avoiding the lines as he walked. After reaching the edge of the large design he leaned on his cane for a few long breaths before turning around and looking back toward the center of the cave.\n\n\"Let us begin,\" he gave a wide grin before lifting his cane well above his head and began to chant. It took only seconds before effects could be seen. A bright light cut through the dim candle lit cave and a roaring reverberated against the walls. The old man's eyes were dazzling as he let the strange words rhythmically roll of his tongue.\nBefore long the light faded, the noise stopped, and the man collapsed to his knees. Desperate to know the result even a moment sooner, his feeble arms shook as he pushed himself off the cool stone.\n\n\"Did it work?\" The worlds trailed off his tongue as he found his feet. Before him was a strange white and silver object. It held sharp edges and perfectly smooth sides as if cut by the kingdom's finest mason. \nThe old man wandered toward the object while running his finger through his waggly old beard. \"Did I summon this strange stone? I don't recall using any summoning formula bases...\"\n\nSuddenly a loud hiss arose and crack appeared on one of the perfect silver sides. Fumbling the man fell backward catching himself with his hand behind him. He could no longer find the words to speak as a man encased dazzling pure white cloth emerged and spoke, \"Excuse me sir, could you tell me what year it is?\"\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The old man stood up and wiped his chalky hands on his robe, not minding the markings it left on his favorite piece of clothing.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Finally,&amp;quot; He sighed stepping back to marvel at completed work. Across the stone floor laid an intricate design woven in chalk. It appeared to form two circles with numerous lines connecting the inner and outer circle as they crossed, intertwined, swerved and connected together. At regular intervals across the circle, various colored gems appeared to be inlaid, peppering the grey and white design with dazzling colors. After giving it one last sweeping look the man picked his long wooden cane off the floor and hobbled to the edge of the design, carefully avoiding the lines as he walked. After reaching the edge of the large design he leaned on his cane for a few long breaths before turning around and looking back toward the center of the cave.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Let us begin,&amp;quot; he gave a wide grin before lifting his cane well above his head and began to chant. It took only seconds before effects could be seen. A bright light cut through the dim candle lit cave and a roaring reverberated against the walls. The old man&amp;#39;s eyes were dazzling as he let the strange words rhythmically roll of his tongue.\nBefore long the light faded, the noise stopped, and the man collapsed to his knees. Desperate to know the result even a moment sooner, his feeble arms shook as he pushed himself off the cool stone.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Did it work?&amp;quot; The worlds trailed off his tongue as he found his feet. Before him was a strange white and silver object. It held sharp edges and perfectly smooth sides as if cut by the kingdom&amp;#39;s finest mason. \nThe old man wandered toward the object while running his finger through his waggly old beard. &amp;quot;Did I summon this strange stone? I don&amp;#39;t recall using any summoning formula bases...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Suddenly a loud hiss arose and crack appeared on one of the perfect silver sides. Fumbling the man fell backward catching himself with his hand behind him. He could no longer find the words to speak as a man encased dazzling pure white cloth emerged and spoke, &amp;quot;Excuse me sir, could you tell me what year it is?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgaro33", "score_hidden": false, "stickied": false, "created": 1492299097.0, "created_utc": 1492270297.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 46}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hzlv", "likes": null, "replies": "", "user_reports": [], "id": "dgbkemj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kwzeigler", "parent_id": "t3_65hzlv", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "So Agnieszka comes into my garage while I’m working on my time machine. (Yeah, I know, okay…it’s just what it is… what can I say?) She’s like, “Hey, Suze, how’s the gizmo coming?”\n\n  “Uh, not so loud, Aga.” She’s standing there her arms on her hips. She’s tall, much taller than me so she towers above me tossing her long blond hair back and smirking the way she does. “What?! Doesn’t your mom know about the time machine?” \n\n  I winced. “Don’t call it that. Better to stick with ‘gizmo.’”\n\n  “When do I get to go anywhere in it, Suzie?”\n\n  “Okay,” I said, “Get in.” So we snuggled in together into the tiny cockpit of the thing. It’s sort of like a little golf cart but more enclosed and not so bulky and heavy. I set some dials. “I hope this garage wasn’t buried under a mountain or something in the past,” I said pushing the start button and then everything went black. And noiseless but quiet – if that’s even the right word – in a way that seemed to fill my head with a racket. Is this what they mean by ‘white noise’? In about half a minute though, we saw swirly lights and then everything started to come into focus. A lot like a dream – when everything seems to make sense even though it’s totally screwy. \n  And then there we were. The garage was gone of course. And we were in the woods. We struggled out of the little gizmo. There was a creek about five feet away. And a path that led away from the creek. \n\n  “Shall we go this way?” I asked Aga, pointing to the path.\n\n  She nodded and looked around. “This place does seem familiar though.”\n\n  “That’s because it’s my backyard.”\n\n  We walked about half a mile and then we were in the town. The town. I mean, like, my hometown only smaller and no cars and dirt streets. The street is narrow flanked on each side by a row of houses. Only one I recognize. It’s the county historical museum now of course. Two and half stories, about half a block wide. Nice.\n\n  A woman emerged from a doorway ahead of us dressed in a floor-length dress and a bonnet. “We probably should have dressed for this,” Aga said. Did I mention we were both wearing little shorts and I was in a tee-shirt and Aga in a halter top? “I’m not even wearing a bra,” Aga whispered.\n\n  “Don’t worry,” I told her: “I don’t think bras have been invented yet.”\n  “That’s a relief.”\n\n  Anyway, the woman walked past us, sort of looking us over. \n\n  “I just got here,” Aga told her. She does crack me up. \n\n  And then we saw him. The guy who was going to change our lives. (Although I guess if you go back in time, whatever happens is going to change your life.) \n\n  He’s wearing like a long caftan and one of those round Serbian or whatever caps – red with a dangling tassel. He has a bit of a little mustache and goatee. He’s about late twenties or so. Tall. Handsome actually. And I could tell Aga was impressed too. He walks right up to us. He’s like, “You two young ladies aren’t from here, I take it.”\n\n  “And you are?” Aga retorts. This makes him laugh. A good sign, I think.\n\n  “I just got here from somewhere else. And I expect you did too.”\n\n  “We’ve been here less than half an hour,” Aga tells him.\n\n  “Actually, I’ve lived here all my life,” I told him, “Just not now.”\n\n  “That’s what I suspected when I saw you,” he said. “Let’s go to that inn over there. We can have a bite to eat.”\n\n  “My mother’s serving dinner in a few minutes,” I said.\n\n  Aga gave me a reproachful look. “Yeah, Suze, in 2017!”\n\n  I shrugged and we walked half a block up the street and walked into what looked like really a rather nice little inn/brewpub or what have you. We took seats at a table.\n\n  “This is cozy,” I said.\n\n  “You have a bit of a British accent, I think,” Aga told our companion.\n\n  “I spent the sixties in London,” he explained (and he made quotation marks with his fingers when he said ‘sixties’), “though I am originally from what you would call eastern Europe – in what is now known as the fourth century C.E.”\n\n  I’m like, “Wow! I’m Suzie,” I said, “And this is my best friend Agnieszka.”\n\n  “Yeah, my grandparents are from your neck of the woods,” she told him.\n\n  He smiled and nodded. “My name is Peabody.” We both registered looks of astonishment. He grimaced. “Okay, I made it up or rather copied it from an animated television show.”\n\n  “I could use a drink,” I said, dryly (ha).\n\n  Aga looked around. “Are they going to card us?” \n\n  “It’s sixteen ninety-nine,” Peabody said. “They don’t have rules yet.”\n\n  So the lady came to our table and we all ordered beer. \n\n  “So here’s the thing,” Peabody said when our beers arrived and we toasted the luck of our meeting and took our first sips and Aga asked him what he was doing here in 1699, “I have been traveling hither and yon…” he paused.\n\n  “For seventeen centuries,” I interjected.\n\n  He laughed. “Well, of course yes and no. I’m only 28. So the time flies, as it were.” \n\n  Aga is gazing at him, rapt.\n\n  He goes on: “I am what you call a wizard. And I have developed a spell to travel in time and space. I have been here three weeks. One of the things going on here, however, is that they are having a witch trial. Really I would like to just leave but I feel like I should save this poor young lady from the trial before I go. This place makes me nervous. Since I myself am a magician and these people execute magicians, I am rather disposed to make an exit as expeditiously as feasible. Now that you are here, perhaps you can be of assistance.”\n\n  “A witch trial?!” I exclaim. “Right here in River City? We will be glad to help.” And Aga nods vigorously.\n\n  “Tomorrow is the trial,” Peabody tells us. “First thing in the morning. Where are you staying?”\n\n  I roll my eyes. “I live down the street from here but the street hasn’t been made yet.”\n\n  So Peabody arranged for us to stay at the house of a friend of his. A very nice lady named Agnes. “That’s just like my name,” Aga exclaimed when they were introduced. They seemed to hit it off right away. Also Agnes loaned us some clothes since we had nothing to wear but our scandalously revealing come-as-you-are stuff. We spent the evening sitting up with Agnes and talking about life in Pleasantville (I made this name up). I told her that I lived there but then I had to stammer around since she had lived there, like me, all her life but had never laid eyes on me before. Finally we realized that Peabody had already told her about time travel and then I could explain that I too was a time traveler, that I had lived my whole life in Pleasantville born and raised. We got along really well after that. She was very cool. She was also upset about the trail coming up the next day. \n\n  “It is my earnest desire that you and my namesake will be able to assist in alleviating the danger that menaces poor dear Felicity on the morrow.”\n\n  So the next morning we have beer for breakfast. (I think I like the 17th century.) And we go out into the street. Now there’s about a hundred people out there, presumably out for blood. Peabody comes up to us right away. “Pleasant night?” he asks.\n\n  I’m like, “Yes.” And my new friend Agnes takes my hand and squeezes it. “Really, I’m glad to be here,” I said. And Agnieszka sidles up to Peabody and sort of strokes his arm. Things are looking up. \n\n  “What’s the plan, Mr. Peabody?” Aga asks him.\n\n  “If I can just get Ms. Felicity away from the crowd, perhaps I can cast a spell and take her away. Where can I go?”\n\n  I tell him he can take her to my house, which after all, is just down the street. I give him the street coordinates and house number. “It’s a two story, wooden house painted white, on High Street between Elm and Oak Avenues. You can’t miss it.”\n\n  “Your honor!” Peabody exclaims, approaching the dais set up at one side of the town square (right where the Dairy Queen is now). “I am representing Miss Felicity in this case.” The surly crowd parts as our tall young hero strides towards the dais. \n\n  The judge, a dour looking old fart (as you would expect) looks down upon Peabody. “And who, pray tell, art thou?”\n\n  “I am Mr. Peabody. And I represent Mistress Felicity in the case of the Crown versus Felicity Droughthaven.”\n  “The Court recognizes Mr. Peabody,” intoned the old bugaboo. \n\n  Then, suddenly and rather astonishingly, Peabody raised his arms and exclaimed: “Klaatu barada nikto!” And in a twinkling, he and Ms. Felicity vanished. In a puff of smoke? Uh, I’m not sure, though it sort of seemed like that. \n  “Where did they go?” Agnes asked me.\n\n  “To my house,” I said, “It’s just a couple blocks away. Let’s go.” I took her by the hand and with Agnieszka following ran for the woods where my gizmo was parked. We jumped in, really a tight fit now but we managed and I pressed the buttons and in about 45 seconds, voila.\n\n\n \n\n\n", "edited": 1492311096.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So Agnieszka comes into my garage while I’m working on my time machine. (Yeah, I know, okay…it’s just what it is… what can I say?) She’s like, “Hey, Suze, how’s the gizmo coming?”&lt;/p&gt;\n\n&lt;p&gt;“Uh, not so loud, Aga.” She’s standing there her arms on her hips. She’s tall, much taller than me so she towers above me tossing her long blond hair back and smirking the way she does. “What?! Doesn’t your mom know about the time machine?” &lt;/p&gt;\n\n&lt;p&gt;I winced. “Don’t call it that. Better to stick with ‘gizmo.’”&lt;/p&gt;\n\n&lt;p&gt;“When do I get to go anywhere in it, Suzie?”&lt;/p&gt;\n\n&lt;p&gt;“Okay,” I said, “Get in.” So we snuggled in together into the tiny cockpit of the thing. It’s sort of like a little golf cart but more enclosed and not so bulky and heavy. I set some dials. “I hope this garage wasn’t buried under a mountain or something in the past,” I said pushing the start button and then everything went black. And noiseless but quiet – if that’s even the right word – in a way that seemed to fill my head with a racket. Is this what they mean by ‘white noise’? In about half a minute though, we saw swirly lights and then everything started to come into focus. A lot like a dream – when everything seems to make sense even though it’s totally screwy. \n  And then there we were. The garage was gone of course. And we were in the woods. We struggled out of the little gizmo. There was a creek about five feet away. And a path that led away from the creek. &lt;/p&gt;\n\n&lt;p&gt;“Shall we go this way?” I asked Aga, pointing to the path.&lt;/p&gt;\n\n&lt;p&gt;She nodded and looked around. “This place does seem familiar though.”&lt;/p&gt;\n\n&lt;p&gt;“That’s because it’s my backyard.”&lt;/p&gt;\n\n&lt;p&gt;We walked about half a mile and then we were in the town. The town. I mean, like, my hometown only smaller and no cars and dirt streets. The street is narrow flanked on each side by a row of houses. Only one I recognize. It’s the county historical museum now of course. Two and half stories, about half a block wide. Nice.&lt;/p&gt;\n\n&lt;p&gt;A woman emerged from a doorway ahead of us dressed in a floor-length dress and a bonnet. “We probably should have dressed for this,” Aga said. Did I mention we were both wearing little shorts and I was in a tee-shirt and Aga in a halter top? “I’m not even wearing a bra,” Aga whispered.&lt;/p&gt;\n\n&lt;p&gt;“Don’t worry,” I told her: “I don’t think bras have been invented yet.”\n  “That’s a relief.”&lt;/p&gt;\n\n&lt;p&gt;Anyway, the woman walked past us, sort of looking us over. &lt;/p&gt;\n\n&lt;p&gt;“I just got here,” Aga told her. She does crack me up. &lt;/p&gt;\n\n&lt;p&gt;And then we saw him. The guy who was going to change our lives. (Although I guess if you go back in time, whatever happens is going to change your life.) &lt;/p&gt;\n\n&lt;p&gt;He’s wearing like a long caftan and one of those round Serbian or whatever caps – red with a dangling tassel. He has a bit of a little mustache and goatee. He’s about late twenties or so. Tall. Handsome actually. And I could tell Aga was impressed too. He walks right up to us. He’s like, “You two young ladies aren’t from here, I take it.”&lt;/p&gt;\n\n&lt;p&gt;“And you are?” Aga retorts. This makes him laugh. A good sign, I think.&lt;/p&gt;\n\n&lt;p&gt;“I just got here from somewhere else. And I expect you did too.”&lt;/p&gt;\n\n&lt;p&gt;“We’ve been here less than half an hour,” Aga tells him.&lt;/p&gt;\n\n&lt;p&gt;“Actually, I’ve lived here all my life,” I told him, “Just not now.”&lt;/p&gt;\n\n&lt;p&gt;“That’s what I suspected when I saw you,” he said. “Let’s go to that inn over there. We can have a bite to eat.”&lt;/p&gt;\n\n&lt;p&gt;“My mother’s serving dinner in a few minutes,” I said.&lt;/p&gt;\n\n&lt;p&gt;Aga gave me a reproachful look. “Yeah, Suze, in 2017!”&lt;/p&gt;\n\n&lt;p&gt;I shrugged and we walked half a block up the street and walked into what looked like really a rather nice little inn/brewpub or what have you. We took seats at a table.&lt;/p&gt;\n\n&lt;p&gt;“This is cozy,” I said.&lt;/p&gt;\n\n&lt;p&gt;“You have a bit of a British accent, I think,” Aga told our companion.&lt;/p&gt;\n\n&lt;p&gt;“I spent the sixties in London,” he explained (and he made quotation marks with his fingers when he said ‘sixties’), “though I am originally from what you would call eastern Europe – in what is now known as the fourth century C.E.”&lt;/p&gt;\n\n&lt;p&gt;I’m like, “Wow! I’m Suzie,” I said, “And this is my best friend Agnieszka.”&lt;/p&gt;\n\n&lt;p&gt;“Yeah, my grandparents are from your neck of the woods,” she told him.&lt;/p&gt;\n\n&lt;p&gt;He smiled and nodded. “My name is Peabody.” We both registered looks of astonishment. He grimaced. “Okay, I made it up or rather copied it from an animated television show.”&lt;/p&gt;\n\n&lt;p&gt;“I could use a drink,” I said, dryly (ha).&lt;/p&gt;\n\n&lt;p&gt;Aga looked around. “Are they going to card us?” &lt;/p&gt;\n\n&lt;p&gt;“It’s sixteen ninety-nine,” Peabody said. “They don’t have rules yet.”&lt;/p&gt;\n\n&lt;p&gt;So the lady came to our table and we all ordered beer. &lt;/p&gt;\n\n&lt;p&gt;“So here’s the thing,” Peabody said when our beers arrived and we toasted the luck of our meeting and took our first sips and Aga asked him what he was doing here in 1699, “I have been traveling hither and yon…” he paused.&lt;/p&gt;\n\n&lt;p&gt;“For seventeen centuries,” I interjected.&lt;/p&gt;\n\n&lt;p&gt;He laughed. “Well, of course yes and no. I’m only 28. So the time flies, as it were.” &lt;/p&gt;\n\n&lt;p&gt;Aga is gazing at him, rapt.&lt;/p&gt;\n\n&lt;p&gt;He goes on: “I am what you call a wizard. And I have developed a spell to travel in time and space. I have been here three weeks. One of the things going on here, however, is that they are having a witch trial. Really I would like to just leave but I feel like I should save this poor young lady from the trial before I go. This place makes me nervous. Since I myself am a magician and these people execute magicians, I am rather disposed to make an exit as expeditiously as feasible. Now that you are here, perhaps you can be of assistance.”&lt;/p&gt;\n\n&lt;p&gt;“A witch trial?!” I exclaim. “Right here in River City? We will be glad to help.” And Aga nods vigorously.&lt;/p&gt;\n\n&lt;p&gt;“Tomorrow is the trial,” Peabody tells us. “First thing in the morning. Where are you staying?”&lt;/p&gt;\n\n&lt;p&gt;I roll my eyes. “I live down the street from here but the street hasn’t been made yet.”&lt;/p&gt;\n\n&lt;p&gt;So Peabody arranged for us to stay at the house of a friend of his. A very nice lady named Agnes. “That’s just like my name,” Aga exclaimed when they were introduced. They seemed to hit it off right away. Also Agnes loaned us some clothes since we had nothing to wear but our scandalously revealing come-as-you-are stuff. We spent the evening sitting up with Agnes and talking about life in Pleasantville (I made this name up). I told her that I lived there but then I had to stammer around since she had lived there, like me, all her life but had never laid eyes on me before. Finally we realized that Peabody had already told her about time travel and then I could explain that I too was a time traveler, that I had lived my whole life in Pleasantville born and raised. We got along really well after that. She was very cool. She was also upset about the trail coming up the next day. &lt;/p&gt;\n\n&lt;p&gt;“It is my earnest desire that you and my namesake will be able to assist in alleviating the danger that menaces poor dear Felicity on the morrow.”&lt;/p&gt;\n\n&lt;p&gt;So the next morning we have beer for breakfast. (I think I like the 17th century.) And we go out into the street. Now there’s about a hundred people out there, presumably out for blood. Peabody comes up to us right away. “Pleasant night?” he asks.&lt;/p&gt;\n\n&lt;p&gt;I’m like, “Yes.” And my new friend Agnes takes my hand and squeezes it. “Really, I’m glad to be here,” I said. And Agnieszka sidles up to Peabody and sort of strokes his arm. Things are looking up. &lt;/p&gt;\n\n&lt;p&gt;“What’s the plan, Mr. Peabody?” Aga asks him.&lt;/p&gt;\n\n&lt;p&gt;“If I can just get Ms. Felicity away from the crowd, perhaps I can cast a spell and take her away. Where can I go?”&lt;/p&gt;\n\n&lt;p&gt;I tell him he can take her to my house, which after all, is just down the street. I give him the street coordinates and house number. “It’s a two story, wooden house painted white, on High Street between Elm and Oak Avenues. You can’t miss it.”&lt;/p&gt;\n\n&lt;p&gt;“Your honor!” Peabody exclaims, approaching the dais set up at one side of the town square (right where the Dairy Queen is now). “I am representing Miss Felicity in this case.” The surly crowd parts as our tall young hero strides towards the dais. &lt;/p&gt;\n\n&lt;p&gt;The judge, a dour looking old fart (as you would expect) looks down upon Peabody. “And who, pray tell, art thou?”&lt;/p&gt;\n\n&lt;p&gt;“I am Mr. Peabody. And I represent Mistress Felicity in the case of the Crown versus Felicity Droughthaven.”\n  “The Court recognizes Mr. Peabody,” intoned the old bugaboo. &lt;/p&gt;\n\n&lt;p&gt;Then, suddenly and rather astonishingly, Peabody raised his arms and exclaimed: “Klaatu barada nikto!” And in a twinkling, he and Ms. Felicity vanished. In a puff of smoke? Uh, I’m not sure, though it sort of seemed like that. \n  “Where did they go?” Agnes asked me.&lt;/p&gt;\n\n&lt;p&gt;“To my house,” I said, “It’s just a couple blocks away. Let’s go.” I took her by the hand and with Agnieszka following ran for the woods where my gizmo was parked. We jumped in, really a tight fit now but we managed and I pressed the buttons and in about 45 seconds, voila.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgbkemj", "score_hidden": false, "stickied": false, "created": 1492339315.0, "created_utc": 1492310515.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hzlv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hzlv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hzlv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65hzlv", "likes": null, "replies": "", "user_reports": [], "id": "dgbli3f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mistaque", "parent_id": "t1_dgb7opb", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Improvement through practice is what writing prompts is all about.  Keep at it and you'll get there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Improvement through practice is what writing prompts is all about.  Keep at it and you&amp;#39;ll get there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgbli3f", "score_hidden": false, "stickied": false, "created": 1492340917.0, "created_utc": 1492312117.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7opb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Doctorus", "parent_id": "t1_dgas17k", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Yeah, that's what I had in mind when I wrote this, I still have bad writing style though, need to improve.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, that&amp;#39;s what I had in mind when I wrote this, I still have bad writing style though, need to improve.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgb7opb", "score_hidden": false, "stickied": false, "created": 1492321038.0, "created_utc": 1492292238.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgas17k", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mistaque", "parent_id": "t1_dgarefl", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Neat!  So they were the same person from alternate dimensions?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Neat!  So they were the same person from alternate dimensions?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgas17k", "score_hidden": false, "stickied": false, "created": 1492299615.0, "created_utc": 1492270815.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgarefl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Doctorus", "parent_id": "t3_65hzlv", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Spherical portal opened in middle of what looked like forest. Man in white labcoat and glasses jumped out of it, wearing a smirk on his face. His messy red hair made two points on top of his head. \"So Chronos 6.66 worked. COOL! But where am I?\", he looked at his time machine which he wore on wrist, year was 2420. \"So, that's the future, surprised trees still exist, wait, what the...\"\n\n\"DIIIII..... AAAAA... BU..... LUUUUUUUUUUSSS! EXTERMINATUS PURGATIO!\", mad man in purple cloak, wearing pointy green hat and looking like typical overused concept of wizard, while twisting his fingers in weird manner, yelled combo of Latin words while aiming his staff at \"Demon in lamb's coat\". Mr. Scientist luckily had translation device with him (plot device to be specific. You know, everyone can't speak all languages), so he understood what wizard was yelling and whatever he said was understood by wizard. \n\n\"WOOOOAH, calm down bro! I'm not a demon, I'm genius in lab coat!\". It was too late though, spell has been cast and scientist was about to get hit, also it didn't look like wizard realized who he was facing. 6.66 printed on time machine, hair that made him look like he had horns and \"weird clothing\" was more than enough to make wizard believe he was facing a demon. \n\n\"My spell destroys anyone and anything living! It will burn your soul, so even if you're a demon, you'll still be purged!\", wizard yelled seconds before spell projectile hit scientist. \"Damn man, I thought I was in future, seems like it's 2420 BC, not AD and looks like i'm a goner too. RIP 2021 AD - 2420 BC, died in past, born after death, huh... I might even find my own remains, but no, I didn't find it in present, so I won't. No time to he poetic.\". Lab dude was hit by deadly spell. However, he survived. \n\n\"You don't have a soul?! How is this possible!\" - wizard was surprised, but not as surprised as scientist himself. \"Didn't you notice what color my hair is?\", replied scientist. \"What does it have to do with soul?\", wizard was almost as curious as scientist. \"Well, forget it. Lets don't be enemies.\", pacifistic as always scientist managed to calm wizard down.  After a brief conversation, hostility between this two, or to be more specific, aggression from wizard was gone. \n\n\"So you are saying that you invented a spell \"Tempus Momentum\", allowing you to time travel?\".\n\n\"Yes mongrel, I did. I am great wizard, I spent years researching this spell and I managed to finally invoke it!\"\n\n\"Wow, it looks like he managed to travel farther in future than me, well he spent years compared to my month of work on his project\", scientist was thinking.\n\n\"What time period are you from, wizard? I'm from 2000s.\", scientist was as curious as always.\n\n\"So you're from past? Interesting!\". Wizard's answer made scientist drop his jaw. \"Wait! He's from future? A wizard? Did he travel back in time? How? Or is he from somewhere between 21st and 25th centuries? I never expected that wizards would be more futuristic than scientists!\". Scientist's smirk was gone and now, he had one big frozen-in-surprise look on his face.\n\n\"Technically, you're from past. I'm from earlier time period than you, but we're both still from past, you mongrel. This is 2420, you didn't know that?\"\n\n\"How the hell do you know current time period? I mean, you ar...\", before he could finish, wizard silenced him:\n\n\"Don't be an idiot! I am time traveler just like you. You expect me to don't know what time period I traveled to?\"\n\n\"I guess, you're right\". Scientist stopped talking and decided to explore area. \"Wizard, now i'm going to explore this place. You wanna come with me? We can do it...\"\n\n\"No thanks, I work solo.\" Wizard and scientist parted ways. \"Man I wonder when he's from. It's not like he's willing to say anyways\", scientist was thinking, while walking to huge city full of skyscrapers at the end of the forest. \n\nWhile walking his own path, wizard removed his hood, revealing his red hair to trees. \"Haha, who would've thought posing as a typical wizard in real life would've been so much fun. Glad magic exists.\" Wizard continued talking to the trees, or himself. His voice became harder to hear farther he went, then he cast a spell and disappeared. ", "edited": 1492270174.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Spherical portal opened in middle of what looked like forest. Man in white labcoat and glasses jumped out of it, wearing a smirk on his face. His messy red hair made two points on top of his head. &amp;quot;So Chronos 6.66 worked. COOL! But where am I?&amp;quot;, he looked at his time machine which he wore on wrist, year was 2420. &amp;quot;So, that&amp;#39;s the future, surprised trees still exist, wait, what the...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;DIIIII..... AAAAA... BU..... LUUUUUUUUUUSSS! EXTERMINATUS PURGATIO!&amp;quot;, mad man in purple cloak, wearing pointy green hat and looking like typical overused concept of wizard, while twisting his fingers in weird manner, yelled combo of Latin words while aiming his staff at &amp;quot;Demon in lamb&amp;#39;s coat&amp;quot;. Mr. Scientist luckily had translation device with him (plot device to be specific. You know, everyone can&amp;#39;t speak all languages), so he understood what wizard was yelling and whatever he said was understood by wizard. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;WOOOOAH, calm down bro! I&amp;#39;m not a demon, I&amp;#39;m genius in lab coat!&amp;quot;. It was too late though, spell has been cast and scientist was about to get hit, also it didn&amp;#39;t look like wizard realized who he was facing. 6.66 printed on time machine, hair that made him look like he had horns and &amp;quot;weird clothing&amp;quot; was more than enough to make wizard believe he was facing a demon. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;My spell destroys anyone and anything living! It will burn your soul, so even if you&amp;#39;re a demon, you&amp;#39;ll still be purged!&amp;quot;, wizard yelled seconds before spell projectile hit scientist. &amp;quot;Damn man, I thought I was in future, seems like it&amp;#39;s 2420 BC, not AD and looks like i&amp;#39;m a goner too. RIP 2021 AD - 2420 BC, died in past, born after death, huh... I might even find my own remains, but no, I didn&amp;#39;t find it in present, so I won&amp;#39;t. No time to he poetic.&amp;quot;. Lab dude was hit by deadly spell. However, he survived. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You don&amp;#39;t have a soul?! How is this possible!&amp;quot; - wizard was surprised, but not as surprised as scientist himself. &amp;quot;Didn&amp;#39;t you notice what color my hair is?&amp;quot;, replied scientist. &amp;quot;What does it have to do with soul?&amp;quot;, wizard was almost as curious as scientist. &amp;quot;Well, forget it. Lets don&amp;#39;t be enemies.&amp;quot;, pacifistic as always scientist managed to calm wizard down.  After a brief conversation, hostility between this two, or to be more specific, aggression from wizard was gone. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So you are saying that you invented a spell &amp;quot;Tempus Momentum&amp;quot;, allowing you to time travel?&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes mongrel, I did. I am great wizard, I spent years researching this spell and I managed to finally invoke it!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Wow, it looks like he managed to travel farther in future than me, well he spent years compared to my month of work on his project&amp;quot;, scientist was thinking.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What time period are you from, wizard? I&amp;#39;m from 2000s.&amp;quot;, scientist was as curious as always.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So you&amp;#39;re from past? Interesting!&amp;quot;. Wizard&amp;#39;s answer made scientist drop his jaw. &amp;quot;Wait! He&amp;#39;s from future? A wizard? Did he travel back in time? How? Or is he from somewhere between 21st and 25th centuries? I never expected that wizards would be more futuristic than scientists!&amp;quot;. Scientist&amp;#39;s smirk was gone and now, he had one big frozen-in-surprise look on his face.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Technically, you&amp;#39;re from past. I&amp;#39;m from earlier time period than you, but we&amp;#39;re both still from past, you mongrel. This is 2420, you didn&amp;#39;t know that?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How the hell do you know current time period? I mean, you ar...&amp;quot;, before he could finish, wizard silenced him:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Don&amp;#39;t be an idiot! I am time traveler just like you. You expect me to don&amp;#39;t know what time period I traveled to?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I guess, you&amp;#39;re right&amp;quot;. Scientist stopped talking and decided to explore area. &amp;quot;Wizard, now i&amp;#39;m going to explore this place. You wanna come with me? We can do it...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No thanks, I work solo.&amp;quot; Wizard and scientist parted ways. &amp;quot;Man I wonder when he&amp;#39;s from. It&amp;#39;s not like he&amp;#39;s willing to say anyways&amp;quot;, scientist was thinking, while walking to huge city full of skyscrapers at the end of the forest. &lt;/p&gt;\n\n&lt;p&gt;While walking his own path, wizard removed his hood, revealing his red hair to trees. &amp;quot;Haha, who would&amp;#39;ve thought posing as a typical wizard in real life would&amp;#39;ve been so much fun. Glad magic exists.&amp;quot; Wizard continued talking to the trees, or himself. His voice became harder to hear farther he went, then he cast a spell and disappeared. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgarefl", "score_hidden": false, "stickied": false, "created": 1492298717.0, "created_utc": 1492269917.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]