[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WritingPrompts", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Writing Prompt", "id": "65k1yl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 93, "report_reasons": null, "author": "elheber", "saved": false, "mod_reports": [], "name": "t3_65k1yl", "subreddit_name_prefixed": "r/WritingPrompts", "approved_by": null, "over_18": false, "domain": "self.WritingPrompts", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s3nb", "author_cakeday": true, "edited": false, "link_flair_css_class": "flairwp", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WritingPrompts/comments/65k1yl/wp_it_seemed_your_destiny_to_become_an_astronaut/", "num_reports": null, "locked": false, "stickied": false, "created": 1492303708.0, "url": "https://www.reddit.com/r/WritingPrompts/comments/65k1yl/wp_it_seemed_your_destiny_to_become_an_astronaut/", "author_flair_text": "/r/elheber_lit", "quarantine": false, "title": "[WP] It seemed your destiny to become an astronaut. On the day you finally set foot on the moon and the spaceship immediately abandoned you, you began to realize it wasn't actually destiny. Everyone on Earth just wanted to get rid of you.", "created_utc": 1492274908.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 93}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65k1yl", "likes": null, "replies": "", "user_reports": [], "id": "dgauytm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WritingPromptsRobot", "parent_id": "t3_65k1yl", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\n**Off-Topic Discussion**: All top-level comments must be a story or poem. Reply here for other comments.\n\n#####Reminder for Writers and Readers:\n* Prompts are meant to inspire new writing.  Responses don't have to fulfill every detail.\n\n* Please remember to [be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback.\n\n---\n\n[](#icon-help)[^(What Is This?)](https://www.reddit.com/r/WritingPrompts/wiki/off_topic) [](#icon-information)[^(First Time Here?)](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) [](#icon-exclamation)[^(Special Announcements)](https://www.reddit.com/r/WritingPrompts/wiki/announcements) [](#icon-comments)[^(Click For Our Chatroom)](https://www.reddit.com/r/WritingPrompts/wiki/chat)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Off-Topic Discussion&lt;/strong&gt;: All top-level comments must be a story or poem. Reply here for other comments.&lt;/p&gt;\n\n&lt;h5&gt;Reminder for Writers and Readers:&lt;/h5&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Prompts are meant to inspire new writing.  Responses don&amp;#39;t have to fulfill every detail.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Please remember to &lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil\"&gt;be civil&lt;/a&gt; in any feedback.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"#icon-help\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/off_topic\"&gt;&lt;sup&gt;What Is This?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-information\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/user_guide\"&gt;&lt;sup&gt;First Time Here?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-exclamation\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/announcements\"&gt;&lt;sup&gt;Special Announcements&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-comments\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/chat\"&gt;&lt;sup&gt;Click For Our Chatroom&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgauytm", "score_hidden": true, "stickied": true, "created": 1492303725.0, "created_utc": 1492274925.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65k1yl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65k1yl", "likes": null, "replies": "", "user_reports": [], "id": "dgbecox", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "elheber", "parent_id": "t1_dgb42tt", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Nice surprise at the end. Thank you for taking the time to write something for us to read.\n\nYou should consider dropping the first-person perspective. With a story about such a \"perfect\" or \"fault-free\" protagonist, there's much more of a risk to the character seeming like a Mary Sue if it's in first person. Perspective changes a lot. For example, if this were told from the perspective of the people trying to stop him, the character would seem like a relentless, unstoppable monster coming to doom them all. Telling it in first person makes the story sound arrogant and a little amateur.\n\nYour writing is great. If you drop the first-person, your writing would elevate much higher IMHO.\n\nAwesome stuff. Keep it up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice surprise at the end. Thank you for taking the time to write something for us to read.&lt;/p&gt;\n\n&lt;p&gt;You should consider dropping the first-person perspective. With a story about such a &amp;quot;perfect&amp;quot; or &amp;quot;fault-free&amp;quot; protagonist, there&amp;#39;s much more of a risk to the character seeming like a Mary Sue if it&amp;#39;s in first person. Perspective changes a lot. For example, if this were told from the perspective of the people trying to stop him, the character would seem like a relentless, unstoppable monster coming to doom them all. Telling it in first person makes the story sound arrogant and a little amateur.&lt;/p&gt;\n\n&lt;p&gt;Your writing is great. If you drop the first-person, your writing would elevate much higher IMHO.&lt;/p&gt;\n\n&lt;p&gt;Awesome stuff. Keep it up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgbecox", "score_hidden": false, "stickied": false, "created": 1492330525.0, "created_utc": 1492301725.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb42tt", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Covert_Ruffian", "parent_id": "t3_65k1yl", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "  I passed all the tests. I was suspicious at first; I suppose that comes with being the dictator of Wakhabstan. I never wanted to be a dictator; but my father told me to strike down all enemies and keep the people as they were in his time. I was named in the honor of the Moon; and so I followed my namesake. My destiny was the Moon, not this country. I wanted to see my country for what it was on Earth: dirt. Dirt that I ruled upon. That everyone ruled. Wars, bloodshed, money; all over dirt and water. Mud. The astronauts that accompanied me on my journey loved the sight, as did I.\n\nEarth was beautiful.\n\nBut the dwellers never were.\n\n  And so began my plot to end them. It took years. My movements weren't tracked; everyone thought I would die within an hour of my landing. They gave me a spiked can; it had the same amount of nitrogen, but less oxygen and more argon. At least they weren't cheap while trying to end me.\n\n  Their first mistake was giving me the brief opportunity to take extra oxygen cans with me. After the first one was depleted, I replaced it while holding my breath; the system automatically sealed the suit until I plugged the fresh can into the port. They'll find their mistake when *The Dolphin* comes back to Earth. Here's to hoping they won't care enough to actually kill me.\n\n  I walked for days. I used my navigation computer to guide me. I held in my breath as long as I could; if I were to survive, then I would live here. Simple as that.\n\nOn the fourth day, I arrived at the base. My clock said it was four days after we landed, which was a Friday; Tuesday was when I arrived). It was stark white, the paint had faded from hours of unfiltered sunlight, and it was all abandoned.\n\n  Their second mistake was leaving the door unlocked and the fridge stocked. There were decades of Level-1A food; feasts for decades. Three meals a day could keep me here for twenty years; the desserts added another five. And there was a garden, to see if vegetables and fruit became more nutritious if bound by the Moon's weaker gravitational pull. I grew some rather easily. They were much larger than regular tomatoes and apples and potatoes, but the equipment said they were less dense and yet had more vitamins and minerals. This could mean that my supply of food was guaranteed until the day I died.\n\nMy situation became like Matt Damon's; except there was no hope of rescue, I was careful with airlocks, and I knew the Moon's topography inside out.\n\nTheir third mistake was leaving spacecraft behind, silos with fuel, and everything else anyone would need to get off this barren rock.\n\n  It took me a year, but I configured three spacecraft to follow special directions via coding and taking apart certain devices and machines to steer the spacecraft to where I needed them. I needed basic instructions for them to follow. To take off when I do; keep at least a kilometer away; and to eject certain modules when needed.\n\nOver two years, I explored the moon base. Total vacancy, barring my stay. Complete silence. The base was shaped like a clock. I located the fuel silos; they were kept far away from the spacecraft and yet all around the base. The food and water storages were everywhere; in the case of a meteor, I suppose. The spacecraft were in the middle of it all.\n\n  I began to devise my plan of escaping. First, I would set the fuel silos to explode all around the base. I would then launch four spacecraft, me in one of them; but I readied a specific timer. Just enough time to seem like the spacecraft were jettisoned like debris from the destruction of the base. The central hangar had some silos in it and many fuel lines to the peripheral silos. This would be more convincing if they ever showed up to investigate trillions of dollars worth of damage. To make it seem like I accidentally ignited the fuel while loading it from the peripheral silo and the explosion spread throughout the base.\n\n  It all went according to plan. The charges were set, they exploded; the fuel ignited and was far more explosive than I thought. I launched faster than needed, but it was worth it. The explosion gave me an unexpected boost that compressed me into the chair. My main ship's internal gravity simulator started up as it started to orbit the Moon. I was there for a year, training my body to overcome the lax gravity of my namesake, fighting for my strength. The other spacecraft orbited alongside mine; no fuel was used up, and I had all the food I could take with me. \n\n  My ship detected another spacecraft coming towards my little fleet. I knew they would come; and they did. Perhaps to find the cause of the explosion and to recover what they could. They stepped inside my ship after stopping theirs enough to board mine. I wonder if they were surprised to feel the atmospheric conditions. I slipped into their ship when the workers and scientists weren't looking. I took a hammer with me; the pilot now had no usable helmet. I suppose he's now somewhere outside the Moon, along with the basic charred components of my ship. The other three spacecraft that I took with me activated as I plugged in the source code for their control. They tailed after me.\n\n  The detonation of my main ship could be seen from Earth, I daresay. After all, I'm heading there now. Houston was of no issue; only commands were, and I learned all the code I needed within half a year. Houston will only think what I let them; the other spacecraft are for diagnostics purposes and definitely not filled with as much fuel as possible.\n\nNot that there would be a Houston to speak of within 48 hours. Those ships will go first; I'll say I lost control of them.\n\nI am coming back from my destiny. For what, I do not know. Matt Damon might; maybe I'll pay him a legitimately friendly visit. \n\nAfter I take Wakhabstan from Musk. His own creation will be his own undoing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I passed all the tests. I was suspicious at first; I suppose that comes with being the dictator of Wakhabstan. I never wanted to be a dictator; but my father told me to strike down all enemies and keep the people as they were in his time. I was named in the honor of the Moon; and so I followed my namesake. My destiny was the Moon, not this country. I wanted to see my country for what it was on Earth: dirt. Dirt that I ruled upon. That everyone ruled. Wars, bloodshed, money; all over dirt and water. Mud. The astronauts that accompanied me on my journey loved the sight, as did I.&lt;/p&gt;\n\n&lt;p&gt;Earth was beautiful.&lt;/p&gt;\n\n&lt;p&gt;But the dwellers never were.&lt;/p&gt;\n\n&lt;p&gt;And so began my plot to end them. It took years. My movements weren&amp;#39;t tracked; everyone thought I would die within an hour of my landing. They gave me a spiked can; it had the same amount of nitrogen, but less oxygen and more argon. At least they weren&amp;#39;t cheap while trying to end me.&lt;/p&gt;\n\n&lt;p&gt;Their first mistake was giving me the brief opportunity to take extra oxygen cans with me. After the first one was depleted, I replaced it while holding my breath; the system automatically sealed the suit until I plugged the fresh can into the port. They&amp;#39;ll find their mistake when &lt;em&gt;The Dolphin&lt;/em&gt; comes back to Earth. Here&amp;#39;s to hoping they won&amp;#39;t care enough to actually kill me.&lt;/p&gt;\n\n&lt;p&gt;I walked for days. I used my navigation computer to guide me. I held in my breath as long as I could; if I were to survive, then I would live here. Simple as that.&lt;/p&gt;\n\n&lt;p&gt;On the fourth day, I arrived at the base. My clock said it was four days after we landed, which was a Friday; Tuesday was when I arrived). It was stark white, the paint had faded from hours of unfiltered sunlight, and it was all abandoned.&lt;/p&gt;\n\n&lt;p&gt;Their second mistake was leaving the door unlocked and the fridge stocked. There were decades of Level-1A food; feasts for decades. Three meals a day could keep me here for twenty years; the desserts added another five. And there was a garden, to see if vegetables and fruit became more nutritious if bound by the Moon&amp;#39;s weaker gravitational pull. I grew some rather easily. They were much larger than regular tomatoes and apples and potatoes, but the equipment said they were less dense and yet had more vitamins and minerals. This could mean that my supply of food was guaranteed until the day I died.&lt;/p&gt;\n\n&lt;p&gt;My situation became like Matt Damon&amp;#39;s; except there was no hope of rescue, I was careful with airlocks, and I knew the Moon&amp;#39;s topography inside out.&lt;/p&gt;\n\n&lt;p&gt;Their third mistake was leaving spacecraft behind, silos with fuel, and everything else anyone would need to get off this barren rock.&lt;/p&gt;\n\n&lt;p&gt;It took me a year, but I configured three spacecraft to follow special directions via coding and taking apart certain devices and machines to steer the spacecraft to where I needed them. I needed basic instructions for them to follow. To take off when I do; keep at least a kilometer away; and to eject certain modules when needed.&lt;/p&gt;\n\n&lt;p&gt;Over two years, I explored the moon base. Total vacancy, barring my stay. Complete silence. The base was shaped like a clock. I located the fuel silos; they were kept far away from the spacecraft and yet all around the base. The food and water storages were everywhere; in the case of a meteor, I suppose. The spacecraft were in the middle of it all.&lt;/p&gt;\n\n&lt;p&gt;I began to devise my plan of escaping. First, I would set the fuel silos to explode all around the base. I would then launch four spacecraft, me in one of them; but I readied a specific timer. Just enough time to seem like the spacecraft were jettisoned like debris from the destruction of the base. The central hangar had some silos in it and many fuel lines to the peripheral silos. This would be more convincing if they ever showed up to investigate trillions of dollars worth of damage. To make it seem like I accidentally ignited the fuel while loading it from the peripheral silo and the explosion spread throughout the base.&lt;/p&gt;\n\n&lt;p&gt;It all went according to plan. The charges were set, they exploded; the fuel ignited and was far more explosive than I thought. I launched faster than needed, but it was worth it. The explosion gave me an unexpected boost that compressed me into the chair. My main ship&amp;#39;s internal gravity simulator started up as it started to orbit the Moon. I was there for a year, training my body to overcome the lax gravity of my namesake, fighting for my strength. The other spacecraft orbited alongside mine; no fuel was used up, and I had all the food I could take with me. &lt;/p&gt;\n\n&lt;p&gt;My ship detected another spacecraft coming towards my little fleet. I knew they would come; and they did. Perhaps to find the cause of the explosion and to recover what they could. They stepped inside my ship after stopping theirs enough to board mine. I wonder if they were surprised to feel the atmospheric conditions. I slipped into their ship when the workers and scientists weren&amp;#39;t looking. I took a hammer with me; the pilot now had no usable helmet. I suppose he&amp;#39;s now somewhere outside the Moon, along with the basic charred components of my ship. The other three spacecraft that I took with me activated as I plugged in the source code for their control. They tailed after me.&lt;/p&gt;\n\n&lt;p&gt;The detonation of my main ship could be seen from Earth, I daresay. After all, I&amp;#39;m heading there now. Houston was of no issue; only commands were, and I learned all the code I needed within half a year. Houston will only think what I let them; the other spacecraft are for diagnostics purposes and definitely not filled with as much fuel as possible.&lt;/p&gt;\n\n&lt;p&gt;Not that there would be a Houston to speak of within 48 hours. Those ships will go first; I&amp;#39;ll say I lost control of them.&lt;/p&gt;\n\n&lt;p&gt;I am coming back from my destiny. For what, I do not know. Matt Damon might; maybe I&amp;#39;ll pay him a legitimately friendly visit. &lt;/p&gt;\n\n&lt;p&gt;After I take Wakhabstan from Musk. His own creation will be his own undoing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgb42tt", "score_hidden": false, "stickied": false, "created": 1492316091.0, "created_utc": 1492287291.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}]