[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WritingPrompts", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Writing Prompt", "id": "65owa5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 178, "report_reasons": null, "author": "jcjono1998", "saved": false, "mod_reports": [], "name": "t3_65owa5", "subreddit_name_prefixed": "r/WritingPrompts", "approved_by": null, "over_18": false, "domain": "self.WritingPrompts", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s3nb", "edited": false, "link_flair_css_class": "flairwp", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WritingPrompts/comments/65owa5/wp_the_villain_gives_their_customary_join_me_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492374912.0, "url": "https://www.reddit.com/r/WritingPrompts/comments/65owa5/wp_the_villain_gives_their_customary_join_me_and/", "author_flair_text": null, "quarantine": false, "title": "[WP] The villain gives their customary \"join me and we can be great\" speech. The hero accepts.", "created_utc": 1492346112.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 178}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65owa5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbzdig", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WritingPromptsRobot", "parent_id": "t3_65owa5", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\n**Off-Topic Discussion**: All top-level comments must be a story or poem. Reply here for other comments.\n\n#####Reminder for Writers and Readers:\n* Prompts are meant to inspire new writing.  Responses don't have to fulfill every detail.\n\n* Please remember to [be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback.\n\n---\n\n[](#icon-help)[^(What Is This?)](https://www.reddit.com/r/WritingPrompts/wiki/off_topic) [](#icon-information)[^(First Time Here?)](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) [](#icon-exclamation)[^(Special Announcements)](https://www.reddit.com/r/WritingPrompts/wiki/announcements) [](#icon-comments)[^(Click For Our Chatroom)](https://www.reddit.com/r/WritingPrompts/wiki/chat)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Off-Topic Discussion&lt;/strong&gt;: All top-level comments must be a story or poem. Reply here for other comments.&lt;/p&gt;\n\n&lt;h5&gt;Reminder for Writers and Readers:&lt;/h5&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Prompts are meant to inspire new writing.  Responses don&amp;#39;t have to fulfill every detail.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Please remember to &lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil\"&gt;be civil&lt;/a&gt; in any feedback.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"#icon-help\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/off_topic\"&gt;&lt;sup&gt;What Is This?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-information\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/user_guide\"&gt;&lt;sup&gt;First Time Here?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-exclamation\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/announcements\"&gt;&lt;sup&gt;Special Announcements&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-comments\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/chat\"&gt;&lt;sup&gt;Click For Our Chatroom&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgbzdig", "score_hidden": true, "stickied": true, "created": 1492374945.0, "created_utc": 1492346145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65owa5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65owa5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65owa5", "likes": null, "replies": "", "user_reports": [], "id": "dgda4x3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Arkaisius", "parent_id": "t1_dgda09x", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgda4x3", "score_hidden": false, "stickied": false, "created": 1492446572.0, "created_utc": 1492417772.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgda09x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "homesapien", "parent_id": "t1_dgc591s", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Really good one! I like it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really good one! I like it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgda09x", "score_hidden": false, "stickied": false, "created": 1492446140.0, "created_utc": 1492417340.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc591s", "gilded": 0, "archived": false, "score": 63, "report_reasons": null, "author": "Arkaisius", "parent_id": "t3_65owa5", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\"Why can't you understand? I am only trying to make the world a better place! A world without petty conflict, a world without war, a world under one banner! In that world humanity could achieve wonders beyond our wildest imagination. And the only person in the way of that world is you my old friend, Captain Mercurias. If only you could see the truth of my words, feel the sincerity in my heart, you'd know that I only want what's best for the world. I love humanity, but doing what is necessary is not always what is right. I am willing to give up my humanity, my morality, so that others of this world do not have to. That the rest of this world can live the life I always dreamed of, one of righteousness and tranquility. Please, set aside your blade, and join me. Together, you could help me make this world far greater than I could alone.\" \n\n\n\"You know what Justinian, you got yourself a deal.\" \n\n\n\"I-I do?\" \n\n\n\"Yeah. I believe you.\" \n\n\n\"Really? I mean, thank you of course, but, why now after all these years?\" \n\n\n\"I think it's just time for a change up you now. I've been stagnating, and it looks like you've got some very lucrative prospects for the future. I'd like to be a part of that. Does your offer still stand?\" \n\n\n\"Yes! A million times yes! I don't even know where to begin! Why not now, today! Ha Ha! Yes! Let's go! There is a nuclear arsenal that needs stealing. Or, or maybe a world leader that needs assassinating. No wait! A politician that needs buying! The world is our oyster Mercurias!\" \n\n\n\"Woah woah woah. Slow down there ol' Justy. You mind if I call you Justy now? Before we go poppin any oysters, there are so many details that need to be covered.\" \n\n\n\"Oh uh, of course, what were you thinking Captain?\" \n\n\n\"Oh man well where to begin? Dental is definitely non-negotiable. I mean do you see these pearly whites? That's half the superhero game right there my friend. And my 401k could definitely use some bolstering. Don't even get me started on medical! You know what insurance costs for a guy who fights villains for a living! It's a lot of missed vacays in Vegas that's for sure.\" \n\n\n\"Wait. Is this, like, contractual? What we're teaming up to do? I thought it was more of a, uh, I don't know, informal partnership.\" \n\n\n\".... Hell yeah it's contractual man! What do you think I work for free? Who's going to pay the bills! The government allowance for superheros is dismal! My kids needs shoes man! You know how many shoes a Speedster goes through in a week! Little Danny's a Speedster now by the way, isn't that great! Just found out last week. We're so proud of him. Here want to see some pictures?\" \n\n\n\"No. I mean, yeah that's great for your kid, but, no! I thought we were in this to change the world man!\" \n\n\n\"Change the world? Justy, in all the years I've been Superheroing round these parts the most I've managed to change is my kids diaper! Now unless you're willing to give me a solid offer I'm going to have to stick to my guns here.\" \n\n\n\"Ok ok. It's just, I wasn't completely prepared to give you a contract and all.\" \n\n\n\"What!? You're the one offering me the job and you don't have your shit together. You know what, forget it, government may be a pittance but at least their reliable.\"\n\n\n\"Wait! I'll have my people contact your people we can figure this out M. My man! No worries!\" \n\n\n\"M? My man? It's Captain Mercurias to you ya jackanape! I shoulda listened to Carol. It's too late to make a career change now. I should just stick to what I know. And that's kicking villainous butt! Blade of Mercury, to me!\" \n\n\n\"No, please not the Blade? Can't you just go fists again?\" \n\n\n\"Shoulda thought about that before taking away my dreams of full medical!\" \n\n\n*Heroic slicing and dicing ensues. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Why can&amp;#39;t you understand? I am only trying to make the world a better place! A world without petty conflict, a world without war, a world under one banner! In that world humanity could achieve wonders beyond our wildest imagination. And the only person in the way of that world is you my old friend, Captain Mercurias. If only you could see the truth of my words, feel the sincerity in my heart, you&amp;#39;d know that I only want what&amp;#39;s best for the world. I love humanity, but doing what is necessary is not always what is right. I am willing to give up my humanity, my morality, so that others of this world do not have to. That the rest of this world can live the life I always dreamed of, one of righteousness and tranquility. Please, set aside your blade, and join me. Together, you could help me make this world far greater than I could alone.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You know what Justinian, you got yourself a deal.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I-I do?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah. I believe you.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Really? I mean, thank you of course, but, why now after all these years?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I think it&amp;#39;s just time for a change up you now. I&amp;#39;ve been stagnating, and it looks like you&amp;#39;ve got some very lucrative prospects for the future. I&amp;#39;d like to be a part of that. Does your offer still stand?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes! A million times yes! I don&amp;#39;t even know where to begin! Why not now, today! Ha Ha! Yes! Let&amp;#39;s go! There is a nuclear arsenal that needs stealing. Or, or maybe a world leader that needs assassinating. No wait! A politician that needs buying! The world is our oyster Mercurias!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Woah woah woah. Slow down there ol&amp;#39; Justy. You mind if I call you Justy now? Before we go poppin any oysters, there are so many details that need to be covered.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh uh, of course, what were you thinking Captain?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh man well where to begin? Dental is definitely non-negotiable. I mean do you see these pearly whites? That&amp;#39;s half the superhero game right there my friend. And my 401k could definitely use some bolstering. Don&amp;#39;t even get me started on medical! You know what insurance costs for a guy who fights villains for a living! It&amp;#39;s a lot of missed vacays in Vegas that&amp;#39;s for sure.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Wait. Is this, like, contractual? What we&amp;#39;re teaming up to do? I thought it was more of a, uh, I don&amp;#39;t know, informal partnership.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;.... Hell yeah it&amp;#39;s contractual man! What do you think I work for free? Who&amp;#39;s going to pay the bills! The government allowance for superheros is dismal! My kids needs shoes man! You know how many shoes a Speedster goes through in a week! Little Danny&amp;#39;s a Speedster now by the way, isn&amp;#39;t that great! Just found out last week. We&amp;#39;re so proud of him. Here want to see some pictures?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No. I mean, yeah that&amp;#39;s great for your kid, but, no! I thought we were in this to change the world man!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Change the world? Justy, in all the years I&amp;#39;ve been Superheroing round these parts the most I&amp;#39;ve managed to change is my kids diaper! Now unless you&amp;#39;re willing to give me a solid offer I&amp;#39;m going to have to stick to my guns here.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ok ok. It&amp;#39;s just, I wasn&amp;#39;t completely prepared to give you a contract and all.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What!? You&amp;#39;re the one offering me the job and you don&amp;#39;t have your shit together. You know what, forget it, government may be a pittance but at least their reliable.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Wait! I&amp;#39;ll have my people contact your people we can figure this out M. My man! No worries!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;M? My man? It&amp;#39;s Captain Mercurias to you ya jackanape! I shoulda listened to Carol. It&amp;#39;s too late to make a career change now. I should just stick to what I know. And that&amp;#39;s kicking villainous butt! Blade of Mercury, to me!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No, please not the Blade? Can&amp;#39;t you just go fists again?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Shoulda thought about that before taking away my dreams of full medical!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;*Heroic slicing and dicing ensues. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgc591s", "score_hidden": false, "stickied": false, "created": 1492385112.0, "created_utc": 1492356312.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 63}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65owa5", "likes": null, "replies": "", "user_reports": [], "id": "dgcf04u", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Dinadan_The_Humorist", "parent_id": "t3_65owa5", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\"Ah, Dan,\" Gyges says sadly, shaking his head. \"I hate fighting you like this. After all we went through together... it's a shame, you know?\"\n\nThe wind rushes over the rooftop where the two men stand, the full moon washing their battlefield with pale light. Captain Adonis stands as straight and tall as ever, though there's a faint shadow along his normally clean-shaven jaw. He doesn't answer.\n\n\"It doesn't have to be like this,\" Gyges continues. \"We could work together. Restructure the city, the way we want it. No more corruption, no more incompetence. Nothing could stop us.\"\n\nThis gets a reaction. \"What are you talking about, Kevin? Look at you -- I just caught you robbing a bank. Is that your new structure? Come on, man.\"\n\nGyges leans in earnestly. \"Yeah, I stole a little money. This work's expensive -- what do they pay you? How does Diana feel about this superhero gig?\"\n\nCaptain Adonis lowers his gaze momentarily. \"Money's tight,\" he admits. \"But we didn't grow up rich, we can make do.\"\n\n\"I'm not talking about riches,\" Gyges says. \"But my wife and I bought a new car last month, nice little Honda. I'll show it to you next time I come over. You and Diana ever bought a new car?\"\n\nCaptain Adonis is silent. Gyges presses his advantage. \"How would you like to take a vacation for once? You could do that, you know -- I'd have your back. Take your family somewhere nice for a few weeks. Or imagine being able to set aside a little money every month for Jackson's college fund. Would that be so bad?\"\n\n\"I... I have been wondering,\" Captain Adonis admits haltingly. \"I mean... a government salary's a little low to send Jack to a good school... he's a bright kid, deserves better.\"\n\nGyges takes a step forward, smiling warmly. \"I can make that happen, Dan,\" he says. \"Whatever you need. Just give the word.\"\n\nCaptain Adonis pauses. Gyges can read the uncertainty in his eyes, but it suddenly clears. \"All right,\" he says firmly.\n\nGyges grins and throws a friendly arm around Captain Adonis' shoulder. \"Welcome to the team, Dan! The two of us together, we're going to be unstoppable. Just like the old days.\"\n\nCaptain Adonis nods. \"I gotta admit, it will be nice to finally be on the same side,\" he says. \"Being a -- a villain will take some getting used to, but --\"\n\nSuddenly Captain Adonis stops, a pained expression on his face. Gyges shakes his head. \"Aw, Dan. You're not going to be a villain. You just don't have it in you,\" he says sadly.\n\nCaptain Adonis sinks to his knees. His mouth forms words, but no sound comes out. Gyges yanks the knife free from Captain Adonis' side and turns away.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Ah, Dan,&amp;quot; Gyges says sadly, shaking his head. &amp;quot;I hate fighting you like this. After all we went through together... it&amp;#39;s a shame, you know?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The wind rushes over the rooftop where the two men stand, the full moon washing their battlefield with pale light. Captain Adonis stands as straight and tall as ever, though there&amp;#39;s a faint shadow along his normally clean-shaven jaw. He doesn&amp;#39;t answer.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It doesn&amp;#39;t have to be like this,&amp;quot; Gyges continues. &amp;quot;We could work together. Restructure the city, the way we want it. No more corruption, no more incompetence. Nothing could stop us.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This gets a reaction. &amp;quot;What are you talking about, Kevin? Look at you -- I just caught you robbing a bank. Is that your new structure? Come on, man.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Gyges leans in earnestly. &amp;quot;Yeah, I stole a little money. This work&amp;#39;s expensive -- what do they pay you? How does Diana feel about this superhero gig?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Captain Adonis lowers his gaze momentarily. &amp;quot;Money&amp;#39;s tight,&amp;quot; he admits. &amp;quot;But we didn&amp;#39;t grow up rich, we can make do.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m not talking about riches,&amp;quot; Gyges says. &amp;quot;But my wife and I bought a new car last month, nice little Honda. I&amp;#39;ll show it to you next time I come over. You and Diana ever bought a new car?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Captain Adonis is silent. Gyges presses his advantage. &amp;quot;How would you like to take a vacation for once? You could do that, you know -- I&amp;#39;d have your back. Take your family somewhere nice for a few weeks. Or imagine being able to set aside a little money every month for Jackson&amp;#39;s college fund. Would that be so bad?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I... I have been wondering,&amp;quot; Captain Adonis admits haltingly. &amp;quot;I mean... a government salary&amp;#39;s a little low to send Jack to a good school... he&amp;#39;s a bright kid, deserves better.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Gyges takes a step forward, smiling warmly. &amp;quot;I can make that happen, Dan,&amp;quot; he says. &amp;quot;Whatever you need. Just give the word.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Captain Adonis pauses. Gyges can read the uncertainty in his eyes, but it suddenly clears. &amp;quot;All right,&amp;quot; he says firmly.&lt;/p&gt;\n\n&lt;p&gt;Gyges grins and throws a friendly arm around Captain Adonis&amp;#39; shoulder. &amp;quot;Welcome to the team, Dan! The two of us together, we&amp;#39;re going to be unstoppable. Just like the old days.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Captain Adonis nods. &amp;quot;I gotta admit, it will be nice to finally be on the same side,&amp;quot; he says. &amp;quot;Being a -- a villain will take some getting used to, but --&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Suddenly Captain Adonis stops, a pained expression on his face. Gyges shakes his head. &amp;quot;Aw, Dan. You&amp;#39;re not going to be a villain. You just don&amp;#39;t have it in you,&amp;quot; he says sadly.&lt;/p&gt;\n\n&lt;p&gt;Captain Adonis sinks to his knees. His mouth forms words, but no sound comes out. Gyges yanks the knife free from Captain Adonis&amp;#39; side and turns away.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgcf04u", "score_hidden": false, "stickied": false, "created": 1492398105.0, "created_utc": 1492369305.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65owa5", "likes": null, "replies": "", "user_reports": [], "id": "dgc78r0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "rmamack", "parent_id": "t3_65owa5", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "*Same story line as some of my previous posts\n\n\"Ok Necromancer, suppose I actually believe you, suppose I've actually seen, first hand, just how closed minded the forced alignment policy is. Even more generously, let's just pretend I actually agree with you on the risks being far outstripped by the rewards. Really, do you even have a plan after you somehow end up in charge?\"\n\nThe girl before me had a point, most supervillains, even those who actually did want to do good at first, fell to the corruption that their powers brought eventually. If there's anything I'm greatful for when it comes to being Unwhole, it's the extreme self knowledge and control not being confined to a human brain brings. \n\n\"I've actually worked around that issue, partially because of my condition, and partially by how I aim to achieve my goals. I seek to influence the world, to guide all of it, to the brightest possible future. What I don't seek to do, is fully control it. This is why I work from the shadows: tyranny, like a tree, requires​ the light to fully flourish. As the old saying goes, absolute power corrupts absolutely. I don't ask to  your help in staging a takeover, rather your influence to guide a few well meaning but misguided people in power. I ask again, before I'm forced to wipe your memory and abandon this base of mine, will you not join me? If anything else, do it for Mister Cuddles, he's an old Yorkie and moving stresses him out terribly.\"\n\nShe wasn't expecting my answer, and admittedly she got me on a technicality with her response.\n\n\"Ok, you love your puppy, but what about after the world domination? What then, how do I know you don't become the next Hitler?\"\n\nI nodded, and then replied, this time more explicit in my answer. \"I don't seek to dominate, merely guide. That question has no meaning in my plan, because that eventuality doesn't happen. If it does, I don't let it last, I declare a world congress to do the governing and abdicate the throne. Does that satisfy you?\"\n\nHer eyes were wide open at this point. Then she closed them, nodding with understanding.\n\n\"You're the only one I've ever said this to. I'm in, how can Righteous Rager help you.\"\n\nI lowered her from my arcane grip, making sure she could stand when I fully released her. I smiled, and produced two glasses and a bottle from under my desk.\n\n\"Well, you can tell me if you like bourbon to start.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;*Same story line as some of my previous posts&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ok Necromancer, suppose I actually believe you, suppose I&amp;#39;ve actually seen, first hand, just how closed minded the forced alignment policy is. Even more generously, let&amp;#39;s just pretend I actually agree with you on the risks being far outstripped by the rewards. Really, do you even have a plan after you somehow end up in charge?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The girl before me had a point, most supervillains, even those who actually did want to do good at first, fell to the corruption that their powers brought eventually. If there&amp;#39;s anything I&amp;#39;m greatful for when it comes to being Unwhole, it&amp;#39;s the extreme self knowledge and control not being confined to a human brain brings. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ve actually worked around that issue, partially because of my condition, and partially by how I aim to achieve my goals. I seek to influence the world, to guide all of it, to the brightest possible future. What I don&amp;#39;t seek to do, is fully control it. This is why I work from the shadows: tyranny, like a tree, requires​ the light to fully flourish. As the old saying goes, absolute power corrupts absolutely. I don&amp;#39;t ask to  your help in staging a takeover, rather your influence to guide a few well meaning but misguided people in power. I ask again, before I&amp;#39;m forced to wipe your memory and abandon this base of mine, will you not join me? If anything else, do it for Mister Cuddles, he&amp;#39;s an old Yorkie and moving stresses him out terribly.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She wasn&amp;#39;t expecting my answer, and admittedly she got me on a technicality with her response.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ok, you love your puppy, but what about after the world domination? What then, how do I know you don&amp;#39;t become the next Hitler?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I nodded, and then replied, this time more explicit in my answer. &amp;quot;I don&amp;#39;t seek to dominate, merely guide. That question has no meaning in my plan, because that eventuality doesn&amp;#39;t happen. If it does, I don&amp;#39;t let it last, I declare a world congress to do the governing and abdicate the throne. Does that satisfy you?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Her eyes were wide open at this point. Then she closed them, nodding with understanding.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re the only one I&amp;#39;ve ever said this to. I&amp;#39;m in, how can Righteous Rager help you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I lowered her from my arcane grip, making sure she could stand when I fully released her. I smiled, and produced two glasses and a bottle from under my desk.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well, you can tell me if you like bourbon to start.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgc78r0", "score_hidden": false, "stickied": false, "created": 1492387830.0, "created_utc": 1492359030.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65owa5", "likes": null, "replies": "", "user_reports": [], "id": "dgc5b50", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "diekarrotte", "parent_id": "t3_65owa5", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\"You know what?\" Fleming mused, contemplatively wriggling against the ropes tying him to the rocket, \"I think I see your point this time.\"\n\nMy eyes must have bugged right out of my head in an effort to keep my jaw from hitting the floor. \"You...what?\" I stammered.\n\n\"I think I really get where you're coming from this time,\" Fleming said, a little quicker this time. \"I mean, you've really got a great mission statement for this plot - gain global recognition and respect by overthrowing the Big Tampon companies and launching a new, cheaper alternative when you become the only option on the market. I mean, still super crazy, but this one makes sense...a bit.\"\n\n\"A bit!\" I thundered. \"It makes perfect sense! Once I've infiltrated the competitive bathroom product market, I will take over the toilet paper segment, the household cleaners, launch my own housewares collection, the world is my limit! And once I've taken over all those segments, no one will be able to buy any products other than my own...and then I jack up the prices and I'll be RICH!\" I grinned then rolled my eyes. \"And then I can properly fund all of my other exploits, like colonizing Mars and taking over the government.\"\n\n\"Yeah, I'm actually impressed with the fact you're not trying to plan ridiculous heists this time,\" Fleming laughed. \"Remember that stupid Fort Knox one? Come on, you're smarter than that!\" He smiled at me, and not his normal, plotting, 'I'm about to escape' smile. An actual smile. \n\n\"Stop that!\" my brow furrowed. \"I don't like it when you agree with me! It's weird.\"\n\n\"Oh yeah,\" he looked pointedly at me. \"Well then you're really not going to like this: I'm in.\"\n\nI was confused. \"In peril? Yes, you are.\"\n\nHe shook his head and laughed. \"No, no, no, I'm interested in this scheme. I want to change sides and be part of this! I'm sick and tired of the mediocre pay for high-risk shenanigans, and this seems like a good time to get into a younger man's game. I've always wanted to work in accounting...\" he trailed off, as if imagining a world where he sat at a desk and didn't blow things up. \n\nI walked up to him. \"You, you want to join me? Not fight me?\" I pointed my finger at him. \"Are you serious?\"\n\n\"100% percent,\" he replied. There was that annoying smile again! \"Untie me, and we can rule the world together.\" He wriggled a bit.\n\nI turned and walked back to the console. I trailed my fingers lightly across the buttons, thinking. \"Yeah,\" I looked up at him. \"I don't think so.\" And I pressed the button I had never touched before.\n\nThe rocket started to whine, revving up. Fleming looks wildly around, confused. \"But I said I wanted to join you!\" He yelled. \n\n\"And that's where I lost interest,\" i replied, stepping into the bunker. I continued over the speaker system. \"You've been a formidable foe over the years, Fleming. I've continuously let you 'escape' because I've enjoyed our clashes. But now you want to join me? There's only room for one criminal mastermind, and that's me.\" I sighed. \"You've obviously lost your edge, so it's time to really kill you and hope your replacement is better.\"\n\nI could see Fleming's mouth moving desperately, the panic in his eyes, and then \"boom!\" The rocket took off, taking my once-impressive arch nemesis with it.\n\n\"Farewell my old foe,\" I said sadly as I gazed at the rocket trail. \"It's been a pleasure wreaking havoc against you.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;You know what?&amp;quot; Fleming mused, contemplatively wriggling against the ropes tying him to the rocket, &amp;quot;I think I see your point this time.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My eyes must have bugged right out of my head in an effort to keep my jaw from hitting the floor. &amp;quot;You...what?&amp;quot; I stammered.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I think I really get where you&amp;#39;re coming from this time,&amp;quot; Fleming said, a little quicker this time. &amp;quot;I mean, you&amp;#39;ve really got a great mission statement for this plot - gain global recognition and respect by overthrowing the Big Tampon companies and launching a new, cheaper alternative when you become the only option on the market. I mean, still super crazy, but this one makes sense...a bit.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;A bit!&amp;quot; I thundered. &amp;quot;It makes perfect sense! Once I&amp;#39;ve infiltrated the competitive bathroom product market, I will take over the toilet paper segment, the household cleaners, launch my own housewares collection, the world is my limit! And once I&amp;#39;ve taken over all those segments, no one will be able to buy any products other than my own...and then I jack up the prices and I&amp;#39;ll be RICH!&amp;quot; I grinned then rolled my eyes. &amp;quot;And then I can properly fund all of my other exploits, like colonizing Mars and taking over the government.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah, I&amp;#39;m actually impressed with the fact you&amp;#39;re not trying to plan ridiculous heists this time,&amp;quot; Fleming laughed. &amp;quot;Remember that stupid Fort Knox one? Come on, you&amp;#39;re smarter than that!&amp;quot; He smiled at me, and not his normal, plotting, &amp;#39;I&amp;#39;m about to escape&amp;#39; smile. An actual smile. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Stop that!&amp;quot; my brow furrowed. &amp;quot;I don&amp;#39;t like it when you agree with me! It&amp;#39;s weird.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh yeah,&amp;quot; he looked pointedly at me. &amp;quot;Well then you&amp;#39;re really not going to like this: I&amp;#39;m in.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I was confused. &amp;quot;In peril? Yes, you are.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He shook his head and laughed. &amp;quot;No, no, no, I&amp;#39;m interested in this scheme. I want to change sides and be part of this! I&amp;#39;m sick and tired of the mediocre pay for high-risk shenanigans, and this seems like a good time to get into a younger man&amp;#39;s game. I&amp;#39;ve always wanted to work in accounting...&amp;quot; he trailed off, as if imagining a world where he sat at a desk and didn&amp;#39;t blow things up. &lt;/p&gt;\n\n&lt;p&gt;I walked up to him. &amp;quot;You, you want to join me? Not fight me?&amp;quot; I pointed my finger at him. &amp;quot;Are you serious?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;100% percent,&amp;quot; he replied. There was that annoying smile again! &amp;quot;Untie me, and we can rule the world together.&amp;quot; He wriggled a bit.&lt;/p&gt;\n\n&lt;p&gt;I turned and walked back to the console. I trailed my fingers lightly across the buttons, thinking. &amp;quot;Yeah,&amp;quot; I looked up at him. &amp;quot;I don&amp;#39;t think so.&amp;quot; And I pressed the button I had never touched before.&lt;/p&gt;\n\n&lt;p&gt;The rocket started to whine, revving up. Fleming looks wildly around, confused. &amp;quot;But I said I wanted to join you!&amp;quot; He yelled. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And that&amp;#39;s where I lost interest,&amp;quot; i replied, stepping into the bunker. I continued over the speaker system. &amp;quot;You&amp;#39;ve been a formidable foe over the years, Fleming. I&amp;#39;ve continuously let you &amp;#39;escape&amp;#39; because I&amp;#39;ve enjoyed our clashes. But now you want to join me? There&amp;#39;s only room for one criminal mastermind, and that&amp;#39;s me.&amp;quot; I sighed. &amp;quot;You&amp;#39;ve obviously lost your edge, so it&amp;#39;s time to really kill you and hope your replacement is better.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I could see Fleming&amp;#39;s mouth moving desperately, the panic in his eyes, and then &amp;quot;boom!&amp;quot; The rocket took off, taking my once-impressive arch nemesis with it.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Farewell my old foe,&amp;quot; I said sadly as I gazed at the rocket trail. &amp;quot;It&amp;#39;s been a pleasure wreaking havoc against you.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgc5b50", "score_hidden": false, "stickied": false, "created": 1492385193.0, "created_utc": 1492356393.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65owa5", "likes": null, "replies": "", "user_reports": [], "id": "dgczy9p", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Kagemoto", "parent_id": "t3_65owa5", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\"Are you serious?\" Stutters Emperor Cardinal taking a step back.\n\nStargirl sighs and gives him a glare with crossed arms, \"Yes I am. Now where do we start?\"\n\nThe Emperor coughs and nods, \"Ah yes, we start with your benefits. You get free medical stuff and leaves for really important events. You have to do some paper work of course but thats how it goes.\"\n\nStargirl raises an eyebrow, \"Paperwork?\"\n\nThe Emperor shrugs, \"That's why villains can't attack everyday, they have to fill forms for various things. It's to keep a system going.\"\n\nHe scratches the back of his head, \"I'm guessing you don't have any of that?\"\n\nStargirl shakes her head and sighs, \"Maybe I should reconsider.\"\n\nEmperor waves his hands in front of him, \"No! No! I can do your paperwork for you!\"\n\nStargirl tilts her head and gives him a smile, \"What do I do then?\"\n\nEmperor's faces goes red, \"Well you can um- I -uh.\"\n\nStargirl giggles and gives Emperor a hug, relishing his reddening face and stuttering demeanor.\n\n\"I'm looking forward to working with you, partner.\" She whispers in his ear.\n\nThis was too much for The Emperor and he fainted.\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Are you serious?&amp;quot; Stutters Emperor Cardinal taking a step back.&lt;/p&gt;\n\n&lt;p&gt;Stargirl sighs and gives him a glare with crossed arms, &amp;quot;Yes I am. Now where do we start?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The Emperor coughs and nods, &amp;quot;Ah yes, we start with your benefits. You get free medical stuff and leaves for really important events. You have to do some paper work of course but thats how it goes.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Stargirl raises an eyebrow, &amp;quot;Paperwork?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The Emperor shrugs, &amp;quot;That&amp;#39;s why villains can&amp;#39;t attack everyday, they have to fill forms for various things. It&amp;#39;s to keep a system going.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He scratches the back of his head, &amp;quot;I&amp;#39;m guessing you don&amp;#39;t have any of that?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Stargirl shakes her head and sighs, &amp;quot;Maybe I should reconsider.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Emperor waves his hands in front of him, &amp;quot;No! No! I can do your paperwork for you!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Stargirl tilts her head and gives him a smile, &amp;quot;What do I do then?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Emperor&amp;#39;s faces goes red, &amp;quot;Well you can um- I -uh.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Stargirl giggles and gives Emperor a hug, relishing his reddening face and stuttering demeanor.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m looking forward to working with you, partner.&amp;quot; She whispers in his ear.&lt;/p&gt;\n\n&lt;p&gt;This was too much for The Emperor and he fainted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgczy9p", "score_hidden": false, "stickied": false, "created": 1492426085.0, "created_utc": 1492397285.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65owa5", "likes": null, "replies": "", "user_reports": [], "id": "dgcnwmb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RCIsNotACola", "parent_id": "t3_65owa5", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\"You see this right? I know you do. We are the two most powerful beings on the planet, why be eternally trapped in war together? If this continues, neither of us will thrive, neither of us will reach our goals. But you refuse to see that they don't exclude each other! You wish to save the Earth? That's what I want as well. But you never see! These humans you protect, they're destroying it! They wreck the very planet you wish to keep safe, I'm trying to help you! Come with me. Please. Our powers combined and there is no chance we won't succeed. Save the Earth, ignore the mayflies in the way. They don't matter! We can colonize this planet. Make it so that our race can expand, and this strange planet you've taken a liking to can survive. Humans are a plague. You need to see it! Parasites, leeching the resources and doing nothing but take and take and take. Join me. We can work together. Join me and together, we can be amazing!\"\n\n\"Okay? Sounds good.\" Calypsus nods. \n\n\"Wait what?\" Doctor Terra steps back.\n\n\"I said it sounds good. We want the same thing. Doesn't make sense to favor humans destroying Earth over my own kind. Not like they live long anyway. They hurt the planet so much it'll result in hurting everything on it. This is an act of mercy.\" He shrugs, walking forwards, \"What now?\"\n\nDoctor Terra eyes over, could he be joking? Tricking her? \"You're not kidding, right?\"\n\n\"No?... You're right. What do we do now?\"\n\n\"I hadn't planned ahead this far, assumed you'd say no and I'd kill you.\"\n\n\"Nah, ooh what about costumes? I was thinking like, you wear a bright blue-\"\n\n\"I'm not changing.\"\n\n\"Or that works as well. Why don't we get this done first though?\" He gestures towards the giant red button on Terra's desk.\n\n\"Yeah, that'd be easier.\" She leans over and pounds the button, \"What should we do with the bodies?\"\n\n\"They'd be fantastic mulch\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;You see this right? I know you do. We are the two most powerful beings on the planet, why be eternally trapped in war together? If this continues, neither of us will thrive, neither of us will reach our goals. But you refuse to see that they don&amp;#39;t exclude each other! You wish to save the Earth? That&amp;#39;s what I want as well. But you never see! These humans you protect, they&amp;#39;re destroying it! They wreck the very planet you wish to keep safe, I&amp;#39;m trying to help you! Come with me. Please. Our powers combined and there is no chance we won&amp;#39;t succeed. Save the Earth, ignore the mayflies in the way. They don&amp;#39;t matter! We can colonize this planet. Make it so that our race can expand, and this strange planet you&amp;#39;ve taken a liking to can survive. Humans are a plague. You need to see it! Parasites, leeching the resources and doing nothing but take and take and take. Join me. We can work together. Join me and together, we can be amazing!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Okay? Sounds good.&amp;quot; Calypsus nods. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Wait what?&amp;quot; Doctor Terra steps back.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I said it sounds good. We want the same thing. Doesn&amp;#39;t make sense to favor humans destroying Earth over my own kind. Not like they live long anyway. They hurt the planet so much it&amp;#39;ll result in hurting everything on it. This is an act of mercy.&amp;quot; He shrugs, walking forwards, &amp;quot;What now?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Doctor Terra eyes over, could he be joking? Tricking her? &amp;quot;You&amp;#39;re not kidding, right?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No?... You&amp;#39;re right. What do we do now?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I hadn&amp;#39;t planned ahead this far, assumed you&amp;#39;d say no and I&amp;#39;d kill you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Nah, ooh what about costumes? I was thinking like, you wear a bright blue-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m not changing.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Or that works as well. Why don&amp;#39;t we get this done first though?&amp;quot; He gestures towards the giant red button on Terra&amp;#39;s desk.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah, that&amp;#39;d be easier.&amp;quot; She leans over and pounds the button, &amp;quot;What should we do with the bodies?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;They&amp;#39;d be fantastic mulch&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgcnwmb", "score_hidden": false, "stickied": false, "created": 1492409723.0, "created_utc": 1492380923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65owa5", "likes": null, "replies": "", "user_reports": [], "id": "dgcpktr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Deradius", "parent_id": "t3_65owa5", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Emperor Palpatine pinched the bridge of his nose again, squinching his eyes shut as he heaved an exasperated sigh.\n\n\"Okay.  Tell me one more time what happened.\"\n\n\"Well, it's hard to remember.  It all happened sort of fast.  We were on the catwalk, and I was, you know, I was..  well, it was a lightsaber fight, and I'm -\"\n\nPalpatine spoke in unison with Vader, in a tired singsong, \"*very* good a lightsaber fights,\" then rolled his eyes.\n\n\"Um, right... well, I am.  So you know, I went and I lopped his hand off -\"\n\nPalpatine held up a hand in a 'stop' motion.  \"You lopped his hand off?\"\n\n\"Well, yeah,\" said Vader.  \"It was right there and I thought it would underline my point pretty well.  So I lopped off his hand, and it and the lightsaber go tumbling down this impossibly deep hole - they really need to watch how they build those cloud platforms.  Huge hole right where anyone can fall in.  It's a lawyers' field day.  Anyway, he's hanging off of this gantry whining and sniveling and it just kind of... uh..  came out.\"\n\n\"*What* came out, Anakin?\"\n\nVader muttered quickly, like a disclaimer at the end of a landspeeder commercial.  \"Joinmeandwe'llrulethegalaxytogetherasfatherandson.\"\n\n\"And what did he do then?\"\n\n\"He said okay.\"\n\n\"Okay?\"\n\n\"Yeah.  He was like, sniveling a little, and then he was like, 'Okay'.  I really didn't expect him to agree...  It just sounded like a good thing to say, you know, to like..  make him feel like I cared or something.\"\n\nPalpatine groaned.  \"Like you *cared*?\"\n\n\"Yeah,\" said Vader. \"I felt bad for the guy.  You didn't see this lightsaber fight.  He came in expecting to win and got totally trashed because I'm -\"\n\nIn unison again, \"*very* good at lightsaber fights.\"  Another groan from Palpatine.\n\n\"So now what?\" Vader asked.\n\n\"What do you mean, now what?\"  Palpatine shot back.  \"There's only two Sith.  Those are the rules.  There can't be three Sith.\"\n\n\"Where does it say that?\" asked Vader.  \"We could have three Sith.\"\n\n\"It's in the handbook,\" said Palpatine.\n\n\"Well, let's change the handbook,\" said Vader.  \"What do we need to change the handbook?\"\n\n\"A vote.  I vote no change.\"\n\n\"I vote we change it to three Sith,\" said Vader.\n\n\"Split decision,\" replied Palpatine.  \"In a split decision, nothing changes.  Exar Kun and his apprentice tried to change that a while back, but they ended up in a split decision so it didn't change.\"\n\nVader put his hand to his face mask.  \"This is going to be so awkward.  I'm going to have to go out there and tell him he can't be a sith.  What do we do?\"\n\nPalpatine shrugged.  \"Bring him in here and we'll just all agree to tell the story like he never agreed to anything, and then we'll fight, and we can put this whole thing behind us.\"\n\n\"Okay,\" said Vader, and headed for the throne room door.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Emperor Palpatine pinched the bridge of his nose again, squinching his eyes shut as he heaved an exasperated sigh.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Okay.  Tell me one more time what happened.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well, it&amp;#39;s hard to remember.  It all happened sort of fast.  We were on the catwalk, and I was, you know, I was..  well, it was a lightsaber fight, and I&amp;#39;m -&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Palpatine spoke in unison with Vader, in a tired singsong, &amp;quot;&lt;em&gt;very&lt;/em&gt; good a lightsaber fights,&amp;quot; then rolled his eyes.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Um, right... well, I am.  So you know, I went and I lopped his hand off -&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Palpatine held up a hand in a &amp;#39;stop&amp;#39; motion.  &amp;quot;You lopped his hand off?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well, yeah,&amp;quot; said Vader.  &amp;quot;It was right there and I thought it would underline my point pretty well.  So I lopped off his hand, and it and the lightsaber go tumbling down this impossibly deep hole - they really need to watch how they build those cloud platforms.  Huge hole right where anyone can fall in.  It&amp;#39;s a lawyers&amp;#39; field day.  Anyway, he&amp;#39;s hanging off of this gantry whining and sniveling and it just kind of... uh..  came out.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;&lt;em&gt;What&lt;/em&gt; came out, Anakin?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Vader muttered quickly, like a disclaimer at the end of a landspeeder commercial.  &amp;quot;Joinmeandwe&amp;#39;llrulethegalaxytogetherasfatherandson.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And what did he do then?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He said okay.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Okay?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah.  He was like, sniveling a little, and then he was like, &amp;#39;Okay&amp;#39;.  I really didn&amp;#39;t expect him to agree...  It just sounded like a good thing to say, you know, to like..  make him feel like I cared or something.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Palpatine groaned.  &amp;quot;Like you &lt;em&gt;cared&lt;/em&gt;?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah,&amp;quot; said Vader. &amp;quot;I felt bad for the guy.  You didn&amp;#39;t see this lightsaber fight.  He came in expecting to win and got totally trashed because I&amp;#39;m -&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;In unison again, &amp;quot;&lt;em&gt;very&lt;/em&gt; good at lightsaber fights.&amp;quot;  Another groan from Palpatine.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So now what?&amp;quot; Vader asked.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What do you mean, now what?&amp;quot;  Palpatine shot back.  &amp;quot;There&amp;#39;s only two Sith.  Those are the rules.  There can&amp;#39;t be three Sith.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Where does it say that?&amp;quot; asked Vader.  &amp;quot;We could have three Sith.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s in the handbook,&amp;quot; said Palpatine.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well, let&amp;#39;s change the handbook,&amp;quot; said Vader.  &amp;quot;What do we need to change the handbook?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;A vote.  I vote no change.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I vote we change it to three Sith,&amp;quot; said Vader.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Split decision,&amp;quot; replied Palpatine.  &amp;quot;In a split decision, nothing changes.  Exar Kun and his apprentice tried to change that a while back, but they ended up in a split decision so it didn&amp;#39;t change.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Vader put his hand to his face mask.  &amp;quot;This is going to be so awkward.  I&amp;#39;m going to have to go out there and tell him he can&amp;#39;t be a sith.  What do we do?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Palpatine shrugged.  &amp;quot;Bring him in here and we&amp;#39;ll just all agree to tell the story like he never agreed to anything, and then we&amp;#39;ll fight, and we can put this whole thing behind us.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Okay,&amp;quot; said Vader, and headed for the throne room door.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgcpktr", "score_hidden": false, "stickied": false, "created": 1492412022.0, "created_utc": 1492383222.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65owa5", "likes": null, "replies": "", "user_reports": [], "id": "dgct194", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "I-need-no-username", "parent_id": "t3_65owa5", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\"...We could rule this world! Together! A world far greater than anyone could make alone! Make the changes that democracy is too afraid to! Or will I have to kill you first? *Make your choice*.\"\n\n\"You know what? For the first time ever, you've managed to sway me.\"\n\n\"You're kidding, right?\"\n\n\"No. You have a point. I join you and rule with you, or you kill me and rule alone.\"\n\n\"I don't trust you.\"\n\n\"Me neither. But I know my chances are lower than ever before. Some odds are too insurmountable for even me.\"\n\nTo be continued.\n\n----\n\n^^*not* ^^*actually* ^^*to* ^^*be* ^^*continued* ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;...We could rule this world! Together! A world far greater than anyone could make alone! Make the changes that democracy is too afraid to! Or will I have to kill you first? &lt;em&gt;Make your choice&lt;/em&gt;.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You know what? For the first time ever, you&amp;#39;ve managed to sway me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re kidding, right?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No. You have a point. I join you and rule with you, or you kill me and rule alone.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I don&amp;#39;t trust you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Me neither. But I know my chances are lower than ever before. Some odds are too insurmountable for even me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;To be continued.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;sup&gt;&lt;em&gt;not&lt;/em&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;em&gt;actually&lt;/em&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;em&gt;to&lt;/em&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;em&gt;be&lt;/em&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;em&gt;continued&lt;/em&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgct194", "score_hidden": false, "stickied": false, "created": 1492416754.0, "created_utc": 1492387954.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]