[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WritingPrompts", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Writing Prompt", "id": "65ri13", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 285, "report_reasons": null, "author": "Bardsly", "saved": false, "mod_reports": [], "name": "t3_65ri13", "subreddit_name_prefixed": "r/WritingPrompts", "approved_by": null, "over_18": false, "domain": "self.WritingPrompts", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s3nb", "edited": false, "link_flair_css_class": "flairwp", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WritingPrompts/comments/65ri13/wp_unbeknownst_to_the_general_populace_larpers/", "num_reports": null, "locked": false, "stickied": false, "created": 1492406553.0, "url": "https://www.reddit.com/r/WritingPrompts/comments/65ri13/wp_unbeknownst_to_the_general_populace_larpers/", "author_flair_text": null, "quarantine": false, "title": "[WP] Unbeknownst to the general populace, LARPers are actually protecting the world from unseen threats, under the guise of roleplay. You join your local club, only to find out more than you bargained for....", "created_utc": 1492377753.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 285}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ri13", "likes": null, "replies": "", "user_reports": [], "id": "dgclie1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WritingPromptsRobot", "parent_id": "t3_65ri13", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\n**Off-Topic Discussion**: All top-level comments must be a story or poem. Reply here for other comments.\n\n#####Reminder for Writers and Readers:\n* Prompts are meant to inspire new writing.  Responses don't have to fulfill every detail.\n\n* Please remember to [be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback.\n\n---\n\n[](#icon-help)[^(What Is This?)](https://www.reddit.com/r/WritingPrompts/wiki/off_topic) [](#icon-information)[^(First Time Here?)](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) [](#icon-exclamation)[^(Special Announcements)](https://www.reddit.com/r/WritingPrompts/wiki/announcements) [](#icon-comments)[^(Click For Our Chatroom)](https://www.reddit.com/r/WritingPrompts/wiki/chat)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Off-Topic Discussion&lt;/strong&gt;: All top-level comments must be a story or poem. Reply here for other comments.&lt;/p&gt;\n\n&lt;h5&gt;Reminder for Writers and Readers:&lt;/h5&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Prompts are meant to inspire new writing.  Responses don&amp;#39;t have to fulfill every detail.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Please remember to &lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil\"&gt;be civil&lt;/a&gt; in any feedback.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"#icon-help\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/off_topic\"&gt;&lt;sup&gt;What Is This?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-information\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/user_guide\"&gt;&lt;sup&gt;First Time Here?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-exclamation\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/announcements\"&gt;&lt;sup&gt;Special Announcements&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-comments\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/chat\"&gt;&lt;sup&gt;Click For Our Chatroom&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgclie1", "score_hidden": true, "stickied": true, "created": 1492406569.0, "created_utc": 1492377769.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ri13", "likes": null, "replies": "", "user_reports": [], "id": "dgcx6p3", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "TheknightofAura", "parent_id": "t3_65ri13", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\"One little play\" I'd said to myself that morning. \"One battle, and if I don't like it, I can just go home and pretend i spent the afternoon reading Reddit.\" Of course, heading out with my re-enactment sword, one I'd bought months ago, and had planned to frame on the wall as a decoration, I knew it was going to be hard work. Some people take this seriously, and all the metal gear must weight a fair bit, but I hadn't planned on letting a few over-zealous players ruin the experience. Arriving early, there was only a sparse few people there, already in a group. Two suited up, but obviously built for combat, these people where more 'jocks' then nerds, standing a head and shoulder above me, and I was a tall 6'5\". The third was an old, grizzled-looking veteran, looking fresh from an RPG, the sort who you'd see in a tavern, retired after leading a life of campaigning on the front lines of an army. I almost complimented the makeup, practically flawless, and the scar he bore on his cheek ran deep, deeper then I felt comfortable looking at. The other two looked much less serious, one, in a hoodie and jeans, possibly mistakable for a bystander, if it wasn't for the two blades at his side, blackened with sharpie to glint less in the light, the safety containers out of sight, and the other, a shorter fellow who held a device that looked like a crossbow, the bolt in it capped in a small metal boxing glove: Almost comical. The veteran was talking quietly, and I wished that I could hear him as I walked up, it sounded fun, his face awash with small expressions, that of hate, stern repremands, and undertones of worry: This larper was clearly one who enjoyed his craft. I only caught the last word as I stood behind the two towering suits of metal 'And remember, whatever you do, don't stand directly in front of it.' before they did some sort of group rally call that I wasn't in on, a 'Hoo-Ah!' that had real heart to it, and they scattered, out into today's playfield. I went with, after all, the event wasn't starting for another half hour, and I could use all the practice I could get. Maybe if I figured out that I didn't like it before the event, less people would have the chance to see me. The park was cordned off, a grant given by the city after what the website had said was weeks of booking for a few hours of interrupted time. I wasn't sure what to do, so I walked through the middle of it all, practicing my sword swings a little, the bright orange plastic caps on the side making a pleasant swoosh as I walked. It was all too soon before I rounded a tree, and saw the most real-life looking dragon, made out of shrubbery, standing beofre me. It moved, snorted, and I could swore glared. It wasn't till it opened it's mouth, and a spark of fire lit up, and my world became heat and pain that I remembered the old man's words. 'Don't stand in front of it.'", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;One little play&amp;quot; I&amp;#39;d said to myself that morning. &amp;quot;One battle, and if I don&amp;#39;t like it, I can just go home and pretend i spent the afternoon reading Reddit.&amp;quot; Of course, heading out with my re-enactment sword, one I&amp;#39;d bought months ago, and had planned to frame on the wall as a decoration, I knew it was going to be hard work. Some people take this seriously, and all the metal gear must weight a fair bit, but I hadn&amp;#39;t planned on letting a few over-zealous players ruin the experience. Arriving early, there was only a sparse few people there, already in a group. Two suited up, but obviously built for combat, these people where more &amp;#39;jocks&amp;#39; then nerds, standing a head and shoulder above me, and I was a tall 6&amp;#39;5&amp;quot;. The third was an old, grizzled-looking veteran, looking fresh from an RPG, the sort who you&amp;#39;d see in a tavern, retired after leading a life of campaigning on the front lines of an army. I almost complimented the makeup, practically flawless, and the scar he bore on his cheek ran deep, deeper then I felt comfortable looking at. The other two looked much less serious, one, in a hoodie and jeans, possibly mistakable for a bystander, if it wasn&amp;#39;t for the two blades at his side, blackened with sharpie to glint less in the light, the safety containers out of sight, and the other, a shorter fellow who held a device that looked like a crossbow, the bolt in it capped in a small metal boxing glove: Almost comical. The veteran was talking quietly, and I wished that I could hear him as I walked up, it sounded fun, his face awash with small expressions, that of hate, stern repremands, and undertones of worry: This larper was clearly one who enjoyed his craft. I only caught the last word as I stood behind the two towering suits of metal &amp;#39;And remember, whatever you do, don&amp;#39;t stand directly in front of it.&amp;#39; before they did some sort of group rally call that I wasn&amp;#39;t in on, a &amp;#39;Hoo-Ah!&amp;#39; that had real heart to it, and they scattered, out into today&amp;#39;s playfield. I went with, after all, the event wasn&amp;#39;t starting for another half hour, and I could use all the practice I could get. Maybe if I figured out that I didn&amp;#39;t like it before the event, less people would have the chance to see me. The park was cordned off, a grant given by the city after what the website had said was weeks of booking for a few hours of interrupted time. I wasn&amp;#39;t sure what to do, so I walked through the middle of it all, practicing my sword swings a little, the bright orange plastic caps on the side making a pleasant swoosh as I walked. It was all too soon before I rounded a tree, and saw the most real-life looking dragon, made out of shrubbery, standing beofre me. It moved, snorted, and I could swore glared. It wasn&amp;#39;t till it opened it&amp;#39;s mouth, and a spark of fire lit up, and my world became heat and pain that I remembered the old man&amp;#39;s words. &amp;#39;Don&amp;#39;t stand in front of it.&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgcx6p3", "score_hidden": false, "stickied": false, "created": 1492422231.0, "created_utc": 1492393431.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 45}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ri13", "likes": null, "replies": "", "user_reports": [], "id": "dgcxhwv", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "Kagemoto", "parent_id": "t3_65ri13", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "I look up at the roaring titan and gulp,\n\"What in the world?\"\n\nThe foot comes bearing down on me and it snaps me out of my shock, \"Shit\" I yelp as I dodge and slash the foot.\n\nMy attack pierced through the skin of the titan, making it stumble and fall as my fellow LARPers cheered, \"Good shot man!\" One roared and held out it's palm, \"Bind!\"\n\nLarge chains immediately sprung up and bound the titan to the floor.\n\nOne guy, a rather weedy looking fellow pointed his staff at me and grinned, \"Nice job man, this is going to kick your rank up real quick. You're going to the tougher missions already, luck you.\"\n\nAs I wince another person, a blonde I remembered wearing eyeglasses slams her palm on my back, the armor making it incredibly painful.\n\"You're going to get the good stuff though, so no worries.\"\n\nI cough and look at the sea of grinning faces, I sweat. \n\"You're all insane.\"\n\n\"Welcome to the club, we have free pizza on Thursdays.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I look up at the roaring titan and gulp,\n&amp;quot;What in the world?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The foot comes bearing down on me and it snaps me out of my shock, &amp;quot;Shit&amp;quot; I yelp as I dodge and slash the foot.&lt;/p&gt;\n\n&lt;p&gt;My attack pierced through the skin of the titan, making it stumble and fall as my fellow LARPers cheered, &amp;quot;Good shot man!&amp;quot; One roared and held out it&amp;#39;s palm, &amp;quot;Bind!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Large chains immediately sprung up and bound the titan to the floor.&lt;/p&gt;\n\n&lt;p&gt;One guy, a rather weedy looking fellow pointed his staff at me and grinned, &amp;quot;Nice job man, this is going to kick your rank up real quick. You&amp;#39;re going to the tougher missions already, luck you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;As I wince another person, a blonde I remembered wearing eyeglasses slams her palm on my back, the armor making it incredibly painful.\n&amp;quot;You&amp;#39;re going to get the good stuff though, so no worries.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I cough and look at the sea of grinning faces, I sweat. \n&amp;quot;You&amp;#39;re all insane.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Welcome to the club, we have free pizza on Thursdays.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgcxhwv", "score_hidden": false, "stickied": false, "created": 1492422662.0, "created_utc": 1492393862.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ri13", "likes": null, "replies": "", "user_reports": [], "id": "dgd40hc", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ChasmalVaginaTurtle", "parent_id": "t3_65ri13", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Oh God. Oh sweet merciful Jesus. It didn't have a nose. It looked like some sort of bipedal goat bodybuilder. Except it's face was split open in the middle. Sort of like a vagina. A vagina with teeth.\n\nMy iron greaves thumpped as I backstepped out of the way of the giant axe that looked like a fucking toy in the big goat man's muscular, veiny hands. It screamed what I can only assume to be some sort of vulgarity in an alien language similar to Welsh, with an extreme excess of consonants and not enough vowels.\n\nThe weird bloodshot goat eyes spaced to the side of it's vagina mouth promised me unending agony should I allow myself to fall into it's horrid manhands still breathing. \n\nI slowly walked around it, shield raised, looking for an opening of some sort. The heaving in my chest reminded me of how out of shape I was. A fellow LARPer threw himself at it with a pike. The point went through it's lower back and out it's abdomen in what must've been a mortal strike.\n\nThe vile thing hardly flinched. It tensed it's muscles and heaved that wicked stone axe around a full one hundred and eighty degrees, cleaving the poor man in two.\n\nI wasted no time taking my shot. Charging towards the beast with renewed vigor, I raised my sword over my head and cleaved it right in the vagina face. It's head split in half, the beast spent the next few seconds flailing wildly at the floor with whatever strength it had remaining as it's brain fell out of it's head in tiny gibblets. Until, finally, it was motionless and dead.\n\n\"THIS WAS NOT WHAT I SIGNED UP FOR,\" I explained to the 'leader' of the LARP club as I gushed sweat from my armpits and blood from my mounting wounds. \"HOW THE FUCK IS THIS SUPPOSED TO BE ROLEPLAYING?\"\n\nThe leader, a brown haired young man who would've been your stereotypical neckbeard were it not for his surprisingly large biceps, answered with a sneer. \"Is this not better than mere roleplaying, Sir Arthur? Perhaps thou were all bark and no bite? It is a shameth to see that thou have broken so sooneth.\"\n\n\"I THOUGHT IT WAS ALL FAKE. I DIDN'T KNOW WE'D BE FIGHTING REAL DEMONS, YOU GIANT BLOATED DOUCHEBAG. WHY DON'T YOU JUST CALL THE POLICE?\"\n\n\"Why, Sir Arthur,\" he said with a smug grin. \"Do you think the 'police' could handle these dark creatures of the night? Nay. We are the first and last line of defence humanity has against these foul darkspawn. The sooner thou realise that, the betterth.\"\n\n\"OH MY GOD.\"\n\n\"Don't be silly. There is no God.\"\n\n\"DON'T GIVE ME THAT EDGY ATHEIST BULL-\"\n\n\"No, Arthur,\" somehow he was up in my face now, with his hands on my shoulders. \"There is no God.\" His pupils were pinpricks. His words were cold and final. He looked like he was reliving a nightmare. \"Do you know what would happen if we called the police? They would all die. Do you know what would happen when they send in the army? They would all die. Bullets do not work on them. Fire does not burn them. You can't poision them or drown them. Or even starve them out. I have tried all of those. It was not until one had me pinned on the ground with it's teeth, those gnashing teeth mere inches away from my face dripping saliva and oozing with the smell of rotten flesh, did I pierce it's hide with my pocket knife. That was the only time did I make it bleed. Not when they had my girlfriend in those multitudnous appendages of theirs. Not when she was torn limb by limb. Nor was it when they tortured my family to death. Only then did I make them bleed.\"\n\n\"Do you want the truth of it, Arthur? Death makes them stronger. We fight them because we are few. The rest believe that it is cause we were born with some sort of special ability. That is a lie. We are the first line of defence because they will get nothing when we die. We are not the shining heroes that will save the world. We are sheep to the slaughter. Sacrifices to buy them enough time to invent a solution. We are not the first and last line of defence. There are LARP clubs all over the world. You are nothing. A single brick in the wall that holds back the rising tide. You are only useful to me as long as you do your part. Otherwise I don't give a shit about you. Do you understand why I'm telling you this, Arthur?\"\n\n\"yes,\" I replied, \"i think.\"\n\n\"Good,\" he said, cheerful arrogance back in a heartbeat. \"Now sally forth, Sir Arthur! We have many more to slay until the day is over!\"\n\n\n\n", "edited": 1492403798.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh God. Oh sweet merciful Jesus. It didn&amp;#39;t have a nose. It looked like some sort of bipedal goat bodybuilder. Except it&amp;#39;s face was split open in the middle. Sort of like a vagina. A vagina with teeth.&lt;/p&gt;\n\n&lt;p&gt;My iron greaves thumpped as I backstepped out of the way of the giant axe that looked like a fucking toy in the big goat man&amp;#39;s muscular, veiny hands. It screamed what I can only assume to be some sort of vulgarity in an alien language similar to Welsh, with an extreme excess of consonants and not enough vowels.&lt;/p&gt;\n\n&lt;p&gt;The weird bloodshot goat eyes spaced to the side of it&amp;#39;s vagina mouth promised me unending agony should I allow myself to fall into it&amp;#39;s horrid manhands still breathing. &lt;/p&gt;\n\n&lt;p&gt;I slowly walked around it, shield raised, looking for an opening of some sort. The heaving in my chest reminded me of how out of shape I was. A fellow LARPer threw himself at it with a pike. The point went through it&amp;#39;s lower back and out it&amp;#39;s abdomen in what must&amp;#39;ve been a mortal strike.&lt;/p&gt;\n\n&lt;p&gt;The vile thing hardly flinched. It tensed it&amp;#39;s muscles and heaved that wicked stone axe around a full one hundred and eighty degrees, cleaving the poor man in two.&lt;/p&gt;\n\n&lt;p&gt;I wasted no time taking my shot. Charging towards the beast with renewed vigor, I raised my sword over my head and cleaved it right in the vagina face. It&amp;#39;s head split in half, the beast spent the next few seconds flailing wildly at the floor with whatever strength it had remaining as it&amp;#39;s brain fell out of it&amp;#39;s head in tiny gibblets. Until, finally, it was motionless and dead.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;THIS WAS NOT WHAT I SIGNED UP FOR,&amp;quot; I explained to the &amp;#39;leader&amp;#39; of the LARP club as I gushed sweat from my armpits and blood from my mounting wounds. &amp;quot;HOW THE FUCK IS THIS SUPPOSED TO BE ROLEPLAYING?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The leader, a brown haired young man who would&amp;#39;ve been your stereotypical neckbeard were it not for his surprisingly large biceps, answered with a sneer. &amp;quot;Is this not better than mere roleplaying, Sir Arthur? Perhaps thou were all bark and no bite? It is a shameth to see that thou have broken so sooneth.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I THOUGHT IT WAS ALL FAKE. I DIDN&amp;#39;T KNOW WE&amp;#39;D BE FIGHTING REAL DEMONS, YOU GIANT BLOATED DOUCHEBAG. WHY DON&amp;#39;T YOU JUST CALL THE POLICE?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Why, Sir Arthur,&amp;quot; he said with a smug grin. &amp;quot;Do you think the &amp;#39;police&amp;#39; could handle these dark creatures of the night? Nay. We are the first and last line of defence humanity has against these foul darkspawn. The sooner thou realise that, the betterth.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;OH MY GOD.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Don&amp;#39;t be silly. There is no God.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;DON&amp;#39;T GIVE ME THAT EDGY ATHEIST BULL-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No, Arthur,&amp;quot; somehow he was up in my face now, with his hands on my shoulders. &amp;quot;There is no God.&amp;quot; His pupils were pinpricks. His words were cold and final. He looked like he was reliving a nightmare. &amp;quot;Do you know what would happen if we called the police? They would all die. Do you know what would happen when they send in the army? They would all die. Bullets do not work on them. Fire does not burn them. You can&amp;#39;t poision them or drown them. Or even starve them out. I have tried all of those. It was not until one had me pinned on the ground with it&amp;#39;s teeth, those gnashing teeth mere inches away from my face dripping saliva and oozing with the smell of rotten flesh, did I pierce it&amp;#39;s hide with my pocket knife. That was the only time did I make it bleed. Not when they had my girlfriend in those multitudnous appendages of theirs. Not when she was torn limb by limb. Nor was it when they tortured my family to death. Only then did I make them bleed.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Do you want the truth of it, Arthur? Death makes them stronger. We fight them because we are few. The rest believe that it is cause we were born with some sort of special ability. That is a lie. We are the first line of defence because they will get nothing when we die. We are not the shining heroes that will save the world. We are sheep to the slaughter. Sacrifices to buy them enough time to invent a solution. We are not the first and last line of defence. There are LARP clubs all over the world. You are nothing. A single brick in the wall that holds back the rising tide. You are only useful to me as long as you do your part. Otherwise I don&amp;#39;t give a shit about you. Do you understand why I&amp;#39;m telling you this, Arthur?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;yes,&amp;quot; I replied, &amp;quot;i think.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Good,&amp;quot; he said, cheerful arrogance back in a heartbeat. &amp;quot;Now sally forth, Sir Arthur! We have many more to slay until the day is over!&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgd40hc", "score_hidden": false, "stickied": false, "created": 1492432295.0, "created_utc": 1492403495.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ri13", "likes": null, "replies": "", "user_reports": [], "id": "dgd5r22", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "_DarthJawa_", "parent_id": "t3_65ri13", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "When I first heard about LARPing, I had expected a bunch of sweaty nerds pretending to cast magic spells. What I did not expect was to be attacked by a swarm of actual demons on my first day there. \n\nI first heard about the Adventurers Guild when I saw a poster for them in a back alley, and decided to try going there, since I really liked fantasy games, and they offered 2 nights stay and pizza for free. The first sign that something was off was the giant wall around the area they met in, which had to have been at least 20 meters tall, and how small the area we would be staying on was. But, deciding that I could probably outrun the nerds in there if they tried to kill me, I went up to the gate and knocked. When the gate opened, it revealed a huge building, surrounded in spikes and other defences that dissapeared into the ground as the gate opened. Since there were no people there, I assumed that the gate was electronic and walked up to the building, where a man dressed in full knights armor opened the door, and asked me if I was here for the roleplaying. When I said yes, he told me to follow him and entered the maze of hallways that was the building.\n\nAfter about 20 minutes of walking, we arrived in front of a small room, where the man in the armor handed me some clothes that looked like they belonged to a medieval peasant, and a small dagger.\n\n\"Get changed into these, then go through the door in the room\" said the knight before going back to the door. Once I got changed into the medieval clothes and put my valuables into one of the lockers in the room, I went through the next door to find a strange, green portal on the wall across from me. The only other thing in the room was a note on the side of the portal saying \"WARNING: AFTER GOING THROUGH THE PORTAL, YOU MUST WAIT AT LEAST 1 DAY TO GO BACK\". Thinking it was probably just some in-game rule, I walked through the portal, only to find myself going at extreme speeds through a giant vortex of green.\n\nOnce I was through the vortex, I found myself in a run-down looking house, with the green portal behind me, and a very large chest in front of me. After being quite shaken up after this experience, I realized that there must be something magic controlling this game, so I tried to go back through the portal. When I tried to enter, instead of sending me back to the vortex, it sent me straight into the wall behind me, making a small hole in it and knocking me out.\n\nWhen I woke up, I realized that this must have been what the note meant by waiting a day for re-entry(after 10 minutes of panicing about being trapped here forever), and decided the best thing to do was check out the inside of this house before exploring the area around me. The first thing I decided to check out was the chest, which had 3 items inside. The first was a note saying \"dear LARPER, the town you are currently in has been abandoned due to a planned raid by a demon camp quite close to here. The town will most probably be destroyed in the fight, so feel free to take as many items as you want from here. The raid will take place on 4, 17, 2017, so make sure you get out before then\". The second was a large staff that made of wood, and the third was a small ring with a red gemstone in it.  \n\nSince the date on the note was todays date, I decided that I should run, before noticing that the demons would apparently destroy the whole town, which could possibly include the portal. So I looked in the other houses to find weapons and armor to help me fend off the demons, but all I could find was a small, weak lookinf shield. After I trained with the staff for 2 hours, I finally figured out how to make a small amount of fire, but I didn't have much time to celebrate this accomplishment before I heard the distant chanting of the demon horde. \n\nThe demons were purple creatures, about the same size as a regular human, but with wings, and strange markings all over their bodies. 2 demons that seemed stronger than the rest came at me first, but went down easily when I jumped onto one, led him into the other and stabbed them both. When demons die, they simply dissapear with a loud poof, which alerted the rest of their group to my location. Though I could take on 2 demons, it would be quite hard for me to take down 500 at the same time, so I decided to try and take them on one at a time. After I killed 5, the group noticed my strategy, and started making a circle around me, before my ring glowed a bright red and started to heat up. I pointed it at the demons and it shot a spray of flames at them, destroying at least 50 at the same time, but taking a lot of energy from me. After I killed 75 more demons with my ring, they started to retreat, but not before destroying the last building in town, the one that housed the portal.\n\nAfter a little bit another human appeared, with giant, black armor and a blue sword a that was almost as big as me. He asked if I was new to LARPING, and when I said yes, he told me what LARPERS actually do. \"You see, real LARPERS don't actually run around pretending to cast magic spells, we just tell the general public that so we don't get too many weaklings. LARPERS were actually meant to protect this realm, known as Azinoth, from the dangers inside of it. If we didn't defend the portals around here, the demon hordes would go through it and attack Earth. There was supposed to be a portal around here, but it seems like it was destroyed by the demons. You did a pretty good job protecting it though, why don't you join my guild and help us out? Theres a town close to here getting raided by wood golems that we need some help in\"\n\nAfter accepting his invitation, I started to defend the different portals and worlds in Azinoth, which I have been doing for 100 days now. Sometimes I wonder where people in the real world think I am, until someone told me that time in the real world was so much slower which you are LARPING that I had only been gone for 2 seconds. I would go back to earth anyway, considering how boring it is compared to Azinoth.\n\n\nThis was my first writing prompt I have responded to, and I found it to be really fun, and want to continue this story. If anybody wants me to continue it reply telling me you want a continuation, and if I get enough requests I will try and make one", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I first heard about LARPing, I had expected a bunch of sweaty nerds pretending to cast magic spells. What I did not expect was to be attacked by a swarm of actual demons on my first day there. &lt;/p&gt;\n\n&lt;p&gt;I first heard about the Adventurers Guild when I saw a poster for them in a back alley, and decided to try going there, since I really liked fantasy games, and they offered 2 nights stay and pizza for free. The first sign that something was off was the giant wall around the area they met in, which had to have been at least 20 meters tall, and how small the area we would be staying on was. But, deciding that I could probably outrun the nerds in there if they tried to kill me, I went up to the gate and knocked. When the gate opened, it revealed a huge building, surrounded in spikes and other defences that dissapeared into the ground as the gate opened. Since there were no people there, I assumed that the gate was electronic and walked up to the building, where a man dressed in full knights armor opened the door, and asked me if I was here for the roleplaying. When I said yes, he told me to follow him and entered the maze of hallways that was the building.&lt;/p&gt;\n\n&lt;p&gt;After about 20 minutes of walking, we arrived in front of a small room, where the man in the armor handed me some clothes that looked like they belonged to a medieval peasant, and a small dagger.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Get changed into these, then go through the door in the room&amp;quot; said the knight before going back to the door. Once I got changed into the medieval clothes and put my valuables into one of the lockers in the room, I went through the next door to find a strange, green portal on the wall across from me. The only other thing in the room was a note on the side of the portal saying &amp;quot;WARNING: AFTER GOING THROUGH THE PORTAL, YOU MUST WAIT AT LEAST 1 DAY TO GO BACK&amp;quot;. Thinking it was probably just some in-game rule, I walked through the portal, only to find myself going at extreme speeds through a giant vortex of green.&lt;/p&gt;\n\n&lt;p&gt;Once I was through the vortex, I found myself in a run-down looking house, with the green portal behind me, and a very large chest in front of me. After being quite shaken up after this experience, I realized that there must be something magic controlling this game, so I tried to go back through the portal. When I tried to enter, instead of sending me back to the vortex, it sent me straight into the wall behind me, making a small hole in it and knocking me out.&lt;/p&gt;\n\n&lt;p&gt;When I woke up, I realized that this must have been what the note meant by waiting a day for re-entry(after 10 minutes of panicing about being trapped here forever), and decided the best thing to do was check out the inside of this house before exploring the area around me. The first thing I decided to check out was the chest, which had 3 items inside. The first was a note saying &amp;quot;dear LARPER, the town you are currently in has been abandoned due to a planned raid by a demon camp quite close to here. The town will most probably be destroyed in the fight, so feel free to take as many items as you want from here. The raid will take place on 4, 17, 2017, so make sure you get out before then&amp;quot;. The second was a large staff that made of wood, and the third was a small ring with a red gemstone in it.  &lt;/p&gt;\n\n&lt;p&gt;Since the date on the note was todays date, I decided that I should run, before noticing that the demons would apparently destroy the whole town, which could possibly include the portal. So I looked in the other houses to find weapons and armor to help me fend off the demons, but all I could find was a small, weak lookinf shield. After I trained with the staff for 2 hours, I finally figured out how to make a small amount of fire, but I didn&amp;#39;t have much time to celebrate this accomplishment before I heard the distant chanting of the demon horde. &lt;/p&gt;\n\n&lt;p&gt;The demons were purple creatures, about the same size as a regular human, but with wings, and strange markings all over their bodies. 2 demons that seemed stronger than the rest came at me first, but went down easily when I jumped onto one, led him into the other and stabbed them both. When demons die, they simply dissapear with a loud poof, which alerted the rest of their group to my location. Though I could take on 2 demons, it would be quite hard for me to take down 500 at the same time, so I decided to try and take them on one at a time. After I killed 5, the group noticed my strategy, and started making a circle around me, before my ring glowed a bright red and started to heat up. I pointed it at the demons and it shot a spray of flames at them, destroying at least 50 at the same time, but taking a lot of energy from me. After I killed 75 more demons with my ring, they started to retreat, but not before destroying the last building in town, the one that housed the portal.&lt;/p&gt;\n\n&lt;p&gt;After a little bit another human appeared, with giant, black armor and a blue sword a that was almost as big as me. He asked if I was new to LARPING, and when I said yes, he told me what LARPERS actually do. &amp;quot;You see, real LARPERS don&amp;#39;t actually run around pretending to cast magic spells, we just tell the general public that so we don&amp;#39;t get too many weaklings. LARPERS were actually meant to protect this realm, known as Azinoth, from the dangers inside of it. If we didn&amp;#39;t defend the portals around here, the demon hordes would go through it and attack Earth. There was supposed to be a portal around here, but it seems like it was destroyed by the demons. You did a pretty good job protecting it though, why don&amp;#39;t you join my guild and help us out? Theres a town close to here getting raided by wood golems that we need some help in&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;After accepting his invitation, I started to defend the different portals and worlds in Azinoth, which I have been doing for 100 days now. Sometimes I wonder where people in the real world think I am, until someone told me that time in the real world was so much slower which you are LARPING that I had only been gone for 2 seconds. I would go back to earth anyway, considering how boring it is compared to Azinoth.&lt;/p&gt;\n\n&lt;p&gt;This was my first writing prompt I have responded to, and I found it to be really fun, and want to continue this story. If anybody wants me to continue it reply telling me you want a continuation, and if I get enough requests I will try and make one&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgd5r22", "score_hidden": false, "stickied": false, "created": 1492435615.0, "created_utc": 1492406815.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ri13", "likes": null, "replies": "", "user_reports": [], "id": "dgd6xj1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "AslandusTheLaster", "parent_id": "t3_65ri13", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\"Welcome to our Live Action Roleplay group. You here for a session or two or you in for the long haul?\"\n\nThe teenager standing in front of me asked the question casually. He didn't look like someone I imagined LARPing. His build was sturdy, perhaps even fairly athletic. My parents were pushing me to join a club of some kind, so I assumed I was gonna be here for the rest of high school. I signed the column for long term membership.\n\n\"I might be here awhile, it better not be boring.\"\n\n\"Oh, no danger of that. Here's a list of things you need before you can get started, we have a few things we can lend you for the first few sessions but it's better to have your own stuff if you're gonna be at this awhile.\"\n\nI looked over the list. Weighted rubber weapon, chainmail hauberk, boots... Seemed like fairly normal stuff, though I might have to save up for a few of the things. And then there was one thing that seemed out of place.\n\n\"St. Micheal's Eye draught?\"\n\n\"Oh yeah, you'll need to go through our supplier for that, they don't sell it in stores.\"\n\n\"What's it for?\"\n\n\"You need it to see the monsters, unless you want to be fighting blind.\"\n\nHe stated it as if it were a simple fact, like mentioning that you needed paper to write a letter.\n\n\"Fighting monsters? You mean we're not just hitting each other with swords for fun?\"\n\nMy reaction seemed to wake him up a little.\n\n\"Whoops, forgot to mention that we have a pact of secrecy on that part. Our training is done in public, but our actual activity is more under the radar. We'll tell you more at the first meeting.\"\n\nAt the time, my thoughts that I would either ignore it and just say I was part of a club now, or to just show up, smack people around with fake swords, and go home. Naturally, I was wrong on both counts.\n\n-----\n\nThe group had a little over a dozen people in it. Fairly solid, for a school club. There was a clear line between the people who had been in the group for awhile and the newbies like me. They didn't quite look like football players, but they were big enough that I definitely wouldn't want to get in a real fight with them. The guy who had been running the signup booth stood in front of the group.\n\n\"Welcome, all. We have a few new faces in the crowd, and we'll get to introductions in a bit, but I'll start with myself. I am Vincent, but you guys can call me Vince. This club is for those interested in getting firsthand experience using medieval-era and fantasy-style weaponry, and those looking to make a difference in the community. Any questions?\"\n\nI raised my hand as if we were in class, then realized that was kind of silly and stepped forward.\n\n\"You said something when I signed up about monsters?\"\n\nHis expression shifted from a friendly smile to a slightly annoyed smirk.\n\n\"I also said something about secrecy, but apparently that part was overlooked. Well, since it's out there now... For the longer term members of our club, we occasionally take quests to destroy beasts most people only know of as myths. We also meet up with other LARP groups to fight off some greater threats. It can get dangerous, but we're a strong group and you're always welcome to sit things out if they seem too bad. But c'mon, nothing we can't take down, right?\"\n\nThere were some cheers from the senior members, and one of the rookies, but the other two rookies looked a bit freaked out. I was one of those two.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Welcome to our Live Action Roleplay group. You here for a session or two or you in for the long haul?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The teenager standing in front of me asked the question casually. He didn&amp;#39;t look like someone I imagined LARPing. His build was sturdy, perhaps even fairly athletic. My parents were pushing me to join a club of some kind, so I assumed I was gonna be here for the rest of high school. I signed the column for long term membership.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I might be here awhile, it better not be boring.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh, no danger of that. Here&amp;#39;s a list of things you need before you can get started, we have a few things we can lend you for the first few sessions but it&amp;#39;s better to have your own stuff if you&amp;#39;re gonna be at this awhile.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I looked over the list. Weighted rubber weapon, chainmail hauberk, boots... Seemed like fairly normal stuff, though I might have to save up for a few of the things. And then there was one thing that seemed out of place.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;St. Micheal&amp;#39;s Eye draught?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh yeah, you&amp;#39;ll need to go through our supplier for that, they don&amp;#39;t sell it in stores.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What&amp;#39;s it for?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You need it to see the monsters, unless you want to be fighting blind.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He stated it as if it were a simple fact, like mentioning that you needed paper to write a letter.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Fighting monsters? You mean we&amp;#39;re not just hitting each other with swords for fun?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My reaction seemed to wake him up a little.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Whoops, forgot to mention that we have a pact of secrecy on that part. Our training is done in public, but our actual activity is more under the radar. We&amp;#39;ll tell you more at the first meeting.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;At the time, my thoughts that I would either ignore it and just say I was part of a club now, or to just show up, smack people around with fake swords, and go home. Naturally, I was wrong on both counts.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The group had a little over a dozen people in it. Fairly solid, for a school club. There was a clear line between the people who had been in the group for awhile and the newbies like me. They didn&amp;#39;t quite look like football players, but they were big enough that I definitely wouldn&amp;#39;t want to get in a real fight with them. The guy who had been running the signup booth stood in front of the group.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Welcome, all. We have a few new faces in the crowd, and we&amp;#39;ll get to introductions in a bit, but I&amp;#39;ll start with myself. I am Vincent, but you guys can call me Vince. This club is for those interested in getting firsthand experience using medieval-era and fantasy-style weaponry, and those looking to make a difference in the community. Any questions?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I raised my hand as if we were in class, then realized that was kind of silly and stepped forward.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You said something when I signed up about monsters?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;His expression shifted from a friendly smile to a slightly annoyed smirk.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I also said something about secrecy, but apparently that part was overlooked. Well, since it&amp;#39;s out there now... For the longer term members of our club, we occasionally take quests to destroy beasts most people only know of as myths. We also meet up with other LARP groups to fight off some greater threats. It can get dangerous, but we&amp;#39;re a strong group and you&amp;#39;re always welcome to sit things out if they seem too bad. But c&amp;#39;mon, nothing we can&amp;#39;t take down, right?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;There were some cheers from the senior members, and one of the rookies, but the other two rookies looked a bit freaked out. I was one of those two.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgd6xj1", "score_hidden": false, "stickied": false, "created": 1492438100.0, "created_utc": 1492409300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]