[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WritingPrompts", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Writing Prompt", "id": "65ry7x", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 118, "report_reasons": null, "author": "YourDailyDevil", "saved": false, "mod_reports": [], "name": "t3_65ry7x", "subreddit_name_prefixed": "r/WritingPrompts", "approved_by": null, "over_18": false, "domain": "self.WritingPrompts", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s3nb", "edited": false, "link_flair_css_class": "flairwp", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WritingPrompts/comments/65ry7x/wp_not_even_death_can_stop_you_from_cold/", "num_reports": null, "locked": false, "stickied": false, "created": 1492411891.0, "url": "https://www.reddit.com/r/WritingPrompts/comments/65ry7x/wp_not_even_death_can_stop_you_from_cold/", "author_flair_text": null, "quarantine": false, "title": "[WP] Not even death can stop you from cold calculated revenge against the drunk driver who killed you, as you are consistently reincarnated as small animals who will stop at nothing to destroy her.", "created_utc": 1492383091.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 118}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ry7x", "likes": null, "replies": "", "user_reports": [], "id": "dgcpinb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WritingPromptsRobot", "parent_id": "t3_65ry7x", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\n**Off-Topic Discussion**: All top-level comments must be a story or poem. Reply here for other comments.\n\n#####Reminder for Writers and Readers:\n* Prompts are meant to inspire new writing.  Responses don't have to fulfill every detail.\n\n* Please remember to [be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback.\n\n---\n\n[](#icon-help)[^(What Is This?)](https://www.reddit.com/r/WritingPrompts/wiki/off_topic) [](#icon-information)[^(First Time Here?)](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) [](#icon-exclamation)[^(Special Announcements)](https://www.reddit.com/r/WritingPrompts/wiki/announcements) [](#icon-comments)[^(Click For Our Chatroom)](https://www.reddit.com/r/WritingPrompts/wiki/chat)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Off-Topic Discussion&lt;/strong&gt;: All top-level comments must be a story or poem. Reply here for other comments.&lt;/p&gt;\n\n&lt;h5&gt;Reminder for Writers and Readers:&lt;/h5&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Prompts are meant to inspire new writing.  Responses don&amp;#39;t have to fulfill every detail.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Please remember to &lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil\"&gt;be civil&lt;/a&gt; in any feedback.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"#icon-help\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/off_topic\"&gt;&lt;sup&gt;What Is This?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-information\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/user_guide\"&gt;&lt;sup&gt;First Time Here?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-exclamation\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/announcements\"&gt;&lt;sup&gt;Special Announcements&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-comments\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/chat\"&gt;&lt;sup&gt;Click For Our Chatroom&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgcpinb", "score_hidden": true, "stickied": true, "created": 1492411941.0, "created_utc": 1492383141.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ry7x", "likes": null, "replies": "", "user_reports": [], "id": "dgd9hee", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "ProteinBiscuit", "parent_id": "t3_65ry7x", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "It was over in an instant. I've heard that most people never see it coming, and while I can't attest to being true, I'm just one man, I can say that's definitely how it was for me.  I was on my way home after picking up some milk from the convience store, when I half way through the cross walk I knelt down to tie my shoe and it was all over.\n\n\n\"You were killed by a drunk driver.\" A booming voice announced, a little jarring when the last thing I remember was tying my shoes.\n\n\n\"Oh...\" I was surrounded by darkness except for a small light shining down on me from the distance where the booming voice was originating.\n\n\n\"This must come as a shock to you.\"  I can think of a few other things more shocking than the a drunk driving incident leading to a death. They kill thousands a year, you know?  I don't know if that's true, I didn't bring my laptop here.\n\n\n\"I guess...\"  I dont know where this is going, but I don't have anything else to do.\n\n\n\"You must seek your revenge!\" The booming voice was louder than ever before, announcing what it had in store for me.\n\n\n\"D-do I have to?\"  The voice went silent, I sat there in silence in response. Dammit, I feel like I made a bad first impression.  \"Uh, are you mad?\" The booming voice stayed silent still, and I stared back into the light. \"I uh, want revenge.\"\n\n\"OF COURSE YOU DO!\" The booming voice returned. Whew. I'm not saying I'm not bummed about it, it is a bummer to bend over and die, but I just expected the afterlife to either be nothing or at least not this.  \"You will be sent back to earth in the form of small animals to enact your revenge.\" WHY!?\n\n\n\"G-Great, t-thank you for this opportunity.\"  I don't want to upset anyone.\n\n\"Go forth!\" The voice boomed and the light grew brighter and brighter til it was all I could see. I shielded my eyes.\n\n\"WAIT!\"  The light faded a little, giving way to some of the darkness returning and the booming voice lowering its volume.\n\n\n\"Is there a misunderstanding?\" There are many...\n\n\n\"I'm sorry, your, uh, greatness, I dont even know who killed me. I wouldn't even know where to start.\"\n\n\n\"SARAH JOHNSON.\" The voice boomed and the light began to fill the room once again.\n\n\n\"Hey I know her!\" I had a moment of jubilance, followed by profound sadness.  \"S-she's a sweet girl, Im sure she didn't mean it.\"\n\n\n\"REVENGE.\" THe voice boomed and the room was filled with a blinding light, I attempted to shield my eyes but it overwhelmed me.\n\n\nThe light slowly faded and I was reborn, set on my task of revenge, despite my better judgement. My vision was distorted and I was surrounded by large green blades as far as the eye could see.  What...am I... I wondered for a few seconds before my vision went black and my life was snuffed out. WHY!?  This happened several hundred times before I was finally reincarnated as a small chipmunk. Finally, something useful.  It was cold and raining. Spring, of what year I don't even know, it's hard to keep track of time when you have no reference of it, I don't know if i was instantly revived after each failing, I don't know if i was sent back immediately upon my initial death, all i know is that I died in summer so at least some time has passed.\n\nI searched our neighbourhood for her old house, honestly there wasn't much else I could do, I'm not really working with a lot here. Is that..her?  I squinted as her old house, she looked different now, much older, she was waving goodbye to an older guy who was leaving with 2 small children. Time has passed. She must have married and had kids.  That's nice.  I MEAN, REVENGE!  I scurried along the ground, carefully crossing the street.  Chipmunks are never careful and they always manage to make it, but a lot of time has passed with me getting nothing but useless bodies so I'm trying to be as careful as possible with this one.  I crept up to her house, scurrying and crouching, scurrying and crouching, if anyone suspected a man had been sent back in the body of a chipmunk to enact forced revenge, then even they wouldn't see me coming.  I scurried up the tree and hid overlooking her house. I may have a body now, but revenge won't come easy, I'll have to stake out the place to find an opportunity.\n\nI staked out her house day in and day out, mimicing what I think chipmunks eat and getting various forms of stomach discomfort as I guess wrong. There!  The opportunity I've been waiting s-some form of time for, I'm still not sure how much time has passed, arose.  I watched her, stalked her, as she walked to the mailbox and put an envelope inside. I'm no fool. I waited for her to leave then crept up to the mail box, I climbed inside and gnawed and chewed at the envelope, destroying it, slowly but surely. Now we wait.\n\nI went back to my stakeout, I sat up in the tree watching her family await their fate. \n\n\"Did you mail the taxes?\" The man she presumably is with asked. She tilted her head a little.\n\n\"Hmm? I did that a while.\" She responded quizzicaly.\n\n\"They said they never got it, I guess we'll have to send it again.\"\n\n\"Oh.\"\n\n\"They said there'll be a small fine.\" Sweet revenge.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was over in an instant. I&amp;#39;ve heard that most people never see it coming, and while I can&amp;#39;t attest to being true, I&amp;#39;m just one man, I can say that&amp;#39;s definitely how it was for me.  I was on my way home after picking up some milk from the convience store, when I half way through the cross walk I knelt down to tie my shoe and it was all over.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You were killed by a drunk driver.&amp;quot; A booming voice announced, a little jarring when the last thing I remember was tying my shoes.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh...&amp;quot; I was surrounded by darkness except for a small light shining down on me from the distance where the booming voice was originating.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This must come as a shock to you.&amp;quot;  I can think of a few other things more shocking than the a drunk driving incident leading to a death. They kill thousands a year, you know?  I don&amp;#39;t know if that&amp;#39;s true, I didn&amp;#39;t bring my laptop here.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I guess...&amp;quot;  I dont know where this is going, but I don&amp;#39;t have anything else to do.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You must seek your revenge!&amp;quot; The booming voice was louder than ever before, announcing what it had in store for me.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;D-do I have to?&amp;quot;  The voice went silent, I sat there in silence in response. Dammit, I feel like I made a bad first impression.  &amp;quot;Uh, are you mad?&amp;quot; The booming voice stayed silent still, and I stared back into the light. &amp;quot;I uh, want revenge.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;OF COURSE YOU DO!&amp;quot; The booming voice returned. Whew. I&amp;#39;m not saying I&amp;#39;m not bummed about it, it is a bummer to bend over and die, but I just expected the afterlife to either be nothing or at least not this.  &amp;quot;You will be sent back to earth in the form of small animals to enact your revenge.&amp;quot; WHY!?&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;G-Great, t-thank you for this opportunity.&amp;quot;  I don&amp;#39;t want to upset anyone.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Go forth!&amp;quot; The voice boomed and the light grew brighter and brighter til it was all I could see. I shielded my eyes.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;WAIT!&amp;quot;  The light faded a little, giving way to some of the darkness returning and the booming voice lowering its volume.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Is there a misunderstanding?&amp;quot; There are many...&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m sorry, your, uh, greatness, I dont even know who killed me. I wouldn&amp;#39;t even know where to start.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;SARAH JOHNSON.&amp;quot; The voice boomed and the light began to fill the room once again.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey I know her!&amp;quot; I had a moment of jubilance, followed by profound sadness.  &amp;quot;S-she&amp;#39;s a sweet girl, Im sure she didn&amp;#39;t mean it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;REVENGE.&amp;quot; THe voice boomed and the room was filled with a blinding light, I attempted to shield my eyes but it overwhelmed me.&lt;/p&gt;\n\n&lt;p&gt;The light slowly faded and I was reborn, set on my task of revenge, despite my better judgement. My vision was distorted and I was surrounded by large green blades as far as the eye could see.  What...am I... I wondered for a few seconds before my vision went black and my life was snuffed out. WHY!?  This happened several hundred times before I was finally reincarnated as a small chipmunk. Finally, something useful.  It was cold and raining. Spring, of what year I don&amp;#39;t even know, it&amp;#39;s hard to keep track of time when you have no reference of it, I don&amp;#39;t know if i was instantly revived after each failing, I don&amp;#39;t know if i was sent back immediately upon my initial death, all i know is that I died in summer so at least some time has passed.&lt;/p&gt;\n\n&lt;p&gt;I searched our neighbourhood for her old house, honestly there wasn&amp;#39;t much else I could do, I&amp;#39;m not really working with a lot here. Is that..her?  I squinted as her old house, she looked different now, much older, she was waving goodbye to an older guy who was leaving with 2 small children. Time has passed. She must have married and had kids.  That&amp;#39;s nice.  I MEAN, REVENGE!  I scurried along the ground, carefully crossing the street.  Chipmunks are never careful and they always manage to make it, but a lot of time has passed with me getting nothing but useless bodies so I&amp;#39;m trying to be as careful as possible with this one.  I crept up to her house, scurrying and crouching, scurrying and crouching, if anyone suspected a man had been sent back in the body of a chipmunk to enact forced revenge, then even they wouldn&amp;#39;t see me coming.  I scurried up the tree and hid overlooking her house. I may have a body now, but revenge won&amp;#39;t come easy, I&amp;#39;ll have to stake out the place to find an opportunity.&lt;/p&gt;\n\n&lt;p&gt;I staked out her house day in and day out, mimicing what I think chipmunks eat and getting various forms of stomach discomfort as I guess wrong. There!  The opportunity I&amp;#39;ve been waiting s-some form of time for, I&amp;#39;m still not sure how much time has passed, arose.  I watched her, stalked her, as she walked to the mailbox and put an envelope inside. I&amp;#39;m no fool. I waited for her to leave then crept up to the mail box, I climbed inside and gnawed and chewed at the envelope, destroying it, slowly but surely. Now we wait.&lt;/p&gt;\n\n&lt;p&gt;I went back to my stakeout, I sat up in the tree watching her family await their fate. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Did you mail the taxes?&amp;quot; The man she presumably is with asked. She tilted her head a little.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hmm? I did that a while.&amp;quot; She responded quizzicaly.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;They said they never got it, I guess we&amp;#39;ll have to send it again.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;They said there&amp;#39;ll be a small fine.&amp;quot; Sweet revenge.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgd9hee", "score_hidden": false, "stickied": false, "created": 1492444428.0, "created_utc": 1492415628.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ry7x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ry7x", "likes": null, "replies": "", "user_reports": [], "id": "dgd5165", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "shithead33", "parent_id": "t1_dgd0vw2", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Mr. Krabs is that you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mr. Krabs is that you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgd5165", "score_hidden": false, "stickied": false, "created": 1492434185.0, "created_utc": 1492405385.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ry7x", "likes": null, "replies": "", "user_reports": [], "id": "dgd7pol", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MDMK2", "parent_id": "t1_dgd0vw2", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Decoy gardener", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Decoy gardener&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgd7pol", "score_hidden": false, "stickied": false, "created": 1492439842.0, "created_utc": 1492411042.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0vw2", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Remnix", "parent_id": "t3_65ry7x", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "This is it! I thought to myself as the sun peeked over the horizon and into the garden bed adjacent to her house. The light warming my new body filled me with excitement, my muscles twitching in anticipation of my impending success. \nThere was dew on the leaves, not for too much longer i thought, although it didn't matter, the conditions were perfect. I'd seen this scenario played out before from above, she would exit her house, scare the birds away, then killing insect and weedy plant life as thoughtlessly as she had ended my life months ago. \n\nI'd spent the previous night snaking my way through the garden knowing my placement needed to be perfect to ambush her.  I waited amongst the leaves of a strawberry plant, I'd seen her digging around this plant, checking for hoppers and picking the fruits of her labours. It's time to reap what you've sown.\n\nI sat waiting, watching the door as it opened slowly, the slender, grey haired woman walking slowly with her cane. First toward the garden, then from plant to plant, crushing hoppers and ripping the saplings from their pots, all for being in the wrong place at the wrong time. Disgusting. \nAs she approached my hiding place, I dashed as fast as I could to a strawberry so she would have to come closer to me. My heart pounding as she approached, I could tell she saw me, her hand reaching down to toss me away from her precious berries. As she touched me, she went stiff, falling forwards into her prized garden, a life snuffed in an instant. I'd won. I pulled my eye stalks into my body then retracted into my shell to calm down. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is it! I thought to myself as the sun peeked over the horizon and into the garden bed adjacent to her house. The light warming my new body filled me with excitement, my muscles twitching in anticipation of my impending success. \nThere was dew on the leaves, not for too much longer i thought, although it didn&amp;#39;t matter, the conditions were perfect. I&amp;#39;d seen this scenario played out before from above, she would exit her house, scare the birds away, then killing insect and weedy plant life as thoughtlessly as she had ended my life months ago. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d spent the previous night snaking my way through the garden knowing my placement needed to be perfect to ambush her.  I waited amongst the leaves of a strawberry plant, I&amp;#39;d seen her digging around this plant, checking for hoppers and picking the fruits of her labours. It&amp;#39;s time to reap what you&amp;#39;ve sown.&lt;/p&gt;\n\n&lt;p&gt;I sat waiting, watching the door as it opened slowly, the slender, grey haired woman walking slowly with her cane. First toward the garden, then from plant to plant, crushing hoppers and ripping the saplings from their pots, all for being in the wrong place at the wrong time. Disgusting. \nAs she approached my hiding place, I dashed as fast as I could to a strawberry so she would have to come closer to me. My heart pounding as she approached, I could tell she saw me, her hand reaching down to toss me away from her precious berries. As she touched me, she went stiff, falling forwards into her prized garden, a life snuffed in an instant. I&amp;#39;d won. I pulled my eye stalks into my body then retracted into my shell to calm down. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgd0vw2", "score_hidden": false, "stickied": false, "created": 1492427412.0, "created_utc": 1492398612.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ry7x", "likes": null, "replies": "", "user_reports": [], "id": "dgd9ehv", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Cheapskate-DM", "parent_id": "t3_65ry7x", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "*This must be what a deer feels like.*\n\nThe immediacy of the moment continues to shock me. I just turned my head, and suddenly - *crunch*. Here I am. I think my neck must be broken, because nothing hurts except my head. I should be scared. I'm not scared. I don't know why.\n\nShe stumbles out of the crumpled black Ferrari, cans bouncing across pavement as she falls to her knees. I know her - she dated Ross. She lives in a too-nice house with too-nice parents, and greets everyone with that too-nice smile.\n\nMy death is interrupted by a sound that takes too long to recognize. She's *laughing*. I'm dying, and she's alive, and she's *laughing*. Suddenly I don't care about pain or fear or dying. There is only hate. Hate follows me to darkness.\n\n--\n\nI dream of blood, and then of forests. Night becomes day becomes night. Time ceases to have meaning until one day I suddenly awaken. An awkward scream bleats out of me as I recover from the terror of death.\n\nHow long was I asleep? No. Not asleep. How long was I *alive?* I stumble forward on hoofed feet until the connection hits me. I find my footing and begin to walk - the land is familiar. These hills are mine, and I am theirs. But I was not like this. I find a stream and see my reflection, proud horns a heavy crown on my head. I am Deer, Prince of the Forest. I have known this all my life - this life.\n\nBut I remember the stream from another life. I remember cold water on hairless skin. I remember the clatter of cans, shared in secret. I remember the clatter of cans on pavement. I remember her laugh.\n\nI remember where she lives.\n\nI walk, and eat, and wait for night.\n\n--\n\nI find the neighborhood. It is still too nice.\n\nThe morning mist makes me shiver, but I am undaunted. A jogger passes me and stops to take a picture. I ignore him. He is not her.\n\nI find the house. There is a red Ferrari. It is too early - so I lay down and wait. Another jogger passes. I stare until he leaves. I rest my head and feel the cool grass on my chin. There is no peace here - only patient fury.\n\nI hear an engine, and I jump awake. My eyes flit frantically - I find the red Ferrari. The hood is down. She is driving towards me. She hasn't noticed - the mist conceals me. I break into a galloping run. I leap, horns forward, vaulting through the air.\n\nI am Deer, Prince of the Forest. But I was once something more. Something was stolen from me - a life more rich, more potent than this one. I cannot begin to remember it all. But I remember her laugh. She will remember me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;This must be what a deer feels like.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The immediacy of the moment continues to shock me. I just turned my head, and suddenly - &lt;em&gt;crunch&lt;/em&gt;. Here I am. I think my neck must be broken, because nothing hurts except my head. I should be scared. I&amp;#39;m not scared. I don&amp;#39;t know why.&lt;/p&gt;\n\n&lt;p&gt;She stumbles out of the crumpled black Ferrari, cans bouncing across pavement as she falls to her knees. I know her - she dated Ross. She lives in a too-nice house with too-nice parents, and greets everyone with that too-nice smile.&lt;/p&gt;\n\n&lt;p&gt;My death is interrupted by a sound that takes too long to recognize. She&amp;#39;s &lt;em&gt;laughing&lt;/em&gt;. I&amp;#39;m dying, and she&amp;#39;s alive, and she&amp;#39;s &lt;em&gt;laughing&lt;/em&gt;. Suddenly I don&amp;#39;t care about pain or fear or dying. There is only hate. Hate follows me to darkness.&lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;I dream of blood, and then of forests. Night becomes day becomes night. Time ceases to have meaning until one day I suddenly awaken. An awkward scream bleats out of me as I recover from the terror of death.&lt;/p&gt;\n\n&lt;p&gt;How long was I asleep? No. Not asleep. How long was I &lt;em&gt;alive?&lt;/em&gt; I stumble forward on hoofed feet until the connection hits me. I find my footing and begin to walk - the land is familiar. These hills are mine, and I am theirs. But I was not like this. I find a stream and see my reflection, proud horns a heavy crown on my head. I am Deer, Prince of the Forest. I have known this all my life - this life.&lt;/p&gt;\n\n&lt;p&gt;But I remember the stream from another life. I remember cold water on hairless skin. I remember the clatter of cans, shared in secret. I remember the clatter of cans on pavement. I remember her laugh.&lt;/p&gt;\n\n&lt;p&gt;I remember where she lives.&lt;/p&gt;\n\n&lt;p&gt;I walk, and eat, and wait for night.&lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;I find the neighborhood. It is still too nice.&lt;/p&gt;\n\n&lt;p&gt;The morning mist makes me shiver, but I am undaunted. A jogger passes me and stops to take a picture. I ignore him. He is not her.&lt;/p&gt;\n\n&lt;p&gt;I find the house. There is a red Ferrari. It is too early - so I lay down and wait. Another jogger passes. I stare until he leaves. I rest my head and feel the cool grass on my chin. There is no peace here - only patient fury.&lt;/p&gt;\n\n&lt;p&gt;I hear an engine, and I jump awake. My eyes flit frantically - I find the red Ferrari. The hood is down. She is driving towards me. She hasn&amp;#39;t noticed - the mist conceals me. I break into a galloping run. I leap, horns forward, vaulting through the air.&lt;/p&gt;\n\n&lt;p&gt;I am Deer, Prince of the Forest. But I was once something more. Something was stolen from me - a life more rich, more potent than this one. I cannot begin to remember it all. But I remember her laugh. She will remember me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgd9ehv", "score_hidden": false, "stickied": false, "created": 1492444176.0, "created_utc": 1492415376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65ry7x", "likes": null, "replies": "", "user_reports": [], "id": "dgdd0e6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "alice_op", "parent_id": "t3_65ry7x", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Bring me back to life, I thought. Bring me back to life, you motherfucker.\n\nHe’d promised I could have my revenge against the bitch who had killed me, some drunk ass college girl who had spun off the road and snuffed out my life.\n\nDarkness surrounded me, suffocating and hot, until suddenly I was being squashed and squeezed through a small tube… Ah, to be born again. I couldn’t wait to see what tiny useless little rodent I was to be this time.\n\nAs I was forced out, I rolled around for the first time again, in the outside world. No doubt in my mind about where I was – the woodland, just off the college campus where my nemesis resided.  The where was clear to me, as always. Who knew how much time had passed this time? I didn’t want to know, all I cared about was my revenge against the vermin that had killed me. I would have it.\n\nI righted myself up to see my new ‘mother’ and  sighed, resigning myself to the next 3-4 weeks of feeding from a freaking mouse.\n\nThe weeks passed slowly and painfully for me. But it was time. I took watch outside her dorm, I knew exactly what I was going to do. \n\nI waited for her to leave and crept in through the building to her room – I didn’t need any overexcited screaming girls stamping on me or throwing their damn textbooks this time.\n\nI arrived at my destination and headed straight for the bedside drawer. I jumped up and wrestled to get the door out of the frame just an inch. \n\nSuccess! I jumped inside, aligned my teeth and bit straight through the condoms, each and every one of them.\n\nShe would pay for ending my life.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bring me back to life, I thought. Bring me back to life, you motherfucker.&lt;/p&gt;\n\n&lt;p&gt;He’d promised I could have my revenge against the bitch who had killed me, some drunk ass college girl who had spun off the road and snuffed out my life.&lt;/p&gt;\n\n&lt;p&gt;Darkness surrounded me, suffocating and hot, until suddenly I was being squashed and squeezed through a small tube… Ah, to be born again. I couldn’t wait to see what tiny useless little rodent I was to be this time.&lt;/p&gt;\n\n&lt;p&gt;As I was forced out, I rolled around for the first time again, in the outside world. No doubt in my mind about where I was – the woodland, just off the college campus where my nemesis resided.  The where was clear to me, as always. Who knew how much time had passed this time? I didn’t want to know, all I cared about was my revenge against the vermin that had killed me. I would have it.&lt;/p&gt;\n\n&lt;p&gt;I righted myself up to see my new ‘mother’ and  sighed, resigning myself to the next 3-4 weeks of feeding from a freaking mouse.&lt;/p&gt;\n\n&lt;p&gt;The weeks passed slowly and painfully for me. But it was time. I took watch outside her dorm, I knew exactly what I was going to do. &lt;/p&gt;\n\n&lt;p&gt;I waited for her to leave and crept in through the building to her room – I didn’t need any overexcited screaming girls stamping on me or throwing their damn textbooks this time.&lt;/p&gt;\n\n&lt;p&gt;I arrived at my destination and headed straight for the bedside drawer. I jumped up and wrestled to get the door out of the frame just an inch. &lt;/p&gt;\n\n&lt;p&gt;Success! I jumped inside, aligned my teeth and bit straight through the condoms, each and every one of them.&lt;/p&gt;\n\n&lt;p&gt;She would pay for ending my life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgdd0e6", "score_hidden": false, "stickied": false, "created": 1492456098.0, "created_utc": 1492427298.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]