[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WritingPrompts", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Writing Prompt", "id": "65v2ho", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 134, "report_reasons": null, "author": "fluffofthedevil", "saved": false, "mod_reports": [], "name": "t3_65v2ho", "subreddit_name_prefixed": "r/WritingPrompts", "approved_by": null, "over_18": false, "domain": "self.WritingPrompts", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s3nb", "edited": false, "link_flair_css_class": "flairwp", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WritingPrompts/comments/65v2ho/wp_when_youre_born_you_are_given_a_list_of_10/", "num_reports": null, "locked": false, "stickied": false, "created": 1492458493.0, "url": "https://www.reddit.com/r/WritingPrompts/comments/65v2ho/wp_when_youre_born_you_are_given_a_list_of_10/", "author_flair_text": null, "quarantine": false, "title": "[WP] When you're born you are given a list of 10 things to do before you die. When an immediate family member dies their unaccomplished tasks get passed on to you. On your 18th birthday your family dies in a car crash, leaving you to complete their lists.", "created_utc": 1492429693.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 134}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65v2ho", "likes": null, "replies": "", "user_reports": [], "id": "dgddykr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WritingPromptsRobot", "parent_id": "t3_65v2ho", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "\n**Off-Topic Discussion**: All top-level comments must be a story or poem. Reply here for other comments.\n\n#####Reminder for Writers and Readers:\n* Prompts are meant to inspire new writing.  Responses don't have to fulfill every detail.\n\n* Please remember to [be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback.\n\n---\n\n[](#icon-help)[^(What Is This?)](https://www.reddit.com/r/WritingPrompts/wiki/off_topic) [](#icon-information)[^(First Time Here?)](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) [](#icon-exclamation)[^(Special Announcements)](https://www.reddit.com/r/WritingPrompts/wiki/announcements) [](#icon-comments)[^(Click For Our Chatroom)](https://www.reddit.com/r/WritingPrompts/wiki/chat)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Off-Topic Discussion&lt;/strong&gt;: All top-level comments must be a story or poem. Reply here for other comments.&lt;/p&gt;\n\n&lt;h5&gt;Reminder for Writers and Readers:&lt;/h5&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Prompts are meant to inspire new writing.  Responses don&amp;#39;t have to fulfill every detail.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Please remember to &lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil\"&gt;be civil&lt;/a&gt; in any feedback.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"#icon-help\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/off_topic\"&gt;&lt;sup&gt;What Is This?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-information\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/user_guide\"&gt;&lt;sup&gt;First Time Here?&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-exclamation\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/announcements\"&gt;&lt;sup&gt;Special Announcements&lt;/sup&gt;&lt;/a&gt; &lt;a href=\"#icon-comments\"&gt;&lt;/a&gt;&lt;a href=\"https://www.reddit.com/r/WritingPrompts/wiki/chat\"&gt;&lt;sup&gt;Click For Our Chatroom&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgddykr", "score_hidden": true, "stickied": true, "created": 1492458523.0, "created_utc": 1492429723.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65v2ho", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65v2ho", "likes": null, "replies": "", "user_reports": [], "id": "dgdxw8i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PettyPhalange", "parent_id": "t1_dgdvbk3", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "This is really good! I didn't expect this twist, I hope you come out with a part 2 :) if not, I enjoyed the read anyways!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is really good! I didn&amp;#39;t expect this twist, I hope you come out with a part 2 :) if not, I enjoyed the read anyways!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgdxw8i", "score_hidden": true, "stickied": false, "created": 1492484588.0, "created_utc": 1492455788.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvbk3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "glamsquat", "parent_id": "t3_65v2ho", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "You wouldn't think ten things to do before you die would be difficult to accomplish, you would probably assume depending on what they are, that you could probably accomplish them in a couple of weeks, months, or maybe a couple of years quite comfortably. \n\nThe world had fallen into a hole, more depraved than before. There was less war and less general disrupt but that's only because the humans in it were too lazy to move from the comfort of their homes. A half-arsed experiment from the government had called for everyone to be given a list of ten things to do before they die in order to prevent the world becoming too quiet and no work ever being done.\n\nIt had been interesting in the beginning, people had to accept it however begrudgingly since it had become law.  \n\nI had been getting on fairly well with my list so far, making good effort to completing my second task. Since I was a fairly active person, I liked having goals to accomplish. Seeing those progress bars filling up steadily on my e-tracking page was satisfying to me at the time.\n\nThat is until my eighteenth birthday hit me at high speed and impacted my life just like the car crash that tore both my parents from my life. I was hardly left a grieving period before the government had decided to assign me to finish my parents incomplete lists. I had never seen someone else's list before, they were confidential to the individual, so it was terrifying the thought of having to take on life events another person had been supposed to complete. With both my parents lists, I now had nineteen and a half tasks left.\n\nThere was a few ways you could change your tasks. For instance, you could choose to have them customised to your career path once you had been in a certain field for three or more years and competed a certain amount of work or reputation. You could pay a whole bunch of money, or they were adapted for you if you had a life impacting incident like losing a limb.\n\nMy father had been a proud owner of a bar that was coming up on it's 15 year anniversary. He had built his tasks around the bar. For example, he had to celebrate the 15 year anniversary with a bang, own a second branch of the bar, become the highest rated bar on yelp and so on. He was not a high achiever so he had six things left to do and man, I was not looking forward to any single one of them. \n\nMy mother's list had been more interesting however. Four items left, definitely better than my dad with keeping up with the tasks. I was not expecting anything thrilling about the tasks until the words *'eliminate Charles Dowery'* on the very top. Charles Dowery was the head of council in our county. My eyes, disbelieving of what they had read, quickly took in the rest:\n\n*- create an underground information trade service*\n*- gain influence over the high court*\n*- stay undercover*\n\nOf course looking back on it now, I should've realised sooner how perfectly they two lists fit, running an underground information trade centre was a lot easier under the guise of a bar. \n\nIt was just more difficult maintaining cover with blood on your hands. \n\nNine tasks left to go. Let's just hope I'm not shot before I get them done.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You wouldn&amp;#39;t think ten things to do before you die would be difficult to accomplish, you would probably assume depending on what they are, that you could probably accomplish them in a couple of weeks, months, or maybe a couple of years quite comfortably. &lt;/p&gt;\n\n&lt;p&gt;The world had fallen into a hole, more depraved than before. There was less war and less general disrupt but that&amp;#39;s only because the humans in it were too lazy to move from the comfort of their homes. A half-arsed experiment from the government had called for everyone to be given a list of ten things to do before they die in order to prevent the world becoming too quiet and no work ever being done.&lt;/p&gt;\n\n&lt;p&gt;It had been interesting in the beginning, people had to accept it however begrudgingly since it had become law.  &lt;/p&gt;\n\n&lt;p&gt;I had been getting on fairly well with my list so far, making good effort to completing my second task. Since I was a fairly active person, I liked having goals to accomplish. Seeing those progress bars filling up steadily on my e-tracking page was satisfying to me at the time.&lt;/p&gt;\n\n&lt;p&gt;That is until my eighteenth birthday hit me at high speed and impacted my life just like the car crash that tore both my parents from my life. I was hardly left a grieving period before the government had decided to assign me to finish my parents incomplete lists. I had never seen someone else&amp;#39;s list before, they were confidential to the individual, so it was terrifying the thought of having to take on life events another person had been supposed to complete. With both my parents lists, I now had nineteen and a half tasks left.&lt;/p&gt;\n\n&lt;p&gt;There was a few ways you could change your tasks. For instance, you could choose to have them customised to your career path once you had been in a certain field for three or more years and competed a certain amount of work or reputation. You could pay a whole bunch of money, or they were adapted for you if you had a life impacting incident like losing a limb.&lt;/p&gt;\n\n&lt;p&gt;My father had been a proud owner of a bar that was coming up on it&amp;#39;s 15 year anniversary. He had built his tasks around the bar. For example, he had to celebrate the 15 year anniversary with a bang, own a second branch of the bar, become the highest rated bar on yelp and so on. He was not a high achiever so he had six things left to do and man, I was not looking forward to any single one of them. &lt;/p&gt;\n\n&lt;p&gt;My mother&amp;#39;s list had been more interesting however. Four items left, definitely better than my dad with keeping up with the tasks. I was not expecting anything thrilling about the tasks until the words &lt;em&gt;&amp;#39;eliminate Charles Dowery&amp;#39;&lt;/em&gt; on the very top. Charles Dowery was the head of council in our county. My eyes, disbelieving of what they had read, quickly took in the rest:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;- create an underground information trade service&lt;/em&gt;\n&lt;em&gt;- gain influence over the high court&lt;/em&gt;\n&lt;em&gt;- stay undercover&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Of course looking back on it now, I should&amp;#39;ve realised sooner how perfectly they two lists fit, running an underground information trade centre was a lot easier under the guise of a bar. &lt;/p&gt;\n\n&lt;p&gt;It was just more difficult maintaining cover with blood on your hands. &lt;/p&gt;\n\n&lt;p&gt;Nine tasks left to go. Let&amp;#39;s just hope I&amp;#39;m not shot before I get them done.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgdvbk3", "score_hidden": true, "stickied": false, "created": 1492481685.0, "created_utc": 1492452885.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65v2ho", "likes": null, "replies": "", "user_reports": [], "id": "dgdtev4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Oscar_Relentos", "parent_id": "t3_65v2ho", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "*They were all driving*, thought Analisa, as she dropped her phone at her feet. *to visit me.*\n\nAnalisa wandered out of her dorm room, and onto one of the larger lawns on her campus. Some students looked at her with pity, but kept walking to their classes. She brought her shaking hand to her face, and pushed her hair behind her ear. \n\nShe fell beside a tree and cried. Tears littered her pink crop top and ripped jeans. She sat there for a while, crying on occasion, and at other occasions looking up at the indifferent world walking around her. She felt a hand on her shoulder, and flinched. \n\n“I’m sorry,” said a man in a white suit. “Are you Analisa Reynolds?”\n\nShe only nodded her head, and stared with horror at the envelope in the man’s hand. \n\n“I got the phone call,” she whispered, sniffling. Her voice got weaker. “I know what happened.” \n\nThe man put his hand out. \n\n“I’m sorry my name’s Matt,” he said. She hesitated, then shook his hand weakly. “I know this is a rough time for you. I can’t imagine what kind of grief and pressure you must be feeling.” Analisa broke down again for a few minutes. He sat beside her, and put his hand on her back. She flinched. “So you know what this is?” \n\nAnalisa slowly removed the letter from Matt’s hand. \n\n“I know what this is,” she whispered, not looking at him. She took a moment. She breathed in and out, like it was a meditation session. She wiped her eyes with the backs of her hands, and ripped open the envelope. She didn’t try to be clean about it. \n\n**We regret to inform you that Camille Reynolds, Carl Reynolds, and their son Artemus Reynolds passed away last night in a ten car pileup. As you know, their obligations pass onto you as per your ancestor Anton Reynolds arrangemen-**\n\nAnalisa dropped the letter at her feet. She didn’t read the list of tasks. \n\n“Why should I suffer,” asked Analisa. “For the mistakes of my grandpa?” \n\nMatt sat closer to her. She noticed he was warm to the touch, and getting warmer.\n \n“You don't need to suffer. And it’s just one of those things you can’t control Analisa,” he said. “But I can *help* you with it all.” \n\nAnalisa looked around the campus. People cast glances at her, like they felt sorry for her. Others looked at her like she was crazy. Some just passed by that way towards their classes, and pretended they didn’t notice her talking there, with nothing in her hand. \n\nNobody looked at the man sitting beside her. \n\n“Did,” whispered Analisa, shivering. “did you kill them?” Her nostrils flared with rage. Matt shook his head. “Did you make the pileup happen.” \n\n“*No*,” whispered Matt. He put his hand on her back, and she stood up. She put her arms up too, like she hated his touch. “*I* didn’t do anything.” \n\nAnalisa’s face screamed of disgust. She looked him into his red eyes. \n\n“But you know who did,” said Analisa. She fought the urge to cry. \n\nMatt shook his head. He shook it some more, then shrugged. \n\n“They honestly did always prefer that you would be the one to do it,” said Matt. Analisa stod up and kicked at the letter. She speed-walked away from him with her arms folded. \n\n“This isn’t fair,” she said. She turned around, and felt a strange guilt for their deaths. “Why *ME* why my *FAMILY*.” \n\n“It’s just,” said Matt, appearing beside her suddenly. He looked at her with adoration. “these things happen more easily with a pretty face at the helm.” \n\n“I had my *own* list,” screamed Analisa. Some people around stared at the schizophrenic girl losing her mind. She didn’t care anymore, she was tired of hiding. “I already did my first two tasks.\" She shook her head, and shut her eyes. She whispered faintly. “I never even met my grandfather.”  \n\nMatt shushed her, and tried to hug her. She recoiled at his touch. He showed her the list once more. The letter had a golden trim. \n\n“Now the first task *I* believe you should tackle,” whispered Matt. Analisa cried on. A safe goal, it would seem. “is to reach one million Youtube followers for your Philosophy vlogs.”\n\n“What do you *want* with us,” she whispered. She remembered how the closer he came to finishing his list, the darker their household became. She thought about the men coming home in the night, with blood on their hands, taking shots with her dad. She thought about the insidious build from fortune to ruinous hell. “I won’t do what you want, not anymore. It ends with me.” \n\nMatt put on a disappointed face, though he still smiled. \n\n“There will be consequences if you don’t,” said Matt. He put on a kind voice. A fake voice. “You have a lifetime to do it, but I can’t control the others if you don’t do what we want.” \n\nAnalisa turned around, crying a river  and shouting in horror. \n\n“I *won’t* DO IT!” \n\nThere was a quiet on the campus. Everybody watched the spectacle of the crazy girl. Matt stood still a moment, then adjusted his suit jacket. He rubbed his index finger and thumb together.  \n\n“Either you do it *all*,” whispered Matt. His eyes went redder, and a white flame creeped up from his hands, and grew all around him. The ground around Analisa’s feet warmed up too. She felt her feet burn, and heard the voices of her family members wincing in her head. She shut her eyes and screamed. “or you *all* burn.” \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;They were all driving&lt;/em&gt;, thought Analisa, as she dropped her phone at her feet. &lt;em&gt;to visit me.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Analisa wandered out of her dorm room, and onto one of the larger lawns on her campus. Some students looked at her with pity, but kept walking to their classes. She brought her shaking hand to her face, and pushed her hair behind her ear. &lt;/p&gt;\n\n&lt;p&gt;She fell beside a tree and cried. Tears littered her pink crop top and ripped jeans. She sat there for a while, crying on occasion, and at other occasions looking up at the indifferent world walking around her. She felt a hand on her shoulder, and flinched. &lt;/p&gt;\n\n&lt;p&gt;“I’m sorry,” said a man in a white suit. “Are you Analisa Reynolds?”&lt;/p&gt;\n\n&lt;p&gt;She only nodded her head, and stared with horror at the envelope in the man’s hand. &lt;/p&gt;\n\n&lt;p&gt;“I got the phone call,” she whispered, sniffling. Her voice got weaker. “I know what happened.” &lt;/p&gt;\n\n&lt;p&gt;The man put his hand out. &lt;/p&gt;\n\n&lt;p&gt;“I’m sorry my name’s Matt,” he said. She hesitated, then shook his hand weakly. “I know this is a rough time for you. I can’t imagine what kind of grief and pressure you must be feeling.” Analisa broke down again for a few minutes. He sat beside her, and put his hand on her back. She flinched. “So you know what this is?” &lt;/p&gt;\n\n&lt;p&gt;Analisa slowly removed the letter from Matt’s hand. &lt;/p&gt;\n\n&lt;p&gt;“I know what this is,” she whispered, not looking at him. She took a moment. She breathed in and out, like it was a meditation session. She wiped her eyes with the backs of her hands, and ripped open the envelope. She didn’t try to be clean about it. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;We regret to inform you that Camille Reynolds, Carl Reynolds, and their son Artemus Reynolds passed away last night in a ten car pileup. As you know, their obligations pass onto you as per your ancestor Anton Reynolds arrangemen-&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Analisa dropped the letter at her feet. She didn’t read the list of tasks. &lt;/p&gt;\n\n&lt;p&gt;“Why should I suffer,” asked Analisa. “For the mistakes of my grandpa?” &lt;/p&gt;\n\n&lt;p&gt;Matt sat closer to her. She noticed he was warm to the touch, and getting warmer.&lt;/p&gt;\n\n&lt;p&gt;“You don&amp;#39;t need to suffer. And it’s just one of those things you can’t control Analisa,” he said. “But I can &lt;em&gt;help&lt;/em&gt; you with it all.” &lt;/p&gt;\n\n&lt;p&gt;Analisa looked around the campus. People cast glances at her, like they felt sorry for her. Others looked at her like she was crazy. Some just passed by that way towards their classes, and pretended they didn’t notice her talking there, with nothing in her hand. &lt;/p&gt;\n\n&lt;p&gt;Nobody looked at the man sitting beside her. &lt;/p&gt;\n\n&lt;p&gt;“Did,” whispered Analisa, shivering. “did you kill them?” Her nostrils flared with rage. Matt shook his head. “Did you make the pileup happen.” &lt;/p&gt;\n\n&lt;p&gt;“&lt;em&gt;No&lt;/em&gt;,” whispered Matt. He put his hand on her back, and she stood up. She put her arms up too, like she hated his touch. “&lt;em&gt;I&lt;/em&gt; didn’t do anything.” &lt;/p&gt;\n\n&lt;p&gt;Analisa’s face screamed of disgust. She looked him into his red eyes. &lt;/p&gt;\n\n&lt;p&gt;“But you know who did,” said Analisa. She fought the urge to cry. &lt;/p&gt;\n\n&lt;p&gt;Matt shook his head. He shook it some more, then shrugged. &lt;/p&gt;\n\n&lt;p&gt;“They honestly did always prefer that you would be the one to do it,” said Matt. Analisa stod up and kicked at the letter. She speed-walked away from him with her arms folded. &lt;/p&gt;\n\n&lt;p&gt;“This isn’t fair,” she said. She turned around, and felt a strange guilt for their deaths. “Why &lt;em&gt;ME&lt;/em&gt; why my &lt;em&gt;FAMILY&lt;/em&gt;.” &lt;/p&gt;\n\n&lt;p&gt;“It’s just,” said Matt, appearing beside her suddenly. He looked at her with adoration. “these things happen more easily with a pretty face at the helm.” &lt;/p&gt;\n\n&lt;p&gt;“I had my &lt;em&gt;own&lt;/em&gt; list,” screamed Analisa. Some people around stared at the schizophrenic girl losing her mind. She didn’t care anymore, she was tired of hiding. “I already did my first two tasks.&amp;quot; She shook her head, and shut her eyes. She whispered faintly. “I never even met my grandfather.”  &lt;/p&gt;\n\n&lt;p&gt;Matt shushed her, and tried to hug her. She recoiled at his touch. He showed her the list once more. The letter had a golden trim. &lt;/p&gt;\n\n&lt;p&gt;“Now the first task &lt;em&gt;I&lt;/em&gt; believe you should tackle,” whispered Matt. Analisa cried on. A safe goal, it would seem. “is to reach one million Youtube followers for your Philosophy vlogs.”&lt;/p&gt;\n\n&lt;p&gt;“What do you &lt;em&gt;want&lt;/em&gt; with us,” she whispered. She remembered how the closer he came to finishing his list, the darker their household became. She thought about the men coming home in the night, with blood on their hands, taking shots with her dad. She thought about the insidious build from fortune to ruinous hell. “I won’t do what you want, not anymore. It ends with me.” &lt;/p&gt;\n\n&lt;p&gt;Matt put on a disappointed face, though he still smiled. &lt;/p&gt;\n\n&lt;p&gt;“There will be consequences if you don’t,” said Matt. He put on a kind voice. A fake voice. “You have a lifetime to do it, but I can’t control the others if you don’t do what we want.” &lt;/p&gt;\n\n&lt;p&gt;Analisa turned around, crying a river  and shouting in horror. &lt;/p&gt;\n\n&lt;p&gt;“I &lt;em&gt;won’t&lt;/em&gt; DO IT!” &lt;/p&gt;\n\n&lt;p&gt;There was a quiet on the campus. Everybody watched the spectacle of the crazy girl. Matt stood still a moment, then adjusted his suit jacket. He rubbed his index finger and thumb together.  &lt;/p&gt;\n\n&lt;p&gt;“Either you do it &lt;em&gt;all&lt;/em&gt;,” whispered Matt. His eyes went redder, and a white flame creeped up from his hands, and grew all around him. The ground around Analisa’s feet warmed up too. She felt her feet burn, and heard the voices of her family members wincing in her head. She shut her eyes and screamed. “or you &lt;em&gt;all&lt;/em&gt; burn.” &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dgdtev4", "score_hidden": true, "stickied": false, "created": 1492479580.0, "created_utc": 1492450780.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s3nb", "removal_reason": null, "link_id": "t3_65v2ho", "likes": null, "replies": "", "user_reports": [], "id": "dge1hwl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GhostShadow3088", "parent_id": "t3_65v2ho", "subreddit_name_prefixed": "r/WritingPrompts", "controversiality": 0, "body": "Today was the day. The six month mourning period was over and I would be receiving the lists.\n\nI was lucky in a way, because it could have been much worse for me. My parents had life insurance, wills, and plans for their funerals so almost everything was taken care of after the accident. All I had to do was deal with the crushing pain of the loss. I got most of my little brother John’s money and possessions after taxes. He was still a minor so they just decided to pass it all on to me. I was also able to complete 6 of my ten tasks already and I was close to finishing my seventh: Graduating college. The life insurance and inheritance that was supposed to be split between me and John was very large so I’m not planning on finding a job any time soon. Maybe I would travel the world and try and complete some of the tasks before settling down for the rest of my miserable life.\n\nWith a knock at the door, I slowly rose and walked over. Opening the door, I saw three white and gold letters on the ground, each with their names. I opened my father’s first and saw that it was empty and small text saying that all ten of his tasks were complete. I then opened my mother’s and saw that she only had three left:\n\n 4: Visit Paris, 7: Become fluent in a foreign language, 10: ~~Tell my children I love them for the last time~~. \n\nThe last task on her list brought forth a stream of tears and I collapsed on the ground crying for minutes. After I had stopped, I realized that my mother had always wanted to travel but was never able to truly explore her passion after me and my brother were born. John’s was the longest. \n\n3: Find someone to love, 4: Own my dream car, 6: Explore my passions, 7: Live on the coast, 8: Live a second life, \n\n10: Wait for Marc to find me in Tahiti after the car crash.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Today was the day. The six month mourning period was over and I would be receiving the lists.&lt;/p&gt;\n\n&lt;p&gt;I was lucky in a way, because it could have been much worse for me. My parents had life insurance, wills, and plans for their funerals so almost everything was taken care of after the accident. All I had to do was deal with the crushing pain of the loss. I got most of my little brother John’s money and possessions after taxes. He was still a minor so they just decided to pass it all on to me. I was also able to complete 6 of my ten tasks already and I was close to finishing my seventh: Graduating college. The life insurance and inheritance that was supposed to be split between me and John was very large so I’m not planning on finding a job any time soon. Maybe I would travel the world and try and complete some of the tasks before settling down for the rest of my miserable life.&lt;/p&gt;\n\n&lt;p&gt;With a knock at the door, I slowly rose and walked over. Opening the door, I saw three white and gold letters on the ground, each with their names. I opened my father’s first and saw that it was empty and small text saying that all ten of his tasks were complete. I then opened my mother’s and saw that she only had three left:&lt;/p&gt;\n\n&lt;p&gt;4: Visit Paris, 7: Become fluent in a foreign language, 10: &lt;del&gt;Tell my children I love them for the last time&lt;/del&gt;. &lt;/p&gt;\n\n&lt;p&gt;The last task on her list brought forth a stream of tears and I collapsed on the ground crying for minutes. After I had stopped, I realized that my mother had always wanted to travel but was never able to truly explore her passion after me and my brother were born. John’s was the longest. &lt;/p&gt;\n\n&lt;p&gt;3: Find someone to love, 4: Own my dream car, 6: Explore my passions, 7: Live on the coast, 8: Live a second life, &lt;/p&gt;\n\n&lt;p&gt;10: Wait for Marc to find me in Tahiti after the car crash.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WritingPrompts", "name": "t1_dge1hwl", "score_hidden": true, "stickied": false, "created": 1492488667.0, "created_utc": 1492459867.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]