[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "IWantToLearn", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello Reddit,&lt;/p&gt;\n\n&lt;p&gt;One of my really big hobbies and passions is art. Given the time we&amp;#39;re living in, I&amp;#39;ve realized I&amp;#39;d like to make art that&amp;#39;s politically relevant. Specifically, art that addresses the interactions of psychology and belief (e.g. what&amp;#39;s written in The Political Mind by George Lakoff), and how political philosophy across the spectrum shapes political decisions.&lt;/p&gt;\n\n&lt;p&gt;My problem is: I&amp;#39;m a STEM guy. While I took more liberal arts classes than most STEM people in the U.S. (enough to know that STEM knowledge does not necessarily translate to political/philosophical/humanistic knowledge), I don&amp;#39;t feel like I know enough to address what I&amp;#39;d like to.&lt;/p&gt;\n\n&lt;p&gt;In particular, I feel like my critical thinking skills are lacking when I read and evaluate sources. I tend to take stuff at face value and go with what the author says. (Chalk this up to reading everything like a technical manual.) This is something I&amp;#39;m going to have to fix if I want to go further in this area.&lt;/p&gt;\n\n&lt;p&gt;I feel pretty comfortable about the art part of this. I wasn&amp;#39;t an art major, but I do make a habit of looking at art regularly to learn more about composition, coloring, etc, and I like to perform analyses in my head about how certain artistic choices influence the viewer&amp;#39;s perception of the piece.&lt;/p&gt;\n\n&lt;p&gt;Where I&amp;#39;m not comfortable is with the political and philosophical aspects of what I&amp;#39;d like to do. I feel like my education is sorely lacking in this area, and don&amp;#39;t even know if I can catch up to the caliber of, say, an average poli sci, psychology, philosophy, or (UK) PPE undergrad. I&amp;#39;m also fully aware that I&amp;#39;d probably come at things differently, being a STEM major, than someone stronger in the humanities would, and therefore my point of view on things would be different from that of many others who have studied the same material.&lt;/p&gt;\n\n&lt;p&gt;How can I learn enough about politics, political psychology, and political philosophy to make intelligent art about it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello Reddit,\n\nOne of my really big hobbies and passions is art. Given the time we're living in, I've realized I'd like to make art that's politically relevant. Specifically, art that addresses the interactions of psychology and belief (e.g. what's written in The Political Mind by George Lakoff), and how political philosophy across the spectrum shapes political decisions.\n\nMy problem is: I'm a STEM guy. While I took more liberal arts classes than most STEM people in the U.S. (enough to know that STEM knowledge does not necessarily translate to political/philosophical/humanistic knowledge), I don't feel like I know enough to address what I'd like to.\n\nIn particular, I feel like my critical thinking skills are lacking when I read and evaluate sources. I tend to take stuff at face value and go with what the author says. (Chalk this up to reading everything like a technical manual.) This is something I'm going to have to fix if I want to go further in this area.\n\nI feel pretty comfortable about the art part of this. I wasn't an art major, but I do make a habit of looking at art regularly to learn more about composition, coloring, etc, and I like to perform analyses in my head about how certain artistic choices influence the viewer's perception of the piece.\n\nWhere I'm not comfortable is with the political and philosophical aspects of what I'd like to do. I feel like my education is sorely lacking in this area, and don't even know if I can catch up to the caliber of, say, an average poli sci, psychology, philosophy, or (UK) PPE undergrad. I'm also fully aware that I'd probably come at things differently, being a STEM major, than someone stronger in the humanities would, and therefore my point of view on things would be different from that of many others who have studied the same material.\n\nHow can I learn enough about politics, political psychology, and political philosophy to make intelligent art about it?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Academics", "id": "64twt0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "notafuckinfanboy", "saved": false, "mod_reports": [], "name": "t3_64twt0", "subreddit_name_prefixed": "r/IWantToLearn", "approved_by": null, "over_18": false, "domain": "self.IWantToLearn", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rjo5", "edited": false, "link_flair_css_class": "music", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/IWantToLearn/comments/64twt0/i_want_to_make_art_that_discusses_politics/", "num_reports": null, "locked": false, "stickied": false, "created": 1491975402.0, "url": "https://www.reddit.com/r/IWantToLearn/comments/64twt0/i_want_to_make_art_that_discusses_politics/", "author_flair_text": null, "quarantine": false, "title": "I want to make art that discusses politics, political psychology, and political philosophy. And I'm a STEM major. HALP!", "created_utc": 1491946602.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]