[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "IWantToLearn", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone. I&amp;#39;m completely new to reddit so I didn&amp;#39;t know exactly where to post this question but it seemed like this would be the best place. Let me start off by saying that I am a nineteen year old community college student who wants very badly to become an artist. Over the past year I have fallen in love with art and all different kinds of visual expression.&lt;/p&gt;\n\n&lt;p&gt;The problem is that I only last year got into art. Prior to this I would rarely ever draw or practice at all. I used to draw a lot back in elementary and middle school but stopped almost completely when I got into high school. And even when I would draw it was mainly just to pass the time. I was never truly dedicated to it. As I said though over the past year I have fallen in love with art and would love to learn how to be able to do all the amazing stuff artists do. And there are so many forms of art I&amp;#39;m interested in. I really want to get into drawing, painting, comic/manga writing and illustrating, and I&amp;#39;ve even become interested in learning how to do computer art and 3D graphic simulation.&lt;/p&gt;\n\n&lt;p&gt;The problem again though is that I&amp;#39;m a complete beginner and I&amp;#39;m kind of at a loss of what to do. I feel like I&amp;#39;m at the start of climbing Mount Everest learning how to do all of this. I&amp;#39;m wondering if I should take a few art classes at my community college and I&amp;#39;m wondering about majoring in art. The trouble though is that I always thought that to get into a real art school you had to already have some talent and I have none. I only recently got back into drawing/creating again earlier this year. I am at level 0 right now but there are so many different visuals I want to create and have no idea how. I&amp;#39;m considering meeting up with a career counselor and then going to maybe talk with an art teacher at my school to get some ideas. &lt;/p&gt;\n\n&lt;p&gt;In conclusion I&amp;#39;m just worried that it&amp;#39;s too late for me. All of the people I know who were really into art have been into it since they were young children and that is not me at all. I worry that being 19 and still a beginner has ruined my chances and that I have already wasted too much time. Sorry for such a long post it&amp;#39;s just that all of this has been on my mind for a long time and I really need some advice. Where do I get started? Should I take art classes and major in art? Can I go to art school? Becoming a great artist has truly become my dream and really it is one of the few real passions I have in life. Any advice would be much appreciated.&lt;/p&gt;\n\n&lt;p&gt;Thank you guys so much!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello everyone. I'm completely new to reddit so I didn't know exactly where to post this question but it seemed like this would be the best place. Let me start off by saying that I am a nineteen year old community college student who wants very badly to become an artist. Over the past year I have fallen in love with art and all different kinds of visual expression.\n\nThe problem is that I only last year got into art. Prior to this I would rarely ever draw or practice at all. I used to draw a lot back in elementary and middle school but stopped almost completely when I got into high school. And even when I would draw it was mainly just to pass the time. I was never truly dedicated to it. As I said though over the past year I have fallen in love with art and would love to learn how to be able to do all the amazing stuff artists do. And there are so many forms of art I'm interested in. I really want to get into drawing, painting, comic/manga writing and illustrating, and I've even become interested in learning how to do computer art and 3D graphic simulation.\n\nThe problem again though is that I'm a complete beginner and I'm kind of at a loss of what to do. I feel like I'm at the start of climbing Mount Everest learning how to do all of this. I'm wondering if I should take a few art classes at my community college and I'm wondering about majoring in art. The trouble though is that I always thought that to get into a real art school you had to already have some talent and I have none. I only recently got back into drawing/creating again earlier this year. I am at level 0 right now but there are so many different visuals I want to create and have no idea how. I'm considering meeting up with a career counselor and then going to maybe talk with an art teacher at my school to get some ideas. \n\nIn conclusion I'm just worried that it's too late for me. All of the people I know who were really into art have been into it since they were young children and that is not me at all. I worry that being 19 and still a beginner has ruined my chances and that I have already wasted too much time. Sorry for such a long post it's just that all of this has been on my mind for a long time and I really need some advice. Where do I get started? Should I take art classes and major in art? Can I go to art school? Becoming a great artist has truly become my dream and really it is one of the few real passions I have in life. Any advice would be much appreciated.\n\nThank you guys so much!\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Arts/Music/DIY", "id": "65fdu3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 77, "report_reasons": null, "author": "TheLexicographer1564", "saved": false, "mod_reports": [], "name": "t3_65fdu3", "subreddit_name_prefixed": "r/IWantToLearn", "approved_by": null, "over_18": false, "domain": "self.IWantToLearn", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rjo5", "edited": 1492205864.0, "link_flair_css_class": "arts-and-crafts", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/IWantToLearn/comments/65fdu3/wondering_how_to_become_an_artist_and_have_no/", "num_reports": null, "locked": false, "stickied": false, "created": 1492234451.0, "url": "https://www.reddit.com/r/IWantToLearn/comments/65fdu3/wondering_how_to_become_an_artist_and_have_no/", "author_flair_text": null, "quarantine": false, "title": "Wondering How to Become an Artist and Have No Idea Where to get Started.", "created_utc": 1492205651.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 77}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": "", "user_reports": [], "id": "dgacl0r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rocksteady2R", "parent_id": "t1_dgabmm5", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "Well, There we go, eh?  Good luck, OP!  Who'da thunk it.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, There we go, eh?  Good luck, OP!  Who&amp;#39;da thunk it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgacl0r", "score_hidden": false, "stickied": false, "created": 1492263899.0, "created_utc": 1492235099.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgabmm5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "LightBerry81", "parent_id": "t1_dg9x8do", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "Also consider r/artfundamentals", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also consider &lt;a href=\"/r/artfundamentals\"&gt;r/artfundamentals&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgabmm5", "score_hidden": false, "stickied": false, "created": 1492261970.0, "created_utc": 1492233170.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9x8do", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "Rocksteady2R", "parent_id": "t3_65fdu3", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "(A)  you said magic words when you mentioned you were already going to community college.\n\n(B)  Next Semester sign up for Drawing 1, and a class called \"2d Design\" (or Elements of Design or some such).  \n\nThe good thing is art is a learnable skill.  \"Being an artist\" - well, we can debate about what an artist is, but anyone can learn the skills.  Drawing classes get you skills at representing accurate images - and that's one of the secrets of good abstract artists.  They might just lines and blotches, but 98% of really excellent abstract artists have the technical capability to draw really well.  So even if realism isn't \"your style\", it is still fundamentally important to the portfolio/life.  There are a lot of functional \"technical\" aspects to a good painting - an artist knows how to focus teh viewer on a given thing, and even then keep his eye moving around the canvas.  They know about visual balances, and why you can match A big dark square with a few little orange squiggly lines.  Shit, humanity itself didn't start drawing with perspective till what, a couple hundred measly years ago?  You've got some basics to learn.\n\nBefore, during, and after that class, just carry around a notebook with you and practice drawing.  Boring bus-ride?  draw the lady's hat in front of you.  Wasting time in the parking lot waiting on a friend who's late?  practice drawing that Corolla over there.  Set up still-life's at the house to draw.  Skill and ability is a direct correlation to time spent practicing.  Yeas, yeas, when we were all in the 4th grade, there was always that one guy or gal who drew amazing pictures - But if you look at that person now, and the kid who started at 19 and dedicates himself for a chunk a day to drawing, at the age of 30 they're spitting out the same quality of stuff (all other things being equal).\n\n\nI would also start investing in a few art books - not how-to's, but coffee table books that focus on one or another theme/style/broad genre.  Art is only positively influenced by other art, in my humble opinion, and as a young kid, you want to see a wide variety to open up that perspective.\n\nTo answer your direct questions from the end of the post:\n\n(C)  dont worry about age.  19 is a grand old time to be a young artist.  Your mind will be regularly blown away by the shit you see for years  to come.\n\n(D)  Get started at your CC.  that and the rest of your normal life.  if you normally take the dog to the dog park, bring your notepad next time.  hiker?  go hiking with the pad.  Video-gamer with roommates?  start drawing them and the bong on the table.  whatever.  \n\n(D.2)  definitely take art classes - you gotta learn that shit somewhere.   Majoring in art - if you end up wanting to go to a proper art school, go for it, but you've got a lot of research to do on what they're looking for in admissions.  I don't know that answer, so i don't want to go to far into the unknown.\n\nI'd focus on what's in front of you for now.  Get yourself drawing, then take it from there.\n\non an aside - I also *highly* recommend sculpture and pottery classes.  some form of 3d art.  really rounds out some skill-sets, and is just plain fun to 'build' things.  Maybe wait a semester or two, but don't neglect that 3rd dimension.\n\nYou can even start with a \"how to draw comic books\" book - ludicrous imagery, generally, but they can draw.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(A)  you said magic words when you mentioned you were already going to community college.&lt;/p&gt;\n\n&lt;p&gt;(B)  Next Semester sign up for Drawing 1, and a class called &amp;quot;2d Design&amp;quot; (or Elements of Design or some such).  &lt;/p&gt;\n\n&lt;p&gt;The good thing is art is a learnable skill.  &amp;quot;Being an artist&amp;quot; - well, we can debate about what an artist is, but anyone can learn the skills.  Drawing classes get you skills at representing accurate images - and that&amp;#39;s one of the secrets of good abstract artists.  They might just lines and blotches, but 98% of really excellent abstract artists have the technical capability to draw really well.  So even if realism isn&amp;#39;t &amp;quot;your style&amp;quot;, it is still fundamentally important to the portfolio/life.  There are a lot of functional &amp;quot;technical&amp;quot; aspects to a good painting - an artist knows how to focus teh viewer on a given thing, and even then keep his eye moving around the canvas.  They know about visual balances, and why you can match A big dark square with a few little orange squiggly lines.  Shit, humanity itself didn&amp;#39;t start drawing with perspective till what, a couple hundred measly years ago?  You&amp;#39;ve got some basics to learn.&lt;/p&gt;\n\n&lt;p&gt;Before, during, and after that class, just carry around a notebook with you and practice drawing.  Boring bus-ride?  draw the lady&amp;#39;s hat in front of you.  Wasting time in the parking lot waiting on a friend who&amp;#39;s late?  practice drawing that Corolla over there.  Set up still-life&amp;#39;s at the house to draw.  Skill and ability is a direct correlation to time spent practicing.  Yeas, yeas, when we were all in the 4th grade, there was always that one guy or gal who drew amazing pictures - But if you look at that person now, and the kid who started at 19 and dedicates himself for a chunk a day to drawing, at the age of 30 they&amp;#39;re spitting out the same quality of stuff (all other things being equal).&lt;/p&gt;\n\n&lt;p&gt;I would also start investing in a few art books - not how-to&amp;#39;s, but coffee table books that focus on one or another theme/style/broad genre.  Art is only positively influenced by other art, in my humble opinion, and as a young kid, you want to see a wide variety to open up that perspective.&lt;/p&gt;\n\n&lt;p&gt;To answer your direct questions from the end of the post:&lt;/p&gt;\n\n&lt;p&gt;(C)  dont worry about age.  19 is a grand old time to be a young artist.  Your mind will be regularly blown away by the shit you see for years  to come.&lt;/p&gt;\n\n&lt;p&gt;(D)  Get started at your CC.  that and the rest of your normal life.  if you normally take the dog to the dog park, bring your notepad next time.  hiker?  go hiking with the pad.  Video-gamer with roommates?  start drawing them and the bong on the table.  whatever.  &lt;/p&gt;\n\n&lt;p&gt;(D.2)  definitely take art classes - you gotta learn that shit somewhere.   Majoring in art - if you end up wanting to go to a proper art school, go for it, but you&amp;#39;ve got a lot of research to do on what they&amp;#39;re looking for in admissions.  I don&amp;#39;t know that answer, so i don&amp;#39;t want to go to far into the unknown.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d focus on what&amp;#39;s in front of you for now.  Get yourself drawing, then take it from there.&lt;/p&gt;\n\n&lt;p&gt;on an aside - I also &lt;em&gt;highly&lt;/em&gt; recommend sculpture and pottery classes.  some form of 3d art.  really rounds out some skill-sets, and is just plain fun to &amp;#39;build&amp;#39; things.  Maybe wait a semester or two, but don&amp;#39;t neglect that 3rd dimension.&lt;/p&gt;\n\n&lt;p&gt;You can even start with a &amp;quot;how to draw comic books&amp;quot; book - ludicrous imagery, generally, but they can draw.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dg9x8do", "score_hidden": false, "stickied": false, "created": 1492240785.0, "created_utc": 1492211985.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": "", "user_reports": [], "id": "dgacmdb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rocksteady2R", "parent_id": "t1_dg9zrx7", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "That is super awesome.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is super awesome.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgacmdb", "score_hidden": false, "stickied": false, "created": 1492263978.0, "created_utc": 1492235178.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9zrx7", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Srx_Gryphon", "parent_id": "t3_65fdu3", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "Remember this and follow this rule with your life:\n\n&gt; “All of you here have one hundred thousand bad drawings in you. The sooner you get rid of them, the better it will be for everyone.\" - Chuck Jones, Animator", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Remember this and follow this rule with your life:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“All of you here have one hundred thousand bad drawings in you. The sooner you get rid of them, the better it will be for everyone.&amp;quot; - Chuck Jones, Animator&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dg9zrx7", "score_hidden": false, "stickied": false, "created": 1492244157.0, "created_utc": 1492215357.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": "", "user_reports": [], "id": "dg9y1xj", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "whuttupfoo", "parent_id": "t3_65fdu3", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "Hey dude I'm about to be 29 and I started doing art last year and in under a year I'm now a full time artist. You can do it right now, you don't need to be extremely skilled, start from zero skills and show your work on social media on a consistent basis. There are people making a living even doing elementary school style line drawing art. There's no age limit when it comes to starting an art career. \n\nThe way to get started is to literally pick up a pen, or whatever medium you're using and start creating. When it's done, share it on IG, Tumblr, Etc, even if it looks like shit. You can improve on the way while your following grows, by watching YouTube tutorials, reading up on artist interviews, seeing how other people made a living out of it. Asking others how they did it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey dude I&amp;#39;m about to be 29 and I started doing art last year and in under a year I&amp;#39;m now a full time artist. You can do it right now, you don&amp;#39;t need to be extremely skilled, start from zero skills and show your work on social media on a consistent basis. There are people making a living even doing elementary school style line drawing art. There&amp;#39;s no age limit when it comes to starting an art career. &lt;/p&gt;\n\n&lt;p&gt;The way to get started is to literally pick up a pen, or whatever medium you&amp;#39;re using and start creating. When it&amp;#39;s done, share it on IG, Tumblr, Etc, even if it looks like shit. You can improve on the way while your following grows, by watching YouTube tutorials, reading up on artist interviews, seeing how other people made a living out of it. Asking others how they did it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dg9y1xj", "score_hidden": false, "stickied": false, "created": 1492241854.0, "created_utc": 1492213054.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": "", "user_reports": [], "id": "dg9vrcl", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "koljam", "parent_id": "t3_65fdu3", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "Go to a career counsellor and tell them this. \n\nOf cause you have to follow your dreams, but I can almost guarantee, that you will not be able to make a living as a free artist, unless you improve by 1000% in the next year. \nDid you think about going into 3D graphics for games and films and so on? Maybe this would be a compromise between art and earning money. You can always realise your artworks in your freetime. And 3D Design is something you can learn later in life. \nBut ask people, teachers, art students, artists and build your own plan for what to do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go to a career counsellor and tell them this. &lt;/p&gt;\n\n&lt;p&gt;Of cause you have to follow your dreams, but I can almost guarantee, that you will not be able to make a living as a free artist, unless you improve by 1000% in the next year. \nDid you think about going into 3D graphics for games and films and so on? Maybe this would be a compromise between art and earning money. You can always realise your artworks in your freetime. And 3D Design is something you can learn later in life. \nBut ask people, teachers, art students, artists and build your own plan for what to do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dg9vrcl", "score_hidden": false, "stickied": false, "created": 1492238812.0, "created_utc": 1492210012.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": "", "user_reports": [], "id": "dgaoujr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kirbyderwood", "parent_id": "t3_65fdu3", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "I switched to an art career in my 30s.  19 is not too late at all.\n\nStart taking art classes.  Draw a lot.  Get good critiques of your work.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I switched to an art career in my 30s.  19 is not too late at all.&lt;/p&gt;\n\n&lt;p&gt;Start taking art classes.  Draw a lot.  Get good critiques of your work.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgaoujr", "score_hidden": false, "stickied": false, "created": 1492294858.0, "created_utc": 1492266058.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": "", "user_reports": [], "id": "dga4rss", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "areolaebola", "parent_id": "t3_65fdu3", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "I have negative talent with art, but I took a class on making Mandalas and it helped me see textures in a different way and gave me the confidence to draw more for fun than for ability. \n\nBasically you draw a draw a horizontal line in the middle of the page. Then bisect it with a vertical line in the middle of the page. Then draw concentric circles with the center being where those lines intersect. Then you make designs that connect the circles in repetitive patterns. \n\nIt really helped me to develop the more artistic side of my brain. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have negative talent with art, but I took a class on making Mandalas and it helped me see textures in a different way and gave me the confidence to draw more for fun than for ability. &lt;/p&gt;\n\n&lt;p&gt;Basically you draw a draw a horizontal line in the middle of the page. Then bisect it with a vertical line in the middle of the page. Then draw concentric circles with the center being where those lines intersect. Then you make designs that connect the circles in repetitive patterns. &lt;/p&gt;\n\n&lt;p&gt;It really helped me to develop the more artistic side of my brain. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dga4rss", "score_hidden": false, "stickied": false, "created": 1492250983.0, "created_utc": 1492222183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": "", "user_reports": [], "id": "dgahbsz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "darknessvisible", "parent_id": "t3_65fdu3", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "It's never too late, and 19 is nothing.  You are also not at level 0 because you love Art, and desire is worth a far greater multiplier than rote practice.  \n\nYou are making a wise decision to become an artist because it is one of the few professions that will never be replaced by automation (well, commercial art will, but that's not what art connoisseurs want - they want original, unrepeatable images that can only be produced by a human that at some level represents their, and others', life experiences).  \n\nQualifications mean zero, so concentrate on finding your artistic vision rather than struggling to fulfil entrance requirements.  Find a mentor whom you respect and admire and who is encouraging, friendly and helpful, but also tough on you when he/she needs to be.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s never too late, and 19 is nothing.  You are also not at level 0 because you love Art, and desire is worth a far greater multiplier than rote practice.  &lt;/p&gt;\n\n&lt;p&gt;You are making a wise decision to become an artist because it is one of the few professions that will never be replaced by automation (well, commercial art will, but that&amp;#39;s not what art connoisseurs want - they want original, unrepeatable images that can only be produced by a human that at some level represents their, and others&amp;#39;, life experiences).  &lt;/p&gt;\n\n&lt;p&gt;Qualifications mean zero, so concentrate on finding your artistic vision rather than struggling to fulfil entrance requirements.  Find a mentor whom you respect and admire and who is encouraging, friendly and helpful, but also tough on you when he/she needs to be.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgahbsz", "score_hidden": false, "stickied": false, "created": 1492276367.0, "created_utc": 1492247567.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": "", "user_reports": [], "id": "dgb31ya", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "galaxybean", "parent_id": "t3_65fdu3", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "It's alot take in about your situation but don't worry I was in a similar situation as you at one point.\n\n1)Where do I get started?\nGo get yourself a Sketchbook (nothing too fancy just as long as the paper is decent) preferably a size you can carry with you whenever you get the urge to draw.Also get a portable pencil case with whatever you like to draw with.\n\nNow this is the part where ALOT of artists will tell beginners like you to study the fundamentals like anatomy,color theory,etc but being an artist myself I think this will lower your enthusiasm for drawing so instead draw what you like, you'll learn the fundamentals you go along.\n\nDate everything you draw (trust me you'll regret it later  and don't throw away anything you you'll want to be able to look at one year from now and actually see your improvement.\n\nAnd one FINAL PIECE OF ADVICE: There will be days where you'll get frustrated,feeling like you're the worst artist in the world,inferior,etc. It will happen and it's the worst feeling in the world,but just remember THIS IS NORMAL .Take a break,watch a movie,just step away from drawing BUT DO NOT STOP DRAWING.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s alot take in about your situation but don&amp;#39;t worry I was in a similar situation as you at one point.&lt;/p&gt;\n\n&lt;p&gt;1)Where do I get started?\nGo get yourself a Sketchbook (nothing too fancy just as long as the paper is decent) preferably a size you can carry with you whenever you get the urge to draw.Also get a portable pencil case with whatever you like to draw with.&lt;/p&gt;\n\n&lt;p&gt;Now this is the part where ALOT of artists will tell beginners like you to study the fundamentals like anatomy,color theory,etc but being an artist myself I think this will lower your enthusiasm for drawing so instead draw what you like, you&amp;#39;ll learn the fundamentals you go along.&lt;/p&gt;\n\n&lt;p&gt;Date everything you draw (trust me you&amp;#39;ll regret it later  and don&amp;#39;t throw away anything you you&amp;#39;ll want to be able to look at one year from now and actually see your improvement.&lt;/p&gt;\n\n&lt;p&gt;And one FINAL PIECE OF ADVICE: There will be days where you&amp;#39;ll get frustrated,feeling like you&amp;#39;re the worst artist in the world,inferior,etc. It will happen and it&amp;#39;s the worst feeling in the world,but just remember THIS IS NORMAL .Take a break,watch a movie,just step away from drawing BUT DO NOT STOP DRAWING.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgb31ya", "score_hidden": false, "stickied": false, "created": 1492314670.0, "created_utc": 1492285870.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": "", "user_reports": [], "id": "dgb9rrg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Vladthepaler", "parent_id": "t3_65fdu3", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "/r/artfundementals\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/artfundementals\"&gt;/r/artfundementals&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgb9rrg", "score_hidden": false, "stickied": false, "created": 1492323962.0, "created_utc": 1492295162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65fdu3", "likes": null, "replies": "", "user_reports": [], "id": "dga9ynf", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "wendysNO1wcheese", "parent_id": "t3_65fdu3", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "This will definitely work out well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This will definitely work out well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dga9ynf", "score_hidden": false, "stickied": false, "created": 1492258999.0, "created_utc": 1492230199.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]