[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "IWantToLearn", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;&amp;quot;Not everything that counts can be counted and not everything that can be counted counts.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;— William Bruce Cameron&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;There comes a time in which each of us has to feel successful, regardless of what we are doing. Failure to do so often brings with it a lot of issues.&lt;/p&gt;\n\n&lt;p&gt;Whether it is that you believe that you are doing something valuable, paving the way to a better life, or helping someone you cherish, at some point you have to feel you&amp;#39;ve achieved something worthwhile. I say feel instead of know, because it&amp;#39;s often more difficult to feel than to know, as feeling is intangible and you have nothing to vouch for it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to share with you four aspects that I believe are critical to take care of not only for being successful, but also feeling as a successful guitar player. I also believe these can be applied to many more activities in life.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Motivation&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I first started playing when I was around 15 years old. I had started following bands like Nirvana, Guns &amp;#39;n&amp;#39; Roses, Aerosmith, and others for quite a while.  Nirvana was the first band which I considered myself to be a fan of. I was looking for their albums and slowly, but surely, got them all.&lt;/p&gt;\n\n&lt;p&gt;This was definitely a motivation for me. I thought that rock music was a blast and so I thought that playing it would be even better.&lt;/p&gt;\n\n&lt;p&gt;That and...I also wanted to be &lt;em&gt;that cool guy in a band&lt;/em&gt; and be popular. There, I said it. So sue me.&lt;/p&gt;\n\n&lt;p&gt;Then again, it would have been very different if I had learned at 20, 25, or even 30 years old.&lt;/p&gt;\n\n&lt;p&gt;Of course it would be different! Our interests vary a lot with our age, as well as with other aspects such as culture, lifestyle, etc.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s important that you define your motivation regardless. Knowing just what it is that attracts you to the instrument will make be key to identifying (and preventing) apathy towards the guitar, which is actually quite common. You surely know the case of many that had similar motivations to mine as a 15-year-old, only to then quit the instrument completely years later. Yes, I know a few.&lt;/p&gt;\n\n&lt;p&gt;With this I do not mean to say that you don&amp;#39;t have to quit if you really want to. Sometimes you just lose interest, and that&amp;#39;s fine. What I want you to do is never to quit because you lack the drive to keep going, while still wanting to play deep within you. You know the feeling, I&amp;#39;m sure.&lt;/p&gt;\n\n&lt;p&gt;My recommendation for this is to find out what it is that motivates you, and write it down somewhere. You can use an app on your phone to take notes, or just use a simple old-school paper. The reason to do so is that it is useful to have it written down so that it&amp;#39;s easy to know if your motivation changes over time. It&amp;#39;s fine if it does, but if it does (which will most likely happen) it&amp;#39;s often the sign that you will have to change something in your practice.&lt;/p&gt;\n\n&lt;p&gt;I think in most cases it&amp;#39;s quite easy to find out what your motivation is. If you feel like you don&amp;#39;t know exactly where your motivation draws from, I&amp;#39;ll write a new post on this in the future and let you know.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Goals&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is quite similar to the motivation topic we just talked about, but I believe the differentiation is in order. Let me explain why.&lt;/p&gt;\n\n&lt;p&gt;The motivation back in my teens was to make music like my idols did. I also mentioned that I wanted to be cool and popular; this is actually what one of my goals was back then. Of course, I did not really think about it at the time, but somehow I knew it.&lt;/p&gt;\n\n&lt;p&gt;Knowing your goals is important in addition to your motivation, because it helps to put an objective for you to focus on.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s impossible to attain something without you knowing what it actually is. A good plan requires you to know exactly what your end goal is, so that you can know what you need to do to fulfill it.&lt;/p&gt;\n\n&lt;p&gt;An olympic runner that just wants to &amp;quot;run as fast as possible&amp;quot; will have a very hard time knowing if they are accomplishing anything because they don&amp;#39;t really have anything to compare their performance to. If that same runner wants to beat the World record for the 400 mts sprint, now that&amp;#39;s a game changer, because that way it becomes clear how off his performance is to attaining that goal, and can start training towards achieving it.&lt;/p&gt;\n\n&lt;p&gt;As a guitar player, you are not exent of doing the same thing. You have to determine what your goals are, such as:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Learn to play the songs of your favorite band.&lt;/li&gt;\n&lt;li&gt;Have fun playing by yourself.&lt;/li&gt;\n&lt;li&gt;Make a band and record an album.&lt;/li&gt;\n&lt;li&gt;Become a rockstar.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Sometimes it&amp;#39;s important to do some careful insight, but in all cases you have to be honest with yourself. If you really want to be a rockstar, don&amp;#39;t be afraid to acknowledge it. This is a selfish determination; it cannot come from others. Of course, this does not mean that your goal cannot be altruistic, such as playing songs for kids at hospitals; that is fine, but be sure that that is what you really want to accomplish.&lt;/p&gt;\n\n&lt;p&gt;There are many authors that agree that your goals should not only be written down, like we said about that which motivates you, but they should also be visible. Some recommend you even write them down in post-its and put them where you hang out in your home (stick them to your computer&amp;#39;s monitor for instance). If done correctly, doing this can serve as positive self-talk, which is incredibly powerful.&lt;/p&gt;\n\n&lt;p&gt;I recommend you write your goals together with your motivator. As some of us might have awkward motivators and goals (for example, to impress someone), if you are going to write them down somewhere visible, try not to leave them in common areas in your home, and stick to your bedroom, where not just anyone will see it. If, however, you don&amp;#39;t want your significant other to read them...touché...maybe write them down on your phone and set them as wallpaper. Whatever works.&lt;/p&gt;\n\n&lt;p&gt;Goals are usually not supposed to be immutable. It&amp;#39;s very likely that they will change in time, which can be further (an improvement on your current ones) or more modest (a downgrade of your actual goals). Both changes are fine, provided you have a reason to do so, of course.&lt;/p&gt;\n\n&lt;p&gt;Sometimes you might realize that what you thought was your goal turned out to require too much dedication which you had not anticipated. If that is your case, it&amp;#39;s perfectly fine to choose a more modest goal. If you want to be a rockstar but find it too hard, you might want to aim for getting your record out there.&lt;/p&gt;\n\n&lt;p&gt;Other times, you might find out that you reach your goal and want to go further because you feel you have more to give. You could be aiming to play your favorite band&amp;#39;s songs but then decide to start composing your own songs. This is one of the best feelings for any guitar player, which is equal to exceeding your expectations.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Plan &amp;amp; Track&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;By now, you should have determined what moves you and how long you want to go. Now, it&amp;#39;s time to put in the work.&lt;/p&gt;\n\n&lt;p&gt;I never said it would be effortless, did I? Laying your groundwork is crucial to knowing how to move forward, and in this step, you will need to work out the things you&amp;#39;ll need to learn to reach your goals.&lt;/p&gt;\n\n&lt;p&gt;Of course, if you are completely new to guitar playing, you&amp;#39;ll need help to establishing your needs; this is fine. If you are already experienced, most of the times you can sort this out with some research.&lt;/p&gt;\n\n&lt;p&gt;You can get some help from a teacher. You can choose to go to in-person classes or teach by yourself with books, videos, or online resources. I do not recommend you try to learn completely by yourself, as I do not believe in re-inventing the wheel.&lt;/p&gt;\n\n&lt;p&gt;The best resource is an in-person teacher. Provided you choose a good teacher, surely. I will write a blog post on how to tell if a teacher is right for you. A good teacher will be able to guide you and help you learn what you need to learn, and what you can ignore, as well as watch you play and identify any problems first-hand. The drawbacks are that they tend to be pricy and require you to have classes at a specific time and place with less flexibility.&lt;/p&gt;\n\n&lt;p&gt;The next best choice is an online resource that has access to a teacher for consultation. This is helpful because you can get some of the benefits of having a teacher with you which can guide you with multiple kinds of content, like video courses and audio that can be specifically tailored to your goals, but can also notice if you are commiting any gross errors before they are ingrained into you. The drawback are that it&amp;#39;s not as effective as having a teacher right with you, but are cheaper and more flexible in your time schedules.&lt;/p&gt;\n\n&lt;p&gt;The last choice is to learn completely by yourself using non-responsive material like books. The advantage of this method is that you get the most flexibility and is usually the cheapest method, but you will lack guidance and it can usually be difficult to get the right book for exactly what you want to accomplish. It is still a feasible course of action; famous guitarists like Eric Clapton and Jimi Hendrix are self taught, and there is no denying the impact they had on the world of music.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve now established how to have a plan. As the Deming Circle states, after planning and executing, you need to check that you are moving forward towards your goals, and make sure you are not stagnating or moving in another direction.&lt;/p&gt;\n\n&lt;p&gt;Tracking your progress can be tricky. Some steps are difficult to quantify, and so are not easy to determine how much you are improving your required skills. Sometimes you have to dangerously walk the path of subjective evaluation. I mean this is dangerous because when you can measure, there is no error, but if the determination resides on you making an educated guess...that is another story.&lt;/p&gt;\n\n&lt;p&gt;Whatever your situation is, you need to come up with a way to determine whether you are progressing or not. Failure to do so can tackle your motivation to keep moving forward, and you don&amp;#39;t want to fight that Chimera.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Consistency&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;You&amp;#39;ll get more results from a mediocre workout plan executed with consistency than with the best plan in the world executed poorly.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t remember where I first read that phrase. It just stuck with me for good, especially when I found out that it applies to virtually everything in our lives. Yes, even to guitar playing.&lt;/p&gt;\n\n&lt;p&gt;Up to this point, we&amp;#39;ve talked about how to develop a good groundwork to achieve our goals. The only aspect left to cover is that all this work we&amp;#39;ve done so far has to be carried out consistently, or else it will hardly get you anywhere.&lt;/p&gt;\n\n&lt;p&gt;Luck is a weird thing. Some people seem to have it, and others just don&amp;#39;t. However, I&amp;#39;ve discovered an interesting truth:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Luck not only favors the bold, but those who continually seek it.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This means that you cannot just wait doing nothing for luck/inspiration to suddenly strike you, rather you have to work at it continually to create the conditions that will allow luck to come to you. For our purposes, this means that you must be really dedicated to it, almost relentlessly.&lt;/p&gt;\n\n&lt;p&gt;Practicing for 10 hours one day and then nothing for weeks is no use. Instead, aim for shorter, more frequent practice sessions. Practicing every day is great, but there is a fine line between good practice and too much practice. Yes, believe it or not, there is a thing as too much practice.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;No pain, no gain, but enough pain is enough gain.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;As a general thumbrule, I recommend taking at least a day off per week to rest, as well as not stretching more than one hour at a time of intense practice. Of course, there are exceptions.&lt;/p&gt;\n\n&lt;p&gt;Also, depending on your goals, you might need more consistency. If you want to be a master shredder, you&amp;#39;ll need the most intensive practice sessions, as you&amp;#39;ll need to strenghten a lot of muscles that are not used normally, as well as a very deep concentration and coordination.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I&amp;#39;m certain these tips will help you go as far as you want to go, wherever that is.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d like to hear what you have to say. Comment below and let me know.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "*\"Not everything that counts can be counted and not everything that can be counted counts.\"*\n\n*— William Bruce Cameron*\n \n\nThere comes a time in which each of us has to feel successful, regardless of what we are doing. Failure to do so often brings with it a lot of issues.\n\nWhether it is that you believe that you are doing something valuable, paving the way to a better life, or helping someone you cherish, at some point you have to feel you've achieved something worthwhile. I say feel instead of know, because it's often more difficult to feel than to know, as feeling is intangible and you have nothing to vouch for it.\n\nI'm going to share with you four aspects that I believe are critical to take care of not only for being successful, but also feeling as a successful guitar player. I also believe these can be applied to many more activities in life.\n\n-----------------------------------------------------------------------\n**Motivation**\n\nI first started playing when I was around 15 years old. I had started following bands like Nirvana, Guns 'n' Roses, Aerosmith, and others for quite a while.  Nirvana was the first band which I considered myself to be a fan of. I was looking for their albums and slowly, but surely, got them all.\n\nThis was definitely a motivation for me. I thought that rock music was a blast and so I thought that playing it would be even better.\n\n\nThat and...I also wanted to be *that cool guy in a band* and be popular. There, I said it. So sue me.\n\nThen again, it would have been very different if I had learned at 20, 25, or even 30 years old.\n\nOf course it would be different! Our interests vary a lot with our age, as well as with other aspects such as culture, lifestyle, etc.\n\nIt's important that you define your motivation regardless. Knowing just what it is that attracts you to the instrument will make be key to identifying (and preventing) apathy towards the guitar, which is actually quite common. You surely know the case of many that had similar motivations to mine as a 15-year-old, only to then quit the instrument completely years later. Yes, I know a few.\n \nWith this I do not mean to say that you don't have to quit if you really want to. Sometimes you just lose interest, and that's fine. What I want you to do is never to quit because you lack the drive to keep going, while still wanting to play deep within you. You know the feeling, I'm sure.\n \nMy recommendation for this is to find out what it is that motivates you, and write it down somewhere. You can use an app on your phone to take notes, or just use a simple old-school paper. The reason to do so is that it is useful to have it written down so that it's easy to know if your motivation changes over time. It's fine if it does, but if it does (which will most likely happen) it's often the sign that you will have to change something in your practice.\n \nI think in most cases it's quite easy to find out what your motivation is. If you feel like you don't know exactly where your motivation draws from, I'll write a new post on this in the future and let you know.\n\n-----------------------------------------------------------------------\n**Goals**\n \nThis is quite similar to the motivation topic we just talked about, but I believe the differentiation is in order. Let me explain why.\n \nThe motivation back in my teens was to make music like my idols did. I also mentioned that I wanted to be cool and popular; this is actually what one of my goals was back then. Of course, I did not really think about it at the time, but somehow I knew it.\n \nKnowing your goals is important in addition to your motivation, because it helps to put an objective for you to focus on.\n \nIt's impossible to attain something without you knowing what it actually is. A good plan requires you to know exactly what your end goal is, so that you can know what you need to do to fulfill it.\n \nAn olympic runner that just wants to \"run as fast as possible\" will have a very hard time knowing if they are accomplishing anything because they don't really have anything to compare their performance to. If that same runner wants to beat the World record for the 400 mts sprint, now that's a game changer, because that way it becomes clear how off his performance is to attaining that goal, and can start training towards achieving it.\n \nAs a guitar player, you are not exent of doing the same thing. You have to determine what your goals are, such as:\n \n* Learn to play the songs of your favorite band.\n* Have fun playing by yourself.\n* Make a band and record an album.\n* Become a rockstar.\n\nSometimes it's important to do some careful insight, but in all cases you have to be honest with yourself. If you really want to be a rockstar, don't be afraid to acknowledge it. This is a selfish determination; it cannot come from others. Of course, this does not mean that your goal cannot be altruistic, such as playing songs for kids at hospitals; that is fine, but be sure that that is what you really want to accomplish.\n\nThere are many authors that agree that your goals should not only be written down, like we said about that which motivates you, but they should also be visible. Some recommend you even write them down in post-its and put them where you hang out in your home (stick them to your computer's monitor for instance). If done correctly, doing this can serve as positive self-talk, which is incredibly powerful.\n\nI recommend you write your goals together with your motivator. As some of us might have awkward motivators and goals (for example, to impress someone), if you are going to write them down somewhere visible, try not to leave them in common areas in your home, and stick to your bedroom, where not just anyone will see it. If, however, you don't want your significant other to read them...touché...maybe write them down on your phone and set them as wallpaper. Whatever works.\n \nGoals are usually not supposed to be immutable. It's very likely that they will change in time, which can be further (an improvement on your current ones) or more modest (a downgrade of your actual goals). Both changes are fine, provided you have a reason to do so, of course.\n \nSometimes you might realize that what you thought was your goal turned out to require too much dedication which you had not anticipated. If that is your case, it's perfectly fine to choose a more modest goal. If you want to be a rockstar but find it too hard, you might want to aim for getting your record out there.\n \nOther times, you might find out that you reach your goal and want to go further because you feel you have more to give. You could be aiming to play your favorite band's songs but then decide to start composing your own songs. This is one of the best feelings for any guitar player, which is equal to exceeding your expectations.\n\n-----------------------------------------------------------------------\n**Plan &amp; Track**\n\nBy now, you should have determined what moves you and how long you want to go. Now, it's time to put in the work.\n\nI never said it would be effortless, did I? Laying your groundwork is crucial to knowing how to move forward, and in this step, you will need to work out the things you'll need to learn to reach your goals.\n\nOf course, if you are completely new to guitar playing, you'll need help to establishing your needs; this is fine. If you are already experienced, most of the times you can sort this out with some research.\n\nYou can get some help from a teacher. You can choose to go to in-person classes or teach by yourself with books, videos, or online resources. I do not recommend you try to learn completely by yourself, as I do not believe in re-inventing the wheel.\n\n \nThe best resource is an in-person teacher. Provided you choose a good teacher, surely. I will write a blog post on how to tell if a teacher is right for you. A good teacher will be able to guide you and help you learn what you need to learn, and what you can ignore, as well as watch you play and identify any problems first-hand. The drawbacks are that they tend to be pricy and require you to have classes at a specific time and place with less flexibility.\n \nThe next best choice is an online resource that has access to a teacher for consultation. This is helpful because you can get some of the benefits of having a teacher with you which can guide you with multiple kinds of content, like video courses and audio that can be specifically tailored to your goals, but can also notice if you are commiting any gross errors before they are ingrained into you. The drawback are that it's not as effective as having a teacher right with you, but are cheaper and more flexible in your time schedules.\n \nThe last choice is to learn completely by yourself using non-responsive material like books. The advantage of this method is that you get the most flexibility and is usually the cheapest method, but you will lack guidance and it can usually be difficult to get the right book for exactly what you want to accomplish. It is still a feasible course of action; famous guitarists like Eric Clapton and Jimi Hendrix are self taught, and there is no denying the impact they had on the world of music.\n \nWe've now established how to have a plan. As the Deming Circle states, after planning and executing, you need to check that you are moving forward towards your goals, and make sure you are not stagnating or moving in another direction.\n \nTracking your progress can be tricky. Some steps are difficult to quantify, and so are not easy to determine how much you are improving your required skills. Sometimes you have to dangerously walk the path of subjective evaluation. I mean this is dangerous because when you can measure, there is no error, but if the determination resides on you making an educated guess...that is another story.\n \nWhatever your situation is, you need to come up with a way to determine whether you are progressing or not. Failure to do so can tackle your motivation to keep moving forward, and you don't want to fight that Chimera.\n\n----------------------------------------------------------------------- \n**Consistency**\n\n\n*\"You'll get more results from a mediocre workout plan executed with consistency than with the best plan in the world executed poorly.\"*\n \nI can't remember where I first read that phrase. It just stuck with me for good, especially when I found out that it applies to virtually everything in our lives. Yes, even to guitar playing.\n \nUp to this point, we've talked about how to develop a good groundwork to achieve our goals. The only aspect left to cover is that all this work we've done so far has to be carried out consistently, or else it will hardly get you anywhere.\n \nLuck is a weird thing. Some people seem to have it, and others just don't. However, I've discovered an interesting truth:\n \n*\"Luck not only favors the bold, but those who continually seek it.\"*\n\nThis means that you cannot just wait doing nothing for luck/inspiration to suddenly strike you, rather you have to work at it continually to create the conditions that will allow luck to come to you. For our purposes, this means that you must be really dedicated to it, almost relentlessly.\n\nPracticing for 10 hours one day and then nothing for weeks is no use. Instead, aim for shorter, more frequent practice sessions. Practicing every day is great, but there is a fine line between good practice and too much practice. Yes, believe it or not, there is a thing as too much practice.\n\n*\"No pain, no gain, but enough pain is enough gain.\"*\n\nAs a general thumbrule, I recommend taking at least a day off per week to rest, as well as not stretching more than one hour at a time of intense practice. Of course, there are exceptions.\n\nAlso, depending on your goals, you might need more consistency. If you want to be a master shredder, you'll need the most intensive practice sessions, as you'll need to strenghten a lot of muscles that are not used normally, as well as a very deep concentration and coordination.\n\n-----------------------------------------------------------------------\nI'm certain these tips will help you go as far as you want to go, wherever that is.\n\nI'd like to hear what you have to say. Comment below and let me know.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Arts/Music/DIY", "id": "65fkif", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "MaxTPG", "saved": false, "mod_reports": [], "name": "t3_65fkif", "subreddit_name_prefixed": "r/IWantToLearn", "approved_by": null, "over_18": false, "domain": "self.IWantToLearn", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rjo5", "edited": false, "link_flair_css_class": "arts-and-crafts", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/IWantToLearn/comments/65fkif/four_critical_aspects_for_a_successful_guitarist/", "num_reports": null, "locked": false, "stickied": false, "created": 1492236481.0, "url": "https://www.reddit.com/r/IWantToLearn/comments/65fkif/four_critical_aspects_for_a_successful_guitarist/", "author_flair_text": null, "quarantine": false, "title": "Four critical aspects for a successful guitarist", "created_utc": 1492207681.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]