[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "IWantToLearn", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everybody,&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t had a job for a long while now due some crippling anxiety. I&amp;#39;ve finally started getting my life back on track with some visits to a psychiatrist and medicine. Now that I&amp;#39;ve started looking for work, I suddenly get a call from a relative who is a higher up in a Japanese academy and is willing to set me up me to teach English (or at least give me an interview). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in Canada right now. Living in Japan is like a dream for me, but at the same time it&amp;#39;s just way too overwhelming. For somebody who could barely get out of the house a month ago, I can&amp;#39;t even fathom the thought of going to a foreign country where I can&amp;#39;t even speak a couple words of the native language, to teach English which I&amp;#39;m completely under qualified to teach (I have an Economics degree, but I&amp;#39;ve never been too great at English). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not fit to do the job right now, but I&amp;#39;m not ruling out the possibility later on. However, the problem is I don&amp;#39;t even know where the begin when it comes to relocating. I can live by myself perfectly fine, but I&amp;#39;ve never done any sort of traveling beyond getting dragged around by a tour guide in a group. I can&amp;#39;t imagine surviving in Japan by myself.&lt;/p&gt;\n\n&lt;p&gt;I would appreciate any tips and tricks on how to live by myself in a foreign place. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi everybody,\n\nI haven't had a job for a long while now due some crippling anxiety. I've finally started getting my life back on track with some visits to a psychiatrist and medicine. Now that I've started looking for work, I suddenly get a call from a relative who is a higher up in a Japanese academy and is willing to set me up me to teach English (or at least give me an interview). \n\nI'm in Canada right now. Living in Japan is like a dream for me, but at the same time it's just way too overwhelming. For somebody who could barely get out of the house a month ago, I can't even fathom the thought of going to a foreign country where I can't even speak a couple words of the native language, to teach English which I'm completely under qualified to teach (I have an Economics degree, but I've never been too great at English). \n\nI'm not fit to do the job right now, but I'm not ruling out the possibility later on. However, the problem is I don't even know where the begin when it comes to relocating. I can live by myself perfectly fine, but I've never done any sort of traveling beyond getting dragged around by a tour guide in a group. I can't imagine surviving in Japan by myself.\n\nI would appreciate any tips and tricks on how to live by myself in a foreign place. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Uncategorized", "id": "65gbu0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "Ganting", "saved": false, "mod_reports": [], "name": "t3_65gbu0", "subreddit_name_prefixed": "r/IWantToLearn", "approved_by": null, "over_18": false, "domain": "self.IWantToLearn", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rjo5", "edited": false, "link_flair_css_class": "misc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/IWantToLearn/comments/65gbu0/iwtl_how_to_relocate_for_a_job/", "num_reports": null, "locked": false, "stickied": false, "created": 1492245552.0, "url": "https://www.reddit.com/r/IWantToLearn/comments/65gbu0/iwtl_how_to_relocate_for_a_job/", "author_flair_text": null, "quarantine": false, "title": "IWTL How to relocate (for a job)", "created_utc": 1492216752.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]