[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "IWantToLearn", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a treacherous feeling sometimes. But almost trivial! Like it&amp;#39;s always been this way. You feel so alone at times and it&amp;#39;s almost unnoticeable at others. Everything you&amp;#39;ve ever done has been done with a certain someone and now that you&amp;#39;re alone it&amp;#39;s foreign and annoying to redo them with someone new. Preferably, you want to fly solo all while seeking the company of someone you don&amp;#39;t know.\nI want to better embrace my newfound loneliness instead of only feeling it&amp;#39;s negative connotations on and off in a fickle cycle. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's a treacherous feeling sometimes. But almost trivial! Like it's always been this way. You feel so alone at times and it's almost unnoticeable at others. Everything you've ever done has been done with a certain someone and now that you're alone it's foreign and annoying to redo them with someone new. Preferably, you want to fly solo all while seeking the company of someone you don't know.\nI want to better embrace my newfound loneliness instead of only feeling it's negative connotations on and off in a fickle cycle. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Uncategorized", "id": "65tyol", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 37, "report_reasons": null, "author": "nickissauce", "saved": false, "mod_reports": [], "name": "t3_65tyol", "subreddit_name_prefixed": "r/IWantToLearn", "approved_by": null, "over_18": false, "domain": "self.IWantToLearn", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rjo5", "edited": false, "link_flair_css_class": "misc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/IWantToLearn/comments/65tyol/how_to_be_content_with_with_the_feeling_after/", "num_reports": null, "locked": false, "stickied": false, "created": 1492438762.0, "url": "https://www.reddit.com/r/IWantToLearn/comments/65tyol/how_to_be_content_with_with_the_feeling_after/", "author_flair_text": null, "quarantine": false, "title": "How to be content with with the feeling after you've fallen out of love", "created_utc": 1492409962.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 37}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65tyol", "likes": null, "replies": "", "user_reports": [], "id": "dgdbask", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "junipel", "parent_id": "t3_65tyol", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "Give yourself an appropriate amount of time to grieve losing this person from your life. It's okay to be sad for a time, and to rush this process only makes your recovery take longer. \n\nReach out and meet new people. Spend time with friends and family (especially family). Focus on your work. Hit the gym. Take care of yourself. The best change comes slowly. \n\nBest of luck to you.    ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Give yourself an appropriate amount of time to grieve losing this person from your life. It&amp;#39;s okay to be sad for a time, and to rush this process only makes your recovery take longer. &lt;/p&gt;\n\n&lt;p&gt;Reach out and meet new people. Spend time with friends and family (especially family). Focus on your work. Hit the gym. Take care of yourself. The best change comes slowly. &lt;/p&gt;\n\n&lt;p&gt;Best of luck to you.    &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgdbask", "score_hidden": false, "stickied": false, "created": 1492450617.0, "created_utc": 1492421817.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65tyol", "likes": null, "replies": "", "user_reports": [], "id": "dgdcxh2", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "secretWolfMan", "parent_id": "t3_65tyol", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "You'll fall in and out several times in a long relationship.  You both have to work at maintaining the little things that make you care, and not getting so comfortable and lazy that you're barely roommates.  \n\nFrom your post I'm assuming the relationship has already been ended.  \nThat's a different problem.  **They weren't the one that will be there when you turn 80.**  \nIt sucks, but in the long run it's no big deal.  You've learned a lot and now can confidently enter your next relationship knowing what you like and what you will not tolerate.  \nGive it some time.  Fuck some strangers you meet on phone apps.  You'll know when it's time to get serious again.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ll fall in and out several times in a long relationship.  You both have to work at maintaining the little things that make you care, and not getting so comfortable and lazy that you&amp;#39;re barely roommates.  &lt;/p&gt;\n\n&lt;p&gt;From your post I&amp;#39;m assuming the relationship has already been ended.&lt;br/&gt;\nThat&amp;#39;s a different problem.  &lt;strong&gt;They weren&amp;#39;t the one that will be there when you turn 80.&lt;/strong&gt;&lt;br/&gt;\nIt sucks, but in the long run it&amp;#39;s no big deal.  You&amp;#39;ve learned a lot and now can confidently enter your next relationship knowing what you like and what you will not tolerate.&lt;br/&gt;\nGive it some time.  Fuck some strangers you meet on phone apps.  You&amp;#39;ll know when it&amp;#39;s time to get serious again.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgdcxh2", "score_hidden": false, "stickied": false, "created": 1492455864.0, "created_utc": 1492427064.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65tyol", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65tyol", "likes": null, "replies": "", "user_reports": [], "id": "dge4ifb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "junipel", "parent_id": "t1_dgdvu15", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "No matter where you're at emotionally, the most important thing is to be making progress in your life. This might sound cliche, but working towards your goals will help you achieve the inner peace you're searching for in the absence of someone else. Achieve that, and everything else falls in line.\n\nI have the feeling I've been where you're at before, and you're definitely not the only one, lol. Comfort while being alone is something we all crave. Good luck in finding it, and thanks for sharing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No matter where you&amp;#39;re at emotionally, the most important thing is to be making progress in your life. This might sound cliche, but working towards your goals will help you achieve the inner peace you&amp;#39;re searching for in the absence of someone else. Achieve that, and everything else falls in line.&lt;/p&gt;\n\n&lt;p&gt;I have the feeling I&amp;#39;ve been where you&amp;#39;re at before, and you&amp;#39;re definitely not the only one, lol. Comfort while being alone is something we all crave. Good luck in finding it, and thanks for sharing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dge4ifb", "score_hidden": false, "stickied": false, "created": 1492492049.0, "created_utc": 1492463249.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvu15", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nickissauce", "parent_id": "t3_65tyol", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "I think I may have interpreted my feelings wrong. It's not so much about getting over someone as it is being ok with the new found absence or that very odd existential feeling. It might just be me lol ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I may have interpreted my feelings wrong. It&amp;#39;s not so much about getting over someone as it is being ok with the new found absence or that very odd existential feeling. It might just be me lol &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgdvu15", "score_hidden": false, "stickied": false, "created": 1492482258.0, "created_utc": 1492453458.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65tyol", "likes": null, "replies": "", "user_reports": [], "id": "dgdo3be", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SearchingDeepSpace", "parent_id": "t3_65tyol", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "Get a haircut.\nSwitch jobs.\nPick up an instrument.\nTalk to people on Tinder.\n\nMost of all, do something every day that makes YOU happy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get a haircut.\nSwitch jobs.\nPick up an instrument.\nTalk to people on Tinder.&lt;/p&gt;\n\n&lt;p&gt;Most of all, do something every day that makes YOU happy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgdo3be", "score_hidden": false, "stickied": false, "created": 1492473648.0, "created_utc": 1492444848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65tyol", "likes": null, "replies": "", "user_reports": [], "id": "dge158u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "oobshlooby", "parent_id": "t3_65tyol", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "This is going to sound generic, but it's mostly because the how differs so greatly with each person. I'll explain it a little more in depth, but my generic advice is fall in love with yourself. \n\nThe first key is to identify the biggest gap they left in your life. For example, when this happened to me, the biggest gap was that suddenly I didn't have someone to share random stuff on the internet with, or someone to share stories with, or someone to chat with about things I was interested in. Once you identify that gap, you can start to figure out how you can fill it. Initially, I was bothering my friends a lot and they didn't necessarily reply with the interest I wanted from them. So I got back into an old habit I used to have where I journaled a lot, and I found that did a few beneficial things for me. It gave me an outlet to express my thoughts and things that were on my mind or interesting me, and it built a self reliance to satiate that urge to discuss things (which I realized was a lot about having a verbal sounding board). \n\nSecond, I'd get comfortable doing random things on your own. Going to the movies, getting coffee, walking around a new neighborhood. This can help with that feeling of emptiness since you're not spending time isolated from people. Depending on how friendly you are, you can often meet other people or at least find someone to chat with for a few minutes, which can really help alleviate that. \n\nThird, download a dating app. It's fun just to find someone to chat with, and it doesn't even have to go anywhere if you don't want it. It'll help you fill that gap of affection and flirting. Dating around will also help fill out your schedule, which is really helpful. I found that the absence of plans was really apparent, and filling that helped a lot. It also made me begin to appreciate the feeling of freedom when you wake up on a Saturday and there's no one in the back of your head that you should see, its just you, your day, and anyone in the world you want to hang out with. \n\nThose are all I can think of now. I hope some of that helps! Any other advice I have is probably way to specific to me haha, so I don't think it would be super helpful. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is going to sound generic, but it&amp;#39;s mostly because the how differs so greatly with each person. I&amp;#39;ll explain it a little more in depth, but my generic advice is fall in love with yourself. &lt;/p&gt;\n\n&lt;p&gt;The first key is to identify the biggest gap they left in your life. For example, when this happened to me, the biggest gap was that suddenly I didn&amp;#39;t have someone to share random stuff on the internet with, or someone to share stories with, or someone to chat with about things I was interested in. Once you identify that gap, you can start to figure out how you can fill it. Initially, I was bothering my friends a lot and they didn&amp;#39;t necessarily reply with the interest I wanted from them. So I got back into an old habit I used to have where I journaled a lot, and I found that did a few beneficial things for me. It gave me an outlet to express my thoughts and things that were on my mind or interesting me, and it built a self reliance to satiate that urge to discuss things (which I realized was a lot about having a verbal sounding board). &lt;/p&gt;\n\n&lt;p&gt;Second, I&amp;#39;d get comfortable doing random things on your own. Going to the movies, getting coffee, walking around a new neighborhood. This can help with that feeling of emptiness since you&amp;#39;re not spending time isolated from people. Depending on how friendly you are, you can often meet other people or at least find someone to chat with for a few minutes, which can really help alleviate that. &lt;/p&gt;\n\n&lt;p&gt;Third, download a dating app. It&amp;#39;s fun just to find someone to chat with, and it doesn&amp;#39;t even have to go anywhere if you don&amp;#39;t want it. It&amp;#39;ll help you fill that gap of affection and flirting. Dating around will also help fill out your schedule, which is really helpful. I found that the absence of plans was really apparent, and filling that helped a lot. It also made me begin to appreciate the feeling of freedom when you wake up on a Saturday and there&amp;#39;s no one in the back of your head that you should see, its just you, your day, and anyone in the world you want to hang out with. &lt;/p&gt;\n\n&lt;p&gt;Those are all I can think of now. I hope some of that helps! Any other advice I have is probably way to specific to me haha, so I don&amp;#39;t think it would be super helpful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dge158u", "score_hidden": false, "stickied": false, "created": 1492488273.0, "created_utc": 1492459473.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjo5", "removal_reason": null, "link_id": "t3_65tyol", "likes": null, "replies": "", "user_reports": [], "id": "dgdgg7z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "muddpie4785", "parent_id": "t3_65tyol", "subreddit_name_prefixed": "r/IWantToLearn", "controversiality": 0, "body": "Get out of your own head by helping those less fortunate than yourself. Volunteer at an animal shelter. Deliver Meals on Wheels. Read to little kids at the library. Pick something and give of yourself. The dividends to your own mood and confidence are innumerable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get out of your own head by helping those less fortunate than yourself. Volunteer at an animal shelter. Deliver Meals on Wheels. Read to little kids at the library. Pick something and give of yourself. The dividends to your own mood and confidence are innumerable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "IWantToLearn", "name": "t1_dgdgg7z", "score_hidden": false, "stickied": false, "created": 1492463484.0, "created_utc": 1492434684.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]