[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There is absolutely no fucking way that the key components of the society we currently live in were designed by people with human mental health in mind. Concepts like having a job, going to school, respecting arbitrary laws concerning authority and wealth are designed by and for the people on top. Who are the people on top? Benevolent, determined people? Statistically speaking, the incidence of psychopathy among high-level executives and politicians is abnormally common. It&amp;#39;s no wonder the most evil people in history were politicians. &lt;/p&gt;\n\n&lt;p&gt;The people on top have used force and violence to get what they want and consolidated this power with police forces, courts and entire governments that do their bidding. They do not have our happiness in mind, but their own. It&amp;#39;s a simple enough thing to understand. &lt;/p&gt;\n\n&lt;p&gt;I am completely unconvinced that I am meant to be as hardworking as I am expected to be. I cannot take another day of drudgery. My parents have such pressure on me to fulfill their expectations of me, which I have stupidly set them up for. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to live in civilization anymore. I would rather be under constant threat of starvation in the cold woods of Northern Ontario than spend another motherfucking day in this suburban hellhole. If that doesn&amp;#39;t work I may very well kill myself under all the stress.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to be medicated. If this is the way I feel about society, it would be a betrayal of myself to drug myself into enjoying my bullshit life. Besides drugs, what sweet lie could a therapist possibly tell me about this crumbling, terrifying society I live in? How could I possibly feel happy about bludgeoning my brains out with essays and quizzes and assignments if I&amp;#39;m not even sure I&amp;#39;ll live past 40 with the climate crisis going on?&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to be happy with the bullshit, I just want some way out. I will take whatever opportunity I get. The only reason I&amp;#39;m afraid to die at all is because I can&amp;#39;t die alone. I want to go out with my girlfriend beside me, and she lives an hour and a half away. I can only see her weekly. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "There is absolutely no fucking way that the key components of the society we currently live in were designed by people with human mental health in mind. Concepts like having a job, going to school, respecting arbitrary laws concerning authority and wealth are designed by and for the people on top. Who are the people on top? Benevolent, determined people? Statistically speaking, the incidence of psychopathy among high-level executives and politicians is abnormally common. It's no wonder the most evil people in history were politicians. \n\nThe people on top have used force and violence to get what they want and consolidated this power with police forces, courts and entire governments that do their bidding. They do not have our happiness in mind, but their own. It's a simple enough thing to understand. \n\nI am completely unconvinced that I am meant to be as hardworking as I am expected to be. I cannot take another day of drudgery. My parents have such pressure on me to fulfill their expectations of me, which I have stupidly set them up for. \n\nI don't want to live in civilization anymore. I would rather be under constant threat of starvation in the cold woods of Northern Ontario than spend another motherfucking day in this suburban hellhole. If that doesn't work I may very well kill myself under all the stress.\n\nI don't want to be medicated. If this is the way I feel about society, it would be a betrayal of myself to drug myself into enjoying my bullshit life. Besides drugs, what sweet lie could a therapist possibly tell me about this crumbling, terrifying society I live in? How could I possibly feel happy about bludgeoning my brains out with essays and quizzes and assignments if I'm not even sure I'll live past 40 with the climate crisis going on?\n\nI don't want to be happy with the bullshit, I just want some way out. I will take whatever opportunity I get. The only reason I'm afraid to die at all is because I can't die alone. I want to go out with my girlfriend beside me, and she lives an hour and a half away. I can only see her weekly. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64oo03", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 32, "report_reasons": null, "author": "FlamingMax", "saved": false, "mod_reports": [], "name": "t3_64oo03", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/64oo03/fuck_the_entire_system_and_everything_it_stands/", "num_reports": null, "locked": false, "stickied": false, "created": 1491912891.0, "url": "https://www.reddit.com/r/Anxiety/comments/64oo03/fuck_the_entire_system_and_everything_it_stands/", "author_flair_text": null, "quarantine": false, "title": "Fuck the entire system and everything it stands for", "created_utc": 1491884091.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": "", "user_reports": [], "id": "dg3vkbt", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "coky18", "parent_id": "t3_64oo03", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I completely agree and have totally been where you are right now. I get so angry and frustrated by the hypocrisy and the bullshit beaurocracy that we are forced into. Mental health is nowhere close to being funded enough, understood enough, or encouraged to be spoken about enough. (AND IM IN CANADA!)\n\nYou don't have to medicate to be at peace, if you don't want. I chose to because I believe there is physiological differences that make people more prone to the effects of Anxiety and Depression and my entire family lineage has had it, but that's just me. And trust me, drugging yourself wont make you ever okay with how shitty our society can be sometime.\n\nOne of my favorite quotes is that people with anxiety and depression just have higher expectations than everyone else, and therefore find it difficult to handle. The world should be so much better than this.\n\nWhat was important for me was lowering my skepticism towards mindfulness meditation but everyone finds their own. I struggled with anxiety for atleast 15 years and trust me, drugs don't just pacify you. If you look closely enough, you will always find the bullshit in this society that makes it suck.\n\nBut there are ways to instead, look closely enough to find the things that bring you peace. I often wondered how Buddhist monks could find inner peace through something stupid like \"meditation\" when there's so much suffering in this world.\n\nThen I realized, fine, ill just focus on myself and those I love. I started focusing inwards. I put away pre-conceived notions of hokey guided meditations and I found a way to close my eyes, relax, and put myself in a place where i am at peace. \n\nYes, I'm not thinking about the horrible world around me, as people run around pushing eachother over, desperately grabbing for money. Selfishly treating others. Pretending things are okay.\n\nWhen I Realized there was a way to turn that off. That I was _allowed_ to turn that off. That I was allowed to feel what I Was feeling. That if the world is selfishly going to go about it's business and be fucked up, i'm going to focus on myself and the people I love and focus on my breathing. Focus, in a quiet room, the the soft ticking of an analog clock. The predictable rhythm. \n\nAnd if someone tells me to come back to \"Reality\", I can comfortably say that I don't want to live in their reality. I've found a better one. And I realized that maybe it is possible that these monks find an inner peace despite all the garbage in this world. \n\nYou will be okay. You are allowed to be upset about this. These thoughts are okay. Don't fight them. Let them exist. You are not alone in your disgust in the world around you. I cannot maintain a work routine at the moment. I was able to, now I am not. I can't be a worker-bee. I can't devote my life to monotony and shallow living.\n\nTrust me when I say these thoughts have been with me since I Was a teenager. It's okay. Find a way to relax. I know it sounds like shitty advice, but try and find a way to relax. Don't fight your thoughts, it's good to vent. But give yourself permission to listen to something quiet and go somewhere else for awhile. You're okay. You're safe. We are here, and we agree, \n\nbut its okay.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I completely agree and have totally been where you are right now. I get so angry and frustrated by the hypocrisy and the bullshit beaurocracy that we are forced into. Mental health is nowhere close to being funded enough, understood enough, or encouraged to be spoken about enough. (AND IM IN CANADA!)&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to medicate to be at peace, if you don&amp;#39;t want. I chose to because I believe there is physiological differences that make people more prone to the effects of Anxiety and Depression and my entire family lineage has had it, but that&amp;#39;s just me. And trust me, drugging yourself wont make you ever okay with how shitty our society can be sometime.&lt;/p&gt;\n\n&lt;p&gt;One of my favorite quotes is that people with anxiety and depression just have higher expectations than everyone else, and therefore find it difficult to handle. The world should be so much better than this.&lt;/p&gt;\n\n&lt;p&gt;What was important for me was lowering my skepticism towards mindfulness meditation but everyone finds their own. I struggled with anxiety for atleast 15 years and trust me, drugs don&amp;#39;t just pacify you. If you look closely enough, you will always find the bullshit in this society that makes it suck.&lt;/p&gt;\n\n&lt;p&gt;But there are ways to instead, look closely enough to find the things that bring you peace. I often wondered how Buddhist monks could find inner peace through something stupid like &amp;quot;meditation&amp;quot; when there&amp;#39;s so much suffering in this world.&lt;/p&gt;\n\n&lt;p&gt;Then I realized, fine, ill just focus on myself and those I love. I started focusing inwards. I put away pre-conceived notions of hokey guided meditations and I found a way to close my eyes, relax, and put myself in a place where i am at peace. &lt;/p&gt;\n\n&lt;p&gt;Yes, I&amp;#39;m not thinking about the horrible world around me, as people run around pushing eachother over, desperately grabbing for money. Selfishly treating others. Pretending things are okay.&lt;/p&gt;\n\n&lt;p&gt;When I Realized there was a way to turn that off. That I was &lt;em&gt;allowed&lt;/em&gt; to turn that off. That I was allowed to feel what I Was feeling. That if the world is selfishly going to go about it&amp;#39;s business and be fucked up, i&amp;#39;m going to focus on myself and the people I love and focus on my breathing. Focus, in a quiet room, the the soft ticking of an analog clock. The predictable rhythm. &lt;/p&gt;\n\n&lt;p&gt;And if someone tells me to come back to &amp;quot;Reality&amp;quot;, I can comfortably say that I don&amp;#39;t want to live in their reality. I&amp;#39;ve found a better one. And I realized that maybe it is possible that these monks find an inner peace despite all the garbage in this world. &lt;/p&gt;\n\n&lt;p&gt;You will be okay. You are allowed to be upset about this. These thoughts are okay. Don&amp;#39;t fight them. Let them exist. You are not alone in your disgust in the world around you. I cannot maintain a work routine at the moment. I was able to, now I am not. I can&amp;#39;t be a worker-bee. I can&amp;#39;t devote my life to monotony and shallow living.&lt;/p&gt;\n\n&lt;p&gt;Trust me when I say these thoughts have been with me since I Was a teenager. It&amp;#39;s okay. Find a way to relax. I know it sounds like shitty advice, but try and find a way to relax. Don&amp;#39;t fight your thoughts, it&amp;#39;s good to vent. But give yourself permission to listen to something quiet and go somewhere else for awhile. You&amp;#39;re okay. You&amp;#39;re safe. We are here, and we agree, &lt;/p&gt;\n\n&lt;p&gt;but its okay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg3vkbt", "score_hidden": false, "stickied": false, "created": 1491915033.0, "created_utc": 1491886233.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": "", "user_reports": [], "id": "dg4e9yd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kerrypug", "parent_id": "t1_dg4dx5e", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Don't feel guilty. He'll most likely turn out to be well rounded, open minded and well informed about the world as a result", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t feel guilty. He&amp;#39;ll most likely turn out to be well rounded, open minded and well informed about the world as a result&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4e9yd", "score_hidden": false, "stickied": false, "created": 1491952730.0, "created_utc": 1491923930.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4dx5e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "IdleMayhem", "parent_id": "t1_dg4biq5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I have one kid, but I stopped at one because I realized this. Now I feel bad and guilty that I created him and he's stuck with this crap. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have one kid, but I stopped at one because I realized this. Now I feel bad and guilty that I created him and he&amp;#39;s stuck with this crap. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4dx5e", "score_hidden": false, "stickied": false, "created": 1491952335.0, "created_utc": 1491923535.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": "", "user_reports": [], "id": "dg4zi5s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DinosaursAndStarStuf", "parent_id": "t1_dg4biq5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I have about 327 reasons for not having children and our awful society makes up reasons 8-274 at least.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have about 327 reasons for not having children and our awful society makes up reasons 8-274 at least.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4zi5s", "score_hidden": false, "stickied": false, "created": 1491976228.0, "created_utc": 1491947428.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4biq5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Kerrypug", "parent_id": "t3_64oo03", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I agree. It's one of the main reasons I don't want kids. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree. It&amp;#39;s one of the main reasons I don&amp;#39;t want kids. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4biq5", "score_hidden": false, "stickied": false, "created": 1491949544.0, "created_utc": 1491920744.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": "", "user_reports": [], "id": "dg4zmqk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DinosaursAndStarStuf", "parent_id": "t1_dg4rcla", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Right now? Definitely potato. But I really enjoyed that - thank you for sharing! I shall strive to be the coffee.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right now? Definitely potato. But I really enjoyed that - thank you for sharing! I shall strive to be the coffee.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4zmqk", "score_hidden": false, "stickied": false, "created": 1491976383.0, "created_utc": 1491947583.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": "", "user_reports": [], "id": "dg555yh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FlamingMax", "parent_id": "t1_dg4rcla", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Thank you! I am not sure whether I am an egg or a potato, but I don't care much for any of the three. I think I want out of the pot and onto the countertop. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! I am not sure whether I am an egg or a potato, but I don&amp;#39;t care much for any of the three. I think I want out of the pot and onto the countertop. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg555yh", "score_hidden": false, "stickied": false, "created": 1491983645.0, "created_utc": 1491954845.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4rcla", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MissyTheSnake", "parent_id": "t3_64oo03", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I find a lot of comfort in homesteading and Buddhism concepts. I frequently research off-the-grid living, and self-sustainability. It may be something that interests you too! It's one way to get away from the grind and all that is terrible and depressing and aggravating about the world today. \n\nUse your anger and frustration as motivation to change the world around you. \n\nOnce upon a time, a boy told his father that he felt the world was a terrible, terrible place, and he was not sure how he was going to make it. He took him into the kitchen and put three pots of water on the stove to boil. Once they began to boil, he put a potato in one, an egg in the next, and coffee in the other. After a while, he took them off the burners. He scooped out the potato and placed it in a bowl. He scooped out the egg and placed it in a bowl. He ladled out the coffee into a bowl. He asked the boy what he saw. \n\n\"A potato, an egg, and coffee,\" he said. \n\nHis father then said, \"look closer. Touch the potato.\"\n\nHe did, and it was soft. He then asked him to break open the egg, and it was hard. Finally, he asked him to sip the coffee. \n\nHe explained: the potato, the egg, and the coffee each were immersed in terrible, terrible conditions. The potato went in strong, but being put into the boiling water, it became soft and weak. The egg went in fragile, but being put into the boiling water, the egg became hard. The coffee, however, was unique. When the coffee was put into the boiling water, they changed the water and created something new. \n\nWhen the world is terrible, which are you? A potato, an egg, or coffee? \n\nEdit: pronoun", "edited": 1491949864.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I find a lot of comfort in homesteading and Buddhism concepts. I frequently research off-the-grid living, and self-sustainability. It may be something that interests you too! It&amp;#39;s one way to get away from the grind and all that is terrible and depressing and aggravating about the world today. &lt;/p&gt;\n\n&lt;p&gt;Use your anger and frustration as motivation to change the world around you. &lt;/p&gt;\n\n&lt;p&gt;Once upon a time, a boy told his father that he felt the world was a terrible, terrible place, and he was not sure how he was going to make it. He took him into the kitchen and put three pots of water on the stove to boil. Once they began to boil, he put a potato in one, an egg in the next, and coffee in the other. After a while, he took them off the burners. He scooped out the potato and placed it in a bowl. He scooped out the egg and placed it in a bowl. He ladled out the coffee into a bowl. He asked the boy what he saw. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;A potato, an egg, and coffee,&amp;quot; he said. &lt;/p&gt;\n\n&lt;p&gt;His father then said, &amp;quot;look closer. Touch the potato.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He did, and it was soft. He then asked him to break open the egg, and it was hard. Finally, he asked him to sip the coffee. &lt;/p&gt;\n\n&lt;p&gt;He explained: the potato, the egg, and the coffee each were immersed in terrible, terrible conditions. The potato went in strong, but being put into the boiling water, it became soft and weak. The egg went in fragile, but being put into the boiling water, the egg became hard. The coffee, however, was unique. When the coffee was put into the boiling water, they changed the water and created something new. &lt;/p&gt;\n\n&lt;p&gt;When the world is terrible, which are you? A potato, an egg, or coffee? &lt;/p&gt;\n\n&lt;p&gt;Edit: pronoun&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4rcla", "score_hidden": false, "stickied": false, "created": 1491966979.0, "created_utc": 1491938179.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": "", "user_reports": [], "id": "dg4mf86", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "everyotherfreckle1", "parent_id": "t3_64oo03", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I often feel like this. I wouldn't say I'm depressed but very anxious about the future and the state of the world we live in (wars, famine, climate change to name a few examples). It makes me angry but then I think what good is that going to do? \n\nIronically watching the Simpsons episode where Lisa has to do a presentation on Springfield in 50 years and I feel a bit like her atm. \n\nAnyway, hope you feel better soon!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I often feel like this. I wouldn&amp;#39;t say I&amp;#39;m depressed but very anxious about the future and the state of the world we live in (wars, famine, climate change to name a few examples). It makes me angry but then I think what good is that going to do? &lt;/p&gt;\n\n&lt;p&gt;Ironically watching the Simpsons episode where Lisa has to do a presentation on Springfield in 50 years and I feel a bit like her atm. &lt;/p&gt;\n\n&lt;p&gt;Anyway, hope you feel better soon!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4mf86", "score_hidden": false, "stickied": false, "created": 1491961656.0, "created_utc": 1491932856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": "", "user_reports": [], "id": "dg4zjtd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DinosaursAndStarStuf", "parent_id": "t1_dg3ut46", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Not OP, but thanks. It feels good to know that there are lots of others out there who realized how fucked modern society is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not OP, but thanks. It feels good to know that there are lots of others out there who realized how fucked modern society is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4zjtd", "score_hidden": false, "stickied": false, "created": 1491976283.0, "created_utc": 1491947483.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3ut46", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "droids707", "parent_id": "t3_64oo03", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Hey, bro. Try to take it easy for half an hour! Relax, do something you enjoy. I know how hard the monotony can be. Youre feeling existential. Take some deep breathing and relax. Pm if you need. \n\nIm right there with you. I constantly wonder what the fuck is up with humanity, mostly the top tier. Stay focused that you're not alone and try to relax. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, bro. Try to take it easy for half an hour! Relax, do something you enjoy. I know how hard the monotony can be. Youre feeling existential. Take some deep breathing and relax. Pm if you need. &lt;/p&gt;\n\n&lt;p&gt;Im right there with you. I constantly wonder what the fuck is up with humanity, mostly the top tier. Stay focused that you&amp;#39;re not alone and try to relax. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg3ut46", "score_hidden": false, "stickied": false, "created": 1491913734.0, "created_utc": 1491884934.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": "", "user_reports": [], "id": "dg4zew3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DinosaursAndStarStuf", "parent_id": "t3_64oo03", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I relate to absolutely everything you've written. Society is nothing but a damn boardgame. I too worry that if I were medicated, I might just give up and \"accept\" the boardgame as the be-all-end-all. It causes me frustration to hear people say, \"Well, that's just life.\" NO. No it's not life. Life is this planet and all of the biological living things on it - from single-celled organism to plant to animal. THAT is life. This bullshit societal boardgame is NOT life. \n\n\nMy BS is in Health with a minor in Human Development and my MS is in Nutrition. I've spent the last decade studying all the ways that society is bad for our health (the food we eat, commuting to/from work, sedentary jobs and lifestyles, excessive stress, low socioeconomic status - these are ALL tied to obesity, heart disease, diabetes, cancer, early mortality, and years of productive life lost) and now that I've finished this stupid fucking Masters degree, everyone expects me to go sign up to work 40 hours a week for some awful soul-sucking corporation just so I can MAKE THAT MONEY. Fuck all of it. I'll join you in Ontario.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I relate to absolutely everything you&amp;#39;ve written. Society is nothing but a damn boardgame. I too worry that if I were medicated, I might just give up and &amp;quot;accept&amp;quot; the boardgame as the be-all-end-all. It causes me frustration to hear people say, &amp;quot;Well, that&amp;#39;s just life.&amp;quot; NO. No it&amp;#39;s not life. Life is this planet and all of the biological living things on it - from single-celled organism to plant to animal. THAT is life. This bullshit societal boardgame is NOT life. &lt;/p&gt;\n\n&lt;p&gt;My BS is in Health with a minor in Human Development and my MS is in Nutrition. I&amp;#39;ve spent the last decade studying all the ways that society is bad for our health (the food we eat, commuting to/from work, sedentary jobs and lifestyles, excessive stress, low socioeconomic status - these are ALL tied to obesity, heart disease, diabetes, cancer, early mortality, and years of productive life lost) and now that I&amp;#39;ve finished this stupid fucking Masters degree, everyone expects me to go sign up to work 40 hours a week for some awful soul-sucking corporation just so I can MAKE THAT MONEY. Fuck all of it. I&amp;#39;ll join you in Ontario.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4zew3", "score_hidden": false, "stickied": false, "created": 1491976120.0, "created_utc": 1491947320.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64oo03", "likes": null, "replies": "", "user_reports": [], "id": "dg61b8w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DoomsdaySprocket", "parent_id": "t3_64oo03", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Nothing is stopping you from planning your escape. Research, write stuff down, talk to like-minded ppl. I brought this up recently with my psychologist and that was essentially his response. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nothing is stopping you from planning your escape. Research, write stuff down, talk to like-minded ppl. I brought this up recently with my psychologist and that was essentially his response. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg61b8w", "score_hidden": false, "stickied": false, "created": 1492040334.0, "created_utc": 1492011534.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]