[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have made many mistakes in my life and the shame and the guilt is very strong and very deep everyday but the worst part is that I have a poor habit of ruminating about those mistakes and unable to forgive myself or tackle it to make sure that I have the right strategy to tackle it if I ever happen to make that mistake again or avoid doing it.&lt;/p&gt;\n\n&lt;p&gt;Most of the time when I make a mistake, I go into a dark spiral of shame and guilt and sheer self-criticism and I end up in a cycle of criticism and doing those mistakes again and feel even worse in the process.&lt;/p&gt;\n\n&lt;p&gt;Sometimes I even ruminate about my ruminating habit as well which makes the burden and guilt much worse and this habit has been happening for years and affected how I look at myself and affected how I work and how I think during my studies &lt;em&gt;(which is the worst becuase the education system have &amp;quot;no mistake&amp;quot; policy and have a &amp;quot;pass or fail&amp;quot; mentality and also the most important thing in my life for many years so it causes a lot of anxiety and fear in my life)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;How can I break this habit? What strategies I can use to help myself from going deeper into the cycle of depression, anxiety and EXTREME self-hatred and self-loathing and suicidal thoughts?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have made many mistakes in my life and the shame and the guilt is very strong and very deep everyday but the worst part is that I have a poor habit of ruminating about those mistakes and unable to forgive myself or tackle it to make sure that I have the right strategy to tackle it if I ever happen to make that mistake again or avoid doing it.\n\nMost of the time when I make a mistake, I go into a dark spiral of shame and guilt and sheer self-criticism and I end up in a cycle of criticism and doing those mistakes again and feel even worse in the process.\n\nSometimes I even ruminate about my ruminating habit as well which makes the burden and guilt much worse and this habit has been happening for years and affected how I look at myself and affected how I work and how I think during my studies *(which is the worst becuase the education system have \"no mistake\" policy and have a \"pass or fail\" mentality and also the most important thing in my life for many years so it causes a lot of anxiety and fear in my life)*\n\n\n\nHow can I break this habit? What strategies I can use to help myself from going deeper into the cycle of depression, anxiety and EXTREME self-hatred and self-loathing and suicidal thoughts?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64q4ld", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 69, "report_reasons": null, "author": "sammyjamez", "saved": false, "mod_reports": [], "name": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/64q4ld/how_to_forgive_yourself_for_past_mistakes_even_if/", "num_reports": null, "locked": false, "stickied": false, "created": 1491937167.0, "url": "https://www.reddit.com/r/Anxiety/comments/64q4ld/how_to_forgive_yourself_for_past_mistakes_even_if/", "author_flair_text": null, "quarantine": false, "title": "How to forgive yourself for past mistakes? Even if those mistakes lasted for years?", "created_utc": 1491908367.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 69}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg48gom", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "ghost019", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I wish I had more specific advice to give you, but I just wanted to say,  I have the EXACT same problems related to chronic self-loathing, shame, and guilt, and I know how every day is a struggle to cope with being alive. Love &amp; respect to you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I had more specific advice to give you, but I just wanted to say,  I have the EXACT same problems related to chronic self-loathing, shame, and guilt, and I know how every day is a struggle to cope with being alive. Love &amp;amp; respect to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg48gom", "score_hidden": false, "stickied": false, "created": 1491945525.0, "created_utc": 1491916725.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg4lxae", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "gorkt", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I think about how I judge other people when they make mistakes similar to the ones I have made, and I realize that I am WAY harder on myself than other people.  \n\nTo be human is to make mistakes.  There will never be a time where you think \"Oh!  I have figured it out!  No more mistakes for me!\"  \n\nI think you should look into CBT in order to try to reframe your thoughts a little better.  Check out \"Feeling Good\" by David Burns.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think about how I judge other people when they make mistakes similar to the ones I have made, and I realize that I am WAY harder on myself than other people.  &lt;/p&gt;\n\n&lt;p&gt;To be human is to make mistakes.  There will never be a time where you think &amp;quot;Oh!  I have figured it out!  No more mistakes for me!&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;I think you should look into CBT in order to try to reframe your thoughts a little better.  Check out &amp;quot;Feeling Good&amp;quot; by David Burns.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4lxae", "score_hidden": false, "stickied": false, "created": 1491961113.0, "created_utc": 1491932313.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg59etv", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "eliwil", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "First, I want you to know that this post hits really close to home for me. Being on medication and doing yoga/exercise has gotten my anxiety to a very manageable state, but what you've described above is something that I still struggle with. It's been the hardest thing for me to overcome. And I am a person who has made more than a few life-altering mistakes. Some mistakes I've made could've resulted in way worse of an outcome than they did, but I got away by the skin of my teeth somehow. I worry that some day my luck will run out. But I digress. You aren't alone in how you feel and please don't feel like a failure for not being able to overcome it because it is hard! \n\nWhat has helped me is the realization that the feelings of guilt and shame are actually a good thing. It means you've grown as a person, that you possess the self-awareness to understand the impacts of the choices that you make, or have already made, and that you are mature enough to take responsibility for those choices. Congratulations, you've leveled up! Seriously though, the older I get, the more I realize how many people DON'T possess those traits. Sometimes, I wish I didn't because it causes anxiety. But be thankful that you do, because this is how we become better people and move forward in life. Some people honestly never do and blame others for their shortcomings, repeat the same mistakes, and end up becoming their own worst enemy. \n\nMaking mistakes is simply a part of being human. It doesn't make you stupid, reckless, careless, or a bad person. It's wonderful to feel things such as pride, happiness and contentment. It makes our lives feel worth living. But it's not realistic to expect to feel those good things all of the time. Shame, guilt, and anxiety are also part of life and part of being human. I know it's hard, but you've got to accept that. It's OKAY! Nobody on this planet handles every situation perfectly or makes all the right decisions. Everybody has been at the receiving end of undesirable consequences from poor choices they've made. It's what makes us human. \n\nAllow yourself to feel these bad feelings, but know that dwelling on them is unproductive. Turn it into a positive by extracting a lesson from it. Every mistake has a positive side. \n\nThe mistake itself doesn't matter. It's over and done with. You can't go back and change it. All that you have control over now is how you choose to proceed: do you choose to dwell on it and continue to beat yourself up over it (which will accomplish nothing), or do you choose to learn, grow, and move on a wiser and more humble person? Notice the word \"choose\". It is a choice that you can make, that you have control over NOW. No matter which option you choose, it won't change the mistake, so you may as well choose to move on and be happy, and be wiser the next time around and let the past bury its dead. I know that's easier said than done, but sometimes just realizing that can help. \n\nAnyway, I hope this has helped. I wish you the best of luck. Every mistake has a positive side to it, even if it's hard to find...remember that! Forgive yourself and stay optimistic about the future. Take care ♥\n\nEdit: added words", "edited": 1491960778.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First, I want you to know that this post hits really close to home for me. Being on medication and doing yoga/exercise has gotten my anxiety to a very manageable state, but what you&amp;#39;ve described above is something that I still struggle with. It&amp;#39;s been the hardest thing for me to overcome. And I am a person who has made more than a few life-altering mistakes. Some mistakes I&amp;#39;ve made could&amp;#39;ve resulted in way worse of an outcome than they did, but I got away by the skin of my teeth somehow. I worry that some day my luck will run out. But I digress. You aren&amp;#39;t alone in how you feel and please don&amp;#39;t feel like a failure for not being able to overcome it because it is hard! &lt;/p&gt;\n\n&lt;p&gt;What has helped me is the realization that the feelings of guilt and shame are actually a good thing. It means you&amp;#39;ve grown as a person, that you possess the self-awareness to understand the impacts of the choices that you make, or have already made, and that you are mature enough to take responsibility for those choices. Congratulations, you&amp;#39;ve leveled up! Seriously though, the older I get, the more I realize how many people DON&amp;#39;T possess those traits. Sometimes, I wish I didn&amp;#39;t because it causes anxiety. But be thankful that you do, because this is how we become better people and move forward in life. Some people honestly never do and blame others for their shortcomings, repeat the same mistakes, and end up becoming their own worst enemy. &lt;/p&gt;\n\n&lt;p&gt;Making mistakes is simply a part of being human. It doesn&amp;#39;t make you stupid, reckless, careless, or a bad person. It&amp;#39;s wonderful to feel things such as pride, happiness and contentment. It makes our lives feel worth living. But it&amp;#39;s not realistic to expect to feel those good things all of the time. Shame, guilt, and anxiety are also part of life and part of being human. I know it&amp;#39;s hard, but you&amp;#39;ve got to accept that. It&amp;#39;s OKAY! Nobody on this planet handles every situation perfectly or makes all the right decisions. Everybody has been at the receiving end of undesirable consequences from poor choices they&amp;#39;ve made. It&amp;#39;s what makes us human. &lt;/p&gt;\n\n&lt;p&gt;Allow yourself to feel these bad feelings, but know that dwelling on them is unproductive. Turn it into a positive by extracting a lesson from it. Every mistake has a positive side. &lt;/p&gt;\n\n&lt;p&gt;The mistake itself doesn&amp;#39;t matter. It&amp;#39;s over and done with. You can&amp;#39;t go back and change it. All that you have control over now is how you choose to proceed: do you choose to dwell on it and continue to beat yourself up over it (which will accomplish nothing), or do you choose to learn, grow, and move on a wiser and more humble person? Notice the word &amp;quot;choose&amp;quot;. It is a choice that you can make, that you have control over NOW. No matter which option you choose, it won&amp;#39;t change the mistake, so you may as well choose to move on and be happy, and be wiser the next time around and let the past bury its dead. I know that&amp;#39;s easier said than done, but sometimes just realizing that can help. &lt;/p&gt;\n\n&lt;p&gt;Anyway, I hope this has helped. I wish you the best of luck. Every mistake has a positive side to it, even if it&amp;#39;s hard to find...remember that! Forgive yourself and stay optimistic about the future. Take care ♥&lt;/p&gt;\n\n&lt;p&gt;Edit: added words&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg59etv", "score_hidden": false, "stickied": false, "created": 1491989210.0, "created_utc": 1491960410.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg4bb4c", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "PatheticAndAlone", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Sounds familiar. I wish that I knew what to say, but I do not. I have been very unstable and I have made lots of mistakes too. I'm afraid that I will always be like this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds familiar. I wish that I knew what to say, but I do not. I have been very unstable and I have made lots of mistakes too. I&amp;#39;m afraid that I will always be like this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4bb4c", "score_hidden": false, "stickied": false, "created": 1491949288.0, "created_utc": 1491920488.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg4fq8y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Digresssam", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Terribly sorry youre having this issue... I've had it myself, but here's what I've tried  to get myself out of that mindset. In my experience and depending on what it is, I can dwell on a regret for a short amount of time and be in a sour mood for the whole afternoon. When I can feel one of these vibes starting, I try to keep myself busy until I can go to a place by myself to meditate a little (if it helps, I learned that origami or doodling is good distraction for a desk-related job). If I keep myself focused on something specific, then I can't think about beating myself up and over-analyzing things. Then when I get home, I continue the process. Even if it's cleaning the house or playing video games, at least it's keeping me busy (and if I end up cleaning, then at least I'm being productive). Also if it's an issue that can be talked out with a friend/family member/counselor, then I advise talking to someone you feel comfortable talking to. Even if it's just to vent to someone\n\nJust don't go so hard on yourself. Mistakes are going to happen and everyone is just trying to get by. Just remember that tomorrow's a new day. Not every day will be perfect, but once it's in the past you can't really do anything about it except learn from the experience\n\nEdit: fixed a word", "edited": 1491939446.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Terribly sorry youre having this issue... I&amp;#39;ve had it myself, but here&amp;#39;s what I&amp;#39;ve tried  to get myself out of that mindset. In my experience and depending on what it is, I can dwell on a regret for a short amount of time and be in a sour mood for the whole afternoon. When I can feel one of these vibes starting, I try to keep myself busy until I can go to a place by myself to meditate a little (if it helps, I learned that origami or doodling is good distraction for a desk-related job). If I keep myself focused on something specific, then I can&amp;#39;t think about beating myself up and over-analyzing things. Then when I get home, I continue the process. Even if it&amp;#39;s cleaning the house or playing video games, at least it&amp;#39;s keeping me busy (and if I end up cleaning, then at least I&amp;#39;m being productive). Also if it&amp;#39;s an issue that can be talked out with a friend/family member/counselor, then I advise talking to someone you feel comfortable talking to. Even if it&amp;#39;s just to vent to someone&lt;/p&gt;\n\n&lt;p&gt;Just don&amp;#39;t go so hard on yourself. Mistakes are going to happen and everyone is just trying to get by. Just remember that tomorrow&amp;#39;s a new day. Not every day will be perfect, but once it&amp;#39;s in the past you can&amp;#39;t really do anything about it except learn from the experience&lt;/p&gt;\n\n&lt;p&gt;Edit: fixed a word&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4fq8y", "score_hidden": false, "stickied": false, "created": 1491954341.0, "created_utc": 1491925541.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg4ywgr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NerdErrant", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "This is not a general solution,  and may not work for you at all,  but it is the best I have, and I find it useful sometimes. \n\nI find that when I figure out a specific error I made in a situation that I feel guilt over, and then figure out how to avoid doing it again,  a lot of the sting leaves the memory.  \n\nTo work it has to be pretty specific. You can't just say \"don't fuck up\". I'll give you an example. \n\nI bought a new semi-smart phone several years ago to replace my worn out one of the same model. After I had charged it, I  couldn't turn it on. So I returned it to the store as broken and got a replacement.  I  charged it, and it too wouldn't start.  I knew that I knew how to turn it on, but I also knew that the chance that two new phones had identical damage was unlikely.  So after a fit of frustration and anxiety I read the manual to find that I was using the shutdown procedure to try and start it, which of course didn't work. I felt like shit about this for a long time, because in returning a good phone as bad I had essentially destroyed  $100 in value. Then one day I was pointlessly reliving this event, and the thought came to me \"At least next time I'll know to check the manual\", and somehow it relieved much of the guilt. The person that I was now would not screw up like that.  Present me no longer had to relive the guilt, because he would not make that mistake. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is not a general solution,  and may not work for you at all,  but it is the best I have, and I find it useful sometimes. &lt;/p&gt;\n\n&lt;p&gt;I find that when I figure out a specific error I made in a situation that I feel guilt over, and then figure out how to avoid doing it again,  a lot of the sting leaves the memory.  &lt;/p&gt;\n\n&lt;p&gt;To work it has to be pretty specific. You can&amp;#39;t just say &amp;quot;don&amp;#39;t fuck up&amp;quot;. I&amp;#39;ll give you an example. &lt;/p&gt;\n\n&lt;p&gt;I bought a new semi-smart phone several years ago to replace my worn out one of the same model. After I had charged it, I  couldn&amp;#39;t turn it on. So I returned it to the store as broken and got a replacement.  I  charged it, and it too wouldn&amp;#39;t start.  I knew that I knew how to turn it on, but I also knew that the chance that two new phones had identical damage was unlikely.  So after a fit of frustration and anxiety I read the manual to find that I was using the shutdown procedure to try and start it, which of course didn&amp;#39;t work. I felt like shit about this for a long time, because in returning a good phone as bad I had essentially destroyed  $100 in value. Then one day I was pointlessly reliving this event, and the thought came to me &amp;quot;At least next time I&amp;#39;ll know to check the manual&amp;quot;, and somehow it relieved much of the guilt. The person that I was now would not screw up like that.  Present me no longer had to relive the guilt, because he would not make that mistake. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4ywgr", "score_hidden": false, "stickied": false, "created": 1491975502.0, "created_utc": 1491946702.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg52poy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Angela_Cook", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Obviously focusing on past mistakes constantly is bad, but if you feel a *little* bad about past mistakes, it shows you've grown as a person! I'd be hesitant to trust anyone who never feels at least a bit silly about who they were years ago: They haven't changed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Obviously focusing on past mistakes constantly is bad, but if you feel a &lt;em&gt;little&lt;/em&gt; bad about past mistakes, it shows you&amp;#39;ve grown as a person! I&amp;#39;d be hesitant to trust anyone who never feels at least a bit silly about who they were years ago: They haven&amp;#39;t changed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg52poy", "score_hidden": false, "stickied": false, "created": 1491980321.0, "created_utc": 1491951521.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg52wyk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LestrangeGirl", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I have been in your situation and I completely understand the embarrassment and shame you feel. It is very easy to beat yourself up and ruminate when you have made a mistake you view as huge. My advice would be to try to treat yourself the way you would treat a friend. Be kind to yourself. After I was put on academic probation at my university, I became a recluse. I became too embarrassed to talk to advisers, professors and loved ones. I did not reach out for help because I thought of myself as a loser and a failure. My inability to talk about it made the situation so much worse. I finally realized that when I opened up about what I was going through, there were many people who were experiencing the same thing. I even found out that one of of my professors experienced an academic dismissal as an undergraduate student. She became a big advocate for me. I also met an advisor who struggled with anxiety and depression and stopped going to class when she was an undergrad as a result. Hearing these stories from people who work in an academic environment and hold graduate degrees made me feel so much better. You can get out of this slump and come back with a deeper appreciation for your education than you had before. My advice would be to reach out to people at your university. You could even go to counseling if it is offered on your campus. People will understand. You are not alone in your struggles. Besides that, I had to really get a hold of my negative thought patterns. Now when I begin to have negative self-talk, I stop myself and correct the thought. Would you call your friend a loser? Would you consider a family member who made a mistake a total failure? Don't treat yourself worse than you would treat them in the same situation. Good luck and you can message me if you need someone to listen or chat with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have been in your situation and I completely understand the embarrassment and shame you feel. It is very easy to beat yourself up and ruminate when you have made a mistake you view as huge. My advice would be to try to treat yourself the way you would treat a friend. Be kind to yourself. After I was put on academic probation at my university, I became a recluse. I became too embarrassed to talk to advisers, professors and loved ones. I did not reach out for help because I thought of myself as a loser and a failure. My inability to talk about it made the situation so much worse. I finally realized that when I opened up about what I was going through, there were many people who were experiencing the same thing. I even found out that one of of my professors experienced an academic dismissal as an undergraduate student. She became a big advocate for me. I also met an advisor who struggled with anxiety and depression and stopped going to class when she was an undergrad as a result. Hearing these stories from people who work in an academic environment and hold graduate degrees made me feel so much better. You can get out of this slump and come back with a deeper appreciation for your education than you had before. My advice would be to reach out to people at your university. You could even go to counseling if it is offered on your campus. People will understand. You are not alone in your struggles. Besides that, I had to really get a hold of my negative thought patterns. Now when I begin to have negative self-talk, I stop myself and correct the thought. Would you call your friend a loser? Would you consider a family member who made a mistake a total failure? Don&amp;#39;t treat yourself worse than you would treat them in the same situation. Good luck and you can message me if you need someone to listen or chat with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg52wyk", "score_hidden": false, "stickied": false, "created": 1491980591.0, "created_utc": 1491951791.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg5457r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DuchessJulietDG", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I had to come to terms with everything i had done in my past, things i had said that i regretted, and faced them down and admitted to myself i felt bad about it but that i had made the only decision i could at the time. I now have peace with my past, any old thoughts of guilt that come up i just let go easily. It took about a year but i am finally at a place where it no longer serves me to think about. Good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had to come to terms with everything i had done in my past, things i had said that i regretted, and faced them down and admitted to myself i felt bad about it but that i had made the only decision i could at the time. I now have peace with my past, any old thoughts of guilt that come up i just let go easily. It took about a year but i am finally at a place where it no longer serves me to think about. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5457r", "score_hidden": false, "stickied": false, "created": 1491982260.0, "created_utc": 1491953460.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg545t9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Snakeears3333", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I am sure you've received some great feedback so far. \n\nI recently made a massive life altering mistake. I still figuring out how to live life now and face insane moments of guilt, shame and suicidal thoughts. \n\nIn the past, I learned to forgive myself and recognizing the moment I was ruminating, by pointing to the thought in my mind and saying \"stop, that's the past, let's move on\" \n\nOddly simple, but it worked and perhaps my regrets were simple.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sure you&amp;#39;ve received some great feedback so far. &lt;/p&gt;\n\n&lt;p&gt;I recently made a massive life altering mistake. I still figuring out how to live life now and face insane moments of guilt, shame and suicidal thoughts. &lt;/p&gt;\n\n&lt;p&gt;In the past, I learned to forgive myself and recognizing the moment I was ruminating, by pointing to the thought in my mind and saying &amp;quot;stop, that&amp;#39;s the past, let&amp;#39;s move on&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Oddly simple, but it worked and perhaps my regrets were simple.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg545t9", "score_hidden": false, "stickied": false, "created": 1491982283.0, "created_utc": 1491953483.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg5iagc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tegix62", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "You said it pretty well, hard question to answer\n\nThis might be more stream-of-thought but I think there's some helpful advice somewhere in what I have to say:\n\nI always think that I should strive to be the best person I can possibly be, so when I make mistakes I also obsess over them, over-examine what went wrong and how not to do it again, and if I make the same mistake twice then I'm even more self-critical.  People tell me it's irrational, but I think I have a worldview that makes me stuck in this position.  I almost feel like I can't stop over-analyzing otherwise I'm not being the best person I can be.  It's a prominent train-of-thought that I run into and I can't really answer it very well.\n\nWhat I've been told that helps combat this worldview:\n\n1) People are obviously more critical of themselves than of anyone else.  This means in a way you and I are not alone in being self-critical, but also that people aren't even focusing on your own self-criticism.  If you're self-critical about something in the present, it helps to realize the likelihood of anyone else being super-critical of you is very very low.  They're too focused on themselves.  They'll notice their shoes are untied before they notice yours are, if they even notice yours at all.\n\n2)  There's a middle-ground to find between self-examination and just letting life live.  Though I'm stuck in this \"best-person-I-can-possibly-be\" mindset, I can at least admit I'm not the best person I can possibly be if I'm too stuck in my room contemplating my mistakes to even be an active individual.\n\n3)  I don't know why the fuck I'm so afraid of making mistakes.  Mistakes are fantastic.  They are what makes us grow as humans.  I should be making more mistakes, to be frank.  Sometimes my anxiety is so bad I'm scared of tripping in a public place; but in retrospect it would actually be fucking hilarious if I fell flat on my face.  I would laugh about that if it actually happened.  I mean, I always thought of myself as a person who doesn't take himself too seriously, but wow my anxiety really challenges that idea of myself.\n\n4)  I often don't trust myself enough.  Most mistakes we make in life we'll never repeat, but I still often keep myself on my toes about making some dumb mistake again when really, in reality, I more than likely won't make that mistake ever again.  This doesn't apply to every mistake in the world, but it applies to most of them.  So it's like being too ready, to cautious, when you really don't need to be.  I'm slowly working my way out of this.\n\nIt took a lot of repetition to learn most of these principles, funnily enough.  You don't learn life lessons immediately, it takes a couple instances for you to really get it.  In my case, the counsellor had to remind me a few times before it became a truth I knew myself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You said it pretty well, hard question to answer&lt;/p&gt;\n\n&lt;p&gt;This might be more stream-of-thought but I think there&amp;#39;s some helpful advice somewhere in what I have to say:&lt;/p&gt;\n\n&lt;p&gt;I always think that I should strive to be the best person I can possibly be, so when I make mistakes I also obsess over them, over-examine what went wrong and how not to do it again, and if I make the same mistake twice then I&amp;#39;m even more self-critical.  People tell me it&amp;#39;s irrational, but I think I have a worldview that makes me stuck in this position.  I almost feel like I can&amp;#39;t stop over-analyzing otherwise I&amp;#39;m not being the best person I can be.  It&amp;#39;s a prominent train-of-thought that I run into and I can&amp;#39;t really answer it very well.&lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;ve been told that helps combat this worldview:&lt;/p&gt;\n\n&lt;p&gt;1) People are obviously more critical of themselves than of anyone else.  This means in a way you and I are not alone in being self-critical, but also that people aren&amp;#39;t even focusing on your own self-criticism.  If you&amp;#39;re self-critical about something in the present, it helps to realize the likelihood of anyone else being super-critical of you is very very low.  They&amp;#39;re too focused on themselves.  They&amp;#39;ll notice their shoes are untied before they notice yours are, if they even notice yours at all.&lt;/p&gt;\n\n&lt;p&gt;2)  There&amp;#39;s a middle-ground to find between self-examination and just letting life live.  Though I&amp;#39;m stuck in this &amp;quot;best-person-I-can-possibly-be&amp;quot; mindset, I can at least admit I&amp;#39;m not the best person I can possibly be if I&amp;#39;m too stuck in my room contemplating my mistakes to even be an active individual.&lt;/p&gt;\n\n&lt;p&gt;3)  I don&amp;#39;t know why the fuck I&amp;#39;m so afraid of making mistakes.  Mistakes are fantastic.  They are what makes us grow as humans.  I should be making more mistakes, to be frank.  Sometimes my anxiety is so bad I&amp;#39;m scared of tripping in a public place; but in retrospect it would actually be fucking hilarious if I fell flat on my face.  I would laugh about that if it actually happened.  I mean, I always thought of myself as a person who doesn&amp;#39;t take himself too seriously, but wow my anxiety really challenges that idea of myself.&lt;/p&gt;\n\n&lt;p&gt;4)  I often don&amp;#39;t trust myself enough.  Most mistakes we make in life we&amp;#39;ll never repeat, but I still often keep myself on my toes about making some dumb mistake again when really, in reality, I more than likely won&amp;#39;t make that mistake ever again.  This doesn&amp;#39;t apply to every mistake in the world, but it applies to most of them.  So it&amp;#39;s like being too ready, to cautious, when you really don&amp;#39;t need to be.  I&amp;#39;m slowly working my way out of this.&lt;/p&gt;\n\n&lt;p&gt;It took a lot of repetition to learn most of these principles, funnily enough.  You don&amp;#39;t learn life lessons immediately, it takes a couple instances for you to really get it.  In my case, the counsellor had to remind me a few times before it became a truth I knew myself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5iagc", "score_hidden": false, "stickied": false, "created": 1492002657.0, "created_utc": 1491973857.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64q4ld", "likes": null, "replies": "", "user_reports": [], "id": "dg4nyf3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lovelene_18", "parent_id": "t3_64q4ld", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I have felt (and sometimes still feel) what you're describing.  I can't say it as well as Joe Rogan so here's the link:\n\nhttps://www.youtube.com/watch?v=-mFdlua8OS0\n\nBasically, you are not your past.  Everyone... EVERYONE makes mistakes.  Everyone has done something they are ashamed of. Everyone has fucked up.  There is no such thing as being perfect.  So what is my advice? Learn from it.  Use it as motivation to be a better person.   \n\nI suffer from some anxiety too.  I find that mantras really help me.  I have different mantras for different issues but when i feel like what you described, i repeat to myself \"My past does not define who I am today\" \n\n(I absolutely love joe rogan - there are main motivational videos of his.  Here's antoher one: https://www.youtube.com/watch?v=cuAvi5-cvC0) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have felt (and sometimes still feel) what you&amp;#39;re describing.  I can&amp;#39;t say it as well as Joe Rogan so here&amp;#39;s the link:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=-mFdlua8OS0\"&gt;https://www.youtube.com/watch?v=-mFdlua8OS0&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Basically, you are not your past.  Everyone... EVERYONE makes mistakes.  Everyone has done something they are ashamed of. Everyone has fucked up.  There is no such thing as being perfect.  So what is my advice? Learn from it.  Use it as motivation to be a better person.   &lt;/p&gt;\n\n&lt;p&gt;I suffer from some anxiety too.  I find that mantras really help me.  I have different mantras for different issues but when i feel like what you described, i repeat to myself &amp;quot;My past does not define who I am today&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;(I absolutely love joe rogan - there are main motivational videos of his.  Here&amp;#39;s antoher one: &lt;a href=\"https://www.youtube.com/watch?v=cuAvi5-cvC0\"&gt;https://www.youtube.com/watch?v=cuAvi5-cvC0&lt;/a&gt;) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4nyf3", "score_hidden": false, "stickied": false, "created": 1491963346.0, "created_utc": 1491934546.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]