[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m about to enter a field where I interact with a lot of people every day, and I have a genuine interest in helping others. But how do I get over my fear of people not liking me or thinking I&amp;#39;m awkward? Does interacting with people just get easier with practice? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm about to enter a field where I interact with a lot of people every day, and I have a genuine interest in helping others. But how do I get over my fear of people not liking me or thinking I'm awkward? Does interacting with people just get easier with practice? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "DAE Questions", "id": "64rghg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "frazzledpistachio", "saved": false, "mod_reports": [], "name": "t3_64rghg", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": "daeflair", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/64rghg/has_anyone_else_had_a_successful_job_working_with/", "num_reports": null, "locked": false, "stickied": false, "created": 1491952728.0, "url": "https://www.reddit.com/r/Anxiety/comments/64rghg/has_anyone_else_had_a_successful_job_working_with/", "author_flair_text": null, "quarantine": false, "title": "Has anyone else had a successful job working with people despite having social anxiety?", "created_utc": 1491923928.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64rghg", "likes": null, "replies": "", "user_reports": [], "id": "dg4nxl5", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "DespondentDeity", "parent_id": "t3_64rghg", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I moved from working nights in a hotel to being a social worker in a group home that's part of a psychiatric rehabilitation program. The adjustment was difficult and there were numerous times I thought I'd never make it, but now I've been promoted to the lead at the group and may move into crisis stabilization soon. I think I've found that the pressure of what I do, being responsible for people's safety and well-being, has pushed me farther than I'd ever dreamed possible. I've also overcome many of my doubts about who I am as a person, as well as discovered some of my limits which has helped me build up an empowering sense of confidence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I moved from working nights in a hotel to being a social worker in a group home that&amp;#39;s part of a psychiatric rehabilitation program. The adjustment was difficult and there were numerous times I thought I&amp;#39;d never make it, but now I&amp;#39;ve been promoted to the lead at the group and may move into crisis stabilization soon. I think I&amp;#39;ve found that the pressure of what I do, being responsible for people&amp;#39;s safety and well-being, has pushed me farther than I&amp;#39;d ever dreamed possible. I&amp;#39;ve also overcome many of my doubts about who I am as a person, as well as discovered some of my limits which has helped me build up an empowering sense of confidence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4nxl5", "score_hidden": false, "stickied": false, "created": 1491963320.0, "created_utc": 1491934520.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64rghg", "likes": null, "replies": "", "user_reports": [], "id": "dg4utmj", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "QueenieQueeferson", "parent_id": "t3_64rghg", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I put on an act, basically. I pretend to be confident whilst at work and then come home and fester in my pit of anxiety. Telephone calls have gotten easier over time and my heart doesn't pound every time I have to pick the phone up now. I would say I am pretty well liked and good at my job despite my setbacks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I put on an act, basically. I pretend to be confident whilst at work and then come home and fester in my pit of anxiety. Telephone calls have gotten easier over time and my heart doesn&amp;#39;t pound every time I have to pick the phone up now. I would say I am pretty well liked and good at my job despite my setbacks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4utmj", "score_hidden": false, "stickied": false, "created": 1491970769.0, "created_utc": 1491941969.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64rghg", "likes": null, "replies": "", "user_reports": [], "id": "dg4o4sc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "coky18", "parent_id": "t3_64rghg", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I paradoxically worked in Automotive sales. I went from being unable to interact socially, to my job being literally to make friends with multiple strangers a day. I went from being unable to eat to eating without issue, every day, at work. I did this for 6 years with little to no anxiety issues popping up. It wasn't until 2 years ago that lots of significant events made me have to leave that career, and relapse into Anxiety. \n\nIt's a huge shock going from fully-function, proud, confident, making good money, wearing nice clothes,\n\nTo being unable to leave the house, incapable of proper nourishment, and having a big bushy beard that makes me look homeless. \n\nI remember my Psychiatrist came to the dealership once and bought a car. He was shocked and amazed to see that I Worked there. \"You work in sales? and  you're eating?!\" I was so proud. I said it was because of him.\n\nI was very good at what I did and my old manager has told me many times he can get me a job at a range of other dealerships, but i'm still physically incapable of taking care of myself properly. Unfortunately still suffering from intense symptoms and side effects from discontinuing psychiatric medications.\n\n\nSo yes. It's definitely possible. Even though it sounds so paradoxical and counter-intuitive. I went from extreme anxiety to succeeding at a job that was based around human interaction every-day. I'm both very proud and deeply disappointed that I Was able to, but have since lost, that part of my life.\n\nI never would have thought I would do what I did. I look back now and have no idea how I did what I did. I look back in my mind and its as if i'm looking at a totally different person, with different issues, different drives, different personality. It's crazy.\n\nIt's possible. It's very possible. I think people who suffer from anxiety also tend to have a higher level of intellect that lends itself to success. I think people like us end up being super successful. The problem is getting over the part of you that thinks you can't be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I paradoxically worked in Automotive sales. I went from being unable to interact socially, to my job being literally to make friends with multiple strangers a day. I went from being unable to eat to eating without issue, every day, at work. I did this for 6 years with little to no anxiety issues popping up. It wasn&amp;#39;t until 2 years ago that lots of significant events made me have to leave that career, and relapse into Anxiety. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a huge shock going from fully-function, proud, confident, making good money, wearing nice clothes,&lt;/p&gt;\n\n&lt;p&gt;To being unable to leave the house, incapable of proper nourishment, and having a big bushy beard that makes me look homeless. &lt;/p&gt;\n\n&lt;p&gt;I remember my Psychiatrist came to the dealership once and bought a car. He was shocked and amazed to see that I Worked there. &amp;quot;You work in sales? and  you&amp;#39;re eating?!&amp;quot; I was so proud. I said it was because of him.&lt;/p&gt;\n\n&lt;p&gt;I was very good at what I did and my old manager has told me many times he can get me a job at a range of other dealerships, but i&amp;#39;m still physically incapable of taking care of myself properly. Unfortunately still suffering from intense symptoms and side effects from discontinuing psychiatric medications.&lt;/p&gt;\n\n&lt;p&gt;So yes. It&amp;#39;s definitely possible. Even though it sounds so paradoxical and counter-intuitive. I went from extreme anxiety to succeeding at a job that was based around human interaction every-day. I&amp;#39;m both very proud and deeply disappointed that I Was able to, but have since lost, that part of my life.&lt;/p&gt;\n\n&lt;p&gt;I never would have thought I would do what I did. I look back now and have no idea how I did what I did. I look back in my mind and its as if i&amp;#39;m looking at a totally different person, with different issues, different drives, different personality. It&amp;#39;s crazy.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s possible. It&amp;#39;s very possible. I think people who suffer from anxiety also tend to have a higher level of intellect that lends itself to success. I think people like us end up being super successful. The problem is getting over the part of you that thinks you can&amp;#39;t be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4o4sc", "score_hidden": false, "stickied": false, "created": 1491963541.0, "created_utc": 1491934741.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64rghg", "likes": null, "replies": "", "user_reports": [], "id": "dg4j2w7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PooFartChamp", "parent_id": "t3_64rghg", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "yeah, i worked in retail for about 15 years and it allowed me to circumvent my anxiety and was actually very rewarding in that respect.\n\nThing about jobs like that is that it puts you in a clear position of authority/expertise, which in my case seems to alleviate most anxiety I would otherwise have.  \n\nI was most at ease in a position where I was working for a cell carrier, since technology is something im very interested in, and I'm not sure if you're like me but when I am very comfortable speaking to people about a specific subject im interested in.\n\nIt also helped outside of work as well, as I feel like it gave me a confidence bump and put me in \"the zone\", so to speak.  I'm in a desk job role now and I definitely can tell a difference in confidence and just general happiness/anxiety with the change.  I dont feel as satisfied as I did when I was working with people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah, i worked in retail for about 15 years and it allowed me to circumvent my anxiety and was actually very rewarding in that respect.&lt;/p&gt;\n\n&lt;p&gt;Thing about jobs like that is that it puts you in a clear position of authority/expertise, which in my case seems to alleviate most anxiety I would otherwise have.  &lt;/p&gt;\n\n&lt;p&gt;I was most at ease in a position where I was working for a cell carrier, since technology is something im very interested in, and I&amp;#39;m not sure if you&amp;#39;re like me but when I am very comfortable speaking to people about a specific subject im interested in.&lt;/p&gt;\n\n&lt;p&gt;It also helped outside of work as well, as I feel like it gave me a confidence bump and put me in &amp;quot;the zone&amp;quot;, so to speak.  I&amp;#39;m in a desk job role now and I definitely can tell a difference in confidence and just general happiness/anxiety with the change.  I dont feel as satisfied as I did when I was working with people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4j2w7", "score_hidden": false, "stickied": false, "created": 1491958013.0, "created_utc": 1491929213.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64rghg", "likes": null, "replies": "", "user_reports": [], "id": "dg4qars", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MissyTheSnake", "parent_id": "t3_64rghg", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I am a fire marshal and I had some serious anxiety and self confidence issues. To give you an idea of what I do on a daily basis, I have to investigate fires (which includes interviewing witnesses and property owners and first responders), do fire and life safety inspections (tell people they need to fix this and that even though it's expensive because somewhere in a 5,000 page book it says they have to), and teach fire safety to large groups of people (by myself most of the time). \n\nI am lucky because I have a boyfriend who is genuinely interested in helping me build my confidence and embrace myself for who I am - awkwardness and lack of grace and anxiety and all. One of the ways I have grown to move past my issues is that I have come to realize that if you sound confident, people think you're confident. Plenty of times I've been internally screaming and cringing... like saying something wrong or backwards or just generally being awkward... and just accepting that it happened and acting like that's the way it I meant it to be and it's completely normal. \"Accepting\" it isn't the peaceful experience that I was led to believe - it was more of an internal scream, and telling myself I can't quit now I'm too deep into it. I get those feelings less and less now.\n\nThrough college I challenged myself to take every public speaking engagement offered - all my class presentations, etc.... it's practice! It's definitely possible! I won't tell you t was easy, but it gets easier and it gets better. You're going to do great! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a fire marshal and I had some serious anxiety and self confidence issues. To give you an idea of what I do on a daily basis, I have to investigate fires (which includes interviewing witnesses and property owners and first responders), do fire and life safety inspections (tell people they need to fix this and that even though it&amp;#39;s expensive because somewhere in a 5,000 page book it says they have to), and teach fire safety to large groups of people (by myself most of the time). &lt;/p&gt;\n\n&lt;p&gt;I am lucky because I have a boyfriend who is genuinely interested in helping me build my confidence and embrace myself for who I am - awkwardness and lack of grace and anxiety and all. One of the ways I have grown to move past my issues is that I have come to realize that if you sound confident, people think you&amp;#39;re confident. Plenty of times I&amp;#39;ve been internally screaming and cringing... like saying something wrong or backwards or just generally being awkward... and just accepting that it happened and acting like that&amp;#39;s the way it I meant it to be and it&amp;#39;s completely normal. &amp;quot;Accepting&amp;quot; it isn&amp;#39;t the peaceful experience that I was led to believe - it was more of an internal scream, and telling myself I can&amp;#39;t quit now I&amp;#39;m too deep into it. I get those feelings less and less now.&lt;/p&gt;\n\n&lt;p&gt;Through college I challenged myself to take every public speaking engagement offered - all my class presentations, etc.... it&amp;#39;s practice! It&amp;#39;s definitely possible! I won&amp;#39;t tell you t was easy, but it gets easier and it gets better. You&amp;#39;re going to do great! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4qars", "score_hidden": false, "stickied": false, "created": 1491965873.0, "created_utc": 1491937073.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64rghg", "likes": null, "replies": "", "user_reports": [], "id": "dg50yc5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "I_redidate", "parent_id": "t3_64rghg", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I worked at a job where I had to interact with roughly 50+ people a day. It wasn't a particularly easy job since I had to watch over people and make sure they pay me before leaving my 'workplace'. \n\nIt helped my anxiety tremendously overtime though. I just got in the mind frame that instead of being paid for the actual job, I pretended I was getting paid for being confident, outgoing etc. with the customers.\n\nBest of luck!\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I worked at a job where I had to interact with roughly 50+ people a day. It wasn&amp;#39;t a particularly easy job since I had to watch over people and make sure they pay me before leaving my &amp;#39;workplace&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;It helped my anxiety tremendously overtime though. I just got in the mind frame that instead of being paid for the actual job, I pretended I was getting paid for being confident, outgoing etc. with the customers.&lt;/p&gt;\n\n&lt;p&gt;Best of luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg50yc5", "score_hidden": false, "stickied": false, "created": 1491978055.0, "created_utc": 1491949255.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64rghg", "likes": null, "replies": "", "user_reports": [], "id": "dg53nxo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thewondersoverboard", "parent_id": "t3_64rghg", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Me working at a grocery store and taking my meds. I'm a chatter box I found out! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Me working at a grocery store and taking my meds. I&amp;#39;m a chatter box I found out! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg53nxo", "score_hidden": false, "stickied": false, "created": 1491981614.0, "created_utc": 1491952814.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64rghg", "likes": null, "replies": "", "user_reports": [], "id": "dg5e3ol", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Danie751", "parent_id": "t3_64rghg", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Yes :) I think of my anxiety and PTSD as a seperate thing to me in a way. When I'm well rested and strong I can challenge my anxiety and accept the symptoms for what they are and a lot of the time I am that. But there are days when I feel drained and sad. Those days I chill and do soothing things.\n\nBut during both states I am a singing teacher and teach one on one. I do mindfullness before lessons and treat myself after lessons :)\n\nJust find a way to help yourself cope through it.\nCheck it sensory modulation!\nIt helps during my lessons a lot. I burn lavender in the house cause it's calming to me and I have a rock I hold to ground me :)\n\nHope something in here helps :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes :) I think of my anxiety and PTSD as a seperate thing to me in a way. When I&amp;#39;m well rested and strong I can challenge my anxiety and accept the symptoms for what they are and a lot of the time I am that. But there are days when I feel drained and sad. Those days I chill and do soothing things.&lt;/p&gt;\n\n&lt;p&gt;But during both states I am a singing teacher and teach one on one. I do mindfullness before lessons and treat myself after lessons :)&lt;/p&gt;\n\n&lt;p&gt;Just find a way to help yourself cope through it.\nCheck it sensory modulation!\nIt helps during my lessons a lot. I burn lavender in the house cause it&amp;#39;s calming to me and I have a rock I hold to ground me :)&lt;/p&gt;\n\n&lt;p&gt;Hope something in here helps :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5e3ol", "score_hidden": false, "stickied": false, "created": 1491995619.0, "created_utc": 1491966819.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64rghg", "likes": null, "replies": "", "user_reports": [], "id": "dg64scc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kitaxhakuu", "parent_id": "t3_64rghg", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I used to have a crippling fear of speaking on the phone. As in, I couldn't call someone to cancel a plan I no longer needed, so Id waste a hundred dollars just because I dreaded making a call. \nAfter my job for the first two years, where I was allowed to be eased into calling customers about a product I made, I could then talk to anyone on the phone. It definitely gets easier with practice!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to have a crippling fear of speaking on the phone. As in, I couldn&amp;#39;t call someone to cancel a plan I no longer needed, so Id waste a hundred dollars just because I dreaded making a call. \nAfter my job for the first two years, where I was allowed to be eased into calling customers about a product I made, I could then talk to anyone on the phone. It definitely gets easier with practice!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg64scc", "score_hidden": false, "stickied": false, "created": 1492044047.0, "created_utc": 1492015247.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64rghg", "likes": null, "replies": "", "user_reports": [], "id": "dg4pyfq", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "SmarkyMcFly", "parent_id": "t3_64rghg", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "No.  I've learned that people will make whatever fucking assumption they'd like about you, and that to them is fact.  Drop this whole notion of helping people, people don't want to be helped.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No.  I&amp;#39;ve learned that people will make whatever fucking assumption they&amp;#39;d like about you, and that to them is fact.  Drop this whole notion of helping people, people don&amp;#39;t want to be helped.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4pyfq", "score_hidden": false, "stickied": false, "created": 1491965518.0, "created_utc": 1491936718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]