[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m under the impression that therapy and medication only work when you&amp;#39;re actively using them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm under the impression that therapy and medication only work when you're actively using them.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64t701", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "Found_Your_Shit", "saved": false, "mod_reports": [], "name": "t3_64t701", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/64t701/are_there_actually_any_long_term_solutions/", "num_reports": null, "locked": false, "stickied": false, "created": 1491968506.0, "url": "https://www.reddit.com/r/Anxiety/comments/64t701/are_there_actually_any_long_term_solutions/", "author_flair_text": null, "quarantine": false, "title": "Are there actually any long term solutions?", "created_utc": 1491939706.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64t701", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64t701", "likes": null, "replies": "", "user_reports": [], "id": "dg52t0z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheLegendTwoSeven", "parent_id": "t1_dg4x88e", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "You're definitely right that there is a sort of survival reason for anxiety. I think in those with anxious tendencies, we have a heightened anxiety response that becomes more of a liability than a benefit, getting us stressed when there are no worthy threats. But someone with no fear is usually going to be very reckless, that's not good either. \n\nI used to totally discredit things like meditation, exercise, eating healthy, laughing with friends, etc, but they make a big difference. It's not like a light switch, like you said it's a gradual kind of thing. I think of it as strengthening non-anxiety pathways in the brain.\n\nI think almost all of us have certain other brain pathways that get strengthened through healthy activities. And then there's the \"anxiety muscle\" if you will. That anxiety muscle will remain strong for life - but building up the healthier brain pathways makes the anxiety muscle kind of just sit there, and it stops. It's there waiting, and always will be, but for many people, there are ways to avoid triggering the anxiety muscle and being ruled by it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re definitely right that there is a sort of survival reason for anxiety. I think in those with anxious tendencies, we have a heightened anxiety response that becomes more of a liability than a benefit, getting us stressed when there are no worthy threats. But someone with no fear is usually going to be very reckless, that&amp;#39;s not good either. &lt;/p&gt;\n\n&lt;p&gt;I used to totally discredit things like meditation, exercise, eating healthy, laughing with friends, etc, but they make a big difference. It&amp;#39;s not like a light switch, like you said it&amp;#39;s a gradual kind of thing. I think of it as strengthening non-anxiety pathways in the brain.&lt;/p&gt;\n\n&lt;p&gt;I think almost all of us have certain other brain pathways that get strengthened through healthy activities. And then there&amp;#39;s the &amp;quot;anxiety muscle&amp;quot; if you will. That anxiety muscle will remain strong for life - but building up the healthier brain pathways makes the anxiety muscle kind of just sit there, and it stops. It&amp;#39;s there waiting, and always will be, but for many people, there are ways to avoid triggering the anxiety muscle and being ruled by it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg52t0z", "score_hidden": false, "stickied": false, "created": 1491980443.0, "created_utc": 1491951643.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4x88e", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "HumbertHaze", "parent_id": "t3_64t701", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Anxiety will always wax and wane. You may go a long time, even years, being relatively anxiety free. Obviously you can't ever just stop worrying, nor should you want to anyway. A manageable level of anxiety will help you in life because it'll give you drive to succeed and to work hard. \n\n\nIssues begin however when your level of anxiety becomes unmanageable, and the anxiety seems to try its absolute hardest to derail your life in every way that it can. That's why we're all here. With the right combination of techniques (I will always vouch for exercise, meditation and healthy eating even if they don't initially appear to do anything) you can climb out of this hole and live your life again as you want to. Of course you'll relapse from time to time but that's unavoidable. As Obama said you just have to pick yourself up, dust yourself off and try again. The fight's always worth it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anxiety will always wax and wane. You may go a long time, even years, being relatively anxiety free. Obviously you can&amp;#39;t ever just stop worrying, nor should you want to anyway. A manageable level of anxiety will help you in life because it&amp;#39;ll give you drive to succeed and to work hard. &lt;/p&gt;\n\n&lt;p&gt;Issues begin however when your level of anxiety becomes unmanageable, and the anxiety seems to try its absolute hardest to derail your life in every way that it can. That&amp;#39;s why we&amp;#39;re all here. With the right combination of techniques (I will always vouch for exercise, meditation and healthy eating even if they don&amp;#39;t initially appear to do anything) you can climb out of this hole and live your life again as you want to. Of course you&amp;#39;ll relapse from time to time but that&amp;#39;s unavoidable. As Obama said you just have to pick yourself up, dust yourself off and try again. The fight&amp;#39;s always worth it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4x88e", "score_hidden": false, "stickied": false, "created": 1491973489.0, "created_utc": 1491944689.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64t701", "likes": null, "replies": "", "user_reports": [], "id": "dg4swc5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "fourdimethylt", "parent_id": "t3_64t701", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I don't think there are any solutions. Just semi-effective, impermanent treatments. Humanity just hasn't solved this one, yet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think there are any solutions. Just semi-effective, impermanent treatments. Humanity just hasn&amp;#39;t solved this one, yet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4swc5", "score_hidden": false, "stickied": false, "created": 1491968656.0, "created_utc": 1491939856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64t701", "likes": null, "replies": "", "user_reports": [], "id": "dg4xed7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SmarkyMcFly", "parent_id": "t3_64t701", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Nope.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nope.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4xed7", "score_hidden": false, "stickied": false, "created": 1491973693.0, "created_utc": 1491944893.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64t701", "likes": null, "replies": "", "user_reports": [], "id": "dg5am94", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "oneofmanyhumans", "parent_id": "t3_64t701", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "For me, working out several times a week for over a year has greatly reduced my chronic anxiety!  I have always felt like I was somewhat improving but this past year things have turned around even more.  When I'm feeling anxious about a subject, I'll think of it while exercising so I get endorphins connected to the thoughts, instead of the anxious-chemicals.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me, working out several times a week for over a year has greatly reduced my chronic anxiety!  I have always felt like I was somewhat improving but this past year things have turned around even more.  When I&amp;#39;m feeling anxious about a subject, I&amp;#39;ll think of it while exercising so I get endorphins connected to the thoughts, instead of the anxious-chemicals.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5am94", "score_hidden": false, "stickied": false, "created": 1491990795.0, "created_utc": 1491961995.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64t701", "likes": null, "replies": "", "user_reports": [], "id": "dg527lp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheLegendTwoSeven", "parent_id": "t3_64t701", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "There definitely are long term solutions! But I don't mean there's a \"one and done\" permanent solution that works 100% for everyone. But are there things that can make a lot of people a lot less anxious? Yes. Can those things work for years, decades... a lifetime? Yes.\n\nSome people, if they develop a daily meditation practice, eat healthily, work in a fulfilling job that isn't too stressful, exercise regularly, see a therapist, have hobbies that they enjoy, get the proper amount of sleep every night, have a great relationship with a compatible significant other, and have a bunch of close friends they regularly interact with in person - they'll feel a lot less anxious. \n\nOne person could do all of the above, yet still have daily panic attacks. Another person could have their anxiety drop 99% doing the same things.\n\nI would try to avoid thought cycles that lead to getting anxious about getting anxious. One of the things that can help along the way is trying to figure out certain thought cycles that lead to more anxiety, recognizing them, and then not going down that thought path. \n\nThat's something that meditation has helped me with - and I also think that that can be a long-term benefit of therapy as well. The right therapist can help someone figure out their own cycles and then the person might be able to develop coping mechanisms, where they can de-rail some of the anxious thoughts before they snowball. Over time that can sometimes lead to less of those triggering anxious thoughts and make it easier.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There definitely are long term solutions! But I don&amp;#39;t mean there&amp;#39;s a &amp;quot;one and done&amp;quot; permanent solution that works 100% for everyone. But are there things that can make a lot of people a lot less anxious? Yes. Can those things work for years, decades... a lifetime? Yes.&lt;/p&gt;\n\n&lt;p&gt;Some people, if they develop a daily meditation practice, eat healthily, work in a fulfilling job that isn&amp;#39;t too stressful, exercise regularly, see a therapist, have hobbies that they enjoy, get the proper amount of sleep every night, have a great relationship with a compatible significant other, and have a bunch of close friends they regularly interact with in person - they&amp;#39;ll feel a lot less anxious. &lt;/p&gt;\n\n&lt;p&gt;One person could do all of the above, yet still have daily panic attacks. Another person could have their anxiety drop 99% doing the same things.&lt;/p&gt;\n\n&lt;p&gt;I would try to avoid thought cycles that lead to getting anxious about getting anxious. One of the things that can help along the way is trying to figure out certain thought cycles that lead to more anxiety, recognizing them, and then not going down that thought path. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s something that meditation has helped me with - and I also think that that can be a long-term benefit of therapy as well. The right therapist can help someone figure out their own cycles and then the person might be able to develop coping mechanisms, where they can de-rail some of the anxious thoughts before they snowball. Over time that can sometimes lead to less of those triggering anxious thoughts and make it easier.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg527lp", "score_hidden": false, "stickied": false, "created": 1491979666.0, "created_utc": 1491950866.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64t701", "likes": null, "replies": "", "user_reports": [], "id": "dg56xav", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jessonic", "parent_id": "t3_64t701", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Anxiety was first diagnosed in 1980. I'm sure there were many cases before it was first recognised in the 80s. It's a hit and miss. Our brain waves are different. Anxiety is caused by stress and/or nerves. Which we all get stressed and nervous about different things. \n\nIt's more of the matter of programming yourself to refuse to accept what stresses you out or what makes you nervous. What is easier said than done, right? \n\nEveryone's brains are different. Which makes our anxiety different also. I believe cancer will be cured first before they ever find a permanent fix to anxiety.\n\nBut that being said. It doesn't hurt to get help. I tried it and it didn't work for me. But doesn't mean it won't work for you ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anxiety was first diagnosed in 1980. I&amp;#39;m sure there were many cases before it was first recognised in the 80s. It&amp;#39;s a hit and miss. Our brain waves are different. Anxiety is caused by stress and/or nerves. Which we all get stressed and nervous about different things. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s more of the matter of programming yourself to refuse to accept what stresses you out or what makes you nervous. What is easier said than done, right? &lt;/p&gt;\n\n&lt;p&gt;Everyone&amp;#39;s brains are different. Which makes our anxiety different also. I believe cancer will be cured first before they ever find a permanent fix to anxiety.&lt;/p&gt;\n\n&lt;p&gt;But that being said. It doesn&amp;#39;t hurt to get help. I tried it and it didn&amp;#39;t work for me. But doesn&amp;#39;t mean it won&amp;#39;t work for you &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg56xav", "score_hidden": false, "stickied": false, "created": 1491985985.0, "created_utc": 1491957185.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64t701", "likes": null, "replies": "", "user_reports": [], "id": "dg5eds1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ApexMN", "parent_id": "t3_64t701", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Yep, there are absolutely long-term solutions. As to your comment about therapy and medication only working when you're actively using them - you're not essentially wrong here. Think of a marathon runner, and now imagine this runner stops running and training - it would be fair to assume that they will struggle to run a marathon right? It's something that will require work over time and that amount of work differs, but as you keep working it will go down.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, there are absolutely long-term solutions. As to your comment about therapy and medication only working when you&amp;#39;re actively using them - you&amp;#39;re not essentially wrong here. Think of a marathon runner, and now imagine this runner stops running and training - it would be fair to assume that they will struggle to run a marathon right? It&amp;#39;s something that will require work over time and that amount of work differs, but as you keep working it will go down.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5eds1", "score_hidden": false, "stickied": false, "created": 1491996034.0, "created_utc": 1491967234.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64t701", "likes": null, "replies": "", "user_reports": [], "id": "dg5j5fl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "the_red_and_the_blac", "parent_id": "t3_64t701", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "If you face your fears, you will grow stronger. Anxiety will not seem so scary when you have a past full of victories.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you face your fears, you will grow stronger. Anxiety will not seem so scary when you have a past full of victories.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5j5fl", "score_hidden": false, "stickied": false, "created": 1492004365.0, "created_utc": 1491975565.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]