[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had anxiety basically all my life but about five years ago that developed into a crippling fear of eating in front of people. I used to skip parties and everything just to avoid it and I&amp;#39;ve lost so much weight because I don&amp;#39;t eat at school. Well, my Prom is coming up, and there&amp;#39;s a three course meal, and it&amp;#39;s front of friends, who are the hardest to eat in front of. Does anyone have any advice on how to ease a fear of eating? I sometimes get so anxious about it that I throw up. Does this part of anxiety ever go away?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've had anxiety basically all my life but about five years ago that developed into a crippling fear of eating in front of people. I used to skip parties and everything just to avoid it and I've lost so much weight because I don't eat at school. Well, my Prom is coming up, and there's a three course meal, and it's front of friends, who are the hardest to eat in front of. Does anyone have any advice on how to ease a fear of eating? I sometimes get so anxious about it that I throw up. Does this part of anxiety ever go away?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64tqbs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "Lord-Azula", "saved": false, "mod_reports": [], "name": "t3_64tqbs", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/64tqbs/how_do_you_get_over_a_fear_of_eating/", "num_reports": null, "locked": false, "stickied": false, "created": 1491973621.0, "url": "https://www.reddit.com/r/Anxiety/comments/64tqbs/how_do_you_get_over_a_fear_of_eating/", "author_flair_text": null, "quarantine": false, "title": "How do you get over a fear of eating?", "created_utc": 1491944821.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64tqbs", "likes": null, "replies": "", "user_reports": [], "id": "dg53ltu", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "coky18", "parent_id": "t3_64tqbs", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I've spent my entire life with a very similar fear. Along with other diagnoses, I have specific phobia disorder, specifically eating/vomiting. My entire life has been spent making excuses, (Ie, I just ate, I'm coming down with something, even, \"I'm allergic to that\",)\n\nEven family reunions weren't safe enough for me. For most my life, I had to prepare all the food I ate or at the very least, eat alone in my room.\n\nAnd just FYI, I am a 29year old male. This wasn't body image issues. This was a specific intense anxiety hovering around eating. It made it so I would sometimes go as long as 6 to 7 days without any food. It would make me gag. I could still drink things luckily.\n\nFor me, when I was on the right medication and at a particularly smooth part of my life, I had little-to-no issues eating infront of others at all. In my recent relapse, it's come back in full force.\n\nI don't know what the root cause of your anxiety is. Mine was based on an intense fear of vomiting, based on an early childhood traumatizing near-asphyxiation event. The logic started with a simple \"If I dont eat, I cant be sick.\"\n\nThis toxic thought grew as I did, unabated, turning into a crippling phobia. \n\nI hate to mention them but Benzodiazapines fixed it nearly instantly. Its what the hospital always used to get me out of a 7 day fast. I don't like this solution, but if you had a \"take as needed\" prescription for a very occasional xanax or klonopin, that would be the most immediate help.\n\nBut most importantly, you need to find peace on this issue. You need to accept it. There's nothing wrong with you. You aren't doing anything wrong. It's very simple and not the least bit complex. You, like others, have a fear of eating in public. And that's ok. \n\nTo reduce nausea for me without medication, meditation was key. Minutes into a mindfulness meditation, with deep breathing, my stomach would growl and start to crave food. The deep breaths bring fresh oxygen to your system. It reduces Cortisol and Adrenaline and stops the panic system. You start to relax and find peace. \n\nYou learn that you are who you are. It's not a flaw. As I accepted it, and continued to meditate and practice ACT therapy, my symptoms would lessen and I would be more able to eat and feed myself.\n\nYou are safe. If you don't eat that night, its ok. You're allowed. You're not broken. Accept it. Don't fight your thoughts. As you calm down, as you relax, your symptoms will ease. \n\nI promise you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve spent my entire life with a very similar fear. Along with other diagnoses, I have specific phobia disorder, specifically eating/vomiting. My entire life has been spent making excuses, (Ie, I just ate, I&amp;#39;m coming down with something, even, &amp;quot;I&amp;#39;m allergic to that&amp;quot;,)&lt;/p&gt;\n\n&lt;p&gt;Even family reunions weren&amp;#39;t safe enough for me. For most my life, I had to prepare all the food I ate or at the very least, eat alone in my room.&lt;/p&gt;\n\n&lt;p&gt;And just FYI, I am a 29year old male. This wasn&amp;#39;t body image issues. This was a specific intense anxiety hovering around eating. It made it so I would sometimes go as long as 6 to 7 days without any food. It would make me gag. I could still drink things luckily.&lt;/p&gt;\n\n&lt;p&gt;For me, when I was on the right medication and at a particularly smooth part of my life, I had little-to-no issues eating infront of others at all. In my recent relapse, it&amp;#39;s come back in full force.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what the root cause of your anxiety is. Mine was based on an intense fear of vomiting, based on an early childhood traumatizing near-asphyxiation event. The logic started with a simple &amp;quot;If I dont eat, I cant be sick.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This toxic thought grew as I did, unabated, turning into a crippling phobia. &lt;/p&gt;\n\n&lt;p&gt;I hate to mention them but Benzodiazapines fixed it nearly instantly. Its what the hospital always used to get me out of a 7 day fast. I don&amp;#39;t like this solution, but if you had a &amp;quot;take as needed&amp;quot; prescription for a very occasional xanax or klonopin, that would be the most immediate help.&lt;/p&gt;\n\n&lt;p&gt;But most importantly, you need to find peace on this issue. You need to accept it. There&amp;#39;s nothing wrong with you. You aren&amp;#39;t doing anything wrong. It&amp;#39;s very simple and not the least bit complex. You, like others, have a fear of eating in public. And that&amp;#39;s ok. &lt;/p&gt;\n\n&lt;p&gt;To reduce nausea for me without medication, meditation was key. Minutes into a mindfulness meditation, with deep breathing, my stomach would growl and start to crave food. The deep breaths bring fresh oxygen to your system. It reduces Cortisol and Adrenaline and stops the panic system. You start to relax and find peace. &lt;/p&gt;\n\n&lt;p&gt;You learn that you are who you are. It&amp;#39;s not a flaw. As I accepted it, and continued to meditate and practice ACT therapy, my symptoms would lessen and I would be more able to eat and feed myself.&lt;/p&gt;\n\n&lt;p&gt;You are safe. If you don&amp;#39;t eat that night, its ok. You&amp;#39;re allowed. You&amp;#39;re not broken. Accept it. Don&amp;#39;t fight your thoughts. As you calm down, as you relax, your symptoms will ease. &lt;/p&gt;\n\n&lt;p&gt;I promise you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg53ltu", "score_hidden": false, "stickied": false, "created": 1491981533.0, "created_utc": 1491952733.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64tqbs", "likes": null, "replies": "", "user_reports": [], "id": "dg4zb6u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "noctif", "parent_id": "t3_64tqbs", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Cut your food into little pieces so you don't have to bite into anything. Otherwise take an antacid before to help with anxiety induced indigestion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cut your food into little pieces so you don&amp;#39;t have to bite into anything. Otherwise take an antacid before to help with anxiety induced indigestion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4zb6u", "score_hidden": false, "stickied": false, "created": 1491975995.0, "created_utc": 1491947195.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64tqbs", "likes": null, "replies": "", "user_reports": [], "id": "dg4z86e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Found_Your_Shit", "parent_id": "t3_64tqbs", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I don't know, I don't know! Does anybody know? I suffer from this as well, so much. I've lost a lot of weight especially in the past few weeks because it's been bad. I've been dealing with this for years as well. :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know, I don&amp;#39;t know! Does anybody know? I suffer from this as well, so much. I&amp;#39;ve lost a lot of weight especially in the past few weeks because it&amp;#39;s been bad. I&amp;#39;ve been dealing with this for years as well. :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg4z86e", "score_hidden": false, "stickied": false, "created": 1491975896.0, "created_utc": 1491947096.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64tqbs", "likes": null, "replies": "", "user_reports": [], "id": "dg5ah2u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "el3ctrick1tty", "parent_id": "t3_64tqbs", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "You should check in with a doctor and ask about ARFID (Avoidant Restrictive Food Intake Disorder). It goes hand in hand with anxiety in a lot of cases. Also, the folks on the ARFID sub are pretty good at offering tips on how to deal with it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should check in with a doctor and ask about ARFID (Avoidant Restrictive Food Intake Disorder). It goes hand in hand with anxiety in a lot of cases. Also, the folks on the ARFID sub are pretty good at offering tips on how to deal with it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5ah2u", "score_hidden": false, "stickied": false, "created": 1491990604.0, "created_utc": 1491961804.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64tqbs", "likes": null, "replies": "", "user_reports": [], "id": "dg52dxk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DayDreaminScreams", "parent_id": "t3_64tqbs", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I'm not sure, my knowledge is pretty limited on that... however, Maybe you could try to start small? Try eating with just one or two close friends at first. These people should be friends who know you, and you know won't judge you. You could start off by drinking something like water or tea or coffee with friends at breakfast or in a café on weekends, and then work up to eating a small biscuit with the drink. Then a cookie or apple or whatever makes you happy to think about eating, regardless of nutrition or if it's a \"breakfast food\" (I have to eat spaghetti for breakfast because I'm allergic to most breakfast foods). As for school, I used to have to go to the nurse's office to eat lunch because I couldn't eat with all the noise. It made me so anxious I was skipping lunch. \n\nHave you tried journaling about your relationship with food? When you feel anxious about eating next, write down everything that's going through your mind. See if it's about the food or if it's about the people around you. \n\nAs for prom. I don't know about yours, but mine had a little snack bar on the side after the meal. If you need to, you can grab a few snacks and go out in the hall to eat. Just say you need some air or to go to the bathroom, and then go backing when you're done. Is there a teacher you trust to talk to this about? Maybe they can help make arrangements for you to get a little food on the side.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure, my knowledge is pretty limited on that... however, Maybe you could try to start small? Try eating with just one or two close friends at first. These people should be friends who know you, and you know won&amp;#39;t judge you. You could start off by drinking something like water or tea or coffee with friends at breakfast or in a café on weekends, and then work up to eating a small biscuit with the drink. Then a cookie or apple or whatever makes you happy to think about eating, regardless of nutrition or if it&amp;#39;s a &amp;quot;breakfast food&amp;quot; (I have to eat spaghetti for breakfast because I&amp;#39;m allergic to most breakfast foods). As for school, I used to have to go to the nurse&amp;#39;s office to eat lunch because I couldn&amp;#39;t eat with all the noise. It made me so anxious I was skipping lunch. &lt;/p&gt;\n\n&lt;p&gt;Have you tried journaling about your relationship with food? When you feel anxious about eating next, write down everything that&amp;#39;s going through your mind. See if it&amp;#39;s about the food or if it&amp;#39;s about the people around you. &lt;/p&gt;\n\n&lt;p&gt;As for prom. I don&amp;#39;t know about yours, but mine had a little snack bar on the side after the meal. If you need to, you can grab a few snacks and go out in the hall to eat. Just say you need some air or to go to the bathroom, and then go backing when you&amp;#39;re done. Is there a teacher you trust to talk to this about? Maybe they can help make arrangements for you to get a little food on the side.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg52dxk", "score_hidden": false, "stickied": false, "created": 1491979893.0, "created_utc": 1491951093.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64tqbs", "likes": null, "replies": "", "user_reports": [], "id": "dg602is", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throwawayy901", "parent_id": "t3_64tqbs", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I was literally just about to make a post similar to this. For context, I'm staying at a stranger's house and there are a couple people my age here. I ate dinner with them last night, cause there were quite a few people just chatting and being casual. I felt more comfortable with those people, oddly enough, because I wasn't like the main focal point, you know? I guess we're different in that, I feel more comfortable eating with more people around. \n\nNow I've slept through the night and it's just me and one of those people cause everyone else left the house. She cooked breakfast and everything but I stupidly declined earlier. Now I feel awkward because what am I supposed to say without coming off as rude? I'm really hungry now, but I don't wanna come off as awkward or rude and since its just the two of us, the silence is too intimidating for me. \n\nThis is dumb. Anxiety is dumb. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was literally just about to make a post similar to this. For context, I&amp;#39;m staying at a stranger&amp;#39;s house and there are a couple people my age here. I ate dinner with them last night, cause there were quite a few people just chatting and being casual. I felt more comfortable with those people, oddly enough, because I wasn&amp;#39;t like the main focal point, you know? I guess we&amp;#39;re different in that, I feel more comfortable eating with more people around. &lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;ve slept through the night and it&amp;#39;s just me and one of those people cause everyone else left the house. She cooked breakfast and everything but I stupidly declined earlier. Now I feel awkward because what am I supposed to say without coming off as rude? I&amp;#39;m really hungry now, but I don&amp;#39;t wanna come off as awkward or rude and since its just the two of us, the silence is too intimidating for me. &lt;/p&gt;\n\n&lt;p&gt;This is dumb. Anxiety is dumb. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg602is", "score_hidden": false, "stickied": false, "created": 1492038969.0, "created_utc": 1492010169.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64tqbs", "likes": null, "replies": "", "user_reports": [], "id": "dg7btnx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lord-Azula", "parent_id": "t3_64tqbs", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Thanks for all the advice everyone! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for all the advice everyone! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg7btnx", "score_hidden": false, "stickied": false, "created": 1492102155.0, "created_utc": 1492073355.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]