[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I ruin all of my close friendships. Just yesterday I hung out with one of my friends almost all day and had a great time with him just laughing and joking, and today I&amp;#39;ve convinced myself to stop bothering him with texts and snapchats because he didn&amp;#39;t reply to me earlier today, so to me obviously this means that I just get on his nerves and he only hangs out with me out of pity and to be a nice person. I&amp;#39;m not an essential person to any of my friends, and I feel like if I were to just suddenly disappear their lives wouldn&amp;#39;t be effected too much because they all have other friends they&amp;#39;re much closer to. \nI do this with so many relationships and it drives me crazy because I know that I can&amp;#39;t read their minds so it&amp;#39;s unfair to them to assume I know what they&amp;#39;re thinking, but I feel like I&amp;#39;m doing them all a favor by not bothering them, because I&amp;#39;m so sure they&amp;#39;re all only friends with me out of pity or to be nice. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I ruin all of my close friendships. Just yesterday I hung out with one of my friends almost all day and had a great time with him just laughing and joking, and today I've convinced myself to stop bothering him with texts and snapchats because he didn't reply to me earlier today, so to me obviously this means that I just get on his nerves and he only hangs out with me out of pity and to be a nice person. I'm not an essential person to any of my friends, and I feel like if I were to just suddenly disappear their lives wouldn't be effected too much because they all have other friends they're much closer to. \nI do this with so many relationships and it drives me crazy because I know that I can't read their minds so it's unfair to them to assume I know what they're thinking, but I feel like I'm doing them all a favor by not bothering them, because I'm so sure they're all only friends with me out of pity or to be nice. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "64uzj6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "HBcats", "saved": false, "mod_reports": [], "name": "t3_64uzj6", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": "relationshipflair", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/64uzj6/i_self_sabotage_all_of_my_relationships/", "num_reports": null, "locked": false, "stickied": false, "created": 1491986960.0, "url": "https://www.reddit.com/r/Anxiety/comments/64uzj6/i_self_sabotage_all_of_my_relationships/", "author_flair_text": null, "quarantine": false, "title": "I self sabotage all of my relationships.", "created_utc": 1491958160.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64uzj6", "likes": null, "replies": "", "user_reports": [], "id": "dg5ds9g", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "eleven-eggos", "parent_id": "t3_64uzj6", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I am the exact same way. I had a classmate say she wanted to be my study buddy when we start grad school next fall. Later that day I had already convinced myself that she just felt bad for me or wanted to use me to help herself. It's like it's impossible for me to believe that anyone would want to be around me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am the exact same way. I had a classmate say she wanted to be my study buddy when we start grad school next fall. Later that day I had already convinced myself that she just felt bad for me or wanted to use me to help herself. It&amp;#39;s like it&amp;#39;s impossible for me to believe that anyone would want to be around me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5ds9g", "score_hidden": false, "stickied": false, "created": 1491995163.0, "created_utc": 1491966363.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64uzj6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64uzj6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64uzj6", "likes": null, "replies": "", "user_reports": [], "id": "dg591ji", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Phantisy", "parent_id": "t1_dg58s45", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I never asked if I was getting on anyone's nerves. I can't imagine what they would say. None of my few, and by few I can count them on one hand, understand anxiety and depression like I do. I feel like a burden on them though and I hang out when them every weekend just to keep myself from gong crazy and doing something stupid. I feel like on day they will say the same to me as yours say to you then I will be left with nothing but myself, and myself is not something I want to be alone with for too long.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I never asked if I was getting on anyone&amp;#39;s nerves. I can&amp;#39;t imagine what they would say. None of my few, and by few I can count them on one hand, understand anxiety and depression like I do. I feel like a burden on them though and I hang out when them every weekend just to keep myself from gong crazy and doing something stupid. I feel like on day they will say the same to me as yours say to you then I will be left with nothing but myself, and myself is not something I want to be alone with for too long.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg591ji", "score_hidden": false, "stickied": false, "created": 1491988743.0, "created_utc": 1491959943.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58s45", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HBcats", "parent_id": "t1_dg586if", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "This exactly! I drive my friends crazy always asking if I'm getting on their nerves or overstaying my welcome when we hangout, and always apologizing for everything. People say I'm \"too much to deal with\" but don't realize that they only have to deal with like 1% of what I have to deal with going on in my head every single day. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This exactly! I drive my friends crazy always asking if I&amp;#39;m getting on their nerves or overstaying my welcome when we hangout, and always apologizing for everything. People say I&amp;#39;m &amp;quot;too much to deal with&amp;quot; but don&amp;#39;t realize that they only have to deal with like 1% of what I have to deal with going on in my head every single day. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg58s45", "score_hidden": false, "stickied": false, "created": 1491988408.0, "created_utc": 1491959608.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg586if", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Phantisy", "parent_id": "t3_64uzj6", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "It really does suck when you don't know what someone is thinking. I wish more people would tell their thoughts. I have the problem everyday not knowing what someone is thinking and it drives me crazy and it's worse because this one person doesn't want me to talk to them because I'm toxic. It's hard for me to get past that. I'm \"toxic\" because of a mental illness I didn't ask for.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It really does suck when you don&amp;#39;t know what someone is thinking. I wish more people would tell their thoughts. I have the problem everyday not knowing what someone is thinking and it drives me crazy and it&amp;#39;s worse because this one person doesn&amp;#39;t want me to talk to them because I&amp;#39;m toxic. It&amp;#39;s hard for me to get past that. I&amp;#39;m &amp;quot;toxic&amp;quot; because of a mental illness I didn&amp;#39;t ask for.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg586if", "score_hidden": false, "stickied": false, "created": 1491987648.0, "created_utc": 1491958848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64uzj6", "likes": null, "replies": "", "user_reports": [], "id": "dg5f9to", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "noodlesandpizza", "parent_id": "t3_64uzj6", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Sometimes I feel as if my friends are just people who are nice to me because they feel sorry for me. It sucks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes I feel as if my friends are just people who are nice to me because they feel sorry for me. It sucks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5f9to", "score_hidden": false, "stickied": false, "created": 1491997395.0, "created_utc": 1491968595.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64uzj6", "likes": null, "replies": "", "user_reports": [], "id": "dg5jmjm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hollowmoon", "parent_id": "t3_64uzj6", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "God this is me. I started taking voice lessons recently to kind of push myself out of my shell. I really enjoy it and today my teacher complimented me. It felt really good. Later tonight my Dad told me he and my Mom are going away for a couple days, which is great, they need some time off together. But of course tonight my brain is just berating me with *they're leaving you at home because you're annoying* or *nobody wants to be around you, you're such a drag*. I KNOW this isn't true, at all, and besides, I'll be dogsitting. It's like my brain wouldn't let me bask in a compliment and has to sabotage my good feeling by grasping wildly for things to feel bad about, even if they're not true.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;God this is me. I started taking voice lessons recently to kind of push myself out of my shell. I really enjoy it and today my teacher complimented me. It felt really good. Later tonight my Dad told me he and my Mom are going away for a couple days, which is great, they need some time off together. But of course tonight my brain is just berating me with &lt;em&gt;they&amp;#39;re leaving you at home because you&amp;#39;re annoying&lt;/em&gt; or &lt;em&gt;nobody wants to be around you, you&amp;#39;re such a drag&lt;/em&gt;. I KNOW this isn&amp;#39;t true, at all, and besides, I&amp;#39;ll be dogsitting. It&amp;#39;s like my brain wouldn&amp;#39;t let me bask in a compliment and has to sabotage my good feeling by grasping wildly for things to feel bad about, even if they&amp;#39;re not true.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5jmjm", "score_hidden": false, "stickied": false, "created": 1492005371.0, "created_utc": 1491976571.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64uzj6", "likes": null, "replies": "", "user_reports": [], "id": "dg5icx3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "1997s", "parent_id": "t3_64uzj6", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I do the same thing and I lost one of my closest friends just yesterday/this weekend. Apparently my friend thought that I wasn't putting effort into our friendship even after I promised him that I would start trying harder. One of the reasons he thought that is because I never made an effort to see him unless he asked me to (and I always wanted to see him. I was just afraid he would be annoyed or that he only hung out with me because he felt bad for me). I also always assumed I knew what he was thinking and he really hated that and it was the main reason he decided he was done with me. It sucks that you can't know for sure what anyone is actually thinking (jeez, I even feel annoying typing this out)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do the same thing and I lost one of my closest friends just yesterday/this weekend. Apparently my friend thought that I wasn&amp;#39;t putting effort into our friendship even after I promised him that I would start trying harder. One of the reasons he thought that is because I never made an effort to see him unless he asked me to (and I always wanted to see him. I was just afraid he would be annoyed or that he only hung out with me because he felt bad for me). I also always assumed I knew what he was thinking and he really hated that and it was the main reason he decided he was done with me. It sucks that you can&amp;#39;t know for sure what anyone is actually thinking (jeez, I even feel annoying typing this out)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5icx3", "score_hidden": false, "stickied": false, "created": 1492002786.0, "created_utc": 1491973986.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]