[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I&amp;#39;m new here. Came in search of fellow anxious people dealing with heart palpitations. I&amp;#39;ve had them for about two and a half years now. I sometimes have days or weeks with none, and then if I get stressed for a long period or don&amp;#39;t sleep well, or drink alcohol, or eat too much sugar, or who knows what the hell makes it happen....they come back with a vengeance. Yesterday I had a tough day at work and I had more than ever - probably 30-50 throughout the day. Today was better but this evening I have one every 10 minutes or so. Just had one writing that sentence. I wish I could figure out exactly what causes them and make them stop. I&amp;#39;ve tried so many things and it&amp;#39;s just exhausting and terrifying at the same time. (Yes I&amp;#39;ve been to the cardiologist and ruled out any structural issues with my heart.) Anyone else dealing with this? If so....how? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, I'm new here. Came in search of fellow anxious people dealing with heart palpitations. I've had them for about two and a half years now. I sometimes have days or weeks with none, and then if I get stressed for a long period or don't sleep well, or drink alcohol, or eat too much sugar, or who knows what the hell makes it happen....they come back with a vengeance. Yesterday I had a tough day at work and I had more than ever - probably 30-50 throughout the day. Today was better but this evening I have one every 10 minutes or so. Just had one writing that sentence. I wish I could figure out exactly what causes them and make them stop. I've tried so many things and it's just exhausting and terrifying at the same time. (Yes I've been to the cardiologist and ruled out any structural issues with my heart.) Anyone else dealing with this? If so....how? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64v6zf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "kaitphilli", "saved": false, "mod_reports": [], "name": "t3_64v6zf", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/64v6zf/palpitations_bringing_me_down/", "num_reports": null, "locked": false, "stickied": false, "created": 1491989359.0, "url": "https://www.reddit.com/r/Anxiety/comments/64v6zf/palpitations_bringing_me_down/", "author_flair_text": null, "quarantine": false, "title": "Palpitations bringing me down", "created_utc": 1491960559.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64v6zf", "likes": null, "replies": "", "user_reports": [], "id": "dg5dtxi", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ndg2006", "parent_id": "t3_64v6zf", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Hi stranger! I deal with this on a regular basis. I like to think that my mind loves to create anxiety about something in my life just because it can. At one point it was my heart health.\n\nRealistically speaking, it was logical for me to think that the likelihood of my heart actually having a problem was extremely low. Hell, I hadn't died yet, right? The anxiety continued with an urgent care visit and two cardiologists (the first told me I was fine and to basically leave). The second one was the guy that fixed everything...\n\nThough I have anxiety sometimes a simple sentence can make the difference in how the anxiety continues. The first appointment with him was the epiphany needed to start bringing my anxiety down. After telling him my history of anxiety, family history of heart problems, and my fears about my own heart he told me something I'll never forget: \"Could you have a heart problem at 25? Sure, it's happened before. But you could also leave my office and get hit by a car.\"\n\nIt made me laugh but upon reflection of the statement the guy is a certified cardiologist that wasn't worried. He knew my chances of getting into an accident outside of his office was far greater than the chance of having a heart problem. We ended the first visit by setting me up with a heart monitor for 48 hour monitoring and when I went back in to review my results I got the second great nugget from him: \"I worry about all of my patients (with heart problems) but I won't worry about you.\"\n\nTake it from the expert, your heart is fine. The most difficult part about my anxiety is accepting the negative effects anxiety can have--like heart palpitations. Once you learn to accept what you are feeling is real and isn't a threat your anxiety will start to taper off. I can definitely elaborate if you want me to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi stranger! I deal with this on a regular basis. I like to think that my mind loves to create anxiety about something in my life just because it can. At one point it was my heart health.&lt;/p&gt;\n\n&lt;p&gt;Realistically speaking, it was logical for me to think that the likelihood of my heart actually having a problem was extremely low. Hell, I hadn&amp;#39;t died yet, right? The anxiety continued with an urgent care visit and two cardiologists (the first told me I was fine and to basically leave). The second one was the guy that fixed everything...&lt;/p&gt;\n\n&lt;p&gt;Though I have anxiety sometimes a simple sentence can make the difference in how the anxiety continues. The first appointment with him was the epiphany needed to start bringing my anxiety down. After telling him my history of anxiety, family history of heart problems, and my fears about my own heart he told me something I&amp;#39;ll never forget: &amp;quot;Could you have a heart problem at 25? Sure, it&amp;#39;s happened before. But you could also leave my office and get hit by a car.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It made me laugh but upon reflection of the statement the guy is a certified cardiologist that wasn&amp;#39;t worried. He knew my chances of getting into an accident outside of his office was far greater than the chance of having a heart problem. We ended the first visit by setting me up with a heart monitor for 48 hour monitoring and when I went back in to review my results I got the second great nugget from him: &amp;quot;I worry about all of my patients (with heart problems) but I won&amp;#39;t worry about you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Take it from the expert, your heart is fine. The most difficult part about my anxiety is accepting the negative effects anxiety can have--like heart palpitations. Once you learn to accept what you are feeling is real and isn&amp;#39;t a threat your anxiety will start to taper off. I can definitely elaborate if you want me to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5dtxi", "score_hidden": false, "stickied": false, "created": 1491995229.0, "created_utc": 1491966429.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64v6zf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64v6zf", "likes": null, "replies": "", "user_reports": [], "id": "dg5feni", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kaitphilli", "parent_id": "t1_dg5dn4w", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I think what I actually need is more people to verify that yes, the general and obvious stuff is actually true and it matters, so thank you! I have noticed that when I had for a walk and/or take some deep breaths they do go away for a while. It's just so strange how they flare up like this. I do think it may have a lot to do with diet. The only thing I've changed in the past week is that I started taking a probiotic....I wonder if that's actually making things worse somehow...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think what I actually need is more people to verify that yes, the general and obvious stuff is actually true and it matters, so thank you! I have noticed that when I had for a walk and/or take some deep breaths they do go away for a while. It&amp;#39;s just so strange how they flare up like this. I do think it may have a lot to do with diet. The only thing I&amp;#39;ve changed in the past week is that I started taking a probiotic....I wonder if that&amp;#39;s actually making things worse somehow...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5feni", "score_hidden": false, "stickied": false, "created": 1491997608.0, "created_utc": 1491968808.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5dn4w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cantcountsheep", "parent_id": "t3_64v6zf", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I dealt with this for about a year. For 6 months they were severe, constant pain throughout the day, only stopped when I drunk heavily or when I was sleeping. I went to the doctors 3 times and came to a conclusion it was my eating habits. It was not. It was stress. How do I know? I quit my job after about 5 months of palpitations and after 1 month they started subsiding until they eventually stopped after nigh on a year of having had them. \n\nMistakes I know I made were: Not exercising (exacerbated because of the fear and anxiety that it might be something serious.) Focusing too much on work. Not having a sleeping routine (largely because of my job at the time). \n\nMistakes I think I made: Not having a healthier eating habit. At the time I was eating quite healthily but certain foods (chocolate) I'm fairy sure would negate the choices I'd made)\n\nI'm only really replying because no one else has, sorry I'm not a better example, but these are some changes I have made and am making. \n\nHave made: Healthier diet  in terms of reducing sugar but also became a (6 days per weak) vegetarian though I'm not sure the latter is relevant as I perceive myself as having a healthier diet when I was eating meat more regularly. This is not a comment on vegetarianism or eating meat, only my individual circumstance. No heavy drinking. Exercise regularly. Meditate regularly. \n\nChanges I am trying to make: Regular sleep pattern. I have struggled with this for two decades, it's my last bastion of stupidity. Learning to avoid pointless stress (staying off reddit, particularly not getting into pointless arguments). \n\nFinally, I think you yourself can answer as I have what you do right and what you could be better at. Depending on you as a person, maybe just writing them down and setting a goal of method to adjust your habits. \n\nExample, you had a bad day at work. Is there any singular thing you could have done to alleviate the stress? Using a stress ball? meditate? Say 5 things you love about your job? Say 5 things that you love that your job allows you to do in your home life? Simply taking 5 minutes to go for a walk rather than just focus on the task? Ask for help? \n\nSorry if that's too general and obvious, most of this bullshit is right? Sometimes we just need it drilled in. Sorry if it's only the former though. Either way, thanks for sharing your problem and reading my writing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dealt with this for about a year. For 6 months they were severe, constant pain throughout the day, only stopped when I drunk heavily or when I was sleeping. I went to the doctors 3 times and came to a conclusion it was my eating habits. It was not. It was stress. How do I know? I quit my job after about 5 months of palpitations and after 1 month they started subsiding until they eventually stopped after nigh on a year of having had them. &lt;/p&gt;\n\n&lt;p&gt;Mistakes I know I made were: Not exercising (exacerbated because of the fear and anxiety that it might be something serious.) Focusing too much on work. Not having a sleeping routine (largely because of my job at the time). &lt;/p&gt;\n\n&lt;p&gt;Mistakes I think I made: Not having a healthier eating habit. At the time I was eating quite healthily but certain foods (chocolate) I&amp;#39;m fairy sure would negate the choices I&amp;#39;d made)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m only really replying because no one else has, sorry I&amp;#39;m not a better example, but these are some changes I have made and am making. &lt;/p&gt;\n\n&lt;p&gt;Have made: Healthier diet  in terms of reducing sugar but also became a (6 days per weak) vegetarian though I&amp;#39;m not sure the latter is relevant as I perceive myself as having a healthier diet when I was eating meat more regularly. This is not a comment on vegetarianism or eating meat, only my individual circumstance. No heavy drinking. Exercise regularly. Meditate regularly. &lt;/p&gt;\n\n&lt;p&gt;Changes I am trying to make: Regular sleep pattern. I have struggled with this for two decades, it&amp;#39;s my last bastion of stupidity. Learning to avoid pointless stress (staying off reddit, particularly not getting into pointless arguments). &lt;/p&gt;\n\n&lt;p&gt;Finally, I think you yourself can answer as I have what you do right and what you could be better at. Depending on you as a person, maybe just writing them down and setting a goal of method to adjust your habits. &lt;/p&gt;\n\n&lt;p&gt;Example, you had a bad day at work. Is there any singular thing you could have done to alleviate the stress? Using a stress ball? meditate? Say 5 things you love about your job? Say 5 things that you love that your job allows you to do in your home life? Simply taking 5 minutes to go for a walk rather than just focus on the task? Ask for help? &lt;/p&gt;\n\n&lt;p&gt;Sorry if that&amp;#39;s too general and obvious, most of this bullshit is right? Sometimes we just need it drilled in. Sorry if it&amp;#39;s only the former though. Either way, thanks for sharing your problem and reading my writing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5dn4w", "score_hidden": false, "stickied": false, "created": 1491994951.0, "created_utc": 1491966151.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64v6zf", "likes": null, "replies": "", "user_reports": [], "id": "dg5fjd5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kaitphilli", "parent_id": "t3_64v6zf", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I read somewhere on here from someone who said they now see their palpitations like they see hiccups. Only thing is, how do I see something as so benign when it barely happens for a while and then suddenly - randomly? - flares up like this? It's the surprise of them that really gets me. Hearing what your doctors said is helpful, and mine has said similar things. She tells me I should only worry if my palpitations make me feel dizzy or pass out, which they never have. But of course now I expect them to...anyway, how did you internalize the message that you are ok? Just...time? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read somewhere on here from someone who said they now see their palpitations like they see hiccups. Only thing is, how do I see something as so benign when it barely happens for a while and then suddenly - randomly? - flares up like this? It&amp;#39;s the surprise of them that really gets me. Hearing what your doctors said is helpful, and mine has said similar things. She tells me I should only worry if my palpitations make me feel dizzy or pass out, which they never have. But of course now I expect them to...anyway, how did you internalize the message that you are ok? Just...time? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5fjd5", "score_hidden": false, "stickied": false, "created": 1491997821.0, "created_utc": 1491969021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64v6zf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64v6zf", "likes": null, "replies": "", "user_reports": [], "id": "dg6yr6w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kaitphilli", "parent_id": "t1_dg5jsfp", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Yeah, I haven't had a real, hard workout in about 2 years =/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I haven&amp;#39;t had a real, hard workout in about 2 years =/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6yr6w", "score_hidden": false, "stickied": false, "created": 1492077698.0, "created_utc": 1492048898.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jsfp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vega1980", "parent_id": "t3_64v6zf", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I get them, especially when exercising. They drive me insane and ruin my workouts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get them, especially when exercising. They drive me insane and ruin my workouts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg5jsfp", "score_hidden": false, "stickied": false, "created": 1492005744.0, "created_utc": 1491976944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]