[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Aaaaannnaaarccchyyyyyyyyy. Anyways. How do I go about getting help? Do I need to see my GP? Talk to university? Both? Gah my brain doesn&amp;#39;t want to think about dealing with that. I emailed my university a while ago and they told me to book at meeting but I can&amp;#39;t bring myself to it. And if I did go I can&amp;#39;t express what I&amp;#39;m feeling! I feel lost :/ NHS let me down a few years ago. Does anyone have any experience with this sort of stuff in the UK? What happens if I tell my GP? What is the course of action and how long will it take? What can my university even do? I have 1 month till exams and I&amp;#39;m slowly breaking down. I haven&amp;#39;t even revised yet. I&amp;#39;m learning Swedish instead of revising. I have no intention of going to Sweden nor do I know any Swedish people. Anxiety is the worst. What do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Aaaaannnaaarccchyyyyyyyyy. Anyways. How do I go about getting help? Do I need to see my GP? Talk to university? Both? Gah my brain doesn't want to think about dealing with that. I emailed my university a while ago and they told me to book at meeting but I can't bring myself to it. And if I did go I can't express what I'm feeling! I feel lost :/ NHS let me down a few years ago. Does anyone have any experience with this sort of stuff in the UK? What happens if I tell my GP? What is the course of action and how long will it take? What can my university even do? I have 1 month till exams and I'm slowly breaking down. I haven't even revised yet. I'm learning Swedish instead of revising. I have no intention of going to Sweden nor do I know any Swedish people. Anxiety is the worst. What do?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64z5cc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 17, "report_reasons": null, "author": "Solidu_Snaku", "saved": false, "mod_reports": [], "name": "t3_64z5cc", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/64z5cc/anxiety_in_the_uk/", "num_reports": null, "locked": false, "stickied": false, "created": 1492042522.0, "url": "https://www.reddit.com/r/Anxiety/comments/64z5cc/anxiety_in_the_uk/", "author_flair_text": null, "quarantine": false, "title": "Anxiety in the UK", "created_utc": 1492013722.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 20, "visited": false, "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": "", "user_reports": [], "id": "dg6h9wo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jdu44", "parent_id": "t1_dg6grzi", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "No worries, I'm glad you feel I've been of assistance! I know how shitty going through this kind of thing feels, and how panic-inducing it can be when you're dealing with personal stuff whilst there are deadlines etc. to work to. \n\nNo matter how long any of the medication might take, it's always best to start trying it sooner rather than later if that's the route the doctors suggest. It can take a bit of trial-and-error to find the right thing for each individual, but the sooner you find what that is for you, the sooner you'll be back on your feet and feeling a bit happier about things. \n\nTake care mate, and PM me if you think I might be able to help with anything in the future :-) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No worries, I&amp;#39;m glad you feel I&amp;#39;ve been of assistance! I know how shitty going through this kind of thing feels, and how panic-inducing it can be when you&amp;#39;re dealing with personal stuff whilst there are deadlines etc. to work to. &lt;/p&gt;\n\n&lt;p&gt;No matter how long any of the medication might take, it&amp;#39;s always best to start trying it sooner rather than later if that&amp;#39;s the route the doctors suggest. It can take a bit of trial-and-error to find the right thing for each individual, but the sooner you find what that is for you, the sooner you&amp;#39;ll be back on your feet and feeling a bit happier about things. &lt;/p&gt;\n\n&lt;p&gt;Take care mate, and PM me if you think I might be able to help with anything in the future :-) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6h9wo", "score_hidden": false, "stickied": false, "created": 1492056818.0, "created_utc": 1492028018.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6grzi", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Solidu_Snaku", "parent_id": "t1_dg6b3za", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Thank you for all the information, this is great! I love reddit I'm glad I posted. This has really helped me get my head a bit more organised. I can't seem to type what I'm thinking to say but it's good! I hope this makes sense haha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for all the information, this is great! I love reddit I&amp;#39;m glad I posted. This has really helped me get my head a bit more organised. I can&amp;#39;t seem to type what I&amp;#39;m thinking to say but it&amp;#39;s good! I hope this makes sense haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6grzi", "score_hidden": false, "stickied": false, "created": 1492056310.0, "created_utc": 1492027510.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6b3za", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "jdu44", "parent_id": "t1_dg6al0p", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "No problem at all. \n\nHonestly it all depends on your body chemistry and the particular medications that they put you on (if any). If it's a beta-blocker (I have been on propranolol before, it was the first thing they ever tried me on), you should be able to take it straight away and there'll be no transition time. SSRIs might take a week or two for your body to adjust, but all of that time you should be able to study. I tried Sertraline, which I had to stop since it was preventing sleep, and I also tried Citalopram (the most commonly-prescribed SSRI in the UK) and that just started working immediately with no side-effects. \n\nJust go along with an open mind, lay your worries out, and see what the professionals say. If you're not used to talking about this stuff with people it'll seem really weird to do 'note-taking' etc, but it'll help you (it did for me anyway).  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem at all. &lt;/p&gt;\n\n&lt;p&gt;Honestly it all depends on your body chemistry and the particular medications that they put you on (if any). If it&amp;#39;s a beta-blocker (I have been on propranolol before, it was the first thing they ever tried me on), you should be able to take it straight away and there&amp;#39;ll be no transition time. SSRIs might take a week or two for your body to adjust, but all of that time you should be able to study. I tried Sertraline, which I had to stop since it was preventing sleep, and I also tried Citalopram (the most commonly-prescribed SSRI in the UK) and that just started working immediately with no side-effects. &lt;/p&gt;\n\n&lt;p&gt;Just go along with an open mind, lay your worries out, and see what the professionals say. If you&amp;#39;re not used to talking about this stuff with people it&amp;#39;ll seem really weird to do &amp;#39;note-taking&amp;#39; etc, but it&amp;#39;ll help you (it did for me anyway).  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6b3za", "score_hidden": false, "stickied": false, "created": 1492050482.0, "created_utc": 1492021682.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6al0p", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Solidu_Snaku", "parent_id": "t1_dg66cz6", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I've written down some symptoms but it looks so weird when I read it back. I know this is an irrational thought but I can't help it. I think I'll have to deal with it. Thanks for the suggestion though, it seems a LOT easier than talking :) I've tried CAMHS when I was like 16 but I had to leave because it was not helping. They were reading me completely the wrong way, and I couldn't say anything about it. I was too lost and clueless at the time. One thing - If I get put on medication, will it negatively affect me initially? Is there a time to get adjusted or like how does it work? Do I have enough time before my exams or is now not a good time to be starting medication or therapy. Sorry for all the questions. I really appreciate the time you've taken to reply. Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve written down some symptoms but it looks so weird when I read it back. I know this is an irrational thought but I can&amp;#39;t help it. I think I&amp;#39;ll have to deal with it. Thanks for the suggestion though, it seems a LOT easier than talking :) I&amp;#39;ve tried CAMHS when I was like 16 but I had to leave because it was not helping. They were reading me completely the wrong way, and I couldn&amp;#39;t say anything about it. I was too lost and clueless at the time. One thing - If I get put on medication, will it negatively affect me initially? Is there a time to get adjusted or like how does it work? Do I have enough time before my exams or is now not a good time to be starting medication or therapy. Sorry for all the questions. I really appreciate the time you&amp;#39;ve taken to reply. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6al0p", "score_hidden": false, "stickied": false, "created": 1492049950.0, "created_utc": 1492021150.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66cz6", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "jdu44", "parent_id": "t3_64z5cc", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I would recommend you write down how you feel in a few bullet points in advance of meeting with a doctor. Write down how you feel, and how severely it affects your day-to-day life (e.g. sometimes you might struggle leaving your room/house, sometimes you can't be around people, the sort of things that make you anxious, whether you have experienced anxiety attacks, how it's affecting your work at Uni). \n\nWhen you're happy with your list, just book an appointment with your GP, and take the list along. When you book, see if they have any emergency clinics running (since you might get to see a doctor faster if they do). \n\nDon't worry about seeing the doctor. They've dealt with hundreds of people with anxiety disorders, personality disorders, depression etc. before, and anything you do/say will be nothing new to them. If there's one place you can relax, it's there! **Do** be very clear about your difficulties though.  \n\nThey might prescribe you something (most likely a beta-blocker or perhaps an SSRI). As you're a student you'll either pay nothing or very little (most likely nothing) for it when you go to pick it up at the pharmacy. \n\nYou should also investigate whether there are any local services run by your council that the doctor can recommend (some kind of therapy service where you can meet/have a one-to-one phone call with someone). CBT is pretty good. Even if your doctor knows nothing about it, you could always check online or pop into the local Citizen's Advice Bureau.\n\nI assume your uni have told you who to contact internally (whether it's a dept. head or a student welfare officer or similar). Just go in with your list, relax, and lay out what you're feeling and how it's affecting your work. Mention that you're going to see/have seen a doctor about it. Don't worry about getting upset, again these people have seen it all before a million times :-)\n\nJust relax about getting help. I was really freaking out the first time I did too, but you really quickly realise you're in safe, trustworthy hands. \n\nPlease let me know if you have any other questions about this, and good luck (although you'll be alright, mate). ", "edited": 1492035561.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would recommend you write down how you feel in a few bullet points in advance of meeting with a doctor. Write down how you feel, and how severely it affects your day-to-day life (e.g. sometimes you might struggle leaving your room/house, sometimes you can&amp;#39;t be around people, the sort of things that make you anxious, whether you have experienced anxiety attacks, how it&amp;#39;s affecting your work at Uni). &lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re happy with your list, just book an appointment with your GP, and take the list along. When you book, see if they have any emergency clinics running (since you might get to see a doctor faster if they do). &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t worry about seeing the doctor. They&amp;#39;ve dealt with hundreds of people with anxiety disorders, personality disorders, depression etc. before, and anything you do/say will be nothing new to them. If there&amp;#39;s one place you can relax, it&amp;#39;s there! &lt;strong&gt;Do&lt;/strong&gt; be very clear about your difficulties though.  &lt;/p&gt;\n\n&lt;p&gt;They might prescribe you something (most likely a beta-blocker or perhaps an SSRI). As you&amp;#39;re a student you&amp;#39;ll either pay nothing or very little (most likely nothing) for it when you go to pick it up at the pharmacy. &lt;/p&gt;\n\n&lt;p&gt;You should also investigate whether there are any local services run by your council that the doctor can recommend (some kind of therapy service where you can meet/have a one-to-one phone call with someone). CBT is pretty good. Even if your doctor knows nothing about it, you could always check online or pop into the local Citizen&amp;#39;s Advice Bureau.&lt;/p&gt;\n\n&lt;p&gt;I assume your uni have told you who to contact internally (whether it&amp;#39;s a dept. head or a student welfare officer or similar). Just go in with your list, relax, and lay out what you&amp;#39;re feeling and how it&amp;#39;s affecting your work. Mention that you&amp;#39;re going to see/have seen a doctor about it. Don&amp;#39;t worry about getting upset, again these people have seen it all before a million times :-)&lt;/p&gt;\n\n&lt;p&gt;Just relax about getting help. I was really freaking out the first time I did too, but you really quickly realise you&amp;#39;re in safe, trustworthy hands. &lt;/p&gt;\n\n&lt;p&gt;Please let me know if you have any other questions about this, and good luck (although you&amp;#39;ll be alright, mate). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg66cz6", "score_hidden": false, "stickied": false, "created": 1492045668.0, "created_utc": 1492016868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": "", "user_reports": [], "id": "dg6lskn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NutellaBadger7", "parent_id": "t1_dg6hblj", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "It may be good to visit and explain the situation to them since the process will depend on what treatment you may be looking at. For example I was put on (and still take) Citalopram, so needed regular Drs appointments in person to check in and see how side effects were. So maybe it's best to start the process with meds at home and see what the uni provides in terms of counselling when you're back. Also, consider asking about things such as the big white wall (spelling?) which is an online therapy service offered through the NHS now which may help you whilst letting you have  more free rein as to where you can be whilst still receiving regular contact with a therapist. I hear 7 cups of tea is good too although I have 0 experience with the app. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It may be good to visit and explain the situation to them since the process will depend on what treatment you may be looking at. For example I was put on (and still take) Citalopram, so needed regular Drs appointments in person to check in and see how side effects were. So maybe it&amp;#39;s best to start the process with meds at home and see what the uni provides in terms of counselling when you&amp;#39;re back. Also, consider asking about things such as the big white wall (spelling?) which is an online therapy service offered through the NHS now which may help you whilst letting you have  more free rein as to where you can be whilst still receiving regular contact with a therapist. I hear 7 cups of tea is good too although I have 0 experience with the app. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6lskn", "score_hidden": false, "stickied": false, "created": 1492061766.0, "created_utc": 1492032966.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hblj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Solidu_Snaku", "parent_id": "t1_dg6h0rv", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I'm only going back to uni when my exams are in 3 weeks. I'm first year also. Is it a good idea to visit my home GP initially and then switch to the uni one post-exams?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m only going back to uni when my exams are in 3 weeks. I&amp;#39;m first year also. Is it a good idea to visit my home GP initially and then switch to the uni one post-exams?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6hblj", "score_hidden": false, "stickied": false, "created": 1492056868.0, "created_utc": 1492028068.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6h0rv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NutellaBadger7", "parent_id": "t1_dg6gv61", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "It depends how long you have left at uni I guess. I went in my 3rd year at uni and although it was needed ASAP it made things a bit more difficult transitioning to a different surgery and facilities when back home. Ultimately if they give you meds you will need to go see your doctor every week or so at first if on meds so may be better to see the uni one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It depends how long you have left at uni I guess. I went in my 3rd year at uni and although it was needed ASAP it made things a bit more difficult transitioning to a different surgery and facilities when back home. Ultimately if they give you meds you will need to go see your doctor every week or so at first if on meds so may be better to see the uni one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6h0rv", "score_hidden": false, "stickied": false, "created": 1492056558.0, "created_utc": 1492027758.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6gv61", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Solidu_Snaku", "parent_id": "t1_dg6d7yy", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Do you think I should see my GP in my home city (here for easter holidays) or where my university is? Does it matter? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you think I should see my GP in my home city (here for easter holidays) or where my university is? Does it matter? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6gv61", "score_hidden": false, "stickied": false, "created": 1492056399.0, "created_utc": 1492027599.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6d7yy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NutellaBadger7", "parent_id": "t3_64z5cc", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I dealt with anxiety /depression during uni. To keep it short go see the Dr, they will recommend which options may be best including NHS therapy options or medications. Then let your uni/tutor and they will let you know ow the uni policy and things in place to help (in my case, informing student services and contacting the uni counselling service). What ever path you take, remember the first steps are the scariest but also the most important. And remember, there's always someone out there who cares and will help you. Things will be ok. Hope it all goes well for you and if you ever need someone we're all here for you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dealt with anxiety /depression during uni. To keep it short go see the Dr, they will recommend which options may be best including NHS therapy options or medications. Then let your uni/tutor and they will let you know ow the uni policy and things in place to help (in my case, informing student services and contacting the uni counselling service). What ever path you take, remember the first steps are the scariest but also the most important. And remember, there&amp;#39;s always someone out there who cares and will help you. Things will be ok. Hope it all goes well for you and if you ever need someone we&amp;#39;re all here for you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6d7yy", "score_hidden": false, "stickied": false, "created": 1492052657.0, "created_utc": 1492023857.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": "", "user_reports": [], "id": "dg6hlj1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jdu44", "parent_id": "t1_dg6gz7n", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I have found that having **[stuff like this](https://www.youtube.com/watch?v=LvRRTqpseIg&amp;t=2s)** playing in the background (just as audio) can be really helpful if I'm reading. Maybe try it out?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have found that having &lt;strong&gt;&lt;a href=\"https://www.youtube.com/watch?v=LvRRTqpseIg&amp;amp;t=2s\"&gt;stuff like this&lt;/a&gt;&lt;/strong&gt; playing in the background (just as audio) can be really helpful if I&amp;#39;m reading. Maybe try it out?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6hlj1", "score_hidden": false, "stickied": false, "created": 1492057154.0, "created_utc": 1492028354.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6gz7n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Solidu_Snaku", "parent_id": "t1_dg6bf04", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "That's what I'm trying to do now, but I autopilot that too. Not an ideal situation. I do so many things in the background without thinking. But I feel ya, once I start to get something it's a good feeling. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I&amp;#39;m trying to do now, but I autopilot that too. Not an ideal situation. I do so many things in the background without thinking. But I feel ya, once I start to get something it&amp;#39;s a good feeling. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6gz7n", "score_hidden": false, "stickied": false, "created": 1492056513.0, "created_utc": 1492027713.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bf04", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jdu44", "parent_id": "t1_dg6a9zw", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I had this exact problem too. Have you considered transcribing what you read into your own words in a notepad? Try to get it to a chapter per A4 page or something? I used that technique when I was cramming back in Uni, and found it to be helpful. \n   \nI also found that once I got some of it into my head, it got a lot easier since you feel a boost of confidence. Just get a big cup of tea, get cracking on it (don't pressure yourself) and see how you get on :-) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had this exact problem too. Have you considered transcribing what you read into your own words in a notepad? Try to get it to a chapter per A4 page or something? I used that technique when I was cramming back in Uni, and found it to be helpful. &lt;/p&gt;\n\n&lt;p&gt;I also found that once I got some of it into my head, it got a lot easier since you feel a boost of confidence. Just get a big cup of tea, get cracking on it (don&amp;#39;t pressure yourself) and see how you get on :-) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6bf04", "score_hidden": false, "stickied": false, "created": 1492050792.0, "created_utc": 1492021992.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6a9zw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Solidu_Snaku", "parent_id": "t1_dg695vd", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I don't actually think I'm unfit I COULD do it but I seem to be completely and utterly unable to do work until very late. Like physically impossible. It'll take me 2 hours to get started and then I'll lose interest in like 10 minutes. So often I've read a chapter on autopilot and can't recall any of it. No one seems to understand how it feels. It's procrastination on another level. I'm not even dumb which is the worst part 'cause my grades are slipping and my teachers think I'm an idiot. It could just be I'm extremely lazy but I feel like anxiety has something to do with it. I'm rambling. Eghhh. \n\nThanks for replying, it means a lot. :)", "edited": 1492021180.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t actually think I&amp;#39;m unfit I COULD do it but I seem to be completely and utterly unable to do work until very late. Like physically impossible. It&amp;#39;ll take me 2 hours to get started and then I&amp;#39;ll lose interest in like 10 minutes. So often I&amp;#39;ve read a chapter on autopilot and can&amp;#39;t recall any of it. No one seems to understand how it feels. It&amp;#39;s procrastination on another level. I&amp;#39;m not even dumb which is the worst part &amp;#39;cause my grades are slipping and my teachers think I&amp;#39;m an idiot. It could just be I&amp;#39;m extremely lazy but I feel like anxiety has something to do with it. I&amp;#39;m rambling. Eghhh. &lt;/p&gt;\n\n&lt;p&gt;Thanks for replying, it means a lot. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6a9zw", "score_hidden": false, "stickied": false, "created": 1492049628.0, "created_utc": 1492020828.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg695vd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "takaci", "parent_id": "t3_64z5cc", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I had really bad anxiety in my first three years of uni here in the UK, but I could never bring myself to see anyone about it. Thankfully I feel better now but mental health support at many universities is quite bad. Exam period is hard because it's so long and feels like it'll never end, so it can get depressing and isolating.\n\nI'm gonna be honest though you definitely need to start revising unless you genuinely think it's bad enough to get extenuating circumstances at your uni.\n\nTips for revision:\n\n* keep a TODO list every day with a few small items on, if you are comfortable putting more on then do it. Keep the TODO list in one document so you can flick back and see how much progress you've made\n* use a pomodoro timer to work in 25 minute intervals with 5 minute breaks, and you get a 15 minute break every 4 pomodoros. very helpful for keeping in the flow while not feeling burnt out http://tomighty.org/ it's a lot easier to not procrastinate when you have a designated time just for procrastination\n\nSorry that they're just revision tips, but unless you honestly believe that you are unfit to sit the exams and think you can argue it to the university, you're just gonna be disappointed in your grades. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had really bad anxiety in my first three years of uni here in the UK, but I could never bring myself to see anyone about it. Thankfully I feel better now but mental health support at many universities is quite bad. Exam period is hard because it&amp;#39;s so long and feels like it&amp;#39;ll never end, so it can get depressing and isolating.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m gonna be honest though you definitely need to start revising unless you genuinely think it&amp;#39;s bad enough to get extenuating circumstances at your uni.&lt;/p&gt;\n\n&lt;p&gt;Tips for revision:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;keep a TODO list every day with a few small items on, if you are comfortable putting more on then do it. Keep the TODO list in one document so you can flick back and see how much progress you&amp;#39;ve made&lt;/li&gt;\n&lt;li&gt;use a pomodoro timer to work in 25 minute intervals with 5 minute breaks, and you get a 15 minute break every 4 pomodoros. very helpful for keeping in the flow while not feeling burnt out &lt;a href=\"http://tomighty.org/\"&gt;http://tomighty.org/&lt;/a&gt; it&amp;#39;s a lot easier to not procrastinate when you have a designated time just for procrastination&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Sorry that they&amp;#39;re just revision tips, but unless you honestly believe that you are unfit to sit the exams and think you can argue it to the university, you&amp;#39;re just gonna be disappointed in your grades. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg695vd", "score_hidden": false, "stickied": false, "created": 1492048484.0, "created_utc": 1492019684.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": "", "user_reports": [], "id": "dg74yte", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "phydox", "parent_id": "t1_dg6h5qx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Actually going to the talk space", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually going to the talk space&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg74yte", "score_hidden": false, "stickied": false, "created": 1492086214.0, "created_utc": 1492057414.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6h5qx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Solidu_Snaku", "parent_id": "t1_dg6eqbs", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "What is the \"next bit\"? Thanks :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is the &amp;quot;next bit&amp;quot;? Thanks :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6h5qx", "score_hidden": false, "stickied": false, "created": 1492056700.0, "created_utc": 1492027900.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6eqbs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "phydox", "parent_id": "t3_64z5cc", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I went to my GP for this last week. Gave me a bunch of local talk space services and a referral to jump the que a bit. One NHS, some others cheap or free.\nIt was really helpful, even though I haven't got to the next bit yet.\n\nWrite down what's going on, I froze up and didn't mention a bunch of stuff..\n\nI hope it goes well for you :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went to my GP for this last week. Gave me a bunch of local talk space services and a referral to jump the que a bit. One NHS, some others cheap or free.\nIt was really helpful, even though I haven&amp;#39;t got to the next bit yet.&lt;/p&gt;\n\n&lt;p&gt;Write down what&amp;#39;s going on, I froze up and didn&amp;#39;t mention a bunch of stuff..&lt;/p&gt;\n\n&lt;p&gt;I hope it goes well for you :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6eqbs", "score_hidden": false, "stickied": false, "created": 1492054221.0, "created_utc": 1492025421.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_64z5cc", "likes": null, "replies": "", "user_reports": [], "id": "dg6qnw6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Solidu_Snaku", "parent_id": "t1_dg6pxrt", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Last time I went to my GP I was basically told I'm not severe enough to need help! I cried my way home and I'm still not over it tbh. NHS is on my list of things I'll hate forever. Who ever was seeing me at the time I have such a rage for. Would not hesitate to throw a banana at their face if I saw them :/ Seems like we've both been let down. It's so hard to make someone understand something like that if they haven't experienced it. That negotiated learning plan thing seems like it might be useful. Thanks anyways ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Last time I went to my GP I was basically told I&amp;#39;m not severe enough to need help! I cried my way home and I&amp;#39;m still not over it tbh. NHS is on my list of things I&amp;#39;ll hate forever. Who ever was seeing me at the time I have such a rage for. Would not hesitate to throw a banana at their face if I saw them :/ Seems like we&amp;#39;ve both been let down. It&amp;#39;s so hard to make someone understand something like that if they haven&amp;#39;t experienced it. That negotiated learning plan thing seems like it might be useful. Thanks anyways &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6qnw6", "score_hidden": false, "stickied": false, "created": 1492067776.0, "created_utc": 1492038976.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pxrt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RSoul", "parent_id": "t3_64z5cc", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I feel like we are in quite similar spots. Not too long ago I was failing uni and just giving up on anything and now im still far from in a good spot but telling uni did help me out. I've been put on a Negotiated Learning Plan which gives me some freedom with assignment deadlines. As for seeing a GP, I did a month or so ago and ended up crying and saying all I could to her which was a really stressful experience and not something I was comfortable with at all. The GP gave me a perscription for 14 beta blockers and sent me on my way, felt like a waste of time and I have fallen back into suffering in silence. Im just trying to get through uni best I can at the moment and after I may go to the GP again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like we are in quite similar spots. Not too long ago I was failing uni and just giving up on anything and now im still far from in a good spot but telling uni did help me out. I&amp;#39;ve been put on a Negotiated Learning Plan which gives me some freedom with assignment deadlines. As for seeing a GP, I did a month or so ago and ended up crying and saying all I could to her which was a really stressful experience and not something I was comfortable with at all. The GP gave me a perscription for 14 beta blockers and sent me on my way, felt like a waste of time and I have fallen back into suffering in silence. Im just trying to get through uni best I can at the moment and after I may go to the GP again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6pxrt", "score_hidden": false, "stickied": false, "created": 1492066863.0, "created_utc": 1492038063.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]