[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay, so right now I&amp;#39;m sitting in bathroom hiding from class because of anxiety.  I&amp;#39;ve been here like forty minutes and no one has come in yet to get me or to poop.  I&amp;#39;m going to have to come out eventually, oh god.😫 I spend so much time hiding in bathrooms.  I once hid in a bathroom for an entire concert. I wasn&amp;#39;t performing, lol.&lt;/p&gt;\n\n&lt;p&gt;So, how the fuck am I going to explain this to the professor?  &amp;quot;Hey, sorry, I had a mental breakdown again.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Edit: and they sent a woman in to try to find me.  Oh God.&lt;/p&gt;\n\n&lt;p&gt;Edit: alright I&amp;#39;m out of the bathroom&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Okay, so right now I'm sitting in bathroom hiding from class because of anxiety.  I've been here like forty minutes and no one has come in yet to get me or to poop.  I'm going to have to come out eventually, oh god.😫 I spend so much time hiding in bathrooms.  I once hid in a bathroom for an entire concert. I wasn't performing, lol.\n\nSo, how the fuck am I going to explain this to the professor?  \"Hey, sorry, I had a mental breakdown again.\"\n\nEdit: and they sent a woman in to try to find me.  Oh God.\n\nEdit: alright I'm out of the bathroom", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6527qb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "PatternsInMyLife", "saved": false, "mod_reports": [], "name": "t3_6527qb", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": 1492045443.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/6527qb/hiding_in_an_bathroom_from_anxiety/", "num_reports": null, "locked": false, "stickied": false, "created": 1492072519.0, "url": "https://www.reddit.com/r/Anxiety/comments/6527qb/hiding_in_an_bathroom_from_anxiety/", "author_flair_text": null, "quarantine": false, "title": "Hiding in an bathroom from anxiety", "created_utc": 1492043719.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_6527qb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_6527qb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_6527qb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_6527qb", "likes": null, "replies": "", "user_reports": [], "id": "dg7abds", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PatternsInMyLife", "parent_id": "t1_dg79fqi", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Hahaha, if only.  I'll see all these people again for at least a year because this is an ensemble class open to the community.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hahaha, if only.  I&amp;#39;ll see all these people again for at least a year because this is an ensemble class open to the community.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg7abds", "score_hidden": false, "stickied": false, "created": 1492097720.0, "created_utc": 1492068920.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79fqi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lindsorb", "parent_id": "t1_dg748hs", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "It sounds like you need to talk to someone. Is there some kind of support system through the school? Or a family doctor you can reach out to? You don't have to go through this alone.\n\nAs for others... who cares what they think? It's YOUR body, YOUR education, YOUR decisions/issues/journey. Their opinion, whether malicious or sympathetic, doesn't affect your life in any way. I know that must have been an embarrassing situation but don't let it stop you from moving forward. After the semester you won't see most of them again anyway.\n\nAnd on the plus side, at least now your professor knows what's going on so maybe you can get some accommodations in the future!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you need to talk to someone. Is there some kind of support system through the school? Or a family doctor you can reach out to? You don&amp;#39;t have to go through this alone.&lt;/p&gt;\n\n&lt;p&gt;As for others... who cares what they think? It&amp;#39;s YOUR body, YOUR education, YOUR decisions/issues/journey. Their opinion, whether malicious or sympathetic, doesn&amp;#39;t affect your life in any way. I know that must have been an embarrassing situation but don&amp;#39;t let it stop you from moving forward. After the semester you won&amp;#39;t see most of them again anyway.&lt;/p&gt;\n\n&lt;p&gt;And on the plus side, at least now your professor knows what&amp;#39;s going on so maybe you can get some accommodations in the future!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg79fqi", "score_hidden": false, "stickied": false, "created": 1492095310.0, "created_utc": 1492066510.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_6527qb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_6527qb", "likes": null, "replies": "", "user_reports": [], "id": "dg9r1vo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PatternsInMyLife", "parent_id": "t1_dg9qv08", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "The worst thing about hiding in the bathroom is if someone need to actually use the bathroom.  I was hiding once and then I'm like, \"Is she... she's pooping.  Time to GTFO.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The worst thing about hiding in the bathroom is if someone need to actually use the bathroom.  I was hiding once and then I&amp;#39;m like, &amp;quot;Is she... she&amp;#39;s pooping.  Time to GTFO.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg9r1vo", "score_hidden": false, "stickied": false, "created": 1492232674.0, "created_utc": 1492203874.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9qv08", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "itsperiwinkle", "parent_id": "t1_dg748hs", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "The exact thing happens with me. I've hid in many bathrooms having panic attacks. It sucks. People think I'm crazy. I guess I kind of am a little so I own it. At least crazy is interesting. :) as people get to know me, it's something we can laugh about together so I don't feel as stupid. If they see me losing it I just give them the thumbs up as I'm hyperventilating and tears are streaming down my face. It only happens when my anxiety is at an extreme level, which takes a lot. It gets better when the anxiety is more under control. sometimes when I'm breaking down I laugh to myself and think it would be so funny if there was someone else hiding and we could make friends through the wall. Hasn't happened yet though. Maybe one day. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The exact thing happens with me. I&amp;#39;ve hid in many bathrooms having panic attacks. It sucks. People think I&amp;#39;m crazy. I guess I kind of am a little so I own it. At least crazy is interesting. :) as people get to know me, it&amp;#39;s something we can laugh about together so I don&amp;#39;t feel as stupid. If they see me losing it I just give them the thumbs up as I&amp;#39;m hyperventilating and tears are streaming down my face. It only happens when my anxiety is at an extreme level, which takes a lot. It gets better when the anxiety is more under control. sometimes when I&amp;#39;m breaking down I laugh to myself and think it would be so funny if there was someone else hiding and we could make friends through the wall. Hasn&amp;#39;t happened yet though. Maybe one day. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg9qv08", "score_hidden": false, "stickied": false, "created": 1492232435.0, "created_utc": 1492203635.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg748hs", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "PatternsInMyLife", "parent_id": "t1_dg6w0dz", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Yeah, that went fucking awful.  \n\nSo I hid in the bathroom for like an hour and ten minutes and finally left.  I had to come out eventually since there's a break and people would notice me hiding in the bathroom then.  I was hoping no one would notice.  Welp, they did.  Like four people asked if I was okay.  Then the professor walks toward me and I consider causally walking away briskly and he asks me if I'm alright and if my stomach hurts and I just stand there breathing heavily and sputtering out yes and no.  So he walks away and I find him again and talk to him in the corner and tell him I'm having anxiety attack.  He's pretty nice about it almost bordering on casual.  He encourages me to stay for the rest of class.\n\nSo there's like twenty minutes of class left and it goes fucking awful.  I stand there like a deer in headlights trying to cover my face with my hair and crying.  I went up and apologized to him after and he said it was okay and he appreciated having me in the class.\n\nSo that was terrible and humiliating and now everyone knows I'm nuts.  I mean, I have so many anxiety symptoms everyday I'm sure most people know anyways.  One of my friends was in a class with me in 2015 and told me how he could tell back them before he knew me how something was going on with me mentally.  So most people probably think I'm batshit anyway because I'm always hiding, breathing heavy, shaking, occasionally crying, and sometimes running away.", "edited": 1492063748.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, that went fucking awful.  &lt;/p&gt;\n\n&lt;p&gt;So I hid in the bathroom for like an hour and ten minutes and finally left.  I had to come out eventually since there&amp;#39;s a break and people would notice me hiding in the bathroom then.  I was hoping no one would notice.  Welp, they did.  Like four people asked if I was okay.  Then the professor walks toward me and I consider causally walking away briskly and he asks me if I&amp;#39;m alright and if my stomach hurts and I just stand there breathing heavily and sputtering out yes and no.  So he walks away and I find him again and talk to him in the corner and tell him I&amp;#39;m having anxiety attack.  He&amp;#39;s pretty nice about it almost bordering on casual.  He encourages me to stay for the rest of class.&lt;/p&gt;\n\n&lt;p&gt;So there&amp;#39;s like twenty minutes of class left and it goes fucking awful.  I stand there like a deer in headlights trying to cover my face with my hair and crying.  I went up and apologized to him after and he said it was okay and he appreciated having me in the class.&lt;/p&gt;\n\n&lt;p&gt;So that was terrible and humiliating and now everyone knows I&amp;#39;m nuts.  I mean, I have so many anxiety symptoms everyday I&amp;#39;m sure most people know anyways.  One of my friends was in a class with me in 2015 and told me how he could tell back them before he knew me how something was going on with me mentally.  So most people probably think I&amp;#39;m batshit anyway because I&amp;#39;m always hiding, breathing heavy, shaking, occasionally crying, and sometimes running away.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg748hs", "score_hidden": false, "stickied": false, "created": 1492085095.0, "created_utc": 1492056295.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_6527qb", "likes": null, "replies": "", "user_reports": [], "id": "dg718mk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bobbyjf", "parent_id": "t1_dg6w0dz", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I feel the kindheartedness from that post ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel the kindheartedness from that post &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg718mk", "score_hidden": false, "stickied": false, "created": 1492080839.0, "created_utc": 1492052039.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6w0dz", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "dwade333miami", "parent_id": "t3_6527qb", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Hello. I'm sorry you've struggled with anxiety. I have hid and avoided many things too. It's very common. I mean this respectfully, but would it be an option to tell your professor you're struggling with your health? You don't have to go into every detail, but letting your professor know you are experiencing a medical issue can be useful because they can work with you to make things much more manageable. If you decide to do this need help with what to say or write in an email, let me know because I can type up a quick example that you can edit or use as it is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello. I&amp;#39;m sorry you&amp;#39;ve struggled with anxiety. I have hid and avoided many things too. It&amp;#39;s very common. I mean this respectfully, but would it be an option to tell your professor you&amp;#39;re struggling with your health? You don&amp;#39;t have to go into every detail, but letting your professor know you are experiencing a medical issue can be useful because they can work with you to make things much more manageable. If you decide to do this need help with what to say or write in an email, let me know because I can type up a quick example that you can edit or use as it is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg6w0dz", "score_hidden": false, "stickied": false, "created": 1492074292.0, "created_utc": 1492045492.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}]