[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TLDR: Went to Boston on my own, went to museum for assignment, interacted with three strangers, no panic attacks, feel confident enough to do the same again.&lt;/p&gt;\n\n&lt;p&gt;About a week ago, I made a post here just sharing my plans to go into the city (and visit the Museum of Fine Arts for an art history project) on my own for the first time. I wanted to share my experience as soon as I got back, but there were some unexpected circumstances that got in the way.&lt;/p&gt;\n\n&lt;p&gt;So overall, I would say the experience was &lt;em&gt;pretty good&lt;/em&gt;, and I&amp;#39;m not just saying that. There were some very difficult moments that were quite anxiety provoking, and other moments that I handed surprisingly well, I think.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t take the train down alone (someone else from my hall had a ticket for the same time so we went together), but once I got to the station I went my own way. I felt a little lost and overwhelmed, so I sat down, got something to eat (eating in public while under stress is not my favorite thing usually) before asking a stranger that worked there for directions.&lt;/p&gt;\n\n&lt;p&gt;The subway ride there was... interesting. I mean I drive by half-built infrastructure and highways all the time, but the state of the subway was a kind of depressing. I&amp;#39;m also a pretty tall guy, and the seat I managed to find was only like half a seat, so my bony knees were hanging halfway out into the aisle. As soon as the car stayed relatively uncrowded, I should have been fine. Except a huge group got on at the next station. Not fun. A lot of them got off not long after, but it kind made the rest of the ride a bit stressful.&lt;/p&gt;\n\n&lt;p&gt;Getting into the museum was fairly straightforward, I was pleased to find. Yet, for some reason, grabbing my pencils and sketchbook from my backpack and leaving the rest with the coat check made me a bit anxious, probably because I was realizing I would have to walk around the museum with a sketchbook for a few hours and I hadn&amp;#39;t seen &lt;em&gt;anyone else&lt;/em&gt; with sketch gear yet, as I was expecting.&lt;/p&gt;\n\n&lt;p&gt;All those anxieties suddenly subsided when I started going through the exhibits. It was just so peaceful and interesting, and I never felt like I had eyes on me constantly, I didn&amp;#39;t feel self conscious, and I legitimately felt like just another guest in the museum.&lt;/p&gt;\n\n&lt;p&gt;Now anything art related I do is a very personal activity, and I only really draw in the privacy of my room, so starting the sketch I had to do for my assignment wasn&amp;#39;t easy. The painting I had chosen to study was one that caught &lt;em&gt;everyone&amp;#39;s&lt;/em&gt; eyes when they entered the room, so I was always &lt;em&gt;right there&lt;/em&gt; when people came in. At some point while I was well into my sketching, a complete stranger who had come to look at the painting looked at me and asked about my sketch. She was impressed that I had known how to sketch it or where I would even start (even though I screwed up my sketch real bad), and it was nice to have that little confidence boost from a complete stranger. Thought I keep looking back and didn&amp;#39;t realize at the time that I didn&amp;#39;t say &amp;quot;Thank you.&amp;quot; I just brushed it off with a joking &amp;quot;I&amp;#39;m an engineer, I really have no idea what I&amp;#39;m supposed to do here.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I got a text from my mother who I didn&amp;#39;t even tell I was going to Boston until the day before (I didn&amp;#39;t want her to try to tell me what I needed to do even though I had already figured it out without her). My parents happened to be nearby-ish for family stuff, and she offered to bring me back to school if I needed them too. Since the museum had to be evacuated because of a fire alarm, I missed a good chunk of time to work on my sketch before I could finish it. Because of this I was going to miss my train back, and asked my parents to bring me back so I wouldn&amp;#39;t have to wait another hour for the next train.&lt;/p&gt;\n\n&lt;p&gt;On my way back to the station, two complete strangers asked my about the T (tickets, directions), which shocked me. I don&amp;#39;t really see myself as an approachable person most of the time, so these little interactions here were another little confidence boost.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s about it. My parents picked me up soon after I got to the station and drove me back. I would have said about how anxious I was during the whole trip, but I think I was honestly too anxious throughout to be aware of how I was feeling exactly. But I did it! I never thought I could but I did, and I feel like I could absolutely do something like that again even more independently than this first time!&lt;/p&gt;\n\n&lt;p&gt;Sorry for the poor writing, it&amp;#39;s early and I have stuff to do and I want to get this posted because I meant to earlier and stuff. If you got this far thanks for caring, I appreciate it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "TLDR: Went to Boston on my own, went to museum for assignment, interacted with three strangers, no panic attacks, feel confident enough to do the same again.\n\nAbout a week ago, I made a post here just sharing my plans to go into the city (and visit the Museum of Fine Arts for an art history project) on my own for the first time. I wanted to share my experience as soon as I got back, but there were some unexpected circumstances that got in the way.\n\nSo overall, I would say the experience was *pretty good*, and I'm not just saying that. There were some very difficult moments that were quite anxiety provoking, and other moments that I handed surprisingly well, I think.\n\nI didn't take the train down alone (someone else from my hall had a ticket for the same time so we went together), but once I got to the station I went my own way. I felt a little lost and overwhelmed, so I sat down, got something to eat (eating in public while under stress is not my favorite thing usually) before asking a stranger that worked there for directions.\n\nThe subway ride there was... interesting. I mean I drive by half-built infrastructure and highways all the time, but the state of the subway was a kind of depressing. I'm also a pretty tall guy, and the seat I managed to find was only like half a seat, so my bony knees were hanging halfway out into the aisle. As soon as the car stayed relatively uncrowded, I should have been fine. Except a huge group got on at the next station. Not fun. A lot of them got off not long after, but it kind made the rest of the ride a bit stressful.\n\nGetting into the museum was fairly straightforward, I was pleased to find. Yet, for some reason, grabbing my pencils and sketchbook from my backpack and leaving the rest with the coat check made me a bit anxious, probably because I was realizing I would have to walk around the museum with a sketchbook for a few hours and I hadn't seen *anyone else* with sketch gear yet, as I was expecting.\n\nAll those anxieties suddenly subsided when I started going through the exhibits. It was just so peaceful and interesting, and I never felt like I had eyes on me constantly, I didn't feel self conscious, and I legitimately felt like just another guest in the museum.\n\nNow anything art related I do is a very personal activity, and I only really draw in the privacy of my room, so starting the sketch I had to do for my assignment wasn't easy. The painting I had chosen to study was one that caught *everyone's* eyes when they entered the room, so I was always *right there* when people came in. At some point while I was well into my sketching, a complete stranger who had come to look at the painting looked at me and asked about my sketch. She was impressed that I had known how to sketch it or where I would even start (even though I screwed up my sketch real bad), and it was nice to have that little confidence boost from a complete stranger. Thought I keep looking back and didn't realize at the time that I didn't say \"Thank you.\" I just brushed it off with a joking \"I'm an engineer, I really have no idea what I'm supposed to do here.\"\n\nI got a text from my mother who I didn't even tell I was going to Boston until the day before (I didn't want her to try to tell me what I needed to do even though I had already figured it out without her). My parents happened to be nearby-ish for family stuff, and she offered to bring me back to school if I needed them too. Since the museum had to be evacuated because of a fire alarm, I missed a good chunk of time to work on my sketch before I could finish it. Because of this I was going to miss my train back, and asked my parents to bring me back so I wouldn't have to wait another hour for the next train.\n\nOn my way back to the station, two complete strangers asked my about the T (tickets, directions), which shocked me. I don't really see myself as an approachable person most of the time, so these little interactions here were another little confidence boost.\n\nThat's about it. My parents picked me up soon after I got to the station and drove me back. I would have said about how anxious I was during the whole trip, but I think I was honestly too anxious throughout to be aware of how I was feeling exactly. But I did it! I never thought I could but I did, and I feel like I could absolutely do something like that again even more independently than this first time!\n\nSorry for the poor writing, it's early and I have stuff to do and I want to get this posted because I meant to earlier and stuff. If you got this far thanks for caring, I appreciate it.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "655dxm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "YonuNautilus", "saved": false, "mod_reports": [], "name": "t3_655dxm", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/655dxm/a_little_late_but_i_went_to_the_city_alone_almost/", "num_reports": null, "locked": false, "stickied": false, "created": 1492118103.0, "url": "https://www.reddit.com/r/Anxiety/comments/655dxm/a_little_late_but_i_went_to_the_city_alone_almost/", "author_flair_text": null, "quarantine": false, "title": "A little Late, but I went to the city alone (almost entirely) and I feel pretty good about it!", "created_utc": 1492089303.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_655dxm", "likes": null, "replies": "", "user_reports": [], "id": "dg7umf5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "msmiitz", "parent_id": "t3_655dxm", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Good. I read the TLDR at least. I didn't have the time to read the entire long version.  But I think any time we can overcome our fear is a step in the right direction.  Nothing happened to you, and even if something DID happen I think you are confident enough to handle yourself. Respect.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good. I read the TLDR at least. I didn&amp;#39;t have the time to read the entire long version.  But I think any time we can overcome our fear is a step in the right direction.  Nothing happened to you, and even if something DID happen I think you are confident enough to handle yourself. Respect.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg7umf5", "score_hidden": false, "stickied": false, "created": 1492131653.0, "created_utc": 1492102853.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_655dxm", "likes": null, "replies": "", "user_reports": [], "id": "dg872bg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WeWerePromisedMuse", "parent_id": "t3_655dxm", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "That's a big step that you took!  Congrats!\n\nIf you're planning on doing anymore traveling by yourself I would recommend writing down your itinerary a week or two before going so you have a solid plan in your mind and also written down.  I have been doing some solo travel and it helps in case I have any anxious situations and can't think straight.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a big step that you took!  Congrats!&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re planning on doing anymore traveling by yourself I would recommend writing down your itinerary a week or two before going so you have a solid plan in your mind and also written down.  I have been doing some solo travel and it helps in case I have any anxious situations and can&amp;#39;t think straight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg872bg", "score_hidden": false, "stickied": false, "created": 1492145101.0, "created_utc": 1492116301.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_655dxm", "likes": null, "replies": "", "user_reports": [], "id": "dg8qh28", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jjfad85", "parent_id": "t3_655dxm", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Awesome!! Congrats!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome!! Congrats!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg8qh28", "score_hidden": false, "stickied": false, "created": 1492171533.0, "created_utc": 1492142733.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]