[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I began learning how to drive last September. I went to the Driver&amp;#39;s Education program at my school and at first it was nice and seemed easy but it later became more of a chore and I made no real progress. At the end of last session the instructor told my father that she does not think I am ready to drive. And that she thinks I should retake her 500$ course in the summer when I can go everyday and have consistent reinforcement. After that my parents began taking me out almost everyday. We started small, driving to the bus stop and back, and I eventually got a bit farther and even drove to a walmart a couple miles from my house. Since then I&amp;#39;ve repeatedly almost got into an accident and had what my dad believes to be several panic attacks and a couple nervous breakdowns. This is causing a lot stress and anxiety. But I can&amp;#39;t refuse because &amp;quot;it&amp;#39;s a life skill I have to learn.&amp;quot; I hate this feeling of stress about learning a skill and wish I could be done and over with it. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I began learning how to drive last September. I went to the Driver's Education program at my school and at first it was nice and seemed easy but it later became more of a chore and I made no real progress. At the end of last session the instructor told my father that she does not think I am ready to drive. And that she thinks I should retake her 500$ course in the summer when I can go everyday and have consistent reinforcement. After that my parents began taking me out almost everyday. We started small, driving to the bus stop and back, and I eventually got a bit farther and even drove to a walmart a couple miles from my house. Since then I've repeatedly almost got into an accident and had what my dad believes to be several panic attacks and a couple nervous breakdowns. This is causing a lot stress and anxiety. But I can't refuse because \"it's a life skill I have to learn.\" I hate this feeling of stress about learning a skill and wish I could be done and over with it. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Driving", "id": "656wmx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "Firebat12", "saved": false, "mod_reports": [], "name": "t3_656wmx", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": "drivingflair", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/656wmx/driving_anxiety/", "num_reports": null, "locked": false, "stickied": false, "created": 1492133060.0, "url": "https://www.reddit.com/r/Anxiety/comments/656wmx/driving_anxiety/", "author_flair_text": null, "quarantine": false, "title": "Driving Anxiety", "created_utc": 1492104260.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_656wmx", "likes": null, "replies": "", "user_reports": [], "id": "dg7z668", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Mimi149", "parent_id": "t3_656wmx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I didn't get my license until I was 25, and I encourage you to keep trying while you have this support system in place. I know it's tough, but try to not be a self-fulfilling prophecy. If you believe that you can do it, you'll be able to do it! When you get behind the wheel remind yourself that you can do this, don't listen to the naysayers. \n\nDon't stop practicing, the more you drive the better it will get and the more comfortable you will feel! \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t get my license until I was 25, and I encourage you to keep trying while you have this support system in place. I know it&amp;#39;s tough, but try to not be a self-fulfilling prophecy. If you believe that you can do it, you&amp;#39;ll be able to do it! When you get behind the wheel remind yourself that you can do this, don&amp;#39;t listen to the naysayers. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t stop practicing, the more you drive the better it will get and the more comfortable you will feel! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg7z668", "score_hidden": false, "stickied": false, "created": 1492136490.0, "created_utc": 1492107690.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_656wmx", "likes": null, "replies": "", "user_reports": [], "id": "dg8rjqt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ChickadeeShoes", "parent_id": "t3_656wmx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I didn't get my license until I was in my twenties for a myriad of reasons, anxiety being the biggest one, so I feel for you.\n\nThings I found that helped make it easier for me:\n\n- Practicing in big, empty parking lots.  Think school parking lots after hours, church parking lots, Walmart parking lots when it's not busy, etc.  You can practice skills like turning, merging, parking, and staying in your lane over and over, as many times as you need, as slowly as you want, without worrying about hitting anyone or driving off the road. That way, you can build up your confidence in a 100% safe environment, so when you go out on the road, you have the muscle memory and the confidence to help you do well and not panic.\n\n- Getting someone besides my parents to help me practice.  My parents are awesome, but when I was learning to drive, my mom had recently been in a car accident, so she had major anxiety around driving and being in cars, which made everything more stressful for me, and my dad's teaching style was also incredibly stressful.  When I realized practicing with them wasn't helping me, I ended up doing most of my practice with my brother-in-law, who was a super patient teacher, and it was so much better!  Do you have any local uncles or aunts, cousins, neighbors, adult friends or siblings who are more calming, and would be willing to help you get your practice in?\n\n- My mantra when learning to drive was \"what one man can do, another can do\".  Reminding myself of all of the people I know who are much younger than me, or seem less capable than me, but who still manage to safely drive every day was a helpful way to remind myself that the issue wasn't with my ability, but with my state of mind.  People from all backgrounds and abilities successfully drive every day, and so can you!\n\n- Tina Fey, who is very successful and generally awesome, doesn't have a drivers license.  If it takes you a little longer than average to get your license, it's not a character flaw, and you are not a failure. Don't let pressure to get this done by a certain time get into your head.\n\nGood luck - it will get easier!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t get my license until I was in my twenties for a myriad of reasons, anxiety being the biggest one, so I feel for you.&lt;/p&gt;\n\n&lt;p&gt;Things I found that helped make it easier for me:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Practicing in big, empty parking lots.  Think school parking lots after hours, church parking lots, Walmart parking lots when it&amp;#39;s not busy, etc.  You can practice skills like turning, merging, parking, and staying in your lane over and over, as many times as you need, as slowly as you want, without worrying about hitting anyone or driving off the road. That way, you can build up your confidence in a 100% safe environment, so when you go out on the road, you have the muscle memory and the confidence to help you do well and not panic.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Getting someone besides my parents to help me practice.  My parents are awesome, but when I was learning to drive, my mom had recently been in a car accident, so she had major anxiety around driving and being in cars, which made everything more stressful for me, and my dad&amp;#39;s teaching style was also incredibly stressful.  When I realized practicing with them wasn&amp;#39;t helping me, I ended up doing most of my practice with my brother-in-law, who was a super patient teacher, and it was so much better!  Do you have any local uncles or aunts, cousins, neighbors, adult friends or siblings who are more calming, and would be willing to help you get your practice in?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;My mantra when learning to drive was &amp;quot;what one man can do, another can do&amp;quot;.  Reminding myself of all of the people I know who are much younger than me, or seem less capable than me, but who still manage to safely drive every day was a helpful way to remind myself that the issue wasn&amp;#39;t with my ability, but with my state of mind.  People from all backgrounds and abilities successfully drive every day, and so can you!&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Tina Fey, who is very successful and generally awesome, doesn&amp;#39;t have a drivers license.  If it takes you a little longer than average to get your license, it&amp;#39;s not a character flaw, and you are not a failure. Don&amp;#39;t let pressure to get this done by a certain time get into your head.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Good luck - it will get easier!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg8rjqt", "score_hidden": false, "stickied": false, "created": 1492173339.0, "created_utc": 1492144539.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_656wmx", "likes": null, "replies": "", "user_reports": [], "id": "dg84sue", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HentaiWizard", "parent_id": "t3_656wmx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I had this problem when I was 16. I didn't have the panic attacks from it but I did feel anxious and nervous. I would even have random adrenaline rushes from just going down the road. I think what helped me is trying to practice driving where no one else is really on the road. Go to abandoned parking lots or even get your parents to take you out driving real early on saturday or sunday when less people are out. I think that is what helped me anyways. It made me more comfortable in a vehicle I think. I hope you get past this!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had this problem when I was 16. I didn&amp;#39;t have the panic attacks from it but I did feel anxious and nervous. I would even have random adrenaline rushes from just going down the road. I think what helped me is trying to practice driving where no one else is really on the road. Go to abandoned parking lots or even get your parents to take you out driving real early on saturday or sunday when less people are out. I think that is what helped me anyways. It made me more comfortable in a vehicle I think. I hope you get past this!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg84sue", "score_hidden": false, "stickied": false, "created": 1492142576.0, "created_utc": 1492113776.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_656wmx", "likes": null, "replies": "", "user_reports": [], "id": "dg8ae3r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mmxcv", "parent_id": "t3_656wmx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I went through this as well, and didn't get my license until 20 because I was terrified I would get into an accident and get hurt/hurt someone. I was lucky that my parents were very patient and even went so far as to drive me to my classes in college until I was able to overcome that fear. \n\nI do understand though that not everyone is in that situation where they are able to wait that long until they get their license. I really feel the drivers ed classes may help you - I was able to get driving lessons at age 20 and the instructor had a brake on the passenger side while I was driving and that calmed my fears a lot. We started in parking lots and slowly moved up to less busy streets and eventually the expressway. I can't even stress how much the driving lessons helped me - I was able to get the practice I needed with driving without fearing of getting into an accident. I have been driving for 4 years now and I drive 500 miles both ways to visit my fiancée about once a month. It is possible to overcome this fear, I promise. The driving lessons may very well give you the help you need with overcoming it! Honestly if I can do it, anyone can, because I was so terrified but I am doing much better now. Best of luck. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went through this as well, and didn&amp;#39;t get my license until 20 because I was terrified I would get into an accident and get hurt/hurt someone. I was lucky that my parents were very patient and even went so far as to drive me to my classes in college until I was able to overcome that fear. &lt;/p&gt;\n\n&lt;p&gt;I do understand though that not everyone is in that situation where they are able to wait that long until they get their license. I really feel the drivers ed classes may help you - I was able to get driving lessons at age 20 and the instructor had a brake on the passenger side while I was driving and that calmed my fears a lot. We started in parking lots and slowly moved up to less busy streets and eventually the expressway. I can&amp;#39;t even stress how much the driving lessons helped me - I was able to get the practice I needed with driving without fearing of getting into an accident. I have been driving for 4 years now and I drive 500 miles both ways to visit my fiancée about once a month. It is possible to overcome this fear, I promise. The driving lessons may very well give you the help you need with overcoming it! Honestly if I can do it, anyone can, because I was so terrified but I am doing much better now. Best of luck. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg8ae3r", "score_hidden": false, "stickied": false, "created": 1492149089.0, "created_utc": 1492120289.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]