[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel horrible about it, but I&amp;#39;m getting better. It was a manipulative relationship from the start; there were some very beautiful and tender moments within, but it got to the point where I could no longer speak about stuff I was upset about without being afraid I&amp;#39;d upset him in the process. He wanted to control every situation. The long distance was miserable and he kept wanting me to comply with what he wanted to do. Please send your love. My anxiety has improved a lot in the past few months, but these events have plunged me back into constant panic attacks along the lines of &amp;quot;Did I make the wrong choice?&amp;quot; &amp;quot;What do I do now?&amp;quot; &amp;quot;I have no one to talk to - maybe you should talk to him again?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s been a battle with myself the past few days. Words of encouragement would really help. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit&lt;/strong&gt; The breakup was horrible. I told him how I felt about the distance making me miserable and more reasons about why this isn&amp;#39;t a good idea right now. He called me and we sat in silence for an upwards of ten minutes. He hasn&amp;#39;t contacted me since...which in a way has helped but I still can&amp;#39;t get over the fact that I am a horrible person for breaking his heart. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I feel horrible about it, but I'm getting better. It was a manipulative relationship from the start; there were some very beautiful and tender moments within, but it got to the point where I could no longer speak about stuff I was upset about without being afraid I'd upset him in the process. He wanted to control every situation. The long distance was miserable and he kept wanting me to comply with what he wanted to do. Please send your love. My anxiety has improved a lot in the past few months, but these events have plunged me back into constant panic attacks along the lines of \"Did I make the wrong choice?\" \"What do I do now?\" \"I have no one to talk to - maybe you should talk to him again?\"\n\nIt's been a battle with myself the past few days. Words of encouragement would really help. \n\n**Edit** The breakup was horrible. I told him how I felt about the distance making me miserable and more reasons about why this isn't a good idea right now. He called me and we sat in silence for an upwards of ten minutes. He hasn't contacted me since...which in a way has helped but I still can't get over the fact that I am a horrible person for breaking his heart. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "65aiju", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 30, "report_reasons": null, "author": "throwawayprobzzz", "saved": false, "mod_reports": [], "name": "t3_65aiju", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": 1492143846.0, "link_flair_css_class": "relationshipflair", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/65aiju/update_i_broke_things_off_with_my_boyfriend/", "num_reports": null, "locked": false, "stickied": false, "created": 1492172429.0, "url": "https://www.reddit.com/r/Anxiety/comments/65aiju/update_i_broke_things_off_with_my_boyfriend/", "author_flair_text": null, "quarantine": false, "title": "Update: I broke things off with my boyfriend", "created_utc": 1492143629.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 30}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65aiju", "likes": null, "replies": "", "user_reports": [], "id": "dg8rtj0", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "Napkins_pm", "parent_id": "t3_65aiju", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I'm not going to pretend I understand your entire relationship, but I'll give you my two cents.\n\nYou made the right choice. You know that. I'm sure the discomfort of ending it is a little rending, but it will become bearable. \n\nConsidering that you realize he was manipulating you into going along with shit you didn't want to, then you shouldn't talk to him. You know he's going to play you in order to get you back, so don't give him the time of day to do it.\n\nBlah blah, enough of my rambling relationship shit.\n\nThe anxiety from just getting out of a close relationship is the main concern right now. I know telling you to calm down is going to sound like a bullshit idea, but that's essentially what I'm going to suggest. \n\n#####Make time for you.\nDo things *you* enjoy. Listen to \"fuck you, I'm awesome\" music. Take a long bath and idealize what you hope to accomplish. Feel the motivation and use this anxious energy to fuel your new life.\n\nHope I helped. If you need someone to talk to, you can pm me. (:", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not going to pretend I understand your entire relationship, but I&amp;#39;ll give you my two cents.&lt;/p&gt;\n\n&lt;p&gt;You made the right choice. You know that. I&amp;#39;m sure the discomfort of ending it is a little rending, but it will become bearable. &lt;/p&gt;\n\n&lt;p&gt;Considering that you realize he was manipulating you into going along with shit you didn&amp;#39;t want to, then you shouldn&amp;#39;t talk to him. You know he&amp;#39;s going to play you in order to get you back, so don&amp;#39;t give him the time of day to do it.&lt;/p&gt;\n\n&lt;p&gt;Blah blah, enough of my rambling relationship shit.&lt;/p&gt;\n\n&lt;p&gt;The anxiety from just getting out of a close relationship is the main concern right now. I know telling you to calm down is going to sound like a bullshit idea, but that&amp;#39;s essentially what I&amp;#39;m going to suggest. &lt;/p&gt;\n\n&lt;h5&gt;Make time for you.&lt;/h5&gt;\n\n&lt;p&gt;Do things &lt;em&gt;you&lt;/em&gt; enjoy. Listen to &amp;quot;fuck you, I&amp;#39;m awesome&amp;quot; music. Take a long bath and idealize what you hope to accomplish. Feel the motivation and use this anxious energy to fuel your new life.&lt;/p&gt;\n\n&lt;p&gt;Hope I helped. If you need someone to talk to, you can pm me. (:&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg8rtj0", "score_hidden": false, "stickied": false, "created": 1492173829.0, "created_utc": 1492145029.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65aiju", "likes": null, "replies": "", "user_reports": [], "id": "dg8v5ys", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "asamermaid", "parent_id": "t3_65aiju", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "You're not a horrible person for 'breaking his heart.'  You are a human being who deserves to make decisions that are best for YOU.\n\nWhat would be awful would be stringing him along when you were miserable.  You deserve to be happy.  This was holding you back.\n\nYou're okay.  I find things are awful initially, especially depending on how long you were together.  But take this time to indulge in the aspect of Freedom you acquired.  When you're in a situation, think about how he can't control it.  Think about how you don't have someone telling you what to do.  Focus on these things, and you'll know you made the right choice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not a horrible person for &amp;#39;breaking his heart.&amp;#39;  You are a human being who deserves to make decisions that are best for YOU.&lt;/p&gt;\n\n&lt;p&gt;What would be awful would be stringing him along when you were miserable.  You deserve to be happy.  This was holding you back.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re okay.  I find things are awful initially, especially depending on how long you were together.  But take this time to indulge in the aspect of Freedom you acquired.  When you&amp;#39;re in a situation, think about how he can&amp;#39;t control it.  Think about how you don&amp;#39;t have someone telling you what to do.  Focus on these things, and you&amp;#39;ll know you made the right choice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg8v5ys", "score_hidden": false, "stickied": false, "created": 1492180872.0, "created_utc": 1492152072.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65aiju", "likes": null, "replies": "", "user_reports": [], "id": "dg8xfhp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "motivationascending", "parent_id": "t3_65aiju", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Hang in there.  Time will help you gain perspective, and you will probably feel better for it.  You are allowed to have feelings, and your supposed to be able to share them with your partner.  If he wasn't facilitating that process, he wasn't doing everything he could to help the relationship be as good as it could be.  \nThat said, in a bit of time you will find your new equilibrium, so try and fill in the time as best as you can.  Exercise, eat well, relax, go on adventures - whatever it is you do - do it.  He will be fine.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hang in there.  Time will help you gain perspective, and you will probably feel better for it.  You are allowed to have feelings, and your supposed to be able to share them with your partner.  If he wasn&amp;#39;t facilitating that process, he wasn&amp;#39;t doing everything he could to help the relationship be as good as it could be.&lt;br/&gt;\nThat said, in a bit of time you will find your new equilibrium, so try and fill in the time as best as you can.  Exercise, eat well, relax, go on adventures - whatever it is you do - do it.  He will be fine.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg8xfhp", "score_hidden": false, "stickied": false, "created": 1492187284.0, "created_utc": 1492158484.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65aiju", "likes": null, "replies": "", "user_reports": [], "id": "dg91fet", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ScudJoples", "parent_id": "t3_65aiju", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Trust me, breaking up was the right thing to do. I was in the same situation, but I was the boyfriend here. I was manipulative and controlling without even realizing, and I said some nasty stuff after she broke it off. I was mad and spiteful, and I still kinda feel the same way. But her getting away from me was the most brutal wake up call I hope I ever get in my life. I've been dedicated to not being as angry or manipulative, as I didn't even realize I was being manipulative beforehand. I don't know how your ex behaved exactly, but chances are he wasn't trying to hurt you. That's just how he was raised to deal with emotions, and if it leaves you feeling like shit then you shouldn't have to take it. Find someone new, or just learn to be alone, and be happy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trust me, breaking up was the right thing to do. I was in the same situation, but I was the boyfriend here. I was manipulative and controlling without even realizing, and I said some nasty stuff after she broke it off. I was mad and spiteful, and I still kinda feel the same way. But her getting away from me was the most brutal wake up call I hope I ever get in my life. I&amp;#39;ve been dedicated to not being as angry or manipulative, as I didn&amp;#39;t even realize I was being manipulative beforehand. I don&amp;#39;t know how your ex behaved exactly, but chances are he wasn&amp;#39;t trying to hurt you. That&amp;#39;s just how he was raised to deal with emotions, and if it leaves you feeling like shit then you shouldn&amp;#39;t have to take it. Find someone new, or just learn to be alone, and be happy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg91fet", "score_hidden": false, "stickied": false, "created": 1492199476.0, "created_utc": 1492170676.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65aiju", "likes": null, "replies": "", "user_reports": [], "id": "dg92qzj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jdu44", "parent_id": "t3_65aiju", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Well done, you made the right decision and you are most certainly not a horrible person. In almost all breakups, it's really natural to feel like you made the wrong decision, but from the sounds of things you definitely didn't here. \n\nI'll admit that I was surprised when I read your previous post on this situation (I found this one first) and found that you'd only been going out for 5 months. From the sound of *this* post I assumed you'd been together for years! \n\n5 months is IMO still the very early stages of figuring out if you're remotely compatible. That's even tougher if you're long-distance. You gave this a shot and you were arguing all the time, so it's pretty clear that this one wasn't meant to be. You have one life, and you shouldn't spend any more of it with someone you're arguing with after 5 months *(20 weeks!)*. \n\nTake some time to yourself, treat yourself to something nice, and then move on. Seriously you have nothing to blame yourself for. Relax.    ", "edited": 1492173732.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well done, you made the right decision and you are most certainly not a horrible person. In almost all breakups, it&amp;#39;s really natural to feel like you made the wrong decision, but from the sounds of things you definitely didn&amp;#39;t here. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll admit that I was surprised when I read your previous post on this situation (I found this one first) and found that you&amp;#39;d only been going out for 5 months. From the sound of &lt;em&gt;this&lt;/em&gt; post I assumed you&amp;#39;d been together for years! &lt;/p&gt;\n\n&lt;p&gt;5 months is IMO still the very early stages of figuring out if you&amp;#39;re remotely compatible. That&amp;#39;s even tougher if you&amp;#39;re long-distance. You gave this a shot and you were arguing all the time, so it&amp;#39;s pretty clear that this one wasn&amp;#39;t meant to be. You have one life, and you shouldn&amp;#39;t spend any more of it with someone you&amp;#39;re arguing with after 5 months &lt;em&gt;(20 weeks!)&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;Take some time to yourself, treat yourself to something nice, and then move on. Seriously you have nothing to blame yourself for. Relax.    &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg92qzj", "score_hidden": false, "stickied": false, "created": 1492202294.0, "created_utc": 1492173494.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65aiju", "likes": null, "replies": "", "user_reports": [], "id": "dg949yx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "msmiitz", "parent_id": "t3_65aiju", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Relationships are difficult.  There are times when you won't know if you made the right choice. But I think it is better to stick to your guns once you have made the decision and then learn from it.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Relationships are difficult.  There are times when you won&amp;#39;t know if you made the right choice. But I think it is better to stick to your guns once you have made the decision and then learn from it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg949yx", "score_hidden": false, "stickied": false, "created": 1492204982.0, "created_utc": 1492176182.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65aiju", "likes": null, "replies": "", "user_reports": [], "id": "dg99js7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DestroyerOfWombs", "parent_id": "t3_65aiju", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Breaking someone's heart is an unfortunate side-effect of ending a relationship. It doesn't make you a bad person. Their heart will heal, as will yours, and you will move on. Everything will be okay! Relationships end, that is just how it goes. It isn't your responsibility to forgo your own happiness to shelter him from this feeling. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Breaking someone&amp;#39;s heart is an unfortunate side-effect of ending a relationship. It doesn&amp;#39;t make you a bad person. Their heart will heal, as will yours, and you will move on. Everything will be okay! Relationships end, that is just how it goes. It isn&amp;#39;t your responsibility to forgo your own happiness to shelter him from this feeling. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg99js7", "score_hidden": false, "stickied": false, "created": 1492212111.0, "created_utc": 1492183311.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65aiju", "likes": null, "replies": "", "user_reports": [], "id": "dg9vyn4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "duchessofsephora", "parent_id": "t3_65aiju", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "You aren't a horrible person for getting out of a relationship that wasn't working for you. He probably needs some time to work this out in his head, especially if he's used to being controlling. Give him his space and know you broke up with him for a reason, don't beat yourself up over it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You aren&amp;#39;t a horrible person for getting out of a relationship that wasn&amp;#39;t working for you. He probably needs some time to work this out in his head, especially if he&amp;#39;s used to being controlling. Give him his space and know you broke up with him for a reason, don&amp;#39;t beat yourself up over it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg9vyn4", "score_hidden": false, "stickied": false, "created": 1492239082.0, "created_utc": 1492210282.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65aiju", "likes": null, "replies": "", "user_reports": [], "id": "dga2kb4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Yiskra", "parent_id": "t3_65aiju", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "The bad news: break ups suck even if you know it was for the best. I cried and went through the whole 9 yards after finally saying I wanted a divorce. It takes time.\n\nThe good news: no more manipulative boyfriend! You are free! Time will heal the hurts and once you're ready there is someone out there who will be fantastic for you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The bad news: break ups suck even if you know it was for the best. I cried and went through the whole 9 yards after finally saying I wanted a divorce. It takes time.&lt;/p&gt;\n\n&lt;p&gt;The good news: no more manipulative boyfriend! You are free! Time will heal the hurts and once you&amp;#39;re ready there is someone out there who will be fantastic for you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dga2kb4", "score_hidden": false, "stickied": false, "created": 1492247902.0, "created_utc": 1492219102.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]