[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all!&lt;/p&gt;\n\n&lt;p&gt;So the manager of the store I work at decided we needed to start wearing uniforms. Whatever, no big. The problem: it&amp;#39;s ENORMOUS on me. Even the small I&amp;#39;m practically swimming in. I&amp;#39;m a short, very skinny guy, so this is a problem for me pretty often.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a blue button up, of which I have plenty of my own that actually fit me. The actual uniform shirt I was given doesn&amp;#39;t have our store name on it but does have patches. I brought it in to get tailored but it&amp;#39;s crazy expensive to do so and the tailor (who laughed cause it was so big) said it probably wouldn&amp;#39;t make a big enough difference anyway. The sleeves go way past my hands, I can fit both arms in one sleeve with room to spare, and it goes down past my knees. And that&amp;#39;s the SMALLEST size (which, I don&amp;#39;t think is a real small. These must run huge cause I fit into most XS/S from your typical shops.)&lt;/p&gt;\n\n&lt;p&gt;What should I say to my manager? I don&amp;#39;t want to be forced to wear this cause it looks utterly ridiculous and frankly, unprofessional. How is it presentable for me to wear a shirt four times too big? Do you guys think I can compromise with them over this, like just wear similar style/color shirts, but not the specific one we were given? This whole scenario is giving me crazy anxiety to think about.&lt;/p&gt;\n\n&lt;p&gt;I have no issue dressing nicer, I dress nicely every day and enjoy it. I even don&amp;#39;t care about wearing a uniform. I just think it should actually fit. I feel like wearing street clothes is more professional than wearing a dress shirt that is noticeably swallowing me up.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all!\n\nSo the manager of the store I work at decided we needed to start wearing uniforms. Whatever, no big. The problem: it's ENORMOUS on me. Even the small I'm practically swimming in. I'm a short, very skinny guy, so this is a problem for me pretty often.\n\nIt's a blue button up, of which I have plenty of my own that actually fit me. The actual uniform shirt I was given doesn't have our store name on it but does have patches. I brought it in to get tailored but it's crazy expensive to do so and the tailor (who laughed cause it was so big) said it probably wouldn't make a big enough difference anyway. The sleeves go way past my hands, I can fit both arms in one sleeve with room to spare, and it goes down past my knees. And that's the SMALLEST size (which, I don't think is a real small. These must run huge cause I fit into most XS/S from your typical shops.)\n\nWhat should I say to my manager? I don't want to be forced to wear this cause it looks utterly ridiculous and frankly, unprofessional. How is it presentable for me to wear a shirt four times too big? Do you guys think I can compromise with them over this, like just wear similar style/color shirts, but not the specific one we were given? This whole scenario is giving me crazy anxiety to think about.\n\nI have no issue dressing nicer, I dress nicely every day and enjoy it. I even don't care about wearing a uniform. I just think it should actually fit. I feel like wearing street clothes is more professional than wearing a dress shirt that is noticeably swallowing me up.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Work/Search", "id": "65alf3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "btbizzle", "saved": false, "mod_reports": [], "name": "t3_65alf3", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": 1492145504.0, "link_flair_css_class": "workflair", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/65alf3/work_introduced_new_uniforms_that_dont_fit_me/", "num_reports": null, "locked": false, "stickied": false, "created": 1492173543.0, "url": "https://www.reddit.com/r/Anxiety/comments/65alf3/work_introduced_new_uniforms_that_dont_fit_me/", "author_flair_text": null, "quarantine": false, "title": "Work introduced new uniforms that don't fit me", "created_utc": 1492144743.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65alf3", "likes": null, "replies": "", "user_reports": [], "id": "dg8ziy4", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "HopesAsh123", "parent_id": "t3_65alf3", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "All you can do is bring it up. Say hey this is the smallest it comes and I feel ridiculous with it being so big. Suggest wearing a look a like. Don't freak out about it. The worst thing that can happen is your boss totally disregards it. Then you just be in the same position you were before. Seriously tell yourself you deserve to say something if something is bothering you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All you can do is bring it up. Say hey this is the smallest it comes and I feel ridiculous with it being so big. Suggest wearing a look a like. Don&amp;#39;t freak out about it. The worst thing that can happen is your boss totally disregards it. Then you just be in the same position you were before. Seriously tell yourself you deserve to say something if something is bothering you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg8ziy4", "score_hidden": false, "stickied": false, "created": 1492194157.0, "created_utc": 1492165357.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65alf3", "likes": null, "replies": "", "user_reports": [], "id": "dg9f8zu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BootyBeyond", "parent_id": "t3_65alf3", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Talk to him. Mention how unprofessional it looks. Make sure you're wearing the shirt when you do this, so he sees it (bring a spare that fits obviously). Mention your experience with the tailor. Even working at Dominos, my managers and the owner would not have been okay with something that ridiculous looking and would agree to an alternative.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to him. Mention how unprofessional it looks. Make sure you&amp;#39;re wearing the shirt when you do this, so he sees it (bring a spare that fits obviously). Mention your experience with the tailor. Even working at Dominos, my managers and the owner would not have been okay with something that ridiculous looking and would agree to an alternative.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg9f8zu", "score_hidden": false, "stickied": false, "created": 1492218585.0, "created_utc": 1492189785.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65alf3", "likes": null, "replies": "", "user_reports": [], "id": "dg9jbl1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hibria", "parent_id": "t3_65alf3", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Maybe ask if you can slap the patches on your shirt? Idk", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe ask if you can slap the patches on your shirt? Idk&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg9jbl1", "score_hidden": false, "stickied": false, "created": 1492223338.0, "created_utc": 1492194538.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]