[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Right now is not a good time for me.\nRight now I am crying. \nRight now I am sobbing in bed while wrapping my arms around the biggest toy I have. \nRight now my arms are grasping for the little childhood I have left because I&amp;#39;m growing up and I only just now realised that my favourite toy hasn&amp;#39;t been in my room for a really long time.\nRight now my bottom lip is growing because I so badly want to not grow up\nRight now I am a teenager about to go into the most important year of her life and I couldn&amp;#39;t be less prepared.\nRight now I&amp;#39;m worried that I haven&amp;#39;t made the right decisions in my life and those choices that I have made will mean that I am going to be in a job that I don&amp;#39;t like while living a life that I don&amp;#39;t want to live.\nRight now I am having a panic attack.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Right now is not a good time for me.\nRight now I am crying. \nRight now I am sobbing in bed while wrapping my arms around the biggest toy I have. \nRight now my arms are grasping for the little childhood I have left because I'm growing up and I only just now realised that my favourite toy hasn't been in my room for a really long time.\nRight now my bottom lip is growing because I so badly want to not grow up\nRight now I am a teenager about to go into the most important year of her life and I couldn't be less prepared.\nRight now I'm worried that I haven't made the right decisions in my life and those choices that I have made will mean that I am going to be in a job that I don't like while living a life that I don't want to live.\nRight now I am having a panic attack.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65d3mi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "HowImFeelin", "saved": false, "mod_reports": [], "name": "t3_65d3mi", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/65d3mi/right_now/", "num_reports": null, "locked": false, "stickied": false, "created": 1492211795.0, "url": "https://www.reddit.com/r/Anxiety/comments/65d3mi/right_now/", "author_flair_text": null, "quarantine": false, "title": "Right now", "created_utc": 1492182995.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65d3mi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65d3mi", "likes": null, "replies": "", "user_reports": [], "id": "dg9ul67", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "duchessofsephora", "parent_id": "t1_dg9dxkw", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I agree about the most important year of your life thing. I would have probably thought Senior year was most important. now I'm 40 and that year probably isn't in my top 10. OP there's no one decision that will derail your life for good. I recommend some deep breathing exercises. The Stop, Think, Breathe app is wonderful for these situations.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree about the most important year of your life thing. I would have probably thought Senior year was most important. now I&amp;#39;m 40 and that year probably isn&amp;#39;t in my top 10. OP there&amp;#39;s no one decision that will derail your life for good. I recommend some deep breathing exercises. The Stop, Think, Breathe app is wonderful for these situations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg9ul67", "score_hidden": false, "stickied": false, "created": 1492237234.0, "created_utc": 1492208434.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dxkw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Porfinlohice", "parent_id": "t3_65d3mi", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "If it helps there's not such thing as \"the most important year of your life\". There's good years and bad years but that's only relevant to yourself. You could attend your dream college (like I did) study your dream mayor (like I did) and land a job in a firm you always liked  (like I did) and yet, that doesn't guarantees you'll be happy. I know I wasn't.\n\nEmbrace the changes of life, wield your decisions and choices like a sword and own your mistakes. Be proud of who you are, it doesn't matter if the boat goes off course for a couple years, we are not here to reach anything, we are here to enjoy the ride :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it helps there&amp;#39;s not such thing as &amp;quot;the most important year of your life&amp;quot;. There&amp;#39;s good years and bad years but that&amp;#39;s only relevant to yourself. You could attend your dream college (like I did) study your dream mayor (like I did) and land a job in a firm you always liked  (like I did) and yet, that doesn&amp;#39;t guarantees you&amp;#39;ll be happy. I know I wasn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;Embrace the changes of life, wield your decisions and choices like a sword and own your mistakes. Be proud of who you are, it doesn&amp;#39;t matter if the boat goes off course for a couple years, we are not here to reach anything, we are here to enjoy the ride :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg9dxkw", "score_hidden": false, "stickied": false, "created": 1492217092.0, "created_utc": 1492188292.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65d3mi", "likes": null, "replies": "", "user_reports": [], "id": "dga1jrg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Yiskra", "parent_id": "t3_65d3mi", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I'm guessing you mean going into senior year? Just to share.. that's not the most important year of your life. It might seem like it now but I promise you it'll be trumped easily by things like college graduation, having a child, getting married, getting a pet, buying a home or car etc. It's mostly just a winding road where you hit some high points and some pot holes.  So it seems big and impossible but will be a blip on the map within years.\n\nAnother secret: growing up is 100% optional. Growing older is kinda mandatory. I haven't figured out a way out of that one yet (for me or my kids). I still have stuffed animals, like cartoons, play plenty of games both computer based and sports. I mean I have a job I have to work it all around and include my family in it.. But if anything I do MORE of what I love now and no one tells me no because I work to finance it. There are perks to it.\n\nWhat makes you think you'll work a job you hate or live a life you hate, my friend? You have your entire life for every do-over you can imagine. It's a reality that we don't always get it right the first time. New starts are a real thing. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m guessing you mean going into senior year? Just to share.. that&amp;#39;s not the most important year of your life. It might seem like it now but I promise you it&amp;#39;ll be trumped easily by things like college graduation, having a child, getting married, getting a pet, buying a home or car etc. It&amp;#39;s mostly just a winding road where you hit some high points and some pot holes.  So it seems big and impossible but will be a blip on the map within years.&lt;/p&gt;\n\n&lt;p&gt;Another secret: growing up is 100% optional. Growing older is kinda mandatory. I haven&amp;#39;t figured out a way out of that one yet (for me or my kids). I still have stuffed animals, like cartoons, play plenty of games both computer based and sports. I mean I have a job I have to work it all around and include my family in it.. But if anything I do MORE of what I love now and no one tells me no because I work to finance it. There are perks to it.&lt;/p&gt;\n\n&lt;p&gt;What makes you think you&amp;#39;ll work a job you hate or live a life you hate, my friend? You have your entire life for every do-over you can imagine. It&amp;#39;s a reality that we don&amp;#39;t always get it right the first time. New starts are a real thing. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dga1jrg", "score_hidden": false, "stickied": false, "created": 1492246513.0, "created_utc": 1492217713.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65d3mi", "likes": null, "replies": "", "user_reports": [], "id": "dg9db3e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Red-handed-anxiety", "parent_id": "t3_65d3mi", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Here for you. I know it probably won't help much, but just breathe deep. You got this. \n\nThings will work out. The day I got rejected from my dream college. I thought I was worthless. Now I am working in my dream job, and the college I went to was perfect for me. \n\nSending support through the internet", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here for you. I know it probably won&amp;#39;t help much, but just breathe deep. You got this. &lt;/p&gt;\n\n&lt;p&gt;Things will work out. The day I got rejected from my dream college. I thought I was worthless. Now I am working in my dream job, and the college I went to was perfect for me. &lt;/p&gt;\n\n&lt;p&gt;Sending support through the internet&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg9db3e", "score_hidden": false, "stickied": false, "created": 1492216386.0, "created_utc": 1492187586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65d3mi", "likes": null, "replies": "", "user_reports": [], "id": "dg9ehdf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RickySpanish06", "parent_id": "t3_65d3mi", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Things get better with time, life is full of ups and downs. When I was 15 I was living with my abusive meth addicted father, my mother overdosed when I was 6. I couldn't see myself 18-19 years old. I started doing drugs as well to try to cope, I was later diagnosed with PTSD and chronic depression. Fast forward five years and I'm 20 years old living with my girlfriend. Still dealing with the PTSD/depression/anxiety but it's a work in progress and I've came a long way since I was 15. Things will get better, trust me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Things get better with time, life is full of ups and downs. When I was 15 I was living with my abusive meth addicted father, my mother overdosed when I was 6. I couldn&amp;#39;t see myself 18-19 years old. I started doing drugs as well to try to cope, I was later diagnosed with PTSD and chronic depression. Fast forward five years and I&amp;#39;m 20 years old living with my girlfriend. Still dealing with the PTSD/depression/anxiety but it&amp;#39;s a work in progress and I&amp;#39;ve came a long way since I was 15. Things will get better, trust me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg9ehdf", "score_hidden": false, "stickied": false, "created": 1492217712.0, "created_utc": 1492188912.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65d3mi", "likes": null, "replies": "", "user_reports": [], "id": "dg9hj22", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mewtwoVchucknorris", "parent_id": "t3_65d3mi", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "This is a very confusing, stressful time. For sure. Its absurd that our culture forces people to make such important decisions as a teen. I know it's hard. I've been there too. So many options, how are you supposed to decide on just one? I feel ya. \n\nThe good news is, you have this sub. We get it :).\n\nAlso because you are young, you have plenty of time to try things out and learn what you do and don't like! The work force now looks a lot different than it did 40-50 years ago. The average person makes 2 or 3 MAJOR career changes. So it's ok if you take a job, try it for a bit, then decide to look for something else. There's no rule anywhere saying you can't :).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a very confusing, stressful time. For sure. Its absurd that our culture forces people to make such important decisions as a teen. I know it&amp;#39;s hard. I&amp;#39;ve been there too. So many options, how are you supposed to decide on just one? I feel ya. &lt;/p&gt;\n\n&lt;p&gt;The good news is, you have this sub. We get it :).&lt;/p&gt;\n\n&lt;p&gt;Also because you are young, you have plenty of time to try things out and learn what you do and don&amp;#39;t like! The work force now looks a lot different than it did 40-50 years ago. The average person makes 2 or 3 MAJOR career changes. So it&amp;#39;s ok if you take a job, try it for a bit, then decide to look for something else. There&amp;#39;s no rule anywhere saying you can&amp;#39;t :).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg9hj22", "score_hidden": false, "stickied": false, "created": 1492221224.0, "created_utc": 1492192424.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65d3mi", "likes": null, "replies": "", "user_reports": [], "id": "dg9ui4k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "duchessofsephora", "parent_id": "t3_65d3mi", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I'm so sorry you are scared. As a mother I feel these things about my children. My son feels the same as you and he often cries about growing up. The fact that you care so much about your choices is very telling to me. It tells me that you will think about things and weigh them out. Listen to me when I tell you that you do not have to go do a job you don't like. Life is too short to do that. Make yourself happy and successes will follow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry you are scared. As a mother I feel these things about my children. My son feels the same as you and he often cries about growing up. The fact that you care so much about your choices is very telling to me. It tells me that you will think about things and weigh them out. Listen to me when I tell you that you do not have to go do a job you don&amp;#39;t like. Life is too short to do that. Make yourself happy and successes will follow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dg9ui4k", "score_hidden": false, "stickied": false, "created": 1492237125.0, "created_utc": 1492208325.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]