[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It all started with a simple argument with my brother. I forget exactly what it was about, but whatever it was, it was trivial. I&amp;#39;ve always been a hothead, but I don&amp;#39;t like fighting over things.&lt;/p&gt;\n\n&lt;p&gt;The argument went on and he kept remarking on my fear of crowded public spaces, which just hit me HARD. I don&amp;#39;t know why or what caused this, but I just immediately began realizing all the mistakes I&amp;#39;ve ever made, and flaws I&amp;#39;ve ever had. &lt;/p&gt;\n\n&lt;p&gt;I just left and started bawling my eyes out in the bathroom. I&amp;#39;m a generally big guy, and people tend to think I&amp;#39;m relatively tough, but I just broke. For an hour I just sat on the side of the tub crying and beating my head.&lt;/p&gt;\n\n&lt;p&gt;I go to a therapist for stress and anxiety (which has helped a bit), but this just crept up on me. &lt;/p&gt;\n\n&lt;p&gt;So far about 4 hours has passed and I didn&amp;#39;t feel safe saying this anywhere but here. I don&amp;#39;t know what&amp;#39;s going through my head; I hate myself for starting fights with people I care about right now. &lt;/p&gt;\n\n&lt;p&gt;Any information or support is appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It all started with a simple argument with my brother. I forget exactly what it was about, but whatever it was, it was trivial. I've always been a hothead, but I don't like fighting over things.\n\nThe argument went on and he kept remarking on my fear of crowded public spaces, which just hit me HARD. I don't know why or what caused this, but I just immediately began realizing all the mistakes I've ever made, and flaws I've ever had. \n\nI just left and started bawling my eyes out in the bathroom. I'm a generally big guy, and people tend to think I'm relatively tough, but I just broke. For an hour I just sat on the side of the tub crying and beating my head.\n\nI go to a therapist for stress and anxiety (which has helped a bit), but this just crept up on me. \n\nSo far about 4 hours has passed and I didn't feel safe saying this anywhere but here. I don't know what's going through my head; I hate myself for starting fights with people I care about right now. \n\nAny information or support is appreciated.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65htwq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "starfoxer117", "saved": false, "mod_reports": [], "name": "t3_65htwq", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/65htwq/i_just_had_the_worst_emotional_breakdown_ive_ever/", "num_reports": null, "locked": false, "stickied": false, "created": 1492267861.0, "url": "https://www.reddit.com/r/Anxiety/comments/65htwq/i_just_had_the_worst_emotional_breakdown_ive_ever/", "author_flair_text": null, "quarantine": false, "title": "I just had the worst emotional breakdown I've ever experienced and I don't know how to react", "created_utc": 1492239061.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65htwq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65htwq", "likes": null, "replies": "", "user_reports": [], "id": "dgb4kge", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "starfoxer117", "parent_id": "t1_dgahk8j", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "It isn't just anxiety. A few weeks ago, one of my friends died after a long battle with cancer. I guess it may have contributed to my stress recently, but I thought the hardest part was over.\n\nAnd thank you for the kind words", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It isn&amp;#39;t just anxiety. A few weeks ago, one of my friends died after a long battle with cancer. I guess it may have contributed to my stress recently, but I thought the hardest part was over.&lt;/p&gt;\n\n&lt;p&gt;And thank you for the kind words&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgb4kge", "score_hidden": false, "stickied": false, "created": 1492316759.0, "created_utc": 1492287959.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgahk8j", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Kaznox", "parent_id": "t3_65htwq", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Hey man. I've been in your situation before. It sucks, it really does. A lot of the time people don't understand what we go through mentally so our arguments may sound a little aggressive which may aggravate people. In my opinion, the best option is to explain to your friends/family your condition to help them understand otherwise it would be very hard to express your frustrations making more arguments.\n\nIf you need anyone to talk to, I'm all ears.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man. I&amp;#39;ve been in your situation before. It sucks, it really does. A lot of the time people don&amp;#39;t understand what we go through mentally so our arguments may sound a little aggressive which may aggravate people. In my opinion, the best option is to explain to your friends/family your condition to help them understand otherwise it would be very hard to express your frustrations making more arguments.&lt;/p&gt;\n\n&lt;p&gt;If you need anyone to talk to, I&amp;#39;m all ears.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgahk8j", "score_hidden": false, "stickied": false, "created": 1492277110.0, "created_utc": 1492248310.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65htwq", "likes": null, "replies": "", "user_reports": [], "id": "dgajfi8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "idontmeanmuchnomoar", "parent_id": "t3_65htwq", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "A little voice in the back of my head is saying, \"Been holding a lot of dufferent shit 'in' lately?\" Sometimes just one smallish push or nudge on a particular button, stp, and then VAAAVOOM!! it's like a dam [damn dam? &lt;trying to cheer you up a little w/a crummy pun, or even a punny crumb?&gt; let's loose.....\n(((((((Polite hugs))))))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A little voice in the back of my head is saying, &amp;quot;Been holding a lot of dufferent shit &amp;#39;in&amp;#39; lately?&amp;quot; Sometimes just one smallish push or nudge on a particular button, stp, and then VAAAVOOM!! it&amp;#39;s like a dam [damn dam? &amp;lt;trying to cheer you up a little w/a crummy pun, or even a punny crumb?&amp;gt; let&amp;#39;s loose.....\n(((((((Polite hugs))))))&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgajfi8", "score_hidden": false, "stickied": false, "created": 1492283070.0, "created_utc": 1492254270.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65htwq", "likes": null, "replies": "", "user_reports": [], "id": "dgaslm1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kajjaznam1", "parent_id": "t3_65htwq", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I was a couple of times in that situation. I'm from Croatia and we here are often very direct and aggressive. One of my siblings is a 6 years younger brother and in a couple of situation (one of them is after he lost in monopoly, oh the irony the life feeds me with xD) he said that i'm a nobody, that i achieved nothing and the therapy i'm going to and things i'm doing after the nervous breakdown lead to nothing. I didn't say much and mustered to try to joke and laught it out. Actually it shocked me really badly, i was totally lost, didn't know what to think or how to feel about it. He is my brother, of course i love him, i don't want him any harm, why is he doing that to me? With time i came across a philosophy that helped me. I'm aware that the more time you spend with someone, the more he becomes a bigger part of you. You share similar beliefs, thoughts and behaviours. I know some things about him and with time i saw the similarities in each other. He is definitely very lost and scared too, he is angry at himself, maybe for not being able to help me or anyone else, feeling weak, not smart enough or not handsome enough. He has his fears too but is unable to see them for what they are and where they are coming from. He doesn't mean any harm, he just doesn't know better. I have a huge support system, i know a lot of people. Two years ago i started telling people, those that i trust more, about my state. Now, about 15-20 know about my problems and every person is very supportive and nice, people understand. We all feel this, every human knows what heart break, grief or shame feels like. The crippling feeling that says you can't do nothing to fight for what means the most to you. It seems people who actually have a diagnosed anxiety disorder are just more aware of that, maybe it means more to them, to have company in their life is what makes living worthy to them. I'm actually talking about myself but i hope someone will understand what i'm trying to say. Cheers and everything is the way it should be, just hang in there and keep going! \n\nEDIT: What i wanted to say is that it's easier for your brother to lash out on you, the one who is very close and similar to him then to verbalize his feelings and thoughts that make him feel vulnerable and weak. ", "edited": 1492272342.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was a couple of times in that situation. I&amp;#39;m from Croatia and we here are often very direct and aggressive. One of my siblings is a 6 years younger brother and in a couple of situation (one of them is after he lost in monopoly, oh the irony the life feeds me with xD) he said that i&amp;#39;m a nobody, that i achieved nothing and the therapy i&amp;#39;m going to and things i&amp;#39;m doing after the nervous breakdown lead to nothing. I didn&amp;#39;t say much and mustered to try to joke and laught it out. Actually it shocked me really badly, i was totally lost, didn&amp;#39;t know what to think or how to feel about it. He is my brother, of course i love him, i don&amp;#39;t want him any harm, why is he doing that to me? With time i came across a philosophy that helped me. I&amp;#39;m aware that the more time you spend with someone, the more he becomes a bigger part of you. You share similar beliefs, thoughts and behaviours. I know some things about him and with time i saw the similarities in each other. He is definitely very lost and scared too, he is angry at himself, maybe for not being able to help me or anyone else, feeling weak, not smart enough or not handsome enough. He has his fears too but is unable to see them for what they are and where they are coming from. He doesn&amp;#39;t mean any harm, he just doesn&amp;#39;t know better. I have a huge support system, i know a lot of people. Two years ago i started telling people, those that i trust more, about my state. Now, about 15-20 know about my problems and every person is very supportive and nice, people understand. We all feel this, every human knows what heart break, grief or shame feels like. The crippling feeling that says you can&amp;#39;t do nothing to fight for what means the most to you. It seems people who actually have a diagnosed anxiety disorder are just more aware of that, maybe it means more to them, to have company in their life is what makes living worthy to them. I&amp;#39;m actually talking about myself but i hope someone will understand what i&amp;#39;m trying to say. Cheers and everything is the way it should be, just hang in there and keep going! &lt;/p&gt;\n\n&lt;p&gt;EDIT: What i wanted to say is that it&amp;#39;s easier for your brother to lash out on you, the one who is very close and similar to him then to verbalize his feelings and thoughts that make him feel vulnerable and weak. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgaslm1", "score_hidden": false, "stickied": false, "created": 1492300408.0, "created_utc": 1492271608.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65htwq", "likes": null, "replies": "", "user_reports": [], "id": "dgagrbg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pandapicnic", "parent_id": "t3_65htwq", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Hi, I'm new to this forum. I go to a psychiatrist and a therapist for anxiety and panic disorder. I'm not very qualified to give advice, but I can offer you support &lt;3 And I hope that's enough to make you feel even a little better. I wanted to tell you you're doing great. You're seeing a therapist, so you've acknowledged these problems and are actively doing something about them.\n\nI don't think your brother understands the impact of his words, as most people who don't go through this can't imagine what it's like. But I know that him commenting on it can feel like a huge blow and critique of a quality you didn't ask for. Don't be hard on yourself about having anxiety and definitely don't hate yourself for being human. I argue so often with my parents, who have supported me more than anyone else. This just means we have to continuously work at improving ourselves, and that can mean something different for you. For me it means becoming healthier (physically, emotionally, mentally), more empathetic, and more patient. Every day you work at bettering yourself, you're moving forward.\n\nTry to apply the techniques for coping with stress that you've learned in therapy, but also don't get angry at yourself when you have a setback. You don't deserve to be treated like that by anyone, including yourself. Be patient with yourself, the way you would be patient with a best friend going through something similar. Apply that kindness and understanding you have for other people to yourself. Having anxiety does not detract from all your good qualities and it doesn't define you. When you're ready, I hope that you're able to talk to your brother or a close friend, or you can always PM me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I&amp;#39;m new to this forum. I go to a psychiatrist and a therapist for anxiety and panic disorder. I&amp;#39;m not very qualified to give advice, but I can offer you support &amp;lt;3 And I hope that&amp;#39;s enough to make you feel even a little better. I wanted to tell you you&amp;#39;re doing great. You&amp;#39;re seeing a therapist, so you&amp;#39;ve acknowledged these problems and are actively doing something about them.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think your brother understands the impact of his words, as most people who don&amp;#39;t go through this can&amp;#39;t imagine what it&amp;#39;s like. But I know that him commenting on it can feel like a huge blow and critique of a quality you didn&amp;#39;t ask for. Don&amp;#39;t be hard on yourself about having anxiety and definitely don&amp;#39;t hate yourself for being human. I argue so often with my parents, who have supported me more than anyone else. This just means we have to continuously work at improving ourselves, and that can mean something different for you. For me it means becoming healthier (physically, emotionally, mentally), more empathetic, and more patient. Every day you work at bettering yourself, you&amp;#39;re moving forward.&lt;/p&gt;\n\n&lt;p&gt;Try to apply the techniques for coping with stress that you&amp;#39;ve learned in therapy, but also don&amp;#39;t get angry at yourself when you have a setback. You don&amp;#39;t deserve to be treated like that by anyone, including yourself. Be patient with yourself, the way you would be patient with a best friend going through something similar. Apply that kindness and understanding you have for other people to yourself. Having anxiety does not detract from all your good qualities and it doesn&amp;#39;t define you. When you&amp;#39;re ready, I hope that you&amp;#39;re able to talk to your brother or a close friend, or you can always PM me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgagrbg", "score_hidden": false, "stickied": false, "created": 1492274558.0, "created_utc": 1492245758.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]