[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been with my boyfriend for about a year or so. We&amp;#39;ve had a pretty great thing going on. However, the more he gets to know me, the more he gets to know about my anxiety as well. I tend to ask people for reassurance, not constantly but also not seldomly. Since he is one of the few people I trust AND see on a daily basis, that burden usually falls on him. He usually pretty good about just saying that I&amp;#39;m okay or whatnot, but recently I think he lost his patience with me. &lt;/p&gt;\n\n&lt;p&gt;A few days ago, he told me that he just needs a break since he feels emotionally exhausted and that he simply isn&amp;#39;t helping with my problems. He said that I should get help, but not from him. I understand that. I really do. I know that I had been using my cycle of reassurance in a way that was making him feel overwhelmed. I&amp;#39;m just afraid that I may have gone too far and I&amp;#39;m going to lose him for good. This is our first major argument per say, and I like to think that we can get through this. &lt;/p&gt;\n\n&lt;p&gt;Since the time he told me this, I have reached out to other friends and even booked an appointment with a councilor. However, my anxieties that had brought about his frustration (my worries about grades, pregnancy, sickness especially vomiting) have not been the cause of my breakdowns as of late. I&amp;#39;ve just been really scared that he&amp;#39;ll leave me for something like this, something I think we can talk out. He keeps telling me that &amp;quot;this isn&amp;#39;t healthy&amp;quot; and that he just &amp;quot;needs some time&amp;quot; but at the same time he doesn&amp;#39;t really want to talk about it at the moment. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tried messaging him while we are on this break, about how I want to fix things and such. He just seems really reluctant, or maybe he&amp;#39;s just trying to give himself some space right now, I don&amp;#39;t know. When I asked him how long the break will be, he simply replied with &amp;quot;I don&amp;#39;t know,&amp;quot; to which I told him that he needs to treat this break seriously and come up with a day where we can just discuss things, emotions aside. &lt;/p&gt;\n\n&lt;p&gt;I know he wants me to get help. I know I want me to get help. I got help from others, and he said he&amp;#39;s glad, but he also just needs space. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve just been constantly torn by wanting to give him space, being worried he hates me now, and wanting desparately to talk about it. I know he wants space, but I can&amp;#39;t help but think it&amp;#39;s better if we just discuss things now to fix it. Does anyone have any advice? Thanks in advance. &lt;/p&gt;\n\n&lt;p&gt;EDIT: Just had added a few sentences.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been with my boyfriend for about a year or so. We've had a pretty great thing going on. However, the more he gets to know me, the more he gets to know about my anxiety as well. I tend to ask people for reassurance, not constantly but also not seldomly. Since he is one of the few people I trust AND see on a daily basis, that burden usually falls on him. He usually pretty good about just saying that I'm okay or whatnot, but recently I think he lost his patience with me. \n\nA few days ago, he told me that he just needs a break since he feels emotionally exhausted and that he simply isn't helping with my problems. He said that I should get help, but not from him. I understand that. I really do. I know that I had been using my cycle of reassurance in a way that was making him feel overwhelmed. I'm just afraid that I may have gone too far and I'm going to lose him for good. This is our first major argument per say, and I like to think that we can get through this. \n\nSince the time he told me this, I have reached out to other friends and even booked an appointment with a councilor. However, my anxieties that had brought about his frustration (my worries about grades, pregnancy, sickness especially vomiting) have not been the cause of my breakdowns as of late. I've just been really scared that he'll leave me for something like this, something I think we can talk out. He keeps telling me that \"this isn't healthy\" and that he just \"needs some time\" but at the same time he doesn't really want to talk about it at the moment. \n\nI've tried messaging him while we are on this break, about how I want to fix things and such. He just seems really reluctant, or maybe he's just trying to give himself some space right now, I don't know. When I asked him how long the break will be, he simply replied with \"I don't know,\" to which I told him that he needs to treat this break seriously and come up with a day where we can just discuss things, emotions aside. \n\nI know he wants me to get help. I know I want me to get help. I got help from others, and he said he's glad, but he also just needs space. \n\n I've just been constantly torn by wanting to give him space, being worried he hates me now, and wanting desparately to talk about it. I know he wants space, but I can't help but think it's better if we just discuss things now to fix it. Does anyone have any advice? Thanks in advance. \n\nEDIT: Just had added a few sentences.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "65jcxn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "greenleavesontrees", "saved": false, "mod_reports": [], "name": "t3_65jcxn", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": "relationshipflair", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/65jcxn/boyfriend_wants_to_take_a_break_because_of_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492295707.0, "url": "https://www.reddit.com/r/Anxiety/comments/65jcxn/boyfriend_wants_to_take_a_break_because_of_my/", "author_flair_text": null, "quarantine": false, "title": "Boyfriend Wants to Take a break because of my anxiety", "created_utc": 1492266907.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": "", "user_reports": [], "id": "dgb8y5a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "greenleavesontrees", "parent_id": "t1_dgav160", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Thanks for the advice-- I get pretty impatient and impulsive as well. I just hope that he decides to give this another shot, because I am willing to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the advice-- I get pretty impatient and impulsive as well. I just hope that he decides to give this another shot, because I am willing to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgb8y5a", "score_hidden": false, "stickied": false, "created": 1492322796.0, "created_utc": 1492293996.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgav160", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "loud_cricket", "parent_id": "t1_dgauggy", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "He will let you know how he feels eventually. He is overwhelmed and needs time to process. It's possible that he will want to try to fix things, but it's also possible that he won't. You should start preparing yourself for that possibility. Being in a relationship with someone who has so much anxiety can be really taxing, and it's not something that he may be willing or able to do right now. \n\nGo watch a movie, take a walk, or run some errands. Anything to take your mind off this. I know that my anxiety tends to make me really impatient and impulsive, and it's hard for me when something like this happens. I know it will be hard to distract yourself, but it's really all you can do while he is trying to work through this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He will let you know how he feels eventually. He is overwhelmed and needs time to process. It&amp;#39;s possible that he will want to try to fix things, but it&amp;#39;s also possible that he won&amp;#39;t. You should start preparing yourself for that possibility. Being in a relationship with someone who has so much anxiety can be really taxing, and it&amp;#39;s not something that he may be willing or able to do right now. &lt;/p&gt;\n\n&lt;p&gt;Go watch a movie, take a walk, or run some errands. Anything to take your mind off this. I know that my anxiety tends to make me really impatient and impulsive, and it&amp;#39;s hard for me when something like this happens. I know it will be hard to distract yourself, but it&amp;#39;s really all you can do while he is trying to work through this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgav160", "score_hidden": false, "stickied": false, "created": 1492303817.0, "created_utc": 1492275017.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgauggy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greenleavesontrees", "parent_id": "t1_dgarsio", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Yeah, you're right. I sent him the message and he just told me that he just wants time to think. He didn't really respond to my question about if he wants to fix this or not, or if he still loves me, but I imagine he just wants space and he'll answer those questions when he is ready. Thank you for your response. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, you&amp;#39;re right. I sent him the message and he just told me that he just wants time to think. He didn&amp;#39;t really respond to my question about if he wants to fix this or not, or if he still loves me, but I imagine he just wants space and he&amp;#39;ll answer those questions when he is ready. Thank you for your response. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgauggy", "score_hidden": false, "stickied": false, "created": 1492303000.0, "created_utc": 1492274200.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgarsio", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "loud_cricket", "parent_id": "t3_65jcxn", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "You need to give him space, because he is telling you that is what he needs right now. If you love him, you must give him what he is telling you he needs.\n\nI suggest that you send him one last message, telling him that in addition to the counseling you will be getting individually, you would really like to try couples counseling when he's ready to be part of your life again. Let him know that you love him, this relationship is important to you, you realize how hard it has been for him to deal with your anxiety, and that you really want to work on your relationship in a counseling setting so that you can both figure out how to give each other what you need.\n\nAnd then, as hard as it will be,  you need to leave him alone until he can handle being part of your life again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to give him space, because he is telling you that is what he needs right now. If you love him, you must give him what he is telling you he needs.&lt;/p&gt;\n\n&lt;p&gt;I suggest that you send him one last message, telling him that in addition to the counseling you will be getting individually, you would really like to try couples counseling when he&amp;#39;s ready to be part of your life again. Let him know that you love him, this relationship is important to you, you realize how hard it has been for him to deal with your anxiety, and that you really want to work on your relationship in a counseling setting so that you can both figure out how to give each other what you need.&lt;/p&gt;\n\n&lt;p&gt;And then, as hard as it will be,  you need to leave him alone until he can handle being part of your life again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgarsio", "score_hidden": false, "stickied": false, "created": 1492299268.0, "created_utc": 1492270468.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": "", "user_reports": [], "id": "dgaye95", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ansible411", "parent_id": "t1_dgaprno", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I know you want it to work but he may feel smothered. Work on yourself and if you two get back together, great! If not you'll still be okay, move on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know you want it to work but he may feel smothered. Work on yourself and if you two get back together, great! If not you&amp;#39;ll still be okay, move on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgaye95", "score_hidden": false, "stickied": false, "created": 1492308384.0, "created_utc": 1492279584.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": "", "user_reports": [], "id": "dgb8w2r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "greenleavesontrees", "parent_id": "t1_dgb5jgi", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I'll wait a few says and see how it goes. Thank you :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll wait a few says and see how it goes. Thank you :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgb8w2r", "score_hidden": false, "stickied": false, "created": 1492322716.0, "created_utc": 1492293916.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5jgi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yugogrl2000", "parent_id": "t1_dgaprno", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "It is hard to say. I'd kinda guage his reactions and such. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is hard to say. I&amp;#39;d kinda guage his reactions and such. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgb5jgi", "score_hidden": false, "stickied": false, "created": 1492318072.0, "created_utc": 1492289272.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaprno", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greenleavesontrees", "parent_id": "t1_dgapmx9", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Thank you for a response, and I appreciate your kind words very much. I honestly had a pretty bad episode last night, where I started missing him a lot and began messaging him about how much I want to fix this and etc. In the morning I felt calmer so I sent him a more put-together message about how I want to just discuss with him what we've learned during our break. \n\nConsidering this situation, how long do you think a break should be?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for a response, and I appreciate your kind words very much. I honestly had a pretty bad episode last night, where I started missing him a lot and began messaging him about how much I want to fix this and etc. In the morning I felt calmer so I sent him a more put-together message about how I want to just discuss with him what we&amp;#39;ve learned during our break. &lt;/p&gt;\n\n&lt;p&gt;Considering this situation, how long do you think a break should be?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgaprno", "score_hidden": false, "stickied": false, "created": 1492296316.0, "created_utc": 1492267516.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgapmx9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "yugogrl2000", "parent_id": "t3_65jcxn", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "First let me say I understand. My husband has to bear the burden of my anxiety, and I feel bad about that. \nSecond, I want to say GOOD JOB on being quick to make progress (getting an appointment and such). It is possible that if he truly loves you and sees you are working on yourself, he will be willing to try again. It would be different if you just decided to throw a pity party and not be proactive, but you are taking steps forward. If it was me in your situation, I'd simply let him know you the steps you are taking and tell him that you care a lot about the relationship, and leave it at that. Don't smother him. He should come around if the relationship is truly important to him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First let me say I understand. My husband has to bear the burden of my anxiety, and I feel bad about that. \nSecond, I want to say GOOD JOB on being quick to make progress (getting an appointment and such). It is possible that if he truly loves you and sees you are working on yourself, he will be willing to try again. It would be different if you just decided to throw a pity party and not be proactive, but you are taking steps forward. If it was me in your situation, I&amp;#39;d simply let him know you the steps you are taking and tell him that you care a lot about the relationship, and leave it at that. Don&amp;#39;t smother him. He should come around if the relationship is truly important to him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgapmx9", "score_hidden": false, "stickied": false, "created": 1492296121.0, "created_utc": 1492267321.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": "", "user_reports": [], "id": "dgb9lmn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greenleavesontrees", "parent_id": "t1_dgav00y", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Thank you. You explained it all in a very good way. It is hard to not talk to him, and I do wish he'd come around soon, but you're right. It's important for him to heal from me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. You explained it all in a very good way. It is hard to not talk to him, and I do wish he&amp;#39;d come around soon, but you&amp;#39;re right. It&amp;#39;s important for him to heal from me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgb9lmn", "score_hidden": false, "stickied": false, "created": 1492323715.0, "created_utc": 1492294915.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": "", "user_reports": [], "id": "dgbo3qx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greenleavesontrees", "parent_id": "t1_dgbmd42", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Don't be sorry-- I understand what you're saying and I appreciate what advice you have given me. \n\nI did sign up for counselling, and I've been trying to self reflect on what I want out of this break as well. \n\nThank you again, I'll be sure to follow up on this when the time comes. I really appreciate this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t be sorry-- I understand what you&amp;#39;re saying and I appreciate what advice you have given me. &lt;/p&gt;\n\n&lt;p&gt;I did sign up for counselling, and I&amp;#39;ve been trying to self reflect on what I want out of this break as well. &lt;/p&gt;\n\n&lt;p&gt;Thank you again, I&amp;#39;ll be sure to follow up on this when the time comes. I really appreciate this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbo3qx", "score_hidden": false, "stickied": false, "created": 1492345042.0, "created_utc": 1492316242.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbmd42", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "prysmyr", "parent_id": "t1_dgb9pkf", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "No, that wouldn't be okay. He wants a break, and even though you aren't speaking to him when you send those things, it's still violating his wish for space. \n\nI'm sorry but you're really going to have to wait this out. I know that it's hard and it hurts.\n\nRemember what he said, that you should get help but not from him? To show that you take him seriously, try doing that. Seek out and follow through with counselling. Try some coping methods that you can do as an individual, not depending on other people. Perhaps medication (easy to get, a quick painless trip to the doctor, explain symptoms of anxiety, then they will suggest and prescribe something) will help, though I say this assuming you're not on anxiety medication currently. If you don't take his suggestion seriously and you don't try to help yourself somehow, then it's possible he will feel like you are just waiting on him to return so that you can use him to pacify you once more.\n\nAlso, don't update him on anything unless he specifically asks about it. If you start therapy, medicine, or try coping skills, don't tell him unless he asks, or unless he says that he is ready to speak with you. Again it is about respecting his boundary that he set in wanting a break and to be left alone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, that wouldn&amp;#39;t be okay. He wants a break, and even though you aren&amp;#39;t speaking to him when you send those things, it&amp;#39;s still violating his wish for space. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry but you&amp;#39;re really going to have to wait this out. I know that it&amp;#39;s hard and it hurts.&lt;/p&gt;\n\n&lt;p&gt;Remember what he said, that you should get help but not from him? To show that you take him seriously, try doing that. Seek out and follow through with counselling. Try some coping methods that you can do as an individual, not depending on other people. Perhaps medication (easy to get, a quick painless trip to the doctor, explain symptoms of anxiety, then they will suggest and prescribe something) will help, though I say this assuming you&amp;#39;re not on anxiety medication currently. If you don&amp;#39;t take his suggestion seriously and you don&amp;#39;t try to help yourself somehow, then it&amp;#39;s possible he will feel like you are just waiting on him to return so that you can use him to pacify you once more.&lt;/p&gt;\n\n&lt;p&gt;Also, don&amp;#39;t update him on anything unless he specifically asks about it. If you start therapy, medicine, or try coping skills, don&amp;#39;t tell him unless he asks, or unless he says that he is ready to speak with you. Again it is about respecting his boundary that he set in wanting a break and to be left alone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbmd42", "score_hidden": false, "stickied": false, "created": 1492342244.0, "created_utc": 1492313444.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb9pkf", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "greenleavesontrees", "parent_id": "t1_dgav00y", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Do you think kind gestures would be welcome? For example, sending him some things that would cheer him up like candy and a short letter. I want to make sure he's okay and knows I still care, but at the same time I don't want to make matters worse. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you think kind gestures would be welcome? For example, sending him some things that would cheer him up like candy and a short letter. I want to make sure he&amp;#39;s okay and knows I still care, but at the same time I don&amp;#39;t want to make matters worse. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgb9pkf", "score_hidden": false, "stickied": false, "created": 1492323872.0, "created_utc": 1492295072.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgav00y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "prysmyr", "parent_id": "t3_65jcxn", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Give him his space, trust me. I've been in his shoes. The more you try to contact him, the less he will want to ever speak to you. He asked for one thing, space, and if you can't respect that then there's going to be lots of issues. \n\nRealize that you can't depend on him to solve all your problems and curb your anxiety. He is a person and the way you are treating him is emotionally draining. Leave him alone.\n\nIf you care about him, you wouldn't be worried about if he is going to leave you or trying to force him to speak when he isn't ready (seems like you're only trying to do that to make yourself feel better and curb your anxieties). You would be worried about his mental health, and you would respect his wishes. If you can show him that then you need not worry.\n\nI've been on both sides of the situation. You might be panicking but trust me his side is the worse side to be on. Love him, respect him, care about him. Don't use him as a pacifier. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Give him his space, trust me. I&amp;#39;ve been in his shoes. The more you try to contact him, the less he will want to ever speak to you. He asked for one thing, space, and if you can&amp;#39;t respect that then there&amp;#39;s going to be lots of issues. &lt;/p&gt;\n\n&lt;p&gt;Realize that you can&amp;#39;t depend on him to solve all your problems and curb your anxiety. He is a person and the way you are treating him is emotionally draining. Leave him alone.&lt;/p&gt;\n\n&lt;p&gt;If you care about him, you wouldn&amp;#39;t be worried about if he is going to leave you or trying to force him to speak when he isn&amp;#39;t ready (seems like you&amp;#39;re only trying to do that to make yourself feel better and curb your anxieties). You would be worried about his mental health, and you would respect his wishes. If you can show him that then you need not worry.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been on both sides of the situation. You might be panicking but trust me his side is the worse side to be on. Love him, respect him, care about him. Don&amp;#39;t use him as a pacifier. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgav00y", "score_hidden": false, "stickied": false, "created": 1492303773.0, "created_utc": 1492274973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jcxn", "likes": null, "replies": "", "user_reports": [], "id": "dgbgyur", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greenleavesontrees", "parent_id": "t1_dgbg7wy", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I understand what you mean. But I honestly don't think he has meant it in that way. Just because he was good at saying that I'm okay doesn't mean that was healthy. By constantly reassuring me, he wasn't exactly helping me with my anxiety, just giving me a shortcut or an out-- until it came back again and the cycle would continue. It hurts to admit that, but it's true: I was only asking for reassurance as a way to avoid my anxiety, and I was so uncomfortable at facing the worries head on like I should. \n\nBeing emotionally exhausted by me isn't something he should be seen as negative about: he's only human. It hurt when he told me that, but I understand-- I had been essentially emotionally abusing him in that aspect. The constant anxiety that I had been projecting onto him had obviously been taking a toll on his wellbeing. \n\nHe was right: what we had at the moment wasn't healthy. I was being dependent and unwilling to change because I was so used to him being there and coddling me. It is only natural he lost his patience at some point, and I don't think he was trying to make it all about him. \n\nAs for the thing about not knowing when to end the break, I highly, highly doubt it's a control thing. I know that you don't know me or him, but I can assure you, he is not the kind of person to say that kind of thing out of spite-- you may not believe me, but I do. I think he literally just doesn't know when he'll be okay-- and that's fine! The two of us have been in a situation in which one needed to wait for the other to be ready once before, so I think it's just best to see and wait when he's ready to talk about it with a clear consciousness. \n\nI do sometimes wonder what will happen if we do get back together-- we will have to talk about how we will talk about my anxiety from there on out. All I'm going to do at the moment is focus on going to the therapist and talking it out with them. \n\nHe's been a wonderfully patient person towards me the past few months-- and I just think it got a little overwhelming for him, is all. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand what you mean. But I honestly don&amp;#39;t think he has meant it in that way. Just because he was good at saying that I&amp;#39;m okay doesn&amp;#39;t mean that was healthy. By constantly reassuring me, he wasn&amp;#39;t exactly helping me with my anxiety, just giving me a shortcut or an out-- until it came back again and the cycle would continue. It hurts to admit that, but it&amp;#39;s true: I was only asking for reassurance as a way to avoid my anxiety, and I was so uncomfortable at facing the worries head on like I should. &lt;/p&gt;\n\n&lt;p&gt;Being emotionally exhausted by me isn&amp;#39;t something he should be seen as negative about: he&amp;#39;s only human. It hurt when he told me that, but I understand-- I had been essentially emotionally abusing him in that aspect. The constant anxiety that I had been projecting onto him had obviously been taking a toll on his wellbeing. &lt;/p&gt;\n\n&lt;p&gt;He was right: what we had at the moment wasn&amp;#39;t healthy. I was being dependent and unwilling to change because I was so used to him being there and coddling me. It is only natural he lost his patience at some point, and I don&amp;#39;t think he was trying to make it all about him. &lt;/p&gt;\n\n&lt;p&gt;As for the thing about not knowing when to end the break, I highly, highly doubt it&amp;#39;s a control thing. I know that you don&amp;#39;t know me or him, but I can assure you, he is not the kind of person to say that kind of thing out of spite-- you may not believe me, but I do. I think he literally just doesn&amp;#39;t know when he&amp;#39;ll be okay-- and that&amp;#39;s fine! The two of us have been in a situation in which one needed to wait for the other to be ready once before, so I think it&amp;#39;s just best to see and wait when he&amp;#39;s ready to talk about it with a clear consciousness. &lt;/p&gt;\n\n&lt;p&gt;I do sometimes wonder what will happen if we do get back together-- we will have to talk about how we will talk about my anxiety from there on out. All I&amp;#39;m going to do at the moment is focus on going to the therapist and talking it out with them. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s been a wonderfully patient person towards me the past few months-- and I just think it got a little overwhelming for him, is all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbgyur", "score_hidden": false, "stickied": false, "created": 1492334256.0, "created_utc": 1492305456.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbg7wy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65jcxn", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbg7wy", "score_hidden": false, "stickied": false, "created": 1492333208.0, "created_utc": 1492304408.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]