[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re going about your day and you start to notice a feeling of being just a little bit on edge. It starts somewhere inside your head. Maybe you feel a little bit of tension building in your chest or your face. &lt;/p&gt;\n\n&lt;p&gt;You try to ignore it, but think you know what&amp;#39;s happening. Then your heart starts beating faster as you realize what it is. &lt;/p&gt;\n\n&lt;p&gt;Breathing becomes a chore and you&amp;#39;re panting for air before you know it. Breathing like a marathon runner, but it still feels like you&amp;#39;re not getting enough air. &lt;/p&gt;\n\n&lt;p&gt;Another panic attack. &lt;/p&gt;\n\n&lt;p&gt;Last year I was having them about twice a day. Even when the panic attacks calmed for a while, there was still an underlying feeling of always being on edge.  I just couldn&amp;#39;t relax.&lt;/p&gt;\n\n&lt;p&gt;It got to the point where I was afraid to go outside. I barely left the house for months (except to go to work). I was afraid I&amp;#39;d have another panic attack in the car or at the grocery store.&lt;/p&gt;\n\n&lt;p&gt;It was miserable and terrifying. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to constantly suffer without help if you have persistent anxiety that&amp;#39;s making life miserable. &lt;/p&gt;\n\n&lt;p&gt;Eventually I couldn&amp;#39;t deal with it on my own anymore. Through some research and helpful therapists, I was able to find some ways to get my anxiety to a livable level. &lt;/p&gt;\n\n&lt;p&gt;There are dozens of ways to deal with anxiety, but these are a few that worked for me.  They may or may not work for you, but give them a try and see how it goes.&lt;/p&gt;\n\n&lt;p&gt;--Get Support From A Professional--&lt;/p&gt;\n\n&lt;p&gt;After being in a constant state of panic for months, I decided enough was enough.  I found a mental health organization in my city and asked them if I could come in to talk about what was going on. &lt;/p&gt;\n\n&lt;p&gt;I realized that a sick brain probably couldn&amp;#39;t fix itself. I needed help from someone who could look at my life from outside of my sickness and see what was going on. &lt;/p&gt;\n\n&lt;p&gt;This is the number one thing I could recommend to someone suffering from anxiety (or may other things). &lt;/p&gt;\n\n&lt;p&gt;I still remember the relief, like 100lbs went off my back, when my therapist said: &amp;quot;You&amp;#39;re going to be okay,&amp;quot; after months of being afraid I was going crazy. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be too proud to ask for help. It&amp;#39;s the smart thing to do. And if money is an issue, there are many organizations that provide quality mental health care for people on a low income. That&amp;#39;s what I had to do, so I know it&amp;#39;s out there.&lt;/p&gt;\n\n&lt;p&gt;--Get All The Junk And Bad Habits Out Of Your Life--&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t care what it is: Excessive driving, smoking, too much caffeine, internet addictions, people that always bring you down. &lt;/p&gt;\n\n&lt;p&gt;Whatever it is, do everything you can to get it out of your life. &lt;/p&gt;\n\n&lt;p&gt;Our brains our affected by what we put into them and the environments we put ourselves into. There are no exceptions. &lt;/p&gt;\n\n&lt;p&gt;You might not be able to get things perfect, but set yourself up to be a little more healthy every day. Within 3 . . . 6 . . . 12 months, you&amp;#39;ll be amazed at how much better you feel.&lt;/p&gt;\n\n&lt;p&gt;--You Don&amp;#39;t Have To Be Pushed Around By Your Thoughts--&lt;/p&gt;\n\n&lt;p&gt;Thoughts are just thoughts - not necessarily reality. &lt;/p&gt;\n\n&lt;p&gt;Our bodies and minds are fundamentally connected. What we do to our mind affects our body.  What we do to our body affects our mind. &lt;/p&gt;\n\n&lt;p&gt;Mindfulness meditation, visualization techniques, EDMR (Eye Movement Desensitization and Reprocessing), isochronic beats. All of these techniques help the brain  stabilize itself to a more peaceful state. &lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t get into them here (you&amp;#39;ll have to do your own research), but believe me, they help. &lt;/p&gt;\n\n&lt;p&gt;Need an easy way to get started? &lt;/p&gt;\n\n&lt;p&gt;Breathe in 4 seconds.\nHold it.\nBreath out 4 seconds.\nRepeat two more times. &lt;/p&gt;\n\n&lt;p&gt;Feel better? Do that every time you start to feel anxiety come on. It works. &lt;/p&gt;\n\n&lt;p&gt;--Dump The Emotional Garbage--&lt;/p&gt;\n\n&lt;p&gt;Holding onto resentment, anger, unforgiveness, bitterness, entitlement, and all those other negative emotions is poison for your brain. &lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t matter whose fault it is -- you have to let that garbage go.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen people literally go crazy feeling sorry for themselves and being angry at people in their lives who have hurt them. &lt;/p&gt;\n\n&lt;p&gt;Yeah, it sucks. Especially when it wasn&amp;#39;t your fault.  But you have to let it go. &lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t know where to start, simply say to yourself: &amp;quot;I surrender the right to this (anger, resentment, etc.)&amp;quot; every  time you feel it come on. It might take a couple months to really let it go, but keep practicing this. &lt;/p&gt;\n\n&lt;p&gt;--Get Some Sunlight--&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s something healing about being outside and moving around. Maybe it&amp;#39;s because, thousands of years ago, we were basically nomadic and constantly moving around for our survival. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s something healthy and healing about the simple act of moving. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to go run a marathon or go to the gym four times a week.  Just go outside and walk around the block for twenty minutes.  It&amp;#39;ll clear your head and your thoughts. &lt;/p&gt;\n\n&lt;p&gt;--Get Your Life Together--&lt;/p&gt;\n\n&lt;p&gt;When we don&amp;#39;t know what we&amp;#39;re living for every day and why, it&amp;#39;s no wonder we&amp;#39;re anxious all the time. &lt;/p&gt;\n\n&lt;p&gt;Take a few hours and decide for yourself where you want your life to go, who you want to be, and the people you want to be around. &lt;/p&gt;\n\n&lt;p&gt;A couple great places to start:&lt;/p&gt;\n\n&lt;p&gt;The late Scott Dinsmore put together the Live Your Legend website (Google it) to help people get some direction, passion, and purpose in their lives. &lt;/p&gt;\n\n&lt;p&gt;Read Man&amp;#39;s Search For Meaning by Viktor Frankl (on Amazon). He wrote this book while he was a prisoner at an Auschwitz concentration camp. He was eventually put into leadership at a mental health hospital because so many of their patients were killing themselves. After Frankl came in and used his methodology, not a single person committed suicide under his care.&lt;/p&gt;\n\n&lt;p&gt;And after you get a rough idea of who you want to be and where you want to go -- start saying &amp;quot;no&amp;quot; (say it ALOT) to anything that doesn&amp;#39;t get you there.&lt;/p&gt;\n\n&lt;p&gt;--Get Out Of Isolation--&lt;/p&gt;\n\n&lt;p&gt;Isolation destroys the brain. People are social creatures and without a healthy community of friends and family, we just start getting weird in our thoughts. &lt;/p&gt;\n\n&lt;p&gt;Anxiety, paranoia, depression -- these can all come about when we don&amp;#39;t spend enough time with others. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s hard to have a good community these days. Many experts have called this one of the loneliest generations in American history.&lt;/p&gt;\n\n&lt;p&gt;But you still have to take the initiative and get out there.&lt;/p&gt;\n\n&lt;p&gt;Call up old friends (if they&amp;#39;re healthy people to be around), go to a cafe, find an interesting group on Meetup.com, go to church.  Do whatever you have to do to get outside and around other people.&lt;/p&gt;\n\n&lt;p&gt;That alone will take 100lbs off your head.&lt;/p&gt;\n\n&lt;p&gt;--Be Thankful --&lt;/p&gt;\n\n&lt;p&gt;Gratitude, even during hard times, will exercise your positivity muscle in your brain. &lt;/p&gt;\n\n&lt;p&gt;Once a day, write down a few things you&amp;#39;re thankful for and why. &lt;/p&gt;\n\n&lt;p&gt;After you&amp;#39;ve worked through the more obvious things (e.g. family, friends, etc.), try to practice a more difficult form of gratitude: creative gratitude. &lt;/p&gt;\n\n&lt;p&gt;What is creative gratitude? Being thankful for things that suck.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s an example I came up with in my own life recently: &lt;/p&gt;\n\n&lt;p&gt;Many things have changed in my life over the last 5-6 years. A lot of things or people that used to give me stability are no longer there or no longer work for me. I was depressed for a long time about it. &lt;/p&gt;\n\n&lt;p&gt;Eventually I realized that it&amp;#39;s healthy for me to change and for life to change. It means I&amp;#39;m alive - because only dead things don&amp;#39;t change and grow. &lt;/p&gt;\n\n&lt;p&gt;I was eventually able to say to myself: &amp;quot;Thank you for this opportunity to rewrite my life into anything I want it to be.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;--Brain-Dump Everything--&lt;/p&gt;\n\n&lt;p&gt;Studies have shown that people who write about their negative experiences, even just fifteen minutes a day for five days, have a noticeable increase in their ability to come with hard times.&lt;/p&gt;\n\n&lt;p&gt;Go to a Dollar Store and get a cheap notebook. Set a timer for fifteen minutes. Write down everything that comes to mind about your situation. At the end of the week, see how you feel. I bet you&amp;#39;ll feel at least a little weight off of your shoulders.&lt;/p&gt;\n\n&lt;p&gt;--Four Things You Can Do Every Day To Make Your Life 3,7000% Better Within A Year--&lt;/p&gt;\n\n&lt;p&gt;There are four areas everyone needs to be healthy in to live a good life: physical, mental, emotional, and spiritual. If you improve in those areas just 1% everyday, your life will be 3,700% better within one year.&lt;/p&gt;\n\n&lt;p&gt;I did this myself when I was feeling terrible.  Within just two weeks of practicing these ideas daily, I was feeling noticeable better.&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t write them all out, but Google &amp;quot;How to be the luckiest guy in the world&amp;quot; by James Altucher to get the full story (it works). &lt;/p&gt;\n\n&lt;p&gt;You might feel pretty hopeless right now. But if you ask for help, do some research, and take some initiative (ultimately, no one can fix this but you), you can live a much better life in a few short months, and a totally transformed life in a couple short years. &lt;/p&gt;\n\n&lt;p&gt;I know this because I&amp;#39;ve done it for myself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "You're going about your day and you start to notice a feeling of being just a little bit on edge. It starts somewhere inside your head. Maybe you feel a little bit of tension building in your chest or your face. \n\nYou try to ignore it, but think you know what's happening. Then your heart starts beating faster as you realize what it is. \n\nBreathing becomes a chore and you're panting for air before you know it. Breathing like a marathon runner, but it still feels like you're not getting enough air. \n\nAnother panic attack. \n\nLast year I was having them about twice a day. Even when the panic attacks calmed for a while, there was still an underlying feeling of always being on edge.  I just couldn't relax.\n\nIt got to the point where I was afraid to go outside. I barely left the house for months (except to go to work). I was afraid I'd have another panic attack in the car or at the grocery store.\n\nIt was miserable and terrifying. \n\nYou don't have to constantly suffer without help if you have persistent anxiety that's making life miserable. \n\nEventually I couldn't deal with it on my own anymore. Through some research and helpful therapists, I was able to find some ways to get my anxiety to a livable level. \n\nThere are dozens of ways to deal with anxiety, but these are a few that worked for me.  They may or may not work for you, but give them a try and see how it goes.\n\n--Get Support From A Professional--\n\nAfter being in a constant state of panic for months, I decided enough was enough.  I found a mental health organization in my city and asked them if I could come in to talk about what was going on. \n\nI realized that a sick brain probably couldn't fix itself. I needed help from someone who could look at my life from outside of my sickness and see what was going on. \n\nThis is the number one thing I could recommend to someone suffering from anxiety (or may other things). \n\nI still remember the relief, like 100lbs went off my back, when my therapist said: \"You're going to be okay,\" after months of being afraid I was going crazy. \n\nDon't be too proud to ask for help. It's the smart thing to do. And if money is an issue, there are many organizations that provide quality mental health care for people on a low income. That's what I had to do, so I know it's out there.\n\n--Get All The Junk And Bad Habits Out Of Your Life--\n\nI don't care what it is: Excessive driving, smoking, too much caffeine, internet addictions, people that always bring you down. \n\nWhatever it is, do everything you can to get it out of your life. \n\nOur brains our affected by what we put into them and the environments we put ourselves into. There are no exceptions. \n\nYou might not be able to get things perfect, but set yourself up to be a little more healthy every day. Within 3 . . . 6 . . . 12 months, you'll be amazed at how much better you feel.\n\n--You Don't Have To Be Pushed Around By Your Thoughts--\n\nThoughts are just thoughts - not necessarily reality. \n\nOur bodies and minds are fundamentally connected. What we do to our mind affects our body.  What we do to our body affects our mind. \n\nMindfulness meditation, visualization techniques, EDMR (Eye Movement Desensitization and Reprocessing), isochronic beats. All of these techniques help the brain  stabilize itself to a more peaceful state. \n\nI won't get into them here (you'll have to do your own research), but believe me, they help. \n\nNeed an easy way to get started? \n\nBreathe in 4 seconds.\nHold it.\nBreath out 4 seconds.\nRepeat two more times. \n\nFeel better? Do that every time you start to feel anxiety come on. It works. \n\n--Dump The Emotional Garbage--\n\nHolding onto resentment, anger, unforgiveness, bitterness, entitlement, and all those other negative emotions is poison for your brain. \n\nIt doesn't matter whose fault it is -- you have to let that garbage go.  \n\nI've seen people literally go crazy feeling sorry for themselves and being angry at people in their lives who have hurt them. \n\nYeah, it sucks. Especially when it wasn't your fault.  But you have to let it go. \n\nIf you don't know where to start, simply say to yourself: \"I surrender the right to this (anger, resentment, etc.)\" every  time you feel it come on. It might take a couple months to really let it go, but keep practicing this. \n\n--Get Some Sunlight--\n\nThere's something healing about being outside and moving around. Maybe it's because, thousands of years ago, we were basically nomadic and constantly moving around for our survival. \n\nThere's something healthy and healing about the simple act of moving. \n\nYou don't have to go run a marathon or go to the gym four times a week.  Just go outside and walk around the block for twenty minutes.  It'll clear your head and your thoughts. \n\n--Get Your Life Together--\n\nWhen we don't know what we're living for every day and why, it's no wonder we're anxious all the time. \n\nTake a few hours and decide for yourself where you want your life to go, who you want to be, and the people you want to be around. \n\nA couple great places to start:\n\nThe late Scott Dinsmore put together the Live Your Legend website (Google it) to help people get some direction, passion, and purpose in their lives. \n\nRead Man's Search For Meaning by Viktor Frankl (on Amazon). He wrote this book while he was a prisoner at an Auschwitz concentration camp. He was eventually put into leadership at a mental health hospital because so many of their patients were killing themselves. After Frankl came in and used his methodology, not a single person committed suicide under his care.\n\nAnd after you get a rough idea of who you want to be and where you want to go -- start saying \"no\" (say it ALOT) to anything that doesn't get you there.\n\n--Get Out Of Isolation--\n\nIsolation destroys the brain. People are social creatures and without a healthy community of friends and family, we just start getting weird in our thoughts. \n\nAnxiety, paranoia, depression -- these can all come about when we don't spend enough time with others. \n\nIt's hard to have a good community these days. Many experts have called this one of the loneliest generations in American history.\n\nBut you still have to take the initiative and get out there.\n\nCall up old friends (if they're healthy people to be around), go to a cafe, find an interesting group on Meetup.com, go to church.  Do whatever you have to do to get outside and around other people.\n\nThat alone will take 100lbs off your head.\n\n--Be Thankful --\n\nGratitude, even during hard times, will exercise your positivity muscle in your brain. \n\nOnce a day, write down a few things you're thankful for and why. \n\nAfter you've worked through the more obvious things (e.g. family, friends, etc.), try to practice a more difficult form of gratitude: creative gratitude. \n\nWhat is creative gratitude? Being thankful for things that suck.\n\nHere's an example I came up with in my own life recently: \n\nMany things have changed in my life over the last 5-6 years. A lot of things or people that used to give me stability are no longer there or no longer work for me. I was depressed for a long time about it. \n\nEventually I realized that it's healthy for me to change and for life to change. It means I'm alive - because only dead things don't change and grow. \n\nI was eventually able to say to myself: \"Thank you for this opportunity to rewrite my life into anything I want it to be.\"\n\n--Brain-Dump Everything--\n\nStudies have shown that people who write about their negative experiences, even just fifteen minutes a day for five days, have a noticeable increase in their ability to come with hard times.\n\nGo to a Dollar Store and get a cheap notebook. Set a timer for fifteen minutes. Write down everything that comes to mind about your situation. At the end of the week, see how you feel. I bet you'll feel at least a little weight off of your shoulders.\n\n--Four Things You Can Do Every Day To Make Your Life 3,7000% Better Within A Year--\n\nThere are four areas everyone needs to be healthy in to live a good life: physical, mental, emotional, and spiritual. If you improve in those areas just 1% everyday, your life will be 3,700% better within one year.\n\nI did this myself when I was feeling terrible.  Within just two weeks of practicing these ideas daily, I was feeling noticeable better.\n\nI won't write them all out, but Google \"How to be the luckiest guy in the world\" by James Altucher to get the full story (it works). \n\nYou might feel pretty hopeless right now. But if you ask for help, do some research, and take some initiative (ultimately, no one can fix this but you), you can live a much better life in a few short months, and a totally transformed life in a couple short years. \n\nI know this because I've done it for myself.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Helpful Tips!", "id": "65jmyx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 107, "report_reasons": null, "author": "NtrANdEN", "saved": false, "mod_reports": [], "name": "t3_65jmyx", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": "helpfultips", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/65jmyx/how_i_learned_to_make_my_anxiety_more_livable_in/", "num_reports": null, "locked": false, "stickied": false, "created": 1492299002.0, "url": "https://www.reddit.com/r/Anxiety/comments/65jmyx/how_i_learned_to_make_my_anxiety_more_livable_in/", "author_flair_text": null, "quarantine": false, "title": "How I Learned To Make My Anxiety More Livable In One Year (And Nearly Eliminate Panic Attacks)", "created_utc": 1492270202.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 107}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": "", "user_reports": [], "id": "dgbbxjd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NtrANdEN", "parent_id": "t1_dgb93fw", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Good luck :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbbxjd", "score_hidden": false, "stickied": false, "created": 1492327130.0, "created_utc": 1492298330.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb93fw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Toxisk", "parent_id": "t3_65jmyx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Thank you for this. I consider this to be really valuable advice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this. I consider this to be really valuable advice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgb93fw", "score_hidden": false, "stickied": false, "created": 1492323002.0, "created_utc": 1492294202.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": "", "user_reports": [], "id": "dgbqiml", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NtrANdEN", "parent_id": "t1_dgbpv1j", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "That's been my biggest one, too.  Good luck", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s been my biggest one, too.  Good luck&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbqiml", "score_hidden": false, "stickied": false, "created": 1492349411.0, "created_utc": 1492320611.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbpv1j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ghostomato", "parent_id": "t3_65jmyx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Thank you for taking the time to post this. Really needed to read the bit on isolation . ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for taking the time to post this. Really needed to read the bit on isolation . &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbpv1j", "score_hidden": false, "stickied": false, "created": 1492348189.0, "created_utc": 1492319389.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": "", "user_reports": [], "id": "dgcp8hx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NtrANdEN", "parent_id": "t1_dgcc62j", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Glad they're helping.  :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad they&amp;#39;re helping.  :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgcp8hx", "score_hidden": false, "stickied": false, "created": 1492411557.0, "created_utc": 1492382757.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc62j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ihopethisisvalid", "parent_id": "t3_65jmyx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Thank you for posting this. These tips are really helping me today. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for posting this. These tips are really helping me today. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgcc62j", "score_hidden": false, "stickied": false, "created": 1492394294.0, "created_utc": 1492365494.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": "", "user_reports": [], "id": "dgb8tua", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NtrANdEN", "parent_id": "t1_dgb7gn5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "That's another big one.  When I realized I had a friend or two who also struggled with anxiety, it removes the stigma and feeling of isolation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s another big one.  When I realized I had a friend or two who also struggled with anxiety, it removes the stigma and feeling of isolation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgb8tua", "score_hidden": false, "stickied": false, "created": 1492322626.0, "created_utc": 1492293826.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7gn5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ftgi", "parent_id": "t3_65jmyx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Sharing with friends was my saving grace. The more friends I told, the more I was greeted with their stories of mental health challenges. I realized how normal and manageable it is, which helped removed the stigma and allow me to take the steps to get better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sharing with friends was my saving grace. The more friends I told, the more I was greeted with their stories of mental health challenges. I realized how normal and manageable it is, which helped removed the stigma and allow me to take the steps to get better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgb7gn5", "score_hidden": false, "stickied": false, "created": 1492320741.0, "created_utc": 1492291941.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": "", "user_reports": [], "id": "dgbduak", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NtrANdEN", "parent_id": "t1_dgbd7rx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "You can do it :)  Just get 1% better everyday.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can do it :)  Just get 1% better everyday.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbduak", "score_hidden": false, "stickied": false, "created": 1492329785.0, "created_utc": 1492300985.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbd7rx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "stereoparade", "parent_id": "t3_65jmyx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "This post is saving me right now. Thank you, OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This post is saving me right now. Thank you, OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbd7rx", "score_hidden": false, "stickied": false, "created": 1492328945.0, "created_utc": 1492300145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": "", "user_reports": [], "id": "dgbl205", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NtrANdEN", "parent_id": "t1_dgbkspw", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Glad to hear it's gotten better.  I couldn't drink caffeine for a long time because it would trigger anxiety.  I drink it now, but carefully.  No more 8 cups a day.  :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad to hear it&amp;#39;s gotten better.  I couldn&amp;#39;t drink caffeine for a long time because it would trigger anxiety.  I drink it now, but carefully.  No more 8 cups a day.  :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbl205", "score_hidden": false, "stickied": false, "created": 1492340255.0, "created_utc": 1492311455.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": "", "user_reports": [], "id": "dgc4ngp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Five_Decades", "parent_id": "t1_dgbsk0d", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Yes. Either a CPAP or a tongue retaining device caused me to develop panic attacks in the days after using it. \n\nI may be an exception though, many people do not get that effect. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. Either a CPAP or a tongue retaining device caused me to develop panic attacks in the days after using it. &lt;/p&gt;\n\n&lt;p&gt;I may be an exception though, many people do not get that effect. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgc4ngp", "score_hidden": false, "stickied": false, "created": 1492384269.0, "created_utc": 1492355469.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbsk0d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "noitatiplap", "parent_id": "t1_dgbkspw", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I'm confused, are you saying the CPAP made your anxiety worse? I'm considering doing a sleep study and possibly treating sleep apnea as a positive life change.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m confused, are you saying the CPAP made your anxiety worse? I&amp;#39;m considering doing a sleep study and possibly treating sleep apnea as a positive life change.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbsk0d", "score_hidden": false, "stickied": false, "created": 1492354094.0, "created_utc": 1492325294.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbkspw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Five_Decades", "parent_id": "t3_65jmyx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "&gt; --Get All The Junk And Bad Habits Out Of Your Life--\n\nFor me this has been paramount. CPAP sleep apnea devices, caffeine, and certain medications can send me spiraling into panic. Once I identified and removed my triggers, my anxiety mostly went away. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;--Get All The Junk And Bad Habits Out Of Your Life--&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;For me this has been paramount. CPAP sleep apnea devices, caffeine, and certain medications can send me spiraling into panic. Once I identified and removed my triggers, my anxiety mostly went away. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbkspw", "score_hidden": false, "stickied": false, "created": 1492339882.0, "created_utc": 1492311082.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": "", "user_reports": [], "id": "dgdfi13", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NtrANdEN", "parent_id": "t1_dgdf8ny", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Hope they help :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hope they help :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgdfi13", "score_hidden": false, "stickied": false, "created": 1492461781.0, "created_utc": 1492432981.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdf8ny", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "randomawkwardthrowaw", "parent_id": "t3_65jmyx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Thank you for your great and insightful tips! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your great and insightful tips! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgdf8ny", "score_hidden": false, "stickied": false, "created": 1492461282.0, "created_utc": 1492432482.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65jmyx", "likes": null, "replies": "", "user_reports": [], "id": "dgc0j4e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NtrANdEN", "parent_id": "t1_dgbw458", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "ty :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ty :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgc0j4e", "score_hidden": false, "stickied": false, "created": 1492377440.0, "created_utc": 1492348640.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbw458", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "keypalabras", "parent_id": "t3_65jmyx", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Thank you! Much love and appreciation for this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! Much love and appreciation for this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbw458", "score_hidden": false, "stickied": false, "created": 1492365059.0, "created_utc": 1492336259.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]