[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ouch. He&amp;#39;s right, in fact he may have just crammed all my anxiety fears into one neat little question- but damn it hurt to hear. I won&amp;#39;t go into all the little details about my last few days, but I need advise/support/just to vent maybe. &lt;/p&gt;\n\n&lt;p&gt;My anxiety was at a high about two months ago; since then I&amp;#39;ve been mindful and conscious of the way I treat my mind and my body and I&amp;#39;ve felt REALLY healthy lately. Then this week happened...&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m getting my car fixed (damage from a small accident 2 months ago), so I&amp;#39;m in a rental car. This seems like a little thing, but it doesn&amp;#39;t feel familiar or comfortable to me. My dad is in town, and while I love him, my anxiety is always triggered when he&amp;#39;s around. I&amp;#39;m spending Easter with my family, and being surrounded by 20 people I don&amp;#39;t feel comfortable with or similar to is setting my anxiety off. I moved in with my SO at the beginning of the month and he sprung the news of a new job on me pretty abruptly. This, the job, more than anything has set me off- its a great job and I truly believe he will be amazing at it, but it comes with some changes and some history. I won&amp;#39;t give all the details, but it&amp;#39;s a lot to have on my mind. &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t communicate what I was feeling well to my SO. I tried, but I&amp;#39;m often dumbfounded with how to explain &amp;#39;I&amp;#39;m really happy and excited&amp;#39; as well as &amp;#39;I&amp;#39;m scared shitless&amp;#39; while also explaining &amp;#39;I know I&amp;#39;m being irrational&amp;#39; but &amp;#39;I still feel like my chest is burning and I can&amp;#39;t think straight when my mind is buzzing&amp;#39;. I think he&amp;#39;s mad at me for not being excited, and honestly I&amp;#39;m mad at me too. I don&amp;#39;t know how to fix it, to explain that I love him and I&amp;#39;m sorry but that I need some support and understanding so I can pull myself out of this rut I&amp;#39;ve found myself in. I feel like I&amp;#39;m going nuts again. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;ve read this far, thank you so much. I feel really alone in this. As always, questions/discussion below. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how to explain the way my anxiety feels, and how it effects my behavior to my SO. I don&amp;#39;t want him to think I&amp;#39;m mad or upset or stupid or whatever, but I hate feeling like I&amp;#39;m giving an excuse for acting those ways...&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how to wind down, I&amp;#39;ve been running for two months now getting things done. Now I just need to breath and decompress and I don&amp;#39;t know how??&lt;/p&gt;\n\n&lt;p&gt;I get so caught up in dealing, dealing, dealing that I don&amp;#39;t realize how stressed, tired, sad, detached, or anxious I really am. How do I take a step back and decompress from all the stress I&amp;#39;ve been feeling lately? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ouch. He's right, in fact he may have just crammed all my anxiety fears into one neat little question- but damn it hurt to hear. I won't go into all the little details about my last few days, but I need advise/support/just to vent maybe. \n\nMy anxiety was at a high about two months ago; since then I've been mindful and conscious of the way I treat my mind and my body and I've felt REALLY healthy lately. Then this week happened...\n\nI'm getting my car fixed (damage from a small accident 2 months ago), so I'm in a rental car. This seems like a little thing, but it doesn't feel familiar or comfortable to me. My dad is in town, and while I love him, my anxiety is always triggered when he's around. I'm spending Easter with my family, and being surrounded by 20 people I don't feel comfortable with or similar to is setting my anxiety off. I moved in with my SO at the beginning of the month and he sprung the news of a new job on me pretty abruptly. This, the job, more than anything has set me off- its a great job and I truly believe he will be amazing at it, but it comes with some changes and some history. I won't give all the details, but it's a lot to have on my mind. \n\nI didn't communicate what I was feeling well to my SO. I tried, but I'm often dumbfounded with how to explain 'I'm really happy and excited' as well as 'I'm scared shitless' while also explaining 'I know I'm being irrational' but 'I still feel like my chest is burning and I can't think straight when my mind is buzzing'. I think he's mad at me for not being excited, and honestly I'm mad at me too. I don't know how to fix it, to explain that I love him and I'm sorry but that I need some support and understanding so I can pull myself out of this rut I've found myself in. I feel like I'm going nuts again. \n\nIf you've read this far, thank you so much. I feel really alone in this. As always, questions/discussion below. \n\nI don't know how to explain the way my anxiety feels, and how it effects my behavior to my SO. I don't want him to think I'm mad or upset or stupid or whatever, but I hate feeling like I'm giving an excuse for acting those ways...\n\nI don't know how to wind down, I've been running for two months now getting things done. Now I just need to breath and decompress and I don't know how??\n\nI get so caught up in dealing, dealing, dealing that I don't realize how stressed, tired, sad, detached, or anxious I really am. How do I take a step back and decompress from all the stress I've been feeling lately? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65knrs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "ppl_r_oceans", "saved": false, "mod_reports": [], "name": "t3_65knrs", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/65knrs/are_you_afraid_of_existing/", "num_reports": null, "locked": false, "stickied": false, "created": 1492310304.0, "url": "https://www.reddit.com/r/Anxiety/comments/65knrs/are_you_afraid_of_existing/", "author_flair_text": null, "quarantine": false, "title": "\"Are you afraid of existing?\"", "created_utc": 1492281504.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65knrs", "likes": null, "replies": "", "user_reports": [], "id": "dgbjkeh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jack-elda", "parent_id": "t3_65knrs", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I have a great idea for communicating your feelings about everything to your SO. Show him this post! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a great idea for communicating your feelings about everything to your SO. Show him this post! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgbjkeh", "score_hidden": false, "stickied": false, "created": 1492338068.0, "created_utc": 1492309268.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]