[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My close friend struggles with anxiety. I asked in this thread awhile back what I could do for her, and the TLDR was just to be there for her. I want to be the best support I can, so now I&amp;#39;d like to ask: what should I know? Like in a very general sense. Just trying to be the best friend I can be.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My close friend struggles with anxiety. I asked in this thread awhile back what I could do for her, and the TLDR was just to be there for her. I want to be the best support I can, so now I'd like to ask: what should I know? Like in a very general sense. Just trying to be the best friend I can be.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65r2zh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "zeusapollo2990", "saved": false, "mod_reports": [], "name": "t3_65r2zh", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/65r2zh/what_should_i_know_as_a_supporter/", "num_reports": null, "locked": false, "stickied": false, "created": 1492401732.0, "url": "https://www.reddit.com/r/Anxiety/comments/65r2zh/what_should_i_know_as_a_supporter/", "author_flair_text": null, "quarantine": false, "title": "What should i know as a supporter?", "created_utc": 1492372932.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65r2zh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65r2zh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65r2zh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65r2zh", "likes": null, "replies": "", "user_reports": [], "id": "dgd2yph", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zeusapollo2990", "parent_id": "t1_dgcw1kk", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "So I'm actually a guy (no worries lol, everything you say carries over, including the hug thing. We've been friends for so long that we've moved passed any awkwardness from huggin it out in public). Anywho, thanks for your thoughts! I feel like I did a lot of these things back when we first started out as friends, and while I've been good about keeping up with some of them (like hugs and moving at her pace when it comes to activities), I've definitely noticed a dip in venting and her needing a shoulder. While I 1000% hope it's because she's just happy and doesn't need it, maybe it's worth reminding her just for the sake of reminding her. Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;m actually a guy (no worries lol, everything you say carries over, including the hug thing. We&amp;#39;ve been friends for so long that we&amp;#39;ve moved passed any awkwardness from huggin it out in public). Anywho, thanks for your thoughts! I feel like I did a lot of these things back when we first started out as friends, and while I&amp;#39;ve been good about keeping up with some of them (like hugs and moving at her pace when it comes to activities), I&amp;#39;ve definitely noticed a dip in venting and her needing a shoulder. While I 1000% hope it&amp;#39;s because she&amp;#39;s just happy and doesn&amp;#39;t need it, maybe it&amp;#39;s worth reminding her just for the sake of reminding her. Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgd2yph", "score_hidden": false, "stickied": false, "created": 1492430550.0, "created_utc": 1492401750.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcw1kk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tormented_Anus", "parent_id": "t1_dgcmy71", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Definitely what u/xsakawaka said. Talk to her and be there for her, and find out how her anxiety affects her specifically as it's different for everyone. Ask her about her difficulties and provide your outlook/solutions to them. Without a panic rat scurrying around in your mind, your point of view will be less jaded and pessimistic. Share your difficulties with her too―let her know that even normal people face challenges in day to day life so she shouldn't feel guilty about being \"weak\". Let her know that if she ever needs an ear to vent to or a shoulder to cry on, you'll be there for her. And hugs. Hugs feel great regardless of if you're mentally ill or not, and because you're girls it will be less weird if you hug in public. Ultimately we want to know that we're not alone and others care about us (doesn't everybody?), so just be the best friend you possibly can―and by the fact that you're coming here asking for tips on how to be more supportive for your friend in distress, you already sound like a great friend. Stay awesome.\n\nIf possible, organize fun activities to do, but never force her to participate. You can slooooowly (over months or even a year) edge her out of her comfort zone and get her to join activities she currently wouldn't. She'll thank you for that. But I say again: *never force her* to do something she doesn't want to. That will just make the anxiety worse and will hurt instead of help.\n\nI'm not sure if girls do this as much, but sharing funny videos/gifs/memes/stuff you found on the Internet to her via instant messaging apps could be helpful. Some of the shit my pals send in our group chat makes me burst out chuckling and gives me a positive boost for a few hours. It's nice to know that retarded, caring friends exist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely what &lt;a href=\"/u/xsakawaka\"&gt;u/xsakawaka&lt;/a&gt; said. Talk to her and be there for her, and find out how her anxiety affects her specifically as it&amp;#39;s different for everyone. Ask her about her difficulties and provide your outlook/solutions to them. Without a panic rat scurrying around in your mind, your point of view will be less jaded and pessimistic. Share your difficulties with her too―let her know that even normal people face challenges in day to day life so she shouldn&amp;#39;t feel guilty about being &amp;quot;weak&amp;quot;. Let her know that if she ever needs an ear to vent to or a shoulder to cry on, you&amp;#39;ll be there for her. And hugs. Hugs feel great regardless of if you&amp;#39;re mentally ill or not, and because you&amp;#39;re girls it will be less weird if you hug in public. Ultimately we want to know that we&amp;#39;re not alone and others care about us (doesn&amp;#39;t everybody?), so just be the best friend you possibly can―and by the fact that you&amp;#39;re coming here asking for tips on how to be more supportive for your friend in distress, you already sound like a great friend. Stay awesome.&lt;/p&gt;\n\n&lt;p&gt;If possible, organize fun activities to do, but never force her to participate. You can slooooowly (over months or even a year) edge her out of her comfort zone and get her to join activities she currently wouldn&amp;#39;t. She&amp;#39;ll thank you for that. But I say again: &lt;em&gt;never force her&lt;/em&gt; to do something she doesn&amp;#39;t want to. That will just make the anxiety worse and will hurt instead of help.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if girls do this as much, but sharing funny videos/gifs/memes/stuff you found on the Internet to her via instant messaging apps could be helpful. Some of the shit my pals send in our group chat makes me burst out chuckling and gives me a positive boost for a few hours. It&amp;#39;s nice to know that retarded, caring friends exist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgcw1kk", "score_hidden": false, "stickied": false, "created": 1492420735.0, "created_utc": 1492391935.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmy71", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "zeusapollo2990", "parent_id": "t1_dgclct2", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "You know, I've been best friends with her for almost 5 years now, and while I've definitely picked up on what does and doesn't help her, I've never actually straight up asked. Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know, I&amp;#39;ve been best friends with her for almost 5 years now, and while I&amp;#39;ve definitely picked up on what does and doesn&amp;#39;t help her, I&amp;#39;ve never actually straight up asked. Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgcmy71", "score_hidden": false, "stickied": false, "created": 1492408469.0, "created_utc": 1492379669.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclct2", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "xsakawaka", "parent_id": "t3_65r2zh", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I imagine it's very different person to person, I would ask her that question. I know it can be awkward but she'll probably appreciate it. If someone asked me \"I want to do the best I can to support you. What are some things I can do for you?\" I would be floored. Generally speaking though, I feel the most supported when someone asks me how I'm doing on a daily basis, then listens without judgement. Also when anxiety attacks come physical contact is the best to calm me down- hair patting or hand holding or just holding in general. However I would caution you against doing this without permission, at least until you known what works for her. Some people I know are the opposite and don't take well to it. But again, everyone is so different so I really encourage you to ask her what would help her the most. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I imagine it&amp;#39;s very different person to person, I would ask her that question. I know it can be awkward but she&amp;#39;ll probably appreciate it. If someone asked me &amp;quot;I want to do the best I can to support you. What are some things I can do for you?&amp;quot; I would be floored. Generally speaking though, I feel the most supported when someone asks me how I&amp;#39;m doing on a daily basis, then listens without judgement. Also when anxiety attacks come physical contact is the best to calm me down- hair patting or hand holding or just holding in general. However I would caution you against doing this without permission, at least until you known what works for her. Some people I know are the opposite and don&amp;#39;t take well to it. But again, everyone is so different so I really encourage you to ask her what would help her the most. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgclct2", "score_hidden": false, "stickied": false, "created": 1492406371.0, "created_utc": 1492377571.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65r2zh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65r2zh", "likes": null, "replies": "", "user_reports": [], "id": "dgd5vtx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zeusapollo2990", "parent_id": "t1_dgd5ec6", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I am a dude on the internet, and I am always down to chitchat over PMs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a dude on the internet, and I am always down to chitchat over PMs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgd5vtx", "score_hidden": false, "stickied": false, "created": 1492435885.0, "created_utc": 1492407085.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd5ec6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jolibean45", "parent_id": "t3_65r2zh", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Who are you, and do you want to be my friend, because damn, just asking this is about 1000% more effort than most of the people in my life have bothered with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who are you, and do you want to be my friend, because damn, just asking this is about 1000% more effort than most of the people in my life have bothered with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgd5ec6", "score_hidden": false, "stickied": false, "created": 1492434913.0, "created_utc": 1492406113.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]