[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My anxiety comes in waves. I do not have large panic attacks or feel a sudden burst of anxiousness. It builds slowly over time, more so when bad events or situations arise in my life. Afterwards it returns to a manageable level that allows me to cope on my own. I have never been medicated for it, though I recently got a &amp;quot;take as needed&amp;quot; medication for those bad days when I need to focus on my work.&lt;/p&gt;\n\n&lt;p&gt;I am able to socialize but, there are a lot of quiet pauses in my conversations because I never know what else to say or how to continue a line of thought. There are few people that understand this &amp;amp; those that do still cannot grasp my full state of being. Talking to these people offers some solace but, only for a short while. I am thankful for their support &amp;amp; understanding. I value that they want me in their lives even with all my faults.&lt;/p&gt;\n\n&lt;p&gt;Being this way doesn&amp;#39;t make me feel less than a person or that I can&amp;#39;t achieve great things. What it does cause me to think is, there is something or someone better than me. I am afraid one day my friends, family or (if I have one at the time) an SO will discover this &amp;amp; I&amp;#39;ll be left with nothing. This worry makes me act irrational, be jealous &amp;amp; make decisions to do things that I know I shouldn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;My anxiety affects me in very non-obvious ways to the outside world. It is my internal struggle that I hide &amp;amp; conduct battle with on a regular basis. This is me telling it I can do everything it tells me not to do, that I am a great addition to anyone&amp;#39;s life &amp;amp; I am okay with who I am. My illness does not define me as a person, it only fuels the fire to reach out for more challenges.&lt;/p&gt;\n\n&lt;p&gt;Slowly but, surely I will overcome what I have been dealt. Nothing stands in my way of progress &amp;amp; I will create a life that makes me happy. I know all of you here understand in one way or another how I feel everyday. You may feel defeated some days &amp;amp; awake on others just fine. I want you to know that I know how you feel &amp;amp; you are not alone. Just as I am, you will unsheathe your weapon, don your helm &amp;amp; charge this beast head on with all the courage &amp;amp; fire you can muster. &lt;/p&gt;\n\n&lt;p&gt;Do not let anxiety be your defining factor because I know I won&amp;#39;t let it be mine.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My anxiety comes in waves. I do not have large panic attacks or feel a sudden burst of anxiousness. It builds slowly over time, more so when bad events or situations arise in my life. Afterwards it returns to a manageable level that allows me to cope on my own. I have never been medicated for it, though I recently got a \"take as needed\" medication for those bad days when I need to focus on my work.\n\nI am able to socialize but, there are a lot of quiet pauses in my conversations because I never know what else to say or how to continue a line of thought. There are few people that understand this &amp; those that do still cannot grasp my full state of being. Talking to these people offers some solace but, only for a short while. I am thankful for their support &amp; understanding. I value that they want me in their lives even with all my faults.\n\nBeing this way doesn't make me feel less than a person or that I can't achieve great things. What it does cause me to think is, there is something or someone better than me. I am afraid one day my friends, family or (if I have one at the time) an SO will discover this &amp; I'll be left with nothing. This worry makes me act irrational, be jealous &amp; make decisions to do things that I know I shouldn't.\n\nMy anxiety affects me in very non-obvious ways to the outside world. It is my internal struggle that I hide &amp; conduct battle with on a regular basis. This is me telling it I can do everything it tells me not to do, that I am a great addition to anyone's life &amp; I am okay with who I am. My illness does not define me as a person, it only fuels the fire to reach out for more challenges.\n\nSlowly but, surely I will overcome what I have been dealt. Nothing stands in my way of progress &amp; I will create a life that makes me happy. I know all of you here understand in one way or another how I feel everyday. You may feel defeated some days &amp; awake on others just fine. I want you to know that I know how you feel &amp; you are not alone. Just as I am, you will unsheathe your weapon, don your helm &amp; charge this beast head on with all the courage &amp; fire you can muster. \n\nDo not let anxiety be your defining factor because I know I won't let it be mine.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65siyp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "painlessazeroth", "saved": false, "mod_reports": [], "name": "t3_65siyp", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": 1492400193.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/65siyp/it_does_not_define_me/", "num_reports": null, "locked": false, "stickied": false, "created": 1492418997.0, "url": "https://www.reddit.com/r/Anxiety/comments/65siyp/it_does_not_define_me/", "author_flair_text": null, "quarantine": false, "title": "it does Not Define me", "created_utc": 1492390197.0, "distinguished": null, "media": null, "upvote_ratio": 0.8, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]