[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Anxiety", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like, actually stupid. Unintelligent. I cannot tell if it is because of my anxiety, depression, or if I&amp;#39;m truly just not a smart person. I try to avoid conversation with anyone at all times, I don&amp;#39;t like talking with people because I get nervous about the things I&amp;#39;m saying. Everything in my head seems well thought out, until it comes out of my mouth and it sounds like garage. I don&amp;#39;t have knowledge about a lot of things I think I should have knowledge about. I&amp;#39;ve bullshitted through basically everything my entire life. &lt;/p&gt;\n\n&lt;p&gt;Some things I say don&amp;#39;t make sense. I forget ALL THE TIME. My friends and family have to repeat certain things to me constantly because i have a hard time remembering a lot of things. Much of anything I&amp;#39;m told goes through one ear and out the other, because there&amp;#39;s so much going on inside my head, I can&amp;#39;t keep track of what someone is saying to me + what I want to say/respond with. I find myself confused a lot but I play it off like I&amp;#39;m not and just go with most things without really understanding and knowing what I&amp;#39;m going with. For example, even this post, I&amp;#39;m not sure it makes sense. I hope it does. Anyone else have this problem? Or understand what I&amp;#39;m talking about? Thank you very much ahead of time, much appreciated. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Like, actually stupid. Unintelligent. I cannot tell if it is because of my anxiety, depression, or if I'm truly just not a smart person. I try to avoid conversation with anyone at all times, I don't like talking with people because I get nervous about the things I'm saying. Everything in my head seems well thought out, until it comes out of my mouth and it sounds like garage. I don't have knowledge about a lot of things I think I should have knowledge about. I've bullshitted through basically everything my entire life. \n\nSome things I say don't make sense. I forget ALL THE TIME. My friends and family have to repeat certain things to me constantly because i have a hard time remembering a lot of things. Much of anything I'm told goes through one ear and out the other, because there's so much going on inside my head, I can't keep track of what someone is saying to me + what I want to say/respond with. I find myself confused a lot but I play it off like I'm not and just go with most things without really understanding and knowing what I'm going with. For example, even this post, I'm not sure it makes sense. I hope it does. Anyone else have this problem? Or understand what I'm talking about? Thank you very much ahead of time, much appreciated. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zmj5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "miaelliott", "saved": false, "mod_reports": [], "name": "t3_65zmj5", "subreddit_name_prefixed": "r/Anxiety", "approved_by": null, "over_18": false, "domain": "self.Anxiety", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmij", "edited": 1492477216.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Anxiety/comments/65zmj5/i_think_im_stupid/", "num_reports": null, "locked": false, "stickied": false, "created": 1492505394.0, "url": "https://www.reddit.com/r/Anxiety/comments/65zmj5/i_think_im_stupid/", "author_flair_text": null, "quarantine": false, "title": "I think I'm stupid.", "created_utc": 1492476594.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65zmj5", "likes": null, "replies": "", "user_reports": [], "id": "dgegsm2", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "gemsineyes", "parent_id": "t3_65zmj5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I feel this way all the time. I forget everything and feel like my vocabulary is terrible and I don't know anything and can barely function but people insist I'm smart. I understand things but I feel like I can't express them eloquently.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel this way all the time. I forget everything and feel like my vocabulary is terrible and I don&amp;#39;t know anything and can barely function but people insist I&amp;#39;m smart. I understand things but I feel like I can&amp;#39;t express them eloquently.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgegsm2", "score_hidden": false, "stickied": false, "created": 1492507580.0, "created_utc": 1492478780.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65zmj5", "likes": null, "replies": "", "user_reports": [], "id": "dgeh4ng", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "perasleeps", "parent_id": "t3_65zmj5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I know I am stupid. Relatively speaking, for all the reasons you listed above and more. I have trouble reading and filling in the most basic forms. I catch barely a third of what gets said. It didn't use to be this way. I have ancient memories of sparkling wit and popularity haha.  \n\nBut you know it's really okay. Having trouble with this stuff makes life a bit harder but you are still a human being deserving of compassion and respect. Learning this helped me separate my frustration from my self esteem. I struggle and try to make things easier in my life, but it has nothing to do with my anxiety now. \n\nAlso yeah I was totally into bullshitting my way through stuff the moment the illness caught up with me, but in the end I found it's better to be honest about things, and let the nice people find me and help me.  Sure there will be those who take the chance to hurt you, but it's worth it to find the good ones.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know I am stupid. Relatively speaking, for all the reasons you listed above and more. I have trouble reading and filling in the most basic forms. I catch barely a third of what gets said. It didn&amp;#39;t use to be this way. I have ancient memories of sparkling wit and popularity haha.  &lt;/p&gt;\n\n&lt;p&gt;But you know it&amp;#39;s really okay. Having trouble with this stuff makes life a bit harder but you are still a human being deserving of compassion and respect. Learning this helped me separate my frustration from my self esteem. I struggle and try to make things easier in my life, but it has nothing to do with my anxiety now. &lt;/p&gt;\n\n&lt;p&gt;Also yeah I was totally into bullshitting my way through stuff the moment the illness caught up with me, but in the end I found it&amp;#39;s better to be honest about things, and let the nice people find me and help me.  Sure there will be those who take the chance to hurt you, but it&amp;#39;s worth it to find the good ones.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgeh4ng", "score_hidden": false, "stickied": false, "created": 1492508002.0, "created_utc": 1492479202.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65zmj5", "likes": null, "replies": "", "user_reports": [], "id": "dgegcuj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MaksedRabbit", "parent_id": "t3_65zmj5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Sometimes I tell those people: \"sorry I didnt get anything you told me in the past minute or two, would you care to repeat yourself?\"\n\nYou are stressed, anxious and worried, your head is going at a thousand miles an hour. It's normal to have difficulty to concentrate on other things, it doesnt make you stupid. On the contrary, you're intellignet enough to be able to see those symptoms and know it's not ike you would act usually.\n\nAs for knowledge, you would be amazed at the amount of people who talk and knows jack shit about what they talk about. My father complain about misinformation in the media when they talk about his work saying: \"he doenst know what he's talking about, that's not true\" for other people thye will listen to the report and think : \"ooo that's true\" I mean, everything is relative, we all bullshit ;)\n\nThe best orators practiced alot, in ancient times oratory skills were considered an art. Think about Julius Ceasar, Caton, Ciceron. They practiced all their lives to bullshit!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes I tell those people: &amp;quot;sorry I didnt get anything you told me in the past minute or two, would you care to repeat yourself?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You are stressed, anxious and worried, your head is going at a thousand miles an hour. It&amp;#39;s normal to have difficulty to concentrate on other things, it doesnt make you stupid. On the contrary, you&amp;#39;re intellignet enough to be able to see those symptoms and know it&amp;#39;s not ike you would act usually.&lt;/p&gt;\n\n&lt;p&gt;As for knowledge, you would be amazed at the amount of people who talk and knows jack shit about what they talk about. My father complain about misinformation in the media when they talk about his work saying: &amp;quot;he doenst know what he&amp;#39;s talking about, that&amp;#39;s not true&amp;quot; for other people thye will listen to the report and think : &amp;quot;ooo that&amp;#39;s true&amp;quot; I mean, everything is relative, we all bullshit ;)&lt;/p&gt;\n\n&lt;p&gt;The best orators practiced alot, in ancient times oratory skills were considered an art. Think about Julius Ceasar, Caton, Ciceron. They practiced all their lives to bullshit!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgegcuj", "score_hidden": false, "stickied": false, "created": 1492507026.0, "created_utc": 1492478226.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65zmj5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65zmj5", "likes": null, "replies": "", "user_reports": [], "id": "dgen7t7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nullifier69", "parent_id": "t1_dgemygj", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I wish God was real as of right now. Maybe he could help. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish God was real as of right now. Maybe he could help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgen7t7", "score_hidden": false, "stickied": false, "created": 1492515578.0, "created_utc": 1492486778.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemygj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Nullifier69", "parent_id": "t3_65zmj5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I remember being witty and agile when I arrived here in America back when I was 7-8 year old. I didn't care much about education or knowing stuff back when I was in the 5-8th grade. I was your average stupid misfit. Right now I'm 16, in the eleventh grade.  I want to learn stuff but I'm afraid my situation is much similar to yours. I have had really shitty day today. I did poorly in the the practice SAT. Few people that I know found out that I did poorly on the SAT, despite me making conscious effort in trying to hide it.  Among those people were  two in particular that called me out for being stupid. In addition to anxiety and depression, I also have low-self esteem. So it's been a very depressing  day today. I'm really in a deep pit. Never thought I would be one of those people that thinks of suicide but it's very hard not to think about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember being witty and agile when I arrived here in America back when I was 7-8 year old. I didn&amp;#39;t care much about education or knowing stuff back when I was in the 5-8th grade. I was your average stupid misfit. Right now I&amp;#39;m 16, in the eleventh grade.  I want to learn stuff but I&amp;#39;m afraid my situation is much similar to yours. I have had really shitty day today. I did poorly in the the practice SAT. Few people that I know found out that I did poorly on the SAT, despite me making conscious effort in trying to hide it.  Among those people were  two in particular that called me out for being stupid. In addition to anxiety and depression, I also have low-self esteem. So it&amp;#39;s been a very depressing  day today. I&amp;#39;m really in a deep pit. Never thought I would be one of those people that thinks of suicide but it&amp;#39;s very hard not to think about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgemygj", "score_hidden": false, "stickied": false, "created": 1492515203.0, "created_utc": 1492486403.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65zmj5", "likes": null, "replies": "", "user_reports": [], "id": "dgei98q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aguyfrominternet", "parent_id": "t3_65zmj5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I'm just like this. Maybe our minds are full of thoughts and worries we forget about and ignore other things. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m just like this. Maybe our minds are full of thoughts and worries we forget about and ignore other things. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgei98q", "score_hidden": false, "stickied": false, "created": 1492509358.0, "created_utc": 1492480558.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65zmj5", "likes": null, "replies": "", "user_reports": [], "id": "dgeksmy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Coconutwarrior08", "parent_id": "t3_65zmj5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "By definition stupidity is relative to a situation. For example. A lawyer. University educated leaning high levels of theory in diverse fields both in academic and emotional intelligence. Critical thinking, analysis, communication skills and so on. \n\nAn electrician. Technically trained to apply theory and practical applications to problems to find solutions. Hands on with physical objects, client and business management skills, physically able and active.\n\nCan the electrician adhere to Commonwealth legislation while prosecuting a criminal in the court of law while effectively representing their client with confidence? \n\nCan the lawyer weld ends of cables together while not burning himself or destroying equipment? Or install a sub station providing the constant stream of electricity society uses to heal people, advance human efforts to creating a productive society that doesn't have to worry about hunting to feed ourselves? \n\nFriend. You are not stupid. You must define this life for yourself so you can make your own individual choices. You are not a lamb waiting for the wolf. Your a human!! \n\nImparting my final gifts upon you I would urge you to consider reading. No rules.\n\nAvoid people who insists on telling you who you are and what you have to do. \n\nDance. \n\nLearn to eat nutritious food that will level up your body, mind and spirit.\n\nBe honest and communicate with those you care about, nurture your relationships.\n\nUse Wikipedia as your ultimate reference tool. \n\nCritical thinking, bias checks. Quantum computing, emotional intelligence, self awareness, finance, exercise, yoga, meditation. A few more for you. \n\nDude, life is like gravy. Delicious meaty aromas    that keep you coming back for more. Own it. \n\nI wish you well friend. 😁\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;By definition stupidity is relative to a situation. For example. A lawyer. University educated leaning high levels of theory in diverse fields both in academic and emotional intelligence. Critical thinking, analysis, communication skills and so on. &lt;/p&gt;\n\n&lt;p&gt;An electrician. Technically trained to apply theory and practical applications to problems to find solutions. Hands on with physical objects, client and business management skills, physically able and active.&lt;/p&gt;\n\n&lt;p&gt;Can the electrician adhere to Commonwealth legislation while prosecuting a criminal in the court of law while effectively representing their client with confidence? &lt;/p&gt;\n\n&lt;p&gt;Can the lawyer weld ends of cables together while not burning himself or destroying equipment? Or install a sub station providing the constant stream of electricity society uses to heal people, advance human efforts to creating a productive society that doesn&amp;#39;t have to worry about hunting to feed ourselves? &lt;/p&gt;\n\n&lt;p&gt;Friend. You are not stupid. You must define this life for yourself so you can make your own individual choices. You are not a lamb waiting for the wolf. Your a human!! &lt;/p&gt;\n\n&lt;p&gt;Imparting my final gifts upon you I would urge you to consider reading. No rules.&lt;/p&gt;\n\n&lt;p&gt;Avoid people who insists on telling you who you are and what you have to do. &lt;/p&gt;\n\n&lt;p&gt;Dance. &lt;/p&gt;\n\n&lt;p&gt;Learn to eat nutritious food that will level up your body, mind and spirit.&lt;/p&gt;\n\n&lt;p&gt;Be honest and communicate with those you care about, nurture your relationships.&lt;/p&gt;\n\n&lt;p&gt;Use Wikipedia as your ultimate reference tool. &lt;/p&gt;\n\n&lt;p&gt;Critical thinking, bias checks. Quantum computing, emotional intelligence, self awareness, finance, exercise, yoga, meditation. A few more for you. &lt;/p&gt;\n\n&lt;p&gt;Dude, life is like gravy. Delicious meaty aromas    that keep you coming back for more. Own it. &lt;/p&gt;\n\n&lt;p&gt;I wish you well friend. 😁&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgeksmy", "score_hidden": false, "stickied": false, "created": 1492512379.0, "created_utc": 1492483579.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65zmj5", "likes": null, "replies": "", "user_reports": [], "id": "dgekvzc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sirmoochalot", "parent_id": "t3_65zmj5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "I feel this way too at times. Anxiety clouds my mind making it extremely difficult to follow conversation, speak eloquently, and remember things. The way I see it is I'm able to function relatively normal while facing these issues. It puts me and us feeling this way at a handicap but when we operate at the same level as others doesn't that technically mean we're operating even higher to be able to work through such fog and angst all the time? That's how I like to see it at least", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel this way too at times. Anxiety clouds my mind making it extremely difficult to follow conversation, speak eloquently, and remember things. The way I see it is I&amp;#39;m able to function relatively normal while facing these issues. It puts me and us feeling this way at a handicap but when we operate at the same level as others doesn&amp;#39;t that technically mean we&amp;#39;re operating even higher to be able to work through such fog and angst all the time? That&amp;#39;s how I like to see it at least&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgekvzc", "score_hidden": false, "stickied": false, "created": 1492512489.0, "created_utc": 1492483689.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65zmj5", "likes": null, "replies": "", "user_reports": [], "id": "dgen7et", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "maraudingoctopuspot", "parent_id": "t3_65zmj5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Yes, I have all the same feelings and problems. I think that they are things that everybody experiences from time to time but they should not disrupt your life. If your situation is anything like mine, then the first step is to find the source of the anxiety. These thoughts and feelings could only be symptoms of the real problem, not the problem themselves. what worked for me was beginning with smoking weed, it made my anxiety SO BAD and SO RAW at times that I got to the source of the problem involuntarily. It has been a big breakthrough but rest assured there are other ways to find the source of the problem- a therapist for example might be gentler and probably cheaper :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I have all the same feelings and problems. I think that they are things that everybody experiences from time to time but they should not disrupt your life. If your situation is anything like mine, then the first step is to find the source of the anxiety. These thoughts and feelings could only be symptoms of the real problem, not the problem themselves. what worked for me was beginning with smoking weed, it made my anxiety SO BAD and SO RAW at times that I got to the source of the problem involuntarily. It has been a big breakthrough but rest assured there are other ways to find the source of the problem- a therapist for example might be gentler and probably cheaper :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgen7et", "score_hidden": false, "stickied": false, "created": 1492515562.0, "created_utc": 1492486762.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmij", "removal_reason": null, "link_id": "t3_65zmj5", "likes": null, "replies": "", "user_reports": [], "id": "dgeoh9e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Miett", "parent_id": "t3_65zmj5", "subreddit_name_prefixed": "r/Anxiety", "controversiality": 0, "body": "Your post made sense.  You're okay.  \n\nThis sounds so familiar.  Sometimes it's hard for your brain to parse everything because you're processing so *much* all the time.  Stupidity involves having no thoughts and not giving things consideration--what's going on in your head is exactly the opposite.  \n\nYou're not stupid. You just have a brain that doesn't have a filter to narrow the world down so you can concentrate.  That's what anxiety does--it opens the floodgates and everything pours in to overwhelm you.  \n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your post made sense.  You&amp;#39;re okay.  &lt;/p&gt;\n\n&lt;p&gt;This sounds so familiar.  Sometimes it&amp;#39;s hard for your brain to parse everything because you&amp;#39;re processing so &lt;em&gt;much&lt;/em&gt; all the time.  Stupidity involves having no thoughts and not giving things consideration--what&amp;#39;s going on in your head is exactly the opposite.  &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re not stupid. You just have a brain that doesn&amp;#39;t have a filter to narrow the world down so you can concentrate.  That&amp;#39;s what anxiety does--it opens the floodgates and everything pours in to overwhelm you.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Anxiety", "name": "t1_dgeoh9e", "score_hidden": false, "stickied": false, "created": 1492517437.0, "created_utc": 1492488637.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]