[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "xxfitness", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just like the title says- I&amp;#39;m curious about the fellow fit, trying to be fit, and interested in fitness moms out there like me. While I have some of the same goals (like lift heavy things, look smoking in a bikini, have nice guns, be healthy) some of my goals are more mom related or impacted. This is due to time constraints, being reasonable, simple facts of life and logistics and some of them are directly related to little eyes watching me. I work 45-60 hours a week in a professional job, my husband works a similar amount of hours and we have school aged very busy kids. I have accepted (or am trying very hard to)that I will always have a little pooch where the 5th and 6th ab should be but will rock my 4 pack and I want the kids to see me confident and happy in the skin I&amp;#39;m in, and work out because I love my body not because I want improve it (I don&amp;#39;t always think this but I try super hard to keep that in mind and for them to see that). I track my macros and prep my food and eat my veggies and protein most of the time, but life gets in the way pretty regularly and I think it&amp;#39;s important to eat cake sometimes with your lean protein and veggies without feeling guilty, especially when it&amp;#39;s a treat. I want to be strong and be able to lift that bag of dog food, or do that pull-up so they see traditional strength biases are BS. I want to be able to play their sports with them for hours and be active. I want them to see effective means of stress management.....&lt;/p&gt;\n\n&lt;p&gt;In short I&amp;#39;m done comparing myself to others at different stages of their life journey with different goals and while I&amp;#39;m proud of what my fellow ladies are accomplishing around me regardless of what their circumstances are, I am going to focus on why I like fitness and how it contributes to my overall goal of happiness for my family and I. I am done beating myself up for slip ups and not being able to always achieve what others can. I wanted to hear stories about other ladies who have similar (or maybe very different) experiences.&lt;/p&gt;\n\n&lt;p&gt;Edit: just for clarification; while my husband has given me good reviews on how I look in a bikini I&amp;#39;m far from what most would consider &amp;quot;smokin&amp;quot;. I fall more in the- does not terrify/embarrass my children(too much)  range. 🙃&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just like the title says- I'm curious about the fellow fit, trying to be fit, and interested in fitness moms out there like me. While I have some of the same goals (like lift heavy things, look smoking in a bikini, have nice guns, be healthy) some of my goals are more mom related or impacted. This is due to time constraints, being reasonable, simple facts of life and logistics and some of them are directly related to little eyes watching me. I work 45-60 hours a week in a professional job, my husband works a similar amount of hours and we have school aged very busy kids. I have accepted (or am trying very hard to)that I will always have a little pooch where the 5th and 6th ab should be but will rock my 4 pack and I want the kids to see me confident and happy in the skin I'm in, and work out because I love my body not because I want improve it (I don't always think this but I try super hard to keep that in mind and for them to see that). I track my macros and prep my food and eat my veggies and protein most of the time, but life gets in the way pretty regularly and I think it's important to eat cake sometimes with your lean protein and veggies without feeling guilty, especially when it's a treat. I want to be strong and be able to lift that bag of dog food, or do that pull-up so they see traditional strength biases are BS. I want to be able to play their sports with them for hours and be active. I want them to see effective means of stress management.....\n\nIn short I'm done comparing myself to others at different stages of their life journey with different goals and while I'm proud of what my fellow ladies are accomplishing around me regardless of what their circumstances are, I am going to focus on why I like fitness and how it contributes to my overall goal of happiness for my family and I. I am done beating myself up for slip ups and not being able to always achieve what others can. I wanted to hear stories about other ladies who have similar (or maybe very different) experiences.\n\nEdit: just for clarification; while my husband has given me good reviews on how I look in a bikini I'm far from what most would consider \"smokin\". I fall more in the- does not terrify/embarrass my children(too much)  range. 🙃", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64twmi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "Flamingosaur", "saved": false, "mod_reports": [], "name": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "approved_by": null, "over_18": false, "domain": "self.xxfitness", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ryzy", "edited": 1491958285.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/xxfitness/comments/64twmi/fellow_moms_of_xxfitness_what_is_your_mom_fitness/", "num_reports": null, "locked": false, "stickied": false, "created": 1491975345.0, "url": "https://www.reddit.com/r/xxfitness/comments/64twmi/fellow_moms_of_xxfitness_what_is_your_mom_fitness/", "author_flair_text": null, "quarantine": false, "title": "Fellow moms of XXfitness: what is your Mom fitness goals? Do they differ from traditional goals, or are they mostly the same?", "created_utc": 1491946545.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": "", "user_reports": [], "id": "dg53yv4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Flamingosaur", "parent_id": "t1_dg51b8q", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Being at a gym with childcare was a game changer for me when I was first starting out. I don't think I could have ever found my groove without it. \n\nThat's awesome that you have a farmers market available to you! I'd be all over that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Being at a gym with childcare was a game changer for me when I was first starting out. I don&amp;#39;t think I could have ever found my groove without it. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s awesome that you have a farmers market available to you! I&amp;#39;d be all over that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg53yv4", "score_hidden": false, "stickied": false, "created": 1491982025.0, "created_utc": 1491953225.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg51b8q", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "sleepsonrocks", "parent_id": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I don't post here, but I have been reading religiously recently so I'll bite. Prior to having kids I spent most of my free time doing a variety of outdoor sports that enabled me to keep my body in pretty darn good shape. I'll be honest, I hated the gym. I've recently started working out again because, lets face it, with two kids, my ability to spend large amounts of time in the outdoors doing big things has greatly decreased. My goal is to get in better shape so that I don't feel so crappy about my body and to help get more energized so that I can get outside with the whole family and do the things I used to with them, even if its less intense and for shorter periods of time than I used to. \n\nRight now I'm basically doing a home workout routine and adding back in 1-2 gym climbing days with the goal of getting a membership and starting to lift there since they have childcare. I'm not really watching what I'm eating, but whenever I start working out more I always eat more whole foods anyway, and plus it's farmers market season here so my diet will improve anyway. \n\nAdditionally and on the more superficial side of things,  I used to feel really comfortable in a tiny bikini (like, I  never owned a non tiny bikini, except for my lap swimming suit) and take my kids to the pool so much that I'd really love to not have to wear a tankini to cover up my loose stomach and hips to feel comfortable when I go swimming.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t post here, but I have been reading religiously recently so I&amp;#39;ll bite. Prior to having kids I spent most of my free time doing a variety of outdoor sports that enabled me to keep my body in pretty darn good shape. I&amp;#39;ll be honest, I hated the gym. I&amp;#39;ve recently started working out again because, lets face it, with two kids, my ability to spend large amounts of time in the outdoors doing big things has greatly decreased. My goal is to get in better shape so that I don&amp;#39;t feel so crappy about my body and to help get more energized so that I can get outside with the whole family and do the things I used to with them, even if its less intense and for shorter periods of time than I used to. &lt;/p&gt;\n\n&lt;p&gt;Right now I&amp;#39;m basically doing a home workout routine and adding back in 1-2 gym climbing days with the goal of getting a membership and starting to lift there since they have childcare. I&amp;#39;m not really watching what I&amp;#39;m eating, but whenever I start working out more I always eat more whole foods anyway, and plus it&amp;#39;s farmers market season here so my diet will improve anyway. &lt;/p&gt;\n\n&lt;p&gt;Additionally and on the more superficial side of things,  I used to feel really comfortable in a tiny bikini (like, I  never owned a non tiny bikini, except for my lap swimming suit) and take my kids to the pool so much that I&amp;#39;d really love to not have to wear a tankini to cover up my loose stomach and hips to feel comfortable when I go swimming.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg51b8q", "score_hidden": false, "stickied": false, "created": 1491978509.0, "created_utc": 1491949709.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": "", "user_reports": [], "id": "dg530fm", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Louisville40203", "parent_id": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "My goals are to live a long time with max function, feel and look good. I am finishing a graduate program that included a lot of clinical hours, and I also work, and have 3 busy elementary/middle /high school kids. My husband also works, is in school, and we both do volunteer stuff on the side. I don't think my goals are impacted at all by my kids except my goals for THEM to be fit, strong, and healthy. I drag my older kids to the gym with me and they all swim and run. I am lucky in that pregnancy and breastfeeding did not cause any visible changes to my body and I think I look better than I ever have. I'm glad I got in shape and my kids have us as role models.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My goals are to live a long time with max function, feel and look good. I am finishing a graduate program that included a lot of clinical hours, and I also work, and have 3 busy elementary/middle /high school kids. My husband also works, is in school, and we both do volunteer stuff on the side. I don&amp;#39;t think my goals are impacted at all by my kids except my goals for THEM to be fit, strong, and healthy. I drag my older kids to the gym with me and they all swim and run. I am lucky in that pregnancy and breastfeeding did not cause any visible changes to my body and I think I look better than I ever have. I&amp;#39;m glad I got in shape and my kids have us as role models.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg530fm", "score_hidden": false, "stickied": false, "created": 1491980720.0, "created_utc": 1491951920.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": "", "user_reports": [], "id": "dg58lqw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "SoulSalvager", "parent_id": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I'm honestly not interested in fitting into size-whatever jeans anymore. I have 2 girls, and I know what it's like to not feel comfortable in my own body. I want to be strong (not like Arnold, but enough to handle myself), have endurance, and just be a good role model for them. I don't want them to hate their bodies because their thighs touch or their stomach is a little flabby. So I don't weigh myself or talk disparagingly about my own body. \n\nMy 4 year old is already impressed by how strong I am (brought in a 55lbs bag of dog food in all by myself!) and she wants to be strong too ❤ ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m honestly not interested in fitting into size-whatever jeans anymore. I have 2 girls, and I know what it&amp;#39;s like to not feel comfortable in my own body. I want to be strong (not like Arnold, but enough to handle myself), have endurance, and just be a good role model for them. I don&amp;#39;t want them to hate their bodies because their thighs touch or their stomach is a little flabby. So I don&amp;#39;t weigh myself or talk disparagingly about my own body. &lt;/p&gt;\n\n&lt;p&gt;My 4 year old is already impressed by how strong I am (brought in a 55lbs bag of dog food in all by myself!) and she wants to be strong too ❤ &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg58lqw", "score_hidden": false, "stickied": false, "created": 1491988186.0, "created_utc": 1491959386.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": "", "user_reports": [], "id": "dg54qiz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flamingosaur", "parent_id": "t1_dg536hi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Yes! I love learning new things and skills in the gym or when I'm lifting. I feel like I've unlocked an accomplishment in a video game and it's so fun! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes! I love learning new things and skills in the gym or when I&amp;#39;m lifting. I feel like I&amp;#39;ve unlocked an accomplishment in a video game and it&amp;#39;s so fun! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg54qiz", "score_hidden": false, "stickied": false, "created": 1491983063.0, "created_utc": 1491954263.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg536hi", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MaireduFromage", "parent_id": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Honestly, my mom-oriented fitness goal is to show my kid and little sister that exercising can be a way to reach really fun goals. \n\nRight now I'm on the r/bodyweightfitness recommended routine after lifting heavy for a year and a half. I've always wanted to learn some calisthenics stuffs and it looks really fun. Prior to exercising regularly at the gym, I always saw exercise as a pain-in-the-ass and a way to \"get skinnier\", and I never thought that it was actually a great way to learn skills. \n\nMy mom was always a huge influence on me when it came to the gym, she used to run frequently and lift regularly as well. However, she also has body-image issues and would spread them on to me while I was growing up by commenting on how big my thighs were (among other things). I'm seeing that she's starting to do the same thing to my kid sister (who just turned 10 ffs), and I want to prevent that as much as possible. Exercise isn't just a tool to slim down, it's enjoyable as fuck. If I had known that when I was younger I wouldn't have felt as guilty not trying to slim down. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, my mom-oriented fitness goal is to show my kid and little sister that exercising can be a way to reach really fun goals. &lt;/p&gt;\n\n&lt;p&gt;Right now I&amp;#39;m on the &lt;a href=\"/r/bodyweightfitness\"&gt;r/bodyweightfitness&lt;/a&gt; recommended routine after lifting heavy for a year and a half. I&amp;#39;ve always wanted to learn some calisthenics stuffs and it looks really fun. Prior to exercising regularly at the gym, I always saw exercise as a pain-in-the-ass and a way to &amp;quot;get skinnier&amp;quot;, and I never thought that it was actually a great way to learn skills. &lt;/p&gt;\n\n&lt;p&gt;My mom was always a huge influence on me when it came to the gym, she used to run frequently and lift regularly as well. However, she also has body-image issues and would spread them on to me while I was growing up by commenting on how big my thighs were (among other things). I&amp;#39;m seeing that she&amp;#39;s starting to do the same thing to my kid sister (who just turned 10 ffs), and I want to prevent that as much as possible. Exercise isn&amp;#39;t just a tool to slim down, it&amp;#39;s enjoyable as fuck. If I had known that when I was younger I wouldn&amp;#39;t have felt as guilty not trying to slim down. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg536hi", "score_hidden": false, "stickied": false, "created": 1491980949.0, "created_utc": 1491952149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": "", "user_reports": [], "id": "dg5i1kc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flamingosaur", "parent_id": "t1_dg59oji", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Whoa go you!!! I thought I was at my wits end with 2! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whoa go you!!! I thought I was at my wits end with 2! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5i1kc", "score_hidden": false, "stickied": false, "created": 1492002189.0, "created_utc": 1491973389.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg59oji", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "theMthrship", "parent_id": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I'm a mom of 6. My youngest two are twins (shock of a lifetime). That pregnancy pretty much permanently altered my body in a way the previous 4 had not. So I definitely don't work out to achieve a certain body type, although I do reap the benefits of staying in shape. I've always been tall and slender but didn't get into fitness until after the birth of my second child. I lift and cycle because I genuinely enjoy those activities. They (and reading) are my hobbies. Getting stronger and challenging myself is so much fun.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a mom of 6. My youngest two are twins (shock of a lifetime). That pregnancy pretty much permanently altered my body in a way the previous 4 had not. So I definitely don&amp;#39;t work out to achieve a certain body type, although I do reap the benefits of staying in shape. I&amp;#39;ve always been tall and slender but didn&amp;#39;t get into fitness until after the birth of my second child. I lift and cycle because I genuinely enjoy those activities. They (and reading) are my hobbies. Getting stronger and challenging myself is so much fun.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg59oji", "score_hidden": false, "stickied": false, "created": 1491989556.0, "created_utc": 1491960756.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": "", "user_reports": [], "id": "dg5i0bj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flamingosaur", "parent_id": "t1_dg5gmos", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Just subscribed! I had no idea it existed. Thank you! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just subscribed! I had no idea it existed. Thank you! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5i0bj", "score_hidden": false, "stickied": false, "created": 1492002123.0, "created_utc": 1491973323.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gmos", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NattieLight", "parent_id": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Plug for /r/FitMama!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plug for &lt;a href=\"/r/FitMama\"&gt;/r/FitMama&lt;/a&gt;!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5gmos", "score_hidden": false, "stickied": false, "created": 1491999624.0, "created_utc": 1491970824.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": "", "user_reports": [], "id": "dg5s02f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "snowsilk", "parent_id": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "My daughter has really inspired me to get healthy. \n\n1) I want to be healthy and fit enough to enjoy a long life with her, where I'm not constrained by my physical fitness. I want to take her surfing, horseback riding, whitewater rafting... there're so many adventures I don't  want to miss out on\n\n2) I want to make exercise a part of our lives. It wasn't for me growing up and it's been really tough to get myself used to exercising!\n\n3) I want to show her that it's important to retain your sense of self and look after yourself. To me, exercise is self care. \n\n4) I want to role model healthy body image. I grew up surrounded by female relatives obsessed about weight and who would project that onto all the young girls. I was told I was 'fat' (when I was underweight according to my BMI...) from the time I was 12. It took a long time to stop my negative self talk and this is still a work in progress. \n\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My daughter has really inspired me to get healthy. &lt;/p&gt;\n\n&lt;p&gt;1) I want to be healthy and fit enough to enjoy a long life with her, where I&amp;#39;m not constrained by my physical fitness. I want to take her surfing, horseback riding, whitewater rafting... there&amp;#39;re so many adventures I don&amp;#39;t  want to miss out on&lt;/p&gt;\n\n&lt;p&gt;2) I want to make exercise a part of our lives. It wasn&amp;#39;t for me growing up and it&amp;#39;s been really tough to get myself used to exercising!&lt;/p&gt;\n\n&lt;p&gt;3) I want to show her that it&amp;#39;s important to retain your sense of self and look after yourself. To me, exercise is self care. &lt;/p&gt;\n\n&lt;p&gt;4) I want to role model healthy body image. I grew up surrounded by female relatives obsessed about weight and who would project that onto all the young girls. I was told I was &amp;#39;fat&amp;#39; (when I was underweight according to my BMI...) from the time I was 12. It took a long time to stop my negative self talk and this is still a work in progress. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5s02f", "score_hidden": false, "stickied": false, "created": 1492028040.0, "created_utc": 1491999240.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": "", "user_reports": [], "id": "dg5zyuu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "noisette84", "parent_id": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I have had a majorly transitional year... honestly my main motivation was my divorce and the fallout. I had my first child at 19, got married at 21, and threw myself fully into marriage and raising kids. I have two kids... gained quite a bit of weight bouncing back and forth between birth control methods and my pregnancies. Was not happy about how I looked, but too drained with work, familial obligations, and college to do anything about it. My ex is a Marine, so the gym made me feel a little anxious and stupid. I always created reasons not to go with him to the gym because he was in much better shape than I was.\n\n\nIt sucks to be sitting on the couch alone, while your kids are at their dads, and realize you've lost 1) your family and 2) your sense of self. It was a really pitiful moment where I realized I still was not doing anything for ME, when I used to have tons of friends, hobbies, and interests. I realized I needed to start taking care of myself again if I ever wanted to be happy. I got tired of it. I found a good friend to go with and built the time into my schedule.\n\nMy motivation to keep going is my kids. I want them to know that you don't have to stop or slow down your life for anyone. I want them to see me happy and know that I will make damn sure I can keep up with them. I want to be a good role model, basically, and show that sometimes it's okay to put yourself first so you can better care for the big and important things in your life. On top of that, I feel awesome. Happier.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have had a majorly transitional year... honestly my main motivation was my divorce and the fallout. I had my first child at 19, got married at 21, and threw myself fully into marriage and raising kids. I have two kids... gained quite a bit of weight bouncing back and forth between birth control methods and my pregnancies. Was not happy about how I looked, but too drained with work, familial obligations, and college to do anything about it. My ex is a Marine, so the gym made me feel a little anxious and stupid. I always created reasons not to go with him to the gym because he was in much better shape than I was.&lt;/p&gt;\n\n&lt;p&gt;It sucks to be sitting on the couch alone, while your kids are at their dads, and realize you&amp;#39;ve lost 1) your family and 2) your sense of self. It was a really pitiful moment where I realized I still was not doing anything for ME, when I used to have tons of friends, hobbies, and interests. I realized I needed to start taking care of myself again if I ever wanted to be happy. I got tired of it. I found a good friend to go with and built the time into my schedule.&lt;/p&gt;\n\n&lt;p&gt;My motivation to keep going is my kids. I want them to know that you don&amp;#39;t have to stop or slow down your life for anyone. I want them to see me happy and know that I will make damn sure I can keep up with them. I want to be a good role model, basically, and show that sometimes it&amp;#39;s okay to put yourself first so you can better care for the big and important things in your life. On top of that, I feel awesome. Happier.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5zyuu", "score_hidden": false, "stickied": false, "created": 1492038855.0, "created_utc": 1492010055.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": "", "user_reports": [], "id": "dg62fla", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MrsWeatherwax", "parent_id": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "While I certainly don't mind looking good in a bikini, as a 48 year old mom of 3 teens my *main* goals are health and keeping my body as strong and pain-free as possible.  I have a congenital spine deformity which can lead to debilitating back pain and since I'm not a candidate for surgery all I can do is stay as strong and flexible as possible, as well as keeping my weight in the healthy range (my orthopedist's exact words were \"stay strong, stay flexible and don't get fat!\")\n\nI also have a bum knee from an injury a few years ago and am missing most of the meniscus and have arthritis in it, so keeping my weight down and the surrounding muscles strong is imperative to avoid a lot of pain.\n\nI mountain bike a lot because I love it;  and my workout routine is designed to complement my riding.  \n\nThose are the main goals and the looking good in a swimsuit is a nice side effect.  Though frankly I am not sure how many people are even looking at me, since I'm pushing 50!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While I certainly don&amp;#39;t mind looking good in a bikini, as a 48 year old mom of 3 teens my &lt;em&gt;main&lt;/em&gt; goals are health and keeping my body as strong and pain-free as possible.  I have a congenital spine deformity which can lead to debilitating back pain and since I&amp;#39;m not a candidate for surgery all I can do is stay as strong and flexible as possible, as well as keeping my weight in the healthy range (my orthopedist&amp;#39;s exact words were &amp;quot;stay strong, stay flexible and don&amp;#39;t get fat!&amp;quot;)&lt;/p&gt;\n\n&lt;p&gt;I also have a bum knee from an injury a few years ago and am missing most of the meniscus and have arthritis in it, so keeping my weight down and the surrounding muscles strong is imperative to avoid a lot of pain.&lt;/p&gt;\n\n&lt;p&gt;I mountain bike a lot because I love it;  and my workout routine is designed to complement my riding.  &lt;/p&gt;\n\n&lt;p&gt;Those are the main goals and the looking good in a swimsuit is a nice side effect.  Though frankly I am not sure how many people are even looking at me, since I&amp;#39;m pushing 50!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg62fla", "score_hidden": false, "stickied": false, "created": 1492041555.0, "created_utc": 1492012755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": "", "user_reports": [], "id": "dg6mool", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "roosemelt", "parent_id": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "My initial reason was to gain weight as my thyroid became over active after having my daughter and I was about 5 kilos underweight. My thyroid normalised and I started gaining weight again and I wanted that weight to be muscle as I was naturally athletic before and had become skin and bones and didn't want to become skinny fat. I gained muscle really quickly until I hit my old pre pregnancy weight and my weight is steady now and I no longer have body goals - I think I look smoking :-) but I am competing in my first powerlifting meet in 2 weeks, so my goal now is to be strong af. This all happened in a space of 7 months, after my bub is down for the night.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My initial reason was to gain weight as my thyroid became over active after having my daughter and I was about 5 kilos underweight. My thyroid normalised and I started gaining weight again and I wanted that weight to be muscle as I was naturally athletic before and had become skin and bones and didn&amp;#39;t want to become skinny fat. I gained muscle really quickly until I hit my old pre pregnancy weight and my weight is steady now and I no longer have body goals - I think I look smoking :-) but I am competing in my first powerlifting meet in 2 weeks, so my goal now is to be strong af. This all happened in a space of 7 months, after my bub is down for the night.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg6mool", "score_hidden": false, "stickied": false, "created": 1492062840.0, "created_utc": 1492034040.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64twmi", "likes": null, "replies": "", "user_reports": [], "id": "dg71sgs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Wickedrutabaga", "parent_id": "t3_64twmi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I want to squat and deadlift 225 and bench 120 by the end of the year. Then start learning Olympic lifts. I want to be able to do 8 pull-ups and walk on my hands. \n\nMaybe someday....a muscle up? Do a split?  Row 2000 meters in under 9 minutes? Run a half marathon? I want to lift until well into my 80's. \n\nI am 41 now—wish I had started younger and the spectre of injury wasn't ever looming over me but I feel like I still have plenty of time and drive to make most of this happen if I don't take things too crazy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to squat and deadlift 225 and bench 120 by the end of the year. Then start learning Olympic lifts. I want to be able to do 8 pull-ups and walk on my hands. &lt;/p&gt;\n\n&lt;p&gt;Maybe someday....a muscle up? Do a split?  Row 2000 meters in under 9 minutes? Run a half marathon? I want to lift until well into my 80&amp;#39;s. &lt;/p&gt;\n\n&lt;p&gt;I am 41 now—wish I had started younger and the spectre of injury wasn&amp;#39;t ever looming over me but I feel like I still have plenty of time and drive to make most of this happen if I don&amp;#39;t take things too crazy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg71sgs", "score_hidden": false, "stickied": false, "created": 1492081569.0, "created_utc": 1492052769.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]