[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "xxfitness", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;25F, 5&amp;#39;10&amp;quot;, ~155lbs&lt;/strong&gt; (classic pear - upper body is lean, lower body is a whole different person)&lt;/p&gt;\n\n&lt;p&gt;Hello folks!&lt;/p&gt;\n\n&lt;p&gt;I live a relatively sedentary lifestyle and pretty much always have. I was never involved in sports growing up, I&amp;#39;ve never really trained my body for anything (other than cycling when I was 10 and that wasn&amp;#39;t highly disciplined or scientific), and while I do like to hike occasionally, most of my life is spent sitting at a computer. I am under no illusion of being in shape, even if aesthetically I may appear rather fit/slim.&lt;/p&gt;\n\n&lt;p&gt;I recently quit my second job and now have more time in the evenings to dedicate to fitness, and having moved from the east coast (USA) to a high altitude state out west, I want to be able to hike and travel around comfortably without wheezing and feeling that the end is near. (I have lived in this altitude for a year now, so I can&amp;#39;t claim I&amp;#39;m still acclimating, I&amp;#39;m just unfit).&lt;/p&gt;\n\n&lt;p&gt;I recently started back doing the Couch to 5k program, which I managed to complete last year around this time. I purchased a heart rate monitor (HRM) (Polar FT7 with chest strap) for this go around, and I tried it out yesterday during my Cto5K jog and today while just being in the office. The results are a bit scary.&lt;/p&gt;\n\n&lt;p&gt;During my jog/walk Cto5K session (Week 3 Day 1) yesterday, my average heart rate WHILE WALKING was 154bpm (78% max HR). My max heart rate while jogging (more like shuffling - seriously I couldn&amp;#39;t go slower if I tried) was 186bpm &lt;strong&gt;(95% max HR)!&lt;/strong&gt; I never &amp;quot;jogged&amp;quot; more than 3 minutes in those 30 minutes, and my heart rate shot up immediately. I have checked the monitor against my pulse and it&amp;#39;s accurate - my heart rate is incredibly high. I can certainly understand now why cardio has always been the hardest type of exercise for me - though likely the most necessary!&lt;/p&gt;\n\n&lt;p&gt;Out of curiosity I have been wearing my HRM for the whole day in my office. &lt;strong&gt;My average heart rate sitting down has been 86bpm (44% max HR) and just walking around my max was 136bpm (70% max HR)&lt;/strong&gt;. I have been in the &amp;quot;fat burning zone&amp;quot; all day no matter my activity. I haven&amp;#39;t consumed coffee since Sunday (and likely won&amp;#39;t knowing what I do now) and my diet has been one of primarily protein and veggies, with a tortilla and fruit as my main carbs.&lt;/p&gt;\n\n&lt;p&gt;I know people are all different and resting/max heart rates are variable, but I think by any measure this is not healthy for me. I don&amp;#39;t feel any different over the past few days than I normally do, so I wouldn&amp;#39;t say there are any other causes for this that would be abnormal. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;My question is what would be the most effective plan to improve this?&lt;/strong&gt; Should I continue progressing with Couch to 5k or should I repeat easier weeks in the program a few times until I see improvement in my heart rate? I certainly am out of breath during the program, though there isn&amp;#39;t lasting fatigue after a run. My muscles are handling it fine but my lungs struggle. And what should I do on &amp;quot;rest&amp;quot; days between Cto5K? Before getting the HRM, I thought I would do HIIT on rest days, but it seems that for my heart, Cto5K &lt;strong&gt;is&lt;/strong&gt; HIIT haha. I suppose I could do long walks, but it&amp;#39;s hard to imagine that being effective - then again, anything is better than nothing, especially when just a walk gets my HR up so high. I also was doing the recommended routine of &lt;a href=\"/r/bodyweightfitness\"&gt;r/bodyweightfitness&lt;/a&gt; last fall, perhaps the combination of BWF and Cto5K would help? &lt;/p&gt;\n\n&lt;p&gt;My goals are not weight loss or aesthetic, just general health and ability to hike in high altitude more comfortably.&lt;/p&gt;\n\n&lt;p&gt;Thanks, ladies!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**25F, 5'10\", ~155lbs** (classic pear - upper body is lean, lower body is a whole different person)\n\nHello folks!\n\nI live a relatively sedentary lifestyle and pretty much always have. I was never involved in sports growing up, I've never really trained my body for anything (other than cycling when I was 10 and that wasn't highly disciplined or scientific), and while I do like to hike occasionally, most of my life is spent sitting at a computer. I am under no illusion of being in shape, even if aesthetically I may appear rather fit/slim.\n\nI recently quit my second job and now have more time in the evenings to dedicate to fitness, and having moved from the east coast (USA) to a high altitude state out west, I want to be able to hike and travel around comfortably without wheezing and feeling that the end is near. (I have lived in this altitude for a year now, so I can't claim I'm still acclimating, I'm just unfit).\n\nI recently started back doing the Couch to 5k program, which I managed to complete last year around this time. I purchased a heart rate monitor (HRM) (Polar FT7 with chest strap) for this go around, and I tried it out yesterday during my Cto5K jog and today while just being in the office. The results are a bit scary.\n\nDuring my jog/walk Cto5K session (Week 3 Day 1) yesterday, my average heart rate WHILE WALKING was 154bpm (78% max HR). My max heart rate while jogging (more like shuffling - seriously I couldn't go slower if I tried) was 186bpm **(95% max HR)!** I never \"jogged\" more than 3 minutes in those 30 minutes, and my heart rate shot up immediately. I have checked the monitor against my pulse and it's accurate - my heart rate is incredibly high. I can certainly understand now why cardio has always been the hardest type of exercise for me - though likely the most necessary!\n\nOut of curiosity I have been wearing my HRM for the whole day in my office. **My average heart rate sitting down has been 86bpm (44% max HR) and just walking around my max was 136bpm (70% max HR)**. I have been in the \"fat burning zone\" all day no matter my activity. I haven't consumed coffee since Sunday (and likely won't knowing what I do now) and my diet has been one of primarily protein and veggies, with a tortilla and fruit as my main carbs.\n\nI know people are all different and resting/max heart rates are variable, but I think by any measure this is not healthy for me. I don't feel any different over the past few days than I normally do, so I wouldn't say there are any other causes for this that would be abnormal. \n\n**My question is what would be the most effective plan to improve this?** Should I continue progressing with Couch to 5k or should I repeat easier weeks in the program a few times until I see improvement in my heart rate? I certainly am out of breath during the program, though there isn't lasting fatigue after a run. My muscles are handling it fine but my lungs struggle. And what should I do on \"rest\" days between Cto5K? Before getting the HRM, I thought I would do HIIT on rest days, but it seems that for my heart, Cto5K **is** HIIT haha. I suppose I could do long walks, but it's hard to imagine that being effective - then again, anything is better than nothing, especially when just a walk gets my HR up so high. I also was doing the recommended routine of r/bodyweightfitness last fall, perhaps the combination of BWF and Cto5K would help? \n\nMy goals are not weight loss or aesthetic, just general health and ability to hike in high altitude more comfortably.\n\nThanks, ladies!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64u065", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 22, "report_reasons": null, "author": "meetmeinthemaze", "saved": false, "mod_reports": [], "name": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "approved_by": null, "over_18": false, "domain": "self.xxfitness", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ryzy", "edited": 1491948336.0, "link_flair_css_class": null, "author_flair_css_class": "hiking", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/xxfitness/comments/64u065/started_wearing_a_heart_rate_monitor_for_the_past/", "num_reports": null, "locked": false, "stickied": false, "created": 1491976340.0, "url": "https://www.reddit.com/r/xxfitness/comments/64u065/started_wearing_a_heart_rate_monitor_for_the_past/", "author_flair_text": "", "quarantine": false, "title": "Started wearing a heart rate monitor for the past two days and my heart rate is alarmingly high. Help!", "created_utc": 1491947540.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 32, "visited": false, "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg649d8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sweetpea122", "parent_id": "t1_dg52v88", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Mine didnt start high, but mine was at 87bpm per my drs office and now after 6 weeks of c25k its at 67 which I feel is a huge improvement. Also when running on the treadmill Im really slow AKA 3.9mph but when I try and run outside my speed is close to 6mph which I did not think was possible with legs as short as mine", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mine didnt start high, but mine was at 87bpm per my drs office and now after 6 weeks of c25k its at 67 which I feel is a huge improvement. Also when running on the treadmill Im really slow AKA 3.9mph but when I try and run outside my speed is close to 6mph which I did not think was possible with legs as short as mine&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg649d8", "score_hidden": false, "stickied": false, "created": 1492043501.0, "created_utc": 1492014701.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52v88", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "meetmeinthemaze", "parent_id": "t1_dg50zh1", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Thanks for the perspective. I know a lot of resources I have found are geared toward regularly active folks who can't imagine having to train to run even a mile (had a coworker say last year \"Who trains for a 5k?!\" haha she doesn't know the struggle...)\n\nThat said I want to definitely improve my cardiovascular health and this may be a good way to monitor that. Perhaps I should use the HRM sparingly, during Cto5K and maybe one rest day a week to track progress? I'm not sure. My resting heart rate is accurate, even when I'm sitting at my desk for hours on end, so \"lag\" doesn't seem to be a factor.\n\nI'll try adding in longer walks on rest days instead of the usual couple of laps around the building at work.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the perspective. I know a lot of resources I have found are geared toward regularly active folks who can&amp;#39;t imagine having to train to run even a mile (had a coworker say last year &amp;quot;Who trains for a 5k?!&amp;quot; haha she doesn&amp;#39;t know the struggle...)&lt;/p&gt;\n\n&lt;p&gt;That said I want to definitely improve my cardiovascular health and this may be a good way to monitor that. Perhaps I should use the HRM sparingly, during Cto5K and maybe one rest day a week to track progress? I&amp;#39;m not sure. My resting heart rate is accurate, even when I&amp;#39;m sitting at my desk for hours on end, so &amp;quot;lag&amp;quot; doesn&amp;#39;t seem to be a factor.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll try adding in longer walks on rest days instead of the usual couple of laps around the building at work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg52v88", "score_hidden": false, "stickied": false, "created": 1491980526.0, "created_utc": 1491951726.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg50zh1", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "Kaylya", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I wouldn't be overly alarmed. It's my experience that most advice about heart rate for running is really geared towards people who are much more seasoned runners, and that as an unfit beginner it's normal not to maintain the kind of ranges they mention - I don't really think an HRM is a useful tool for a beginner runner. Just follow C25k, it will improve over time. Adding walks to C25k is fine, I wouldn't add HIIT as an out of shape beginner, as you say, C25k is pretty high intensity for you.\n\nHeart rate lags behind the change in activity, particularly on the way down - it's going to stay fairly high during a short walk break after running, and same thing if you're counting the time shortly after sitting down with your sitting heart rate. \"Resting heart rate\" is ideally taken right after you wake up in the morning, or, at least after sitting down and not doing much for a good long time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t be overly alarmed. It&amp;#39;s my experience that most advice about heart rate for running is really geared towards people who are much more seasoned runners, and that as an unfit beginner it&amp;#39;s normal not to maintain the kind of ranges they mention - I don&amp;#39;t really think an HRM is a useful tool for a beginner runner. Just follow C25k, it will improve over time. Adding walks to C25k is fine, I wouldn&amp;#39;t add HIIT as an out of shape beginner, as you say, C25k is pretty high intensity for you.&lt;/p&gt;\n\n&lt;p&gt;Heart rate lags behind the change in activity, particularly on the way down - it&amp;#39;s going to stay fairly high during a short walk break after running, and same thing if you&amp;#39;re counting the time shortly after sitting down with your sitting heart rate. &amp;quot;Resting heart rate&amp;quot; is ideally taken right after you wake up in the morning, or, at least after sitting down and not doing much for a good long time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg50zh1", "score_hidden": false, "stickied": false, "created": 1491978096.0, "created_utc": 1491949296.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg68uah", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "carry-the-zero", "parent_id": "t1_dg685hy", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "For sure. Just make sure you listen to what your body is telling you and not just what your tech is telling you! Best of luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For sure. Just make sure you listen to what your body is telling you and not just what your tech is telling you! Best of luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg68uah", "score_hidden": false, "stickied": false, "created": 1492048155.0, "created_utc": 1492019355.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg685hy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "meetmeinthemaze", "parent_id": "t1_dg63eyi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I'll keep going strong with the C25K and when my monitor freaks out I'll just ignore it and use it to track progress. Glad my heart isn't about to 'splode.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll keep going strong with the C25K and when my monitor freaks out I&amp;#39;ll just ignore it and use it to track progress. Glad my heart isn&amp;#39;t about to &amp;#39;splode.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg685hy", "score_hidden": false, "stickied": false, "created": 1492047469.0, "created_utc": 1492018669.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63eyi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "carry-the-zero", "parent_id": "t1_dg5ec09", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Said it all right there! Your HR is high because you're not in shape yet. I was alarmed when my HR went up to 196 during HIIT. Texted my firefighter-EMT brother-in-law (also a fitness guru), \"am I going to send myself into cardiac arrest?\" He said as long as your HR is significantly lower 20 mins after you step off the machine, there's nothing to worry about. \n\nKeep after it! Soon, you'll have to push a lot harder to get your HR up there. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Said it all right there! Your HR is high because you&amp;#39;re not in shape yet. I was alarmed when my HR went up to 196 during HIIT. Texted my firefighter-EMT brother-in-law (also a fitness guru), &amp;quot;am I going to send myself into cardiac arrest?&amp;quot; He said as long as your HR is significantly lower 20 mins after you step off the machine, there&amp;#39;s nothing to worry about. &lt;/p&gt;\n\n&lt;p&gt;Keep after it! Soon, you&amp;#39;ll have to push a lot harder to get your HR up there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg63eyi", "score_hidden": false, "stickied": false, "created": 1492042614.0, "created_utc": 1492013814.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ec09", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "meetmeinthemaze", "parent_id": "t1_dg55bew", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "That's really good to know! Yeah, no symptoms other than your typical lazy person trying to get into shape feeling like they're dying haha.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s really good to know! Yeah, no symptoms other than your typical lazy person trying to get into shape feeling like they&amp;#39;re dying haha.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5ec09", "score_hidden": false, "stickied": false, "created": 1491995959.0, "created_utc": 1491967159.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg55bew", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "momsjustwannahaverun", "parent_id": "t1_dg54tyz", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Heart murmur and sinus arrhythmia checking in... \n\nYep! No symptoms, no worries. My max while jogging a few minutes the other day was 180. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Heart murmur and sinus arrhythmia checking in... &lt;/p&gt;\n\n&lt;p&gt;Yep! No symptoms, no worries. My max while jogging a few minutes the other day was 180. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg55bew", "score_hidden": false, "stickied": false, "created": 1491983857.0, "created_utc": 1491955057.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg54tyz", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "K2togtbl", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "As someone with tachycardia, I personally wouldn't worry about it unless you have symptoms going along with the high heart rate. Symptoms that you can't deal with or something that makes you think, \"this really isn't right.\" Before going on medication, when my heart rate got high, I had pre syncope symptoms or would pass out if I wasn't able to catch the symptoms in time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone with tachycardia, I personally wouldn&amp;#39;t worry about it unless you have symptoms going along with the high heart rate. Symptoms that you can&amp;#39;t deal with or something that makes you think, &amp;quot;this really isn&amp;#39;t right.&amp;quot; Before going on medication, when my heart rate got high, I had pre syncope symptoms or would pass out if I wasn&amp;#39;t able to catch the symptoms in time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg54tyz", "score_hidden": false, "stickied": false, "created": 1491983194.0, "created_utc": 1491954394.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg54t0d", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Hoosiergirl29", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "The best way to improve it is to run more--I feel like a broken record, but when I'm consistently training through the summer and into fall, my RHR drops a solid 5-10bpm and I'm in good shape. It takes a little while for everything to catch up--way more than 3 weeks if you're a beginner. \n\nIt takes me 3-4 weeks to feel comfortable (breathing normal, heart rate not all over the place after 1.5 miles, etc) coming out of a winter cross-training season, and I've been athletic for nearly 20 years", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best way to improve it is to run more--I feel like a broken record, but when I&amp;#39;m consistently training through the summer and into fall, my RHR drops a solid 5-10bpm and I&amp;#39;m in good shape. It takes a little while for everything to catch up--way more than 3 weeks if you&amp;#39;re a beginner. &lt;/p&gt;\n\n&lt;p&gt;It takes me 3-4 weeks to feel comfortable (breathing normal, heart rate not all over the place after 1.5 miles, etc) coming out of a winter cross-training season, and I&amp;#39;ve been athletic for nearly 20 years&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg54t0d", "score_hidden": false, "stickied": false, "created": 1491983156.0, "created_utc": 1491954356.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg55d7f", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "RunsWithShibas", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Some things that can raise your heart rate, off the top of my head: being pregnant; being sick or coming down with something (this happened to me yesterday, and today I have a bad cold, blugh); the weather being really warm or being dressed too warmly; altitude, especially when you're unaccustomed to it. Probably also hydration, because it affects everything else with running. Also,  keep in mind that the % max calculation may be off because it's based on a general model--*you* specifically may have a different max HR than the one the watch is using to calculate, so I'd look at those calculations skeptically. \n\nSince you feel normal, I would suggest you start paying attention not to the specific numbers but to their change over time. For example, if you keep working through the C25k for a few weeks, do you see the numbers start to come down? Also, do you feel really crummy when your HR spikes, or is it just how you've always felt while running? \n\nI tend to run based on how I feel rather than on what my HR monitor says, so I would suggest you just keep going on the C25k program and see how things go. On your rest days, a non-impact cardio exercise (biking or swimming) or weight training might be a nice complement. That said, if you have a family history of heart issues or you're super nervous, there's nothing wrong with making an appointment with your doctor to check if your heart sounds okay and get cleared for cardio exercise. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some things that can raise your heart rate, off the top of my head: being pregnant; being sick or coming down with something (this happened to me yesterday, and today I have a bad cold, blugh); the weather being really warm or being dressed too warmly; altitude, especially when you&amp;#39;re unaccustomed to it. Probably also hydration, because it affects everything else with running. Also,  keep in mind that the % max calculation may be off because it&amp;#39;s based on a general model--&lt;em&gt;you&lt;/em&gt; specifically may have a different max HR than the one the watch is using to calculate, so I&amp;#39;d look at those calculations skeptically. &lt;/p&gt;\n\n&lt;p&gt;Since you feel normal, I would suggest you start paying attention not to the specific numbers but to their change over time. For example, if you keep working through the C25k for a few weeks, do you see the numbers start to come down? Also, do you feel really crummy when your HR spikes, or is it just how you&amp;#39;ve always felt while running? &lt;/p&gt;\n\n&lt;p&gt;I tend to run based on how I feel rather than on what my HR monitor says, so I would suggest you just keep going on the C25k program and see how things go. On your rest days, a non-impact cardio exercise (biking or swimming) or weight training might be a nice complement. That said, if you have a family history of heart issues or you&amp;#39;re super nervous, there&amp;#39;s nothing wrong with making an appointment with your doctor to check if your heart sounds okay and get cleared for cardio exercise. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg55d7f", "score_hidden": false, "stickied": false, "created": 1491983924.0, "created_utc": 1491955124.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg5dz5e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "meetmeinthemaze", "parent_id": "t1_dg5b47m", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Thanks, that's good to know! It's hard to find information that isn't skewed toward already active people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, that&amp;#39;s good to know! It&amp;#39;s hard to find information that isn&amp;#39;t skewed toward already active people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5dz5e", "score_hidden": false, "stickied": false, "created": 1491995435.0, "created_utc": 1491966635.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5b47m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SnowflakeRunner", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "A resting heart rate of 86 isn't anything to worry about, especially if your cardio is untrained. I feel like if you go to here /r/loseit you'll find a lot of people seem to have low (60 or under) heart rates. Calorie deficits lowers resting heart rate. So if you're thinking yours is high because of what you see on here, clinically it's not. Just a bit of perspective.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A resting heart rate of 86 isn&amp;#39;t anything to worry about, especially if your cardio is untrained. I feel like if you go to here &lt;a href=\"/r/loseit\"&gt;/r/loseit&lt;/a&gt; you&amp;#39;ll find a lot of people seem to have low (60 or under) heart rates. Calorie deficits lowers resting heart rate. So if you&amp;#39;re thinking yours is high because of what you see on here, clinically it&amp;#39;s not. Just a bit of perspective.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5b47m", "score_hidden": false, "stickied": false, "created": 1491991452.0, "created_utc": 1491962652.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg59hj4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "spidermilk666", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I'm a runner, have been running for probably 5 years. My heart rate is in the 40s right when I wake up and am still laying in bed, basically asleep. If I am sitting around doing a quiet activity  (like Reddit) it is 60-70. During most of runs it is about 90-120. This doesn't really help my health and isn't really important except that running more makes me a better runner.\n\nFirst of all, if you are worried about your heart health talk to your doctor. Second, \"max heart rates\" are just an estimate based on your age. These are only useful for knowing how hard you are exercising but you are only guessing at the max. If you feel fine and all other indicators are that you are fine (not dizzy, lightheaded, confused) you are probably fine. When I run I base things on \"effort\" and on a 1-10 scale try to keep things at a 4-5 for most runs and a 7 if I am doing speed work (sprinting small distances then recovering). Unless you are pretty advanced (I'm not) slow runs are best and speed increases come when you slowly (very slowly) increase your mileage.\n\nRunning is really hard when you start out. My advice is to take teeny tiny steps and really really run far slower than you even think is possible. Couch to 5k is an excellent program if you want to become a runner.\n\nIf you want a healthy heart, then ANY CARDIO (which I kind of think includes weight lifting even though it is probably lower rate like walking) does that. Plus fruits, veggies, lean meats and dairy and healthy fats (like the DASH or a Mediterranean diet). Plus not smoking. ", "edited": 1491960791.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a runner, have been running for probably 5 years. My heart rate is in the 40s right when I wake up and am still laying in bed, basically asleep. If I am sitting around doing a quiet activity  (like Reddit) it is 60-70. During most of runs it is about 90-120. This doesn&amp;#39;t really help my health and isn&amp;#39;t really important except that running more makes me a better runner.&lt;/p&gt;\n\n&lt;p&gt;First of all, if you are worried about your heart health talk to your doctor. Second, &amp;quot;max heart rates&amp;quot; are just an estimate based on your age. These are only useful for knowing how hard you are exercising but you are only guessing at the max. If you feel fine and all other indicators are that you are fine (not dizzy, lightheaded, confused) you are probably fine. When I run I base things on &amp;quot;effort&amp;quot; and on a 1-10 scale try to keep things at a 4-5 for most runs and a 7 if I am doing speed work (sprinting small distances then recovering). Unless you are pretty advanced (I&amp;#39;m not) slow runs are best and speed increases come when you slowly (very slowly) increase your mileage.&lt;/p&gt;\n\n&lt;p&gt;Running is really hard when you start out. My advice is to take teeny tiny steps and really really run far slower than you even think is possible. Couch to 5k is an excellent program if you want to become a runner.&lt;/p&gt;\n\n&lt;p&gt;If you want a healthy heart, then ANY CARDIO (which I kind of think includes weight lifting even though it is probably lower rate like walking) does that. Plus fruits, veggies, lean meats and dairy and healthy fats (like the DASH or a Mediterranean diet). Plus not smoking. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg59hj4", "score_hidden": false, "stickied": false, "created": 1491989305.0, "created_utc": 1491960505.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg5ez8r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "meetmeinthemaze", "parent_id": "t1_dg5ej5e", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "This is great perspective! I will definitely do this. I used to walk with my mom every day growing up, for decent distances, but I haven't done it much as an adult due to a weirdly small and not so scenic neighborhood and busy life - I could definitely venture out on more walks though since I'd have a purpose for it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is great perspective! I will definitely do this. I used to walk with my mom every day growing up, for decent distances, but I haven&amp;#39;t done it much as an adult due to a weirdly small and not so scenic neighborhood and busy life - I could definitely venture out on more walks though since I&amp;#39;d have a purpose for it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5ez8r", "score_hidden": false, "stickied": false, "created": 1491996939.0, "created_utc": 1491968139.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ej5e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "curious_cortex", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "If you're relatively untrained, just walking on your off days can and will improve your cardio fitness level.  I started with walking after being ill and pretty inactive for a couple years.  Initially my resting heart rate was about 100 and it hit 170 during brisk walks, but within a couple months of consistently walking 2 miles a day, that dropped to 120ish.  At that point I started C25K, and jogging sent my heart rate back up into the 180s.  I ended up taking it slow and repeating a couple weeks, eventually my heart rate stayed in the 140-160 range while jogging.  I didn't have the motivation to stick with it to the end of the program, but at least my cardio fitness is no longer holding me back from living my life (and doing a ton of rock climbing).  My resting heart rate is back to a more reasonable 75-85 these days, which I'm perfectly ok with. \n\nSo I would go out for some walks on your off days, and just keep the pace comfortably brisk - it will help your body adjust!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re relatively untrained, just walking on your off days can and will improve your cardio fitness level.  I started with walking after being ill and pretty inactive for a couple years.  Initially my resting heart rate was about 100 and it hit 170 during brisk walks, but within a couple months of consistently walking 2 miles a day, that dropped to 120ish.  At that point I started C25K, and jogging sent my heart rate back up into the 180s.  I ended up taking it slow and repeating a couple weeks, eventually my heart rate stayed in the 140-160 range while jogging.  I didn&amp;#39;t have the motivation to stick with it to the end of the program, but at least my cardio fitness is no longer holding me back from living my life (and doing a ton of rock climbing).  My resting heart rate is back to a more reasonable 75-85 these days, which I&amp;#39;m perfectly ok with. &lt;/p&gt;\n\n&lt;p&gt;So I would go out for some walks on your off days, and just keep the pace comfortably brisk - it will help your body adjust!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5ej5e", "score_hidden": false, "stickied": false, "created": 1491996258.0, "created_utc": 1491967458.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg5mi0n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "octopusdixiecups", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "To be honest I wouldn't worry about it. What you're describing is literally me. My heart rate especially when I'm doing physical activity goes through the roof. I'm just fast walking on the treadmill and I get in the 180s. I actually had a stress test done for unrelated issues and asked the cardiologist if this pattern was problematic and she said since my heart rate increases steadily, and I'm not having palpitations or light headed episodes, chest pain, etc. then it is really nothing to worry about. She said that everyone is different and you can have a very high heart rate during activity (anything other than sitting down and staying still) and be perfectly fine / healthy. \n\nIf you're actually concerned though then you might want to see your doc and have them listen. What you are describing seems like nothing to worry about but if you notice something different then definitely see a doctor. Better safe than sorry ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be honest I wouldn&amp;#39;t worry about it. What you&amp;#39;re describing is literally me. My heart rate especially when I&amp;#39;m doing physical activity goes through the roof. I&amp;#39;m just fast walking on the treadmill and I get in the 180s. I actually had a stress test done for unrelated issues and asked the cardiologist if this pattern was problematic and she said since my heart rate increases steadily, and I&amp;#39;m not having palpitations or light headed episodes, chest pain, etc. then it is really nothing to worry about. She said that everyone is different and you can have a very high heart rate during activity (anything other than sitting down and staying still) and be perfectly fine / healthy. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re actually concerned though then you might want to see your doc and have them listen. What you are describing seems like nothing to worry about but if you notice something different then definitely see a doctor. Better safe than sorry &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5mi0n", "score_hidden": false, "stickied": false, "created": 1492012889.0, "created_utc": 1491984089.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg5xq70", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Fyrdraca", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "The American heart association says the average adult resting heart rate is between 60-100 bpm so I wouldn't say yours is alarmingly high at all. You've only been wearing for 2 days so you can't tell if these is normal yet or something else is influencing it. Resting heart rate tends to vary over the month as well. More info on heart rates: http://www.heart.org/HEARTORG/HealthyLiving/PhysicalActivity/FitnessBasics/Target-Heart-Rates_UCM_434341_Article.jsp#mainContent\n\nIf you do want to reduce your heart rate, I know doing more cardio will help but I'm not an expert.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The American heart association says the average adult resting heart rate is between 60-100 bpm so I wouldn&amp;#39;t say yours is alarmingly high at all. You&amp;#39;ve only been wearing for 2 days so you can&amp;#39;t tell if these is normal yet or something else is influencing it. Resting heart rate tends to vary over the month as well. More info on heart rates: &lt;a href=\"http://www.heart.org/HEARTORG/HealthyLiving/PhysicalActivity/FitnessBasics/Target-Heart-Rates_UCM_434341_Article.jsp#mainContent\"&gt;http://www.heart.org/HEARTORG/HealthyLiving/PhysicalActivity/FitnessBasics/Target-Heart-Rates_UCM_434341_Article.jsp#mainContent&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If you do want to reduce your heart rate, I know doing more cardio will help but I&amp;#39;m not an expert.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5xq70", "score_hidden": false, "stickied": false, "created": 1492036306.0, "created_utc": 1492007506.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg75lid", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kahtee", "parent_id": "t1_dg726wi", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Good luck!! Exercise is the best way to treat mild/moderate POTS anyways. If you start having intolerable symptoms with running or fatigue that's affecting the rest of your day, you might want to try some other form of cardio that has your body in a less upright position (swimming, rowing machine, recumbent bike etc). \n\nPlus hydration, make sure you're drinking a lot! It's usually worse in the morning because you get dehydrated overnight.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck!! Exercise is the best way to treat mild/moderate POTS anyways. If you start having intolerable symptoms with running or fatigue that&amp;#39;s affecting the rest of your day, you might want to try some other form of cardio that has your body in a less upright position (swimming, rowing machine, recumbent bike etc). &lt;/p&gt;\n\n&lt;p&gt;Plus hydration, make sure you&amp;#39;re drinking a lot! It&amp;#39;s usually worse in the morning because you get dehydrated overnight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg75lid", "score_hidden": false, "stickied": false, "created": 1492087243.0, "created_utc": 1492058443.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg726wi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "meetmeinthemaze", "parent_id": "t1_dg6ywwl", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Thanks!\n\nMy resting heart rate sitting down was 86bpm, stood up and it shot up to 122bpm, then started dropping but stayed between 112-120bpm while standing. I noticed it was at 137 this morning while I was just brushing teeth and putting in contacts. Not sure if this is significant or not.\n\nOn the other hand, although my heart rate was incredibly high for my C25K this evening, I felt great, so I've got that going for me haha!\n\nEdit: Looking at the link you sent me, this does seem to be indicative of a (probably mild) form of POTS. I did have problems with lightheadedness as a child, so there could be something to this. Again, since my symptoms aren't terrible, I'll play it cool with the getting in shape and see if this improves or if there's something else I need to look into. Thanks again for the great info!", "edited": 1492054169.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks!&lt;/p&gt;\n\n&lt;p&gt;My resting heart rate sitting down was 86bpm, stood up and it shot up to 122bpm, then started dropping but stayed between 112-120bpm while standing. I noticed it was at 137 this morning while I was just brushing teeth and putting in contacts. Not sure if this is significant or not.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, although my heart rate was incredibly high for my C25K this evening, I felt great, so I&amp;#39;ve got that going for me haha!&lt;/p&gt;\n\n&lt;p&gt;Edit: Looking at the link you sent me, this does seem to be indicative of a (probably mild) form of POTS. I did have problems with lightheadedness as a child, so there could be something to this. Again, since my symptoms aren&amp;#39;t terrible, I&amp;#39;ll play it cool with the getting in shape and see if this improves or if there&amp;#39;s something else I need to look into. Thanks again for the great info!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg726wi", "score_hidden": false, "stickied": false, "created": 1492082115.0, "created_utc": 1492053315.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ywwl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kahtee", "parent_id": "t1_dg6psqa", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Good plan! I'd still suggest checking how it affects your heart rate to lie down and stand up. If your heart rate spikes just from standing up, that is a medical problem. Because no one is THAT \"out of shape\" unless they've been on bedrest for months, you know? \n\nIf it's under 100 when you're just standing up, but then goes higher when you start walking/jogging, that's more likely to be \"out of shape\" and should get better with time. Good luck!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good plan! I&amp;#39;d still suggest checking how it affects your heart rate to lie down and stand up. If your heart rate spikes just from standing up, that is a medical problem. Because no one is THAT &amp;quot;out of shape&amp;quot; unless they&amp;#39;ve been on bedrest for months, you know? &lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s under 100 when you&amp;#39;re just standing up, but then goes higher when you start walking/jogging, that&amp;#39;s more likely to be &amp;quot;out of shape&amp;quot; and should get better with time. Good luck!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg6ywwl", "score_hidden": false, "stickied": false, "created": 1492077899.0, "created_utc": 1492049099.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6psqa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "meetmeinthemaze", "parent_id": "t1_dg6mlgv", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Good information to be aware of! I'll go through C25K and see if things improve, and if they don't by the end of the program, I'll schedule a doctor's visit. \n\nI'm hesitant to blame my HR issues on a condition before addressing the out of shape aspect but this is good info to have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good information to be aware of! I&amp;#39;ll go through C25K and see if things improve, and if they don&amp;#39;t by the end of the program, I&amp;#39;ll schedule a doctor&amp;#39;s visit. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m hesitant to blame my HR issues on a condition before addressing the out of shape aspect but this is good info to have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg6psqa", "score_hidden": false, "stickied": false, "created": 1492066684.0, "created_utc": 1492037884.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mlgv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kahtee", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "If your heart rate is normal (under 100) while sitting or lying down, and increases significantly when you stand up, that could be a treatable medical condition - http://www.dysautonomiainternational.org/page.php?ID=30 \n\nA lot of people feel like they're just \"out of shape\" because the most common symptoms are feeling short of breath and dizzy. And most cardiologists are not knowledgeable about the condition so they'll agree that you're out of shape. But especially if you keep working at C25K and don't see improvement, there could be something else going on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If your heart rate is normal (under 100) while sitting or lying down, and increases significantly when you stand up, that could be a treatable medical condition - &lt;a href=\"http://www.dysautonomiainternational.org/page.php?ID=30\"&gt;http://www.dysautonomiainternational.org/page.php?ID=30&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;A lot of people feel like they&amp;#39;re just &amp;quot;out of shape&amp;quot; because the most common symptoms are feeling short of breath and dizzy. And most cardiologists are not knowledgeable about the condition so they&amp;#39;ll agree that you&amp;#39;re out of shape. But especially if you keep working at C25K and don&amp;#39;t see improvement, there could be something else going on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg6mlgv", "score_hidden": false, "stickied": false, "created": 1492062728.0, "created_utc": 1492033928.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg5eqju", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheAlpinista", "parent_id": "t1_dg5dhtm", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "If you do want to improve it, you're looking at doing long endurance type exercises where you keep your heart rate below your aerobic threshold. You can increase this with training. ...if you want. \n\nFeel free to PM me. I've been doing a lot of this kind of training for mountain climbing! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you do want to improve it, you&amp;#39;re looking at doing long endurance type exercises where you keep your heart rate below your aerobic threshold. You can increase this with training. ...if you want. &lt;/p&gt;\n\n&lt;p&gt;Feel free to PM me. I&amp;#39;ve been doing a lot of this kind of training for mountain climbing! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5eqju", "score_hidden": false, "stickied": false, "created": 1491996564.0, "created_utc": 1491967764.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5dhtm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "meetmeinthemaze", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Thanks folks, you all have been a great help! I will stick with Cto5K and use my HRM more to track progress over time rather than what I'm doing right at the moment. I will also incorporate more walking and other low intensity exercise on rest days. Overall I'll try not to worry about it and just focus on how I feel during my jogs. \n\nThanks to all of you!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks folks, you all have been a great help! I will stick with Cto5K and use my HRM more to track progress over time rather than what I&amp;#39;m doing right at the moment. I will also incorporate more walking and other low intensity exercise on rest days. Overall I&amp;#39;ll try not to worry about it and just focus on how I feel during my jogs. &lt;/p&gt;\n\n&lt;p&gt;Thanks to all of you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5dhtm", "score_hidden": false, "stickied": false, "created": 1491994740.0, "created_utc": 1491965940.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg5nty8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thisisnotforyou_", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I wouldn't worry - my heart rate sometimes shot up to 160-170bpm while doing steady state when I first got into fitness. I'm fairly fit now, but when I do HIIT rowing, my heart rate goes to like 185 within the 45 second interval. My resting heart rate is around 75-80. \n\nIf your heart rate is normal while in a resting state, then it is ok for it to be elevated a fair bit when exercising, especially if you have just started to be active. The more you exercise over time, the more your body will adjust, you'll become better at perfusing yourself with oxygen while exercising and your heart rate will lower a bit and it'll take more to elevate it to 95%. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t worry - my heart rate sometimes shot up to 160-170bpm while doing steady state when I first got into fitness. I&amp;#39;m fairly fit now, but when I do HIIT rowing, my heart rate goes to like 185 within the 45 second interval. My resting heart rate is around 75-80. &lt;/p&gt;\n\n&lt;p&gt;If your heart rate is normal while in a resting state, then it is ok for it to be elevated a fair bit when exercising, especially if you have just started to be active. The more you exercise over time, the more your body will adjust, you&amp;#39;ll become better at perfusing yourself with oxygen while exercising and your heart rate will lower a bit and it&amp;#39;ll take more to elevate it to 95%. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5nty8", "score_hidden": false, "stickied": false, "created": 1492017054.0, "created_utc": 1491988254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg5w90u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MillionDollarDoggo", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Those numbers look like what is to be expected, you're a little out of shape but that's why you're doing the couch 25k program. Keep going and eventually your heart will get stronger, don't worry about it unless a doctor tells you to worry about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Those numbers look like what is to be expected, you&amp;#39;re a little out of shape but that&amp;#39;s why you&amp;#39;re doing the couch 25k program. Keep going and eventually your heart will get stronger, don&amp;#39;t worry about it unless a doctor tells you to worry about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5w90u", "score_hidden": false, "stickied": false, "created": 1492034505.0, "created_utc": 1492005705.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg5wwn2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AnnArborLady", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "1. If your heart rate while slowly jogging was 95% of your max HR, then your max HR has been calculated wrong. This means your zones are also calculated wrong. The typical \"subtract your age from 220 to find your max HR\" doesn't work for everyone. For example, because I'm 27 years old, according to the formula, my max HR *should* be 193 BPM. However, my *actual* max HR is around 210 BPM (I'm also a member of the high heart rate club!). Find your actual max HR and then recalculate your zones.\n\n2. A simplistic, easy way to get calculate your max HR is to check your heart rate monitor during very intense physical activity. For example, jog for 5 min to warm up, sprint hard for as long as you possibly can, then look down at your monitor. That's your new max HR. (Obviously, be safe. Please don't hurt yourself or pass out during this process.)\n\n3. Always trust your physician more than us here on reddit. If you are truly concerned that you may have a heart issue, make an appointment. Also may be a good idea to discuss any new exercise regimen with your physician prior to starting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;If your heart rate while slowly jogging was 95% of your max HR, then your max HR has been calculated wrong. This means your zones are also calculated wrong. The typical &amp;quot;subtract your age from 220 to find your max HR&amp;quot; doesn&amp;#39;t work for everyone. For example, because I&amp;#39;m 27 years old, according to the formula, my max HR &lt;em&gt;should&lt;/em&gt; be 193 BPM. However, my &lt;em&gt;actual&lt;/em&gt; max HR is around 210 BPM (I&amp;#39;m also a member of the high heart rate club!). Find your actual max HR and then recalculate your zones.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A simplistic, easy way to get calculate your max HR is to check your heart rate monitor during very intense physical activity. For example, jog for 5 min to warm up, sprint hard for as long as you possibly can, then look down at your monitor. That&amp;#39;s your new max HR. (Obviously, be safe. Please don&amp;#39;t hurt yourself or pass out during this process.)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Always trust your physician more than us here on reddit. If you are truly concerned that you may have a heart issue, make an appointment. Also may be a good idea to discuss any new exercise regimen with your physician prior to starting.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5wwn2", "score_hidden": false, "stickied": false, "created": 1492035328.0, "created_utc": 1492006528.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_64u065", "likes": null, "replies": "", "user_reports": [], "id": "dg66hz1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "meetmeinthemaze", "parent_id": "t1_dg5xp3q", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Haha no worries - realized I totally overshared and a \"no\" would have sufficed... hahahaha I may be a bit preoccupied with that fact.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha no worries - realized I totally overshared and a &amp;quot;no&amp;quot; would have sufficed... hahahaha I may be a bit preoccupied with that fact.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg66hz1", "score_hidden": false, "stickied": false, "created": 1492045811.0, "created_utc": 1492017011.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5xp3q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "space-ninja", "parent_id": "t1_dg5ci91", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Haha ok, just checking! The top post on /r/fitbit is about a woman who realized that she was pregnant because of abnormally high HR readings, so that's the first thing I think of in these situations!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha ok, just checking! The top post on &lt;a href=\"/r/fitbit\"&gt;/r/fitbit&lt;/a&gt; is about a woman who realized that she was pregnant because of abnormally high HR readings, so that&amp;#39;s the first thing I think of in these situations!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5xp3q", "score_hidden": false, "stickied": false, "created": 1492036272.0, "created_utc": 1492007472.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ci91", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "meetmeinthemaze", "parent_id": "t1_dg5bllo", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Absolutely zero chance - IUD + haven't gotten busy since early January haha.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely zero chance - IUD + haven&amp;#39;t gotten busy since early January haha.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5ci91", "score_hidden": false, "stickied": false, "created": 1491993361.0, "created_utc": 1491964561.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5bllo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "space-ninja", "parent_id": "t3_64u065", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Is there any chance that you're pregnant?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there any chance that you&amp;#39;re pregnant?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg5bllo", "score_hidden": false, "stickied": false, "created": 1491992110.0, "created_utc": 1491963310.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]