[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "xxfitness", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 28 and 5&amp;#39;7&amp;quot; at 171 pounds. I realized I needed to start exercising and working on my weight about 3 weeks ago when I went to the doctor and I was at 180 pounds- a weight I&amp;#39;ve never seen on my body before. I was a student athlete in college and in high school and was never really that skinny (especially compared to my younger sister!) but I used to be a much healthier weight and strong. Years of adult life that included sitting at a computer and then going to grad school definitely have had their toll.&lt;/p&gt;\n\n&lt;p&gt;I have pretty much cut sweets out and am trying to keep my alcohol consumption low. I&amp;#39;ve cut calories to 1500 a day and have been feeling full and good on that. I&amp;#39;m doing some form of exercising every day and am trying to move my body as much as possible and I see that it is working- I&amp;#39;ve already lost 9 pounds and I feel good about that.&lt;/p&gt;\n\n&lt;p&gt;But- I am struggling to feel good about my body. I look in the mirror and I&amp;#39;m unhappy with what I see. I keep wanting to be at my goal weight (in the 140s) as fast as possible. I want to see the fat go away faster. Even though logically I know this is meant to be a lifestyle change and that its the long game so that I can feel good about myself long term (and I want that!). Even though I see the muscles forming, I feel stronger, I look a bit skinnier, I still don&amp;#39;t feel good about myself. And the thing is, before I started changing my diet and exercise habits, I felt fine about my body. I knew I had put on weight but I didn&amp;#39;t feel bad about it. &lt;/p&gt;\n\n&lt;p&gt;I guess I&amp;#39;m looking for advice from you wonderful ladies about how to manage the way I&amp;#39;m feeling about my body while keeping up the healthy progress I&amp;#39;ve made. Has anyone else felt this way? Does anyone have any tips about how to feel good while in this beginning stage?&lt;/p&gt;\n\n&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 28 and 5'7\" at 171 pounds. I realized I needed to start exercising and working on my weight about 3 weeks ago when I went to the doctor and I was at 180 pounds- a weight I've never seen on my body before. I was a student athlete in college and in high school and was never really that skinny (especially compared to my younger sister!) but I used to be a much healthier weight and strong. Years of adult life that included sitting at a computer and then going to grad school definitely have had their toll.\n\nI have pretty much cut sweets out and am trying to keep my alcohol consumption low. I've cut calories to 1500 a day and have been feeling full and good on that. I'm doing some form of exercising every day and am trying to move my body as much as possible and I see that it is working- I've already lost 9 pounds and I feel good about that.\n\nBut- I am struggling to feel good about my body. I look in the mirror and I'm unhappy with what I see. I keep wanting to be at my goal weight (in the 140s) as fast as possible. I want to see the fat go away faster. Even though logically I know this is meant to be a lifestyle change and that its the long game so that I can feel good about myself long term (and I want that!). Even though I see the muscles forming, I feel stronger, I look a bit skinnier, I still don't feel good about myself. And the thing is, before I started changing my diet and exercise habits, I felt fine about my body. I knew I had put on weight but I didn't feel bad about it. \n\nI guess I'm looking for advice from you wonderful ladies about how to manage the way I'm feeling about my body while keeping up the healthy progress I've made. Has anyone else felt this way? Does anyone have any tips about how to feel good while in this beginning stage?\n\nThanks!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "650ing", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 23, "report_reasons": null, "author": "l_hoh", "saved": false, "mod_reports": [], "name": "t3_650ing", "subreddit_name_prefixed": "r/xxfitness", "approved_by": null, "over_18": false, "domain": "self.xxfitness", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ryzy", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/xxfitness/comments/650ing/struggling_to_feel_good_about_myself_when_losing/", "num_reports": null, "locked": false, "stickied": false, "created": 1492055318.0, "url": "https://www.reddit.com/r/xxfitness/comments/650ing/struggling_to_feel_good_about_myself_when_losing/", "author_flair_text": null, "quarantine": false, "title": "Struggling to feel good about myself when losing weight", "created_utc": 1492026518.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": "", "user_reports": [], "id": "dg83dhq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "l_hoh", "parent_id": "t1_dg6ymc2", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I appreciate this standpoint. Thank you for taking the time to respond and be encouraging. Looking at the accomplishments every day would definitely help keep a positive mindset\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I appreciate this standpoint. Thank you for taking the time to respond and be encouraging. Looking at the accomplishments every day would definitely help keep a positive mindset&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg83dhq", "score_hidden": false, "stickied": false, "created": 1492141023.0, "created_utc": 1492112223.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ymc2", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "epicure-pen", "parent_id": "t3_650ing", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "If you like seeing your muscles come in, indulge yourself in a daily flex. Try on your most flattering clothes. Pamper your skin or get a mani/pedi. Write down one non-body related success you've had every day - like coming up with the perfect idea to solve a problem at work or litter training a kitten. See your friends as much as possible, surround yourself with positive people who love you no matter what are going to be thrilled to see you get healthier.\n\nA small word of caution: You have had an amazing start at weight loss, but the rate of 3 lb/week will probably not last. Your body will change very slowly, and that is part of why it is important to anchor your motivation and self worth on to other things. It sounds like the main reason you started doing this is for your health. Even if your weight will move very slowly to a healthier level, every single day that you eat mostly nutritious foods, include some activity, drink enough water, get enough sleep, and practice self care your health is tangibly improving. Even without weight loss increasing activity and improving diet and sleep quality can have measurable health benefits. Maybe the point I am trying to make is that your body reaching a healthy weight is a reflection of a whole host of other worthwhile goals.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you like seeing your muscles come in, indulge yourself in a daily flex. Try on your most flattering clothes. Pamper your skin or get a mani/pedi. Write down one non-body related success you&amp;#39;ve had every day - like coming up with the perfect idea to solve a problem at work or litter training a kitten. See your friends as much as possible, surround yourself with positive people who love you no matter what are going to be thrilled to see you get healthier.&lt;/p&gt;\n\n&lt;p&gt;A small word of caution: You have had an amazing start at weight loss, but the rate of 3 lb/week will probably not last. Your body will change very slowly, and that is part of why it is important to anchor your motivation and self worth on to other things. It sounds like the main reason you started doing this is for your health. Even if your weight will move very slowly to a healthier level, every single day that you eat mostly nutritious foods, include some activity, drink enough water, get enough sleep, and practice self care your health is tangibly improving. Even without weight loss increasing activity and improving diet and sleep quality can have measurable health benefits. Maybe the point I am trying to make is that your body reaching a healthy weight is a reflection of a whole host of other worthwhile goals.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg6ymc2", "score_hidden": false, "stickied": false, "created": 1492077525.0, "created_utc": 1492048725.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": "", "user_reports": [], "id": "dg6g5op", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "nightlywhiskey", "parent_id": "t3_650ing", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I am right there with you girl. I went to put on an item of clothing I dug out of a box (I move a lot) and couldn't even get into it in the slightest. I usually avoid scales so I didn't pay much attention to it, but stepping on it after that scared the daylights out of me. The lifestyle change has begun. The way I've managed to stay positive about it is having a friend there with me. Well, with me in the sense that he's helping me with what I should do for exercise, good foods, etc via text because he lives a few states away. But any time I get down on myself for feeling like crap about myself, he helps motivate me. So maybe you need a good friend that you trust completely and can be open with who can motivate you and help you learn to love yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am right there with you girl. I went to put on an item of clothing I dug out of a box (I move a lot) and couldn&amp;#39;t even get into it in the slightest. I usually avoid scales so I didn&amp;#39;t pay much attention to it, but stepping on it after that scared the daylights out of me. The lifestyle change has begun. The way I&amp;#39;ve managed to stay positive about it is having a friend there with me. Well, with me in the sense that he&amp;#39;s helping me with what I should do for exercise, good foods, etc via text because he lives a few states away. But any time I get down on myself for feeling like crap about myself, he helps motivate me. So maybe you need a good friend that you trust completely and can be open with who can motivate you and help you learn to love yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg6g5op", "score_hidden": false, "stickied": false, "created": 1492055669.0, "created_utc": 1492026869.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": "", "user_reports": [], "id": "dg6hwzl", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Banshee__Queen", "parent_id": "t3_650ing", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I'm the opposite since my goal is to gain weight and each time I go on the scale I'm thinking \"why can't I gain any faster\", thinking about binging to get there faster. However, I think instead of thinking of the end goal, set yourself short term goals (like \"I want to lose 2lbs this week) and be proud of your weight loss thus far. Instead of \"I have 30lbs to go\", think \"I've already lost 10lbs!\", to think of more positive things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m the opposite since my goal is to gain weight and each time I go on the scale I&amp;#39;m thinking &amp;quot;why can&amp;#39;t I gain any faster&amp;quot;, thinking about binging to get there faster. However, I think instead of thinking of the end goal, set yourself short term goals (like &amp;quot;I want to lose 2lbs this week) and be proud of your weight loss thus far. Instead of &amp;quot;I have 30lbs to go&amp;quot;, think &amp;quot;I&amp;#39;ve already lost 10lbs!&amp;quot;, to think of more positive things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg6hwzl", "score_hidden": false, "stickied": false, "created": 1492057471.0, "created_utc": 1492028671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": "", "user_reports": [], "id": "dg83edv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "l_hoh", "parent_id": "t1_dg6u9fo", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I love this! Thanks for your reply :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this! Thanks for your reply :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg83edv", "score_hidden": false, "stickied": false, "created": 1492141050.0, "created_utc": 1492112250.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6u9fo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "janeventure", "parent_id": "t3_650ing", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Maybe try looking at this on the smaller scale.  Instead of focusing just on losing a specific number of pounds, try looking at the progress you are making with your workout or diet, like \"I ran this far in this long\" or \"I ate this many serves of vegetables this week\", and then set yourself mini goals - achieving this will give you a nice endorphin rush and make you feel good, and motivate you to work towards the next one.\n\nOver time, this could help you develop a better mindset about it, and you'll start to see the difference, and really, just remember that no one gets there overnight, and you've already conquered the hardest part, which is just to get started!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe try looking at this on the smaller scale.  Instead of focusing just on losing a specific number of pounds, try looking at the progress you are making with your workout or diet, like &amp;quot;I ran this far in this long&amp;quot; or &amp;quot;I ate this many serves of vegetables this week&amp;quot;, and then set yourself mini goals - achieving this will give you a nice endorphin rush and make you feel good, and motivate you to work towards the next one.&lt;/p&gt;\n\n&lt;p&gt;Over time, this could help you develop a better mindset about it, and you&amp;#39;ll start to see the difference, and really, just remember that no one gets there overnight, and you&amp;#39;ve already conquered the hardest part, which is just to get started!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg6u9fo", "score_hidden": false, "stickied": false, "created": 1492072212.0, "created_utc": 1492043412.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": "", "user_reports": [], "id": "dg83fvo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "l_hoh", "parent_id": "t1_dg713eq", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Thanks for the response. I love your mindset and I will definitely try to keep in mind the things that make me feel good and do them!1", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the response. I love your mindset and I will definitely try to keep in mind the things that make me feel good and do them!1&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg83fvo", "score_hidden": false, "stickied": false, "created": 1492141097.0, "created_utc": 1492112297.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg713eq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "semisourpatchkid", "parent_id": "t3_650ing", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I'm currently struggling with this as well! I'm coming back from ACL reconstruction right now and I am just getting to the point where I can work out like I used to before I got injured. Small things that help me feel good are making sure I'm getting enough fiber (self explanatory haha), spray tans for special events if you are into that (no red tones), and minding my posture. I would also say try to train your brain to look in the mirror and not look at where you want to lose weight, but look at the leg muscles that got you through your run or workout, or at the arm muscles that are getting more defined. It is pretty cool to see how our bodies evolve over time even if we aren't quite where we want to be yet. If you like to watch YouTube videos, I love a channel called Aly Art. She sees faces and body types almost as artistic compositions of shapes and it's a really cool and different perspective that has helped me stop comparing myself to others. You've got this! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m currently struggling with this as well! I&amp;#39;m coming back from ACL reconstruction right now and I am just getting to the point where I can work out like I used to before I got injured. Small things that help me feel good are making sure I&amp;#39;m getting enough fiber (self explanatory haha), spray tans for special events if you are into that (no red tones), and minding my posture. I would also say try to train your brain to look in the mirror and not look at where you want to lose weight, but look at the leg muscles that got you through your run or workout, or at the arm muscles that are getting more defined. It is pretty cool to see how our bodies evolve over time even if we aren&amp;#39;t quite where we want to be yet. If you like to watch YouTube videos, I love a channel called Aly Art. She sees faces and body types almost as artistic compositions of shapes and it&amp;#39;s a really cool and different perspective that has helped me stop comparing myself to others. You&amp;#39;ve got this! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg713eq", "score_hidden": false, "stickied": false, "created": 1492080645.0, "created_utc": 1492051845.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": "", "user_reports": [], "id": "dg83jvq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "l_hoh", "parent_id": "t1_dg7pfxl", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I like your viewpoint about the dissatisfaction helping with commitment and I'll try to keep that in mind when I'm feeling unhappy about the way I look. I know what you mean about accepting and living in bodies unconsciously.  I'll try to be mindful about the dysmorphia and be patient with myself. Thanks for the thoughtful response and also the advice about lifting. I definitely could work that in more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like your viewpoint about the dissatisfaction helping with commitment and I&amp;#39;ll try to keep that in mind when I&amp;#39;m feeling unhappy about the way I look. I know what you mean about accepting and living in bodies unconsciously.  I&amp;#39;ll try to be mindful about the dysmorphia and be patient with myself. Thanks for the thoughtful response and also the advice about lifting. I definitely could work that in more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg83jvq", "score_hidden": false, "stickied": false, "created": 1492141217.0, "created_utc": 1492112417.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7pfxl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "garbageaccount97", "parent_id": "t3_650ing", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Yeah, I think before weight loss, people just accept and live in their bodies more or less unconsciously. Wanting to change your body, and having a goal state in mind, only highlights how far you are from it. Agree with focusing on performance goals. During my major weight loss, it helped to distract myself from negative thoughts about what my body looked like, just forced myself to move on to something else. Although tbh I think some of that dissatisfaction informed my commitment to losing. Not sure I'd have been as consistent otherwise. If I were thrilled with everything, I'd probably just not have bothered. But since it's upsetting you, distraction + performance. \n\nAnd lift now if you're not. I didn't lift heavy enough on the way down and ended up losing too much muscle imo, regretted that (once I learned that's what was going to help, after the fact :/). It will give you shape as you lose. \n\nBut you'll probably have some uncomfortable feelings for a while as your body adjusts to your new weight. Most people experience some kind of dysmorphia on the way down and even a bit into maintenance just because it takes a while for your brain (your mental map of your actual body) to catch up. Expect that. \n\nGood advice from people here :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I think before weight loss, people just accept and live in their bodies more or less unconsciously. Wanting to change your body, and having a goal state in mind, only highlights how far you are from it. Agree with focusing on performance goals. During my major weight loss, it helped to distract myself from negative thoughts about what my body looked like, just forced myself to move on to something else. Although tbh I think some of that dissatisfaction informed my commitment to losing. Not sure I&amp;#39;d have been as consistent otherwise. If I were thrilled with everything, I&amp;#39;d probably just not have bothered. But since it&amp;#39;s upsetting you, distraction + performance. &lt;/p&gt;\n\n&lt;p&gt;And lift now if you&amp;#39;re not. I didn&amp;#39;t lift heavy enough on the way down and ended up losing too much muscle imo, regretted that (once I learned that&amp;#39;s what was going to help, after the fact :/). It will give you shape as you lose. &lt;/p&gt;\n\n&lt;p&gt;But you&amp;#39;ll probably have some uncomfortable feelings for a while as your body adjusts to your new weight. Most people experience some kind of dysmorphia on the way down and even a bit into maintenance just because it takes a while for your brain (your mental map of your actual body) to catch up. Expect that. &lt;/p&gt;\n\n&lt;p&gt;Good advice from people here :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg7pfxl", "score_hidden": false, "stickied": false, "created": 1492126140.0, "created_utc": 1492097340.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_650ing", "likes": null, "replies": "", "user_reports": [], "id": "dg7tzuu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lordthadeus", "parent_id": "t1_dg6rgg8", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I've seen a lot of people say two pounds a week is the maximum healthy weight to lose per week.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen a lot of people say two pounds a week is the maximum healthy weight to lose per week.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg7tzuu", "score_hidden": false, "stickied": false, "created": 1492130995.0, "created_utc": 1492102195.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rgg8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bastaxxo", "parent_id": "t3_650ing", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Losing weight takes time. Shouldn't be more than a pound a week for a healthy rate. Focus on drinking lots of water, keeping somewhat of a schedule including a rest/ stretching day. Take pictures and compare every few weeks. It's better to see that than look at a scale! You may be cutting too many calories. You still need fuel for working out. Make healthier eating choices at less of a cut. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Losing weight takes time. Shouldn&amp;#39;t be more than a pound a week for a healthy rate. Focus on drinking lots of water, keeping somewhat of a schedule including a rest/ stretching day. Take pictures and compare every few weeks. It&amp;#39;s better to see that than look at a scale! You may be cutting too many calories. You still need fuel for working out. Make healthier eating choices at less of a cut. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg6rgg8", "score_hidden": false, "stickied": false, "created": 1492068745.0, "created_utc": 1492039945.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]