[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "xxfitness", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, there is a large chunk of instagram fitness people who eat a lot of &amp;quot;junk&amp;quot;. Everyday they&amp;#39;ll post pictures of ice cream tubs, candybars, whole cereal boxes etc, that they eat every day (along with giant bowls of real food like pasta or veggies, but not often). Of course I know they eat a crap ton of veg and stuff to balance it out, but stil! I personally have a huge sweet tooth, and though I only drink diet soda occasionally now, I have more than my fair share of junk food when it fits in my calorie count. &lt;/p&gt;\n\n&lt;p&gt;My question is... is eating like those people actually &amp;quot;healthy&amp;quot; if you work out all the time? What are your thoughts on those diets? Everytime I see these pages it makes me feel more comfortable adding cheetos and ice cream to my diet when allowed more often, but I can&amp;#39;t help but feel that it will hinder my muscle-building progress!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, there is a large chunk of instagram fitness people who eat a lot of \"junk\". Everyday they'll post pictures of ice cream tubs, candybars, whole cereal boxes etc, that they eat every day (along with giant bowls of real food like pasta or veggies, but not often). Of course I know they eat a crap ton of veg and stuff to balance it out, but stil! I personally have a huge sweet tooth, and though I only drink diet soda occasionally now, I have more than my fair share of junk food when it fits in my calorie count. \n\nMy question is... is eating like those people actually \"healthy\" if you work out all the time? What are your thoughts on those diets? Everytime I see these pages it makes me feel more comfortable adding cheetos and ice cream to my diet when allowed more often, but I can't help but feel that it will hinder my muscle-building progress!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6583le", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "tph3", "saved": false, "mod_reports": [], "name": "t3_6583le", "subreddit_name_prefixed": "r/xxfitness", "approved_by": null, "over_18": false, "domain": "self.xxfitness", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ryzy", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/xxfitness/comments/6583le/junk_food_diets/", "num_reports": null, "locked": false, "stickied": false, "created": 1492144259.0, "url": "https://www.reddit.com/r/xxfitness/comments/6583le/junk_food_diets/", "author_flair_text": null, "quarantine": false, "title": "\"Junk Food\" diets?", "created_utc": 1492115459.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": "", "user_reports": [], "id": "dg925yo", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MyShoulderHatesMe", "parent_id": "t1_dg87s61", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I just looked at these instagrams. I have a few comments:\n\n1. They're dudes. BIG dudes. No matter how active you are, they are always going to be able to eat significantly more calories. \n\n2. They are dudes in their early 20s. Guys can still get taller into their early 20s. Their metabolisms are still functioning at teenager level. Seriously. For many intents and purposes, they aren't even full adults yet.  \n\n3. They are posting their cheat days/ meals.\n\n4. All these guys do is workout and eat. They don't have normal lives.\n\n5. Eating like this is still unhealthy, regardless of how they look on the outside. \n\n6. The Nickvavitiss guy especially has a trash page. It's useless. There is nothing useful here. It's all a bunch of crap trying to convince people they don't really have to make a commitment to get fit/ look like him. It's essentially click bait to make people buy his programming, or whatever else he's selling. He should be totally ignored. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just looked at these instagrams. I have a few comments:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;They&amp;#39;re dudes. BIG dudes. No matter how active you are, they are always going to be able to eat significantly more calories. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;They are dudes in their early 20s. Guys can still get taller into their early 20s. Their metabolisms are still functioning at teenager level. Seriously. For many intents and purposes, they aren&amp;#39;t even full adults yet.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;They are posting their cheat days/ meals.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;All these guys do is workout and eat. They don&amp;#39;t have normal lives.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Eating like this is still unhealthy, regardless of how they look on the outside. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The Nickvavitiss guy especially has a trash page. It&amp;#39;s useless. There is nothing useful here. It&amp;#39;s all a bunch of crap trying to convince people they don&amp;#39;t really have to make a commitment to get fit/ look like him. It&amp;#39;s essentially click bait to make people buy his programming, or whatever else he&amp;#39;s selling. He should be totally ignored. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg925yo", "score_hidden": false, "stickied": false, "created": 1492201122.0, "created_utc": 1492172322.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": "", "user_reports": [], "id": "dg9gt2w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crunchingtime18", "parent_id": "t1_dg8p570", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Cereal is super fortified so technically it's fairly nutrient dense. It's added nutrition but it is in there. You would hit RDA on many micros or minerals through a whole box of cereal, including iron (although unless you ate it dry, the calcium in milk would likely prevent good absorption of that one).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cereal is super fortified so technically it&amp;#39;s fairly nutrient dense. It&amp;#39;s added nutrition but it is in there. You would hit RDA on many micros or minerals through a whole box of cereal, including iron (although unless you ate it dry, the calcium in milk would likely prevent good absorption of that one).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg9gt2w", "score_hidden": false, "stickied": false, "created": 1492220387.0, "created_utc": 1492191587.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8p570", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "MyShoulderHatesMe", "parent_id": "t1_dg87s61", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Agreeing with u/partyhardanalysis if they are maintaining at 3,000 - 4,000 calories (as a woman this likely means you're working out hard, 3-5 hours per day), and they have a significant portion of those calories left at the end of the day, they theoretically could eat a whole box of cereal. They just probably aren't. They are probably incorporating a couple of servings in, but still eating 90% of their calories from quality, nutritionally dense foods. Calories matter. Where they come from also matters. If you're eating a ton of sugar, for example, your blood sugar is going to be fucked. Over a prolonged period of time, this can be a cause of insulin resistance. That can lead to fat gain. If you aren't getting enough protein (pretty rare for the average person, maybe less rare for someone tying to train as a high level athlete), muscle growth will be hard.  We all know how bad consuming trans fats can be. If your food has calories, but few vitamins and minerals, you won't be able to perform at your peak. You might look great in your twenties, but by the time you hit your 30s, you're in for a rude awakening.\n\nThe truth is, mostly these instagram personalities or whatever they are, are full of crap. They post this stuff because if they're fun and relatable they get more followers. More followers means more sponsorships. I'm not saying they never eat this stuff. I'm sure many do. What I'm saying is that they post in a way that is misleading. They maybe had a doughnut or a couple of cookies, but post the whole box/ plate. They post a 30 minute hiit/ circuit workout that never uses more than 15 lb dumbbells, but in reality they were at the gym for 3 hours, doing lifting and cardio to supplement that workout. They post the selfie where they look amazing, after they get a fresh spray tan and take 40 photos before finding the one with the right lighting and angle. \n\nThis is why I only follow real, training athletes with athletic goals that take priority over aesthetics. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreeing with &lt;a href=\"/u/partyhardanalysis\"&gt;u/partyhardanalysis&lt;/a&gt; if they are maintaining at 3,000 - 4,000 calories (as a woman this likely means you&amp;#39;re working out hard, 3-5 hours per day), and they have a significant portion of those calories left at the end of the day, they theoretically could eat a whole box of cereal. They just probably aren&amp;#39;t. They are probably incorporating a couple of servings in, but still eating 90% of their calories from quality, nutritionally dense foods. Calories matter. Where they come from also matters. If you&amp;#39;re eating a ton of sugar, for example, your blood sugar is going to be fucked. Over a prolonged period of time, this can be a cause of insulin resistance. That can lead to fat gain. If you aren&amp;#39;t getting enough protein (pretty rare for the average person, maybe less rare for someone tying to train as a high level athlete), muscle growth will be hard.  We all know how bad consuming trans fats can be. If your food has calories, but few vitamins and minerals, you won&amp;#39;t be able to perform at your peak. You might look great in your twenties, but by the time you hit your 30s, you&amp;#39;re in for a rude awakening.&lt;/p&gt;\n\n&lt;p&gt;The truth is, mostly these instagram personalities or whatever they are, are full of crap. They post this stuff because if they&amp;#39;re fun and relatable they get more followers. More followers means more sponsorships. I&amp;#39;m not saying they never eat this stuff. I&amp;#39;m sure many do. What I&amp;#39;m saying is that they post in a way that is misleading. They maybe had a doughnut or a couple of cookies, but post the whole box/ plate. They post a 30 minute hiit/ circuit workout that never uses more than 15 lb dumbbells, but in reality they were at the gym for 3 hours, doing lifting and cardio to supplement that workout. They post the selfie where they look amazing, after they get a fresh spray tan and take 40 photos before finding the one with the right lighting and angle. &lt;/p&gt;\n\n&lt;p&gt;This is why I only follow real, training athletes with athletic goals that take priority over aesthetics. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg8p570", "score_hidden": false, "stickied": false, "created": 1492169402.0, "created_utc": 1492140602.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": "", "user_reports": [], "id": "dg88dm7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "partyhazardanalysis", "parent_id": "t1_dg87s61", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "They theoretically could (assuming the food falls in their calorie allowance) but they might feel like garbage because it's not a great nutritional choice. It may not be *optimal* for progress but it won't make you suddenly lose all your muscles and start over. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They theoretically could (assuming the food falls in their calorie allowance) but they might feel like garbage because it&amp;#39;s not a great nutritional choice. It may not be &lt;em&gt;optimal&lt;/em&gt; for progress but it won&amp;#39;t make you suddenly lose all your muscles and start over. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg88dm7", "score_hidden": false, "stickied": false, "created": 1492146619.0, "created_utc": 1492117819.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": "", "user_reports": [], "id": "dg9da2l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bacon_music_love", "parent_id": "t1_dg87s61", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "&gt; if they wanted to eat a whole box of cereal for dinner, they could \n\nI don't even know how I would eat that much volume. I've tried eating multiple servings of Frosted Mini-Wheats (for the fiber!), and I can't even finish two bowls. Even with other cereals that are way less filling, I couldn't eat more than a few bowls. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;if they wanted to eat a whole box of cereal for dinner, they could &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t even know how I would eat that much volume. I&amp;#39;ve tried eating multiple servings of Frosted Mini-Wheats (for the fiber!), and I can&amp;#39;t even finish two bowls. Even with other cereals that are way less filling, I couldn&amp;#39;t eat more than a few bowls. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg9da2l", "score_hidden": false, "stickied": false, "created": 1492216355.0, "created_utc": 1492187555.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87s61", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tph3", "parent_id": "t1_dg872tn", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Huh, I feel stupid now lmao. I follow Nickvavitiss and w_kemp for example and I was totally under the impression that if they wanted to eat a whole box of cereal for dinner, they could since the have a tdee of 4k cals (which I'm insanely jealous of!).\n\nNormally I just have lunch right after I work out, but maybe I have an excuse now to eat some junk afterwards instead ;) but seriously, never thought to eat some quick carbs right after lifting, might have to give it a shot!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Huh, I feel stupid now lmao. I follow Nickvavitiss and w_kemp for example and I was totally under the impression that if they wanted to eat a whole box of cereal for dinner, they could since the have a tdee of 4k cals (which I&amp;#39;m insanely jealous of!).&lt;/p&gt;\n\n&lt;p&gt;Normally I just have lunch right after I work out, but maybe I have an excuse now to eat some junk afterwards instead ;) but seriously, never thought to eat some quick carbs right after lifting, might have to give it a shot!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg87s61", "score_hidden": false, "stickied": false, "created": 1492145916.0, "created_utc": 1492117116.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg872tn", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "MyShoulderHatesMe", "parent_id": "t3_6583le", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Ha. These people don't actually eat like this. They might portion some of this stuff out to fit into their macros, but more likely than not, it makes up about 5-10% of their weekly diet. They aren't eating a whole tub of real ice cream, a whole box of cereal, etc. \n\nThat said, while eating processed, nutritionally bankrupt crap isn't ideal, there are ways to do it that can have minimal impact, and some actual benefit. A doughnut, or rice krispies treat after a heavy lifting day will actually help replenish glycogen stores, and give your body easy fuel to us towards muscle building/ repair. This will also lessen the impact the sugar has on your blood sugar levels. \n\nIIFYM (if it fits your macros) is based on the idea that you can eat whatever foods you want, provided you hit your target for calories, grams of fat, grams of protein, and grams of carbs for each day. Now, this doesn't really mean that you can eat whatever you want all of the time. It does mean that if you get to the end of the day, after eating well for most of the day/ week, and you have the macros left for an order of fries; go ahead and chow down. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ha. These people don&amp;#39;t actually eat like this. They might portion some of this stuff out to fit into their macros, but more likely than not, it makes up about 5-10% of their weekly diet. They aren&amp;#39;t eating a whole tub of real ice cream, a whole box of cereal, etc. &lt;/p&gt;\n\n&lt;p&gt;That said, while eating processed, nutritionally bankrupt crap isn&amp;#39;t ideal, there are ways to do it that can have minimal impact, and some actual benefit. A doughnut, or rice krispies treat after a heavy lifting day will actually help replenish glycogen stores, and give your body easy fuel to us towards muscle building/ repair. This will also lessen the impact the sugar has on your blood sugar levels. &lt;/p&gt;\n\n&lt;p&gt;IIFYM (if it fits your macros) is based on the idea that you can eat whatever foods you want, provided you hit your target for calories, grams of fat, grams of protein, and grams of carbs for each day. Now, this doesn&amp;#39;t really mean that you can eat whatever you want all of the time. It does mean that if you get to the end of the day, after eating well for most of the day/ week, and you have the macros left for an order of fries; go ahead and chow down. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg872tn", "score_hidden": false, "stickied": false, "created": 1492145116.0, "created_utc": 1492116316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": "", "user_reports": [], "id": "dg88vme", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TheAlpinista", "parent_id": "t1_dg88brv", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Also, I think they're trying to make a statement that there are no foods that are \"bad\". Because everyone knows that chicken and kale is healthy there isn't a ton of controversy ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, I think they&amp;#39;re trying to make a statement that there are no foods that are &amp;quot;bad&amp;quot;. Because everyone knows that chicken and kale is healthy there isn&amp;#39;t a ton of controversy &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg88vme", "score_hidden": false, "stickied": false, "created": 1492147221.0, "created_utc": 1492118421.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg88brv", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "krissycole87", "parent_id": "t3_6583le", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I see this all the time too! But as someone else mentioned, I think it is mostly just the \"cheat\" stuff that they end up posting. No one wants to see pre-portioned chicken breast and asparagus in their feed everyday LOL  \nAlso remember that if these are men, especially men who are bulking, they are eating 3k-4k calories a day, so its MUCH easier to fit high calorie foods into their day, while still leaving enough cals to eat their low calorie, high protein foods and still hit their macros. Sometimes they even need these high calorie foods just to hit their calorie intake for the day.  \nThat being said, if you ate 1500 cals of chicken one day and 1500 cals of cheetos one day, your body and muscles would definitely benefit more from the chicken. Its all about finding room for those indulgences, while still getting the nutrients you need from the rest of your diet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see this all the time too! But as someone else mentioned, I think it is mostly just the &amp;quot;cheat&amp;quot; stuff that they end up posting. No one wants to see pre-portioned chicken breast and asparagus in their feed everyday LOL&lt;br/&gt;\nAlso remember that if these are men, especially men who are bulking, they are eating 3k-4k calories a day, so its MUCH easier to fit high calorie foods into their day, while still leaving enough cals to eat their low calorie, high protein foods and still hit their macros. Sometimes they even need these high calorie foods just to hit their calorie intake for the day.&lt;br/&gt;\nThat being said, if you ate 1500 cals of chicken one day and 1500 cals of cheetos one day, your body and muscles would definitely benefit more from the chicken. Its all about finding room for those indulgences, while still getting the nutrients you need from the rest of your diet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg88brv", "score_hidden": false, "stickied": false, "created": 1492146555.0, "created_utc": 1492117755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": "", "user_reports": [], "id": "dgahkud", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_shinything", "parent_id": "t1_dgagny1", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I train circus arts, with aerial straps being my main discipline. It's a lot of upper body and core work.\n\nGenetically I don't tend to store much fat either and have always had a pretty low body fat percentage. [Bikini pic, benefiting from good lighting](https://scontent.fbed1-1.fna.fbcdn.net/v/t31.0-8/fr/cp0/e15/q65/17761117_3405903627069_553791602587598752_o.jpg?efg=eyJpIjoidCJ9&amp;oh=651e9493a781809a47d9563a537bfc7a&amp;oe=594CFD8C)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I train circus arts, with aerial straps being my main discipline. It&amp;#39;s a lot of upper body and core work.&lt;/p&gt;\n\n&lt;p&gt;Genetically I don&amp;#39;t tend to store much fat either and have always had a pretty low body fat percentage. &lt;a href=\"https://scontent.fbed1-1.fna.fbcdn.net/v/t31.0-8/fr/cp0/e15/q65/17761117_3405903627069_553791602587598752_o.jpg?efg=eyJpIjoidCJ9&amp;amp;oh=651e9493a781809a47d9563a537bfc7a&amp;amp;oe=594CFD8C\"&gt;Bikini pic, benefiting from good lighting&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dgahkud", "score_hidden": false, "stickied": false, "created": 1492277166.0, "created_utc": 1492248366.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgagny1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "goldenruby", "parent_id": "t1_dg87n1j", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "what kinds of workouts do you do? If you don't mind me asking", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what kinds of workouts do you do? If you don&amp;#39;t mind me asking&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dgagny1", "score_hidden": false, "stickied": false, "created": 1492274258.0, "created_utc": 1492245458.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87n1j", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "_shinything", "parent_id": "t3_6583le", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I think this really depends on the individual. Obviously, you only see a snapshot of these people's lives through their Instagram and whatnot, and people tend to post their fancy meals out, desserts, etc., so there's a skewed perception of the individual.\n\nBut depending on how much someone works out and their genetic build, they really could eat \"junk\" and still be perfectly fit and healthy.\n\nI work out between 10-15 hours a week and I don't care what I eat, because at the end of the day I will always be burning more than I take in. I eat ice cream almost every day (current obsession: Yasso!) and it doesn't really matter, because I'm probably still at a deficit simply due to how active I am, the fact that muscle burns more calories, genetics, etc. This hasn't prevented me from getting stronger or building more muscle.\n\nThe important thing is knowing how your individual body functions!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this really depends on the individual. Obviously, you only see a snapshot of these people&amp;#39;s lives through their Instagram and whatnot, and people tend to post their fancy meals out, desserts, etc., so there&amp;#39;s a skewed perception of the individual.&lt;/p&gt;\n\n&lt;p&gt;But depending on how much someone works out and their genetic build, they really could eat &amp;quot;junk&amp;quot; and still be perfectly fit and healthy.&lt;/p&gt;\n\n&lt;p&gt;I work out between 10-15 hours a week and I don&amp;#39;t care what I eat, because at the end of the day I will always be burning more than I take in. I eat ice cream almost every day (current obsession: Yasso!) and it doesn&amp;#39;t really matter, because I&amp;#39;m probably still at a deficit simply due to how active I am, the fact that muscle burns more calories, genetics, etc. This hasn&amp;#39;t prevented me from getting stronger or building more muscle.&lt;/p&gt;\n\n&lt;p&gt;The important thing is knowing how your individual body functions!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg87n1j", "score_hidden": false, "stickied": false, "created": 1492145758.0, "created_utc": 1492116958.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": "", "user_reports": [], "id": "dg8l4by", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "princess_volupine", "parent_id": "t3_6583le", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Are you sure they're eating junk everyday and not just sharing pictures of their cheat day snacks? I  think you should go with whatever works for you. Nothing wrong with having cheetos every once in a while!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you sure they&amp;#39;re eating junk everyday and not just sharing pictures of their cheat day snacks? I  think you should go with whatever works for you. Nothing wrong with having cheetos every once in a while!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg8l4by", "score_hidden": false, "stickied": false, "created": 1492163531.0, "created_utc": 1492134731.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": "", "user_reports": [], "id": "dg8y73m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "imakemediocrepies", "parent_id": "t3_6583le", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Well, maybe it isn't exactly healthy, but I guess for some people, having a cheat meal/day occasionally is healthy for the mind. \n\nIf you want to see how having junk food occasionally but staying healthy at the same time, you should check out Natacha Oceane on YouTube. I actually found her through her (multiple) 10k calorie challenge, but she talks about having refeed days, normal eating days and full blown cheat days, while she honestly has my goal body. I personally don't think I could ever have a full cheat day, but it's fun to watch other people do anyway!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, maybe it isn&amp;#39;t exactly healthy, but I guess for some people, having a cheat meal/day occasionally is healthy for the mind. &lt;/p&gt;\n\n&lt;p&gt;If you want to see how having junk food occasionally but staying healthy at the same time, you should check out Natacha Oceane on YouTube. I actually found her through her (multiple) 10k calorie challenge, but she talks about having refeed days, normal eating days and full blown cheat days, while she honestly has my goal body. I personally don&amp;#39;t think I could ever have a full cheat day, but it&amp;#39;s fun to watch other people do anyway!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg8y73m", "score_hidden": false, "stickied": false, "created": 1492189792.0, "created_utc": 1492160992.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": "", "user_reports": [], "id": "dg8oy5s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chortlesandgiggles", "parent_id": "t3_6583le", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I have a mega sweet tooth myself, and all I know is that once I cut sugar and really cleaned up my diet, the results were phenomenal. i had low bf % but after getting rid of sugar and junk my six pack finally decided to make an appearance. Now, I'm not even tempted by it because I feel so much healthier and energetic without it! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a mega sweet tooth myself, and all I know is that once I cut sugar and really cleaned up my diet, the results were phenomenal. i had low bf % but after getting rid of sugar and junk my six pack finally decided to make an appearance. Now, I&amp;#39;m not even tempted by it because I feel so much healthier and energetic without it! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg8oy5s", "score_hidden": false, "stickied": false, "created": 1492169100.0, "created_utc": 1492140300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_6583le", "likes": null, "replies": "", "user_reports": [], "id": "dg9037t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pollyhotpocketposts", "parent_id": "t3_6583le", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Hashtag wholepintclub", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hashtag wholepintclub&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg9037t", "score_hidden": false, "stickied": false, "created": 1492195894.0, "created_utc": 1492167094.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]