[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "xxfitness", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Heyo, long post coming. First-time poster, been lurking around for a few days, and I want to tell my story so far. I&amp;#39;m 21F, 5&amp;#39;5&amp;quot;, in college, currently weighing 131, down from highest ever of 150, and working through tendencies to binge and overeat. &lt;/p&gt;\n\n&lt;p&gt;Throughout my teen years I wasn&amp;#39;t 100% happy with my body, but I didn&amp;#39;t want to get caught in the seemingly ubiquitous cycle of self-hatred and scale obsession, so I worked hard to be cool with how I looked. I&amp;#39;m very pear-shaped, so finding clothes that fit (pants, especially) can be hard, but I&amp;#39;ve always found things I liked and that were flattering, and I just accepted that my adult weight seemed to be ~ 140 lbs. I was very sedentary throughout high school, not interested in any active things, and I love food, so the idea of changing my body never seriously occurred to me as a possibility. Three years ago I got up to 150, and have wavered between 140 and 150 since then, always thinking &amp;quot;eh, this is the body I got, might as well be grateful for it!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;A required health class freshman year introduced me to the gym and basic nutrition, and slowly I&amp;#39;ve been moving toward more regular exercise (despite mostly hating exercise) and better eating habits. Last August I stumbled on NerdFitness. The minute I saw Staci&amp;#39;s intro post and found that women can weightlift, I knew I wanted to do that. I started out super slowly, trying to learn basic squat form and working toward pushups and pullups . . . and  then the school year started and everything went out the window for the busiest semester I&amp;#39;ve had yet. &lt;/p&gt;\n\n&lt;p&gt;Fast forward to this semester, which has been much more laid-back, with a focus on mental and physical health. I got myself a bedtime routine and figured out how to go to bed on time and get up early for the first time in over a decade. I&amp;#39;ve been in therapy for depression and stuff. Getting up early meant I was actually able to go to the gym in the mornings before class. I started eating more fruits and vegetables, and then one day I stepped on the scale and it said 135. &lt;/p&gt;\n\n&lt;p&gt;That threw me for a loop. Seriously, the thought in my head was &amp;quot;I didn&amp;#39;t know the numbers could go ...down?&amp;quot; Then, a day or two later: &amp;quot;I wonder if I could make it go down further?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I was super scared of fucking up my relationship with food, but about then my roommate started dieting and I decided to try. I did a ton of reading about building muscle and cutting and started tracking my food with Cronometer on March 18th. Since then, I&amp;#39;ve averaged ~1500 cals/day (usually more or less, but it averages out) and 100g of protein. &lt;/p&gt;\n\n&lt;p&gt;Ladies, it&amp;#39;s been frustrating but I&amp;#39;ve learned so much about myself! I&amp;#39;ve seen the period water weight retention in action, noticed just how much I nibble on whatever I&amp;#39;m cooking, and started learning about actual portion sizes. I&amp;#39;ve noticed my habits already changing from mindless eating to actual planning of balanced meals, thoroughly enjoying them, and then waiting (often with the help of tea or sugarfree gum) until the next mealtime or snack time. All this time I was scared of fucking up my relationship with food ... but it was already pretty weird, and it&amp;#39;s slowly getting better. &lt;/p&gt;\n\n&lt;p&gt;Today was measuring/calculating day. Since Feb 27th I&amp;#39;ve lost 4 pounds, 2 inches from my waist, and bits of inches from other places. According to the healthstatus.com calculator, I&amp;#39;ve dropped from 29-30% BF to 26% (and I estimate I was around 32% last August). I&amp;#39;ve gained muscle, and I have bulges in my arms where I never did before. I can SEE that my stomach is smaller. My butt, which has always been big and round, has started looking tighter and perkier. I didn&amp;#39;t realize until now how unhappy I was with my stomach or butt, but the idea that I have some control over how I look feels revolutionary, and every week I feel more awesome and badass. &lt;/p&gt;\n\n&lt;p&gt;This week I&amp;#39;ve been especially frustrated with all my clothes. Partly it&amp;#39;s end-of-the-season malaise and boredom, but some of it is that they don&amp;#39;t all fit right anymore. So today I went to our student clothing exchange, and found several cute things, including several skirts that I immediately thought &amp;quot;that&amp;#39;s too small for me&amp;quot; ...but they FIT and look AMAZING. I even found a pair of skinny jeans that fit like a glove. I have NEVER worn skinny jeans ... always assumed they just weren&amp;#39;t for me. My roommate says they look damn good, though, and that I have to wear them. I haven&amp;#39;t gotten used to the idea.&lt;/p&gt;\n\n&lt;p&gt;TL;DR: I&amp;#39;m down 20lbs from my heaviest, stronger than I&amp;#39;ve ever been, and falling in love with fitness. Right now I lift 3-4x/week (mostly high bar squats, assisted pullups, and incline pushups) and walk around campus to my classes, plus more walking on rest days when I can make myself do it. Got a bunch of new clothes in smaller sizes than I&amp;#39;m used to and I&amp;#39;m super excited and just generally in awe of my body. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Heyo, long post coming. First-time poster, been lurking around for a few days, and I want to tell my story so far. I'm 21F, 5'5\", in college, currently weighing 131, down from highest ever of 150, and working through tendencies to binge and overeat. \n\nThroughout my teen years I wasn't 100% happy with my body, but I didn't want to get caught in the seemingly ubiquitous cycle of self-hatred and scale obsession, so I worked hard to be cool with how I looked. I'm very pear-shaped, so finding clothes that fit (pants, especially) can be hard, but I've always found things I liked and that were flattering, and I just accepted that my adult weight seemed to be ~ 140 lbs. I was very sedentary throughout high school, not interested in any active things, and I love food, so the idea of changing my body never seriously occurred to me as a possibility. Three years ago I got up to 150, and have wavered between 140 and 150 since then, always thinking \"eh, this is the body I got, might as well be grateful for it!\"\n\nA required health class freshman year introduced me to the gym and basic nutrition, and slowly I've been moving toward more regular exercise (despite mostly hating exercise) and better eating habits. Last August I stumbled on NerdFitness. The minute I saw Staci's intro post and found that women can weightlift, I knew I wanted to do that. I started out super slowly, trying to learn basic squat form and working toward pushups and pullups . . . and  then the school year started and everything went out the window for the busiest semester I've had yet. \n\nFast forward to this semester, which has been much more laid-back, with a focus on mental and physical health. I got myself a bedtime routine and figured out how to go to bed on time and get up early for the first time in over a decade. I've been in therapy for depression and stuff. Getting up early meant I was actually able to go to the gym in the mornings before class. I started eating more fruits and vegetables, and then one day I stepped on the scale and it said 135. \n\nThat threw me for a loop. Seriously, the thought in my head was \"I didn't know the numbers could go ...down?\" Then, a day or two later: \"I wonder if I could make it go down further?\" \n\nI was super scared of fucking up my relationship with food, but about then my roommate started dieting and I decided to try. I did a ton of reading about building muscle and cutting and started tracking my food with Cronometer on March 18th. Since then, I've averaged ~1500 cals/day (usually more or less, but it averages out) and 100g of protein. \n\nLadies, it's been frustrating but I've learned so much about myself! I've seen the period water weight retention in action, noticed just how much I nibble on whatever I'm cooking, and started learning about actual portion sizes. I've noticed my habits already changing from mindless eating to actual planning of balanced meals, thoroughly enjoying them, and then waiting (often with the help of tea or sugarfree gum) until the next mealtime or snack time. All this time I was scared of fucking up my relationship with food ... but it was already pretty weird, and it's slowly getting better. \n\nToday was measuring/calculating day. Since Feb 27th I've lost 4 pounds, 2 inches from my waist, and bits of inches from other places. According to the healthstatus.com calculator, I've dropped from 29-30% BF to 26% (and I estimate I was around 32% last August). I've gained muscle, and I have bulges in my arms where I never did before. I can SEE that my stomach is smaller. My butt, which has always been big and round, has started looking tighter and perkier. I didn't realize until now how unhappy I was with my stomach or butt, but the idea that I have some control over how I look feels revolutionary, and every week I feel more awesome and badass. \n\nThis week I've been especially frustrated with all my clothes. Partly it's end-of-the-season malaise and boredom, but some of it is that they don't all fit right anymore. So today I went to our student clothing exchange, and found several cute things, including several skirts that I immediately thought \"that's too small for me\" ...but they FIT and look AMAZING. I even found a pair of skinny jeans that fit like a glove. I have NEVER worn skinny jeans ... always assumed they just weren't for me. My roommate says they look damn good, though, and that I have to wear them. I haven't gotten used to the idea.\n\nTL;DR: I'm down 20lbs from my heaviest, stronger than I've ever been, and falling in love with fitness. Right now I lift 3-4x/week (mostly high bar squats, assisted pullups, and incline pushups) and walk around campus to my classes, plus more walking on rest days when I can make myself do it. Got a bunch of new clothes in smaller sizes than I'm used to and I'm super excited and just generally in awe of my body. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "659pxp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 34, "report_reasons": null, "author": "sussurkate", "saved": false, "mod_reports": [], "name": "t3_659pxp", "subreddit_name_prefixed": "r/xxfitness", "approved_by": null, "over_18": false, "domain": "self.xxfitness", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ryzy", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/xxfitness/comments/659pxp/long_posting_to_celebrate_progress_and_new_clothes/", "num_reports": null, "locked": false, "stickied": false, "created": 1492162079.0, "url": "https://www.reddit.com/r/xxfitness/comments/659pxp/long_posting_to_celebrate_progress_and_new_clothes/", "author_flair_text": null, "quarantine": false, "title": "(Long) Posting to celebrate progress, and new clothes!", "created_utc": 1492133279.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 34}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_659pxp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_659pxp", "likes": null, "replies": "", "user_reports": [], "id": "dg8l31c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sussurkate", "parent_id": "t1_dg8kyq2", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I desperately want to find pants/slacks that I can live/work/teach in, but that quest has not yet succeeded. Can't wait to build more upper body muscle, though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I desperately want to find pants/slacks that I can live/work/teach in, but that quest has not yet succeeded. Can&amp;#39;t wait to build more upper body muscle, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg8l31c", "score_hidden": false, "stickied": false, "created": 1492163481.0, "created_utc": 1492134681.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8kyq2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "albeaner", "parent_id": "t3_659pxp", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "As a fellow pear I love lifting because we've always had big butts/thighs, but now they are just as big but shapely and muscley! \n\nI do hate pants though. But I do find that more upper body muscle evens things out so we can pull off shift dresses and other things we would have never considered before!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a fellow pear I love lifting because we&amp;#39;ve always had big butts/thighs, but now they are just as big but shapely and muscley! &lt;/p&gt;\n\n&lt;p&gt;I do hate pants though. But I do find that more upper body muscle evens things out so we can pull off shift dresses and other things we would have never considered before!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg8kyq2", "score_hidden": false, "stickied": false, "created": 1492163317.0, "created_utc": 1492134517.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_659pxp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_659pxp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_659pxp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_659pxp", "likes": null, "replies": "", "user_reports": [], "id": "dg8l7jf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sussurkate", "parent_id": "t1_dg8l3ov", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Good luck with that!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck with that!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg8l7jf", "score_hidden": false, "stickied": false, "created": 1492163656.0, "created_utc": 1492134856.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8l3ov", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Amandaj208", "parent_id": "t1_dg8l0ca", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "I'm trying to recomp now. I'm eating slightly below maintenance and have been seriously lifting for about a month. Once I get some more muscle on me I'll see what I'm feeling and might cut a little bit more", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m trying to recomp now. I&amp;#39;m eating slightly below maintenance and have been seriously lifting for about a month. Once I get some more muscle on me I&amp;#39;ll see what I&amp;#39;m feeling and might cut a little bit more&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg8l3ov", "score_hidden": false, "stickied": false, "created": 1492163506.0, "created_utc": 1492134706.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8l0ca", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sussurkate", "parent_id": "t1_dg8kpqw", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Are you maintaining where you are or trying to lose more?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you maintaining where you are or trying to lose more?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg8l0ca", "score_hidden": false, "stickied": false, "created": 1492163378.0, "created_utc": 1492134578.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8kpqw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Amandaj208", "parent_id": "t3_659pxp", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Yeah!! What an awesome feeling. We have very similar stats. I'm 5'5 and sitting at 131. A year ago I was 145. Today I put on a pair of work pants I wear all the time and they wouldn't stay up. Awesome feeling!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah!! What an awesome feeling. We have very similar stats. I&amp;#39;m 5&amp;#39;5 and sitting at 131. A year ago I was 145. Today I put on a pair of work pants I wear all the time and they wouldn&amp;#39;t stay up. Awesome feeling!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg8kpqw", "score_hidden": false, "stickied": false, "created": 1492162972.0, "created_utc": 1492134172.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_659pxp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_659pxp", "likes": null, "replies": "", "user_reports": [], "id": "dgcp3zb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sussurkate", "parent_id": "t1_dg9sdms", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "well as a kid I heard a lot of warnings against crash dieting, and I thought if I ever started monitoring what I ate I'd suddenly be obsessed with \"good\" vs \"bad\" foods, weighing every gram, eating only salads, consumed with guilt any time I had a piece of chocolate, etc, etc. \n\nSince I started tracking, though, I've realized how much of what I was eating was mindless snacking or emotional soothing, and that's not super healthy either. I also have bingey tendencies. It's been empowering to realize that (1) I can have ice cream anytime I want it enough to fit it into my macros, (2) 90% of the time I actually have the willpower to stick to my planned meals, (3) chewing gum and/or sliced cucumbers are often plenty to satisfy my chewing urge. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well as a kid I heard a lot of warnings against crash dieting, and I thought if I ever started monitoring what I ate I&amp;#39;d suddenly be obsessed with &amp;quot;good&amp;quot; vs &amp;quot;bad&amp;quot; foods, weighing every gram, eating only salads, consumed with guilt any time I had a piece of chocolate, etc, etc. &lt;/p&gt;\n\n&lt;p&gt;Since I started tracking, though, I&amp;#39;ve realized how much of what I was eating was mindless snacking or emotional soothing, and that&amp;#39;s not super healthy either. I also have bingey tendencies. It&amp;#39;s been empowering to realize that (1) I can have ice cream anytime I want it enough to fit it into my macros, (2) 90% of the time I actually have the willpower to stick to my planned meals, (3) chewing gum and/or sliced cucumbers are often plenty to satisfy my chewing urge. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dgcp3zb", "score_hidden": false, "stickied": false, "created": 1492411381.0, "created_utc": 1492382581.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9sdms", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "triple_skyfall", "parent_id": "t3_659pxp", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Sounds like you've made great progress physically and mentally (the often much harder part).  Keep up the great work!\n\nWhat do you mean when you say:  \"I'm super scared of fucking up my relationship with food\"?  Is this related to an eating disorder?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you&amp;#39;ve made great progress physically and mentally (the often much harder part).  Keep up the great work!&lt;/p&gt;\n\n&lt;p&gt;What do you mean when you say:  &amp;quot;I&amp;#39;m super scared of fucking up my relationship with food&amp;quot;?  Is this related to an eating disorder?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dg9sdms", "score_hidden": false, "stickied": false, "created": 1492234356.0, "created_utc": 1492205556.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]