[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "xxfitness", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey everyone, &lt;/p&gt;\n\n&lt;p&gt;In the past &lt;em&gt;almost two years&lt;/em&gt; I have lost a little over 100 pounds by switching up from junk eating to clean and sustainable eating. Which has been a wonderful thing! I went from almost 300 pounds down to 165.\nI am now a member of a great local gym and am trying to to tone up and strength train. However, I seem to be making little progress and am a little confused at the moment. I still eat well, workout and lift and I haven&amp;#39;t dropped anymore pants size or shirt size. In fact, the only thing I can &lt;em&gt;see&lt;/em&gt; in my triceps getting bigger.\nMy target areas (though I know target workouts don&amp;#39;t work) are my arms, tummy and thighs. \nI know &amp;#39;Rome wasn&amp;#39;t built in a day&amp;#39; and I love the hard work but it&amp;#39;s discouraging when you feel like you have stopped the progress train and the work you put in is for nothing.\nI work out 6 days a week in the am, take supplements and plenty of protein. \nWhat is going on?!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey everyone, \n\nIn the past *almost two years* I have lost a little over 100 pounds by switching up from junk eating to clean and sustainable eating. Which has been a wonderful thing! I went from almost 300 pounds down to 165.\nI am now a member of a great local gym and am trying to to tone up and strength train. However, I seem to be making little progress and am a little confused at the moment. I still eat well, workout and lift and I haven't dropped anymore pants size or shirt size. In fact, the only thing I can *see* in my triceps getting bigger.\nMy target areas (though I know target workouts don't work) are my arms, tummy and thighs. \nI know 'Rome wasn't built in a day' and I love the hard work but it's discouraging when you feel like you have stopped the progress train and the work you put in is for nothing.\nI work out 6 days a week in the am, take supplements and plenty of protein. \nWhat is going on?!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ozmh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "Boingo88", "saved": false, "mod_reports": [], "name": "t3_65ozmh", "subreddit_name_prefixed": "r/xxfitness", "approved_by": null, "over_18": false, "domain": "self.xxfitness", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ryzy", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/xxfitness/comments/65ozmh/hit_a_brick_wall/", "num_reports": null, "locked": false, "stickied": false, "created": 1492376473.0, "url": "https://www.reddit.com/r/xxfitness/comments/65ozmh/hit_a_brick_wall/", "author_flair_text": null, "quarantine": false, "title": "Hit a brick wall!", "created_utc": 1492347673.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_65ozmh", "likes": null, "replies": "", "user_reports": [], "id": "dgc38mr", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "milly_nz", "parent_id": "t3_65ozmh", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "130kg to 74kg. First of all, can we all just admire this person for getting the main job done of shedding excess fat??\n\nBack to your main point: Don't worry that the scales aren't moving - muscle is denser than fat, but scales can't tell the difference.  Which makes them the least helpful of all the flawed metrics at this point of your fitness journey. Scales probably won't move if you're still losing fat stores AND building muscle.  Whip out the tape measure and take progress pix. Or keep a journal of how much you can lift &amp; how long you can run etc and watch how those numbers improve.  \n\nNever forget to be happy with the fact that you're *feeling* healthier and can move in a way that simply wasn't possible before you started all of this. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;130kg to 74kg. First of all, can we all just admire this person for getting the main job done of shedding excess fat??&lt;/p&gt;\n\n&lt;p&gt;Back to your main point: Don&amp;#39;t worry that the scales aren&amp;#39;t moving - muscle is denser than fat, but scales can&amp;#39;t tell the difference.  Which makes them the least helpful of all the flawed metrics at this point of your fitness journey. Scales probably won&amp;#39;t move if you&amp;#39;re still losing fat stores AND building muscle.  Whip out the tape measure and take progress pix. Or keep a journal of how much you can lift &amp;amp; how long you can run etc and watch how those numbers improve.  &lt;/p&gt;\n\n&lt;p&gt;Never forget to be happy with the fact that you&amp;#39;re &lt;em&gt;feeling&lt;/em&gt; healthier and can move in a way that simply wasn&amp;#39;t possible before you started all of this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dgc38mr", "score_hidden": false, "stickied": false, "created": 1492382137.0, "created_utc": 1492353337.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_65ozmh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_65ozmh", "likes": null, "replies": "", "user_reports": [], "id": "dgc3d9x", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "milly_nz", "parent_id": "t1_dgc1b8q", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Nah she's entered recomp (maintenance wouldn't account for triceps growing). A lot of people feel discouraged at that point because they don't understand the scales often don't move precisely because the muscle mass they're growing is denser than the fat they're shedding. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah she&amp;#39;s entered recomp (maintenance wouldn&amp;#39;t account for triceps growing). A lot of people feel discouraged at that point because they don&amp;#39;t understand the scales often don&amp;#39;t move precisely because the muscle mass they&amp;#39;re growing is denser than the fat they&amp;#39;re shedding. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dgc3d9x", "score_hidden": false, "stickied": false, "created": 1492382332.0, "created_utc": 1492353532.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1b8q", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "bigiszi", "parent_id": "t3_65ozmh", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Well, I didn't really see any change for the first three-4 months from starting lifting. I was getting stronger tho. Patience.\n\nAs for weight loss - congrats!! Your stall could be lots of things but likely is now you are lighter, you burn fewer calories so you need to eat less. Lots of people talk about the plateau and it is largely down to this - you are no longer cutting - your current calorie consumption is your maintenance level. The fact you can see your triceps shows your BF% is getting lowish :D. Well done!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I didn&amp;#39;t really see any change for the first three-4 months from starting lifting. I was getting stronger tho. Patience.&lt;/p&gt;\n\n&lt;p&gt;As for weight loss - congrats!! Your stall could be lots of things but likely is now you are lighter, you burn fewer calories so you need to eat less. Lots of people talk about the plateau and it is largely down to this - you are no longer cutting - your current calorie consumption is your maintenance level. The fact you can see your triceps shows your BF% is getting lowish :D. Well done!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dgc1b8q", "score_hidden": false, "stickied": false, "created": 1492378932.0, "created_utc": 1492350132.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_65ozmh", "likes": null, "replies": "", "user_reports": [], "id": "dgcajjz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "run_cueca", "parent_id": "t3_65ozmh", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "How long have your been stuck? \n\nIn any case, losing weight now will be harder. The 100lbs you lost, your body had no need for it, it wanted to get rid of it. You're closer to a healthy weight now, so your body isnt as excited to lose the weight. You can't do a daily 500-1000 deficit like before. \n\nHow do you feel? Are you putting your all into your exercise, or just doing what you can? You might want to look into a refeed to just stay at maintenence for a while and focus on exercising, then get back to the deficit. \n\nGood luck, and great job so far! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How long have your been stuck? &lt;/p&gt;\n\n&lt;p&gt;In any case, losing weight now will be harder. The 100lbs you lost, your body had no need for it, it wanted to get rid of it. You&amp;#39;re closer to a healthy weight now, so your body isnt as excited to lose the weight. You can&amp;#39;t do a daily 500-1000 deficit like before. &lt;/p&gt;\n\n&lt;p&gt;How do you feel? Are you putting your all into your exercise, or just doing what you can? You might want to look into a refeed to just stay at maintenence for a while and focus on exercising, then get back to the deficit. &lt;/p&gt;\n\n&lt;p&gt;Good luck, and great job so far! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dgcajjz", "score_hidden": false, "stickied": false, "created": 1492392152.0, "created_utc": 1492363352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_65ozmh", "likes": null, "replies": "", "user_reports": [], "id": "dgc54ba", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "littlelivethings", "parent_id": "t3_65ozmh", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Building muscle sucks up a lot of water, so that could be part of it. Also the deficit you make from exercise alone is much smaller than diet or a combination. If you aren't tracking calories, you may be eating more than you think. You can lose fat and gain muscle when you first start out if you eat enough protein. If you are really concerned about losing weight/inches, I would suggest using a calculator to find out your current TDEE at sedentary and then cut back by about 300 calories, and try to aim for ~120g protein a day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Building muscle sucks up a lot of water, so that could be part of it. Also the deficit you make from exercise alone is much smaller than diet or a combination. If you aren&amp;#39;t tracking calories, you may be eating more than you think. You can lose fat and gain muscle when you first start out if you eat enough protein. If you are really concerned about losing weight/inches, I would suggest using a calculator to find out your current TDEE at sedentary and then cut back by about 300 calories, and try to aim for ~120g protein a day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dgc54ba", "score_hidden": false, "stickied": false, "created": 1492384930.0, "created_utc": 1492356130.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_65ozmh", "likes": null, "replies": "", "user_reports": [], "id": "dgc0d48", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "blahblahbecca98", "parent_id": "t3_65ozmh", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "Have you taken any measurements? That is always a big indicator as to your actual progress versus scale process. Also, is you were not working out during the initial weight loss you may need to adjust your TDEE calculations. If you're not eating enough to fuel your workouts it can cause you to hold on to the weight instead of losing more. \n\nFantastic job on what you have already accomplished!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you taken any measurements? That is always a big indicator as to your actual progress versus scale process. Also, is you were not working out during the initial weight loss you may need to adjust your TDEE calculations. If you&amp;#39;re not eating enough to fuel your workouts it can cause you to hold on to the weight instead of losing more. &lt;/p&gt;\n\n&lt;p&gt;Fantastic job on what you have already accomplished!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dgc0d48", "score_hidden": false, "stickied": false, "created": 1492377117.0, "created_utc": 1492348317.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ryzy", "removal_reason": null, "link_id": "t3_65ozmh", "likes": null, "replies": "", "user_reports": [], "id": "dgdi91n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MrsWeatherwax", "parent_id": "t3_65ozmh", "subreddit_name_prefixed": "r/xxfitness", "controversiality": 0, "body": "First of all, congratulations on losing 100 lbs!  What an accomplishment!\n\nKeep in mind fat loss slows as we get leaner.   A person who is quite overweight can safely lose 2 lbs. a week, sometimes more -- but as you approach your ideal weight you should not lose more than 1 lb. per week in order to minimize lean mass loss;  when you get down to the last five \"vanity\" pounds you may find that you lose at a pace of .5 lb. per week.  \n\nAlso, as we lose weight, we need to periodically re-evaluate how many calories we should be eating -- our new, smaller bodies require less fuel than we do when we are heavier.   Are you tracking calories/macros or just eating \"well\" -- it is entirely possible to still eat too many calories for fat loss while eating all \"healthy\" foods.  Read the \"Fat Loss 101\" in the sidebar for information on how to figure out your calories and macros for fat loss or maintenance.\n\nAlso, when you start lifting, it is normal to experience some water retention due to muscle inflammation, etc..  Take progress pictures and measurements -- often you will have some visible differences yet not see much change on the scale weight.   \n\nSince you are new to lifting, you will likely see some impressive gains in strength and muscle mass in your first year (aka \"newbie gainz\").  However, even for newbies, building muscle is a s-l-o-w process for women.  It is a marathon, not a sprint.  Most people with enviable physiques have been training for *years*, not months.  \n\n&gt;In fact, the only thing I can see in my triceps getting bigger. My target areas (though I know target workouts don't work) are my arms, tummy and thighs.   \n\nLifting changes your body from the *inside out*.  Your muscles (which are *underneath* your fat) will get stronger and grow -- but you often won't really *see* much as long as you have fat on top of them.  Additionally, as a new lifter there is a really disconcerting phase where your muscles are becoming more firm (mostly due to water/glycogen increase in the beginning, but also due to muscle growth as you continue) but your body fat level is still the same and you feel like you are actually *bigger*.  Be patient, be consistent with your diet, and the fat will come off eventually.    \n\nMost of us are not blessed with ideal fat distribution, and we have some areas that will stay jiggly longer than we personally feel necessary.  Upper arm, stomach and thighs are common places for women to hold fat.  Be patient, stay the course and it will happen *eventually*.  \n\nAlso, I will warn you that there is a very disconcerting stage during fat loss at this point where you look *worse* before you look better.   As your fat cells empty out, there is a phase where you seem flabbier and jigglier than you did when you were fatter.  I remember being *horrified* at my belly and thinking it looked better when I had more fat on it as it was at least *smoother* looking!  Don't panic, it is a good sign that the fat is going away -- stay consistent and it will pass and one day you will look in the mirror and realize you look much leaner.  \n\n&gt;I take supplements\n\nWhat supplements are you taking?  Creatine is notorious for causing water retention.  I do not think supplements are necessary for a new lifter.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, congratulations on losing 100 lbs!  What an accomplishment!&lt;/p&gt;\n\n&lt;p&gt;Keep in mind fat loss slows as we get leaner.   A person who is quite overweight can safely lose 2 lbs. a week, sometimes more -- but as you approach your ideal weight you should not lose more than 1 lb. per week in order to minimize lean mass loss;  when you get down to the last five &amp;quot;vanity&amp;quot; pounds you may find that you lose at a pace of .5 lb. per week.  &lt;/p&gt;\n\n&lt;p&gt;Also, as we lose weight, we need to periodically re-evaluate how many calories we should be eating -- our new, smaller bodies require less fuel than we do when we are heavier.   Are you tracking calories/macros or just eating &amp;quot;well&amp;quot; -- it is entirely possible to still eat too many calories for fat loss while eating all &amp;quot;healthy&amp;quot; foods.  Read the &amp;quot;Fat Loss 101&amp;quot; in the sidebar for information on how to figure out your calories and macros for fat loss or maintenance.&lt;/p&gt;\n\n&lt;p&gt;Also, when you start lifting, it is normal to experience some water retention due to muscle inflammation, etc..  Take progress pictures and measurements -- often you will have some visible differences yet not see much change on the scale weight.   &lt;/p&gt;\n\n&lt;p&gt;Since you are new to lifting, you will likely see some impressive gains in strength and muscle mass in your first year (aka &amp;quot;newbie gainz&amp;quot;).  However, even for newbies, building muscle is a s-l-o-w process for women.  It is a marathon, not a sprint.  Most people with enviable physiques have been training for &lt;em&gt;years&lt;/em&gt;, not months.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In fact, the only thing I can see in my triceps getting bigger. My target areas (though I know target workouts don&amp;#39;t work) are my arms, tummy and thighs.   &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Lifting changes your body from the &lt;em&gt;inside out&lt;/em&gt;.  Your muscles (which are &lt;em&gt;underneath&lt;/em&gt; your fat) will get stronger and grow -- but you often won&amp;#39;t really &lt;em&gt;see&lt;/em&gt; much as long as you have fat on top of them.  Additionally, as a new lifter there is a really disconcerting phase where your muscles are becoming more firm (mostly due to water/glycogen increase in the beginning, but also due to muscle growth as you continue) but your body fat level is still the same and you feel like you are actually &lt;em&gt;bigger&lt;/em&gt;.  Be patient, be consistent with your diet, and the fat will come off eventually.    &lt;/p&gt;\n\n&lt;p&gt;Most of us are not blessed with ideal fat distribution, and we have some areas that will stay jiggly longer than we personally feel necessary.  Upper arm, stomach and thighs are common places for women to hold fat.  Be patient, stay the course and it will happen &lt;em&gt;eventually&lt;/em&gt;.  &lt;/p&gt;\n\n&lt;p&gt;Also, I will warn you that there is a very disconcerting stage during fat loss at this point where you look &lt;em&gt;worse&lt;/em&gt; before you look better.   As your fat cells empty out, there is a phase where you seem flabbier and jigglier than you did when you were fatter.  I remember being &lt;em&gt;horrified&lt;/em&gt; at my belly and thinking it looked better when I had more fat on it as it was at least &lt;em&gt;smoother&lt;/em&gt; looking!  Don&amp;#39;t panic, it is a good sign that the fat is going away -- stay consistent and it will pass and one day you will look in the mirror and realize you look much leaner.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I take supplements&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What supplements are you taking?  Creatine is notorious for causing water retention.  I do not think supplements are necessary for a new lifter.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "xxfitness", "name": "t1_dgdi91n", "score_hidden": false, "stickied": false, "created": 1492466321.0, "created_utc": 1492437521.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]