[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "climbing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey all, tale as old as time, I (F,20) got dumped and am in desperate need of distraction. I&amp;#39;ve wanted to try indoor climbing for a while, but a few things have stopped me:&lt;/p&gt;\n\n&lt;p&gt;1) I have moderate to severe hyperhidrosis, so my hands become anything from mildly clammy to full on dripping in response to anxiety, exertion, or unknown triggers. I&amp;#39;m controlling it somewhat with an overnight antiperspirant spray, but I&amp;#39;m not sure that it&amp;#39;ll be enough, even with chalk. How much of a problem will this be? &lt;/p&gt;\n\n&lt;p&gt;2) I&amp;#39;m not fit, at all. I&amp;#39;m within a healthy bmi (~135/140lbs and 5&amp;#39;6) but very little of that is muscle, and I struggle even doing 5-10 pushups. Obviously climbing should help this, but do I need a better base fitness to start? I am drawn to climbing because I hate traditional exercises, but enjoy things like biking, hiking, and skating. &lt;/p&gt;\n\n&lt;p&gt;3) I have had issues with carpal tunnel in the past and still occasionally experience flareups. Is there anything I can do to help protect my wrists and forearms, or is it likely to be too strenuous?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d like to start with bouldering at a local indoor gym, but am very hesitant to start due to the physical and mental barriers. Along with the above list, I&amp;#39;m generally not super confident and worried about embarrassing myself for being unable to climb. Any advice at all for me? Would be happy to hear any thoughts. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey all, tale as old as time, I (F,20) got dumped and am in desperate need of distraction. I've wanted to try indoor climbing for a while, but a few things have stopped me:\n\n1) I have moderate to severe hyperhidrosis, so my hands become anything from mildly clammy to full on dripping in response to anxiety, exertion, or unknown triggers. I'm controlling it somewhat with an overnight antiperspirant spray, but I'm not sure that it'll be enough, even with chalk. How much of a problem will this be? \n\n2) I'm not fit, at all. I'm within a healthy bmi (~135/140lbs and 5'6) but very little of that is muscle, and I struggle even doing 5-10 pushups. Obviously climbing should help this, but do I need a better base fitness to start? I am drawn to climbing because I hate traditional exercises, but enjoy things like biking, hiking, and skating. \n \n3) I have had issues with carpal tunnel in the past and still occasionally experience flareups. Is there anything I can do to help protect my wrists and forearms, or is it likely to be too strenuous?\n\nI'd like to start with bouldering at a local indoor gym, but am very hesitant to start due to the physical and mental barriers. Along with the above list, I'm generally not super confident and worried about embarrassing myself for being unable to climb. Any advice at all for me? Would be happy to hear any thoughts. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "650r3z", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "peppermintpine", "saved": false, "mod_reports": [], "name": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "approved_by": null, "over_18": false, "domain": "self.climbing", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qk72", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/climbing/comments/650r3z/scared_to_start_climbing/", "num_reports": null, "locked": false, "stickied": false, "created": 1492057502.0, "url": "https://www.reddit.com/r/climbing/comments/650r3z/scared_to_start_climbing/", "author_flair_text": null, "quarantine": false, "title": "Scared to start climbing", "created_utc": 1492028702.0, "distinguished": null, "media": null, "upvote_ratio": 0.65, "num_comments": 26, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg7y4oq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lectures", "parent_id": "t1_dg6rq7s", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "I'd suggest antihydral.  It's like the weapon's grade version of rhinoskin's stuff.  Twice a week and my hands are DRY.  So dry that my wife complained that it was like holding hands with a stranger.  Heh.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d suggest antihydral.  It&amp;#39;s like the weapon&amp;#39;s grade version of rhinoskin&amp;#39;s stuff.  Twice a week and my hands are DRY.  So dry that my wife complained that it was like holding hands with a stranger.  Heh.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg7y4oq", "score_hidden": false, "stickied": false, "created": 1492135379.0, "created_utc": 1492106579.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rq7s", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "nurkdurk", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "Lots of comments from people who likely don't suffer from hyperhidrosis, I do. You will need more than chalk most likely. I've had extremely good results with Rhino Skin products, http://www.rhinoskinsolutions.com/product-information.html\n\nI use the \"dry\" spray once a week, two nights before climbing. I use the \"performance\" cream other nights during the week. I won't use either product on nights after climbing (just moisturizer). \nThis took down the amount that I sweat to a level of normal people, meaning my chalk bag didn't turn into a gloppy mess. Chalk actually WORKS and I can keep my hands dry. After 2.5 years of sliming off holds this was a huge help.\n\nYou don't have to be very fit to start climbing, in fact starting while you are heavier and/or weaker will actually really help you long term. The people who start climbing while already quite light and strong have a tendency to muscle their way through things and don't learn technique to efficiently drive their upward movement from their feet as well. \n\nAfter climbing do reverse wrist curls with a dumbell, I do 2 sets of 30 reps per hand with 6lbs. Start with whatever weight you can do more than 20 reps of. Also doing rotations of your wrist while holding a weight, or better yet a long pvc pipe (most gyms have one in their weight room) will also help wrist and elbow issues.\n\nFollow the other advice of signing up for a climbing course at the local gym. Being able to start with other people on the same level really helps take the anxiety away.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lots of comments from people who likely don&amp;#39;t suffer from hyperhidrosis, I do. You will need more than chalk most likely. I&amp;#39;ve had extremely good results with Rhino Skin products, &lt;a href=\"http://www.rhinoskinsolutions.com/product-information.html\"&gt;http://www.rhinoskinsolutions.com/product-information.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I use the &amp;quot;dry&amp;quot; spray once a week, two nights before climbing. I use the &amp;quot;performance&amp;quot; cream other nights during the week. I won&amp;#39;t use either product on nights after climbing (just moisturizer). \nThis took down the amount that I sweat to a level of normal people, meaning my chalk bag didn&amp;#39;t turn into a gloppy mess. Chalk actually WORKS and I can keep my hands dry. After 2.5 years of sliming off holds this was a huge help.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to be very fit to start climbing, in fact starting while you are heavier and/or weaker will actually really help you long term. The people who start climbing while already quite light and strong have a tendency to muscle their way through things and don&amp;#39;t learn technique to efficiently drive their upward movement from their feet as well. &lt;/p&gt;\n\n&lt;p&gt;After climbing do reverse wrist curls with a dumbell, I do 2 sets of 30 reps per hand with 6lbs. Start with whatever weight you can do more than 20 reps of. Also doing rotations of your wrist while holding a weight, or better yet a long pvc pipe (most gyms have one in their weight room) will also help wrist and elbow issues.&lt;/p&gt;\n\n&lt;p&gt;Follow the other advice of signing up for a climbing course at the local gym. Being able to start with other people on the same level really helps take the anxiety away.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6rq7s", "score_hidden": false, "stickied": false, "created": 1492069079.0, "created_utc": 1492040279.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg6iox5", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "RoidBaby", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "Take a lesson, be friendly, don't worry. Strength will come in time, right now is when to start.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take a lesson, be friendly, don&amp;#39;t worry. Strength will come in time, right now is when to start.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6iox5", "score_hidden": false, "stickied": false, "created": 1492058280.0, "created_utc": 1492029480.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg6iz63", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "shrike92", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "Hiya!  Climbing is a great hobby, it also just happens to be a great workout too :)\n\n1)  It will be a problem, but how much of one who knows till you try.  Chalk helps a lot, and I've had friends who get sweaty hands who could climb just fine with chalk.  Honestly the best way to find out would be to just try it.\n\n2)  The first few times you go you will be sore all over your body.  It happens to everyone, even in shape people.  The great thing about climbing indoor is that they grade the climbs, so just start on the easiest ones and you'll be fine.  You'll get stronger over time as long as you keep pushing yourself.\n\n3)  I'm not really sure.  Most of the problems I've had have been with my elbow tendons.  But there are a lot of great videos out there on good stretches to do before climbing, I'd definitely look at those.  There is a lot of pre-workout and stretching you can do to mitigate damage to your joints.\n\nAs far as embarrassing yourself goes, it's all in your head.  The people at climbing gyms are generally some of the most friendly and positive people you will meet.  It's not like a regular gym at all.  If you talk to people and ask for help they'll be more than happy to give you pointers too.  It's a super positive community and we all cheer for each other.  Seriously, don't worry about it!  The only thing that could get you some bad vibes is if you're rude, or if you don't follow good climbing etiquette.\n\nWhere are you located?  If you're the OC/LA area you can use my guest pass.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hiya!  Climbing is a great hobby, it also just happens to be a great workout too :)&lt;/p&gt;\n\n&lt;p&gt;1)  It will be a problem, but how much of one who knows till you try.  Chalk helps a lot, and I&amp;#39;ve had friends who get sweaty hands who could climb just fine with chalk.  Honestly the best way to find out would be to just try it.&lt;/p&gt;\n\n&lt;p&gt;2)  The first few times you go you will be sore all over your body.  It happens to everyone, even in shape people.  The great thing about climbing indoor is that they grade the climbs, so just start on the easiest ones and you&amp;#39;ll be fine.  You&amp;#39;ll get stronger over time as long as you keep pushing yourself.&lt;/p&gt;\n\n&lt;p&gt;3)  I&amp;#39;m not really sure.  Most of the problems I&amp;#39;ve had have been with my elbow tendons.  But there are a lot of great videos out there on good stretches to do before climbing, I&amp;#39;d definitely look at those.  There is a lot of pre-workout and stretching you can do to mitigate damage to your joints.&lt;/p&gt;\n\n&lt;p&gt;As far as embarrassing yourself goes, it&amp;#39;s all in your head.  The people at climbing gyms are generally some of the most friendly and positive people you will meet.  It&amp;#39;s not like a regular gym at all.  If you talk to people and ask for help they&amp;#39;ll be more than happy to give you pointers too.  It&amp;#39;s a super positive community and we all cheer for each other.  Seriously, don&amp;#39;t worry about it!  The only thing that could get you some bad vibes is if you&amp;#39;re rude, or if you don&amp;#39;t follow good climbing etiquette.&lt;/p&gt;\n\n&lt;p&gt;Where are you located?  If you&amp;#39;re the OC/LA area you can use my guest pass.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6iz63", "score_hidden": false, "stickied": false, "created": 1492058577.0, "created_utc": 1492029777.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg6j166", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "0bsidian", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "1 - probably okay with chalk. Give it a try and see how things go.\n\n2 - you'll be fine. Climbing starts at various degrees of difficulty starting to the same difficulty as climbing a ladder. You'll start off being limited by technique as a beginner, not by strength.\n\n3 - consult your doctor. No one here knows your medical history or the extent of your CTS.\n\nClimbers are mostly pretty chill people. We all start somewhere and know what it's like to be a beginner. I think climbers are generally more supportive of each other and it is an incredibly social sport. Just go climb and meet some people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1 - probably okay with chalk. Give it a try and see how things go.&lt;/p&gt;\n\n&lt;p&gt;2 - you&amp;#39;ll be fine. Climbing starts at various degrees of difficulty starting to the same difficulty as climbing a ladder. You&amp;#39;ll start off being limited by technique as a beginner, not by strength.&lt;/p&gt;\n\n&lt;p&gt;3 - consult your doctor. No one here knows your medical history or the extent of your CTS.&lt;/p&gt;\n\n&lt;p&gt;Climbers are mostly pretty chill people. We all start somewhere and know what it&amp;#39;s like to be a beginner. I think climbers are generally more supportive of each other and it is an incredibly social sport. Just go climb and meet some people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6j166", "score_hidden": false, "stickied": false, "created": 1492058636.0, "created_utc": 1492029836.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg6k8j2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CitationNeededBadly", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "1.  hard to say, but chalk might be enough, and for beginner climbs it won't matter as much because you'll be using bigger, easy to grasp holds.\n\n2.  if you can bike, hike and skate, it's worth giving climbing a shot.  What's nice about climbing is that there are climbs ranging from easy (practically a ladder) to super hard (only a few people in the world could climb them).  Indoor gyms tend to make sure they always have some easy climbs set up  because they want to attract new folks, it's good for business. \n3.  I had similar issues (too many long hours at a web startup)  For me climbing has helped.  I started slow, only climbing one day a week.  But obviously I'm not your doctor, you'll need to monitor yourself.\n4.  It can feel intimidating to go to a rock gym for the first time.  if you're going alone, sign up for an intro lesson - you might meet someone else who's looking for someone to climb with, but you'll definitely feel a bit more confident after knowing what you should be doing.  In my gym no one cares how well the newbs are climbing  - nobody is standing around the easy climbs waiting to point and laugh at folks when they can't do something.  We're all focused on our own climbs for the most part.  If I see you doing something blatantly dangerous, I'll say something.  While there are occasional rude climbers (like in any activity) climbers are generally more likely to cheer each other on than insult each other.\n\nFinally, it's fine to fail at a particular climb.  some people like to only climb super easy stuff they know they can do, others like to challenge themselves and try difficult stuff that they might have to attempt multiple times.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;hard to say, but chalk might be enough, and for beginner climbs it won&amp;#39;t matter as much because you&amp;#39;ll be using bigger, easy to grasp holds.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;if you can bike, hike and skate, it&amp;#39;s worth giving climbing a shot.  What&amp;#39;s nice about climbing is that there are climbs ranging from easy (practically a ladder) to super hard (only a few people in the world could climb them).  Indoor gyms tend to make sure they always have some easy climbs set up  because they want to attract new folks, it&amp;#39;s good for business. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I had similar issues (too many long hours at a web startup)  For me climbing has helped.  I started slow, only climbing one day a week.  But obviously I&amp;#39;m not your doctor, you&amp;#39;ll need to monitor yourself.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It can feel intimidating to go to a rock gym for the first time.  if you&amp;#39;re going alone, sign up for an intro lesson - you might meet someone else who&amp;#39;s looking for someone to climb with, but you&amp;#39;ll definitely feel a bit more confident after knowing what you should be doing.  In my gym no one cares how well the newbs are climbing  - nobody is standing around the easy climbs waiting to point and laugh at folks when they can&amp;#39;t do something.  We&amp;#39;re all focused on our own climbs for the most part.  If I see you doing something blatantly dangerous, I&amp;#39;ll say something.  While there are occasional rude climbers (like in any activity) climbers are generally more likely to cheer each other on than insult each other.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Finally, it&amp;#39;s fine to fail at a particular climb.  some people like to only climb super easy stuff they know they can do, others like to challenge themselves and try difficult stuff that they might have to attempt multiple times.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6k8j2", "score_hidden": false, "stickied": false, "created": 1492059957.0, "created_utc": 1492031157.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg6kv7v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sysadmin00b", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "1. Try chalk and see how it goes!\n2. I'm not fit either and actually am in the obese category for weight. You do not need to be \"more fit\" to start.  Just take it easy and have fun.\n3. Not sure about the wrist issue, but I make sure to stretch my wrists before and after I climb.  I would check with a doctor first.\n\n\nI'm a very anxious not confident person, but climbing has been a great distraction for me.  I focus on the next places to put my hand and feet and somehow I have no room for all my anxieties.  Don't worry about embarrassing yourself.   I cannot count the times where I have cried in frustration and fear the wall (I only sport climb because I have awful ankles).  Almost everyone I met in the climbing community has been super positive and supportive.   Everyone starts somewhere.  You might not ever be a pro climber but you will be surprised how much stronger and confident you get.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;Try chalk and see how it goes!&lt;/li&gt;\n&lt;li&gt;I&amp;#39;m not fit either and actually am in the obese category for weight. You do not need to be &amp;quot;more fit&amp;quot; to start.  Just take it easy and have fun.&lt;/li&gt;\n&lt;li&gt;Not sure about the wrist issue, but I make sure to stretch my wrists before and after I climb.  I would check with a doctor first.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I&amp;#39;m a very anxious not confident person, but climbing has been a great distraction for me.  I focus on the next places to put my hand and feet and somehow I have no room for all my anxieties.  Don&amp;#39;t worry about embarrassing yourself.   I cannot count the times where I have cried in frustration and fear the wall (I only sport climb because I have awful ankles).  Almost everyone I met in the climbing community has been super positive and supportive.   Everyone starts somewhere.  You might not ever be a pro climber but you will be surprised how much stronger and confident you get.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6kv7v", "score_hidden": false, "stickied": false, "created": 1492060675.0, "created_utc": 1492031875.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg6jpn2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reredditnogetit", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "give bouldering a try. people are generally nice and we were all first timers once, so i wouldnt worry about embarrassing yourself at all. chances are you'll end up chatting with someone, so be sure to take what pointers you can get. 1 shouldnt be an issue, 2 will come with time, and 3 i cant speak to cuz im not a doctor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;give bouldering a try. people are generally nice and we were all first timers once, so i wouldnt worry about embarrassing yourself at all. chances are you&amp;#39;ll end up chatting with someone, so be sure to take what pointers you can get. 1 shouldnt be an issue, 2 will come with time, and 3 i cant speak to cuz im not a doctor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6jpn2", "score_hidden": false, "stickied": false, "created": 1492059365.0, "created_utc": 1492030565.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg6mfsc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hairyboid4", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "Just do it friend. The three things you listed are just obstacles, the first two are even pretty minor. The third may take special care, see a doctor, research carpal tunnel related strengthening exercises and go from there.\n\nIf you think it's fun then just do it. You'll find a way around everything else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just do it friend. The three things you listed are just obstacles, the first two are even pretty minor. The third may take special care, see a doctor, research carpal tunnel related strengthening exercises and go from there.&lt;/p&gt;\n\n&lt;p&gt;If you think it&amp;#39;s fun then just do it. You&amp;#39;ll find a way around everything else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6mfsc", "score_hidden": false, "stickied": false, "created": 1492062538.0, "created_utc": 1492033738.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg6ms4u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TomGissing", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "I was in your shoes around 3 years ago. Also had super sweaty hands, and a lot of general anxiety about climbing.\n\nWhat helped me was having a buddy who was nervous come with me (I actually put an ad online to find someone because I was new to the city at the time). \n\nThe sweaty palms won't be an issue. Just use chalk very liberally. I live and climb in a city that's regularly over 30 degrees C, and 80% humidity, so sweat is just a reality of climbing for everyone. I also sometimes use an overnight antiperspirant on my palms, which you might want to try.\n\nYou're plenty fit enough to climb. We have 3 year olds to 70 year olds regularly climbing at our gym. It won't be a problem. In fact, the weaker you are when you begin, the more likely you are to develop your movement to compensate for your lack of strength - this is a great way to begin.\n\nGood luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in your shoes around 3 years ago. Also had super sweaty hands, and a lot of general anxiety about climbing.&lt;/p&gt;\n\n&lt;p&gt;What helped me was having a buddy who was nervous come with me (I actually put an ad online to find someone because I was new to the city at the time). &lt;/p&gt;\n\n&lt;p&gt;The sweaty palms won&amp;#39;t be an issue. Just use chalk very liberally. I live and climb in a city that&amp;#39;s regularly over 30 degrees C, and 80% humidity, so sweat is just a reality of climbing for everyone. I also sometimes use an overnight antiperspirant on my palms, which you might want to try.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re plenty fit enough to climb. We have 3 year olds to 70 year olds regularly climbing at our gym. It won&amp;#39;t be a problem. In fact, the weaker you are when you begin, the more likely you are to develop your movement to compensate for your lack of strength - this is a great way to begin.&lt;/p&gt;\n\n&lt;p&gt;Good luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6ms4u", "score_hidden": false, "stickied": false, "created": 1492062953.0, "created_utc": 1492034153.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg6pm1a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "krovek42", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "1. Sweaty hands is just part of climbing. Get a chalk ball for your chalk bag, it helps you apply smaller amounts of chalk more regularly, instead of caking your hands with it in the beginning. Also consider trying \"liquid chalks\". Thy are basically just an alcohol/chalk solution that dries quickly on your hands and helps keep your from sweating. \n\n2. Climbing is a strain regardless of your fitness levels. The most important fundamental to keep in mind is that your legs move you up the wall, not your hands. \n\n3. Start super easy. Let your body rest. If you feel pain, don't climb for a bit. If it concerns you, then head to your doctor.\n\nAt your local gym, start on the walls that aren't overhung, and have big holds. You'll want to feel the movement and not need as much grip strength. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Sweaty hands is just part of climbing. Get a chalk ball for your chalk bag, it helps you apply smaller amounts of chalk more regularly, instead of caking your hands with it in the beginning. Also consider trying &amp;quot;liquid chalks&amp;quot;. Thy are basically just an alcohol/chalk solution that dries quickly on your hands and helps keep your from sweating. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Climbing is a strain regardless of your fitness levels. The most important fundamental to keep in mind is that your legs move you up the wall, not your hands. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Start super easy. Let your body rest. If you feel pain, don&amp;#39;t climb for a bit. If it concerns you, then head to your doctor.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;At your local gym, start on the walls that aren&amp;#39;t overhung, and have big holds. You&amp;#39;ll want to feel the movement and not need as much grip strength. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6pm1a", "score_hidden": false, "stickied": false, "created": 1492066455.0, "created_utc": 1492037655.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg6xc9z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Iclimb247", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "I started climbing because of anxiety. I dumped my ex wife and it was terrible time in my life. Not only did climbing make my anxiety go away (took a while but im way less anxious) I also feel stronger and happier in life. Climbing is amazing. I dont think our hyperhidrosis will be a problem eventually you will learn to control your anxiety when climbing. A lot of people that climb have sweaty hand. I also wouldnt worry about carpal tunnel (since climbing is not really a lot of repetitive movement). If you are not in shape it will take a little longer for you to start loving the endurance aspect of climbing since you will get out of breath at beginning. I would go for 2 weeks as often as you can and I bet you will get addicted :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I started climbing because of anxiety. I dumped my ex wife and it was terrible time in my life. Not only did climbing make my anxiety go away (took a while but im way less anxious) I also feel stronger and happier in life. Climbing is amazing. I dont think our hyperhidrosis will be a problem eventually you will learn to control your anxiety when climbing. A lot of people that climb have sweaty hand. I also wouldnt worry about carpal tunnel (since climbing is not really a lot of repetitive movement). If you are not in shape it will take a little longer for you to start loving the endurance aspect of climbing since you will get out of breath at beginning. I would go for 2 weeks as often as you can and I bet you will get addicted :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6xc9z", "score_hidden": false, "stickied": false, "created": 1492075936.0, "created_utc": 1492047136.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg6ybdf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mrmcmayhem", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "A couple hours on a low wall can blank your mind completely. I went to our local spot the other day, played in 3 cracks only about 12feet at the highest and when I hiked out had forgotten I had even worked that day. Just think about the wall when you're on it, zone out and have fun. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A couple hours on a low wall can blank your mind completely. I went to our local spot the other day, played in 3 cracks only about 12feet at the highest and when I hiked out had forgotten I had even worked that day. Just think about the wall when you&amp;#39;re on it, zone out and have fun. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg6ybdf", "score_hidden": false, "stickied": false, "created": 1492077141.0, "created_utc": 1492048341.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg7ed92", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bruce_G", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "One problem you might have early on is tearing blisters open on your hands (what many climbers call \"flappers,\" from the flap of skin that's hanging from the blister once it's torn). Watch for blisters that feel like they might tear soon, and tape them before they do. This will help build up your skin strength without having to deal with so many inconvenient tears. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One problem you might have early on is tearing blisters open on your hands (what many climbers call &amp;quot;flappers,&amp;quot; from the flap of skin that&amp;#39;s hanging from the blister once it&amp;#39;s torn). Watch for blisters that feel like they might tear soon, and tape them before they do. This will help build up your skin strength without having to deal with so many inconvenient tears. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg7ed92", "score_hidden": false, "stickied": false, "created": 1492109762.0, "created_utc": 1492080962.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg7mjpo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yokiko", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "I teach an intro bouldering course at a local gym and I promise, you'll be surprised by how much upper body strength you have! you don't need \"base fitness\" to get started if you go to a gym that has a good range of problems for beginners. As for your hyperhidrosis, get an anti-hydral. There's good advice about Rhino skin products here. As for your carpal tunnel, a technique lesson can help make sure you're practicing good climbing posture so that you can alleviate the strain on your forearms &amp; wrists. Also, be sure to get a good warm up in (wrist rolls, etc) before you get started. Good luck! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I teach an intro bouldering course at a local gym and I promise, you&amp;#39;ll be surprised by how much upper body strength you have! you don&amp;#39;t need &amp;quot;base fitness&amp;quot; to get started if you go to a gym that has a good range of problems for beginners. As for your hyperhidrosis, get an anti-hydral. There&amp;#39;s good advice about Rhino skin products here. As for your carpal tunnel, a technique lesson can help make sure you&amp;#39;re practicing good climbing posture so that you can alleviate the strain on your forearms &amp;amp; wrists. Also, be sure to get a good warm up in (wrist rolls, etc) before you get started. Good luck! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg7mjpo", "score_hidden": false, "stickied": false, "created": 1492122920.0, "created_utc": 1492094120.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg9azfr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fourdoorshack", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "Don't be scared! Climbing is an awesome activity full of great people.\n\nAlso, don't listen to the assholes on here. The Internet is full of trolls. Ignore them.\n\n1) Have you considered antihydral cream? http://squamishclimbingmagazine.ca/antihydral-skin-doping-for-climbers/\n\n2) Everyone starts somewhere. Don't worry about it. There are all shapes, sizes and ages in the gym. I also hate traditional exercise, which is why I love climbing. I'm a relatively short dude, not super ripped, and a few years shy of 40, but after years of climbing I'm a solid 5.11+ leader, 5.12+ top-roper, and V6+ boulderer. \n\n3) I really don't know about this. Maybe ask a physical therapist? My sense is that climbing works completely different muscles, but I honestly have no idea if it would aggravate your carpel tunnel. Try it. If it starts hurting... stop. \n\n4) I would recommend against bouldering as your first experience. Many people forget that the easiest bouldering routes (V0) are basically easy to moderate rope routes (5.9+/5.10a). If you CAN, start by climbing 5.5-5.7 roped routes. That will be the easiest way to get into it. If you have to boulder because it's the only gym nearby, just go on off hours when it's not busy. Then you won't have to deal with all the shirtless bros :)\n\nHAVE FUN and WELCOME", "edited": 1492195971.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t be scared! Climbing is an awesome activity full of great people.&lt;/p&gt;\n\n&lt;p&gt;Also, don&amp;#39;t listen to the assholes on here. The Internet is full of trolls. Ignore them.&lt;/p&gt;\n\n&lt;p&gt;1) Have you considered antihydral cream? &lt;a href=\"http://squamishclimbingmagazine.ca/antihydral-skin-doping-for-climbers/\"&gt;http://squamishclimbingmagazine.ca/antihydral-skin-doping-for-climbers/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;2) Everyone starts somewhere. Don&amp;#39;t worry about it. There are all shapes, sizes and ages in the gym. I also hate traditional exercise, which is why I love climbing. I&amp;#39;m a relatively short dude, not super ripped, and a few years shy of 40, but after years of climbing I&amp;#39;m a solid 5.11+ leader, 5.12+ top-roper, and V6+ boulderer. &lt;/p&gt;\n\n&lt;p&gt;3) I really don&amp;#39;t know about this. Maybe ask a physical therapist? My sense is that climbing works completely different muscles, but I honestly have no idea if it would aggravate your carpel tunnel. Try it. If it starts hurting... stop. &lt;/p&gt;\n\n&lt;p&gt;4) I would recommend against bouldering as your first experience. Many people forget that the easiest bouldering routes (V0) are basically easy to moderate rope routes (5.9+/5.10a). If you CAN, start by climbing 5.5-5.7 roped routes. That will be the easiest way to get into it. If you have to boulder because it&amp;#39;s the only gym nearby, just go on off hours when it&amp;#39;s not busy. Then you won&amp;#39;t have to deal with all the shirtless bros :)&lt;/p&gt;\n\n&lt;p&gt;HAVE FUN and WELCOME&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg9azfr", "score_hidden": false, "stickied": false, "created": 1492213798.0, "created_utc": 1492184998.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dgauzxp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "leslieyes", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "About your last point, starting bouldering can be intimidating! I remember when I first started I really wanted to climb, but I couldn't find any friends who were willing to go with me. Eventually, I started going bouldering alone. It can feel a bit awkward at first, but stick with it! One of the best feelings is when you finish a boulder problem that you thought was harder than you could do. Stick with it! Have fun! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;About your last point, starting bouldering can be intimidating! I remember when I first started I really wanted to climb, but I couldn&amp;#39;t find any friends who were willing to go with me. Eventually, I started going bouldering alone. It can feel a bit awkward at first, but stick with it! One of the best feelings is when you finish a boulder problem that you thought was harder than you could do. Stick with it! Have fun! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dgauzxp", "score_hidden": false, "stickied": false, "created": 1492303770.0, "created_utc": 1492274970.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg9r777", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GoodLordAlmighty", "parent_id": "t1_dg7w2yv", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "He/she is obviously not a very good or confident climber. Nobody who is worth their salt in any field would be a discouraging arse to a beginner. I'm not a good climber but I am at another sport and it would never even cross my mind to be anything but encouraging if someone wanted to take up my sport. In high risk sports it is a good thing to have reservations before starting!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He/she is obviously not a very good or confident climber. Nobody who is worth their salt in any field would be a discouraging arse to a beginner. I&amp;#39;m not a good climber but I am at another sport and it would never even cross my mind to be anything but encouraging if someone wanted to take up my sport. In high risk sports it is a good thing to have reservations before starting!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg9r777", "score_hidden": false, "stickied": false, "created": 1492232862.0, "created_utc": 1492204062.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg7xb8l", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "hobotnica", "parent_id": "t1_dg7wahr", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "What a sad way to live your life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a sad way to live your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg7xb8l", "score_hidden": false, "stickied": false, "created": 1492134514.0, "created_utc": 1492105714.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg9qdmr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GoodLordAlmighty", "parent_id": "t1_dg7wahr", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "You're a right prick, aren't you sunshine? Hopefully you will have grown out of it by the time you hit 16. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re a right prick, aren&amp;#39;t you sunshine? Hopefully you will have grown out of it by the time you hit 16. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg9qdmr", "score_hidden": false, "stickied": false, "created": 1492231842.0, "created_utc": 1492203042.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7wahr", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "universal_klister", "parent_id": "t1_dg7w2yv", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "Because I was raised in a different culture than you, and see the bullshit globbering over moronic comments as an insult to the sport of climbing and a lack of respect for both the one making the comment and for the one that the comment is directed at. \n\nRespect the real climbing community found outside. Too many people want internet feels. If OP wants to climb, she should climb. If she wants to whine online about how she wants to climb, that's dumb and we shouldn't encourage more of it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because I was raised in a different culture than you, and see the bullshit globbering over moronic comments as an insult to the sport of climbing and a lack of respect for both the one making the comment and for the one that the comment is directed at. &lt;/p&gt;\n\n&lt;p&gt;Respect the real climbing community found outside. Too many people want internet feels. If OP wants to climb, she should climb. If she wants to whine online about how she wants to climb, that&amp;#39;s dumb and we shouldn&amp;#39;t encourage more of it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg7wahr", "score_hidden": false, "stickied": false, "created": 1492133428.0, "created_utc": 1492104628.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7w2yv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hobotnica", "parent_id": "t1_dg7vyzh", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "Doesn't really answer my question. Why not just be nice to people? You're a dick in most of your comments.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doesn&amp;#39;t really answer my question. Why not just be nice to people? You&amp;#39;re a dick in most of your comments.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg7w2yv", "score_hidden": false, "stickied": false, "created": 1492133203.0, "created_utc": 1492104403.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7vyzh", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "universal_klister", "parent_id": "t1_dg7ux0x", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "I restated OP's statements. \n\nEssentially she has a laundry list of reasons to not climb. So if that's what she is focusing on, no, don't climb. \n\nBut maybe instead of a lot of coddling and \"oh wow you can over come your sweaty hands.\" OP just needs to have laid it clearly and without emotion. She can try climbing and maybe have fun. Or she can never try climbing and never fail at it. It's up to her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I restated OP&amp;#39;s statements. &lt;/p&gt;\n\n&lt;p&gt;Essentially she has a laundry list of reasons to not climb. So if that&amp;#39;s what she is focusing on, no, don&amp;#39;t climb. &lt;/p&gt;\n\n&lt;p&gt;But maybe instead of a lot of coddling and &amp;quot;oh wow you can over come your sweaty hands.&amp;quot; OP just needs to have laid it clearly and without emotion. She can try climbing and maybe have fun. Or she can never try climbing and never fail at it. It&amp;#39;s up to her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg7vyzh", "score_hidden": false, "stickied": false, "created": 1492133087.0, "created_utc": 1492104287.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ux0x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hobotnica", "parent_id": "t1_dg7sn63", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "Why are you such an asshole? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why are you such an asshole? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg7ux0x", "score_hidden": false, "stickied": false, "created": 1492131964.0, "created_utc": 1492103164.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qk72", "removal_reason": null, "link_id": "t3_650r3z", "likes": null, "replies": "", "user_reports": [], "id": "dg8z5eu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "t0asti", "parent_id": "t1_dg7sn63", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "This is a reminder for you to be civil and inclusive in /r/climbing. If you want to hate on people go somewhere else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a reminder for you to be civil and inclusive in &lt;a href=\"/r/climbing\"&gt;/r/climbing&lt;/a&gt;. If you want to hate on people go somewhere else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg8z5eu", "score_hidden": false, "stickied": false, "created": 1492192914.0, "created_utc": 1492164114.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7sn63", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_650r3z", "subreddit_name_prefixed": "r/climbing", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "climbing", "name": "t1_dg7sn63", "score_hidden": false, "stickied": false, "created": 1492129540.0, "created_utc": 1492100740.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]