[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "jobs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all,&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m job hunting still and I&amp;#39;ve come across many listings that require 3 references. Obviously. Unfortunately I don&amp;#39;t have many references to speak of. Or at least, good references. For a large amount of time I worked for my fathers construction company, I did a lot of great things, like leading the development of their specialty home theatre design branch, high end stuff, including acoustic adjustments and fully automated rooms, but the problem is my supervisor was my father. He was always hands on and while I wasn&amp;#39;t handed anything, listing my father looks hokey. &lt;/p&gt;\n\n&lt;p&gt;I majored in technical theatre and have done plenty of work in the field, even overhire on broadway, but again that sort of thing is 2 weeks at a time if they need you and you meet a supervisor once and off you go. &lt;/p&gt;\n\n&lt;p&gt;My only other good reference is my current employer who I would rather not find out I&amp;#39;m currently looking. Guy is an asshole, but he likes the work I do. &lt;/p&gt;\n\n&lt;p&gt;So my question is how do I either explain the contract gigs and how do I answer the references question? I feel like I get passed over for tons of jobs I&amp;#39;m more than qualified for because my references either suck because they can&amp;#39;t contact them or because one is my father. &lt;/p&gt;\n\n&lt;p&gt;Any help is greatly appreciated. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all,\n\nSo I'm job hunting still and I've come across many listings that require 3 references. Obviously. Unfortunately I don't have many references to speak of. Or at least, good references. For a large amount of time I worked for my fathers construction company, I did a lot of great things, like leading the development of their specialty home theatre design branch, high end stuff, including acoustic adjustments and fully automated rooms, but the problem is my supervisor was my father. He was always hands on and while I wasn't handed anything, listing my father looks hokey. \n\nI majored in technical theatre and have done plenty of work in the field, even overhire on broadway, but again that sort of thing is 2 weeks at a time if they need you and you meet a supervisor once and off you go. \n\nMy only other good reference is my current employer who I would rather not find out I'm currently looking. Guy is an asshole, but he likes the work I do. \n\nSo my question is how do I either explain the contract gigs and how do I answer the references question? I feel like I get passed over for tons of jobs I'm more than qualified for because my references either suck because they can't contact them or because one is my father. \n\nAny help is greatly appreciated. \n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qr2f", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "fusrohdave", "saved": false, "mod_reports": [], "name": "t3_64qr2f", "subreddit_name_prefixed": "r/jobs", "approved_by": null, "over_18": false, "domain": "self.jobs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhnd", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/jobs/comments/64qr2f/what_should_i_do_about_references/", "num_reports": null, "locked": false, "stickied": false, "created": 1491945503.0, "url": "https://www.reddit.com/r/jobs/comments/64qr2f/what_should_i_do_about_references/", "author_flair_text": null, "quarantine": false, "title": "What should I do about references?", "created_utc": 1491916703.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_64qr2f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_64qr2f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_64qr2f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_64qr2f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_64qr2f", "likes": null, "replies": "", "user_reports": [], "id": "dg4gu5f", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Anseriformes", "parent_id": "t1_dg4gq4o", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Good luck! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg4gu5f", "score_hidden": false, "stickied": false, "created": 1491955561.0, "created_utc": 1491926761.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4gq4o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fusrohdave", "parent_id": "t1_dg4blnf", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Thank you so much for the advice. I'll start putting him on as supervisor and hopefully I can explain a little further during interviews. He's honestly the best source because of how much I accomplished in the company. I have an old professor that I'm still in contact with that may be able to help me get my boss' number or at least an email. I forgot about him until you mentioned that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for the advice. I&amp;#39;ll start putting him on as supervisor and hopefully I can explain a little further during interviews. He&amp;#39;s honestly the best source because of how much I accomplished in the company. I have an old professor that I&amp;#39;m still in contact with that may be able to help me get my boss&amp;#39; number or at least an email. I forgot about him until you mentioned that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg4gq4o", "score_hidden": false, "stickied": false, "created": 1491955437.0, "created_utc": 1491926637.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4blnf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Anseriformes", "parent_id": "t1_dg4ainh", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Google your former Program Director's name and see if you come up with anything. Check LinkedIn as well. You can also reach out to the current faculty and staff at the scene shop and see if they can give you any leads. Explain that you're seeking him for a reference and you worked there/are alumni. Try and seek out someone in that department you already know...even track down your college advisor if you have to. People are usually willing to help if they know you. \n\nWould you father be agreeable to help you determine an alternative reference from your work with his company? Think of anyone you worked with for a project and find a way to track that person down. I understand not wanting to have your father as your reference, but if he's agreeable to it then he was your boss and that's all you have! You list your relationship as \"Supervisor\", don't mention that he is your father. He wasn't raising you on the job sites, you were working for him :)\n\nIf that's still not an option, or doesn't have anything of value, then I suppose you start seeking character references from people you know who are not related to you. If you know people who work in the field but you haven't worked with them per se, that's better than a friend in an unrelated field. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Google your former Program Director&amp;#39;s name and see if you come up with anything. Check LinkedIn as well. You can also reach out to the current faculty and staff at the scene shop and see if they can give you any leads. Explain that you&amp;#39;re seeking him for a reference and you worked there/are alumni. Try and seek out someone in that department you already know...even track down your college advisor if you have to. People are usually willing to help if they know you. &lt;/p&gt;\n\n&lt;p&gt;Would you father be agreeable to help you determine an alternative reference from your work with his company? Think of anyone you worked with for a project and find a way to track that person down. I understand not wanting to have your father as your reference, but if he&amp;#39;s agreeable to it then he was your boss and that&amp;#39;s all you have! You list your relationship as &amp;quot;Supervisor&amp;quot;, don&amp;#39;t mention that he is your father. He wasn&amp;#39;t raising you on the job sites, you were working for him :)&lt;/p&gt;\n\n&lt;p&gt;If that&amp;#39;s still not an option, or doesn&amp;#39;t have anything of value, then I suppose you start seeking character references from people you know who are not related to you. If you know people who work in the field but you haven&amp;#39;t worked with them per se, that&amp;#39;s better than a friend in an unrelated field. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg4blnf", "score_hidden": false, "stickied": false, "created": 1491949642.0, "created_utc": 1491920842.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ainh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fusrohdave", "parent_id": "t1_dg49q2g", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "When I was in college I worked in the schools scene shop, my boss at the time was the Program Director, he has since left the school though, so I have neither his email nor phone number. We never had outside contractors as that was part of my role, my licensure was through the company, that's why my direct supervisor was the owner, my father. I use professors and my coworkers from back when I worked in the scene shop when it doesn't ask for professional references. Unfortunately the people I worked with in my fathers company don't speak much English. I worked for the company for 7 years. It's a large chunk of my working experience aside from my current employer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I was in college I worked in the schools scene shop, my boss at the time was the Program Director, he has since left the school though, so I have neither his email nor phone number. We never had outside contractors as that was part of my role, my licensure was through the company, that&amp;#39;s why my direct supervisor was the owner, my father. I use professors and my coworkers from back when I worked in the scene shop when it doesn&amp;#39;t ask for professional references. Unfortunately the people I worked with in my fathers company don&amp;#39;t speak much English. I worked for the company for 7 years. It&amp;#39;s a large chunk of my working experience aside from my current employer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg4ainh", "score_hidden": false, "stickied": false, "created": 1491948290.0, "created_utc": 1491919490.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg49q2g", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Anseriformes", "parent_id": "t3_64qr2f", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "When you were working for your father did you work with any outside contractors you could reach out to and use as references? Did you have any jobs while in school, even unrelated or part-time, that had coworkers/managers who can vouch for your work ethic, etc.? I understand many times they want \"professional references\", but if it's not stated then you might use 1 (just 1) of your former professors/instructors.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you were working for your father did you work with any outside contractors you could reach out to and use as references? Did you have any jobs while in school, even unrelated or part-time, that had coworkers/managers who can vouch for your work ethic, etc.? I understand many times they want &amp;quot;professional references&amp;quot;, but if it&amp;#39;s not stated then you might use 1 (just 1) of your former professors/instructors.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg49q2g", "score_hidden": false, "stickied": false, "created": 1491947255.0, "created_utc": 1491918455.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]