[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "jobs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a 26 year old woman. I turn 27 in May. I graduated in 2013, with a BA in Political Science. When I first started college, I thought I wanted to go to law school. But after taking a few law-specific classes, I realized that I wasn&amp;#39;t really interested in law. Then, I realized that I really liked international politics, international relations etc. I took the GRE, but my GPA is just dismal (2.75). No grad school is going to accept that, and I wan&amp;#39;t too sure about going to grad school anyway.&lt;/p&gt;\n\n&lt;p&gt;About 8 months later, I got a job as a substitute teacher. I worked a few assignments, but wasn&amp;#39;t getting as many. But I thought I&amp;#39;d give actual teaching a try, so I enrolled in an alternative certification program, and in October, I started working at Ross Dress for Less in October of 2014. I was still enrolled in the program, until August of 2015. I got a full time teaching job. In an alternative certification program, you have to teach for a full school year, as a teacher, before you become fully certified. So I thought I&amp;#39;d teach for a year here, get certified, then I would do what I &lt;em&gt;really&lt;/em&gt; wanted to do; which is teaching English abroad.&lt;/p&gt;\n\n&lt;p&gt;But when I started teaching, it was a terrible experience. It was so bad that I started having panic attacks, was diagnosed with anxiety, missed two weeks of school because I was so sick, and resigned in October. My therapist had advised me to not start looking for a job until December of 2015. So I started applying in 2016 and I got a job at Sears and I&amp;#39;ve been working there ever since.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been applying for other jobs that aren&amp;#39;t retail. I&amp;#39;ve been , relentlessly, applying to teach abroad, but nothing is working. I still live with my parents and I desperately want to get a better job and move out. It just seems like I&amp;#39;m going nowhere, no matter how hard I try. It just feels hopeless, and what&amp;#39;s worse is that I just don&amp;#39;t know what I want to do.&lt;/p&gt;\n\n&lt;p&gt;On top of that, I&amp;#39;ve been having some medical issues (that are finally resolved), but I just feel like whatever I do, anxiety is going to creep in and I won&amp;#39;t be able to handle it. But I hate this job so much! And even worse, I feel like I&amp;#39;m running out of time since I&amp;#39;m almost 27, living with my parents, with a degree, and working a retail job.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a 26 year old woman. I turn 27 in May. I graduated in 2013, with a BA in Political Science. When I first started college, I thought I wanted to go to law school. But after taking a few law-specific classes, I realized that I wasn't really interested in law. Then, I realized that I really liked international politics, international relations etc. I took the GRE, but my GPA is just dismal (2.75). No grad school is going to accept that, and I wan't too sure about going to grad school anyway.\n\nAbout 8 months later, I got a job as a substitute teacher. I worked a few assignments, but wasn't getting as many. But I thought I'd give actual teaching a try, so I enrolled in an alternative certification program, and in October, I started working at Ross Dress for Less in October of 2014. I was still enrolled in the program, until August of 2015. I got a full time teaching job. In an alternative certification program, you have to teach for a full school year, as a teacher, before you become fully certified. So I thought I'd teach for a year here, get certified, then I would do what I *really* wanted to do; which is teaching English abroad.\n\nBut when I started teaching, it was a terrible experience. It was so bad that I started having panic attacks, was diagnosed with anxiety, missed two weeks of school because I was so sick, and resigned in October. My therapist had advised me to not start looking for a job until December of 2015. So I started applying in 2016 and I got a job at Sears and I've been working there ever since.\n\nI've been applying for other jobs that aren't retail. I've been , relentlessly, applying to teach abroad, but nothing is working. I still live with my parents and I desperately want to get a better job and move out. It just seems like I'm going nowhere, no matter how hard I try. It just feels hopeless, and what's worse is that I just don't know what I want to do.\n\nOn top of that, I've been having some medical issues (that are finally resolved), but I just feel like whatever I do, anxiety is going to creep in and I won't be able to handle it. But I hate this job so much! And even worse, I feel like I'm running out of time since I'm almost 27, living with my parents, with a degree, and working a retail job.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "652wun", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "SakuraGirl88", "saved": false, "mod_reports": [], "name": "t3_652wun", "subreddit_name_prefixed": "r/jobs", "approved_by": null, "over_18": false, "domain": "self.jobs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhnd", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/jobs/comments/652wun/how_can_i_get_out_of_retail_hell/", "num_reports": null, "locked": false, "stickied": false, "created": 1492080677.0, "url": "https://www.reddit.com/r/jobs/comments/652wun/how_can_i_get_out_of_retail_hell/", "author_flair_text": null, "quarantine": false, "title": "How can I get out of retail hell?", "created_utc": 1492051877.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": "", "user_reports": [], "id": "dg95yys", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Toltec123", "parent_id": "t1_dg7exj2", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I guess the only option is finding a rich spouse then. Life is hard.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess the only option is finding a rich spouse then. Life is hard.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg95yys", "score_hidden": false, "stickied": false, "created": 1492207493.0, "created_utc": 1492178693.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7exj2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "thejavakat", "parent_id": "t1_dg76fk2", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "No way, with the panic attacks OP has from teaching, what will happen when their manager comes down on them for not meeting quota?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No way, with the panic attacks OP has from teaching, what will happen when their manager comes down on them for not meeting quota?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg7exj2", "score_hidden": false, "stickied": false, "created": 1492111174.0, "created_utc": 1492082374.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76fk2", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Toltec123", "parent_id": "t3_652wun", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Sales. There are plenty of sales rep positions that seek out young women. Since you have a background in education you could even try working for an education vendor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sales. There are plenty of sales rep positions that seek out young women. Since you have a background in education you could even try working for an education vendor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg76fk2", "score_hidden": false, "stickied": false, "created": 1492088656.0, "created_utc": 1492059856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": "", "user_reports": [], "id": "dg7xuw8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jyoona", "parent_id": "t1_dg7gx6r", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "No problem! I am a video analyst for a popular video sharing website. Albeit a contract position, this is my foot in the door.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem! I am a video analyst for a popular video sharing website. Albeit a contract position, this is my foot in the door.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg7xuw8", "score_hidden": false, "stickied": false, "created": 1492135089.0, "created_utc": 1492106289.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7gx6r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Parenteau-Control", "parent_id": "t1_dg7b9tf", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "What type of position did you land? If you don't mind answering", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What type of position did you land? If you don&amp;#39;t mind answering&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg7gx6r", "score_hidden": false, "stickied": false, "created": 1492115214.0, "created_utc": 1492086414.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7b9tf", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Jyoona", "parent_id": "t3_652wun", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Hey, also 26 and I landed my first big girl job about 2 weeks ago. I was going through something similar as I also have a liberal arts degree (with a barely passing gpa). I graduated super late in the summer of 2016 so I stepped into the world feeling like a failure. I really thought I'd never find a non-retail job as my degree seemed pretty useless and my only experiences were in retail with a couple of short internships. I also considered teaching but decided against it after an internship as a T.A. so I feel you on that. \n\nI specifically wanted a non-tech job in a tech company so I started researching to see what kind of positions were available in my area and paid close attention to the qualifications. (Mostly HR, clerical, or operations jobs.) I used Youtube to git gud with Excel (was aiming for the certification), Quickbooks, and a bit of Photoshop so that I'd be a better fit for those positions. I also volunteered in an office at a nearby hospice that I found through VolunteerMatch so that I had some relevant experience to show on my resume. I was starting to look into certificate programs as well so I think that would have been my next step although it isn't necessary. In addition, I studied and memorized potential interview questions/answers every week to boost my overall confidence and made sure to tailor my resume  and cover letter for each job I applied to. \n\nI know that your case is a bit different and it's hard to break out of retail but it's possible! I had a good experience with a contracting agency so that option is out there, although not everyone would recommend it. I'm not sure what kind of position you are looking for but do not hesitate to reach out. (For anyone else as well.) I'd be more than happy to give you tips and help you out the best I can! \n\nEdit: Forgot to say. You are not running out of time. You will find something if you're willing to put in the effort. Do not lose hope and stay positive :) You'll get through this! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, also 26 and I landed my first big girl job about 2 weeks ago. I was going through something similar as I also have a liberal arts degree (with a barely passing gpa). I graduated super late in the summer of 2016 so I stepped into the world feeling like a failure. I really thought I&amp;#39;d never find a non-retail job as my degree seemed pretty useless and my only experiences were in retail with a couple of short internships. I also considered teaching but decided against it after an internship as a T.A. so I feel you on that. &lt;/p&gt;\n\n&lt;p&gt;I specifically wanted a non-tech job in a tech company so I started researching to see what kind of positions were available in my area and paid close attention to the qualifications. (Mostly HR, clerical, or operations jobs.) I used Youtube to git gud with Excel (was aiming for the certification), Quickbooks, and a bit of Photoshop so that I&amp;#39;d be a better fit for those positions. I also volunteered in an office at a nearby hospice that I found through VolunteerMatch so that I had some relevant experience to show on my resume. I was starting to look into certificate programs as well so I think that would have been my next step although it isn&amp;#39;t necessary. In addition, I studied and memorized potential interview questions/answers every week to boost my overall confidence and made sure to tailor my resume  and cover letter for each job I applied to. &lt;/p&gt;\n\n&lt;p&gt;I know that your case is a bit different and it&amp;#39;s hard to break out of retail but it&amp;#39;s possible! I had a good experience with a contracting agency so that option is out there, although not everyone would recommend it. I&amp;#39;m not sure what kind of position you are looking for but do not hesitate to reach out. (For anyone else as well.) I&amp;#39;d be more than happy to give you tips and help you out the best I can! &lt;/p&gt;\n\n&lt;p&gt;Edit: Forgot to say. You are not running out of time. You will find something if you&amp;#39;re willing to put in the effort. Do not lose hope and stay positive :) You&amp;#39;ll get through this! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg7b9tf", "score_hidden": false, "stickied": false, "created": 1492100489.0, "created_utc": 1492071689.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": "", "user_reports": [], "id": "dg79suu", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ToTimesTwoisToo", "parent_id": "t3_652wun", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "hope you're doing well. You have a bachelor's degree, that's a good start. There are plenty of jobs that just require a bachelors degree, not even a specific degree. Just go to indeed and type \"bachelor degree\" and you'll see all kinds of stuff. Most are in office types of environments, which should be quite nice compared to retail and classrooms. Given your anxiety, think carefully about the types of environments you'd like to be in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hope you&amp;#39;re doing well. You have a bachelor&amp;#39;s degree, that&amp;#39;s a good start. There are plenty of jobs that just require a bachelors degree, not even a specific degree. Just go to indeed and type &amp;quot;bachelor degree&amp;quot; and you&amp;#39;ll see all kinds of stuff. Most are in office types of environments, which should be quite nice compared to retail and classrooms. Given your anxiety, think carefully about the types of environments you&amp;#39;d like to be in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg79suu", "score_hidden": false, "stickied": false, "created": 1492096298.0, "created_utc": 1492067498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": "", "user_reports": [], "id": "dg71lho", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ChickenXing", "parent_id": "t3_652wun", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I've hopped from one field to another doing this and it's not the easiest thing.  First question for you is when you submit cover letters and resumes to non-retail positions, how much do you customize them for the position?  Doing this is key and then you just need an employer who can buy into you wanting to switch over.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve hopped from one field to another doing this and it&amp;#39;s not the easiest thing.  First question for you is when you submit cover letters and resumes to non-retail positions, how much do you customize them for the position?  Doing this is key and then you just need an employer who can buy into you wanting to switch over.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg71lho", "score_hidden": false, "stickied": false, "created": 1492081312.0, "created_utc": 1492052512.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": "", "user_reports": [], "id": "dg77ae9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CommanderAze", "parent_id": "t3_652wun", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Americorps NCCC (look at FEMA corps)  might lead to a good job in emergency management ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Americorps NCCC (look at FEMA corps)  might lead to a good job in emergency management &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg77ae9", "score_hidden": false, "stickied": false, "created": 1492090280.0, "created_utc": 1492061480.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": "", "user_reports": [], "id": "dg7bovc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "techstar18", "parent_id": "t1_dg7bkub", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Yes actually. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes actually. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg7bovc", "score_hidden": false, "stickied": false, "created": 1492101755.0, "created_utc": 1492072955.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": "", "user_reports": [], "id": "dg8da37", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SuperFurryUnicorn", "parent_id": "t1_dg7bkub", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Maybe he meant in marketing. Which is kinda true but it depends on the company because a lot of \"entry level marketing\" positions things like are selling Comcast inside Walmart and don't require experience. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe he meant in marketing. Which is kinda true but it depends on the company because a lot of &amp;quot;entry level marketing&amp;quot; positions things like are selling Comcast inside Walmart and don&amp;#39;t require experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8da37", "score_hidden": false, "stickied": false, "created": 1492152861.0, "created_utc": 1492124061.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bkub", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Plinkplonk3030", "parent_id": "t1_dg7a78s", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "&gt;You dont need experience for an entry level job.\n\nHave you applied for an entry level job lately?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You dont need experience for an entry level job.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Have you applied for an entry level job lately?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg7bkub", "score_hidden": false, "stickied": false, "created": 1492101406.0, "created_utc": 1492072606.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7a78s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "techstar18", "parent_id": "t3_652wun", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Try marketing. You don't need experience for an entry level job and there can be excellent growth opportunities.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try marketing. You don&amp;#39;t need experience for an entry level job and there can be excellent growth opportunities.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg7a78s", "score_hidden": false, "stickied": false, "created": 1492097394.0, "created_utc": 1492068594.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": "", "user_reports": [], "id": "dg7nu4v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "newladygrey", "parent_id": "t3_652wun", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Hi! I don't have any real advice for you except to say don't give up! I'm 34 years old and worked in retail for over 12 years. Went back to do my masters in library science 7 years ago, just when a hiring freeze started so the retail job I was working over weekends turned into a full time job for 7 years. I started to get very disheartened and worried that in my 30s it was too late for me to change careers. But once you figure out what you'd want to do you need to go after it, don't doubt yourself! And good luck :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! I don&amp;#39;t have any real advice for you except to say don&amp;#39;t give up! I&amp;#39;m 34 years old and worked in retail for over 12 years. Went back to do my masters in library science 7 years ago, just when a hiring freeze started so the retail job I was working over weekends turned into a full time job for 7 years. I started to get very disheartened and worried that in my 30s it was too late for me to change careers. But once you figure out what you&amp;#39;d want to do you need to go after it, don&amp;#39;t doubt yourself! And good luck :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg7nu4v", "score_hidden": false, "stickied": false, "created": 1492124387.0, "created_utc": 1492095587.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_652wun", "likes": null, "replies": "", "user_reports": [], "id": "dg7ez8r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kowzorz", "parent_id": "t1_dg773oa", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Look up a local union and see if they offer anything. For example, the local-to-me union of electricians have this sort of program I mention: http://www.washdcjatc.org/whatisjatc.cfm\n\nIf they don't have an official program like that, just call them (or a private electrician contractor) up and ask if they do apprenticeships for someone with little experience.\n\nShort of that: http://www.wikihow.com/Become-a-Licensed-Electrician (and replace electrician with trade job of your choice)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look up a local union and see if they offer anything. For example, the local-to-me union of electricians have this sort of program I mention: &lt;a href=\"http://www.washdcjatc.org/whatisjatc.cfm\"&gt;http://www.washdcjatc.org/whatisjatc.cfm&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If they don&amp;#39;t have an official program like that, just call them (or a private electrician contractor) up and ask if they do apprenticeships for someone with little experience.&lt;/p&gt;\n\n&lt;p&gt;Short of that: &lt;a href=\"http://www.wikihow.com/Become-a-Licensed-Electrician\"&gt;http://www.wikihow.com/Become-a-Licensed-Electrician&lt;/a&gt; (and replace electrician with trade job of your choice)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg7ez8r", "score_hidden": false, "stickied": false, "created": 1492111289.0, "created_utc": 1492082489.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg773oa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "palazzotings", "parent_id": "t1_dg759mv", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I don't want to jack the thread, but do you have any advice on how to go about getting an apprenticeship in a trade job? I'm a senior in college graduating with a degree in public health in June and I'm not really sure if it's a field that I want to have a career in. I feel a job that's more hands-on might be better for me. Maybe I should have gone to my local tech school instead, but I felt that getting a degree from a 4-year college would serve me better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want to jack the thread, but do you have any advice on how to go about getting an apprenticeship in a trade job? I&amp;#39;m a senior in college graduating with a degree in public health in June and I&amp;#39;m not really sure if it&amp;#39;s a field that I want to have a career in. I feel a job that&amp;#39;s more hands-on might be better for me. Maybe I should have gone to my local tech school instead, but I felt that getting a degree from a 4-year college would serve me better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg773oa", "score_hidden": false, "stickied": false, "created": 1492089899.0, "created_utc": 1492061099.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg759mv", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Kowzorz", "parent_id": "t3_652wun", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "There are lots of trade unions (electricians, etc) who will pay you to apprentice with them, though that might not be your bag of worms.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are lots of trade unions (electricians, etc) who will pay you to apprentice with them, though that might not be your bag of worms.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg759mv", "score_hidden": false, "stickied": false, "created": 1492086698.0, "created_utc": 1492057898.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]