[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "jobs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a first year university student and I have a major problem: I just don&amp;#39;t know what I want to do later in life! So, I&amp;#39;ll start with describing myself:&lt;/p&gt;\n\n&lt;p&gt;I am 19 years old and I live in Canada. Ever since I was a kid, I was passionate by nature, id often go to the forest near my house, river and catch, check out and release some of the critters out there. The first time I went to the ocean, I did not come out of the water at all! I was looking for fish, crabs and other living things and it was so fun! Since then, ive also bought an aquarium, have several pets at home (cats, parrots etc). Then one day, ive discovered about the Amazon rainforest and I felt so amazed by it. Another thing about me is that I absolutely love travelling, meeting new people and becoming friends, creating an international connection. I have been to many countries in Europe, where I have spoken to many people and was always interested about their history (by the way, Im also quite passionate about world history, especially WW2 and the Cold War). Im also interested in geography, and I can locate ANY country in the world, as well as many cities, forests, locations, states etc. I&amp;#39;ve also travelled to the U.S., Costa Rica, Mexico, as well as many islands in the Caribbean. I will be getting my diving certification so that I can go scuba diving with less restrictions.&lt;/p&gt;\n\n&lt;p&gt;I can speak 3 fluent languages (including two major: French and English) and I recently learned and am pretty good in Spanish.&lt;/p&gt;\n\n&lt;p&gt;And lastly, I am also a health freak! I used to play soccer(football), competitive swimming, hockey, skiing, athletisicm and for fun, i&amp;#39;d literarly play every other sport that exists. I love the feeling of adrenaline so extreme sports are high on my list of interests! Nowadays because of university, I only go to the gym and work very hard, as well as watching my diet (macros). I am in very good shape! &lt;/p&gt;\n\n&lt;p&gt;As a side job, I am a lifeguard and I love it, as I get to work outside and get to work with awesome people. Everytime I had a job at a convenience store, I quickly quit due to boredom (Although I really liked talking to people)&lt;/p&gt;\n\n&lt;p&gt;As for other hobbies, I love to go partying (especially big ones), biking, kayaking, driving cars etc.&lt;/p&gt;\n\n&lt;p&gt;Lastly, I have high interest in world affairs and politics, and would love to be part of a team solving a world problem (working in the U.N. would be awesome)&lt;/p&gt;\n\n&lt;p&gt;Now, enough describing myself, I could go on and on and on. So one day, I got old enough and had to choose a major in university. This is seriously killing me inside and getting me (almost) depressed because I seriously don&amp;#39;t know what I want to do! I have all my sciences done, so I can pretty much go into anything (even finance). Because I don&amp;#39;t know what to do, I blindly chose Mechanical Engineering and I&amp;#39;m doing very well. However, I really don&amp;#39;t like it, I am only slightly interested in robots and small parts. I also chose it just because of job opportunities and salaries. I absolutely do not want to work in a coorporate environment, being stuck in an office my whole life would kill me (except being in a plane)!However, I want to start a family one day, so a balance of field work and office would be perfect. I wanted to do marine biology, but it had too many disadvantages (like low pay and hard to find jobs), and so I scratched it off :/ .Then I stumbled upon oceanography, which I think was perfect, because of potentially high salaries and a mix of field/office work. However, there is no such program where I live, and so I heard that you can do a masters in that if you have a bachelors in civil engineering. Also, im in the army which will be my summer job for the year, after that, im most likely quitting. &lt;/p&gt;\n\n&lt;p&gt;In brief, I would like to have a job that is international (being part in a global effort), has an actual meaning and goal, exciting, high paying etc. Yes I am aware that those are impossible standards, but if you have any idea on what I could do, that would help me a lit in life. I am so confused with life and it is getting me near depression. &lt;/p&gt;\n\n&lt;p&gt;Sorry for the long post, I just had to do it, and thank you for your help!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a first year university student and I have a major problem: I just don't know what I want to do later in life! So, I'll start with describing myself:\n\nI am 19 years old and I live in Canada. Ever since I was a kid, I was passionate by nature, id often go to the forest near my house, river and catch, check out and release some of the critters out there. The first time I went to the ocean, I did not come out of the water at all! I was looking for fish, crabs and other living things and it was so fun! Since then, ive also bought an aquarium, have several pets at home (cats, parrots etc). Then one day, ive discovered about the Amazon rainforest and I felt so amazed by it. Another thing about me is that I absolutely love travelling, meeting new people and becoming friends, creating an international connection. I have been to many countries in Europe, where I have spoken to many people and was always interested about their history (by the way, Im also quite passionate about world history, especially WW2 and the Cold War). Im also interested in geography, and I can locate ANY country in the world, as well as many cities, forests, locations, states etc. I've also travelled to the U.S., Costa Rica, Mexico, as well as many islands in the Caribbean. I will be getting my diving certification so that I can go scuba diving with less restrictions.\n\nI can speak 3 fluent languages (including two major: French and English) and I recently learned and am pretty good in Spanish.\n\nAnd lastly, I am also a health freak! I used to play soccer(football), competitive swimming, hockey, skiing, athletisicm and for fun, i'd literarly play every other sport that exists. I love the feeling of adrenaline so extreme sports are high on my list of interests! Nowadays because of university, I only go to the gym and work very hard, as well as watching my diet (macros). I am in very good shape! \n\nAs a side job, I am a lifeguard and I love it, as I get to work outside and get to work with awesome people. Everytime I had a job at a convenience store, I quickly quit due to boredom (Although I really liked talking to people)\n\nAs for other hobbies, I love to go partying (especially big ones), biking, kayaking, driving cars etc.\n\nLastly, I have high interest in world affairs and politics, and would love to be part of a team solving a world problem (working in the U.N. would be awesome)\n\nNow, enough describing myself, I could go on and on and on. So one day, I got old enough and had to choose a major in university. This is seriously killing me inside and getting me (almost) depressed because I seriously don't know what I want to do! I have all my sciences done, so I can pretty much go into anything (even finance). Because I don't know what to do, I blindly chose Mechanical Engineering and I'm doing very well. However, I really don't like it, I am only slightly interested in robots and small parts. I also chose it just because of job opportunities and salaries. I absolutely do not want to work in a coorporate environment, being stuck in an office my whole life would kill me (except being in a plane)!However, I want to start a family one day, so a balance of field work and office would be perfect. I wanted to do marine biology, but it had too many disadvantages (like low pay and hard to find jobs), and so I scratched it off :/ .Then I stumbled upon oceanography, which I think was perfect, because of potentially high salaries and a mix of field/office work. However, there is no such program where I live, and so I heard that you can do a masters in that if you have a bachelors in civil engineering. Also, im in the army which will be my summer job for the year, after that, im most likely quitting. \n\nIn brief, I would like to have a job that is international (being part in a global effort), has an actual meaning and goal, exciting, high paying etc. Yes I am aware that those are impossible standards, but if you have any idea on what I could do, that would help me a lit in life. I am so confused with life and it is getting me near depression. \n\nSorry for the long post, I just had to do it, and thank you for your help!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "655mxk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "Al2104", "saved": false, "mod_reports": [], "name": "t3_655mxk", "subreddit_name_prefixed": "r/jobs", "approved_by": null, "over_18": false, "domain": "self.jobs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhnd", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/jobs/comments/655mxk/i_dont_know_what_to_do_in_my_life/", "num_reports": null, "locked": false, "stickied": false, "created": 1492120812.0, "url": "https://www.reddit.com/r/jobs/comments/655mxk/i_dont_know_what_to_do_in_my_life/", "author_flair_text": null, "quarantine": false, "title": "I don't know what to do in my life!", "created_utc": 1492092012.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_655mxk", "likes": null, "replies": "", "user_reports": [], "id": "dg859rp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bigfrostynugs", "parent_id": "t3_655mxk", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Have you considered ecology? Environmental remediation pays good and is in line with most of your interests.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you considered ecology? Environmental remediation pays good and is in line with most of your interests.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg859rp", "score_hidden": false, "stickied": false, "created": 1492143098.0, "created_utc": 1492114298.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_655mxk", "likes": null, "replies": "", "user_reports": [], "id": "dg8j63m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "unrulywheatfield", "parent_id": "t3_655mxk", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Forestry", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Forestry&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8j63m", "score_hidden": false, "stickied": false, "created": 1492160840.0, "created_utc": 1492132040.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]