[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "jobs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi guys, I graduated college. &lt;/p&gt;\n\n&lt;p&gt;In 2013. &lt;/p&gt;\n\n&lt;p&gt;And I still can&amp;#39;t find a job, because (per the title) I literally bomb every single interview.  As the length of time that I&amp;#39;ve been searching might suggest, I have interviewed for a lot of jobs, in fact the number of interviews that I have bombed might be at or over triple digits by this point in time.  Holy fuck that&amp;#39;s a lot, even as I write this now it blows my fucking mind.&lt;/p&gt;\n\n&lt;p&gt;I have generally identified three reasons why I am terrible at interviewing.  (Edit, apparently I also blow at reddit formatting.)&lt;/p&gt;\n\n&lt;p&gt;1&lt;/p&gt;\n\n&lt;p&gt;I bomb pretty much any question that I don&amp;#39;t explicitly prepare for and memorize some sort of response toward. Perhaps this is an indictment of my intellect over my interviewing ability, because I often find it really, really hard to think up a meaningful, cogent, and relevant response within the 15 seconds or so that you are given to respond to the interviewer.  I find STAR questions especially difficult in this regard.  My typical response to being asked a question like this is typically to pause for a really uncomfortable amount of time while I try to formulate an answer, then eventually breaking the silence by just going YOLO mode and word-vomiting my half-baked idea to the interviewer.  &lt;/p&gt;\n\n&lt;p&gt;I have tried to mitigate this by memorizing dozens of canned answers, but I generally find some way to make the previous scenario happen in a vast majority of interviews.&lt;/p&gt;\n\n&lt;p&gt;2&lt;/p&gt;\n\n&lt;p&gt;I suck ass at faking enthusiasm.  I don&amp;#39;t say this in the sense that I do not want the jobs that I&amp;#39;m interviewing for (usually I really want them), but in the sense that I have an even temperament and try to consider myself objective about what the job will really entail.  I have been told several times by interviewers that I didn&amp;#39;t really seem like I wanted the job because I didn&amp;#39;t really seem excited about it.  I&amp;#39;m pretty sure that in all of these instances I actually did really want the job, I just wasn&amp;#39;t good at faking the enthusiasm for it.  I have tried pumping up the fake enthusiasm or whatever in a few interviews, but it always ends up really awkward and at the end of the interview I just hope for my own sake that I never have to see any of these people ever again. &lt;/p&gt;\n\n&lt;p&gt;3&lt;/p&gt;\n\n&lt;p&gt;I think that my speaking style tends to hurt me. I have always been someone that has a very distinct style of communication, as I tend to alternate between periods of silence and periods of intense activity where I will bomb out like ten sentences in a row.  It&amp;#39;s kind of like being lexically bipolar or some shit. (I am cognizant that is a made up term with probably no real meaning to anybody but myself). &lt;/p&gt;\n\n&lt;p&gt;Ever since I was in grade school my parents have been trying to change this so that I speak at a more even pace, but I&amp;#39;m pretty sure that I&amp;#39;m stuck like this forever.  While I&amp;#39;m not 100% sure that this trait always hinders my interview, I do think that it is a gross negative in the overall balance of my interviewing career.   There have been a few interviews where the interviewer has explicitly commented or complained about this.&lt;/p&gt;\n\n&lt;p&gt;I know that this is sort of tl:dr and sort of a vent, but what do you guys think are some good strategies or ideas that I could incorporate into my interviews?? I have interviewed for many different types of jobs, as I have a BA in fucking bullshit from a large state flagship, FWIW.  Thanks. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi guys, I graduated college. \n\nIn 2013. \n\nAnd I still can't find a job, because (per the title) I literally bomb every single interview.  As the length of time that I've been searching might suggest, I have interviewed for a lot of jobs, in fact the number of interviews that I have bombed might be at or over triple digits by this point in time.  Holy fuck that's a lot, even as I write this now it blows my fucking mind.\n\nI have generally identified three reasons why I am terrible at interviewing.  (Edit, apparently I also blow at reddit formatting.)\n\n\n 1\n\nI bomb pretty much any question that I don't explicitly prepare for and memorize some sort of response toward. Perhaps this is an indictment of my intellect over my interviewing ability, because I often find it really, really hard to think up a meaningful, cogent, and relevant response within the 15 seconds or so that you are given to respond to the interviewer.  I find STAR questions especially difficult in this regard.  My typical response to being asked a question like this is typically to pause for a really uncomfortable amount of time while I try to formulate an answer, then eventually breaking the silence by just going YOLO mode and word-vomiting my half-baked idea to the interviewer.  \n\nI have tried to mitigate this by memorizing dozens of canned answers, but I generally find some way to make the previous scenario happen in a vast majority of interviews.\n\n\n2\n\n\n\nI suck ass at faking enthusiasm.  I don't say this in the sense that I do not want the jobs that I'm interviewing for (usually I really want them), but in the sense that I have an even temperament and try to consider myself objective about what the job will really entail.  I have been told several times by interviewers that I didn't really seem like I wanted the job because I didn't really seem excited about it.  I'm pretty sure that in all of these instances I actually did really want the job, I just wasn't good at faking the enthusiasm for it.  I have tried pumping up the fake enthusiasm or whatever in a few interviews, but it always ends up really awkward and at the end of the interview I just hope for my own sake that I never have to see any of these people ever again. \n\n\n3\n\n\nI think that my speaking style tends to hurt me. I have always been someone that has a very distinct style of communication, as I tend to alternate between periods of silence and periods of intense activity where I will bomb out like ten sentences in a row.  It's kind of like being lexically bipolar or some shit. (I am cognizant that is a made up term with probably no real meaning to anybody but myself). \n\nEver since I was in grade school my parents have been trying to change this so that I speak at a more even pace, but I'm pretty sure that I'm stuck like this forever.  While I'm not 100% sure that this trait always hinders my interview, I do think that it is a gross negative in the overall balance of my interviewing career.   There have been a few interviews where the interviewer has explicitly commented or complained about this.\n\n\n\nI know that this is sort of tl:dr and sort of a vent, but what do you guys think are some good strategies or ideas that I could incorporate into my interviews?? I have interviewed for many different types of jobs, as I have a BA in fucking bullshit from a large state flagship, FWIW.  Thanks. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "659a5n", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 78, "report_reasons": null, "author": "handsofthedonald", "saved": false, "mod_reports": [], "name": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "approved_by": null, "over_18": false, "domain": "self.jobs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhnd", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/jobs/comments/659a5n/dear_rjobs_i_literally_bomb_every_single_interview/", "num_reports": null, "locked": false, "stickied": false, "created": 1492156888.0, "url": "https://www.reddit.com/r/jobs/comments/659a5n/dear_rjobs_i_literally_bomb_every_single_interview/", "author_flair_text": null, "quarantine": false, "title": "Dear r/jobs, I literally bomb every single interview.", "created_utc": 1492128088.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 50, "visited": false, "subreddit_type": "public", "ups": 78}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8gras", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "salydra", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Talk to the interviewer. Sometimes when I get a tough question I'll make a joke about how nobody likes that question (works well for questions like your biggest weakness) or tell a relevant story about school or another job. Just say something. And talk to the interviewer, don't just spot out answers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to the interviewer. Sometimes when I get a tough question I&amp;#39;ll make a joke about how nobody likes that question (works well for questions like your biggest weakness) or tell a relevant story about school or another job. Just say something. And talk to the interviewer, don&amp;#39;t just spot out answers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8gras", "score_hidden": false, "stickied": false, "created": 1492157531.0, "created_utc": 1492128731.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8nufk", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "iamdorkette", "parent_id": "t1_dg8nf2h", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Yeah, they can be weird sometimes, but I figure that's *probably* not my fault.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, they can be weird sometimes, but I figure that&amp;#39;s &lt;em&gt;probably&lt;/em&gt; not my fault.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8nufk", "score_hidden": false, "stickied": false, "created": 1492167426.0, "created_utc": 1492138626.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nf2h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "im_really_monica", "parent_id": "t1_dg8lo8n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "That's awesome! I just frequently get this weirded-out vibe in the room for government interviews (and I've worked county jobs, too, so I can pull it off).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s awesome! I just frequently get this weirded-out vibe in the room for government interviews (and I&amp;#39;ve worked county jobs, too, so I can pull it off).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8nf2h", "score_hidden": false, "stickied": false, "created": 1492166801.0, "created_utc": 1492138001.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg9i70c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iamdorkette", "parent_id": "t1_dg9cgxu", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I always count laughing a good thing, if it isn't aimed at me. :) Hope you get it! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always count laughing a good thing, if it isn&amp;#39;t aimed at me. :) Hope you get it! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9i70c", "score_hidden": false, "stickied": false, "created": 1492222000.0, "created_utc": 1492193200.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cgxu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Focus62", "parent_id": "t1_dg8lo8n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I've had few government interviews, including one two days ago and I felt like it was my best performance yet because I actually managed to make them laugh a bit. It felt like more than just going through the motions which is how I want it to be!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had few government interviews, including one two days ago and I felt like it was my best performance yet because I actually managed to make them laugh a bit. It felt like more than just going through the motions which is how I want it to be!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9cgxu", "score_hidden": false, "stickied": false, "created": 1492215458.0, "created_utc": 1492186658.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8lo8n", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "iamdorkette", "parent_id": "t1_dg8ken6", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I have had many county government interviews recently with the 3-4 person panel and I treat those like conversations too. If I am going to work with these people, I need to start right and not terrify myself with Government Interview. Nah, they're people, they woke up and had some coffee or something this morning and one of them probably has to pee, but has to hold it.  I answer their questions, but if I derp or I crack a joke I am not going to worry about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have had many county government interviews recently with the 3-4 person panel and I treat those like conversations too. If I am going to work with these people, I need to start right and not terrify myself with Government Interview. Nah, they&amp;#39;re people, they woke up and had some coffee or something this morning and one of them probably has to pee, but has to hold it.  I answer their questions, but if I derp or I crack a joke I am not going to worry about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8lo8n", "score_hidden": false, "stickied": false, "created": 1492164312.0, "created_utc": 1492135512.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg9g7c7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RobinKennedy23", "parent_id": "t1_dg8ken6", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I agree in the idea of trying to connect with your interviewer. I definitely bombed a few STAR interview questions in my last interview but I had a normal conversation about hobbies that both the interviewer and I had afterwards. I ended up getting an offer.\n\nHowever it sounds like OP has a problem with conversation so it might not work too well in their case.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree in the idea of trying to connect with your interviewer. I definitely bombed a few STAR interview questions in my last interview but I had a normal conversation about hobbies that both the interviewer and I had afterwards. I ended up getting an offer.&lt;/p&gt;\n\n&lt;p&gt;However it sounds like OP has a problem with conversation so it might not work too well in their case.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9g7c7", "score_hidden": false, "stickied": false, "created": 1492219682.0, "created_utc": 1492190882.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ken6", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "im_really_monica", "parent_id": "t1_dg8gfyf", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "&gt; Sounds like you're trying to fake a lot and trying to anticipate the answers to questions you think someone will want to hear. Instead of just answering honestly and having a conversation.\n\nI used to do this when I was younger and inexperienced. I had a very hard time answering behavioral-type questions because of my lack of experience, and of course, I went into interviews with the approach of, \"I hope they like me enough to offer me a job.\" \n\nNow, I realize that interviews (well, not those contrived, stupid government job interviews, but normal-people interviews) are just conversations. I'm interviewing them, too, and going in with that frame of mind equalizes the power dynamic. \n\nPlus, I want to know if I'll LIKE working there with those people, so I look for any opening to be conversational. For example, with my last interview, my interviewer (now boss) asked me why I like doing what I do. The question ended with her asking me about my favorite place for cheesesteaks (and I was completely on topic!) :)  I've withdrawn myself from consideration from other jobs because of red flags that came up during interviews. I NEVER would have done that when I was younger.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Sounds like you&amp;#39;re trying to fake a lot and trying to anticipate the answers to questions you think someone will want to hear. Instead of just answering honestly and having a conversation.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I used to do this when I was younger and inexperienced. I had a very hard time answering behavioral-type questions because of my lack of experience, and of course, I went into interviews with the approach of, &amp;quot;I hope they like me enough to offer me a job.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Now, I realize that interviews (well, not those contrived, stupid government job interviews, but normal-people interviews) are just conversations. I&amp;#39;m interviewing them, too, and going in with that frame of mind equalizes the power dynamic. &lt;/p&gt;\n\n&lt;p&gt;Plus, I want to know if I&amp;#39;ll LIKE working there with those people, so I look for any opening to be conversational. For example, with my last interview, my interviewer (now boss) asked me why I like doing what I do. The question ended with her asking me about my favorite place for cheesesteaks (and I was completely on topic!) :)  I&amp;#39;ve withdrawn myself from consideration from other jobs because of red flags that came up during interviews. I NEVER would have done that when I was younger.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8ken6", "score_hidden": false, "stickied": false, "created": 1492162551.0, "created_utc": 1492133751.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8gfyf", "gilded": 0, "archived": false, "score": 60, "report_reasons": null, "author": "Hollowpoint38", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "You might be one of those what I like to call \"smart stupid people.\"  You make great grades and have deep thoughts, but struggle with small tasks like conversations or checking email.\n\nSounds like you're trying to fake a lot and trying to anticipate the answers to questions you *think* someone will want to hear.  Instead of just answering honestly and having a conversation.\n\nAn interview is just a conversation.  That's all.  Can you just answer questions with your thoughts and communicate?  Leave out all the \"trying to outsmart the system\" crap?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might be one of those what I like to call &amp;quot;smart stupid people.&amp;quot;  You make great grades and have deep thoughts, but struggle with small tasks like conversations or checking email.&lt;/p&gt;\n\n&lt;p&gt;Sounds like you&amp;#39;re trying to fake a lot and trying to anticipate the answers to questions you &lt;em&gt;think&lt;/em&gt; someone will want to hear.  Instead of just answering honestly and having a conversation.&lt;/p&gt;\n\n&lt;p&gt;An interview is just a conversation.  That&amp;#39;s all.  Can you just answer questions with your thoughts and communicate?  Leave out all the &amp;quot;trying to outsmart the system&amp;quot; crap?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8gfyf", "score_hidden": false, "stickied": false, "created": 1492157105.0, "created_utc": 1492128305.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 60}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8qyb2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "unicorn_poop69", "parent_id": "t1_dg8icrl", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "If you happen to still live around the college you graduated from, check out their career center/office on their website and see what they offer. My school offers interviewing help (like mock interviews) for students who have graduated as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you happen to still live around the college you graduated from, check out their career center/office on their website and see what they offer. My school offers interviewing help (like mock interviews) for students who have graduated as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8qyb2", "score_hidden": false, "stickied": false, "created": 1492172322.0, "created_utc": 1492143522.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8icrl", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "handsofthedonald", "parent_id": "t1_dg8hxui", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Yea, I'm really bad a carrying on regular conversations.  I have a tendency to either say very little in the conversation or conversely to dominate the conversation by going like way too deep into a topic or idea. I have tried practicing quite a bit, although I'm not sure that it meaningfully helped me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea, I&amp;#39;m really bad a carrying on regular conversations.  I have a tendency to either say very little in the conversation or conversely to dominate the conversation by going like way too deep into a topic or idea. I have tried practicing quite a bit, although I&amp;#39;m not sure that it meaningfully helped me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8icrl", "score_hidden": false, "stickied": false, "created": 1492159731.0, "created_utc": 1492130931.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8hxui", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "meowmentlikedis", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Have you tried practicing with someone? The college you went to probably has a career center with people who can help you practice your interview skills. Or you could practice with family or friends. Local job hunting groups often have practice interviews too. Do you have trouble thinking of things to say in regular conversation with people. Try thinking of an interview more of as a conversation than someone grilling you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tried practicing with someone? The college you went to probably has a career center with people who can help you practice your interview skills. Or you could practice with family or friends. Local job hunting groups often have practice interviews too. Do you have trouble thinking of things to say in regular conversation with people. Try thinking of an interview more of as a conversation than someone grilling you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8hxui", "score_hidden": false, "stickied": false, "created": 1492159167.0, "created_utc": 1492130367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8tj3p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "oneplytoiletpaper", "parent_id": "t1_dg8rei5", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I actually think this is great advice, I did this myself because I would always get comments from people saying they thought I was cold when I first met them. Now people think I'm this super extroverted person when in reality I'm just less stand-offish and have a better tone. I also like to use this example to answer certain interview questions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually think this is great advice, I did this myself because I would always get comments from people saying they thought I was cold when I first met them. Now people think I&amp;#39;m this super extroverted person when in reality I&amp;#39;m just less stand-offish and have a better tone. I also like to use this example to answer certain interview questions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8tj3p", "score_hidden": false, "stickied": false, "created": 1492177125.0, "created_utc": 1492148325.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8rei5", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Hellofromzeothaside", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Try getting a part time job as a cashier or something you have to interact with people, and start forcing conversations. That's how I got good at bullshitting with people. Probably not the greatest advice but it's what I've got for ya ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try getting a part time job as a cashier or something you have to interact with people, and start forcing conversations. That&amp;#39;s how I got good at bullshitting with people. Probably not the greatest advice but it&amp;#39;s what I&amp;#39;ve got for ya &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8rei5", "score_hidden": false, "stickied": false, "created": 1492173085.0, "created_utc": 1492144285.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8udha", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ReggieJ", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I think you need to reframe your thinking on a few things and that might help you some. \n\nYou don't suck at faking enthusiasm. You suck at expressing enthusiasm. You seem unable to make the interviewer think you want the job. That's bad. You can't seem to get that across even when you are genuinely enthusiastic about an opportunity. Communication is a skill and if you approach it as something people fake as opposed to something they learn to do well, you're foreclosing yourself from the possibility of improving. \n\nI think your talking style is a symptom of the same problem. People have been advising you to treat an interview like a conversation but judging from your op and your subsequent posts, i don't think you know what that means. A conversation is a manifestation of mutually expressed interest. It is not a period of disengagement occasionally followed by a monologue then another period of disengagement. \n\nTaking all that together, your interviewer is waking away thinking that you don't have an interest in the job and you don't have an interest in the interviewer. Compared to the impression that leaves behind, bombing a few actual questions seems like a pretty minor point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you need to reframe your thinking on a few things and that might help you some. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t suck at faking enthusiasm. You suck at expressing enthusiasm. You seem unable to make the interviewer think you want the job. That&amp;#39;s bad. You can&amp;#39;t seem to get that across even when you are genuinely enthusiastic about an opportunity. Communication is a skill and if you approach it as something people fake as opposed to something they learn to do well, you&amp;#39;re foreclosing yourself from the possibility of improving. &lt;/p&gt;\n\n&lt;p&gt;I think your talking style is a symptom of the same problem. People have been advising you to treat an interview like a conversation but judging from your op and your subsequent posts, i don&amp;#39;t think you know what that means. A conversation is a manifestation of mutually expressed interest. It is not a period of disengagement occasionally followed by a monologue then another period of disengagement. &lt;/p&gt;\n\n&lt;p&gt;Taking all that together, your interviewer is waking away thinking that you don&amp;#39;t have an interest in the job and you don&amp;#39;t have an interest in the interviewer. Compared to the impression that leaves behind, bombing a few actual questions seems like a pretty minor point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8udha", "score_hidden": false, "stickied": false, "created": 1492178975.0, "created_utc": 1492150175.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dga4moe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "handsofthedonald", "parent_id": "t1_dg9dj96", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I might look into it. When I was younger my mom took me to a speech therapist and she said I was fine, but obviously things can change over time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I might look into it. When I was younger my mom took me to a speech therapist and she said I was fine, but obviously things can change over time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dga4moe", "score_hidden": false, "stickied": false, "created": 1492250771.0, "created_utc": 1492221971.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dj96", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "littlelamb0814", "parent_id": "t1_dg8kms3", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Yes! Speech therapist! They can work with you on your conversational struggles. They can also do an evaluation on you to identify specific weaknesses and help you to develop in those areas.\n\nSame with psychologists. They can do a psych evaluation on you to figure out how your brain is working, and how to help you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes! Speech therapist! They can work with you on your conversational struggles. They can also do an evaluation on you to identify specific weaknesses and help you to develop in those areas.&lt;/p&gt;\n\n&lt;p&gt;Same with psychologists. They can do a psych evaluation on you to figure out how your brain is working, and how to help you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9dj96", "score_hidden": false, "stickied": false, "created": 1492216646.0, "created_utc": 1492187846.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg90eeq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Undeil", "parent_id": "t1_dg8kms3", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I second this, I'm surprised no one else has mentioned a similar course of action. Reading this post sounded like something far beyond just needing to practice public speaking with family and friends. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I second this, I&amp;#39;m surprised no one else has mentioned a similar course of action. Reading this post sounded like something far beyond just needing to practice public speaking with family and friends. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg90eeq", "score_hidden": false, "stickied": false, "created": 1492196816.0, "created_utc": 1492168016.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8kms3", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Rlchv70", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Sounds like you may need some professional help. Talk to a psychiatrist, psychologist, or speech therapist to see what they think. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you may need some professional help. Talk to a psychiatrist, psychologist, or speech therapist to see what they think. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8kms3", "score_hidden": false, "stickied": false, "created": 1492162861.0, "created_utc": 1492134061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8kim4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "allonsy_badwolf", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I second the practicing part. My degree made me take 3 types of communications courses and I swear that helped me so much.\n\nTry reading about business/interview communication and see if you can get someone to practice with. Have them get a long list of questions that you can't see to help you practice more answering on the spot.\n\nI don't know how bold you are, but a few guys in my classes joined acting/comedy clubs and classes and it helped them open up immensely. I don't think I could don't, but it helped them learn to speak in front of people on the spot using improv.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I second the practicing part. My degree made me take 3 types of communications courses and I swear that helped me so much.&lt;/p&gt;\n\n&lt;p&gt;Try reading about business/interview communication and see if you can get someone to practice with. Have them get a long list of questions that you can&amp;#39;t see to help you practice more answering on the spot.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how bold you are, but a few guys in my classes joined acting/comedy clubs and classes and it helped them open up immensely. I don&amp;#39;t think I could don&amp;#39;t, but it helped them learn to speak in front of people on the spot using improv.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8kim4", "score_hidden": false, "stickied": false, "created": 1492162701.0, "created_utc": 1492133901.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8m51e", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "redditer2079", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Well I'll just say this I graduated in 2015 and it's been a struggle for me as well. It's really about just getting past the awkwardness at first and breaking the ice. That's how it is for me at least. Once I'm in an interview and I get going I'm completely fine. I worked in sales during the summers of college still involved with that because it's all I have right now. I kind of get to do my own thing and met and talked with so many people over the year doing that. Once you break that ice with people you get a lot more comfortable. \n\nI'll say I do lack a lot of confidence going into something but once I'm actually doing it and thrown into the fire I just get chilled and do it. I hopefully have an on site interview coming up after a successful phone and Skype interview just waiting to hear back. \n\nHang in there you're not alone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I&amp;#39;ll just say this I graduated in 2015 and it&amp;#39;s been a struggle for me as well. It&amp;#39;s really about just getting past the awkwardness at first and breaking the ice. That&amp;#39;s how it is for me at least. Once I&amp;#39;m in an interview and I get going I&amp;#39;m completely fine. I worked in sales during the summers of college still involved with that because it&amp;#39;s all I have right now. I kind of get to do my own thing and met and talked with so many people over the year doing that. Once you break that ice with people you get a lot more comfortable. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll say I do lack a lot of confidence going into something but once I&amp;#39;m actually doing it and thrown into the fire I just get chilled and do it. I hopefully have an on site interview coming up after a successful phone and Skype interview just waiting to hear back. &lt;/p&gt;\n\n&lt;p&gt;Hang in there you&amp;#39;re not alone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8m51e", "score_hidden": false, "stickied": false, "created": 1492164964.0, "created_utc": 1492136164.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg9jlcs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rabiesawareness", "parent_id": "t1_dg8w7tu", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I love your story. It gives me so much hope. Thanks for sharing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love your story. It gives me so much hope. Thanks for sharing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9jlcs", "score_hidden": false, "stickied": false, "created": 1492223673.0, "created_utc": 1492194873.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8w7tu", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "dopadelic", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I got a job after fucking up an interview. Here's a thread I made about it. I'm horrible at interviews as well and my current strategy is to figure out what their challenges are in the interview and write up a proposal as a follow-up email. The best way to get a job is to directly prove to them that you can contribute to helping them overcome a challenge they have. \n\nhttps://www.reddit.com/r/jobs/comments/3z40yg/i_fixed_a_job_interview_blunder_with_a_followup/\n\nAlso instead of memorizing responses, think about interviews as a way for you to demonstrate to them your skills and a way to find out what kinds of problems they're trying to solve and how your experience shows that you're capable of solving it. ", "edited": 1492207258.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I got a job after fucking up an interview. Here&amp;#39;s a thread I made about it. I&amp;#39;m horrible at interviews as well and my current strategy is to figure out what their challenges are in the interview and write up a proposal as a follow-up email. The best way to get a job is to directly prove to them that you can contribute to helping them overcome a challenge they have. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/jobs/comments/3z40yg/i_fixed_a_job_interview_blunder_with_a_followup/\"&gt;https://www.reddit.com/r/jobs/comments/3z40yg/i_fixed_a_job_interview_blunder_with_a_followup/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Also instead of memorizing responses, think about interviews as a way for you to demonstrate to them your skills and a way to find out what kinds of problems they&amp;#39;re trying to solve and how your experience shows that you&amp;#39;re capable of solving it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8w7tu", "score_hidden": false, "stickied": false, "created": 1492183663.0, "created_utc": 1492154863.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dga4o2p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "handsofthedonald", "parent_id": "t1_dg8t5b1", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Seems like an appropriate course of action when I don't get hired. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seems like an appropriate course of action when I don&amp;#39;t get hired. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dga4o2p", "score_hidden": false, "stickied": false, "created": 1492250830.0, "created_utc": 1492222030.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8t5b1", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "yes_i_am_retarded", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "&gt; literally\n\nI strongly discourage releasing explosive ordinance in relation to a job interview.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;literally&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I strongly discourage releasing explosive ordinance in relation to a job interview.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8t5b1", "score_hidden": false, "stickied": false, "created": 1492176370.0, "created_utc": 1492147570.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8ua9w", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Mentality61", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Join a Toastmasters club. 6 months of thinking on your feet practice REALLY sharpens up how you answer questions in an interview. After all it is public speaking in a smallllll audience situation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Join a Toastmasters club. 6 months of thinking on your feet practice REALLY sharpens up how you answer questions in an interview. After all it is public speaking in a smallllll audience situation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8ua9w", "score_hidden": false, "stickied": false, "created": 1492178769.0, "created_utc": 1492149969.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8rfno", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "srryaboutlastnight", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "You honestly remind me of me, I can't really help you too much because I too am still unemployed almost a year after graduation and countless interviews but I just wanted to let you know that there are people in the same boat as you and don't ever give up because things will get better (ik that's cheesy but that's what i've been told lol). I have noticed that practice makes perfect and every time I go into an interview I get slightly better even if there are still awkward silences and outbursts of weirdness, I also have been trying to stick to the script I have in mind so when a question is asked that I wasn't prepared for I try to shift it into a way that I can answer it with something I already have prepared. Also the advice someone gave as it just being a conversation is helpful too, that's what's been helping me make my recent interviews less painful. Anyway, good luck to you! We'll get to where we need to be eventually ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You honestly remind me of me, I can&amp;#39;t really help you too much because I too am still unemployed almost a year after graduation and countless interviews but I just wanted to let you know that there are people in the same boat as you and don&amp;#39;t ever give up because things will get better (ik that&amp;#39;s cheesy but that&amp;#39;s what i&amp;#39;ve been told lol). I have noticed that practice makes perfect and every time I go into an interview I get slightly better even if there are still awkward silences and outbursts of weirdness, I also have been trying to stick to the script I have in mind so when a question is asked that I wasn&amp;#39;t prepared for I try to shift it into a way that I can answer it with something I already have prepared. Also the advice someone gave as it just being a conversation is helpful too, that&amp;#39;s what&amp;#39;s been helping me make my recent interviews less painful. Anyway, good luck to you! We&amp;#39;ll get to where we need to be eventually &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8rfno", "score_hidden": false, "stickied": false, "created": 1492173141.0, "created_utc": 1492144341.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8plgu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JayOBee", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I am by no means an excellent interviewee. I think it's normal to struggle on some of the tougher questions they throw at you. But gosh, I've even struggled at some very basic questions when I first started looking for a job. I felt very stupid after the interview.\n\nIn the first interview I've ever had, the lady interviewing me actually laughed and said that my answers sounded like it came straight from a beauty pageant. Heh...\"world peace\"...\n\nLast month, I went through a very difficult interview. The guy basically asked questions on top of the answers I already gave. The questions he asked were pretty non-standard. He was very good at coming up with the dreaded \"difficult scenarios\" on the spot. I didn't let myself show any confused expressions during the interview, but I was definitely drawing a blank inside my head. I just kept repeating my responses even though I knew he was looking for more. Needless to say, I didn't fit the profile of that job. \n\nI got interviewed earlier this week and I instantly clicked with the people who interviewed me. I was still a bit nervous coming into the interview (like many people are), but since I've interviewed a few times now, I know mostly how to respond. I throw some humor into it too because I think it eases me up a bit as well as makes me seem human and not some kind of robot who memorizes answers.\n\nThe results were that I got the job. \n\nIf you still suck at coming up with responses, then I would say to just keep smiling. Smiling and laughter from a good joke really helps to break the ice. \n\n\n", "edited": 1492142887.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am by no means an excellent interviewee. I think it&amp;#39;s normal to struggle on some of the tougher questions they throw at you. But gosh, I&amp;#39;ve even struggled at some very basic questions when I first started looking for a job. I felt very stupid after the interview.&lt;/p&gt;\n\n&lt;p&gt;In the first interview I&amp;#39;ve ever had, the lady interviewing me actually laughed and said that my answers sounded like it came straight from a beauty pageant. Heh...&amp;quot;world peace&amp;quot;...&lt;/p&gt;\n\n&lt;p&gt;Last month, I went through a very difficult interview. The guy basically asked questions on top of the answers I already gave. The questions he asked were pretty non-standard. He was very good at coming up with the dreaded &amp;quot;difficult scenarios&amp;quot; on the spot. I didn&amp;#39;t let myself show any confused expressions during the interview, but I was definitely drawing a blank inside my head. I just kept repeating my responses even though I knew he was looking for more. Needless to say, I didn&amp;#39;t fit the profile of that job. &lt;/p&gt;\n\n&lt;p&gt;I got interviewed earlier this week and I instantly clicked with the people who interviewed me. I was still a bit nervous coming into the interview (like many people are), but since I&amp;#39;ve interviewed a few times now, I know mostly how to respond. I throw some humor into it too because I think it eases me up a bit as well as makes me seem human and not some kind of robot who memorizes answers.&lt;/p&gt;\n\n&lt;p&gt;The results were that I got the job. &lt;/p&gt;\n\n&lt;p&gt;If you still suck at coming up with responses, then I would say to just keep smiling. Smiling and laughter from a good joke really helps to break the ice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8plgu", "score_hidden": false, "stickied": false, "created": 1492170124.0, "created_utc": 1492141324.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8qske", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "asillynert", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "For me I have had similar problem. Found being myself worked I would pysch myself out. Now if I get a interview in person I am pretty much going to get it. \n\nThe trick is be yourself most people can smell bs a mile a way. BUT pick qualitys that you personally emphasize and joke/navigate to a discussion. \n\nMe I come off really strong kind of intimidating. But rarely will a rant about work ethic being lost be seen as bad. If you choose wisely they will see the passion and who won't hire a person passionate about working hard ect. \n\nI actually got really ranty with one thought I blew it and guy was like \"god damn\" your hired. If I could pay you more I would but company policy and he was \"apologetic\" about a wage I was fine with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me I have had similar problem. Found being myself worked I would pysch myself out. Now if I get a interview in person I am pretty much going to get it. &lt;/p&gt;\n\n&lt;p&gt;The trick is be yourself most people can smell bs a mile a way. BUT pick qualitys that you personally emphasize and joke/navigate to a discussion. &lt;/p&gt;\n\n&lt;p&gt;Me I come off really strong kind of intimidating. But rarely will a rant about work ethic being lost be seen as bad. If you choose wisely they will see the passion and who won&amp;#39;t hire a person passionate about working hard ect. &lt;/p&gt;\n\n&lt;p&gt;I actually got really ranty with one thought I blew it and guy was like &amp;quot;god damn&amp;quot; your hired. If I could pay you more I would but company policy and he was &amp;quot;apologetic&amp;quot; about a wage I was fine with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8qske", "score_hidden": false, "stickied": false, "created": 1492172057.0, "created_utc": 1492143257.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dga4tmv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "handsofthedonald", "parent_id": "t1_dg8zb3m", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Interesting strategy, I'll look into it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting strategy, I&amp;#39;ll look into it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dga4tmv", "score_hidden": false, "stickied": false, "created": 1492251058.0, "created_utc": 1492222258.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zb3m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "babygem84", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I know exactly what you're going through. I've got the advantage of having worked the past 8 years with the company (I'm applying for a job in the same company but different division) and have plenty to talk about but I've bombed at least a dozen interviews in the past few months. Main reasons, I over-prepared and scripted STAR responses so just recited them instead of actually answering the question asked, and I got flustered when prompted to answer the question so word-vomited for 5 minutes in a panic hoping they could pick out something intelligible. A 5 star performance all round :/\n\nI had an interview this week and as well as prepping my answers and having them typed out and highlighted in front of me, I said to the interviewers before we got started...\n'I just want to let you know that because I am so excited to have the opportunity to talk to you today I'm a little nervous. My boss says I can speak confidently about my work but not about myself, so if I take a minute or begin rambling, please keep that in mind.' It showed them that I REALLY wanted the job and positioned with them that any potential hiccups are due to nerves, not disinterest. \n\nWhen they asked a question I began my response by saying 'I'm going to talk about such-and-such project I worked on; do you want me to give you some background to this before I answer?' It made the whole thing more conversational and less interrogation which chilled me out completely. \n\nThey were extremely receptive, allowed me to pause for water periodically, I completely relaxed and by the end of it we were laughing and joking. I have no idea if I'm going to get an offer from it or not but it's the best I've felt walking out of an interview so I'm counting that as a win regardless. \n\nEdit: clarity\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know exactly what you&amp;#39;re going through. I&amp;#39;ve got the advantage of having worked the past 8 years with the company (I&amp;#39;m applying for a job in the same company but different division) and have plenty to talk about but I&amp;#39;ve bombed at least a dozen interviews in the past few months. Main reasons, I over-prepared and scripted STAR responses so just recited them instead of actually answering the question asked, and I got flustered when prompted to answer the question so word-vomited for 5 minutes in a panic hoping they could pick out something intelligible. A 5 star performance all round :/&lt;/p&gt;\n\n&lt;p&gt;I had an interview this week and as well as prepping my answers and having them typed out and highlighted in front of me, I said to the interviewers before we got started...\n&amp;#39;I just want to let you know that because I am so excited to have the opportunity to talk to you today I&amp;#39;m a little nervous. My boss says I can speak confidently about my work but not about myself, so if I take a minute or begin rambling, please keep that in mind.&amp;#39; It showed them that I REALLY wanted the job and positioned with them that any potential hiccups are due to nerves, not disinterest. &lt;/p&gt;\n\n&lt;p&gt;When they asked a question I began my response by saying &amp;#39;I&amp;#39;m going to talk about such-and-such project I worked on; do you want me to give you some background to this before I answer?&amp;#39; It made the whole thing more conversational and less interrogation which chilled me out completely. &lt;/p&gt;\n\n&lt;p&gt;They were extremely receptive, allowed me to pause for water periodically, I completely relaxed and by the end of it we were laughing and joking. I have no idea if I&amp;#39;m going to get an offer from it or not but it&amp;#39;s the best I&amp;#39;ve felt walking out of an interview so I&amp;#39;m counting that as a win regardless. &lt;/p&gt;\n\n&lt;p&gt;Edit: clarity&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8zb3m", "score_hidden": false, "stickied": false, "created": 1492193442.0, "created_utc": 1492164642.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg913oh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "smasterofpuppets", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Talk slowly. Listen intently. Breathe deeply, and try to stay as calm as possible. You don't have to talk as much as you think you do. Listen and take in all the information and process it. Converse and connect with your interviewer, using professional language of course.\n\n\nThere is this really awesome TED talk by Amy Cuddy on body language and Power poses. I found it to be a game changer for me in terms of interviews. I have never bombed an interview after I used the tips from that video. To the point that I actually don't want to tell people about it unless I like them and really want to help them out. So I just hope you're a good person OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk slowly. Listen intently. Breathe deeply, and try to stay as calm as possible. You don&amp;#39;t have to talk as much as you think you do. Listen and take in all the information and process it. Converse and connect with your interviewer, using professional language of course.&lt;/p&gt;\n\n&lt;p&gt;There is this really awesome TED talk by Amy Cuddy on body language and Power poses. I found it to be a game changer for me in terms of interviews. I have never bombed an interview after I used the tips from that video. To the point that I actually don&amp;#39;t want to tell people about it unless I like them and really want to help them out. So I just hope you&amp;#39;re a good person OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg913oh", "score_hidden": false, "stickied": false, "created": 1492198690.0, "created_utc": 1492169890.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8q0zo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JayOBee", "parent_id": "t1_dg8nsci", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I second this. Interviews aren't just about your resume. People want to know what it would be like to work with you and if you are able to communicate with them. If you sound overly nervous, boring, and/or monotone, then you'll most likely be a bad fit for many companies. ", "edited": 1492143071.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I second this. Interviews aren&amp;#39;t just about your resume. People want to know what it would be like to work with you and if you are able to communicate with them. If you sound overly nervous, boring, and/or monotone, then you&amp;#39;ll most likely be a bad fit for many companies. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8q0zo", "score_hidden": false, "stickied": false, "created": 1492170814.0, "created_utc": 1492142014.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nsci", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "helloboots", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Interviews aren't so much getting the asnwers right, but more figuring out if you're like-able.\n\nSo - just be charismatic and charming, duh.\n\nSome tips: Google the name of your interview if possible. Sometimes they have LinkedIn. Look through this to see if you have anything in common &amp; try to bring it up in the interview (only if you're confident you can talk about it though - don't bullshit this). If you can't find your interviewer, Google the job title &amp; company, sometimes this will bring up potential colleagues. \n\nAsk questions/make small talk. Your interview starts the second you walk in. \"Hi, (name), I'm interviewer, follow me to the conference room.\" \"Very nice to meet you. This is a lovely building, how long have you been in this space?\" People like to talk.\n\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interviews aren&amp;#39;t so much getting the asnwers right, but more figuring out if you&amp;#39;re like-able.&lt;/p&gt;\n\n&lt;p&gt;So - just be charismatic and charming, duh.&lt;/p&gt;\n\n&lt;p&gt;Some tips: Google the name of your interview if possible. Sometimes they have LinkedIn. Look through this to see if you have anything in common &amp;amp; try to bring it up in the interview (only if you&amp;#39;re confident you can talk about it though - don&amp;#39;t bullshit this). If you can&amp;#39;t find your interviewer, Google the job title &amp;amp; company, sometimes this will bring up potential colleagues. &lt;/p&gt;\n\n&lt;p&gt;Ask questions/make small talk. Your interview starts the second you walk in. &amp;quot;Hi, (name), I&amp;#39;m interviewer, follow me to the conference room.&amp;quot; &amp;quot;Very nice to meet you. This is a lovely building, how long have you been in this space?&amp;quot; People like to talk.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8nsci", "score_hidden": false, "stickied": false, "created": 1492167341.0, "created_utc": 1492138541.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dga4rmx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "handsofthedonald", "parent_id": "t1_dg8yye0", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "There's a subreddit for that????", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a subreddit for that????&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dga4rmx", "score_hidden": false, "stickied": false, "created": 1492250976.0, "created_utc": 1492222176.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8yye0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nowaste", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "you figuratively bomb every job interview, or you could bomb literally every job interview. but if you literally bombed every job interview you would be a terrorist and in the wrong subreddit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you figuratively bomb every job interview, or you could bomb literally every job interview. but if you literally bombed every job interview you would be a terrorist and in the wrong subreddit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8yye0", "score_hidden": false, "stickied": false, "created": 1492192257.0, "created_utc": 1492163457.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8xgo8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "truenoise", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I really admire your tenacity, but it sounds like it's time to switch tactics. Have you tried videoing yourself while someone asks you interview questions? There are tons of other good suggestions in this thread, too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really admire your tenacity, but it sounds like it&amp;#39;s time to switch tactics. Have you tried videoing yourself while someone asks you interview questions? There are tons of other good suggestions in this thread, too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8xgo8", "score_hidden": false, "stickied": false, "created": 1492187388.0, "created_utc": 1492158588.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg93qhn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "carolinared", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "What kind of jobs are you trying to get? An IT guy doesn't need to be as charismatic as a sales guy.\n\nYour college should have mock interview practice for alumni, go there and get feedback. \n\nMost interviewers are moving towards behavioral interview questions. Create 4 - 5 stories that can be reworked for multiple questions. A problem at work that was solved can be used for - conflict between people, a time you faced adversity, how you handle a bad situation, a weakness you overcame. Talking about a big accomplishment you managed can be used for - strengths, a time you faced adversity, achieving goals, going above and beyond, getting buy-in from your coworkers. It's been awhile since I created my stories or looked at them, but I had 4 and on top of knowing about the company they really helped me improve my head space. At the end of the interview ask if they have any reservations about you, hopefully they say no and cognitive dissonance kicks in and they like you more. If they do have reservations you can address it then, have some explanations for your faults your aware of, or reasons they're an asset in the role in case they do point out your insecurities you listed here. \n\nWhen you get into that area of intense communication it can show excitement and enthusiasm, as long as they can follow your train of thought. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What kind of jobs are you trying to get? An IT guy doesn&amp;#39;t need to be as charismatic as a sales guy.&lt;/p&gt;\n\n&lt;p&gt;Your college should have mock interview practice for alumni, go there and get feedback. &lt;/p&gt;\n\n&lt;p&gt;Most interviewers are moving towards behavioral interview questions. Create 4 - 5 stories that can be reworked for multiple questions. A problem at work that was solved can be used for - conflict between people, a time you faced adversity, how you handle a bad situation, a weakness you overcame. Talking about a big accomplishment you managed can be used for - strengths, a time you faced adversity, achieving goals, going above and beyond, getting buy-in from your coworkers. It&amp;#39;s been awhile since I created my stories or looked at them, but I had 4 and on top of knowing about the company they really helped me improve my head space. At the end of the interview ask if they have any reservations about you, hopefully they say no and cognitive dissonance kicks in and they like you more. If they do have reservations you can address it then, have some explanations for your faults your aware of, or reasons they&amp;#39;re an asset in the role in case they do point out your insecurities you listed here. &lt;/p&gt;\n\n&lt;p&gt;When you get into that area of intense communication it can show excitement and enthusiasm, as long as they can follow your train of thought. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg93qhn", "score_hidden": false, "stickied": false, "created": 1492204086.0, "created_utc": 1492175286.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg93s6s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BigBlueWookiee", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "First - I think the word you are looking for is Figuratively, not Literally. Which may point to a possible issue. \n\nWhile we all know how important and potentially life changing interviews can be, they are not in fact the be-all, end-all of your life, or even your career. It could be that you are putting way to much emphasis on this meeting and therefore raising expectations of both yourself and the position itself. \n\nThis just ends up increasing your stress level and therefore causing the exact opposite behavior that you intend. The worst part of this is that you might actually be able to see yourself behaving this way but be powerless to stop it - creating a downward spiral.\n\nInstead of focusing on being your best, you might want to try focusing on just being yourself. If they don't like you, it really is not the end of the world. No matter the job or the pay being offered, equally important is a \"cultural\" fit for you. A good cultural match will allow you to excel and really be happy in your career, while a poor match will leave you stressed and exhausted. \n\nThe point here (and we all know this is way harder than it sounds) is to relax and have a conversation. Do not try to sell yourself. Instead, look at it as an opportunity to grow your professional network. You are there to talk, nothing more, nothing less. If you get a job out of it, great! If not, you have at least chiseled away another piece that does not fit for you. \n\nInstead of seeing yourself as being under the microscope, remember the company is as well. They should be equally as nervous.\n\nGood luck, relax and enjoy the process. It might be difficult, but seriously, look at whom and where you are placing a lions share of the burden. Then move that burden accordingly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First - I think the word you are looking for is Figuratively, not Literally. Which may point to a possible issue. &lt;/p&gt;\n\n&lt;p&gt;While we all know how important and potentially life changing interviews can be, they are not in fact the be-all, end-all of your life, or even your career. It could be that you are putting way to much emphasis on this meeting and therefore raising expectations of both yourself and the position itself. &lt;/p&gt;\n\n&lt;p&gt;This just ends up increasing your stress level and therefore causing the exact opposite behavior that you intend. The worst part of this is that you might actually be able to see yourself behaving this way but be powerless to stop it - creating a downward spiral.&lt;/p&gt;\n\n&lt;p&gt;Instead of focusing on being your best, you might want to try focusing on just being yourself. If they don&amp;#39;t like you, it really is not the end of the world. No matter the job or the pay being offered, equally important is a &amp;quot;cultural&amp;quot; fit for you. A good cultural match will allow you to excel and really be happy in your career, while a poor match will leave you stressed and exhausted. &lt;/p&gt;\n\n&lt;p&gt;The point here (and we all know this is way harder than it sounds) is to relax and have a conversation. Do not try to sell yourself. Instead, look at it as an opportunity to grow your professional network. You are there to talk, nothing more, nothing less. If you get a job out of it, great! If not, you have at least chiseled away another piece that does not fit for you. &lt;/p&gt;\n\n&lt;p&gt;Instead of seeing yourself as being under the microscope, remember the company is as well. They should be equally as nervous.&lt;/p&gt;\n\n&lt;p&gt;Good luck, relax and enjoy the process. It might be difficult, but seriously, look at whom and where you are placing a lions share of the burden. Then move that burden accordingly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg93s6s", "score_hidden": false, "stickied": false, "created": 1492204167.0, "created_utc": 1492175367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg95q1i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dv4der", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "You're too nervous about failing.  Be like water and go with the flow.  Be prepared for the interview but at the same time it's okay to take off the rails. Interviewers are people too.  So crack jokes and have fun. \n\nYou should practice spitballing and let the junk spew out of your mouth. Haha.    Get someone to just ask random questions about work, hobbys, career goal, and your education.   You don't have memorize the answers, because each question is different and you will have to change your wording just to get the point across", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re too nervous about failing.  Be like water and go with the flow.  Be prepared for the interview but at the same time it&amp;#39;s okay to take off the rails. Interviewers are people too.  So crack jokes and have fun. &lt;/p&gt;\n\n&lt;p&gt;You should practice spitballing and let the junk spew out of your mouth. Haha.    Get someone to just ask random questions about work, hobbys, career goal, and your education.   You don&amp;#39;t have memorize the answers, because each question is different and you will have to change your wording just to get the point across&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg95q1i", "score_hidden": false, "stickied": false, "created": 1492207139.0, "created_utc": 1492178339.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg95xoh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ramacher", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Go take an improv class!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go take an improv class!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg95xoh", "score_hidden": false, "stickied": false, "created": 1492207444.0, "created_utc": 1492178644.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg96xl0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "laqlaq", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "You need to practice more. Write down the questions you have been asked in all these interviews. Give them to friends and family and ask them to randomly pick 3-4 pf them and do a mock interview with you. \n\nInterviewing is not a natural instinct. You need to learn it. Some learn it easier than others, but it can be learned. You weren't born knowing how to drive a car, use a computer, write a research paper, but you learned to do all those things. \n\nJust train. Do one mock interview every single day. This is important\" Get a small video camera or use you phone and RECORD YOURSELF. then watch it back when it is over. This is how performers see how they look to others and what they need to work on. And an interview is very much a performance \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to practice more. Write down the questions you have been asked in all these interviews. Give them to friends and family and ask them to randomly pick 3-4 pf them and do a mock interview with you. &lt;/p&gt;\n\n&lt;p&gt;Interviewing is not a natural instinct. You need to learn it. Some learn it easier than others, but it can be learned. You weren&amp;#39;t born knowing how to drive a car, use a computer, write a research paper, but you learned to do all those things. &lt;/p&gt;\n\n&lt;p&gt;Just train. Do one mock interview every single day. This is important&amp;quot; Get a small video camera or use you phone and RECORD YOURSELF. then watch it back when it is over. This is how performers see how they look to others and what they need to work on. And an interview is very much a performance &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg96xl0", "score_hidden": false, "stickied": false, "created": 1492208810.0, "created_utc": 1492180010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg987ya", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "suiysx", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Hang in there. What kind of jobs are you trying to get? At this point just try to get a low level job somewhere to get your foot in the door. Then you can relax a bit and you'll gain some confidence. What do you like to do? What are you good at? Are you working anywhere now? Take care.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hang in there. What kind of jobs are you trying to get? At this point just try to get a low level job somewhere to get your foot in the door. Then you can relax a bit and you&amp;#39;ll gain some confidence. What do you like to do? What are you good at? Are you working anywhere now? Take care.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg987ya", "score_hidden": false, "stickied": false, "created": 1492210479.0, "created_utc": 1492181679.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg9fpw2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "unfoldcareers", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Frankly, it just sounds like you need to practice with another person (or multiple people, or even a career professional). Memorizing canned answers and practicing solo isn't going to help you. You will need to customize your answer for each different company, do research on the individuals and/or department you would be working with, scan the news to see what they might ask, prepare for every challenging question in a way that is fitting for the particular company. You should also practice with another person(s) to get critical feedback that an interviewer won't give you.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Frankly, it just sounds like you need to practice with another person (or multiple people, or even a career professional). Memorizing canned answers and practicing solo isn&amp;#39;t going to help you. You will need to customize your answer for each different company, do research on the individuals and/or department you would be working with, scan the news to see what they might ask, prepare for every challenging question in a way that is fitting for the particular company. You should also practice with another person(s) to get critical feedback that an interviewer won&amp;#39;t give you.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9fpw2", "score_hidden": false, "stickied": false, "created": 1492219122.0, "created_utc": 1492190322.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg9mq0f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pdiggity89", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "You need to be relaxed when you interview -- go in with confidence and don't put too much pressure on yourself.   If you are thinking I must nail this interview or else, you are going to set yourself up for failure.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to be relaxed when you interview -- go in with confidence and don&amp;#39;t put too much pressure on yourself.   If you are thinking I must nail this interview or else, you are going to set yourself up for failure.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9mq0f", "score_hidden": false, "stickied": false, "created": 1492227440.0, "created_utc": 1492198640.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dga4wwd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "handsofthedonald", "parent_id": "t1_dg9pcc0", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Not that I'm aware of, although I'm like 90% sure my father is on the spectrum.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not that I&amp;#39;m aware of, although I&amp;#39;m like 90% sure my father is on the spectrum.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dga4wwd", "score_hidden": false, "stickied": false, "created": 1492251192.0, "created_utc": 1492222392.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9pcc0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sstsunami55", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Do you have something like Asperger's Syndrome? Because I do, and I know it screws me up big time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have something like Asperger&amp;#39;s Syndrome? Because I do, and I know it screws me up big time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9pcc0", "score_hidden": false, "stickied": false, "created": 1492230588.0, "created_utc": 1492201788.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg92xd8", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "lerenardrose", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "It sounds like you may be on the autism spectrum. I would consider looking at an adult diagnosis. There are organizations that offer social skills training or even assistance with job placement for people with a diagnosis.\n\nNobody can diagnose someone over the internet but nearly four years of bombing interviews and a lifetime of this? It suggests it is impairing your life enough to at least explore the option.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you may be on the autism spectrum. I would consider looking at an adult diagnosis. There are organizations that offer social skills training or even assistance with job placement for people with a diagnosis.&lt;/p&gt;\n\n&lt;p&gt;Nobody can diagnose someone over the internet but nearly four years of bombing interviews and a lifetime of this? It suggests it is impairing your life enough to at least explore the option.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg92xd8", "score_hidden": false, "stickied": false, "created": 1492202623.0, "created_utc": 1492173823.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_659a5n", "likes": null, "replies": "", "user_reports": [], "id": "dg8yyva", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mister_zurkon", "parent_id": "t1_dg8vdlx", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Reading this post made me momentarily angry. Like, yeah, maybe having money to buy food isn't for OP? That's not so bad?\n\nBut you know, I think there's a point. Have my upvote. OP is failing repeatedly to talk himself or herself into a job. Perhaps it would be better to go into something that has lax interview requirements and try to work up the ladder. Or cultivate some hard skill that is employable even if you're bad at interviews.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading this post made me momentarily angry. Like, yeah, maybe having money to buy food isn&amp;#39;t for OP? That&amp;#39;s not so bad?&lt;/p&gt;\n\n&lt;p&gt;But you know, I think there&amp;#39;s a point. Have my upvote. OP is failing repeatedly to talk himself or herself into a job. Perhaps it would be better to go into something that has lax interview requirements and try to work up the ladder. Or cultivate some hard skill that is employable even if you&amp;#39;re bad at interviews.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8yyva", "score_hidden": false, "stickied": false, "created": 1492192299.0, "created_utc": 1492163499.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8vdlx", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "northern-harrier", "parent_id": "t3_659a5n", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Sounds like you should become a hermit. Or a wizard.\n\nMaybe capitalist society isn't for you? That's not so bad?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you should become a hermit. Or a wizard.&lt;/p&gt;\n\n&lt;p&gt;Maybe capitalist society isn&amp;#39;t for you? That&amp;#39;s not so bad?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8vdlx", "score_hidden": false, "stickied": false, "created": 1492181411.0, "created_utc": 1492152611.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]