[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "jobs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Worst interview experience I’ve ever had in my life. Never felt so disrespected and marginalized in an interview, EVER. I interviewed for a District Operations Manager position. I got a call asking me if I could come in for an interview asap, I did my best to make it happen. I initially met with the HR Manager while I was wearing my usual business casual work attire since I was going to work right after, he was nice and very positive and said he liked what he saw and that I was someone they would want to have on their team. I have it in my voicemail box to prove it! (he called later that night to schedule another interview.) After our interview, he called in another operations manager who wasn’t in the building to come meet me, so I had to wait another 20 minutes. That went well too and I got the approval to move on to the next interview.  I was so excited, it felt almost as if I had this in the bag! He was so excited as well.   Later that night, he called and asked me to come back to meet with the CEO/Owner the next day. It was short notice and couldn’t confirm till late that morning, but I made it happen I had to switch schedules to get proper coverage. I drove 90 mins from South Orange County where I work to Downtown LA.&lt;/p&gt;\n\n&lt;p&gt;Now this is where it gets bad. I show up for the interview, I go with the HR manager to meet the owner/CEO. Right when we sit down, he says “I’ll tell you this now, I wouldn’t hire you based on how you look…” What the hell? His whole demeanor and tone was so rude and condescending. He says he is old fashion. He says he’s not trying to be mean. He then asks me, if this was my first time there. I said no, it was my second time. He asks me if I saw anyone wearing ties that day. I said of the 3 people I met…only Mike the HR manager. The operations manager had a yellow shirt, no tie, the other person was a woman. There were also a couple other men I saw in passing that didn’t have a tie but there were some that did. I was dressed business casual, which is my work dress code where I had just come from. I was in Calvin Klein slacks and a Calvin Klein button down long sleeve shirt…But that wasn’t good enough. Then the HR Manager tries to flip it on me as the owner is staring him down. The HR manager was like, well you saw yesterday I was wearing a tie, you knew you’d be back today right? I’m like no not till 10am when I called to confirm that I’ll try to make it after I switch schedules around. This was last minute, same day notice. I guess this is my fault as well for not keeping a suit and tie in my car for last minute interviews. Given proper notice, I would have dressed the part for a district level manager. I really wish he could have given me a heads up on this…a hey when you meet with the owner, he’s pretty old school so wear your best suit and tie. Oh and BTW JUST SO YOU GUYS KNOW, THE OWNER/CEO WAS WEARING FUCKING SANDALS (NO SOCKS) WHILE IN DRESS PANTS, SHIRT AND TIE...pretty funny huh?&lt;/p&gt;\n\n&lt;p&gt;The owner looks over my resume and tears me apart. He asks why he should hire me, I have no industry experience. I go on to explain that the position is the next step in my career development, it was worth applying to and reaching out to, I’m a hard worker, quick learner, have a proven track record of success, you know the usual…but no, he interrupts and says, “No, why should I train you, spend time on you and you when you have no experience!” I’m trying to explain I’m an experienced manager and experienced in policy and procedures, training, developing, holding employees accountable, empowering others to strive for success but new to this industry but have been new to my previous industries and learned quickly. He just goes on to what feels like berating me because of my lack of industry experience. (If that’s the case, the HR manager NEVER should have contacted me for this position).&lt;/p&gt;\n\n&lt;p&gt;So then he moves on to my work history. I’m 33 years old, I’ve been working since I was 18. First job, spent 2 years there, second job 5 years, third job 4 years, fourth job 3 years, current job 6 months (yes I know not long, but I got an email alert for this position and felt I was capable and thought why not give it a shot since it was the next step for my career.) Every job I left, I left for a new opportunity that was a career step up that took on more responsibilities, it was career progression. I personally thought my history was solid, stable but he says no. He questions me, “why should I hire you if you’re only going to stay 1 year, 2 years? See that man walking down the hall way, he’s been here 18 years!” Again, in a rude, negative and condescending manner. He goes on to name different people that have been here 10+ years. He and the HR manager then start calling me a job hopper. The HR manager asks me what I see when someone puts temp agency jobs on the resumes and it’s only a few months here and there, well yeah you ask why didn’t they stick with them? He asks if I would hire someone like that, well I hire a lot of part timers, have a roster of 40-45 people, if they’re qualified, if they have personality for the job, I’d give them a chance, maybe that’s all they needed was someone giving them a chance. (Developing and molding talent is one of my favorite parts of being a manager. To be able to teach someone how to work hard to achieve success is such a great feeling. Watching them grow and move on to bigger and better makes me feel like I just set someone up to have a successful life.) The owner goes on to say they don’t want to hire someone that isn’t going to stay 10+ years. Could I see myself staying somewhere that long? Yes, absolutely but again, I’m 33 with a college degree, not many find that 10+ year job in their 20s.&lt;/p&gt;\n\n&lt;p&gt;The owner keeps saying he’s not trying to be mean or rude, I understand that but his tone, his demeanor, his attitude says otherwise. I’m very proud of my accomplishments and my work ethic. He goes on to say, all I hear is what you want, what you’re looking for but nothing what you can bring to us or give to us. I tried to do so but he kept shooting me down and throwing it in my face that I have never been at a job for what he considers long term, I have no industry experience and that I’M YOUNG. Over and over, he keeps saying I’m young and smart and a good kid. I felt a little discriminated because of my age. You can’t say I’m inexperienced, not with my back ground, can you say I’m not experienced in this industry, yes, absolutely and unfortunately, they’re not willing to train and develop. There was no point in continuing this, it was clear he wasn’t going to hire me and if they did, he’s not someone I’d want to work for.  I felt so beat up and put down, my heart wasn’t into it anymore but I kept trying. I tried to answer everything he asked me no matter how many times he cut me off and said something negative. I wasn’t going to stand up and leave, I was determined to see it through and show him he can’t scare me off. By the end, he tells the HR manager to take me to meet someone else…I don’t know why but I wasn’t giving up, I wanted to see this through with my head held up high, show them that I’m not going to run away scared off. So I met with one of the other executives, he’s pretty calm, professional and asks me basic questions. He wasn’t negative or condescending; it was just a brief meeting. &lt;/p&gt;\n\n&lt;p&gt;I get sent back to the waiting room then meet with the HR manager again. He basically tells me they’re going to mull it over but he wasn’t holding hope. Then he just caves and said they’re going to move forward without me because of my lack of industry experience and the way I was dressed, not in a tie…even though it was a last minute notice and I had told him I’m coming from my work in south Orange County to get there. He tells me he and they think I’m a good guy, well experienced but not right for them and first impressions are important. I agree, first impressions are important but there’s more to first impressions than physical appearance and attire (and yes I do understand attire and appearance are the first thing you see and judge, but never judge a book by its cover right?). They ignored I’d came in on late notice over 90 minutes away, driving through Downtown LA traffic to accommodate them. No matter how bad the owner put me down, I sat there with a smile and positive attitude and told him I understood what he was saying and how he feels. The HR manager said he liked my attitude and that he felt I have a can do attitude. The owner said he was only giving me advice, fair enough, you can give advice to people without putting them down in a job interview. I thanked him for the opportunity and he told me not to take it personal. I told him I’m taking this as a learning experience and that I try to learn from everything I do.&lt;/p&gt;\n\n&lt;p&gt;In retrospect, the HR manager NEVER should have called me for the first interview or back for a second interview. He’s only been there a year but he explained they were looking for people with industry experience and long stable work history. He read my resume, he pre-screened me…well DUH, I told him and the Operations Manager that I didin’t have industry experience. They didn’t make it a big deal. He liked me for my management experience. The owner kinda gave off that vibe of “why the hell did you bring this guy to me…” I wonder if he got an earful for wasting their time? Either way, this was a horrible experience. Waste of time, condescending. I’m a grown ass man…and I actually felt like I wanted to cry with how bad I was being put down for not being what they wanted me to be.&lt;/p&gt;\n\n&lt;p&gt;If it matters much, the Owner/CEO is Bengali and came to the US in the 80s. The HR manager was Hispanic, maybe Caucasian. Thank you for reading.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Worst interview experience I’ve ever had in my life. Never felt so disrespected and marginalized in an interview, EVER. I interviewed for a District Operations Manager position. I got a call asking me if I could come in for an interview asap, I did my best to make it happen. I initially met with the HR Manager while I was wearing my usual business casual work attire since I was going to work right after, he was nice and very positive and said he liked what he saw and that I was someone they would want to have on their team. I have it in my voicemail box to prove it! (he called later that night to schedule another interview.) After our interview, he called in another operations manager who wasn’t in the building to come meet me, so I had to wait another 20 minutes. That went well too and I got the approval to move on to the next interview.  I was so excited, it felt almost as if I had this in the bag! He was so excited as well.   Later that night, he called and asked me to come back to meet with the CEO/Owner the next day. It was short notice and couldn’t confirm till late that morning, but I made it happen I had to switch schedules to get proper coverage. I drove 90 mins from South Orange County where I work to Downtown LA.\n\n\nNow this is where it gets bad. I show up for the interview, I go with the HR manager to meet the owner/CEO. Right when we sit down, he says “I’ll tell you this now, I wouldn’t hire you based on how you look…” What the hell? His whole demeanor and tone was so rude and condescending. He says he is old fashion. He says he’s not trying to be mean. He then asks me, if this was my first time there. I said no, it was my second time. He asks me if I saw anyone wearing ties that day. I said of the 3 people I met…only Mike the HR manager. The operations manager had a yellow shirt, no tie, the other person was a woman. There were also a couple other men I saw in passing that didn’t have a tie but there were some that did. I was dressed business casual, which is my work dress code where I had just come from. I was in Calvin Klein slacks and a Calvin Klein button down long sleeve shirt…But that wasn’t good enough. Then the HR Manager tries to flip it on me as the owner is staring him down. The HR manager was like, well you saw yesterday I was wearing a tie, you knew you’d be back today right? I’m like no not till 10am when I called to confirm that I’ll try to make it after I switch schedules around. This was last minute, same day notice. I guess this is my fault as well for not keeping a suit and tie in my car for last minute interviews. Given proper notice, I would have dressed the part for a district level manager. I really wish he could have given me a heads up on this…a hey when you meet with the owner, he’s pretty old school so wear your best suit and tie. Oh and BTW JUST SO YOU GUYS KNOW, THE OWNER/CEO WAS WEARING FUCKING SANDALS (NO SOCKS) WHILE IN DRESS PANTS, SHIRT AND TIE...pretty funny huh?\n\n\nThe owner looks over my resume and tears me apart. He asks why he should hire me, I have no industry experience. I go on to explain that the position is the next step in my career development, it was worth applying to and reaching out to, I’m a hard worker, quick learner, have a proven track record of success, you know the usual…but no, he interrupts and says, “No, why should I train you, spend time on you and you when you have no experience!” I’m trying to explain I’m an experienced manager and experienced in policy and procedures, training, developing, holding employees accountable, empowering others to strive for success but new to this industry but have been new to my previous industries and learned quickly. He just goes on to what feels like berating me because of my lack of industry experience. (If that’s the case, the HR manager NEVER should have contacted me for this position).\n\n\nSo then he moves on to my work history. I’m 33 years old, I’ve been working since I was 18. First job, spent 2 years there, second job 5 years, third job 4 years, fourth job 3 years, current job 6 months (yes I know not long, but I got an email alert for this position and felt I was capable and thought why not give it a shot since it was the next step for my career.) Every job I left, I left for a new opportunity that was a career step up that took on more responsibilities, it was career progression. I personally thought my history was solid, stable but he says no. He questions me, “why should I hire you if you’re only going to stay 1 year, 2 years? See that man walking down the hall way, he’s been here 18 years!” Again, in a rude, negative and condescending manner. He goes on to name different people that have been here 10+ years. He and the HR manager then start calling me a job hopper. The HR manager asks me what I see when someone puts temp agency jobs on the resumes and it’s only a few months here and there, well yeah you ask why didn’t they stick with them? He asks if I would hire someone like that, well I hire a lot of part timers, have a roster of 40-45 people, if they’re qualified, if they have personality for the job, I’d give them a chance, maybe that’s all they needed was someone giving them a chance. (Developing and molding talent is one of my favorite parts of being a manager. To be able to teach someone how to work hard to achieve success is such a great feeling. Watching them grow and move on to bigger and better makes me feel like I just set someone up to have a successful life.) The owner goes on to say they don’t want to hire someone that isn’t going to stay 10+ years. Could I see myself staying somewhere that long? Yes, absolutely but again, I’m 33 with a college degree, not many find that 10+ year job in their 20s.\n\n\nThe owner keeps saying he’s not trying to be mean or rude, I understand that but his tone, his demeanor, his attitude says otherwise. I’m very proud of my accomplishments and my work ethic. He goes on to say, all I hear is what you want, what you’re looking for but nothing what you can bring to us or give to us. I tried to do so but he kept shooting me down and throwing it in my face that I have never been at a job for what he considers long term, I have no industry experience and that I’M YOUNG. Over and over, he keeps saying I’m young and smart and a good kid. I felt a little discriminated because of my age. You can’t say I’m inexperienced, not with my back ground, can you say I’m not experienced in this industry, yes, absolutely and unfortunately, they’re not willing to train and develop. There was no point in continuing this, it was clear he wasn’t going to hire me and if they did, he’s not someone I’d want to work for.  I felt so beat up and put down, my heart wasn’t into it anymore but I kept trying. I tried to answer everything he asked me no matter how many times he cut me off and said something negative. I wasn’t going to stand up and leave, I was determined to see it through and show him he can’t scare me off. By the end, he tells the HR manager to take me to meet someone else…I don’t know why but I wasn’t giving up, I wanted to see this through with my head held up high, show them that I’m not going to run away scared off. So I met with one of the other executives, he’s pretty calm, professional and asks me basic questions. He wasn’t negative or condescending; it was just a brief meeting. \n\n\nI get sent back to the waiting room then meet with the HR manager again. He basically tells me they’re going to mull it over but he wasn’t holding hope. Then he just caves and said they’re going to move forward without me because of my lack of industry experience and the way I was dressed, not in a tie…even though it was a last minute notice and I had told him I’m coming from my work in south Orange County to get there. He tells me he and they think I’m a good guy, well experienced but not right for them and first impressions are important. I agree, first impressions are important but there’s more to first impressions than physical appearance and attire (and yes I do understand attire and appearance are the first thing you see and judge, but never judge a book by its cover right?). They ignored I’d came in on late notice over 90 minutes away, driving through Downtown LA traffic to accommodate them. No matter how bad the owner put me down, I sat there with a smile and positive attitude and told him I understood what he was saying and how he feels. The HR manager said he liked my attitude and that he felt I have a can do attitude. The owner said he was only giving me advice, fair enough, you can give advice to people without putting them down in a job interview. I thanked him for the opportunity and he told me not to take it personal. I told him I’m taking this as a learning experience and that I try to learn from everything I do.\n\n\nIn retrospect, the HR manager NEVER should have called me for the first interview or back for a second interview. He’s only been there a year but he explained they were looking for people with industry experience and long stable work history. He read my resume, he pre-screened me…well DUH, I told him and the Operations Manager that I didin’t have industry experience. They didn’t make it a big deal. He liked me for my management experience. The owner kinda gave off that vibe of “why the hell did you bring this guy to me…” I wonder if he got an earful for wasting their time? Either way, this was a horrible experience. Waste of time, condescending. I’m a grown ass man…and I actually felt like I wanted to cry with how bad I was being put down for not being what they wanted me to be.\n\n\nIf it matters much, the Owner/CEO is Bengali and came to the US in the 80s. The HR manager was Hispanic, maybe Caucasian. Thank you for reading.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65az5d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "hurleyhoody", "saved": false, "mod_reports": [], "name": "t3_65az5d", "subreddit_name_prefixed": "r/jobs", "approved_by": null, "over_18": false, "domain": "self.jobs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhnd", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/jobs/comments/65az5d/worst_interview_of_my_life_i_was_put_down_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492179436.0, "url": "https://www.reddit.com/r/jobs/comments/65az5d/worst_interview_of_my_life_i_was_put_down_and/", "author_flair_text": null, "quarantine": false, "title": "Worst interview of my life, I was put down and felt long read ahead if you're interested.", "created_utc": 1492150636.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": "", "user_reports": [], "id": "dg8y1re", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "btgard", "parent_id": "t1_dg8wrif", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Well if you find yourself dwelling on anything he said, just think back to his sandals and consider whether you could stomach seeing them everyday of a 10+ year career. What a doof.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well if you find yourself dwelling on anything he said, just think back to his sandals and consider whether you could stomach seeing them everyday of a 10+ year career. What a doof.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8y1re", "score_hidden": false, "stickied": false, "created": 1492189304.0, "created_utc": 1492160504.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": "", "user_reports": [], "id": "dg9iqiz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Akagi_Shadow", "parent_id": "t1_dg8wrif", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Next time feel free to call them out on it and walk out, or, if you want to take the high road, cut him off politely and let them know you're not interested in discussing things further.\n\nYou don't have to take anyone's crap, ever.  If you do, do so for your own reasons/gains/benefit.  \n\nAs for the taking it personally, I agree, it's hard not to; however, no matter what you do, some people won't like it, will claim you're a hack, under-qualified, etc.  If they don't want you, move on; someone else does.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Next time feel free to call them out on it and walk out, or, if you want to take the high road, cut him off politely and let them know you&amp;#39;re not interested in discussing things further.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to take anyone&amp;#39;s crap, ever.  If you do, do so for your own reasons/gains/benefit.  &lt;/p&gt;\n\n&lt;p&gt;As for the taking it personally, I agree, it&amp;#39;s hard not to; however, no matter what you do, some people won&amp;#39;t like it, will claim you&amp;#39;re a hack, under-qualified, etc.  If they don&amp;#39;t want you, move on; someone else does.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9iqiz", "score_hidden": false, "stickied": false, "created": 1492222646.0, "created_utc": 1492193846.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8wrif", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hurleyhoody", "parent_id": "t1_dg8vtxv", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Pretty hard not to take it personally when he's tearing down your lifes work and accomplishments and telling you you're not worthy of being a manager here lol. I think the HR manager liked me a lot but decided to gang up on me when the owner was picking on me to cover his own ass.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pretty hard not to take it personally when he&amp;#39;s tearing down your lifes work and accomplishments and telling you you&amp;#39;re not worthy of being a manager here lol. I think the HR manager liked me a lot but decided to gang up on me when the owner was picking on me to cover his own ass.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8wrif", "score_hidden": false, "stickied": false, "created": 1492185242.0, "created_utc": 1492156442.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8vtxv", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "btgard", "parent_id": "t3_65az5d", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Don't take it personally.  He's just another LA hotshot trying to remind himself that he's the big important owner of a big important business in  the big important city of Los Angeles.  He realized back in the 80s that he'll never get the respect he thinks he deserves a due to his career success, so now he relies on interviews like yours go get his chub tinglin.  That poor HR manager jumped on the opportunity to let someone else take the abuse for a day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t take it personally.  He&amp;#39;s just another LA hotshot trying to remind himself that he&amp;#39;s the big important owner of a big important business in  the big important city of Los Angeles.  He realized back in the 80s that he&amp;#39;ll never get the respect he thinks he deserves a due to his career success, so now he relies on interviews like yours go get his chub tinglin.  That poor HR manager jumped on the opportunity to let someone else take the abuse for a day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8vtxv", "score_hidden": false, "stickied": false, "created": 1492182600.0, "created_utc": 1492153800.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": "", "user_reports": [], "id": "dg8w8mq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "hurleyhoody", "parent_id": "t1_dg8vlmq", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Well the HR Manager caved in and said they're not going to consider me any further right after he said they were going to mull it over lol. Either way, during that interview I made up my mind that this is not the type of man I want to work for. Leadership starts from the top...and he's at the top. I wanted to stop the interview and walk out a few times, but I was determined to get through it and tough it out. I didn't want to show them any weakness. I understand not having a tie...but I thought I could get some leeway since they set this up last minute and gave me a 2 hour window to get there. I wanted to point out his bare feet in sandals but I stayed professional and respectful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well the HR Manager caved in and said they&amp;#39;re not going to consider me any further right after he said they were going to mull it over lol. Either way, during that interview I made up my mind that this is not the type of man I want to work for. Leadership starts from the top...and he&amp;#39;s at the top. I wanted to stop the interview and walk out a few times, but I was determined to get through it and tough it out. I didn&amp;#39;t want to show them any weakness. I understand not having a tie...but I thought I could get some leeway since they set this up last minute and gave me a 2 hour window to get there. I wanted to point out his bare feet in sandals but I stayed professional and respectful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8w8mq", "score_hidden": false, "stickied": false, "created": 1492183727.0, "created_utc": 1492154927.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8vlmq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheJobCannon", "parent_id": "t1_dg8uwfv", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "You definitely should, but, wait for a month or so. If they're still considering you (and if you still want the job), you don't want a passionate glassdoor review to be the nail in the coffin.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You definitely should, but, wait for a month or so. If they&amp;#39;re still considering you (and if you still want the job), you don&amp;#39;t want a passionate glassdoor review to be the nail in the coffin.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8vlmq", "score_hidden": false, "stickied": false, "created": 1492181992.0, "created_utc": 1492153192.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8uwfv", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "hurleyhoody", "parent_id": "t3_65az5d", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "And I will definitely leave a Glassdoor Review", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And I will definitely leave a Glassdoor Review&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8uwfv", "score_hidden": false, "stickied": false, "created": 1492180224.0, "created_utc": 1492151424.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": "", "user_reports": [], "id": "dg9wegc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jobventthrowaway", "parent_id": "t1_dg8wnee", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "An older man from Bangladesh.  I think that explains a lot.\n\nBangladesh still very much has a caste system, and along with that go some pretty ugly attitudes.  Now this guy is a big shot, and wants to lord it over people.  He took the interview as an opportunity to do that, American business norms be damned.\n\nI'm sorry you had to go through that.  On the plus side, at least he revealed his true nature BEFORE you went to work for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;An older man from Bangladesh.  I think that explains a lot.&lt;/p&gt;\n\n&lt;p&gt;Bangladesh still very much has a caste system, and along with that go some pretty ugly attitudes.  Now this guy is a big shot, and wants to lord it over people.  He took the interview as an opportunity to do that, American business norms be damned.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry you had to go through that.  On the plus side, at least he revealed his true nature BEFORE you went to work for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9wegc", "score_hidden": false, "stickied": false, "created": 1492239671.0, "created_utc": 1492210871.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8wnee", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hurleyhoody", "parent_id": "t1_dg8vl69", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Looking around the office, I might have been the youngest male? He told me his backstory, he's like 58, came to America from Bangladesh with $842 in 1984, had nothing, started at the bottom of the industry and now he started this company in the early 90s and it's the 3rd largest company in the industry in California. I respect that...he pointed out that my parents probably went through the same thing..which they did...and that I probably didn't appreciate it as much because I didn't have to live through it. That really angered me because I do appreciate it and I spoil my parents now that I have money that I made on my own. I get my work ethic from watching my parents grind and sacrifice to send my sister and I to private catholic school from kinder to high school.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Looking around the office, I might have been the youngest male? He told me his backstory, he&amp;#39;s like 58, came to America from Bangladesh with $842 in 1984, had nothing, started at the bottom of the industry and now he started this company in the early 90s and it&amp;#39;s the 3rd largest company in the industry in California. I respect that...he pointed out that my parents probably went through the same thing..which they did...and that I probably didn&amp;#39;t appreciate it as much because I didn&amp;#39;t have to live through it. That really angered me because I do appreciate it and I spoil my parents now that I have money that I made on my own. I get my work ethic from watching my parents grind and sacrifice to send my sister and I to private catholic school from kinder to high school.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8wnee", "score_hidden": false, "stickied": false, "created": 1492184909.0, "created_utc": 1492156109.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8vl69", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TheJobCannon", "parent_id": "t3_65az5d", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Oh man. \n\nThis sounds very much like an older CEO who is very out of touch with the way of the world, and wants to keep his 1950s office in tact. The fact that he tried to pin you as a job hopper with years of service in each position shows how out of touch he is.\n\nFrom how you wrote this, I also feel like he is expecting a 50+ person in this position.\n\nHard to know. But I sure as hell wouldn't want to work for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man. &lt;/p&gt;\n\n&lt;p&gt;This sounds very much like an older CEO who is very out of touch with the way of the world, and wants to keep his 1950s office in tact. The fact that he tried to pin you as a job hopper with years of service in each position shows how out of touch he is.&lt;/p&gt;\n\n&lt;p&gt;From how you wrote this, I also feel like he is expecting a 50+ person in this position.&lt;/p&gt;\n\n&lt;p&gt;Hard to know. But I sure as hell wouldn&amp;#39;t want to work for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8vl69", "score_hidden": false, "stickied": false, "created": 1492181957.0, "created_utc": 1492153157.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": "", "user_reports": [], "id": "dg93qdy", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "RobbyTheRedneck", "parent_id": "t3_65az5d", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "It stinks, but why didn't you have a tie with you?  You could have changed shirts and put on a tie in the parking lot.\n\nAs to the rest of the interview, the owner made a point about your lack of experience.  Instead of upselling your own experience, you said it his job was part of a career path.\n\nNothing personal, but the interview was over then.  Don't lash out because your feelings were hurt.\n\nBottom line, you weren't prepared and you blew an answer to a very relevant question.  In response, you are trying to inject his race and ethnicity into why you were shot down.\n\nSo what to do now?  If you drive your own car, keep a fresh shirt and tie at the ready.  And when somebody asks you why you should be hired, career path progression isn't the answer.\n\nIf you are going to claim to be a grown man, act like it.  Own your mistakes and quit blaming others.\n\n/hope this helps\n\nEdit: typos for clarity", "edited": 1492187064.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It stinks, but why didn&amp;#39;t you have a tie with you?  You could have changed shirts and put on a tie in the parking lot.&lt;/p&gt;\n\n&lt;p&gt;As to the rest of the interview, the owner made a point about your lack of experience.  Instead of upselling your own experience, you said it his job was part of a career path.&lt;/p&gt;\n\n&lt;p&gt;Nothing personal, but the interview was over then.  Don&amp;#39;t lash out because your feelings were hurt.&lt;/p&gt;\n\n&lt;p&gt;Bottom line, you weren&amp;#39;t prepared and you blew an answer to a very relevant question.  In response, you are trying to inject his race and ethnicity into why you were shot down.&lt;/p&gt;\n\n&lt;p&gt;So what to do now?  If you drive your own car, keep a fresh shirt and tie at the ready.  And when somebody asks you why you should be hired, career path progression isn&amp;#39;t the answer.&lt;/p&gt;\n\n&lt;p&gt;If you are going to claim to be a grown man, act like it.  Own your mistakes and quit blaming others.&lt;/p&gt;\n\n&lt;p&gt;/hope this helps&lt;/p&gt;\n\n&lt;p&gt;Edit: typos for clarity&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg93qdy", "score_hidden": false, "stickied": false, "created": 1492204081.0, "created_utc": 1492175281.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": "", "user_reports": [], "id": "dg9gl2u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RobinKennedy23", "parent_id": "t3_65az5d", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Consider yourself lucky that you don't have to work for him. Imagine if you didn't have to meet him and accepted the position. That is your boss essentially. Every office has their jerks and ass holes so don't take what he said to heart.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Consider yourself lucky that you don&amp;#39;t have to work for him. Imagine if you didn&amp;#39;t have to meet him and accepted the position. That is your boss essentially. Every office has their jerks and ass holes so don&amp;#39;t take what he said to heart.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9gl2u", "score_hidden": false, "stickied": false, "created": 1492220126.0, "created_utc": 1492191326.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": "", "user_reports": [], "id": "dg977cd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "neurorex", "parent_id": "t1_dg8zyc7", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "In the U.S., since appearance isn't legally under a \"protected class\" like age or gender, some interviewers feel that it's perfectly fine to pass judgment on how the interviewing candidate look, say, think, and any other minor behaviors displayed during that time. It's a really bad way to hire, and it's not how hiring is done professionally.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the U.S., since appearance isn&amp;#39;t legally under a &amp;quot;protected class&amp;quot; like age or gender, some interviewers feel that it&amp;#39;s perfectly fine to pass judgment on how the interviewing candidate look, say, think, and any other minor behaviors displayed during that time. It&amp;#39;s a really bad way to hire, and it&amp;#39;s not how hiring is done professionally.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg977cd", "score_hidden": false, "stickied": false, "created": 1492209167.0, "created_utc": 1492180367.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zyc7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "totoro_7", "parent_id": "t3_65az5d", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Seriously? And are you upset about it? Those people are psychos. Bel glad you didn't even start working in the first place. Yes, first impressions are importand and you also had a first impression of what those idiots are like. \n\nI'm in Europe so I don't know how it works in the US, but here's it's illegal to comment on a potential employees looks or attire. And also illegal to state your looks or attire were the reason for them not hiring you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seriously? And are you upset about it? Those people are psychos. Bel glad you didn&amp;#39;t even start working in the first place. Yes, first impressions are importand and you also had a first impression of what those idiots are like. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in Europe so I don&amp;#39;t know how it works in the US, but here&amp;#39;s it&amp;#39;s illegal to comment on a potential employees looks or attire. And also illegal to state your looks or attire were the reason for them not hiring you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg8zyc7", "score_hidden": false, "stickied": false, "created": 1492195489.0, "created_utc": 1492166689.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": "", "user_reports": [], "id": "dg9qlkm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "neurorex", "parent_id": "t1_dg98sza", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "&gt; His \"I don't mean to be rude\" statement is entirely useless because he was indeed being rude. \n\nIt's like when people say \"I don't mean to offend, but...\" and then go on to make the most vile and crude statement possible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;His &amp;quot;I don&amp;#39;t mean to be rude&amp;quot; statement is entirely useless because he was indeed being rude. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s like when people say &amp;quot;I don&amp;#39;t mean to offend, but...&amp;quot; and then go on to make the most vile and crude statement possible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9qlkm", "score_hidden": false, "stickied": false, "created": 1492232112.0, "created_utc": 1492203312.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98sza", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JayOBee", "parent_id": "t3_65az5d", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Ew. What an arrogant bloke that CEO is. His \"I don't mean to be rude\" statement is entirely useless because he was indeed being rude. He's just not admitting it and always thinks he is right. This guy probably never apologizes to people if he is in the wrong because he never thinks he is wrong. I would never want to work for someone like that. You definitely dodged a bullet there. \n\nThere's tons of miscommunication within the company already. Would you want to work for people like that? I sure wouldn't. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ew. What an arrogant bloke that CEO is. His &amp;quot;I don&amp;#39;t mean to be rude&amp;quot; statement is entirely useless because he was indeed being rude. He&amp;#39;s just not admitting it and always thinks he is right. This guy probably never apologizes to people if he is in the wrong because he never thinks he is wrong. I would never want to work for someone like that. You definitely dodged a bullet there. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s tons of miscommunication within the company already. Would you want to work for people like that? I sure wouldn&amp;#39;t. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg98sza", "score_hidden": false, "stickied": false, "created": 1492211206.0, "created_utc": 1492182406.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": "", "user_reports": [], "id": "dg9swb2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "larrythetomato", "parent_id": "t1_dg9r2aa", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "&gt; This really didn't go beyond the guy being a total asshole. That's where it begins and stops. \n\nThis is the point where you want to stop. That is completely fine. For example knowing the little I know about human nature, what I write won't convince you, but that is not necessarily the point of this response.\n\n&gt;there's really no sane rationale behind what the owner/CEO and HR Manager did.\n\nThe HR manager did exactly what he is supposed to do, protect himself by taking the side of the company, which is effectively run by the CEO, kissing ass is logical.\n\nFor the CEO, we have the story of someone who didn't get a job. From this side, the CEO sounds like a selfish ass.\n\n&gt;I'm surprised that no one has accused OP of \"failing\" a high-pressure interview (another favorite for these job-fillers) to try and fit some teachable moments for the sake of giving advice.\n\nI assume that this is a slight? Failing is not a negative, for the most part you should always look for the opportunities to learn. I was trying to show what they were looking for, while acknowledging that I would have rejected the offer they gave.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This really didn&amp;#39;t go beyond the guy being a total asshole. That&amp;#39;s where it begins and stops. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is the point where you want to stop. That is completely fine. For example knowing the little I know about human nature, what I write won&amp;#39;t convince you, but that is not necessarily the point of this response.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;there&amp;#39;s really no sane rationale behind what the owner/CEO and HR Manager did.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The HR manager did exactly what he is supposed to do, protect himself by taking the side of the company, which is effectively run by the CEO, kissing ass is logical.&lt;/p&gt;\n\n&lt;p&gt;For the CEO, we have the story of someone who didn&amp;#39;t get a job. From this side, the CEO sounds like a selfish ass.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m surprised that no one has accused OP of &amp;quot;failing&amp;quot; a high-pressure interview (another favorite for these job-fillers) to try and fit some teachable moments for the sake of giving advice.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I assume that this is a slight? Failing is not a negative, for the most part you should always look for the opportunities to learn. I was trying to show what they were looking for, while acknowledging that I would have rejected the offer they gave.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9swb2", "score_hidden": false, "stickied": false, "created": 1492235025.0, "created_utc": 1492206225.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9r2aa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "neurorex", "parent_id": "t1_dg9nsqb", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "&gt; Notice how you are only talking about yourself\n\n&gt;The key phrase here is \"why should I train you\", you have focused on the \"you have no experience\".\n\n&gt;Sales is understanding that you need to put the customer first\n\nBut these are things that anyone can easily come up with after the fact. This really didn't go beyond the guy being a total asshole. That's where it begins and stops. From many other interviewers that bragged about rejecting poor-looking candidates, there's really no sane rationale behind what the owner/CEO and HR Manager did.\n\nSome interviewers really believe that you should always wear a tie to the interview. That you're supposed to present how you add value to the company. That you should transplant industry needs into your interviewing behavior. But this is only because they heard about it from somewhere else, and it's a very antiquated way of thinking when interviewing candidates. Usually interviewers who think like that, didn't do the homework on that *their* company needs and the job traits that the new employee really need to have.\n\nI'm surprised that no one has accused OP of \"failing\" a high-pressure interview (another favorite for these job-fillers) to try and fit some teachable moments for the sake of giving advice.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Notice how you are only talking about yourself&lt;/p&gt;\n\n&lt;p&gt;The key phrase here is &amp;quot;why should I train you&amp;quot;, you have focused on the &amp;quot;you have no experience&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Sales is understanding that you need to put the customer first&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But these are things that anyone can easily come up with after the fact. This really didn&amp;#39;t go beyond the guy being a total asshole. That&amp;#39;s where it begins and stops. From many other interviewers that bragged about rejecting poor-looking candidates, there&amp;#39;s really no sane rationale behind what the owner/CEO and HR Manager did.&lt;/p&gt;\n\n&lt;p&gt;Some interviewers really believe that you should always wear a tie to the interview. That you&amp;#39;re supposed to present how you add value to the company. That you should transplant industry needs into your interviewing behavior. But this is only because they heard about it from somewhere else, and it&amp;#39;s a very antiquated way of thinking when interviewing candidates. Usually interviewers who think like that, didn&amp;#39;t do the homework on that &lt;em&gt;their&lt;/em&gt; company needs and the job traits that the new employee really need to have.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m surprised that no one has accused OP of &amp;quot;failing&amp;quot; a high-pressure interview (another favorite for these job-fillers) to try and fit some teachable moments for the sake of giving advice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9r2aa", "score_hidden": false, "stickied": false, "created": 1492232688.0, "created_utc": 1492203888.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9nsqb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "larrythetomato", "parent_id": "t3_65az5d", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "It sounds like you wouldn't like to work for him anyway.\n\nWhat he was looking for is someone who respects themselves enough not to put up with his shit.\n\nFor example with the clothes. Whatever you wore, he is going to give you a bunch of shit and see how you deal with it, by trying to justify your actions and making excuses, that is not what a boss does.\n\n&gt;The owner looks over my resume and tears me apart. He asks why he should hire me, I have no industry experience. I go on to explain that the position is the next step in my career development, it was worth applying to and reaching out to, I’m a hard worker, quick learner, have a proven track record of success, \n\nNotice how you are only talking about yourself\n\n&gt;you know the usual…but no, he interrupts and says, “No, why should I train you, spend time on you and you when you have no experience!” \n\nThe key phrase here is \"why should I train you\", you have focused on the \"you have no experience\".\n\n&gt;I’m trying to explain I’m an experienced manager and experienced in policy and procedures, training, developing, holding employees accountable, empowering others to strive for success but new to this industry but have been new to my previous industries and learned quickly. He just goes on to what feels like berating me because of my lack of industry experience. (If that’s the case, the HR manager NEVER should have contacted me for this position).\n\n\n\nSales is understanding that you need to put the customer first, it is not about the product you have (in a job that is you), it is about the values you have and what you can give to the customer. What he wants to hear is, I can manage a team of misfits, and make them productive. With a bunch of bells and whistles. There is always room for improvement.\n\nOverall this guy sounds like an ass, I would have turned him down if he offered me a job.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you wouldn&amp;#39;t like to work for him anyway.&lt;/p&gt;\n\n&lt;p&gt;What he was looking for is someone who respects themselves enough not to put up with his shit.&lt;/p&gt;\n\n&lt;p&gt;For example with the clothes. Whatever you wore, he is going to give you a bunch of shit and see how you deal with it, by trying to justify your actions and making excuses, that is not what a boss does.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The owner looks over my resume and tears me apart. He asks why he should hire me, I have no industry experience. I go on to explain that the position is the next step in my career development, it was worth applying to and reaching out to, I’m a hard worker, quick learner, have a proven track record of success, &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Notice how you are only talking about yourself&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;you know the usual…but no, he interrupts and says, “No, why should I train you, spend time on you and you when you have no experience!” &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The key phrase here is &amp;quot;why should I train you&amp;quot;, you have focused on the &amp;quot;you have no experience&amp;quot;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I’m trying to explain I’m an experienced manager and experienced in policy and procedures, training, developing, holding employees accountable, empowering others to strive for success but new to this industry but have been new to my previous industries and learned quickly. He just goes on to what feels like berating me because of my lack of industry experience. (If that’s the case, the HR manager NEVER should have contacted me for this position).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sales is understanding that you need to put the customer first, it is not about the product you have (in a job that is you), it is about the values you have and what you can give to the customer. What he wants to hear is, I can manage a team of misfits, and make them productive. With a bunch of bells and whistles. There is always room for improvement.&lt;/p&gt;\n\n&lt;p&gt;Overall this guy sounds like an ass, I would have turned him down if he offered me a job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9nsqb", "score_hidden": false, "stickied": false, "created": 1492228732.0, "created_utc": 1492199932.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": "", "user_reports": [], "id": "dga4bnd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IndustrialTreeHugger", "parent_id": "t3_65az5d", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Looks like you dodged a bullet there, OP.  I'd say good riddance to them.  Can you imagine leaving your current job for such a place? yikes! \n\nYou didn't do or say anything wrong.  Your experience sounds great as well.  This guy has some sort of issues (narcissism, low self esteem, problems at home, who knows!) and tried to bully you as a result.  You were incredibly professional for not just walking out.  I would have a hard time not just standing up and saying before leaving \"I think we are done here - this company doesn't seem to be a place I would like to work.\"  \n\n........Seriously though.... he was wearing sandals and chewed you out for not having a tie on with your nice slacks and buttoned shirt?  What sort of strange world does he live in?\n\nI've interviewed many people and even if someone comes in dressed like a bum I don't tell them that they aren't dressed formal enough to be in my presence.  Sure it puts a negative mark on their application, but I'm not going to sit there and bitch at them like a nun teacher would chide their students a century ago. I even had one gentleman say \"sure! I have no problem working with a woman as a boss!\" when he found out that I was the manager.... yet I just kept my professional poker face on and made notes.  I would only tell the applicants about it if they asked for feedback on why they were not selected.     ", "edited": 1492222117.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Looks like you dodged a bullet there, OP.  I&amp;#39;d say good riddance to them.  Can you imagine leaving your current job for such a place? yikes! &lt;/p&gt;\n\n&lt;p&gt;You didn&amp;#39;t do or say anything wrong.  Your experience sounds great as well.  This guy has some sort of issues (narcissism, low self esteem, problems at home, who knows!) and tried to bully you as a result.  You were incredibly professional for not just walking out.  I would have a hard time not just standing up and saying before leaving &amp;quot;I think we are done here - this company doesn&amp;#39;t seem to be a place I would like to work.&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;........Seriously though.... he was wearing sandals and chewed you out for not having a tie on with your nice slacks and buttoned shirt?  What sort of strange world does he live in?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve interviewed many people and even if someone comes in dressed like a bum I don&amp;#39;t tell them that they aren&amp;#39;t dressed formal enough to be in my presence.  Sure it puts a negative mark on their application, but I&amp;#39;m not going to sit there and bitch at them like a nun teacher would chide their students a century ago. I even had one gentleman say &amp;quot;sure! I have no problem working with a woman as a boss!&amp;quot; when he found out that I was the manager.... yet I just kept my professional poker face on and made notes.  I would only tell the applicants about it if they asked for feedback on why they were not selected.     &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dga4bnd", "score_hidden": false, "stickied": false, "created": 1492250330.0, "created_utc": 1492221530.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65az5d", "likes": null, "replies": "", "user_reports": [], "id": "dga4yx3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IndustrialTreeHugger", "parent_id": "t1_dg97riz", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Agreed.  Chances are if someone starts off with \"no offense, but.... \" or \"I don't mean to be rude, but.....\" whatever comes out from the hole under their nose is going to be absolutely ignorant and uncalled for.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed.  Chances are if someone starts off with &amp;quot;no offense, but.... &amp;quot; or &amp;quot;I don&amp;#39;t mean to be rude, but.....&amp;quot; whatever comes out from the hole under their nose is going to be absolutely ignorant and uncalled for.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dga4yx3", "score_hidden": false, "stickied": false, "created": 1492251272.0, "created_utc": 1492222472.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97riz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "neurorex", "parent_id": "t3_65az5d", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I only regret I have but one upvote to give for you. That was infuriating to read, and I'm sorry you had a terrible experience. Seriously, the HR Manager was terrible, the owner/CEO was terrible, the interview was terrible, the whole thing was a huge waste of everyone's time. \n\nAnd to the employer apologists in this thread: There is **zero** excuse why the interview had to be conducted this way. The HR Manager should have stopped the interview and got everyone back on track. The owner really shouldn't have been doing interviews at all if that was how he was going to behave. The only lessons learned from this, *if any*, is that this is a company everyone should stay away from and the HR Manager should consider leaving that position. There is nothing to cater to - if they were going to tear you up on appearances alone, and look for any dumb excuses to reject you, these guys have gone way off the deep end and you would have had to act like a fool to \"impress\" them. I don't care how much they \"didn't mean to be mean or rude\", but their action spoke way louder than words.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I only regret I have but one upvote to give for you. That was infuriating to read, and I&amp;#39;m sorry you had a terrible experience. Seriously, the HR Manager was terrible, the owner/CEO was terrible, the interview was terrible, the whole thing was a huge waste of everyone&amp;#39;s time. &lt;/p&gt;\n\n&lt;p&gt;And to the employer apologists in this thread: There is &lt;strong&gt;zero&lt;/strong&gt; excuse why the interview had to be conducted this way. The HR Manager should have stopped the interview and got everyone back on track. The owner really shouldn&amp;#39;t have been doing interviews at all if that was how he was going to behave. The only lessons learned from this, &lt;em&gt;if any&lt;/em&gt;, is that this is a company everyone should stay away from and the HR Manager should consider leaving that position. There is nothing to cater to - if they were going to tear you up on appearances alone, and look for any dumb excuses to reject you, these guys have gone way off the deep end and you would have had to act like a fool to &amp;quot;impress&amp;quot; them. I don&amp;#39;t care how much they &amp;quot;didn&amp;#39;t mean to be mean or rude&amp;quot;, but their action spoke way louder than words.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg97riz", "score_hidden": false, "stickied": false, "created": 1492209895.0, "created_utc": 1492181095.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]