[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "jobs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, all.&lt;/p&gt;\n\n&lt;p&gt;Just a simple post. I&amp;#39;ve just finished a Marketing degree (preparing to take my GMAT and begin an online MBA), and I want to transition from my current job at a furniture store into an entry-level marketing role where I can put my degree to use and earn a little higher salary.&lt;/p&gt;\n\n&lt;p&gt;What types of positions should I be searching for? I have 3 years of retail sales experience and a combined 7 years of customer service experience. &lt;/p&gt;\n\n&lt;p&gt;My ultimate goal is to become a marketing consultant and eventually start my own firm for small businesses.&lt;/p&gt;\n\n&lt;p&gt;Any tips are greatly appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, all.\n\nJust a simple post. I've just finished a Marketing degree (preparing to take my GMAT and begin an online MBA), and I want to transition from my current job at a furniture store into an entry-level marketing role where I can put my degree to use and earn a little higher salary.\n\nWhat types of positions should I be searching for? I have 3 years of retail sales experience and a combined 7 years of customer service experience. \n\nMy ultimate goal is to become a marketing consultant and eventually start my own firm for small businesses.\n\nAny tips are greatly appreciated.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65feq8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "Polar_Hellman", "saved": false, "mod_reports": [], "name": "t3_65feq8", "subreddit_name_prefixed": "r/jobs", "approved_by": null, "over_18": false, "domain": "self.jobs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhnd", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/jobs/comments/65feq8/best_way_to_start_out_with_a_marketing_degree/", "num_reports": null, "locked": false, "stickied": false, "created": 1492234726.0, "url": "https://www.reddit.com/r/jobs/comments/65feq8/best_way_to_start_out_with_a_marketing_degree/", "author_flair_text": null, "quarantine": false, "title": "Best way to start out with a Marketing degree?", "created_utc": 1492205926.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65feq8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65feq8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65feq8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65feq8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65feq8", "likes": null, "replies": "", "user_reports": [], "id": "dga1pk8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JIVEprinting", "parent_id": "t1_dga0qku", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Got to say, that sounds pretty strong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Got to say, that sounds pretty strong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dga1pk8", "score_hidden": false, "stickied": false, "created": 1492246728.0, "created_utc": 1492217928.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga0qku", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Polar_Hellman", "parent_id": "t1_dga03iw", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Again, thanks. What I believe I'll try to do is transition from my current job (mom and pop furniture retail) into a more corporate one. One of the local banks here is very fast-growing and good to work for, and my older brother got pretty high up in it for a time, so I may give it a shot if it results in a slightly higher or more dependable pay.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Again, thanks. What I believe I&amp;#39;ll try to do is transition from my current job (mom and pop furniture retail) into a more corporate one. One of the local banks here is very fast-growing and good to work for, and my older brother got pretty high up in it for a time, so I may give it a shot if it results in a slightly higher or more dependable pay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dga0qku", "score_hidden": false, "stickied": false, "created": 1492245431.0, "created_utc": 1492216631.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga03iw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JIVEprinting", "parent_id": "t1_dg9yvhx", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "The conventional wisdom they told you was the best they had.  We are the only generation in human history that's experienced such a fundamental change in work.\n\n\nThanks for your acknowledgment. I tried to write the post I wish someone had written to me.\n\n\nThere is a tertiary option, the one I took, and that is to do a (graduate) degree in something technical and terminal.  Industry outlooks are pretty important here, finance being a better choice than chemistry, but anything will open doors.\n\n\nYou can still overcome the odds (with the Bible) but at least knowing what the odds are can be pretty useful. Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The conventional wisdom they told you was the best they had.  We are the only generation in human history that&amp;#39;s experienced such a fundamental change in work.&lt;/p&gt;\n\n&lt;p&gt;Thanks for your acknowledgment. I tried to write the post I wish someone had written to me.&lt;/p&gt;\n\n&lt;p&gt;There is a tertiary option, the one I took, and that is to do a (graduate) degree in something technical and terminal.  Industry outlooks are pretty important here, finance being a better choice than chemistry, but anything will open doors.&lt;/p&gt;\n\n&lt;p&gt;You can still overcome the odds (with the Bible) but at least knowing what the odds are can be pretty useful. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dga03iw", "score_hidden": false, "stickied": false, "created": 1492244577.0, "created_utc": 1492215777.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9yvhx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Polar_Hellman", "parent_id": "t1_dg9y4xv", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I'm at a loss of words that someone actually took the time, effort, and thoughtfulness to write a reply of this caliber to one of my posts.\n\nThank you for being candid and for sharing your expertise. You've not only provided me with valuable information, you've set my mind at ease and given me an alternative path.\n\nI almost feel like I've been played by all the older adult figures in my life over the course of years. Oh well. I'll do whatever I need to do to succeed and excel.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m at a loss of words that someone actually took the time, effort, and thoughtfulness to write a reply of this caliber to one of my posts.&lt;/p&gt;\n\n&lt;p&gt;Thank you for being candid and for sharing your expertise. You&amp;#39;ve not only provided me with valuable information, you&amp;#39;ve set my mind at ease and given me an alternative path.&lt;/p&gt;\n\n&lt;p&gt;I almost feel like I&amp;#39;ve been played by all the older adult figures in my life over the course of years. Oh well. I&amp;#39;ll do whatever I need to do to succeed and excel.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9yvhx", "score_hidden": false, "stickied": false, "created": 1492242947.0, "created_utc": 1492214147.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65feq8", "likes": null, "replies": "", "user_reports": [], "id": "dga2vsv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dalthejigsaw", "parent_id": "t1_dg9y4xv", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "&gt; and customer service are excellent for moving into a new industry. My sister went from general reception to garage door openers and then field maintenance. The key is to do a good job so your employer kno\n\nThis was such a great response. I appreciate it. Thanks a lot! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;and customer service are excellent for moving into a new industry. My sister went from general reception to garage door openers and then field maintenance. The key is to do a good job so your employer kno&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This was such a great response. I appreciate it. Thanks a lot! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dga2vsv", "score_hidden": false, "stickied": false, "created": 1492248347.0, "created_utc": 1492219547.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9y4xv", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "JIVEprinting", "parent_id": "t3_65feq8", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I started in a very similar position to yours, especially with the big dreams.  But there are some problems.\n\n\n\nMarketing entails very little technical skill or hands on training (that is not specific to each industry if not each company), so there's really no way to differentiate yourself other than grades.  Not to be rude, but since you are posting here I assume either your school is not a feeder for the kind of company would want to work at or else your grades weren't strong enough for that route.  (If I'm mistaken, maybe try Plan A.)\n\n\n\nIf that's the case there's ***no hope whatsoever*** in the current marketplace for you to get that kind of job.\n\n\n\nBut what is that kind of job?\n\n\n\nWe grow up surrounded by public sector administration, mass market broadcast, and (statistically) large national francisors.  We could understandably get the impression that anyone with two synapses firing in sequence could greatly improve a lot of what we see.  And that's completely correct.\n\n\n\nBUT... companies actually know their own business pretty well, and their own customers a lot more than they let on.  They use a haphazard cookie cutter because it's cost-effective.  The only people interested in doing better for the high-engagement minority are... the high-engagement minority.\n\n\nConsultants were mainly a fashionable way to cover your butt in the 90's when there was cash to spare or, even further back, when businesses had grown along with the population and neither widespread college education nor competitive pressures were there to enforce operational excellence.\n\n\nConsulting mainly continues today as a matter of entrenched institution.  Or maybe it's nuanced; but what it's not, definitely, is companies looking for help in these areas (let alone any shortage of willing suppliers.)  Those that do are increasingly cross-sold by financial auditors, who are in a strong position to support their recommendations with both data and law.  Hard to compete with that with cleverness.\n\n\nBut if you had a bottom-rung job at a company that happened to do that, you could express interest and maybe work your way there.  You'll just have to beat out anyone else with more hard-skill training (like a biology degree, and there are A LOT of them scrambling for unskilled jobs.)  You might even pass up the cream candidates who had a stronger resume than you did, or at least grow in a different direction than them so you're not getting hedged out of promotions.\n\n\nA close second (and the choice with the best odds) is to get a comparable unskilled job in LITERALLY ANY industry that has a technical component, like paper (a favorite), or banking, or database integrations.  Then learn that business.\n\n\nNow you can get into the marketing side of things in that industry.  They have specific needs that generalists can't meet.  And from there you could branch into marketing for other industries, or maybe another function in the same industry that you find yourself enjoying.\n\n\nWhat you *can't* do is it go right from where you are today to there.  No one can.  Those positions don't exist (nepotism notwithstanding), because companies will absolutely never ever hire a B candidate if there is an abundance of a A's (and we are describing a C.)\n\n\nSales and customer service are excellent for moving into a new industry.  My sister went from general reception to garage door openers and then field maintenance.  The key is to do a good job so your employer knows they can trust you and wants to help you do something you're interested in.  This is the exact advice I have sitting in front of me by Howard Lincoln, former chairman of Nintendo of America, as well as King Solomon.\n\n\nIn this relative landscape, examine the MBA in context.  It makes you more expensive but with none of the industry or technical background.  The MBA degree became popular in a time when they were a lot of line supervisors ready to make the move to management but didn't have the business tool set.  Today we have the opposite situation.  Shrinking demand, rising costs, higher taxes, stricter regulation, fewer jobs, and global competitors squeezing margins.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I started in a very similar position to yours, especially with the big dreams.  But there are some problems.&lt;/p&gt;\n\n&lt;p&gt;Marketing entails very little technical skill or hands on training (that is not specific to each industry if not each company), so there&amp;#39;s really no way to differentiate yourself other than grades.  Not to be rude, but since you are posting here I assume either your school is not a feeder for the kind of company would want to work at or else your grades weren&amp;#39;t strong enough for that route.  (If I&amp;#39;m mistaken, maybe try Plan A.)&lt;/p&gt;\n\n&lt;p&gt;If that&amp;#39;s the case there&amp;#39;s &lt;strong&gt;&lt;em&gt;no hope whatsoever&lt;/em&gt;&lt;/strong&gt; in the current marketplace for you to get that kind of job.&lt;/p&gt;\n\n&lt;p&gt;But what is that kind of job?&lt;/p&gt;\n\n&lt;p&gt;We grow up surrounded by public sector administration, mass market broadcast, and (statistically) large national francisors.  We could understandably get the impression that anyone with two synapses firing in sequence could greatly improve a lot of what we see.  And that&amp;#39;s completely correct.&lt;/p&gt;\n\n&lt;p&gt;BUT... companies actually know their own business pretty well, and their own customers a lot more than they let on.  They use a haphazard cookie cutter because it&amp;#39;s cost-effective.  The only people interested in doing better for the high-engagement minority are... the high-engagement minority.&lt;/p&gt;\n\n&lt;p&gt;Consultants were mainly a fashionable way to cover your butt in the 90&amp;#39;s when there was cash to spare or, even further back, when businesses had grown along with the population and neither widespread college education nor competitive pressures were there to enforce operational excellence.&lt;/p&gt;\n\n&lt;p&gt;Consulting mainly continues today as a matter of entrenched institution.  Or maybe it&amp;#39;s nuanced; but what it&amp;#39;s not, definitely, is companies looking for help in these areas (let alone any shortage of willing suppliers.)  Those that do are increasingly cross-sold by financial auditors, who are in a strong position to support their recommendations with both data and law.  Hard to compete with that with cleverness.&lt;/p&gt;\n\n&lt;p&gt;But if you had a bottom-rung job at a company that happened to do that, you could express interest and maybe work your way there.  You&amp;#39;ll just have to beat out anyone else with more hard-skill training (like a biology degree, and there are A LOT of them scrambling for unskilled jobs.)  You might even pass up the cream candidates who had a stronger resume than you did, or at least grow in a different direction than them so you&amp;#39;re not getting hedged out of promotions.&lt;/p&gt;\n\n&lt;p&gt;A close second (and the choice with the best odds) is to get a comparable unskilled job in LITERALLY ANY industry that has a technical component, like paper (a favorite), or banking, or database integrations.  Then learn that business.&lt;/p&gt;\n\n&lt;p&gt;Now you can get into the marketing side of things in that industry.  They have specific needs that generalists can&amp;#39;t meet.  And from there you could branch into marketing for other industries, or maybe another function in the same industry that you find yourself enjoying.&lt;/p&gt;\n\n&lt;p&gt;What you &lt;em&gt;can&amp;#39;t&lt;/em&gt; do is it go right from where you are today to there.  No one can.  Those positions don&amp;#39;t exist (nepotism notwithstanding), because companies will absolutely never ever hire a B candidate if there is an abundance of a A&amp;#39;s (and we are describing a C.)&lt;/p&gt;\n\n&lt;p&gt;Sales and customer service are excellent for moving into a new industry.  My sister went from general reception to garage door openers and then field maintenance.  The key is to do a good job so your employer knows they can trust you and wants to help you do something you&amp;#39;re interested in.  This is the exact advice I have sitting in front of me by Howard Lincoln, former chairman of Nintendo of America, as well as King Solomon.&lt;/p&gt;\n\n&lt;p&gt;In this relative landscape, examine the MBA in context.  It makes you more expensive but with none of the industry or technical background.  The MBA degree became popular in a time when they were a lot of line supervisors ready to make the move to management but didn&amp;#39;t have the business tool set.  Today we have the opposite situation.  Shrinking demand, rising costs, higher taxes, stricter regulation, fewer jobs, and global competitors squeezing margins.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dg9y4xv", "score_hidden": false, "stickied": false, "created": 1492241966.0, "created_utc": 1492213166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65feq8", "likes": null, "replies": "", "user_reports": [], "id": "dgam2xz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theseasons", "parent_id": "t3_65feq8", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "If you're looking for which skills to learn (mainly for digital marketing), [I have a ton of resources](http://www.themissionmarketer.com/digital-marketing-resources) on my site broken down by topic (SEO, content, CRO, social, etc) and skill level. Not selling anything, I just made this resource list to share with Redditors like you looking for how to get started. I hope it helps! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re looking for which skills to learn (mainly for digital marketing), &lt;a href=\"http://www.themissionmarketer.com/digital-marketing-resources\"&gt;I have a ton of resources&lt;/a&gt; on my site broken down by topic (SEO, content, CRO, social, etc) and skill level. Not selling anything, I just made this resource list to share with Redditors like you looking for how to get started. I hope it helps! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgam2xz", "score_hidden": false, "stickied": false, "created": 1492289743.0, "created_utc": 1492260943.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]