[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "jobs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m struggling to find a way to reach out to my contacts, specifically ones that you haven&amp;#39;t talked to in a year and requesting if they can help me get into their company to see if they know anyone hiring. It feels very fake of me but I really am at a point where I am desperate and just want to see if they know anyone or can really help me. This will all be through LinkedIn btw. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm struggling to find a way to reach out to my contacts, specifically ones that you haven't talked to in a year and requesting if they can help me get into their company to see if they know anyone hiring. It feels very fake of me but I really am at a point where I am desperate and just want to see if they know anyone or can really help me. This will all be through LinkedIn btw. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65j539", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "itsohsodemi", "saved": false, "mod_reports": [], "name": "t3_65j539", "subreddit_name_prefixed": "r/jobs", "approved_by": null, "over_18": false, "domain": "self.jobs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhnd", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/jobs/comments/65j539/how_to_reach_out_to_contacts_without_sounding/", "num_reports": null, "locked": false, "stickied": false, "created": 1492292787.0, "url": "https://www.reddit.com/r/jobs/comments/65j539/how_to_reach_out_to_contacts_without_sounding/", "author_flair_text": null, "quarantine": false, "title": "How to reach out to contacts without sounding like you're using them?", "created_utc": 1492263987.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65j539", "likes": null, "replies": "", "user_reports": [], "id": "dgao0b5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MysticJAC", "parent_id": "t3_65j539", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "For the future, the best time to contact members of your network is when you don't need something from them so you don't run into precisely this problem.  With that said, most people inherently do like helping each other out.  I know that flies in the face of the idea that we live an otherwise apathetic world that doesn't owe us anything, but people do like feeling useful and important enough to be asked a favor by someone else.  In this way, you need to make your messages about them, not you.  Start the conversation by saying you are looking for a change of pace in your career, and your contact seemed to be enjoying their job/company.  Ask about how much they actually enjoy what they're doing, what exactly they do in their day to day work, etc.  Use that discussion to segue into the request to simply know if they know about any openings in the department.  Don't ask for an outright recommendation or for them to get you the job, at least not at this juncture.  Ultimately, you haven't talked to them in a year, so asking for them to vouch for you is asking them to take a pretty big risk (i.e. they know you, but they don't *know* you).  It might scare them off right now, so just take advantage of the information they give you and hope they make an offer to give you a bit of inside help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For the future, the best time to contact members of your network is when you don&amp;#39;t need something from them so you don&amp;#39;t run into precisely this problem.  With that said, most people inherently do like helping each other out.  I know that flies in the face of the idea that we live an otherwise apathetic world that doesn&amp;#39;t owe us anything, but people do like feeling useful and important enough to be asked a favor by someone else.  In this way, you need to make your messages about them, not you.  Start the conversation by saying you are looking for a change of pace in your career, and your contact seemed to be enjoying their job/company.  Ask about how much they actually enjoy what they&amp;#39;re doing, what exactly they do in their day to day work, etc.  Use that discussion to segue into the request to simply know if they know about any openings in the department.  Don&amp;#39;t ask for an outright recommendation or for them to get you the job, at least not at this juncture.  Ultimately, you haven&amp;#39;t talked to them in a year, so asking for them to vouch for you is asking them to take a pretty big risk (i.e. they know you, but they don&amp;#39;t &lt;em&gt;know&lt;/em&gt; you).  It might scare them off right now, so just take advantage of the information they give you and hope they make an offer to give you a bit of inside help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgao0b5", "score_hidden": false, "stickied": false, "created": 1492293441.0, "created_utc": 1492264641.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65j539", "likes": null, "replies": "", "user_reports": [], "id": "dgb0d4k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "v2freak", "parent_id": "t3_65j539", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Make small talk at first, maybe bring up something that you and they shared in common such as a sports team you know they and you like. Then ask how they are doing. If they are normal people with a sense of how social norms work, they will ask you in which you can casually drop that you are doing mostly okay, but are having a difficult time finding work. Then the rest is up to them. \n\nOf course it helps to actually care about them and want to see them outside of what they can do for you. So if you want to see them or hang out, suggest a firm time to do that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make small talk at first, maybe bring up something that you and they shared in common such as a sports team you know they and you like. Then ask how they are doing. If they are normal people with a sense of how social norms work, they will ask you in which you can casually drop that you are doing mostly okay, but are having a difficult time finding work. Then the rest is up to them. &lt;/p&gt;\n\n&lt;p&gt;Of course it helps to actually care about them and want to see them outside of what they can do for you. So if you want to see them or hang out, suggest a firm time to do that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgb0d4k", "score_hidden": false, "stickied": false, "created": 1492311100.0, "created_utc": 1492282300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]