[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "jobs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Throwaway here.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve worked at my job for 5 years. I&amp;#39;m very well compensated and have a lot of freedom but I&amp;#39;m just tired of the job. It doesn&amp;#39;t excite me anymore. I planned on quitting in January or at least starting to seek out another job but ultimately I&amp;#39;m just too comfortable and I&amp;#39;m worried about finding another job with comparable salary. &lt;/p&gt;\n\n&lt;p&gt;I have no kids, no debts, no marriage, no car payments and my lease is month to month. I also have a sizable amount saved up which could carry me for a year with no change to my lifestyle (assuming I would want to burn through all my savings which I don&amp;#39;t).&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s absolutely nothing preventing me from making a change except fear. I think ultimately my greatest fear is that I derive all my self worth from my job and without my job I&amp;#39;ll be miserable. I&amp;#39;m also worried that if I get another job I&amp;#39;ll be equally discontent. That the job isn&amp;#39;t the issue and won&amp;#39;t solve my problems.&lt;/p&gt;\n\n&lt;p&gt;I moved across country about five years ago and don&amp;#39;t have much in the way of friends or a support structure here. I&amp;#39;m also worried that my discontent will ultimately affect the quality of my work which isn&amp;#39;t fair to my employer. I&amp;#39;d rather leave on a high note rather than peter out with job performance issues.&lt;/p&gt;\n\n&lt;p&gt;I know there&amp;#39;s a lot of people wanting jobs out there who would argue that I should be happy with what I have but ultimately it&amp;#39;s just not something that satisfies me and I feel like it&amp;#39;s preventing me from finding what truly makes me happy.&lt;/p&gt;\n\n&lt;p&gt;Sorry for the rant. I know it comes across whiny but it&amp;#39;s just something I&amp;#39;ve wanted to put into words. Advice or experience sharing would be appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Throwaway here.\n\nI've worked at my job for 5 years. I'm very well compensated and have a lot of freedom but I'm just tired of the job. It doesn't excite me anymore. I planned on quitting in January or at least starting to seek out another job but ultimately I'm just too comfortable and I'm worried about finding another job with comparable salary. \n\nI have no kids, no debts, no marriage, no car payments and my lease is month to month. I also have a sizable amount saved up which could carry me for a year with no change to my lifestyle (assuming I would want to burn through all my savings which I don't).\n\nThere's absolutely nothing preventing me from making a change except fear. I think ultimately my greatest fear is that I derive all my self worth from my job and without my job I'll be miserable. I'm also worried that if I get another job I'll be equally discontent. That the job isn't the issue and won't solve my problems.\n\nI moved across country about five years ago and don't have much in the way of friends or a support structure here. I'm also worried that my discontent will ultimately affect the quality of my work which isn't fair to my employer. I'd rather leave on a high note rather than peter out with job performance issues.\n\nI know there's a lot of people wanting jobs out there who would argue that I should be happy with what I have but ultimately it's just not something that satisfies me and I feel like it's preventing me from finding what truly makes me happy.\n\nSorry for the rant. I know it comes across whiny but it's just something I've wanted to put into words. Advice or experience sharing would be appreciated.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65vjp5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "disconteninhouston", "saved": false, "mod_reports": [], "name": "t3_65vjp5", "subreddit_name_prefixed": "r/jobs", "approved_by": null, "over_18": false, "domain": "self.jobs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhnd", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/jobs/comments/65vjp5/discontent_with_is_a_great_job_afraid_to_move_on/", "num_reports": null, "locked": false, "stickied": false, "created": 1492464597.0, "url": "https://www.reddit.com/r/jobs/comments/65vjp5/discontent_with_is_a_great_job_afraid_to_move_on/", "author_flair_text": null, "quarantine": false, "title": "Discontent with is a great job. Afraid to move on.", "created_utc": 1492435797.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": "", "user_reports": [], "id": "dgdj25m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ketocontroller", "parent_id": "t1_dgdhwtx", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Yes, have another job lined up for sure. You can try to prolong the start date and/or transition so your current employer is not in as much of a lurch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, have another job lined up for sure. You can try to prolong the start date and/or transition so your current employer is not in as much of a lurch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgdj25m", "score_hidden": false, "stickied": false, "created": 1492467460.0, "created_utc": 1492438660.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhwtx", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Anagiesays", "parent_id": "t3_65vjp5", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Do you have any vacation time saved up? You might want to use it and recharge your batteries. This will give you the opportunity to figure out if you don't like the job, the industry, or the type of company that you work for. \n\nI wouldn't quit your job without another one lined up though. On the off chance you can't find another position within a reasonable timeframe, and you do end up burning through your savings, you don't want to be put in the position of having to take something less than ideal because you're desperate. You have more in savings than most people in your situation though, so that's really up to you. \n\n&gt;don't have much in the way of friends or a support structure here. \n\nI think it's important that you work on this aspect of your life too. Your personal and professional life needs to be balanced. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have any vacation time saved up? You might want to use it and recharge your batteries. This will give you the opportunity to figure out if you don&amp;#39;t like the job, the industry, or the type of company that you work for. &lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t quit your job without another one lined up though. On the off chance you can&amp;#39;t find another position within a reasonable timeframe, and you do end up burning through your savings, you don&amp;#39;t want to be put in the position of having to take something less than ideal because you&amp;#39;re desperate. You have more in savings than most people in your situation though, so that&amp;#39;s really up to you. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;don&amp;#39;t have much in the way of friends or a support structure here. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think it&amp;#39;s important that you work on this aspect of your life too. Your personal and professional life needs to be balanced. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgdhwtx", "score_hidden": false, "stickied": false, "created": 1492465814.0, "created_utc": 1492437014.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": "", "user_reports": [], "id": "dgdix7y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sputnik02", "parent_id": "t1_dgdicgy", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Sometimes you get bored of doing similar things over and over again - I say it's normal. Also there is a deeper realisation whether working for 40 years (maybe 50 or 60 with the current trends lol) before retiring is better for anything then paying bills so people look for jobs with purpose, and that leads to multiple tries.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes you get bored of doing similar things over and over again - I say it&amp;#39;s normal. Also there is a deeper realisation whether working for 40 years (maybe 50 or 60 with the current trends lol) before retiring is better for anything then paying bills so people look for jobs with purpose, and that leads to multiple tries.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgdix7y", "score_hidden": false, "stickied": false, "created": 1492467272.0, "created_utc": 1492438472.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdicgy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ketocontroller", "parent_id": "t3_65vjp5", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I have come back to your post a few times. \n\nI get this feeling every few years and find a new job. I wonder for myself if it is just me wanting a change, as all jobs have some undesirable aspects. I am actually resigning from my current job soon. One very similar to yours, good pay, very flexible, good working environment. I question whether I just have \"lack of commitment\" but I have been married for 18 years, so I don't think that is it. \n\nI would suggest you should really spend some time deciding what you want in the long term. If that is changing jobs every 5 years there is nothing wrong with that! Not everyone is supposed to stay forever and companies just don't take care of their employees long term anymore. Either way, as long as you find a job that is a good fit and is moving upward, then no harm no foul. \n\nJust my 2 cents. Good luck!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have come back to your post a few times. &lt;/p&gt;\n\n&lt;p&gt;I get this feeling every few years and find a new job. I wonder for myself if it is just me wanting a change, as all jobs have some undesirable aspects. I am actually resigning from my current job soon. One very similar to yours, good pay, very flexible, good working environment. I question whether I just have &amp;quot;lack of commitment&amp;quot; but I have been married for 18 years, so I don&amp;#39;t think that is it. &lt;/p&gt;\n\n&lt;p&gt;I would suggest you should really spend some time deciding what you want in the long term. If that is changing jobs every 5 years there is nothing wrong with that! Not everyone is supposed to stay forever and companies just don&amp;#39;t take care of their employees long term anymore. Either way, as long as you find a job that is a good fit and is moving upward, then no harm no foul. &lt;/p&gt;\n\n&lt;p&gt;Just my 2 cents. Good luck!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgdicgy", "score_hidden": false, "stickied": false, "created": 1492466459.0, "created_utc": 1492437659.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": "", "user_reports": [], "id": "dgdnx2k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "drhorn", "parent_id": "t3_65vjp5", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "In this situation, my advice would be to go with the obvious: find a way to change things up at your current job to make it more exciting.\n\nListen, I'm not going to lie to you: the number of jobs out there which are well compensated and where people have a lot of freedom are few and far between. If your reason for leaving is that you just want something else that is more exciting, I think that is totally reasonable - however, the assumption that you will be able to find that at another job easily... that is a bit harder.\n\nIf you have a lot of good will at your current place, why not ask if you can shake things up a bit? Can you move into a different department? Work on a different project? Try something new?\n\nI've found myself in that rut before and I've had the luck of always being able to find something at my current job that re-energizes me. It may actually help you to bring this up to your boss - maybe they know something that you don't?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In this situation, my advice would be to go with the obvious: find a way to change things up at your current job to make it more exciting.&lt;/p&gt;\n\n&lt;p&gt;Listen, I&amp;#39;m not going to lie to you: the number of jobs out there which are well compensated and where people have a lot of freedom are few and far between. If your reason for leaving is that you just want something else that is more exciting, I think that is totally reasonable - however, the assumption that you will be able to find that at another job easily... that is a bit harder.&lt;/p&gt;\n\n&lt;p&gt;If you have a lot of good will at your current place, why not ask if you can shake things up a bit? Can you move into a different department? Work on a different project? Try something new?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve found myself in that rut before and I&amp;#39;ve had the luck of always being able to find something at my current job that re-energizes me. It may actually help you to bring this up to your boss - maybe they know something that you don&amp;#39;t?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgdnx2k", "score_hidden": false, "stickied": false, "created": 1492473449.0, "created_utc": 1492444649.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": "", "user_reports": [], "id": "dgdktnd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kanepartners", "parent_id": "t3_65vjp5", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "do you have a different part of the country you would want to live in?  might be a good time for a new adventure.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;do you have a different part of the country you would want to live in?  might be a good time for a new adventure.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgdktnd", "score_hidden": false, "stickied": false, "created": 1492469789.0, "created_utc": 1492440989.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": "", "user_reports": [], "id": "dgdrsev", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Get_it_together_dawg", "parent_id": "t3_65vjp5", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I think it's understandable to not be excited about one's job, provided they don't see any real significance or valuable meaning to what they do.  Being comfortable in one's job and enjoying nice fringe benefits doesn't change that core issue, it just makes it more bearable compared to if they didn't have those benefits.\n\nThis is a sentiment I've found older generations like to scoff at and crack-wise about 'something something millenials'.  And granted, some people seem to do okay with segregating their work as their work and not expecting or needing their job to provide anything more meaningful in their life beyond the ability to pay bills and rent.  However, I find it close minded and myopic when some people say a job should *only* provide for you in the way of money, and it is deluded, wishful thinking that it should be also personally meaningful/exciting/valuable, etc.  I think if one is going to work at and dedicate large chunks of their time for the next 40+ years, it is in their best interest to try and make it all of those things.\n\nI think you have to figure out which camp you're in, and whether or not you just need a change of scenery, or a change in lifestyle.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s understandable to not be excited about one&amp;#39;s job, provided they don&amp;#39;t see any real significance or valuable meaning to what they do.  Being comfortable in one&amp;#39;s job and enjoying nice fringe benefits doesn&amp;#39;t change that core issue, it just makes it more bearable compared to if they didn&amp;#39;t have those benefits.&lt;/p&gt;\n\n&lt;p&gt;This is a sentiment I&amp;#39;ve found older generations like to scoff at and crack-wise about &amp;#39;something something millenials&amp;#39;.  And granted, some people seem to do okay with segregating their work as their work and not expecting or needing their job to provide anything more meaningful in their life beyond the ability to pay bills and rent.  However, I find it close minded and myopic when some people say a job should &lt;em&gt;only&lt;/em&gt; provide for you in the way of money, and it is deluded, wishful thinking that it should be also personally meaningful/exciting/valuable, etc.  I think if one is going to work at and dedicate large chunks of their time for the next 40+ years, it is in their best interest to try and make it all of those things.&lt;/p&gt;\n\n&lt;p&gt;I think you have to figure out which camp you&amp;#39;re in, and whether or not you just need a change of scenery, or a change in lifestyle.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgdrsev", "score_hidden": false, "stickied": false, "created": 1492477781.0, "created_utc": 1492448981.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": "", "user_reports": [], "id": "dge4a39", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lillyhammer", "parent_id": "t3_65vjp5", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I think the tell is in the 4th or 5th paragraph (+or- the throwaway line) in that you don't have a support structure available where you live now. As you stated, nothing prevents you from changing except for fear, but think about it in reference to the roots you haven't put down yet. Maybe take 1 step outside your comfort zone in this regard and join a meet-up for something you have interest in. Because your job is the biggest part of your life, you may be transferring the ennui you are feeling from actually being socially cut off onto the feelings about your job. Or not, but how will you really know unless you create your own well-rounded life? It's a lot to ask for a job to carry all the importance of making your life happy without another avenue to get there too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the tell is in the 4th or 5th paragraph (+or- the throwaway line) in that you don&amp;#39;t have a support structure available where you live now. As you stated, nothing prevents you from changing except for fear, but think about it in reference to the roots you haven&amp;#39;t put down yet. Maybe take 1 step outside your comfort zone in this regard and join a meet-up for something you have interest in. Because your job is the biggest part of your life, you may be transferring the ennui you are feeling from actually being socially cut off onto the feelings about your job. Or not, but how will you really know unless you create your own well-rounded life? It&amp;#39;s a lot to ask for a job to carry all the importance of making your life happy without another avenue to get there too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dge4a39", "score_hidden": false, "stickied": false, "created": 1492491779.0, "created_utc": 1492462979.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": "", "user_reports": [], "id": "dge6n7f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chaoticflanagan", "parent_id": "t3_65vjp5", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I know exactly how you feel. In 2015, I had a job making good money, about 15 minutes from home, and was very easy. I spent most of my shift watching movies and reading. I had been in the position for about 3 years and wasn't really progressing but the money was good so it was very hard to justify leaving. I ended up taking a position that required weekly travel for a prestigious consulting firm making only about $10k more. The work was fine but it was exhausting. I worked there for about 2 years before the company I was consulting for poached me from the consulting company. \n\nThis may be anecdotal, but if i didn't take the risk, i wouldn't be where i am now. I am now exponentially happier with the company, work I am doing, and the money.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know exactly how you feel. In 2015, I had a job making good money, about 15 minutes from home, and was very easy. I spent most of my shift watching movies and reading. I had been in the position for about 3 years and wasn&amp;#39;t really progressing but the money was good so it was very hard to justify leaving. I ended up taking a position that required weekly travel for a prestigious consulting firm making only about $10k more. The work was fine but it was exhausting. I worked there for about 2 years before the company I was consulting for poached me from the consulting company. &lt;/p&gt;\n\n&lt;p&gt;This may be anecdotal, but if i didn&amp;#39;t take the risk, i wouldn&amp;#39;t be where i am now. I am now exponentially happier with the company, work I am doing, and the money.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dge6n7f", "score_hidden": false, "stickied": false, "created": 1492494645.0, "created_utc": 1492465845.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": "", "user_reports": [], "id": "dgej2eu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ra42ub", "parent_id": "t1_dgegwf3", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I am also in a similar position. I have been in the current role for more than 4 years and I am now getting the itch to move on to another role probably in companies like Amazon or google. \n\nBtw I saw your ID just now. Discontent in houston. I am based out of houston too. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am also in a similar position. I have been in the current role for more than 4 years and I am now getting the itch to move on to another role probably in companies like Amazon or google. &lt;/p&gt;\n\n&lt;p&gt;Btw I saw your ID just now. Discontent in houston. I am based out of houston too. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgej2eu", "score_hidden": true, "stickied": false, "created": 1492510304.0, "created_utc": 1492481504.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgegwf3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "disconteninhouston", "parent_id": "t1_dge8l1l", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Not really. I'm a key executive and report directly to the CEO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really. I&amp;#39;m a key executive and report directly to the CEO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgegwf3", "score_hidden": false, "stickied": false, "created": 1492507712.0, "created_utc": 1492478912.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8l1l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ra42ub", "parent_id": "t3_65vjp5", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Don't you have options in your current company to move to another job role?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t you have options in your current company to move to another job role?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dge8l1l", "score_hidden": false, "stickied": false, "created": 1492497097.0, "created_utc": 1492468297.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65vjp5", "likes": null, "replies": "", "user_reports": [], "id": "dged61t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "justcasey_cme", "parent_id": "t3_65vjp5", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Is there something you've always wanted to do or accomplish but haven't? Maybe now is the time to try that out or look more heavily into it. I'd take a little more time to think about it though. I've made very quick decisions based on emotion in the past and always worry if it's what is right or not. I have some regrets but that's life I guess. However, being bored and unfulfilled is maybe my greatest fear in life and I hate to see people like that as well.\n\nI'm in a fairly similar position as you though. A lot of my life has been controlled by my fear. I'm working really hard right now to change that and hopefully you are able to as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there something you&amp;#39;ve always wanted to do or accomplish but haven&amp;#39;t? Maybe now is the time to try that out or look more heavily into it. I&amp;#39;d take a little more time to think about it though. I&amp;#39;ve made very quick decisions based on emotion in the past and always worry if it&amp;#39;s what is right or not. I have some regrets but that&amp;#39;s life I guess. However, being bored and unfulfilled is maybe my greatest fear in life and I hate to see people like that as well.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in a fairly similar position as you though. A lot of my life has been controlled by my fear. I&amp;#39;m working really hard right now to change that and hopefully you are able to as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dged61t", "score_hidden": false, "stickied": false, "created": 1492503052.0, "created_utc": 1492474252.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]