[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "jobs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I have a skype interview with a recruiter in a few hours and just this morning they sent me a pre-interview form I have to fill out which requests several professional references. Problem is, I&amp;#39;ve only been working sporadically since I graduated and I don&amp;#39;t have any references from within that time, and I&amp;#39;ve lost touch with my old professors and supervisors. I can think of a few people who would be able to give a good reference, but I&amp;#39;m anxious about getting their permission in time.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s the best way to make contact? Should I call or email? I don&amp;#39;t want to list people as references before I&amp;#39;ve confirmed it with them first, but I&amp;#39;m supposed to submit this form before my interview (it&amp;#39;s all crazy last minute). Or should I tell the recruiter I&amp;#39;m having trouble getting in touch with my references and need more time? The clock is ticking and I don&amp;#39;t know what the best way to go about this is.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I have a skype interview with a recruiter in a few hours and just this morning they sent me a pre-interview form I have to fill out which requests several professional references. Problem is, I've only been working sporadically since I graduated and I don't have any references from within that time, and I've lost touch with my old professors and supervisors. I can think of a few people who would be able to give a good reference, but I'm anxious about getting their permission in time.\n\nWhat's the best way to make contact? Should I call or email? I don't want to list people as references before I've confirmed it with them first, but I'm supposed to submit this form before my interview (it's all crazy last minute). Or should I tell the recruiter I'm having trouble getting in touch with my references and need more time? The clock is ticking and I don't know what the best way to go about this is.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65whpr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "needreferencespls", "saved": false, "mod_reports": [], "name": "t3_65whpr", "subreddit_name_prefixed": "r/jobs", "approved_by": null, "over_18": false, "domain": "self.jobs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhnd", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/jobs/comments/65whpr/whats_the_best_way_to_approach_someone_for_a/", "num_reports": null, "locked": false, "stickied": false, "created": 1492474329.0, "url": "https://www.reddit.com/r/jobs/comments/65whpr/whats_the_best_way_to_approach_someone_for_a/", "author_flair_text": null, "quarantine": false, "title": "What's the best way to approach someone for a reference if you've lost contact for several years?", "created_utc": 1492445529.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65whpr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65whpr", "likes": null, "replies": "", "user_reports": [], "id": "dgdzrn6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "needreferencespls", "parent_id": "t1_dgdt777", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Thank you, this helped a lot!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, this helped a lot!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgdzrn6", "score_hidden": false, "stickied": false, "created": 1492486724.0, "created_utc": 1492457924.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdt777", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "kerplomp", "parent_id": "t3_65whpr", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "Call will be the fastest and most reliable, email is also an option.\n\nGreet them, acknowledge that you've fallen out of touch, give a quick update of what you've been up to, and ask if they could provide you with a positive reference. Mention the date your application is due and say you'd really appreciate it even under the short notice.\n\nYMMV, of course, but I've reached out to old supervisors with the same message, they were all very gracious and agreed to be a reference for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Call will be the fastest and most reliable, email is also an option.&lt;/p&gt;\n\n&lt;p&gt;Greet them, acknowledge that you&amp;#39;ve fallen out of touch, give a quick update of what you&amp;#39;ve been up to, and ask if they could provide you with a positive reference. Mention the date your application is due and say you&amp;#39;d really appreciate it even under the short notice.&lt;/p&gt;\n\n&lt;p&gt;YMMV, of course, but I&amp;#39;ve reached out to old supervisors with the same message, they were all very gracious and agreed to be a reference for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dgdt777", "score_hidden": false, "stickied": false, "created": 1492479349.0, "created_utc": 1492450549.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnd", "removal_reason": null, "link_id": "t3_65whpr", "likes": null, "replies": "", "user_reports": [], "id": "dge0le6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "babelincoln27", "parent_id": "t3_65whpr", "subreddit_name_prefixed": "r/jobs", "controversiality": 0, "body": "I've been doing internships, programs and job apps out the butt recently -- I'm not an expert but I think I have some good advice.\n\nBasically, it's a supervisor's assumed responsibility to give you a rec. You should always directly ask at least once, when you leave the job, but it is standard procedure for an old superior to continue providing you with recommendations. My mom's has several interns and has told me that, as long as she actually worked well with them, she is more than happy to talk about them years on (like 10-15). In fact, she has a short document of things they did and what they did well. It's very normal to ask that of someone. \n\nThat being said, she and many of my past bosses have asked that the person requesting a recommendation send them a quick reminder of who they are and a brief explanation of the job. That way, if it's a job as a prison guard, you emphasize the assertiveness more than the administrative organizational skills needed for a secretary.\n\nI have recently had to send quite a few last-minute emails by (luckily) being asked to provide references for a suddenly scheduled interview. My usual method is to say,\n\n\"Dear OldBoss,\n\nI hope you're well! \n\nI worked as your intern five years ago at POO Industries, serving as a toilet-flusher and restocked of toilet paper. \n\nI have been asked to interview for Toilet Inc. as a professional flusher, and the person who contacted me asked me to provide professional references.\n\n In past, you have been so kind as to allow me to provide your office phone number and email address for reference information. I wanted to give you a heads up that I have done so for Toilet Inc. As usual, I'm grateful for your help!\n\nPlease let me know if there is anything I can do to make this easy for you; I'd be happy to provide you with more of a description about the job.\n\nHave a lovely week!\n\nSincerely,\nBabelincoln27\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been doing internships, programs and job apps out the butt recently -- I&amp;#39;m not an expert but I think I have some good advice.&lt;/p&gt;\n\n&lt;p&gt;Basically, it&amp;#39;s a supervisor&amp;#39;s assumed responsibility to give you a rec. You should always directly ask at least once, when you leave the job, but it is standard procedure for an old superior to continue providing you with recommendations. My mom&amp;#39;s has several interns and has told me that, as long as she actually worked well with them, she is more than happy to talk about them years on (like 10-15). In fact, she has a short document of things they did and what they did well. It&amp;#39;s very normal to ask that of someone. &lt;/p&gt;\n\n&lt;p&gt;That being said, she and many of my past bosses have asked that the person requesting a recommendation send them a quick reminder of who they are and a brief explanation of the job. That way, if it&amp;#39;s a job as a prison guard, you emphasize the assertiveness more than the administrative organizational skills needed for a secretary.&lt;/p&gt;\n\n&lt;p&gt;I have recently had to send quite a few last-minute emails by (luckily) being asked to provide references for a suddenly scheduled interview. My usual method is to say,&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Dear OldBoss,&lt;/p&gt;\n\n&lt;p&gt;I hope you&amp;#39;re well! &lt;/p&gt;\n\n&lt;p&gt;I worked as your intern five years ago at POO Industries, serving as a toilet-flusher and restocked of toilet paper. &lt;/p&gt;\n\n&lt;p&gt;I have been asked to interview for Toilet Inc. as a professional flusher, and the person who contacted me asked me to provide professional references.&lt;/p&gt;\n\n&lt;p&gt;In past, you have been so kind as to allow me to provide your office phone number and email address for reference information. I wanted to give you a heads up that I have done so for Toilet Inc. As usual, I&amp;#39;m grateful for your help!&lt;/p&gt;\n\n&lt;p&gt;Please let me know if there is anything I can do to make this easy for you; I&amp;#39;d be happy to provide you with more of a description about the job.&lt;/p&gt;\n\n&lt;p&gt;Have a lovely week!&lt;/p&gt;\n\n&lt;p&gt;Sincerely,\nBabelincoln27&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "jobs", "name": "t1_dge0le6", "score_hidden": false, "stickied": false, "created": 1492487648.0, "created_utc": 1492458848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]