[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "fatpeoplestories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As promised, here is a small set of final thoughts and information on &lt;a href=\"https://www.reddit.com/r/fatpeoplestories/comments/63511a/on_the_road_with_miss_piggy_1/\"&gt;Miss Piggy’s misadventures.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This instalment won’t be in story form, but will be me telling you all about a few things that didn’t seem functional to the story. I like to keep these things honest, but also keep story flow, so tacking this stuff on the end is just the easiest way to go here. Thank you again, everyone, for your support. I have enjoyed entertaining you, and have enjoyed all the responses. You&amp;#39;re a wonderful community.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Payment:&lt;/strong&gt; As mentioned a few times in the stories, Miss Piggy had trouble paying her share to the joint travel card many times. She was regularly late, &amp;quot;forgot&amp;quot;, or &amp;quot;had to wait for transfers&amp;quot;. There was always an excuse, and she always had this vibe of defensiveness and frustration when we eventually forced her to pay her share. At the end of the trip, there was not enough money left on the card for Fozzie’s car to be serviced. She and I discussed it and decided it would be fair if both Miss Piggy and I paid her a final $100 each to assist the bill. Miss Piggy was so emotionally volatile that despite me having already paid my share, Fozzie had to make another group chat and ask both of us for the money, and have me message her back in it to say “oh yes absolutely here it is now, thanks again we couldn’t have done this trip without you this is the least we could do etc.” We were sitting next to each other on the couch while we did this. But Fozzie was concerned, justifiably, that if she had asked Miss Piggy privately that she would have been ignored or refused. She needed me to put the pressure on once again. And, of course, it took Miss Piggy a week’s worth of reminders to pay up. I am honestly shocked that she ended up paying her full 1/3 of the entire trip as I was expecting to have to cover her because of her attitude, and I attribute the success to Fozzie’s no-nonsense responsibility drive she has from being a teacher. But I know for a fact if we didn’t remind and harass Miss Piggy into paying, she would have happily lived off our backs and slept peacefully the entire time.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Car Damage:&lt;/strong&gt; If you recall from the first story, Fozzie’s car was brand new. It was her baby and she begged us to be as careful as possible with it. By the end of the trip, the area around Miss Piggy’s door was scratched to hell. I make a point of carrying things away from vehicles because I am clumsy as fuck, and I was paranoid about hurting the car, thereby making my best friend in this country sad or stressed. So I know it wasn’t me. And Fozzie wouldn’t ever do that to her own car, no way. But as usual, a certain someone was incapable of taking any kind of responsibility her her actions, so it is a “mystery” as to how those scratches occurred. On top of that, the back seat was &lt;em&gt;filthy.&lt;/em&gt; Old chocolate was ground into the seams of the leather, which was scuffed to hell, and there was first and sand and sticky stuff on every surface. Garbage all over the floor. Guess who cleaned it up? Not Miss Piggy, thats who. So much disrespect for other people’s property, even knowing how important it was, and benefiting incredibly from using it. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Snout Problems:&lt;/strong&gt; Miss Piggy could &lt;em&gt;not keep her disgusting hooves out of her fucking nose.&lt;/em&gt; Every second time I looked at her she was picking, snorting, digging around. She would blow her nose &lt;em&gt;into her hand&lt;/em&gt; and then refuse tissues when Fozzie offered them, clearly missing the point of “this is so you don’t get snot fingerprints on my precious car, please blow your nose into a goddam tissue.” We had to remind her several times to use tissues. Like a bloody toddler. And no, she still never washed her hands, not even after using nasty gas station toilets.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Friendship Envy:&lt;/strong&gt; Miss Piggy undoubtedly became a third wheel on this trip, and despite you all understanding why that is, we suspect she took a great deal of offence to it. Aside the fact that neither Fozzie nor I wanted to share a room (or, often the case, a bed) with her due to the snout digging that carried on into the night, Fozz and I were just closer and more comfortable with each other. We both hardly knew Miss Piggy, but we’d met on a tour in Europe and were roommates for 13 days sharing rooms and beds the entire time. It felt more normal for us to continue sharing those spaces with each other because we knew each other so well. Miss Piggy’s disgusting habits and awkward grouchy attitude solidified this and on the rare occasions we’d share with her, we were regretful. Miss Piggy had an opportunity from the start to get close to us, get to know us, connect with, and build a friendship. By all rights, she and I should have had the same kind of friendship at the end of the road trip as Fozzie and I had by the end of our Europe tour. But try as I might, she just didn’t seem interested, and never made an effort to befriend me or invest in her friendship with The Fozz. And despite making this choice for herself, even after all her second chances, she behaved as though we were shutting her out or trying to exclude her. She has no self awareness as a person.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Personal Info:&lt;/strong&gt; &lt;em&gt;If you are uncomfortable with talk about sexual assault, skip to the end of this post as separated by the line.&lt;/em&gt; Where I come from, and Fozzie as well, and all the people she and I know, the topic of sexual assault and rape is deeply painful, careful, and minimized unless it’s needed for support and healing. I know people who have been there. It’s a horrible, traumatizing experience that you don’t toss around in casual conversation. You don’t know what other people have been through, so you are careful with your words as a decent human being so you don’t make a victim uncomfortable or bring up memories they can’t deal with in that moment. Miss Piggy… I don’t even know how to find the right descriptors for this. I’ll just go ahead with it. Miss Piggy, by her admittance, was a victim of rape during her teenage years. She’s in her early/mid 20s now. This was sometime after the “doctors tried to make me anorexic because I was overweight” and at least a year or two before high school graduation. It’s an awful thing to have happened, and despite both Fozzie and I feeling discomforted by casual conversation about that kind of experience, we defaulted into listening mode because it’s assumed that when someone brings that up about themselves, they need to for healing and they need support. But Miss Piggy talked about it &lt;em&gt;a lot&lt;/em&gt; and the way she spoke about it almost seemed like she was bragging about it. It may have just been her vocabulary or mannerisms, but it made Fozzie and I extremely uncomfortable. Still, we didn’t deny her the freedom to divulge, because it very well could have been her way of healing, maybe normalizing the experience so she could better move on from it. And we can forgive that. We wanted her to feel safe and comfortable if that’s what she needed. What we couldn’t forgive, which we discussed later on when it was just Fozzie and I a few weeks after the trip, was that she seemed to use it to justify some kind of right to talk about &lt;em&gt;other&lt;/em&gt; people’s experiences. She’d tell us about other people being raped, like her cousin, or friends of hers. If I was a victim, I would &lt;em&gt;not&lt;/em&gt; be okay with someone blabbing about that fact to everyone they meet. I wouldn’t want to meet someone for the first time, and all them being able to think is “this person was raped,” while they’re shaking my hand. It’s invasive. And victims have suffered more than enough invasion &lt;em&gt;without&lt;/em&gt; personal gossip. And while I may never meet her cousin or friends, Fozzie HAS met one of those friends, and felt horrible about knowing she was a victim. She did not know this about the girl until Miss Piggy gossiped about it to us, which clearly means if she hadn’t told Fozzie herself then she didn’t want Fozzie to know. And here was Miss Piggy, spreading this stuff behind this girl’s back without her consent. I can’t even come up with the words to describe how disrespectful and carless this is to do to someone. If this wasn&amp;#39;t wholly anonymous, I wouldn&amp;#39;t even mention it to you guys. Even now I feel bad about it.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;So there you have it. That’s the end of Miss Piggy. &lt;/p&gt;\n\n&lt;p&gt;TL;DR: Miss Piggy is not a person worth meeting.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As promised, here is a small set of final thoughts and information on [Miss Piggy’s misadventures.](https://www.reddit.com/r/fatpeoplestories/comments/63511a/on_the_road_with_miss_piggy_1/)\n\nThis instalment won’t be in story form, but will be me telling you all about a few things that didn’t seem functional to the story. I like to keep these things honest, but also keep story flow, so tacking this stuff on the end is just the easiest way to go here. Thank you again, everyone, for your support. I have enjoyed entertaining you, and have enjoyed all the responses. You're a wonderful community.\n\n________\n\n\n**Payment:** As mentioned a few times in the stories, Miss Piggy had trouble paying her share to the joint travel card many times. She was regularly late, \"forgot\", or \"had to wait for transfers\". There was always an excuse, and she always had this vibe of defensiveness and frustration when we eventually forced her to pay her share. At the end of the trip, there was not enough money left on the card for Fozzie’s car to be serviced. She and I discussed it and decided it would be fair if both Miss Piggy and I paid her a final $100 each to assist the bill. Miss Piggy was so emotionally volatile that despite me having already paid my share, Fozzie had to make another group chat and ask both of us for the money, and have me message her back in it to say “oh yes absolutely here it is now, thanks again we couldn’t have done this trip without you this is the least we could do etc.” We were sitting next to each other on the couch while we did this. But Fozzie was concerned, justifiably, that if she had asked Miss Piggy privately that she would have been ignored or refused. She needed me to put the pressure on once again. And, of course, it took Miss Piggy a week’s worth of reminders to pay up. I am honestly shocked that she ended up paying her full 1/3 of the entire trip as I was expecting to have to cover her because of her attitude, and I attribute the success to Fozzie’s no-nonsense responsibility drive she has from being a teacher. But I know for a fact if we didn’t remind and harass Miss Piggy into paying, she would have happily lived off our backs and slept peacefully the entire time.\n\n\n**Car Damage:** If you recall from the first story, Fozzie’s car was brand new. It was her baby and she begged us to be as careful as possible with it. By the end of the trip, the area around Miss Piggy’s door was scratched to hell. I make a point of carrying things away from vehicles because I am clumsy as fuck, and I was paranoid about hurting the car, thereby making my best friend in this country sad or stressed. So I know it wasn’t me. And Fozzie wouldn’t ever do that to her own car, no way. But as usual, a certain someone was incapable of taking any kind of responsibility her her actions, so it is a “mystery” as to how those scratches occurred. On top of that, the back seat was *filthy.* Old chocolate was ground into the seams of the leather, which was scuffed to hell, and there was first and sand and sticky stuff on every surface. Garbage all over the floor. Guess who cleaned it up? Not Miss Piggy, thats who. So much disrespect for other people’s property, even knowing how important it was, and benefiting incredibly from using it. \n\n\n**Snout Problems:** Miss Piggy could *not keep her disgusting hooves out of her fucking nose.* Every second time I looked at her she was picking, snorting, digging around. She would blow her nose *into her hand* and then refuse tissues when Fozzie offered them, clearly missing the point of “this is so you don’t get snot fingerprints on my precious car, please blow your nose into a goddam tissue.” We had to remind her several times to use tissues. Like a bloody toddler. And no, she still never washed her hands, not even after using nasty gas station toilets.\n\n\n**Friendship Envy:** Miss Piggy undoubtedly became a third wheel on this trip, and despite you all understanding why that is, we suspect she took a great deal of offence to it. Aside the fact that neither Fozzie nor I wanted to share a room (or, often the case, a bed) with her due to the snout digging that carried on into the night, Fozz and I were just closer and more comfortable with each other. We both hardly knew Miss Piggy, but we’d met on a tour in Europe and were roommates for 13 days sharing rooms and beds the entire time. It felt more normal for us to continue sharing those spaces with each other because we knew each other so well. Miss Piggy’s disgusting habits and awkward grouchy attitude solidified this and on the rare occasions we’d share with her, we were regretful. Miss Piggy had an opportunity from the start to get close to us, get to know us, connect with, and build a friendship. By all rights, she and I should have had the same kind of friendship at the end of the road trip as Fozzie and I had by the end of our Europe tour. But try as I might, she just didn’t seem interested, and never made an effort to befriend me or invest in her friendship with The Fozz. And despite making this choice for herself, even after all her second chances, she behaved as though we were shutting her out or trying to exclude her. She has no self awareness as a person.\n\n\n**Personal Info:** *If you are uncomfortable with talk about sexual assault, skip to the end of this post as separated by the line.* Where I come from, and Fozzie as well, and all the people she and I know, the topic of sexual assault and rape is deeply painful, careful, and minimized unless it’s needed for support and healing. I know people who have been there. It’s a horrible, traumatizing experience that you don’t toss around in casual conversation. You don’t know what other people have been through, so you are careful with your words as a decent human being so you don’t make a victim uncomfortable or bring up memories they can’t deal with in that moment. Miss Piggy… I don’t even know how to find the right descriptors for this. I’ll just go ahead with it. Miss Piggy, by her admittance, was a victim of rape during her teenage years. She’s in her early/mid 20s now. This was sometime after the “doctors tried to make me anorexic because I was overweight” and at least a year or two before high school graduation. It’s an awful thing to have happened, and despite both Fozzie and I feeling discomforted by casual conversation about that kind of experience, we defaulted into listening mode because it’s assumed that when someone brings that up about themselves, they need to for healing and they need support. But Miss Piggy talked about it *a lot* and the way she spoke about it almost seemed like she was bragging about it. It may have just been her vocabulary or mannerisms, but it made Fozzie and I extremely uncomfortable. Still, we didn’t deny her the freedom to divulge, because it very well could have been her way of healing, maybe normalizing the experience so she could better move on from it. And we can forgive that. We wanted her to feel safe and comfortable if that’s what she needed. What we couldn’t forgive, which we discussed later on when it was just Fozzie and I a few weeks after the trip, was that she seemed to use it to justify some kind of right to talk about *other* people’s experiences. She’d tell us about other people being raped, like her cousin, or friends of hers. If I was a victim, I would *not* be okay with someone blabbing about that fact to everyone they meet. I wouldn’t want to meet someone for the first time, and all them being able to think is “this person was raped,” while they’re shaking my hand. It’s invasive. And victims have suffered more than enough invasion *without* personal gossip. And while I may never meet her cousin or friends, Fozzie HAS met one of those friends, and felt horrible about knowing she was a victim. She did not know this about the girl until Miss Piggy gossiped about it to us, which clearly means if she hadn’t told Fozzie herself then she didn’t want Fozzie to know. And here was Miss Piggy, spreading this stuff behind this girl’s back without her consent. I can’t even come up with the words to describe how disrespectful and carless this is to do to someone. If this wasn't wholly anonymous, I wouldn't even mention it to you guys. Even now I feel bad about it.\n\n________\n\nSo there you have it. That’s the end of Miss Piggy. \n\nTL;DR: Miss Piggy is not a person worth meeting.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Epic", "id": "64qz4f", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 287, "report_reasons": null, "author": "gonzo_likethewind", "saved": false, "mod_reports": [], "name": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "approved_by": null, "over_18": false, "domain": "self.fatpeoplestories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vzax", "edited": 1491919888.0, "link_flair_css_class": "epic", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/fatpeoplestories/comments/64qz4f/on_the_road_with_miss_piggy_final_thoughts/", "num_reports": null, "locked": false, "stickied": false, "created": 1491947984.0, "url": "https://www.reddit.com/r/fatpeoplestories/comments/64qz4f/on_the_road_with_miss_piggy_final_thoughts/", "author_flair_text": null, "quarantine": false, "title": "On the Road with Miss Piggy - Final Thoughts", "created_utc": 1491919184.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 50, "visited": false, "subreddit_type": "public", "ups": 287}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg5i0s7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "BoofahKingWho", "parent_id": "t1_dg5gt2v", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Indeed; sometimes *really*, **really** want to change.  I'm in my mid-40s and I'm still dealing with this shit.  *~sigh~*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Indeed; sometimes &lt;em&gt;really&lt;/em&gt;, &lt;strong&gt;really&lt;/strong&gt; want to change.  I&amp;#39;m in my mid-40s and I&amp;#39;m still dealing with this shit.  &lt;em&gt;~sigh~&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5i0s7", "score_hidden": false, "stickied": false, "created": 1492002148.0, "created_utc": 1491973348.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gt2v", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg5ce35", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I think you're probably right. No one is born an asshole, but luckily becoming an asshole can be reversible. It's one of those \"you have to want to change\" things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re probably right. No one is born an asshole, but luckily becoming an asshole can be reversible. It&amp;#39;s one of those &amp;quot;you have to want to change&amp;quot; things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5gt2v", "score_hidden": false, "stickied": false, "created": 1491999935.0, "created_utc": 1491971135.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ce35", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "BoofahKingWho", "parent_id": "t1_dg4f1m2", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I may be able to give some insight. By no means am I excusing bad behavior by Miss Piggy or anyone else, but I think I might have or have had some similar flaws growing up that linger in me still. \n\nI was raised very privileged. Whatever I wanted, I usually got. Both parents worked, we had a nanny/housekeeper and I went to private school. I never had to cook, clean or do my own laundry. While I learned manners and skills from my very smart, generous parents I was in many ways spoiled; comfort (including food), attention and praise were never lacking.\n\nThis made transition to adulthood quite a struggle. I wasn't used to work, I expected everything to come easy and I never really thought about how different it might be for others. Part of this manifested in a lack of empathy, consideration and gratitude towards others; on the flip side I was very defensive when anyone called me on my bad behavior -- and bitter when I didn't get what I felt should be mine. Essentially I was a Nice Guy, entitled neckbeard who flopped between feeling superior and feeling depressed &amp; angry when society didn't reward me for being my awesome self. I.e., my problems were everyone else's fault.\n\nIt's been a long road working through this. I have to remind myself to be aware, to be grateful and keep perspective. I need to be responsible and earn my successes -- and own my failures &amp; apologize when I wrong others.\n\n**TL;DR:** I think MP may struggle with stunted emotional development. For her sake and those who have to deal with her I hope she gets help. She's in for some kind of shitty life if she keeps on like she's doing. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I may be able to give some insight. By no means am I excusing bad behavior by Miss Piggy or anyone else, but I think I might have or have had some similar flaws growing up that linger in me still. &lt;/p&gt;\n\n&lt;p&gt;I was raised very privileged. Whatever I wanted, I usually got. Both parents worked, we had a nanny/housekeeper and I went to private school. I never had to cook, clean or do my own laundry. While I learned manners and skills from my very smart, generous parents I was in many ways spoiled; comfort (including food), attention and praise were never lacking.&lt;/p&gt;\n\n&lt;p&gt;This made transition to adulthood quite a struggle. I wasn&amp;#39;t used to work, I expected everything to come easy and I never really thought about how different it might be for others. Part of this manifested in a lack of empathy, consideration and gratitude towards others; on the flip side I was very defensive when anyone called me on my bad behavior -- and bitter when I didn&amp;#39;t get what I felt should be mine. Essentially I was a Nice Guy, entitled neckbeard who flopped between feeling superior and feeling depressed &amp;amp; angry when society didn&amp;#39;t reward me for being my awesome self. I.e., my problems were everyone else&amp;#39;s fault.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s been a long road working through this. I have to remind myself to be aware, to be grateful and keep perspective. I need to be responsible and earn my successes -- and own my failures &amp;amp; apologize when I wrong others.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; I think MP may struggle with stunted emotional development. For her sake and those who have to deal with her I hope she gets help. She&amp;#39;s in for some kind of shitty life if she keeps on like she&amp;#39;s doing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5ce35", "score_hidden": false, "stickied": false, "created": 1491993200.0, "created_utc": 1491964400.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4f1m2", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg4bqd3", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Thank you so much for the reply. I agree with every word. So many people are so entitled and I'll never be able to wrap my head around that mindset. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for the reply. I agree with every word. So many people are so entitled and I&amp;#39;ll never be able to wrap my head around that mindset. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4f1m2", "score_hidden": false, "stickied": false, "created": 1491953579.0, "created_utc": 1491924779.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4bqd3", "gilded": 0, "archived": false, "score": 50, "report_reasons": null, "author": "Quillemote", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I think your TL:DR sums it up nicely.\n\nI also think that every one of Piggy's offenses, towards herself and others, are because she simply doesn't think that she ought to be subject to the same laws of cause/effect/consequence as everyone else is.  Like she is literally something which is above all the everyday tedium of having to think about what comes next, about what happens to your body when you eat everything you want, about what happens to the car when you crash about heedlessly, about what happens in the minds of the people around you when you treat them like crap.  As if she genuinely believes that she shouldn't be required to introspect her actions because it is the rest of the world's responsibility to treat her as a princess no matter what.  Even to the point of freaking trucks and cars on the highway magically shifting themselves out of the way of where she wants her car to go.\n\nPeople with that sort of delusional entitled attitude are pissed off when the world tries to make them pay their way (physically, emotionally, financially, all of it).  She gets pissed off when you ask her for money she owes... when I owe someone I'm terribly embarassed until I've settled up, which I do as soon as I can.  Piggy's only mad that she's supposed to give something of hers to someone else, like they're being unreasonable to make the demand even after she's benefitted from what they give.  Piggy's angry whenever something happens that she should feel bad about, like hitting you with the car, so rather than feel personally responsible she projects that at volume anywhere else.\n\nHonestly, to me, I think your description of grocery trips with her was the most enlightening thing you wrote.  Because yeah, it is *only infants and toddlers* who expect that the people around them exist to make them happy without any effort/input from themselves, then get tantrum-shrieky and expect concessions when their minders fail to do exactly what they want.  Whoever's been spoiling Piggy all her life has ruined her for an adult existence where she recognizes consequence of her behaviour and takes responsibility for what comes from what she does.\n\nBut I am thrilled your Australia trip is fucking cool enough that one lone hamuppet can't take away the awesome.  :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your TL:DR sums it up nicely.&lt;/p&gt;\n\n&lt;p&gt;I also think that every one of Piggy&amp;#39;s offenses, towards herself and others, are because she simply doesn&amp;#39;t think that she ought to be subject to the same laws of cause/effect/consequence as everyone else is.  Like she is literally something which is above all the everyday tedium of having to think about what comes next, about what happens to your body when you eat everything you want, about what happens to the car when you crash about heedlessly, about what happens in the minds of the people around you when you treat them like crap.  As if she genuinely believes that she shouldn&amp;#39;t be required to introspect her actions because it is the rest of the world&amp;#39;s responsibility to treat her as a princess no matter what.  Even to the point of freaking trucks and cars on the highway magically shifting themselves out of the way of where she wants her car to go.&lt;/p&gt;\n\n&lt;p&gt;People with that sort of delusional entitled attitude are pissed off when the world tries to make them pay their way (physically, emotionally, financially, all of it).  She gets pissed off when you ask her for money she owes... when I owe someone I&amp;#39;m terribly embarassed until I&amp;#39;ve settled up, which I do as soon as I can.  Piggy&amp;#39;s only mad that she&amp;#39;s supposed to give something of hers to someone else, like they&amp;#39;re being unreasonable to make the demand even after she&amp;#39;s benefitted from what they give.  Piggy&amp;#39;s angry whenever something happens that she should feel bad about, like hitting you with the car, so rather than feel personally responsible she projects that at volume anywhere else.&lt;/p&gt;\n\n&lt;p&gt;Honestly, to me, I think your description of grocery trips with her was the most enlightening thing you wrote.  Because yeah, it is &lt;em&gt;only infants and toddlers&lt;/em&gt; who expect that the people around them exist to make them happy without any effort/input from themselves, then get tantrum-shrieky and expect concessions when their minders fail to do exactly what they want.  Whoever&amp;#39;s been spoiling Piggy all her life has ruined her for an adult existence where she recognizes consequence of her behaviour and takes responsibility for what comes from what she does.&lt;/p&gt;\n\n&lt;p&gt;But I am thrilled your Australia trip is fucking cool enough that one lone hamuppet can&amp;#39;t take away the awesome.  :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4bqd3", "score_hidden": false, "stickied": false, "created": 1491949799.0, "created_utc": 1491920999.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 50}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg563e3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ScarletDragonShitlor", "parent_id": "t1_dg4f6wa", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Hooray for connections!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hooray for connections!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg563e3", "score_hidden": false, "stickied": false, "created": 1491984878.0, "created_utc": 1491956078.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4f6wa", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg4ehvc", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Thankfully it's been fixed up well, and she's lucky as her dad is a car salesman and has his own tools to buff her paint job back into pristine condition. If he wasn't able to help though I would have happily chipped in again for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thankfully it&amp;#39;s been fixed up well, and she&amp;#39;s lucky as her dad is a car salesman and has his own tools to buff her paint job back into pristine condition. If he wasn&amp;#39;t able to help though I would have happily chipped in again for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4f6wa", "score_hidden": false, "stickied": false, "created": 1491953746.0, "created_utc": 1491924946.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ehvc", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "DarkEyedSaint", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "If there was a gofundme to help fix Fozzies car, I would chuck 20 bucks in it. Good goddamn... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If there was a gofundme to help fix Fozzies car, I would chuck 20 bucks in it. Good goddamn... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4ehvc", "score_hidden": false, "stickied": false, "created": 1491952974.0, "created_utc": 1491924174.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg4bnlg", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "domoniquelauren", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Miss Piggy is a piece of shit. Thank you for sharing your stories!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Miss Piggy is a piece of shit. Thank you for sharing your stories!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4bnlg", "score_hidden": false, "stickied": false, "created": 1491949706.0, "created_utc": 1491920906.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg4jdcr", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "spidermon", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I binged harder on this series than Miss Piggy did on her nose nuggets, you're an excellent storyteller! I hope you never meet someone like this again &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I binged harder on this series than Miss Piggy did on her nose nuggets, you&amp;#39;re an excellent storyteller! I hope you never meet someone like this again &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4jdcr", "score_hidden": false, "stickied": false, "created": 1491958324.0, "created_utc": 1491929524.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg4ac1f", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Type_II_Bot", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "\nOther stories from /u/gonzo_likethewind:\n\n* 04/11/2017 - [On the Road with Miss Piggy - Final Thoughts](http://www.reddit.com/r/fatpeoplestories/comments/64qz4f/on_the_road_with_miss_piggy_final_thoughts/) (this)\n\n* 04/08/2017 - [On the Road with Miss Piggy - 6](http://www.reddit.com/r/fatpeoplestories/comments/644phv/on_the_road_with_miss_piggy_6/)\n\n* 04/05/2017 - [On the Road with Miss Piggy - 5](http://www.reddit.com/r/fatpeoplestories/comments/63k4a5/on_the_road_with_miss_piggy_5/)\n\n* 04/04/2017 - [On the Road with Miss Piggy - 4](http://www.reddit.com/r/fatpeoplestories/comments/63cvkq/on_the_road_with_miss_piggy_4/)\n\n* 04/04/2017 - [On the Road with Miss Piggy - 3](http://www.reddit.com/r/fatpeoplestories/comments/63bllw/on_the_road_with_miss_piggy_3/)\n\n* 04/03/2017 - [On the Road with Miss Piggy - 2](http://www.reddit.com/r/fatpeoplestories/comments/635m4f/on_the_road_with_miss_piggy_2/)\n\n* 04/03/2017 - [On the Road with Miss Piggy - 1](http://www.reddit.com/r/fatpeoplestories/comments/63511a/on_the_road_with_miss_piggy_1/)\n\n_____\n^If ^you ^want ^to ^get ^notified ^as ^soon ^as ^gonzo_likethewind ^posts ^a ^new ^story, [^click ^here](http://www.reddit.com/message/compose/?to=Type_II_Bot&amp;subject=subscribe&amp;message=subscribe%20/u/gonzo_likethewind)^.\n\n^(Hi I'm Type_II_Bot, for more info about me visit /r/Type_II_Bot)\n\n^Find ^this ^bot ^helpful? ^Consider ^donating [^$1](https://www.paypal.me/r3d4rmy/1)^, [^$5](https://www.paypal.me/r3d4rmy/5)^, ^or ^with ^BTC: ^1FEjYZAeUvY6zEx4x3SShxMwCZcqSHfNoH", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Other stories from &lt;a href=\"/u/gonzo_likethewind\"&gt;/u/gonzo_likethewind&lt;/a&gt;:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;04/11/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/64qz4f/on_the_road_with_miss_piggy_final_thoughts/\"&gt;On the Road with Miss Piggy - Final Thoughts&lt;/a&gt; (this)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/08/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/644phv/on_the_road_with_miss_piggy_6/\"&gt;On the Road with Miss Piggy - 6&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/05/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/63k4a5/on_the_road_with_miss_piggy_5/\"&gt;On the Road with Miss Piggy - 5&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/04/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/63cvkq/on_the_road_with_miss_piggy_4/\"&gt;On the Road with Miss Piggy - 4&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/04/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/63bllw/on_the_road_with_miss_piggy_3/\"&gt;On the Road with Miss Piggy - 3&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/03/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/635m4f/on_the_road_with_miss_piggy_2/\"&gt;On the Road with Miss Piggy - 2&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/03/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/63511a/on_the_road_with_miss_piggy_1/\"&gt;On the Road with Miss Piggy - 1&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;If&lt;/sup&gt; &lt;sup&gt;you&lt;/sup&gt; &lt;sup&gt;want&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;get&lt;/sup&gt; &lt;sup&gt;notified&lt;/sup&gt; &lt;sup&gt;as&lt;/sup&gt; &lt;sup&gt;soon&lt;/sup&gt; &lt;sup&gt;as&lt;/sup&gt; &lt;sup&gt;gonzo_likethewind&lt;/sup&gt; &lt;sup&gt;posts&lt;/sup&gt; &lt;sup&gt;a&lt;/sup&gt; &lt;sup&gt;new&lt;/sup&gt; &lt;sup&gt;story,&lt;/sup&gt; &lt;a href=\"http://www.reddit.com/message/compose/?to=Type_II_Bot&amp;amp;subject=subscribe&amp;amp;message=subscribe%20/u/gonzo_likethewind\"&gt;&lt;sup&gt;click&lt;/sup&gt; &lt;sup&gt;here&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;.&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;Hi I&amp;#39;m Type_II_Bot, for more info about me visit &lt;a href=\"/r/Type_II_Bot\"&gt;/r/Type_II_Bot&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;Find&lt;/sup&gt; &lt;sup&gt;this&lt;/sup&gt; &lt;sup&gt;bot&lt;/sup&gt; &lt;sup&gt;helpful?&lt;/sup&gt; &lt;sup&gt;Consider&lt;/sup&gt; &lt;sup&gt;donating&lt;/sup&gt; &lt;a href=\"https://www.paypal.me/r3d4rmy/1\"&gt;&lt;sup&gt;$1&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;,&lt;/sup&gt; &lt;a href=\"https://www.paypal.me/r3d4rmy/5\"&gt;&lt;sup&gt;$5&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;,&lt;/sup&gt; &lt;sup&gt;or&lt;/sup&gt; &lt;sup&gt;with&lt;/sup&gt; &lt;sup&gt;BTC:&lt;/sup&gt; &lt;sup&gt;1FEjYZAeUvY6zEx4x3SShxMwCZcqSHfNoH&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4ac1f", "score_hidden": false, "stickied": false, "created": 1491948050.0, "created_utc": 1491919250.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg4q46b", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "moorddroom", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "She is an awful and cruel beast.. would have still contacted her parents for payment on fixing the car, if not pain and suffering.\n\nWhy any person would sign themselves up for this kind of journey only to be a dead selfish worthless slob is beyond me. Unless Miss Make Shit Up Piggy is planning a book. She can be the cuuuuurvy hero of her own creation.\n\nQuick, to amazon ebooks and weird livejournal or blog sites.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She is an awful and cruel beast.. would have still contacted her parents for payment on fixing the car, if not pain and suffering.&lt;/p&gt;\n\n&lt;p&gt;Why any person would sign themselves up for this kind of journey only to be a dead selfish worthless slob is beyond me. Unless Miss Make Shit Up Piggy is planning a book. She can be the cuuuuurvy hero of her own creation.&lt;/p&gt;\n\n&lt;p&gt;Quick, to amazon ebooks and weird livejournal or blog sites.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4q46b", "score_hidden": false, "stickied": false, "created": 1491965683.0, "created_utc": 1491936883.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg4c4qg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "angel_fatale", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I'm so sorry you had to deal with Miss Piggy, but I've enjoyed reading your stories!\n\nThank you for sharing. &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry you had to deal with Miss Piggy, but I&amp;#39;ve enjoyed reading your stories!&lt;/p&gt;\n\n&lt;p&gt;Thank you for sharing. &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4c4qg", "score_hidden": false, "stickied": false, "created": 1491950279.0, "created_utc": 1491921479.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg5m709", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg4gjmx", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I thought about you and chuckled like an absolute twit with the \"me\" shit. Hehehe.\n\nAnd yeah, I'll never know how to be okay with her behaviours on that note. I don't think it's possible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought about you and chuckled like an absolute twit with the &amp;quot;me&amp;quot; shit. Hehehe.&lt;/p&gt;\n\n&lt;p&gt;And yeah, I&amp;#39;ll never know how to be okay with her behaviours on that note. I don&amp;#39;t think it&amp;#39;s possible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5m709", "score_hidden": false, "stickied": false, "created": 1492011989.0, "created_utc": 1491983189.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4gjmx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mattricide", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "ugh that last personal info part had i cringing so hard. mostly from her demeanor but your refusal to use 'me and'/'and me' added some slight jimmy rustlage.\n\ntreating sexual assault so nonchalantly only serves to diminish the impact it has on its victims. not cool. me would not be surprised if her attitude in which shes boasting about it was some kind of fucked up power play to impose victim status upon you and the fozz. hell, she could have exaggerated the account or even completely made it up.", "edited": 1491926669.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ugh that last personal info part had i cringing so hard. mostly from her demeanor but your refusal to use &amp;#39;me and&amp;#39;/&amp;#39;and me&amp;#39; added some slight jimmy rustlage.&lt;/p&gt;\n\n&lt;p&gt;treating sexual assault so nonchalantly only serves to diminish the impact it has on its victims. not cool. me would not be surprised if her attitude in which shes boasting about it was some kind of fucked up power play to impose victim status upon you and the fozz. hell, she could have exaggerated the account or even completely made it up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4gjmx", "score_hidden": false, "stickied": false, "created": 1491955238.0, "created_utc": 1491926438.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg4obnt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Burtonish", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "All of this honestly made me a bit angry on your behalf, but the last one blew the lid off the pot. This is everything but okay and I really hope that she will one day find it in her heart to have empathy for others. I'm glad you and Fozzie were still able to enjoy the trip though!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All of this honestly made me a bit angry on your behalf, but the last one blew the lid off the pot. This is everything but okay and I really hope that she will one day find it in her heart to have empathy for others. I&amp;#39;m glad you and Fozzie were still able to enjoy the trip though!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4obnt", "score_hidden": false, "stickied": false, "created": 1491963755.0, "created_utc": 1491934955.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg4ra3y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ladymiku", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Good riddance to that awful wench!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good riddance to that awful wench!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4ra3y", "score_hidden": false, "stickied": false, "created": 1491966907.0, "created_utc": 1491938107.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg55rmv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mumboju", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I am sad to see this thread end. It may sound a bit insensitive, but I thoroughly enjoyed reading it ;) You writing's incredible. Cheers to surviving the pig and living to tell the tale!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sad to see this thread end. It may sound a bit insensitive, but I thoroughly enjoyed reading it ;) You writing&amp;#39;s incredible. Cheers to surviving the pig and living to tell the tale!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg55rmv", "score_hidden": false, "stickied": false, "created": 1491984455.0, "created_utc": 1491955655.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg5gre0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg5g8a8", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Not too terrible, luckily my condition despite being progressive, well, it hasn't really progressed. I have limits, but I don't have to live in fear, and I consider myself very fortunate for that!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not too terrible, luckily my condition despite being progressive, well, it hasn&amp;#39;t really progressed. I have limits, but I don&amp;#39;t have to live in fear, and I consider myself very fortunate for that!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5gre0", "score_hidden": false, "stickied": false, "created": 1491999853.0, "created_utc": 1491971053.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5g8a8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bacchus5000", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "First off thanks for sharing this story. I was pissed off for you and your friend the entire time. I'm surprised you didn't add make your body release adrenaline to the list of offenses when she almost killed you guys. I would imagine that adrenaline, given your condition could be undesirable since it increases heart rate and blood pressure. I don't know much about your condition, but how deadly could a spike of adrenaline from something traumatic be?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First off thanks for sharing this story. I was pissed off for you and your friend the entire time. I&amp;#39;m surprised you didn&amp;#39;t add make your body release adrenaline to the list of offenses when she almost killed you guys. I would imagine that adrenaline, given your condition could be undesirable since it increases heart rate and blood pressure. I don&amp;#39;t know much about your condition, but how deadly could a spike of adrenaline from something traumatic be?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5g8a8", "score_hidden": false, "stickied": false, "created": 1491998942.0, "created_utc": 1491970142.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg5rhi4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "_LuckyDucky_", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Your explanation of rape and disclosure is so respectful, caring and kind. You're an awesome person I'd be very honoured to have as a friend or family member. Thanks for sharing Miss Piggy tails with us :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your explanation of rape and disclosure is so respectful, caring and kind. You&amp;#39;re an awesome person I&amp;#39;d be very honoured to have as a friend or family member. Thanks for sharing Miss Piggy tails with us :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5rhi4", "score_hidden": false, "stickied": false, "created": 1492027016.0, "created_utc": 1491998216.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dgc0f7z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg81b6a", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Haha awesome!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha awesome!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgc0f7z", "score_hidden": false, "stickied": false, "created": 1492377233.0, "created_utc": 1492348433.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81b6a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "titebuthoal", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Thank you for relaying these astounding tales of the fupa down under, my girlfriend really enjoys reading them but can't always find the time so I made her a book on tape of your daring exploits, thank you for all you've done, you're a credit to the force", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for relaying these astounding tales of the fupa down under, my girlfriend really enjoys reading them but can&amp;#39;t always find the time so I made her a book on tape of your daring exploits, thank you for all you&amp;#39;ve done, you&amp;#39;re a credit to the force&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg81b6a", "score_hidden": false, "stickied": false, "created": 1492138775.0, "created_utc": 1492109975.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg4q6y0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thatswhatpamsaid", "parent_id": "t1_dg4pe49", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Oh I agree completely, but I feel that a big issue shouldn't be the word \"bossy\" being assumed as having a gender bias, I feel that a lot of teachers simply don't use the correct vocabulary. When I was younger I was called bossy by a lot of my teachers around ages 5-7 and I was bossy in the worst way. To put it bluntly, I was a brat and needed to have that attitude readjustment. I think that instead of replacing \"bossy\" with \"leadership\" we should simply get rid of the use of the word and use a better, more descriptive word in its place. If you're referring to someone as bossy with negative connotations attached, a much better word would be \"aggressive\" and then explain the ways in which that child acts aggressively and attempt to fix the issue. Because regardless, there is a huge issue with parents taking such offense to someone saying their kid could be having a behavior issue that negatively impacts them later on that they simply blame everyone else but don't teach their child about better personality traits. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh I agree completely, but I feel that a big issue shouldn&amp;#39;t be the word &amp;quot;bossy&amp;quot; being assumed as having a gender bias, I feel that a lot of teachers simply don&amp;#39;t use the correct vocabulary. When I was younger I was called bossy by a lot of my teachers around ages 5-7 and I was bossy in the worst way. To put it bluntly, I was a brat and needed to have that attitude readjustment. I think that instead of replacing &amp;quot;bossy&amp;quot; with &amp;quot;leadership&amp;quot; we should simply get rid of the use of the word and use a better, more descriptive word in its place. If you&amp;#39;re referring to someone as bossy with negative connotations attached, a much better word would be &amp;quot;aggressive&amp;quot; and then explain the ways in which that child acts aggressively and attempt to fix the issue. Because regardless, there is a huge issue with parents taking such offense to someone saying their kid could be having a behavior issue that negatively impacts them later on that they simply blame everyone else but don&amp;#39;t teach their child about better personality traits. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4q6y0", "score_hidden": false, "stickied": false, "created": 1491965763.0, "created_utc": 1491936963.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4pe49", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "udolipixiegal", "parent_id": "t1_dg4iils", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "&gt; hey even stopped calling girls \"bossy\" in schools because apparently \"boys never get called bossy, instead girls should be told they have leadership skills\". \n\nMeh this seems to have some merit. I recall studies where the same behaviors that were called leadership material in guys where called bossy, controlling, bitchy, pushy, too aggressive in gals. And it's not about the display because it was a 'report' of the person's behavior. They give a resume and ask others to evaluate the person so all that changed was the presumed gender of the name on the report. It's like the studies on race bias when an application that was touted suddenly gets in the waiting pile because of an ethnic (?) name.\n\nThere is a gender bias. The same behavior may not be given the same merit in the genders. A gal can be 'emotional and cry' with no to little issue while a guy will likely see as a punk, pussy, weakling etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;hey even stopped calling girls &amp;quot;bossy&amp;quot; in schools because apparently &amp;quot;boys never get called bossy, instead girls should be told they have leadership skills&amp;quot;. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Meh this seems to have some merit. I recall studies where the same behaviors that were called leadership material in guys where called bossy, controlling, bitchy, pushy, too aggressive in gals. And it&amp;#39;s not about the display because it was a &amp;#39;report&amp;#39; of the person&amp;#39;s behavior. They give a resume and ask others to evaluate the person so all that changed was the presumed gender of the name on the report. It&amp;#39;s like the studies on race bias when an application that was touted suddenly gets in the waiting pile because of an ethnic (?) name.&lt;/p&gt;\n\n&lt;p&gt;There is a gender bias. The same behavior may not be given the same merit in the genders. A gal can be &amp;#39;emotional and cry&amp;#39; with no to little issue while a guy will likely see as a punk, pussy, weakling etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4pe49", "score_hidden": false, "stickied": false, "created": 1491964923.0, "created_utc": 1491936123.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg661gb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thatswhatpamsaid", "parent_id": "t1_dg622q7", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Well thats all you can do, and there's a difference between ignorant and oblivious. Miss Piggy wasn't ignorant of her actions, she was completely oblivious. Most people who are ignorant of their actions and how they're perceived by others can generally be clued into that. Plus, it's not fair to just assume something about someone. I've come off much more bitchy and callous than I am at times, we all have bad days and I wouldn't want someone judging the entirety of my personality off of one bad day. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well thats all you can do, and there&amp;#39;s a difference between ignorant and oblivious. Miss Piggy wasn&amp;#39;t ignorant of her actions, she was completely oblivious. Most people who are ignorant of their actions and how they&amp;#39;re perceived by others can generally be clued into that. Plus, it&amp;#39;s not fair to just assume something about someone. I&amp;#39;ve come off much more bitchy and callous than I am at times, we all have bad days and I wouldn&amp;#39;t want someone judging the entirety of my personality off of one bad day. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg661gb", "score_hidden": false, "stickied": false, "created": 1492045345.0, "created_utc": 1492016545.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg622q7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg5qhoz", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Very true. And I tend to give people the benefit of the doubt when I first meet them. You're more than who you're associated with and I think people deserve a chance to give their own first impression.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very true. And I tend to give people the benefit of the doubt when I first meet them. You&amp;#39;re more than who you&amp;#39;re associated with and I think people deserve a chance to give their own first impression.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg622q7", "score_hidden": false, "stickied": false, "created": 1492041173.0, "created_utc": 1492012373.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qhoz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thatswhatpamsaid", "parent_id": "t1_dg5m6zd", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Well and given how polarizing our politics can be, it's not all that surprising. Still, it does kind of suck. I think a major part of it is that some Americans just honestly don't see in what way(s) they're being rude. Part of that is parents not teaching children to see things from another's perspective and part of it is people being ignorant in regards to how their actions come off to others. \n\nBut at least you have people you know who don't back up a negative stereotype. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well and given how polarizing our politics can be, it&amp;#39;s not all that surprising. Still, it does kind of suck. I think a major part of it is that some Americans just honestly don&amp;#39;t see in what way(s) they&amp;#39;re being rude. Part of that is parents not teaching children to see things from another&amp;#39;s perspective and part of it is people being ignorant in regards to how their actions come off to others. &lt;/p&gt;\n\n&lt;p&gt;But at least you have people you know who don&amp;#39;t back up a negative stereotype. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5qhoz", "score_hidden": false, "stickied": false, "created": 1492024825.0, "created_utc": 1491996025.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5m6zd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg4iils", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "&gt;They even stopped calling girls \"bossy\" in schools because apparently \"boys never get called bossy, instead girls should be told they have leadership skills\".\n\nThere's actually a lot of credence to this, it's not a roundabout way of saying they're a bossy cunt. It is an actual issue.\n\nBut the rest of it, I agree with. Especially the entitlement mentality for getting rewarded just for showing up. Makes kids think they don't have to work for what they want. \n\nLuckily I have enough good, kind, smart American friends to know you're not all like this. It's just a shame that the ones who are give the good guys such a bad name.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;They even stopped calling girls &amp;quot;bossy&amp;quot; in schools because apparently &amp;quot;boys never get called bossy, instead girls should be told they have leadership skills&amp;quot;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There&amp;#39;s actually a lot of credence to this, it&amp;#39;s not a roundabout way of saying they&amp;#39;re a bossy cunt. It is an actual issue.&lt;/p&gt;\n\n&lt;p&gt;But the rest of it, I agree with. Especially the entitlement mentality for getting rewarded just for showing up. Makes kids think they don&amp;#39;t have to work for what they want. &lt;/p&gt;\n\n&lt;p&gt;Luckily I have enough good, kind, smart American friends to know you&amp;#39;re not all like this. It&amp;#39;s just a shame that the ones who are give the good guys such a bad name.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5m6zd", "score_hidden": false, "stickied": false, "created": 1492011987.0, "created_utc": 1491983187.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg5p4ba", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Quillemote", "parent_id": "t1_dg4iils", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Ha!  I got a report sent home when I was 4yrs old saying I had \"leadership skills\", after I bit some boy in the sandbox for refusing to share the blocks.  At the time, more than thirty years ago, my parents were surprised because leadership comments rarely went to little girls.  Fortunately I grew up to *usually* pull out the bossy-cunt trait only when there's a decent reason for it.", "edited": 1491992491.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ha!  I got a report sent home when I was 4yrs old saying I had &amp;quot;leadership skills&amp;quot;, after I bit some boy in the sandbox for refusing to share the blocks.  At the time, more than thirty years ago, my parents were surprised because leadership comments rarely went to little girls.  Fortunately I grew up to &lt;em&gt;usually&lt;/em&gt; pull out the bossy-cunt trait only when there&amp;#39;s a decent reason for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5p4ba", "score_hidden": false, "stickied": false, "created": 1492021069.0, "created_utc": 1491992269.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg7jux9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg74sbt", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Tasmania is on the list for sure!!! Gonna find me a platypus. Or a shark.\n\nWhat would you do in Iceland? Fiji is my next trip but I want to do Iceland after that, only I haven't done any research yet since it's a few years off. I'm looking for ideas!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tasmania is on the list for sure!!! Gonna find me a platypus. Or a shark.&lt;/p&gt;\n\n&lt;p&gt;What would you do in Iceland? Fiji is my next trip but I want to do Iceland after that, only I haven&amp;#39;t done any research yet since it&amp;#39;s a few years off. I&amp;#39;m looking for ideas!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg7jux9", "score_hidden": false, "stickied": false, "created": 1492119593.0, "created_utc": 1492090793.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg7tw9g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BarbieDreamZombie", "parent_id": "t1_dg74sbt", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "IcelandAir does free stopovers, so you could go there on your way to another country too! Hanging out in Germany was a lot cheaper than I expected.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IcelandAir does free stopovers, so you could go there on your way to another country too! Hanging out in Germany was a lot cheaper than I expected.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg7tw9g", "score_hidden": false, "stickied": false, "created": 1492130888.0, "created_utc": 1492102088.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg74sbt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AxlotlRose", "parent_id": "t1_dg4iils", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I would love to have someone in a foreign land be a tour guide and friend and bar buddy. What a waste for MP to not enjoy the unique culture of a place on the other side of the g.d. planet! And what's with the seemingly large supply of American beetus food they always bring with. Reminds me if the Chibi formerly Chibiham stories. \n\nI would have loved to be in that seedy bar for the scene of locals and maybe even check out the rock. And just.... Auatralia! And Tasmania next Gonzo! Awesome! My first dream trip I might be able to afford would be Iceland. I'm on the northeast coast area so its just crossing the pond basically.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would love to have someone in a foreign land be a tour guide and friend and bar buddy. What a waste for MP to not enjoy the unique culture of a place on the other side of the g.d. planet! And what&amp;#39;s with the seemingly large supply of American beetus food they always bring with. Reminds me if the Chibi formerly Chibiham stories. &lt;/p&gt;\n\n&lt;p&gt;I would have loved to be in that seedy bar for the scene of locals and maybe even check out the rock. And just.... Auatralia! And Tasmania next Gonzo! Awesome! My first dream trip I might be able to afford would be Iceland. I&amp;#39;m on the northeast coast area so its just crossing the pond basically.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg74sbt", "score_hidden": false, "stickied": false, "created": 1492085930.0, "created_utc": 1492057130.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg6cbu5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thatswhatpamsaid", "parent_id": "t1_dg67bk5", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Yeah, people who are ugly inside will always be ugly inside if the only thing they change is how they look outside. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, people who are ugly inside will always be ugly inside if the only thing they change is how they look outside. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6cbu5", "score_hidden": false, "stickied": false, "created": 1492051723.0, "created_utc": 1492022923.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67bk5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "I_Am_Not_Me_", "parent_id": "t1_dg4iils", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Yeh. I knew a girl who was fat and was extremely self conscious about it. She would cry over it. Then she lost weight, to her credit with hard work. BUT, she became a fat shaming asshole because she was no longer in the same lot. Not like FatShamingTM, but like actively calling fat girls gross and shit. Cunts are cunts. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeh. I knew a girl who was fat and was extremely self conscious about it. She would cry over it. Then she lost weight, to her credit with hard work. BUT, she became a fat shaming asshole because she was no longer in the same lot. Not like FatShamingTM, but like actively calling fat girls gross and shit. Cunts are cunts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg67bk5", "score_hidden": false, "stickied": false, "created": 1492046637.0, "created_utc": 1492017837.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4iils", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "thatswhatpamsaid", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Honestly, if Miss Piggy is fat or not she will always be a cunt. \nIf she was the most beautiful woman in the world or the ugliest one, she will always be a cunt. \nShe is simply the type of person that is a complete cunt yet expects to be treated as a superior. She takes notice of everyone's actions and mannerisms, yet her excuse for her and own mannerisms and actions is related to \"condishuns.\" She is simply a product of a messed up America and as an American I can attest to this. When I was in elementary school, I won my school's science fair and that felt great. What didn't feel great was everyone who entered got a medal and a certificate, making my achievements seem unimportant. They even stopped calling girls \"bossy\" in schools because apparently \"boys never get called bossy, instead girls should be told they have leadership skills\". Which is just a roundabout way of saying your kid is a controlling cunt. That is the culture Miss Piggy was raised in and her parents likely even contributed that to it. \nThis showed her two things:\n1) She will not be held accountable for her actions (positive or negative).\n2) Regardless of her actions (positive or negative) there won't be any consequences. \n\nI'm sorry you had to deal with that and I hope it didn't sour your opinions on Americans, I promise we're not all like that. But, I do have to say quite a few of Americans are. I just hope the next time you meet an American, your experience is a more positive one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, if Miss Piggy is fat or not she will always be a cunt. \nIf she was the most beautiful woman in the world or the ugliest one, she will always be a cunt. \nShe is simply the type of person that is a complete cunt yet expects to be treated as a superior. She takes notice of everyone&amp;#39;s actions and mannerisms, yet her excuse for her and own mannerisms and actions is related to &amp;quot;condishuns.&amp;quot; She is simply a product of a messed up America and as an American I can attest to this. When I was in elementary school, I won my school&amp;#39;s science fair and that felt great. What didn&amp;#39;t feel great was everyone who entered got a medal and a certificate, making my achievements seem unimportant. They even stopped calling girls &amp;quot;bossy&amp;quot; in schools because apparently &amp;quot;boys never get called bossy, instead girls should be told they have leadership skills&amp;quot;. Which is just a roundabout way of saying your kid is a controlling cunt. That is the culture Miss Piggy was raised in and her parents likely even contributed that to it. \nThis showed her two things:\n1) She will not be held accountable for her actions (positive or negative).\n2) Regardless of her actions (positive or negative) there won&amp;#39;t be any consequences. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry you had to deal with that and I hope it didn&amp;#39;t sour your opinions on Americans, I promise we&amp;#39;re not all like that. But, I do have to say quite a few of Americans are. I just hope the next time you meet an American, your experience is a more positive one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4iils", "score_hidden": false, "stickied": false, "created": 1491957397.0, "created_utc": 1491928597.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg7jptf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg74jvq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Travellers checks are pretty much extinct by now, no one takes them these days so I wouldn't bother. If you can use your debit like a credit card it *should* be okay but I recommend talking to the bank themselves to double check. Cash to exchange is good but keep cash stored in several areas, locked away, hidden, close to your body etc. until you have a safe place to put it all. \n\nYou can also look into getting a rechargeable travel card. It acts like a credit card but you put money on it for spending instead. They're less likely to be locked by the bank and they work with most interac services in my experience.\n\nI've had cards locked, damaged, and compromised during my travels and i travel with a visa, a mastercard, a debit card for one bank and another from a different bank. I keep one debit and one credit card stored separate from the others in case my wallet is lost or stolen. I am super over anal about this stuff, but I have needed spare cards in the past. \n\nMy number one advice is to avoid using Euronet atms with foreign cards. I've had money removed from my account but not deposited through the machine in both Hungary ($700+) and Greece (€250) and I know a few others who have had the same problem. Most other atms should be fine but try to avoid those guys! The card I used was also shut down from my bank's end because it was red flag activity so having spare cards was a life saver.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Travellers checks are pretty much extinct by now, no one takes them these days so I wouldn&amp;#39;t bother. If you can use your debit like a credit card it &lt;em&gt;should&lt;/em&gt; be okay but I recommend talking to the bank themselves to double check. Cash to exchange is good but keep cash stored in several areas, locked away, hidden, close to your body etc. until you have a safe place to put it all. &lt;/p&gt;\n\n&lt;p&gt;You can also look into getting a rechargeable travel card. It acts like a credit card but you put money on it for spending instead. They&amp;#39;re less likely to be locked by the bank and they work with most interac services in my experience.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had cards locked, damaged, and compromised during my travels and i travel with a visa, a mastercard, a debit card for one bank and another from a different bank. I keep one debit and one credit card stored separate from the others in case my wallet is lost or stolen. I am super over anal about this stuff, but I have needed spare cards in the past. &lt;/p&gt;\n\n&lt;p&gt;My number one advice is to avoid using Euronet atms with foreign cards. I&amp;#39;ve had money removed from my account but not deposited through the machine in both Hungary ($700+) and Greece (€250) and I know a few others who have had the same problem. Most other atms should be fine but try to avoid those guys! The card I used was also shut down from my bank&amp;#39;s end because it was red flag activity so having spare cards was a life saver.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg7jptf", "score_hidden": false, "stickied": false, "created": 1492119405.0, "created_utc": 1492090605.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg7jxx8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg74jvq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Where in Italy btw? If you don't mind me asking. Italy was great, I did Florence, Rome, and Venice and ate so much gelato I would have turned into Miss Piggy had I not sweat out half my bodyweight in that Italian June sun. They have the best cured meats ever, I swear", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where in Italy btw? If you don&amp;#39;t mind me asking. Italy was great, I did Florence, Rome, and Venice and ate so much gelato I would have turned into Miss Piggy had I not sweat out half my bodyweight in that Italian June sun. They have the best cured meats ever, I swear&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg7jxx8", "score_hidden": false, "stickied": false, "created": 1492119703.0, "created_utc": 1492090903.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg74jvq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AxlotlRose", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Question for the OP: \nI'm from the US and juuuuust got my passport. You mention youvtraveled in Europe and I have an opportunity to do a houseguest situation in Italy later this year. My question is that I don't have a credit card but a bank card/master card type deal thru my bank. Will that suffice for most things or should I invest in travelers checks or bring cash and exchange? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Question for the OP: \nI&amp;#39;m from the US and juuuuust got my passport. You mention youvtraveled in Europe and I have an opportunity to do a houseguest situation in Italy later this year. My question is that I don&amp;#39;t have a credit card but a bank card/master card type deal thru my bank. Will that suffice for most things or should I invest in travelers checks or bring cash and exchange? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg74jvq", "score_hidden": false, "stickied": false, "created": 1492085572.0, "created_utc": 1492056772.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg5m9xr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg4yf4c", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "She was fat before it happened, she admitted that herself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She was fat before it happened, she admitted that herself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5m9xr", "score_hidden": false, "stickied": false, "created": 1492012233.0, "created_utc": 1491983433.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4yf4c", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "bejeweledlyoness", "parent_id": "t1_dg4pdq8", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I'm just saying about her weight; the rest of it is on her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m just saying about her weight; the rest of it is on her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4yf4c", "score_hidden": false, "stickied": false, "created": 1491974922.0, "created_utc": 1491946122.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg5ruyj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kaitco", "parent_id": "t1_dg5ke9c", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Hm...I could see that, though part of me looks at something like that as very ingrained, automatic activity. Still, different victims react in very different ways.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hm...I could see that, though part of me looks at something like that as very ingrained, automatic activity. Still, different victims react in very different ways.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5ruyj", "score_hidden": false, "stickied": false, "created": 1492027766.0, "created_utc": 1491998966.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ke9c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "An_Autistic_Thought", "parent_id": "t1_dg4pdq8", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Not to excuse her behavior, but not washing her hands could be part of the subconscious desire to be gross/disgusting so she won't be victimized again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not to excuse her behavior, but not washing her hands could be part of the subconscious desire to be gross/disgusting so she won&amp;#39;t be victimized again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5ke9c", "score_hidden": false, "stickied": false, "created": 1492007191.0, "created_utc": 1491978391.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4pdq8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "kaitco", "parent_id": "t1_dg4it53", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "How does not washing her hands after using the restroom factor into this?\n\nI'm not trying to discount the assault, but she's got some mannerisms that appear to be deeply-entrenched personality flaws rather than a way of dissociating from what happened to her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How does not washing her hands after using the restroom factor into this?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not trying to discount the assault, but she&amp;#39;s got some mannerisms that appear to be deeply-entrenched personality flaws rather than a way of dissociating from what happened to her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4pdq8", "score_hidden": false, "stickied": false, "created": 1491964911.0, "created_utc": 1491936111.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg5m6y9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg4it53", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I thought about that as well, but according to her own timeline she was badly overweight before it happened. Might help explain her moodiness, but even then, it's hard to know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought about that as well, but according to her own timeline she was badly overweight before it happened. Might help explain her moodiness, but even then, it&amp;#39;s hard to know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5m6y9", "score_hidden": false, "stickied": false, "created": 1492011984.0, "created_utc": 1491983184.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg5m6yl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg4it53", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I thought about that as well, but according to her own timeline she was badly overweight before it happened. Might help explain her moodiness, but even then, it's hard to know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought about that as well, but according to her own timeline she was badly overweight before it happened. Might help explain her moodiness, but even then, it&amp;#39;s hard to know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5m6yl", "score_hidden": false, "stickied": false, "created": 1492011985.0, "created_utc": 1491983185.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4it53", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bejeweledlyoness", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "&gt;I’ll just go ahead with it. Miss Piggy, by her admittance, was a victim of rape during her teenage years. She’s in her early/mid 20s now. This was sometime after the “doctors tried to make me anorexic because I was overweight” and at least a year or two before high school graduation. It’s an awful thing to have happened, and despite both Fozzie and I feeling discomforted by casual conversation about that kind of experience, we defaulted into listening mode because it’s assumed that when someone brings that up about themselves, they need to for healing and they need support. But Miss Piggy talked about it a lot and the way she spoke about it almost seemed like she was bragging about it. \n\nYa know, some women who have been raped or sexually assaulted will **gain weight** either deliberately or unconsciously to protect themselves from future assault under the idea that fat people = unattractive, not sexy thus being fat means I am protected from this in the future. From the way you describe her and what she says about herself, I have the feeling that this may be a big component as to why her personality isn't right. She may have gained the weight to keep herself protected but now that she's in her 20's, she wants to date like most 20's year olds do. I have the feeling she needs a timeout from the dating scene and serious therapy to address her underlying issues.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I’ll just go ahead with it. Miss Piggy, by her admittance, was a victim of rape during her teenage years. She’s in her early/mid 20s now. This was sometime after the “doctors tried to make me anorexic because I was overweight” and at least a year or two before high school graduation. It’s an awful thing to have happened, and despite both Fozzie and I feeling discomforted by casual conversation about that kind of experience, we defaulted into listening mode because it’s assumed that when someone brings that up about themselves, they need to for healing and they need support. But Miss Piggy talked about it a lot and the way she spoke about it almost seemed like she was bragging about it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ya know, some women who have been raped or sexually assaulted will &lt;strong&gt;gain weight&lt;/strong&gt; either deliberately or unconsciously to protect themselves from future assault under the idea that fat people = unattractive, not sexy thus being fat means I am protected from this in the future. From the way you describe her and what she says about herself, I have the feeling that this may be a big component as to why her personality isn&amp;#39;t right. She may have gained the weight to keep herself protected but now that she&amp;#39;s in her 20&amp;#39;s, she wants to date like most 20&amp;#39;s year olds do. I have the feeling she needs a timeout from the dating scene and serious therapy to address her underlying issues.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4it53", "score_hidden": false, "stickied": false, "created": 1491957722.0, "created_utc": 1491928922.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64qz4f", "likes": null, "replies": "", "user_reports": [], "id": "dg5guxx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gonzo_likethewind", "parent_id": "t1_dg4tqp5", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I just like to give people a chance. I know when not to rely on others, but I prefer to get along with most people at the very least. Still, you can't win with everyone, and learning to be okay with that is important too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just like to give people a chance. I know when not to rely on others, but I prefer to get along with most people at the very least. Still, you can&amp;#39;t win with everyone, and learning to be okay with that is important too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5guxx", "score_hidden": false, "stickied": false, "created": 1492000025.0, "created_utc": 1491971225.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4tqp5", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "MrDoctorSmartyPants", "parent_id": "t3_64qz4f", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I can't imagine why you would work so hard to befriend a person like her. Even if she did consider you a \"friend\", she'd never respect you. You could never count on her. And knowing how she is, why would you willingly subject yourself to it? Being vulnerable around pieces of shit like her never turns out well. She was probably even lying about being raped unless some human male had a thing for hippos. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t imagine why you would work so hard to befriend a person like her. Even if she did consider you a &amp;quot;friend&amp;quot;, she&amp;#39;d never respect you. You could never count on her. And knowing how she is, why would you willingly subject yourself to it? Being vulnerable around pieces of shit like her never turns out well. She was probably even lying about being raped unless some human male had a thing for hippos. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg4tqp5", "score_hidden": false, "stickied": false, "created": 1491969561.0, "created_utc": 1491940761.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]