[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "fatpeoplestories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey there FPS! I&amp;#39;ve got a little late night snack (teehee) for you all to enjoy. &lt;/p&gt;\n\n&lt;p&gt;I work as a vet tech and I see a lot of overweight pets constantly. It astounds me to no end that owners don&amp;#39;t even realize their little Rex or Fluffy is actually gratuitously overweight and possibly causing all the problems that they are on meds for (Sound familiar?)&lt;/p&gt;\n\n&lt;p&gt;This leads to some interesting confrontations regarding the Doctor telling the client their pet has to lose some weight.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But she&amp;#39;s always been this big!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But chubby pets are the cutest!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But Floopsie gets so sad when we try to put her on a diet!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Yeah ok, sure. No that&amp;#39;s fine, just let your pet slowly collapse under the weight of their own body fat.&lt;/p&gt;\n\n&lt;p&gt;Aaaaaaand the client and the pet skip off happily, go and eat their beetus/kibblebeetus (don&amp;#39;t get me started on how much I despise most pet foods) and later we get Ol&amp;#39; Ruffles in to euthanize because his legs have finally given out under the 15+ pounds overweight he had been his entire life...and he&amp;#39;s 10. And he is still wagging his tail happily and looks ready to go play outside, but can&amp;#39;t because he&amp;#39;s about to be given the GreenDream.&lt;/p&gt;\n\n&lt;p&gt;Sorry, that tangent is actually leading up to an encounter with two (Honey)hams, a mother and daughter, and their cat who was generating his own gravitational field. &lt;/p&gt;\n\n&lt;p&gt;Essentially what happened was this cat stopped eating for some reason. The case was very complicated, something along the lines of this cat having bladder stones (risk increases with weight, BTW), and then having surgery to remove them, the cat stopped eating soon afterward, appetite stimulants and syringe feedings weren&amp;#39;t helping, and finally kitkat had a feeding tube surgically inserted into his esophagus. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m showing the Hams how to syringe feed and walking them through what needs to be done.&lt;/p&gt;\n\n&lt;p&gt;Me, as I&amp;#39;m loading blended up cat food into a syringe to insert into the feeding tube: ok, so we&amp;#39;ll be using this kind of canned cat food because it&amp;#39;s easier to blend and also because--&lt;/p&gt;\n\n&lt;p&gt;Mom: why this food? Why not ours? &lt;/p&gt;\n\n&lt;p&gt;Me: well, this is a veterinarian-grade cat food specifically made for--&lt;/p&gt;\n\n&lt;p&gt;Mom: but what if he doesn&amp;#39;t like the taste, can&amp;#39;t we just use our food X, Y, and Z?&lt;/p&gt;\n\n&lt;p&gt;Me, internally screaming because the brands that she listed off are essentially garbage, and probably also contributing to the urinary problem: Um, no. For one, he can&amp;#39;t taste it--it&amp;#39;s being pumped past his mouth and tongue. Second, this food is what the doctor wants Poopsie-kins to be on because it will help keep urinary issues--&lt;/p&gt;\n\n&lt;p&gt;Mom, getting more flustered: I&amp;#39;m just worried he won&amp;#39;t have the nutrients he&amp;#39;ll need. (She looks down at the syringe) wait, is THAT all he gets?&lt;/p&gt;\n\n&lt;p&gt;Me, slowly losing my mind: Yes, this is a normal amount of food for Poopsie-kins, it&amp;#39;s actually a little more than what we usually would give because we don&amp;#39;t want him to lose weight rapidly as that can cause liver--&lt;/p&gt;\n\n&lt;p&gt;Mom: Well OF COURSE we don&amp;#39;t want him losing weight, we want him to be happy! So why are you only offering that much food? He usually eats four times that much!&lt;/p&gt;\n\n&lt;p&gt;Me, horrified because that IS A LOT OF CAT FOOD: ...I understand, but we don&amp;#39;t want to make Poopsie-kins gain any more weight than what he has already--&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m interrupted again, and this part is a little fuzzy because she starts regaling me a tale of an old cat of hers that ate very little and was miserable and died a horrible death, and that her cat now was perfect and large and in charge and that if his large size meant he was happy, then by golly, her cat was going to stay overweight. Throughout all of this, her daughter is nodding along happily, parroting what her mother is saying.&lt;/p&gt;\n\n&lt;p&gt;Mom: After all, there&amp;#39;s nothing wrong with being overweight!&lt;/p&gt;\n\n&lt;p&gt;But...his weight and terrible diet contributed to urinary stones.&lt;/p&gt;\n\n&lt;p&gt;But... his weight is making him a sedentary animal and the lack of movement is contributing to his urinary issues.&lt;/p&gt;\n\n&lt;p&gt;But...his weight is also affecting his joints, liver, thyroid, and kidneys.&lt;/p&gt;\n\n&lt;p&gt;But, but, but...&lt;/p&gt;\n\n&lt;p&gt;The doctor came in soon after our exchange and I got out of the room they were in, my ability to form coherent and rational thoughts fractured. I would have lost it completely had I stayed in there any longer.&lt;/p&gt;\n\n&lt;p&gt;I saw the cat sometime later, it had gained weight and I managed to hear that when they ran out of the food we prescribed, they just started blending up their own, and as they &amp;quot;lost&amp;quot; our instructions on how much to feed and how often, they were just feeding him until he &amp;quot;no longer looked hungry.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And that he wasn&amp;#39;t urinating in the litter box again*.&lt;/p&gt;\n\n&lt;p&gt;Oh boy, here we go again.&lt;/p&gt;\n\n&lt;p&gt;*urinating outside of the litterbox can be a sign of urinary issues. Or being so large that cats cannot physically lift themselves into it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey there FPS! I've got a little late night snack (teehee) for you all to enjoy. \n\nI work as a vet tech and I see a lot of overweight pets constantly. It astounds me to no end that owners don't even realize their little Rex or Fluffy is actually gratuitously overweight and possibly causing all the problems that they are on meds for (Sound familiar?)\n\nThis leads to some interesting confrontations regarding the Doctor telling the client their pet has to lose some weight.\n\n\"But she's always been this big!\"\n\n\"But chubby pets are the cutest!\"\n\n\"But Floopsie gets so sad when we try to put her on a diet!\"\n\nYeah ok, sure. No that's fine, just let your pet slowly collapse under the weight of their own body fat.\n\nAaaaaaand the client and the pet skip off happily, go and eat their beetus/kibblebeetus (don't get me started on how much I despise most pet foods) and later we get Ol' Ruffles in to euthanize because his legs have finally given out under the 15+ pounds overweight he had been his entire life...and he's 10. And he is still wagging his tail happily and looks ready to go play outside, but can't because he's about to be given the GreenDream.\n\nSorry, that tangent is actually leading up to an encounter with two (Honey)hams, a mother and daughter, and their cat who was generating his own gravitational field. \n\nEssentially what happened was this cat stopped eating for some reason. The case was very complicated, something along the lines of this cat having bladder stones (risk increases with weight, BTW), and then having surgery to remove them, the cat stopped eating soon afterward, appetite stimulants and syringe feedings weren't helping, and finally kitkat had a feeding tube surgically inserted into his esophagus. \n\nI'm showing the Hams how to syringe feed and walking them through what needs to be done.\n\nMe, as I'm loading blended up cat food into a syringe to insert into the feeding tube: ok, so we'll be using this kind of canned cat food because it's easier to blend and also because--\n\nMom: why this food? Why not ours? \n\nMe: well, this is a veterinarian-grade cat food specifically made for--\n\nMom: but what if he doesn't like the taste, can't we just use our food X, Y, and Z?\n\nMe, internally screaming because the brands that she listed off are essentially garbage, and probably also contributing to the urinary problem: Um, no. For one, he can't taste it--it's being pumped past his mouth and tongue. Second, this food is what the doctor wants Poopsie-kins to be on because it will help keep urinary issues--\n\nMom, getting more flustered: I'm just worried he won't have the nutrients he'll need. (She looks down at the syringe) wait, is THAT all he gets?\n\nMe, slowly losing my mind: Yes, this is a normal amount of food for Poopsie-kins, it's actually a little more than what we usually would give because we don't want him to lose weight rapidly as that can cause liver--\n\nMom: Well OF COURSE we don't want him losing weight, we want him to be happy! So why are you only offering that much food? He usually eats four times that much!\n\nMe, horrified because that IS A LOT OF CAT FOOD: ...I understand, but we don't want to make Poopsie-kins gain any more weight than what he has already--\n\nI'm interrupted again, and this part is a little fuzzy because she starts regaling me a tale of an old cat of hers that ate very little and was miserable and died a horrible death, and that her cat now was perfect and large and in charge and that if his large size meant he was happy, then by golly, her cat was going to stay overweight. Throughout all of this, her daughter is nodding along happily, parroting what her mother is saying.\n\nMom: After all, there's nothing wrong with being overweight!\n\nBut...his weight and terrible diet contributed to urinary stones.\n\nBut... his weight is making him a sedentary animal and the lack of movement is contributing to his urinary issues.\n\nBut...his weight is also affecting his joints, liver, thyroid, and kidneys.\n\nBut, but, but...\n\nThe doctor came in soon after our exchange and I got out of the room they were in, my ability to form coherent and rational thoughts fractured. I would have lost it completely had I stayed in there any longer.\n\nI saw the cat sometime later, it had gained weight and I managed to hear that when they ran out of the food we prescribed, they just started blending up their own, and as they \"lost\" our instructions on how much to feed and how often, they were just feeding him until he \"no longer looked hungry.\"\n\nAnd that he wasn't urinating in the litter box again*.\n\nOh boy, here we go again.\n\n\n\n*urinating outside of the litterbox can be a sign of urinary issues. Or being so large that cats cannot physically lift themselves into it.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Long", "id": "64w4sq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 317, "report_reasons": null, "author": "VetTechnicallyNotYet", "saved": false, "mod_reports": [], "name": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "approved_by": null, "over_18": false, "domain": "self.fatpeoplestories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vzax", "edited": false, "link_flair_css_class": "long", "author_flair_css_class": "", "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/fatpeoplestories/comments/64w4sq/fatlogic_in_the_veterinary_field/", "num_reports": null, "locked": false, "stickied": false, "created": 1492001186.0, "url": "https://www.reddit.com/r/fatpeoplestories/comments/64w4sq/fatlogic_in_the_veterinary_field/", "author_flair_text": "Fat Shaming your pets since 2015", "quarantine": false, "title": "Fatlogic in the Veterinary Field", "created_utc": 1491972386.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 88, "visited": false, "subreddit_type": "public", "ups": 317}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg5lr26", "gilded": 0, "archived": false, "score": 56, "report_reasons": null, "author": "Nessmonster92", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "That makes me want to cry for that poor animal and all animals being subjected to that", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That makes me want to cry for that poor animal and all animals being subjected to that&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5lr26", "score_hidden": false, "stickied": false, "created": 1492010730.0, "created_utc": 1491981930.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 56}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg8y7ha", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SecondComingOfYeezus", "parent_id": "t1_dg6sqr2", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "&gt; how do obese people ignore joint pain, lack of breath, and digestion issues so easily?\n\nFA/HAES, that's how", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;how do obese people ignore joint pain, lack of breath, and digestion issues so easily?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;FA/HAES, that&amp;#39;s how&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8y7ha", "score_hidden": false, "stickied": false, "created": 1492189829.0, "created_utc": 1492161029.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6sqr2", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "benkbloch", "parent_id": "t1_dg6rgz8", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Agreed. I'm sure that had we paid to have actual tests done on him (but we didn't because he seemed healthy and was, y'know, a cat), they'd have found some obesity-related red flags. What's insane to me is that people apply this same logic to themselves; \"Nothing is clearly horribly wrong, so I *must* be healthy!\" No idiots, ever heard of the calm before the storm? My cat was lucky, *extremely* lucky, and even then at the first noticeable sign of trouble we stopped fucking around; how do obese people ignore joint pain, lack of breath, and digestion issues so easily?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed. I&amp;#39;m sure that had we paid to have actual tests done on him (but we didn&amp;#39;t because he seemed healthy and was, y&amp;#39;know, a cat), they&amp;#39;d have found some obesity-related red flags. What&amp;#39;s insane to me is that people apply this same logic to themselves; &amp;quot;Nothing is clearly horribly wrong, so I &lt;em&gt;must&lt;/em&gt; be healthy!&amp;quot; No idiots, ever heard of the calm before the storm? My cat was lucky, &lt;em&gt;extremely&lt;/em&gt; lucky, and even then at the first noticeable sign of trouble we stopped fucking around; how do obese people ignore joint pain, lack of breath, and digestion issues so easily?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6sqr2", "score_hidden": false, "stickied": false, "created": 1492070338.0, "created_utc": 1492041538.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rgz8", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "VetTechnicallyNotYet", "parent_id": "t1_dg5mpph", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "My failed kidneys are proof that even if you think you're healthy while overweight, you aren't. I'll always advocate for normal weighted pet's and good on you for taking care of your kitty. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My failed kidneys are proof that even if you think you&amp;#39;re healthy while overweight, you aren&amp;#39;t. I&amp;#39;ll always advocate for normal weighted pet&amp;#39;s and good on you for taking care of your kitty. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6rgz8", "score_hidden": false, "stickied": false, "created": 1492068763.0, "created_utc": 1492039963.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mpph", "gilded": 0, "archived": false, "score": 97, "report_reasons": null, "author": "benkbloch", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Relevant repost of mine from r/fatlogic:\n\nMy cat was fat for probably 13 out of his 16 years. Our vet speculated that he hadn't learned the best self-control as a kitten and thus as an adult he ate way more than he needed (it didn't help that we enabled it). Now I'm not proud of this, but my family didn't try to stop it at all; we thought he was cute as a fatso and we couldn't be bothered to feed him and our other cat (who was tiny) separately, so he remained a chubster. He never showed signs of sickness or discomfort and he was already past 10, so we figured he was healthy enough. When he was around 14 he started to show classic signs of joint pain and the vet said, \"He's old now *and* he's fat; they're a bad combo.\" We switched him to new food (small cat was gone by now) and a more regimented diet and ***presto*** he started shedding the pounds. He was a healthy weight when he died at 16.\n\nIf your pet is fat and functional, that's one thing, but when they're in pain or sick, **I don't give a fuck what you think, listen to the vet and put them on a diet.** Animals can't do this for themselves, they are dependent on **you**, and you have no excuse if your pet is fat to the point of physical pain. I won't lie, we were lucky as hell that Chubs didn't have any medical issues despite his obesity (until he did), but you can bet your ass that if the vet had ever said, \"He's in pain because he's too fat,\" we would've put him on a diet that very day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Relevant repost of mine from &lt;a href=\"/r/fatlogic\"&gt;r/fatlogic&lt;/a&gt;:&lt;/p&gt;\n\n&lt;p&gt;My cat was fat for probably 13 out of his 16 years. Our vet speculated that he hadn&amp;#39;t learned the best self-control as a kitten and thus as an adult he ate way more than he needed (it didn&amp;#39;t help that we enabled it). Now I&amp;#39;m not proud of this, but my family didn&amp;#39;t try to stop it at all; we thought he was cute as a fatso and we couldn&amp;#39;t be bothered to feed him and our other cat (who was tiny) separately, so he remained a chubster. He never showed signs of sickness or discomfort and he was already past 10, so we figured he was healthy enough. When he was around 14 he started to show classic signs of joint pain and the vet said, &amp;quot;He&amp;#39;s old now &lt;em&gt;and&lt;/em&gt; he&amp;#39;s fat; they&amp;#39;re a bad combo.&amp;quot; We switched him to new food (small cat was gone by now) and a more regimented diet and &lt;strong&gt;&lt;em&gt;presto&lt;/em&gt;&lt;/strong&gt; he started shedding the pounds. He was a healthy weight when he died at 16.&lt;/p&gt;\n\n&lt;p&gt;If your pet is fat and functional, that&amp;#39;s one thing, but when they&amp;#39;re in pain or sick, &lt;strong&gt;I don&amp;#39;t give a fuck what you think, listen to the vet and put them on a diet.&lt;/strong&gt; Animals can&amp;#39;t do this for themselves, they are dependent on &lt;strong&gt;you&lt;/strong&gt;, and you have no excuse if your pet is fat to the point of physical pain. I won&amp;#39;t lie, we were lucky as hell that Chubs didn&amp;#39;t have any medical issues despite his obesity (until he did), but you can bet your ass that if the vet had ever said, &amp;quot;He&amp;#39;s in pain because he&amp;#39;s too fat,&amp;quot; we would&amp;#39;ve put him on a diet that very day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5mpph", "score_hidden": false, "stickied": false, "created": 1492013532.0, "created_utc": 1491984732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 97}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg9g2s4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "juel1979", "parent_id": "t1_dg9eou2", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "My oldest dog who passed in 2015 had flopped over ears. She almost never put hers up. I miss it a bit, but my sibs have such strong ears. I think they got it from their mom since their dad had one straight, one flop. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My oldest dog who passed in 2015 had flopped over ears. She almost never put hers up. I miss it a bit, but my sibs have such strong ears. I think they got it from their mom since their dad had one straight, one flop. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg9g2s4", "score_hidden": false, "stickied": false, "created": 1492219536.0, "created_utc": 1492190736.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9eou2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "macaroniinapan", "parent_id": "t1_dg9dijo", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "That is adorable!  Especially those ears!\n\nSeriously, could chihuahua ears be any cuter?  When my parents' chihuahua has her ears fully upright and her tail is going at max speed, we like to ask her if she's trying  to achieve flight.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is adorable!  Especially those ears!&lt;/p&gt;\n\n&lt;p&gt;Seriously, could chihuahua ears be any cuter?  When my parents&amp;#39; chihuahua has her ears fully upright and her tail is going at max speed, we like to ask her if she&amp;#39;s trying  to achieve flight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg9eou2", "score_hidden": false, "stickied": false, "created": 1492217942.0, "created_utc": 1492189142.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dijo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "juel1979", "parent_id": "t1_dg6w82a", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I have a set of non-littermate siblings, chihuahua/min pin mixes. One is skinny as hell at 6lbs, the other a chub at 8. Chub has maybe a tiny bit of height/length on her older sister in size. They must be doing fine because my vet is not one to pull punches on weight. He knows if he tells me, I'm gonna take the advice and fix it. \n\nBlack and red is the chub; brown and tan the skinny. \n http://i.imgur.com/IzckNyY.jpg http://i.imgur.com/97XB13o.jpg ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a set of non-littermate siblings, chihuahua/min pin mixes. One is skinny as hell at 6lbs, the other a chub at 8. Chub has maybe a tiny bit of height/length on her older sister in size. They must be doing fine because my vet is not one to pull punches on weight. He knows if he tells me, I&amp;#39;m gonna take the advice and fix it. &lt;/p&gt;\n\n&lt;p&gt;Black and red is the chub; brown and tan the skinny. \n &lt;a href=\"http://i.imgur.com/IzckNyY.jpg\"&gt;http://i.imgur.com/IzckNyY.jpg&lt;/a&gt; &lt;a href=\"http://i.imgur.com/97XB13o.jpg\"&gt;http://i.imgur.com/97XB13o.jpg&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg9dijo", "score_hidden": false, "stickied": false, "created": 1492216624.0, "created_utc": 1492187824.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6w82a", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "macaroniinapan", "parent_id": "t1_dg6sthb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "On the other end of the spectrum, you have my Mom and Dad's two pound chihuahua.  They do give her small amounts of table scraps but usually she stays at her healthy weight - but if she puts on a half of a pound, she actually looks chubby and they know they've been overdoing it and cut back.  Animals are so interesting that way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On the other end of the spectrum, you have my Mom and Dad&amp;#39;s two pound chihuahua.  They do give her small amounts of table scraps but usually she stays at her healthy weight - but if she puts on a half of a pound, she actually looks chubby and they know they&amp;#39;ve been overdoing it and cut back.  Animals are so interesting that way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6w82a", "score_hidden": false, "stickied": false, "created": 1492074559.0, "created_utc": 1492045759.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6sthb", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Raveynfyre", "parent_id": "t1_dg5x9px", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Our Maine Coon mix is 18lbs of solid muscle,  I've had people ask if he's part mountain lion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Our Maine Coon mix is 18lbs of solid muscle,  I&amp;#39;ve had people ask if he&amp;#39;s part mountain lion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6sthb", "score_hidden": false, "stickied": false, "created": 1492070434.0, "created_utc": 1492041634.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6nwos", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "aquainst1", "parent_id": "t1_dg6kva5", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Yeah, labs will eat until they explode.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, labs will eat until they explode.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6nwos", "score_hidden": false, "stickied": false, "created": 1492064352.0, "created_utc": 1492035552.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kva5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "contrarian_barbarian", "parent_id": "t1_dg5x9px", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "My dog's pretty similar - a touch overweight, but she'll still run laps around the dog park. Still, I've been trying to work on it. Just had her yearly checkup, and she was down 3lbs this year, primarily due to cutting out feeding her table scraps. Admittedly, that's because I needed to lose weight myself and hence am eating much healthier; no matter how cute she may look, I don't have enough to spare!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My dog&amp;#39;s pretty similar - a touch overweight, but she&amp;#39;ll still run laps around the dog park. Still, I&amp;#39;ve been trying to work on it. Just had her yearly checkup, and she was down 3lbs this year, primarily due to cutting out feeding her table scraps. Admittedly, that&amp;#39;s because I needed to lose weight myself and hence am eating much healthier; no matter how cute she may look, I don&amp;#39;t have enough to spare!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6kva5", "score_hidden": false, "stickied": false, "created": 1492060676.0, "created_utc": 1492031876.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5x9px", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "DaftLord", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "One of my cats is currently ~10kg. The vets have commented on his size (they say he is a little overweight, not fat/obese), but on his actual size: He is fucking huge compared to your average cat. He dwarfs dogs like poodles and terriers. I swear he has part mountain lion in him from his size (He is actually part Siamese)\n\nDoesn't help that he is an idiot. He drools when he is scratched, and he absolutely LOVES feet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of my cats is currently ~10kg. The vets have commented on his size (they say he is a little overweight, not fat/obese), but on his actual size: He is fucking huge compared to your average cat. He dwarfs dogs like poodles and terriers. I swear he has part mountain lion in him from his size (He is actually part Siamese)&lt;/p&gt;\n\n&lt;p&gt;Doesn&amp;#39;t help that he is an idiot. He drools when he is scratched, and he absolutely LOVES feet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5x9px", "score_hidden": false, "stickied": false, "created": 1492035764.0, "created_utc": 1492006964.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg8yaaf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SecondComingOfYeezus", "parent_id": "t1_dg5hvly", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Right? Stuff your own body with food until you can't walk. Free country. But your pets don't get that choice--they depend on you. *You* have to make good choices for them, even if you can't make good choices for yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right? Stuff your own body with food until you can&amp;#39;t walk. Free country. But your pets don&amp;#39;t get that choice--they depend on you. &lt;em&gt;You&lt;/em&gt; have to make good choices for them, even if you can&amp;#39;t make good choices for yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8yaaf", "score_hidden": false, "stickied": false, "created": 1492190089.0, "created_utc": 1492161289.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5hvly", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "duckturpin", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Ugh, this infuriates me and I can only imagine that as a vet you would have to deal with this kind of animal fatlogic all the time. It's bad enough to make your own unhealthy choices, but to essentially force feed an animal against a vet's advice is just disgusting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ugh, this infuriates me and I can only imagine that as a vet you would have to deal with this kind of animal fatlogic all the time. It&amp;#39;s bad enough to make your own unhealthy choices, but to essentially force feed an animal against a vet&amp;#39;s advice is just disgusting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5hvly", "score_hidden": false, "stickied": false, "created": 1492001873.0, "created_utc": 1491973073.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 46}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6xv43", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bunnylizard", "parent_id": "t1_dg6km7p", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Glad to know I'm not the only one! Good luck with your kitties! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad to know I&amp;#39;m not the only one! Good luck with your kitties! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6xv43", "score_hidden": false, "stickied": false, "created": 1492076584.0, "created_utc": 1492047784.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6km7p", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lotus_the_Cat", "parent_id": "t1_dg5prgj", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I have the same issue as OP. I'm going to look into this advice. Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have the same issue as OP. I&amp;#39;m going to look into this advice. Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6km7p", "score_hidden": false, "stickied": false, "created": 1492060389.0, "created_utc": 1492031589.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6xp8f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bunnylizard", "parent_id": "t1_dg6oofb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Thanks for the detailed answer, it certainly relieves some of my trepidation about cat collars! \n\nI'm sure it will be funny to watch mine race around trying to figure out why their mama put this weird thing on their necks. I had one kitty need a cone a few months back and that was fun, but in a sad way, watching him try and figure it out. Poor guy, but he was sick and needed to stop rubbing his eyes! \n\n\nGood call on collaring the escape artist cats though! I can imagine it would set you at ease a lot to know that if they got out, they're more likely to return themselves or be found and returned! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the detailed answer, it certainly relieves some of my trepidation about cat collars! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure it will be funny to watch mine race around trying to figure out why their mama put this weird thing on their necks. I had one kitty need a cone a few months back and that was fun, but in a sad way, watching him try and figure it out. Poor guy, but he was sick and needed to stop rubbing his eyes! &lt;/p&gt;\n\n&lt;p&gt;Good call on collaring the escape artist cats though! I can imagine it would set you at ease a lot to know that if they got out, they&amp;#39;re more likely to return themselves or be found and returned! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6xp8f", "score_hidden": false, "stickied": false, "created": 1492076384.0, "created_utc": 1492047584.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6oofb", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "breakingoff", "parent_id": "t1_dg5qzm9", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Having had indoor only cats with collars... it generally doesn't bother them after a bit. Just make sure it's a collar designed for cats - those have a quick release function in case they get snagged on something; cheaper ones it's just a rubber band, so go for a more expensive one where the clasp itself will release - and that you can comfortably and easily fit two fingers between the collar and their skin. (As in, you shouldn't have to force it or wriggle or anything, your fingers should just slip in.)\n\nAlso enjoy the first hour or two of shenanigans as the cat tries to figure out wtf is on its neck. It's pretty funny to watch. But they figure out it's not going anywhere sooner or later, and then it doesn't bother 'em.\n\nFabric ones will be more comfortable for them than the pretty shiny plastic-y ones. \n\nNote that a LOT of cat collars have bells on them. If you think the constant jingling may annoy your pet - had a cat once who kept taking her collar off until we removed the bell - then the bell is usually easily removed with a pair of pliers.\n\nBut, yeah, collars don't usually bug cats, even if they're older and have never been collared before. Easiest to start when they're kittens, but I've seen older cats get used to them just fine. Heck, had one cat who, if his collar came off, would pick it up and carry it to you to have it put back on. Guess he felt naked without it.\n\n(As to why we collared indoor only cats... a couple of them were fluffy little escape artists.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having had indoor only cats with collars... it generally doesn&amp;#39;t bother them after a bit. Just make sure it&amp;#39;s a collar designed for cats - those have a quick release function in case they get snagged on something; cheaper ones it&amp;#39;s just a rubber band, so go for a more expensive one where the clasp itself will release - and that you can comfortably and easily fit two fingers between the collar and their skin. (As in, you shouldn&amp;#39;t have to force it or wriggle or anything, your fingers should just slip in.)&lt;/p&gt;\n\n&lt;p&gt;Also enjoy the first hour or two of shenanigans as the cat tries to figure out wtf is on its neck. It&amp;#39;s pretty funny to watch. But they figure out it&amp;#39;s not going anywhere sooner or later, and then it doesn&amp;#39;t bother &amp;#39;em.&lt;/p&gt;\n\n&lt;p&gt;Fabric ones will be more comfortable for them than the pretty shiny plastic-y ones. &lt;/p&gt;\n\n&lt;p&gt;Note that a LOT of cat collars have bells on them. If you think the constant jingling may annoy your pet - had a cat once who kept taking her collar off until we removed the bell - then the bell is usually easily removed with a pair of pliers.&lt;/p&gt;\n\n&lt;p&gt;But, yeah, collars don&amp;#39;t usually bug cats, even if they&amp;#39;re older and have never been collared before. Easiest to start when they&amp;#39;re kittens, but I&amp;#39;ve seen older cats get used to them just fine. Heck, had one cat who, if his collar came off, would pick it up and carry it to you to have it put back on. Guess he felt naked without it.&lt;/p&gt;\n\n&lt;p&gt;(As to why we collared indoor only cats... a couple of them were fluffy little escape artists.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6oofb", "score_hidden": false, "stickied": false, "created": 1492065315.0, "created_utc": 1492036515.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg73mim", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bunnylizard", "parent_id": "t1_dg72tm6", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Perfect! Thank you! It looks like just what I need. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perfect! Thank you! It looks like just what I need. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg73mim", "score_hidden": false, "stickied": false, "created": 1492084181.0, "created_utc": 1492055381.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg72tm6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hare_in_a_suit", "parent_id": "t1_dg6xcft", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "https://sureflap.com/en-us/pet-feeder/microchip-pet-feeder", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://sureflap.com/en-us/pet-feeder/microchip-pet-feeder\"&gt;https://sureflap.com/en-us/pet-feeder/microchip-pet-feeder&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg72tm6", "score_hidden": false, "stickied": false, "created": 1492083002.0, "created_utc": 1492054202.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xcft", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bunnylizard", "parent_id": "t1_dg5ya0y", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "That might be the way to go for me, then! Thanks, I hadn't thought that maybe it would work for microchips too! Do you maybe have a link to the type of bowl you purchased? I'm more likely to but something if it's recommended, even by a fellow redditor. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That might be the way to go for me, then! Thanks, I hadn&amp;#39;t thought that maybe it would work for microchips too! Do you maybe have a link to the type of bowl you purchased? I&amp;#39;m more likely to but something if it&amp;#39;s recommended, even by a fellow redditor. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6xcft", "score_hidden": false, "stickied": false, "created": 1492075941.0, "created_utc": 1492047141.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ya0y", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "hare_in_a_suit", "parent_id": "t1_dg5qzm9", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "There are also those that will read the animal's microchip. I got one recently – works like a charm.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are also those that will read the animal&amp;#39;s microchip. I got one recently – works like a charm.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5ya0y", "score_hidden": false, "stickied": false, "created": 1492036949.0, "created_utc": 1492008149.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qzm9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bunnylizard", "parent_id": "t1_dg5prgj", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "That could be worth looking into. Hadn't heard of the concept before. But that could certainly be helpful. \n\nMy only reservation is that I'm more against using collars on cats, particularly indoor-only ones like I have. I can't imagine it would be comfortable for the poor things. Of course, I might be biased as I grew up with a cat (17+ years old) who was indoor and outdoor sometimes but never wore a collar either. But I'll still look into the idea!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That could be worth looking into. Hadn&amp;#39;t heard of the concept before. But that could certainly be helpful. &lt;/p&gt;\n\n&lt;p&gt;My only reservation is that I&amp;#39;m more against using collars on cats, particularly indoor-only ones like I have. I can&amp;#39;t imagine it would be comfortable for the poor things. Of course, I might be biased as I grew up with a cat (17+ years old) who was indoor and outdoor sometimes but never wore a collar either. But I&amp;#39;ll still look into the idea!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5qzm9", "score_hidden": false, "stickied": false, "created": 1492025964.0, "created_utc": 1491997164.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5prgj", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "extaynia", "parent_id": "t1_dg5n76r", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "What about one of those bowls that open with a magnet on a collar", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What about one of those bowls that open with a magnet on a collar&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5prgj", "score_hidden": false, "stickied": false, "created": 1492022944.0, "created_utc": 1491994144.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6hp8g", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "skivian", "parent_id": "t1_dg6fvaq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "She's not even attempting subtlety when she goes for my food, either. When she first started doing it, she just jumped on the table and started chewing on my food like it was clearly meant for her. \n\nNow she struts in the room and clearly winds up to jump on the table for her snatch and runs.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s not even attempting subtlety when she goes for my food, either. When she first started doing it, she just jumped on the table and started chewing on my food like it was clearly meant for her. &lt;/p&gt;\n\n&lt;p&gt;Now she struts in the room and clearly winds up to jump on the table for her snatch and runs.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6hp8g", "score_hidden": false, "stickied": false, "created": 1492057260.0, "created_utc": 1492028460.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fvaq", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "NikiNaks", "parent_id": "t1_dg6ap8p", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "This image was so fucking hilarious, thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This image was so fucking hilarious, thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6fvaq", "score_hidden": false, "stickied": false, "created": 1492055382.0, "created_utc": 1492026582.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg74tvd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "macaroniinapan", "parent_id": "t1_dg73g2p", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Holy crap.  Great point! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy crap.  Great point! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg74tvd", "score_hidden": false, "stickied": false, "created": 1492085995.0, "created_utc": 1492057195.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg73g2p", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "skivian", "parent_id": "t1_dg6wfbn", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I'm sure the vet was ball parking it, but it's pretty easy. Chihuahua supposed to weigh two pounds, gains .5 pounds. That's a 25% increase. \n\nWeigh yourself. Multiply by 1.25. \n\nImagine yourself that weight.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure the vet was ball parking it, but it&amp;#39;s pretty easy. Chihuahua supposed to weigh two pounds, gains .5 pounds. That&amp;#39;s a 25% increase. &lt;/p&gt;\n\n&lt;p&gt;Weigh yourself. Multiply by 1.25. &lt;/p&gt;\n\n&lt;p&gt;Imagine yourself that weight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg73g2p", "score_hidden": false, "stickied": false, "created": 1492083916.0, "created_utc": 1492055116.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6wfbn", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "macaroniinapan", "parent_id": "t1_dg6ap8p", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "&gt; the vet tells me that she's 5 pounds overweight, and needs to be put on a diet now.\n&gt; \"That doesn't sound that bad\", I say. Vet explains to me that the human equivalent is me gaining another hundred pounds. That does sound bad.\n\nReminds me of my parents' two pound chihuahua.  On the rare occasion that she gets to two and a half pounds, she actually looks chubby and they know to cut back on her food a bit.  \n\nTheir vet hasn't given them a precise conversion of how much weight gain in a human that would equal, but it's interesting to think about relative sizes of animals and what constitutes \"overweight\" in actual number of pounds.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;the vet tells me that she&amp;#39;s 5 pounds overweight, and needs to be put on a diet now.\n&amp;quot;That doesn&amp;#39;t sound that bad&amp;quot;, I say. Vet explains to me that the human equivalent is me gaining another hundred pounds. That does sound bad.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Reminds me of my parents&amp;#39; two pound chihuahua.  On the rare occasion that she gets to two and a half pounds, she actually looks chubby and they know to cut back on her food a bit.  &lt;/p&gt;\n\n&lt;p&gt;Their vet hasn&amp;#39;t given them a precise conversion of how much weight gain in a human that would equal, but it&amp;#39;s interesting to think about relative sizes of animals and what constitutes &amp;quot;overweight&amp;quot; in actual number of pounds.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6wfbn", "score_hidden": false, "stickied": false, "created": 1492074802.0, "created_utc": 1492046002.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6gb5j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "EvilLittleCar", "parent_id": "t1_dg6ap8p", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Have you tried kitty food puzzles?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tried kitty food puzzles?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6gb5j", "score_hidden": false, "stickied": false, "created": 1492055824.0, "created_utc": 1492027024.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg9gvfl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "macaroniinapan", "parent_id": "t1_dg7kcb1", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Maybe it's all the running she does while sneaking the food.  :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe it&amp;#39;s all the running she does while sneaking the food.  :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg9gvfl", "score_hidden": false, "stickied": false, "created": 1492220463.0, "created_utc": 1492191663.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kcb1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hayhay1232", "parent_id": "t1_dg6ap8p", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "My lil calico kitty isn't even overweight and she does that.  When she was 6 months old, I set a bagel down next to me for a minute or so...and then next thing I know, the little shithead is running away with it. I have no idea how she's not overweight.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My lil calico kitty isn&amp;#39;t even overweight and she does that.  When she was 6 months old, I set a bagel down next to me for a minute or so...and then next thing I know, the little shithead is running away with it. I have no idea how she&amp;#39;s not overweight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg7kcb1", "score_hidden": false, "stickied": false, "created": 1492120225.0, "created_utc": 1492091425.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg73lpt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bunnylizard", "parent_id": "t1_dg73czd", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Good to hear! And I certainly know all about that, my bigger kitty is constantly voicing his complaints and grievances at me, and at all hours of the night too! I don't get much sleep normally and this is making it crazier. Hopefully he won't be like this forever!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good to hear! And I certainly know all about that, my bigger kitty is constantly voicing his complaints and grievances at me, and at all hours of the night too! I don&amp;#39;t get much sleep normally and this is making it crazier. Hopefully he won&amp;#39;t be like this forever!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg73lpt", "score_hidden": false, "stickied": false, "created": 1492084148.0, "created_utc": 1492055348.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg73czd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "skivian", "parent_id": "t1_dg6w27t", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "She's definitely slimmed down. She still insists that I'm starving her to death every time it's near feeding time though. And when I'm eating. And when the dogs eating.\nAnd randomly when she thinks about food.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s definitely slimmed down. She still insists that I&amp;#39;m starving her to death every time it&amp;#39;s near feeding time though. And when I&amp;#39;m eating. And when the dogs eating.\nAnd randomly when she thinks about food.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg73czd", "score_hidden": false, "stickied": false, "created": 1492083789.0, "created_utc": 1492054989.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6w27t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bunnylizard", "parent_id": "t1_dg6ap8p", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Oh man, that certainly sounds like an ordeal! Those kitties...they'll do what they want and will find a way to do exactly what you *don't* want them to do! \n\nHopefully it helped her a little bit even?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man, that certainly sounds like an ordeal! Those kitties...they&amp;#39;ll do what they want and will find a way to do exactly what you &lt;em&gt;don&amp;#39;t&lt;/em&gt; want them to do! &lt;/p&gt;\n\n&lt;p&gt;Hopefully it helped her a little bit even?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6w27t", "score_hidden": false, "stickied": false, "created": 1492074355.0, "created_utc": 1492045555.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ap8p", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "skivian", "parent_id": "t1_dg5ypb7", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Cats are a pain to put on a diet. When I first got my cat, we free feed her. Take her to the vet, and the vet tells me that she's 5 pounds overweight, and needs to be put on a diet now. \n\n\"That doesn't sound that bad\", I say. Vet explains to me that the human equivalent is me gaining another hundred pounds. That does sound bad. \n\nSo we put kitty on a diet. 3/4 cup of food twice a day. Kitty still doesn't lose weight. \n\nFind out she's been eating the dog food instead. So now we can't free feed the dog anymore. \n\nCat starts attacking the dog and taking his food during feeding.\n\nSo we separate them during feeding. \n\nNow we start finding leftover small animal corpses in the back yard. \n\nNow she's an indoor cat only. \n\nNow she's constantly trying to steal our food. Like will jump on the table, steal food and run.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cats are a pain to put on a diet. When I first got my cat, we free feed her. Take her to the vet, and the vet tells me that she&amp;#39;s 5 pounds overweight, and needs to be put on a diet now. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;That doesn&amp;#39;t sound that bad&amp;quot;, I say. Vet explains to me that the human equivalent is me gaining another hundred pounds. That does sound bad. &lt;/p&gt;\n\n&lt;p&gt;So we put kitty on a diet. 3/4 cup of food twice a day. Kitty still doesn&amp;#39;t lose weight. &lt;/p&gt;\n\n&lt;p&gt;Find out she&amp;#39;s been eating the dog food instead. So now we can&amp;#39;t free feed the dog anymore. &lt;/p&gt;\n\n&lt;p&gt;Cat starts attacking the dog and taking his food during feeding.&lt;/p&gt;\n\n&lt;p&gt;So we separate them during feeding. &lt;/p&gt;\n\n&lt;p&gt;Now we start finding leftover small animal corpses in the back yard. &lt;/p&gt;\n\n&lt;p&gt;Now she&amp;#39;s an indoor cat only. &lt;/p&gt;\n\n&lt;p&gt;Now she&amp;#39;s constantly trying to steal our food. Like will jump on the table, steal food and run.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6ap8p", "score_hidden": false, "stickied": false, "created": 1492050070.0, "created_utc": 1492021270.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg73xg7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bunnylizard", "parent_id": "t1_dg6yy9o", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Thanks for the info. I had heard something like that about grains before but it helps to have someone else reinforcing what I've read on the internets. \n\nI'm not sure if separating them all day will work, I have a small apartment with a roommate, so right now I have both litter boxes in the one bathroom (not a small bathroom thank christ), and nowhere to move the second one if I were to seperated them all day. There's only the kitchen (definite no), living room (roommate has friends over often), roommate's room (another definite no), or my room as options. Makes me wish I had a bigger apartment or house, so that option would be more feasible. \n\nI think I'm going to try the type of food bowl that only opens for a specific collar or microchip. That way I'll only have to buy one (they're expensive) for the smaller kitty, so it will keep big chubby away from stealing his food. :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the info. I had heard something like that about grains before but it helps to have someone else reinforcing what I&amp;#39;ve read on the internets. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if separating them all day will work, I have a small apartment with a roommate, so right now I have both litter boxes in the one bathroom (not a small bathroom thank christ), and nowhere to move the second one if I were to seperated them all day. There&amp;#39;s only the kitchen (definite no), living room (roommate has friends over often), roommate&amp;#39;s room (another definite no), or my room as options. Makes me wish I had a bigger apartment or house, so that option would be more feasible. &lt;/p&gt;\n\n&lt;p&gt;I think I&amp;#39;m going to try the type of food bowl that only opens for a specific collar or microchip. That way I&amp;#39;ll only have to buy one (they&amp;#39;re expensive) for the smaller kitty, so it will keep big chubby away from stealing his food. :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg73xg7", "score_hidden": false, "stickied": false, "created": 1492084635.0, "created_utc": 1492055835.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6yy9o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "callmedaddy109436284", "parent_id": "t1_dg6x82u", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Separate the cats during the day. Let then graze all day long, but close a door so one cat is on one side and the second cat is on the other. Litter boxes and water on both sides obviously. Only let them eat during the day, take away food at night. They'll still socialize at night so they won't hate each other.\n\nAlso! To help you better understand the qualities of cat foods - look for ingredients lists that have ZERO grains. Grains do not come naturally to feline nor canine diets. They are added to commercial pet food as cheap filler. So the absolute best thing you can do for them is to feed them straight up meat. Raw, just how they'd eat it in the wild. Buuuuut second best is food that is almost entirely made up of meat. So think chicken, fish, fowl kidneys, hearts, bones, liver, pancreas. Vitamins and minerals or something. Maybe the food company will throw on something wild like \"extract of blueberry\" or some weird shit like that. As long as your cat is getting enough taurine and is consuming liquids along with his wet/dry diet (espeeeeecially on dry food they need to drink water) then their diet is good.\n\nGood luck!", "edited": 1492058158.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Separate the cats during the day. Let then graze all day long, but close a door so one cat is on one side and the second cat is on the other. Litter boxes and water on both sides obviously. Only let them eat during the day, take away food at night. They&amp;#39;ll still socialize at night so they won&amp;#39;t hate each other.&lt;/p&gt;\n\n&lt;p&gt;Also! To help you better understand the qualities of cat foods - look for ingredients lists that have ZERO grains. Grains do not come naturally to feline nor canine diets. They are added to commercial pet food as cheap filler. So the absolute best thing you can do for them is to feed them straight up meat. Raw, just how they&amp;#39;d eat it in the wild. Buuuuut second best is food that is almost entirely made up of meat. So think chicken, fish, fowl kidneys, hearts, bones, liver, pancreas. Vitamins and minerals or something. Maybe the food company will throw on something wild like &amp;quot;extract of blueberry&amp;quot; or some weird shit like that. As long as your cat is getting enough taurine and is consuming liquids along with his wet/dry diet (espeeeeecially on dry food they need to drink water) then their diet is good.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6yy9o", "score_hidden": false, "stickied": false, "created": 1492077948.0, "created_utc": 1492049148.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6x82u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bunnylizard", "parent_id": "t1_dg5ypb7", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I figured that it would be hard to put a cat on a diet, moreso than other pets. I grew up with a pretty overweight cat but he was always running around outside and \"defending his territory\" so to speak, so he got fat but then stopped putting on more weight at a certain point. He also was part Maine Coon, so for all I know, that could've played a factor. \n\nThe big cat *loves* to play, fortunately! He has his brother to play with and they're often going quite wild out in the living room (it's tiled floors so I hear them sliding this way and that as they chase after each other). I have a bunch of cat toys for them both though, and I try to spend at least an hour playing with them everyday (can be tough to do with work, ect, but it means a lot to me to be able to do so).\n\nI'll check out the Metabolic food, but I'll keep trying some other ideas before I go for that. Expensive isn't quite up my alley at the moment. Maybe if work gave me a raise it'd be easier to obtain! :)\n\nI started off free feeding them both dry food and letting them come back to it over the day, and then feeding wet food at a specific time. I originally was given tons of pet food from the privately run adoption center that I found the kittens at, and the Natural Balance wet food they gave me seemed to be the best quality of the canned foods (I've done lots of research online but sometimes it's hard to figure out which sources are right and which ones aren't as truthful). For the past few months I've been saving up to move though so I've just been buying whatever cheap canned food I can find at Petsmart. I'm moving in with a roommate though, so that will help ease the burden of rent and bills away from only me, which will help me spend more for on my cats. \n\nYes, big cat would eat the majority of the wet food. I didn't notice it before a month or two ago, but it makes sense seeing as his growth was a lot more, ah, \"squishy\" in places than the smaller cat's. Of course, like I said, I believe this to be mainly because the smaller cat only likes to graze, he'll eat a bit I've noticed right when I feed them, but then leave his dish open for stealing from the big cat. So frustrating once I noticed it! \n\nI've been having to feed them seperately lately for the past month or so, trying to figure out a more permanent solution. I work all day so I feed them the wet food once I'm home and can watch them, plus then I keep smaller cat in my room with me all night, the door closed to big cat, and he can graze on his wet food or some sort food all night if he pleases. It's been working for the most part, but big cat likes to wake me up at ridiculous hours by scratching up my door and wanting to come in.\n\nI'll keep that in mind too! Never knew that. But it makes sense. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I figured that it would be hard to put a cat on a diet, moreso than other pets. I grew up with a pretty overweight cat but he was always running around outside and &amp;quot;defending his territory&amp;quot; so to speak, so he got fat but then stopped putting on more weight at a certain point. He also was part Maine Coon, so for all I know, that could&amp;#39;ve played a factor. &lt;/p&gt;\n\n&lt;p&gt;The big cat &lt;em&gt;loves&lt;/em&gt; to play, fortunately! He has his brother to play with and they&amp;#39;re often going quite wild out in the living room (it&amp;#39;s tiled floors so I hear them sliding this way and that as they chase after each other). I have a bunch of cat toys for them both though, and I try to spend at least an hour playing with them everyday (can be tough to do with work, ect, but it means a lot to me to be able to do so).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll check out the Metabolic food, but I&amp;#39;ll keep trying some other ideas before I go for that. Expensive isn&amp;#39;t quite up my alley at the moment. Maybe if work gave me a raise it&amp;#39;d be easier to obtain! :)&lt;/p&gt;\n\n&lt;p&gt;I started off free feeding them both dry food and letting them come back to it over the day, and then feeding wet food at a specific time. I originally was given tons of pet food from the privately run adoption center that I found the kittens at, and the Natural Balance wet food they gave me seemed to be the best quality of the canned foods (I&amp;#39;ve done lots of research online but sometimes it&amp;#39;s hard to figure out which sources are right and which ones aren&amp;#39;t as truthful). For the past few months I&amp;#39;ve been saving up to move though so I&amp;#39;ve just been buying whatever cheap canned food I can find at Petsmart. I&amp;#39;m moving in with a roommate though, so that will help ease the burden of rent and bills away from only me, which will help me spend more for on my cats. &lt;/p&gt;\n\n&lt;p&gt;Yes, big cat would eat the majority of the wet food. I didn&amp;#39;t notice it before a month or two ago, but it makes sense seeing as his growth was a lot more, ah, &amp;quot;squishy&amp;quot; in places than the smaller cat&amp;#39;s. Of course, like I said, I believe this to be mainly because the smaller cat only likes to graze, he&amp;#39;ll eat a bit I&amp;#39;ve noticed right when I feed them, but then leave his dish open for stealing from the big cat. So frustrating once I noticed it! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been having to feed them seperately lately for the past month or so, trying to figure out a more permanent solution. I work all day so I feed them the wet food once I&amp;#39;m home and can watch them, plus then I keep smaller cat in my room with me all night, the door closed to big cat, and he can graze on his wet food or some sort food all night if he pleases. It&amp;#39;s been working for the most part, but big cat likes to wake me up at ridiculous hours by scratching up my door and wanting to come in.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll keep that in mind too! Never knew that. But it makes sense. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6x82u", "score_hidden": false, "stickied": false, "created": 1492075798.0, "created_utc": 1492046998.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ypb7", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "VetTechnicallyNotYet", "parent_id": "t1_dg5n76r", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Hoo-boy. So I know I ranted about a fat cat in my story,  it truth is, I'm not up to snuff with how to put cats on a diet, especially if there are 2 cats and you can't restrict food access. I will say though, it is extremely hard to put cats on a diet, at least moreso than other animals. Cats can be finicky eaters, and some gobble their food while others will graze on it throughout the day. \n\nBut some basic advice would be: feed less, move more. You can't take big-cat for a walk, but does he like to play? Use a later pointer and have him chase it around, or get a stringed cat toy and have him attack that. Get a lower calorie food for them both. Separate them when feeding? That's the hardest of all, especially since your other cat grazes. Finally, there is a good formulated to help with weight loss in cats that is vet-grade, but it's expensive as hell. It's science diet's Metabolic, and personally I would feed that when all else fails. \n\nBut I'm curious: what are you feeding them both? Dry? Wet? How much? Is it free fed? Does Bigcat pilfer from littlecat's dish?\n\nI will toss this little tidbit out there: cats are obligate carnivores. This means that they eat meat, and only meat. Or at least they're supposed to. The only carbs they have access to (or want to eat) in the wild is digested plant matter from the prey they kill and eat. Keeping this in mind, when we feed them their diets that have a higher carb content, their bodies can't utilize them as much and will store it as fat. At least, that's what the vets at work tell me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hoo-boy. So I know I ranted about a fat cat in my story,  it truth is, I&amp;#39;m not up to snuff with how to put cats on a diet, especially if there are 2 cats and you can&amp;#39;t restrict food access. I will say though, it is extremely hard to put cats on a diet, at least moreso than other animals. Cats can be finicky eaters, and some gobble their food while others will graze on it throughout the day. &lt;/p&gt;\n\n&lt;p&gt;But some basic advice would be: feed less, move more. You can&amp;#39;t take big-cat for a walk, but does he like to play? Use a later pointer and have him chase it around, or get a stringed cat toy and have him attack that. Get a lower calorie food for them both. Separate them when feeding? That&amp;#39;s the hardest of all, especially since your other cat grazes. Finally, there is a good formulated to help with weight loss in cats that is vet-grade, but it&amp;#39;s expensive as hell. It&amp;#39;s science diet&amp;#39;s Metabolic, and personally I would feed that when all else fails. &lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;m curious: what are you feeding them both? Dry? Wet? How much? Is it free fed? Does Bigcat pilfer from littlecat&amp;#39;s dish?&lt;/p&gt;\n\n&lt;p&gt;I will toss this little tidbit out there: cats are obligate carnivores. This means that they eat meat, and only meat. Or at least they&amp;#39;re supposed to. The only carbs they have access to (or want to eat) in the wild is digested plant matter from the prey they kill and eat. Keeping this in mind, when we feed them their diets that have a higher carb content, their bodies can&amp;#39;t utilize them as much and will store it as fat. At least, that&amp;#39;s what the vets at work tell me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5ypb7", "score_hidden": false, "stickied": false, "created": 1492037430.0, "created_utc": 1492008630.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg63jki", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bijoudarling", "parent_id": "t1_dg5tjdz", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Had to look for our fosters too make sure you didn't catnap them. We call the kitten piggy piggy oink oink as he does the exact same thing. The other cat, whose just out of kitten hood, will not eat unless the two legged bringer of food is watching over them. Oh and when no one's looking he comes back and uses the throw rug to cover both food bowls.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Had to look for our fosters too make sure you didn&amp;#39;t catnap them. We call the kitten piggy piggy oink oink as he does the exact same thing. The other cat, whose just out of kitten hood, will not eat unless the two legged bringer of food is watching over them. Oh and when no one&amp;#39;s looking he comes back and uses the throw rug to cover both food bowls.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg63jki", "score_hidden": false, "stickied": false, "created": 1492042750.0, "created_utc": 1492013950.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6xhyb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bunnylizard", "parent_id": "t1_dg5tjdz", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Ah yeah! My bigger cat is certainly a piggy kitten! Although I don't blame him entirely as he didn't get much food in the first month of his life and was also the runt of his litter. Under a pound at 8 weeks! But now so squishy. \n\nThat's a good idea with the fridge and supervision! I'm doing much of the same lately, been working on different ideas and strategies for the past month. I'm really glad to hear it worked out finally for you and your furry guys! I guess I'll just have to settle in for the long haul and perhaps my two will become like that eventually.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah yeah! My bigger cat is certainly a piggy kitten! Although I don&amp;#39;t blame him entirely as he didn&amp;#39;t get much food in the first month of his life and was also the runt of his litter. Under a pound at 8 weeks! But now so squishy. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s a good idea with the fridge and supervision! I&amp;#39;m doing much of the same lately, been working on different ideas and strategies for the past month. I&amp;#39;m really glad to hear it worked out finally for you and your furry guys! I guess I&amp;#39;ll just have to settle in for the long haul and perhaps my two will become like that eventually.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6xhyb", "score_hidden": false, "stickied": false, "created": 1492076132.0, "created_utc": 1492047332.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tjdz", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "duccy_duc", "parent_id": "t1_dg5n76r", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I'm not OP, but I had an adult cat who would eat her wet food slowly in the mornings, no biggy, until we got a piggy kitten who would finish his food then push her out of the way and have a second helping. I decided to supervise them eating in the mornings to keep him away. If she didn't finish her food and I had to leave for work, I'd put it in the fridge and she can just eat kibble. Well it took a couple of years of morning supervision but now they both finish at the same time and he waits for her to leave before muscling in on her bowl.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not OP, but I had an adult cat who would eat her wet food slowly in the mornings, no biggy, until we got a piggy kitten who would finish his food then push her out of the way and have a second helping. I decided to supervise them eating in the mornings to keep him away. If she didn&amp;#39;t finish her food and I had to leave for work, I&amp;#39;d put it in the fridge and she can just eat kibble. Well it took a couple of years of morning supervision but now they both finish at the same time and he waits for her to leave before muscling in on her bowl.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5tjdz", "score_hidden": false, "stickied": false, "created": 1492030673.0, "created_utc": 1492001873.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6vxdx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bunnylizard", "parent_id": "t1_dg66hi2", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Yep, him being only a year old and easily riled up (due to his brother), means he's running and jumping around all the time. But yeah, every high counter or surface in the apartment, he can jump up to. Hw even jumps on the kitchen counter sometimes while I'm cooking, like he thinks I won't see him as I'm standing right there. \n\nOtherwise I'm sure that idea would work! I don't think he is quite too far into the \"overweight\" territory, but he's getting there and I'm trying to prevent it from becoming worse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, him being only a year old and easily riled up (due to his brother), means he&amp;#39;s running and jumping around all the time. But yeah, every high counter or surface in the apartment, he can jump up to. Hw even jumps on the kitchen counter sometimes while I&amp;#39;m cooking, like he thinks I won&amp;#39;t see him as I&amp;#39;m standing right there. &lt;/p&gt;\n\n&lt;p&gt;Otherwise I&amp;#39;m sure that idea would work! I don&amp;#39;t think he is quite too far into the &amp;quot;overweight&amp;quot; territory, but he&amp;#39;s getting there and I&amp;#39;m trying to prevent it from becoming worse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6vxdx", "score_hidden": false, "stickied": false, "created": 1492074185.0, "created_utc": 1492045385.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66hi2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "nicestpossibleway", "parent_id": "t1_dg5n76r", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Is the overweight cat still able to jump onto counters or other high surfaces? I had one cat who was underweight and was on special high calorie food from the vet, and another cat who was overweight that we had to put on a diet. We put the underweight cats food on the counter since the overweight cat was unable to jump that high due to his size. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is the overweight cat still able to jump onto counters or other high surfaces? I had one cat who was underweight and was on special high calorie food from the vet, and another cat who was overweight that we had to put on a diet. We put the underweight cats food on the counter since the overweight cat was unable to jump that high due to his size. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg66hi2", "score_hidden": false, "stickied": false, "created": 1492045798.0, "created_utc": 1492016998.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg9dmby", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "juel1979", "parent_id": "t1_dg5n76r", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "My dogs are like that. The heavier one would eat until she explodes and the skinny one finds eating a chore and would nibble all day. I schedule feed them and feed them out of the other's sight. Usually the chubby one won't touch her sister's bowl if she does walk away from it. You could try taking up the nibbler's bowl when she walks off and offer it again later. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My dogs are like that. The heavier one would eat until she explodes and the skinny one finds eating a chore and would nibble all day. I schedule feed them and feed them out of the other&amp;#39;s sight. Usually the chubby one won&amp;#39;t touch her sister&amp;#39;s bowl if she does walk away from it. You could try taking up the nibbler&amp;#39;s bowl when she walks off and offer it again later. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg9dmby", "score_hidden": false, "stickied": false, "created": 1492216743.0, "created_utc": 1492187943.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5n76r", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "bunnylizard", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I've got a question that's been bugging me for a while about feeding cats, and since you're a vet tech maybe you could offer some insight? I have two cats that are about one year old each. One is getting to be chubbier than average and the other is either a normal weight (small cat, though), or even a but underweight, but I'm no expert. I'm curious as to how I should go about trying to put the fatter one on a diet? I've gone over the issue so many times in my head and have tried different strategies but almost nothing seems to work. \n\nBasically, how can I put one cat on a diet without blocking food access for the normal-weight cat? The smaller cat also doesn't eat all his food at once but comes back to it over several hours - if it were a matter of them eating at the same time, and finishing around the same time, there wouldn't be so much of an issue. :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve got a question that&amp;#39;s been bugging me for a while about feeding cats, and since you&amp;#39;re a vet tech maybe you could offer some insight? I have two cats that are about one year old each. One is getting to be chubbier than average and the other is either a normal weight (small cat, though), or even a but underweight, but I&amp;#39;m no expert. I&amp;#39;m curious as to how I should go about trying to put the fatter one on a diet? I&amp;#39;ve gone over the issue so many times in my head and have tried different strategies but almost nothing seems to work. &lt;/p&gt;\n\n&lt;p&gt;Basically, how can I put one cat on a diet without blocking food access for the normal-weight cat? The smaller cat also doesn&amp;#39;t eat all his food at once but comes back to it over several hours - if it were a matter of them eating at the same time, and finishing around the same time, there wouldn&amp;#39;t be so much of an issue. :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5n76r", "score_hidden": false, "stickied": false, "created": 1492015041.0, "created_utc": 1491986241.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg5npah", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "SensenotsoCommon", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "People like that do not deserve pets.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People like that do not deserve pets.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5npah", "score_hidden": false, "stickied": false, "created": 1492016631.0, "created_utc": 1491987831.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6t4fj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "turkeybagsyyj", "parent_id": "t1_dg667ct", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Hell doctors don't even say that to parents who are over feeding their kids.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hell doctors don&amp;#39;t even say that to parents who are over feeding their kids.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6t4fj", "score_hidden": false, "stickied": false, "created": 1492070815.0, "created_utc": 1492042015.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg667ct", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "kororon", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I hate people like that. What would her response be if the vet straight up told her, \"Ma'am, you are torturing and killing your cat with food.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hate people like that. What would her response be if the vet straight up told her, &amp;quot;Ma&amp;#39;am, you are torturing and killing your cat with food.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg667ct", "score_hidden": false, "stickied": false, "created": 1492045511.0, "created_utc": 1492016711.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg8yclt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SecondComingOfYeezus", "parent_id": "t1_dg6jg3z", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "My response would be \"Well, ma'am, you're obviously an expert on nutrition. You and your daughter are so full of 'nutrients' you're just bursting at the seams. That must be why your cat's laying here with kidney stones and a feeding tube--good nutrition!\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My response would be &amp;quot;Well, ma&amp;#39;am, you&amp;#39;re obviously an expert on nutrition. You and your daughter are so full of &amp;#39;nutrients&amp;#39; you&amp;#39;re just bursting at the seams. That must be why your cat&amp;#39;s laying here with kidney stones and a feeding tube--good nutrition!&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8yclt", "score_hidden": false, "stickied": false, "created": 1492190297.0, "created_utc": 1492161497.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jg3z", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "macaroniinapan", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "*Mom, getting more flustered: I'm just worried he won't have the nutrients he'll need.*\n\nBecause that's what vets do, tell people to feed their pets stuff with inadequate nutrition.  They don't go to school for years and years to learn about proper animal nutrition or anything.  They just grab the first shit they see on the shelf and pulverize it and prescribe an arbitrary amount.  Yeah.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Mom, getting more flustered: I&amp;#39;m just worried he won&amp;#39;t have the nutrients he&amp;#39;ll need.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Because that&amp;#39;s what vets do, tell people to feed their pets stuff with inadequate nutrition.  They don&amp;#39;t go to school for years and years to learn about proper animal nutrition or anything.  They just grab the first shit they see on the shelf and pulverize it and prescribe an arbitrary amount.  Yeah.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6jg3z", "score_hidden": false, "stickied": false, "created": 1492059078.0, "created_utc": 1492030278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg5m946", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "GorillaWars", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I am infuriated at how people treat their pets sometimes. I see it a lot unfortunately and it breaks my heart every time I see a pet not being treated well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am infuriated at how people treat their pets sometimes. I see it a lot unfortunately and it breaks my heart every time I see a pet not being treated well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5m946", "score_hidden": false, "stickied": false, "created": 1492012161.0, "created_utc": 1491983361.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg81baf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MyTitsAreRustled", "parent_id": "t1_dg81746", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Plenty of shitty dog owners don't take their dogs outside and have them shit on newspapers,\n\nBut yes. Cats are noble and graceful creatures, and my cats have plenty of surfaces to jump around and play on and explore along with an enclosed porch.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plenty of shitty dog owners don&amp;#39;t take their dogs outside and have them shit on newspapers,&lt;/p&gt;\n\n&lt;p&gt;But yes. Cats are noble and graceful creatures, and my cats have plenty of surfaces to jump around and play on and explore along with an enclosed porch.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg81baf", "score_hidden": false, "stickied": false, "created": 1492138778.0, "created_utc": 1492109978.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81746", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Azryhael", "parent_id": "t1_dg80m37", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I agree, but for some reason it's the cats that break my heart more, I think because dogs at least get to go outside and get enrichment that way, but many cats are completely inside pets and their mental stimulation requires the ability to move and jump.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree, but for some reason it&amp;#39;s the cats that break my heart more, I think because dogs at least get to go outside and get enrichment that way, but many cats are completely inside pets and their mental stimulation requires the ability to move and jump.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg81746", "score_hidden": false, "stickied": false, "created": 1492138653.0, "created_utc": 1492109853.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80m37", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MyTitsAreRustled", "parent_id": "t1_dg67nbk", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Same could be said about dogs. I'm 100 percent a cat person, but dogs deserve the same good ownership as cats.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same could be said about dogs. I&amp;#39;m 100 percent a cat person, but dogs deserve the same good ownership as cats.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg80m37", "score_hidden": false, "stickied": false, "created": 1492138031.0, "created_utc": 1492109231.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67nbk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Azryhael", "parent_id": "t1_dg60wsz", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Agreed. It hurts my heart to see cats who can't run, jump, and play because their people think that just because many humans like to dream about lazing around all day and eating, that must be what will make a cat happy. No. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed. It hurts my heart to see cats who can&amp;#39;t run, jump, and play because their people think that just because many humans like to dream about lazing around all day and eating, that must be what will make a cat happy. No. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg67nbk", "score_hidden": false, "stickied": false, "created": 1492046963.0, "created_utc": 1492018163.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60wsz", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MyTitsAreRustled", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "As a cat-lover, this story absolutely infuriates me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a cat-lover, this story absolutely infuriates me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg60wsz", "score_hidden": false, "stickied": false, "created": 1492039889.0, "created_utc": 1492011089.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6nlhj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BuffaloBuckbeak", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Reads story\n\nCries", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reads story&lt;/p&gt;\n\n&lt;p&gt;Cries&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6nlhj", "score_hidden": false, "stickied": false, "created": 1492063962.0, "created_utc": 1492035162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg8wmj0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rachface636", "parent_id": "t1_dg8pa7o", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "It's way more common than discussed. Thank you for the sympathy, I can't explain the heartbreak. I'm so grateful he is happy and healthy now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s way more common than discussed. Thank you for the sympathy, I can&amp;#39;t explain the heartbreak. I&amp;#39;m so grateful he is happy and healthy now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8wmj0", "score_hidden": false, "stickied": false, "created": 1492184839.0, "created_utc": 1492156039.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8pa7o", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "VetTechnicallyNotYet", "parent_id": "t1_dg7c0gk", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Jeez dude, that is intense. And I don't think I've heard of anyone removing a cat's penis before. That sounds awful, and must be a tricky surgery for sure. I'm so sorry you and cat-friend had to go through that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jeez dude, that is intense. And I don&amp;#39;t think I&amp;#39;ve heard of anyone removing a cat&amp;#39;s penis before. That sounds awful, and must be a tricky surgery for sure. I&amp;#39;m so sorry you and cat-friend had to go through that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8pa7o", "score_hidden": false, "stickied": false, "created": 1492169624.0, "created_utc": 1492140824.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7c0gk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rachface636", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Goddamnit. I just spent 2 months of my life and close to $4600  to the vet because my Maine Coon  developed stones. I have never been as frightened and exhausted in my life, I can't even imagine the trauma he experienced as an animal. And these bitches won't even try. \n\nFor anyone curious as to the hell this sort of thing is,\n\n1. Four catheters over 6 weeks by the end he had so much scar tissue in his penis they couldn't pass the catheter anymore and had to use a needle to empty his bladder.\n\n2. Pissing blood.\n\n3. New, expensive cat food, all wet, that he hates and often wastes refusing leftovers, even with the expensive stimulate powder.\n\n4. Two 3 am emergency vet runs, one costing $1200.\n\n5. Pains meds syringed down his throat 3 times a day. So many pills.\n\n6. and ultimately, after 5 weeks of hell, the last resort. if he wouldn't stop developing the stones all they could was perform transgender surgery. Removed his penis and widened the opening.\n\nI am. not. making. this. up.\n\n5 days we watched him locked in the bedroom with a tube leaking piss and blood sewn into his body. He didn't eat or drink unforced for 5 fucking days. I've never been more scared. After another week the stitches came out and he was un quarantined. It took another week for his best friend, our girl cat to stop hissing. it took a few more days to get him to stop pissing in our bed. 3 weeks in total in the shame cone. \n\nHe's fine now, but still marking the rest of the house on occassion. Getting him to eat 6 ounces a day is trying, but getting better. \n\nMy point is, if I could claw my own skin to keep him from having to live through that I would. But they won't even buy the right food.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Goddamnit. I just spent 2 months of my life and close to $4600  to the vet because my Maine Coon  developed stones. I have never been as frightened and exhausted in my life, I can&amp;#39;t even imagine the trauma he experienced as an animal. And these bitches won&amp;#39;t even try. &lt;/p&gt;\n\n&lt;p&gt;For anyone curious as to the hell this sort of thing is,&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Four catheters over 6 weeks by the end he had so much scar tissue in his penis they couldn&amp;#39;t pass the catheter anymore and had to use a needle to empty his bladder.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Pissing blood.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;New, expensive cat food, all wet, that he hates and often wastes refusing leftovers, even with the expensive stimulate powder.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Two 3 am emergency vet runs, one costing $1200.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Pains meds syringed down his throat 3 times a day. So many pills.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;and ultimately, after 5 weeks of hell, the last resort. if he wouldn&amp;#39;t stop developing the stones all they could was perform transgender surgery. Removed his penis and widened the opening.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I am. not. making. this. up.&lt;/p&gt;\n\n&lt;p&gt;5 days we watched him locked in the bedroom with a tube leaking piss and blood sewn into his body. He didn&amp;#39;t eat or drink unforced for 5 fucking days. I&amp;#39;ve never been more scared. After another week the stitches came out and he was un quarantined. It took another week for his best friend, our girl cat to stop hissing. it took a few more days to get him to stop pissing in our bed. 3 weeks in total in the shame cone. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s fine now, but still marking the rest of the house on occassion. Getting him to eat 6 ounces a day is trying, but getting better. &lt;/p&gt;\n\n&lt;p&gt;My point is, if I could claw my own skin to keep him from having to live through that I would. But they won&amp;#39;t even buy the right food.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg7c0gk", "score_hidden": false, "stickied": false, "created": 1492102736.0, "created_utc": 1492073936.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6ii7p", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "cephalopodcat", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I feel awful now. My big kitty boy is over 20 pounds, but also friggin' *enormous* so I am always worried he's unhealthy. But when I took him to the vet and learned he needed to shed about a pound or two (phew, not clinically obese, just overweight according to the vet) I immediately switched him to low calorie food and when no weight loss happened, switched brands and serving sizes a couple times before shelling out for vet-recommended weight loss food. I want my baby boy to be fit and healthy and happy as long as possible! I care about him, I don't want him to suffer. (Especially diabetes, because I already know how shitty that is.)\n\nHes a large cat though, so fortunately bringing him down to about 18 pounds from 20 is the goal, and not like to 10 or 12 out of that much. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel awful now. My big kitty boy is over 20 pounds, but also friggin&amp;#39; &lt;em&gt;enormous&lt;/em&gt; so I am always worried he&amp;#39;s unhealthy. But when I took him to the vet and learned he needed to shed about a pound or two (phew, not clinically obese, just overweight according to the vet) I immediately switched him to low calorie food and when no weight loss happened, switched brands and serving sizes a couple times before shelling out for vet-recommended weight loss food. I want my baby boy to be fit and healthy and happy as long as possible! I care about him, I don&amp;#39;t want him to suffer. (Especially diabetes, because I already know how shitty that is.)&lt;/p&gt;\n\n&lt;p&gt;Hes a large cat though, so fortunately bringing him down to about 18 pounds from 20 is the goal, and not like to 10 or 12 out of that much. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6ii7p", "score_hidden": false, "stickied": false, "created": 1492058087.0, "created_utc": 1492029287.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg8yi6f", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SecondComingOfYeezus", "parent_id": "t1_dg6k0wp", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "If it cheers you up, I once read a story about a terrier whose elderly owner died, leaving him trapped in the house for a long time without food. By the time he was found and taken to a rescue, he was so traumatized and aggressive that he had to be put to sleep. The person who went to get him out of his cage tearfully asked if he wanted to \"go for a walk.\" The terrier instantly stopped growling and started wagging his tail. So they put him on a leash and walked him. They put him in a foster home where he got walked regularly, and he went back to being his happy, friendly self. He actually got saved by thinking he was going for a walk!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it cheers you up, I once read a story about a terrier whose elderly owner died, leaving him trapped in the house for a long time without food. By the time he was found and taken to a rescue, he was so traumatized and aggressive that he had to be put to sleep. The person who went to get him out of his cage tearfully asked if he wanted to &amp;quot;go for a walk.&amp;quot; The terrier instantly stopped growling and started wagging his tail. So they put him on a leash and walked him. They put him in a foster home where he got walked regularly, and he went back to being his happy, friendly self. He actually got saved by thinking he was going for a walk!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8yi6f", "score_hidden": false, "stickied": false, "created": 1492190793.0, "created_utc": 1492161993.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6k0wp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "The thought of the dog thinking they're going for a walk, wanting to play and be happy but being put down hurt my heart. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thought of the dog thinking they&amp;#39;re going for a walk, wanting to play and be happy but being put down hurt my heart. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6k0wp", "score_hidden": false, "stickied": false, "created": 1492059714.0, "created_utc": 1492030914.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6nyqa", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "starflite", "parent_id": "t1_dg6g1yx", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Make it rain, pupper!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make it rain, pupper!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6nyqa", "score_hidden": false, "stickied": false, "created": 1492064422.0, "created_utc": 1492035622.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6g1yx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "sexdrugsjokes", "parent_id": "t1_dg6ebfh", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Awesome.  This is super good info to have.  I really appreciate it.  I'm gunna do some research on foods soon :)\n\n[Here is your payment](https://imgur.com/gallery/zoG0t) hint: it's the puppy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome.  This is super good info to have.  I really appreciate it.  I&amp;#39;m gunna do some research on foods soon :)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/gallery/zoG0t\"&gt;Here is your payment&lt;/a&gt; hint: it&amp;#39;s the puppy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6g1yx", "score_hidden": false, "stickied": false, "created": 1492055567.0, "created_utc": 1492026767.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ebfh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "starflite", "parent_id": "t1_dg6dpmp", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "You're welcome! Keep in mind that if you do decide to try something else, take it slow when transitioning her onto a diet with higher fat/protein. Dogs will often get upset tummies if you change their diet abruptly because the microbes in their gut become accustomed to the same thing every day. Don't get discouraged if your pup has a little diarrhea or gas, just mix in a smaller amount of the new food with the old food next time and slowly increase the percentage of new food until she's eating only new food with no digestive upsets. Don't increase the new food until her bowel movements are normal again if she does have issues. \n\nMeat (such as \"deboned chicken\" or \"lamb\" or \"beef\") being the first ingredient can also be very misleading because it is very high in moisture, which adds to their weight and moves them up the ingredient list. In the case of your kibble, having the lamb meal as the second ingredient is a good thing because meat meals are much lower in moisture content than just \"lamb,\" and that means you probably have more lamb meal in there than lamb once you process the kibble into the form it is in the bag. Beware of kibbles where the first ingredient is something like \"deboned chicken\" (very high water content) and then is followed by 3+ plant ingredients such as rice, lentils, corn (god forbid), chickpeas or peas. Those plant ingredients will be much lower in moisture content and proportionally you're going to end up with a high-carb plant-based diet once that chicken loses all that moisture in the kibble extruder. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re welcome! Keep in mind that if you do decide to try something else, take it slow when transitioning her onto a diet with higher fat/protein. Dogs will often get upset tummies if you change their diet abruptly because the microbes in their gut become accustomed to the same thing every day. Don&amp;#39;t get discouraged if your pup has a little diarrhea or gas, just mix in a smaller amount of the new food with the old food next time and slowly increase the percentage of new food until she&amp;#39;s eating only new food with no digestive upsets. Don&amp;#39;t increase the new food until her bowel movements are normal again if she does have issues. &lt;/p&gt;\n\n&lt;p&gt;Meat (such as &amp;quot;deboned chicken&amp;quot; or &amp;quot;lamb&amp;quot; or &amp;quot;beef&amp;quot;) being the first ingredient can also be very misleading because it is very high in moisture, which adds to their weight and moves them up the ingredient list. In the case of your kibble, having the lamb meal as the second ingredient is a good thing because meat meals are much lower in moisture content than just &amp;quot;lamb,&amp;quot; and that means you probably have more lamb meal in there than lamb once you process the kibble into the form it is in the bag. Beware of kibbles where the first ingredient is something like &amp;quot;deboned chicken&amp;quot; (very high water content) and then is followed by 3+ plant ingredients such as rice, lentils, corn (god forbid), chickpeas or peas. Those plant ingredients will be much lower in moisture content and proportionally you&amp;#39;re going to end up with a high-carb plant-based diet once that chicken loses all that moisture in the kibble extruder. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6ebfh", "score_hidden": false, "stickied": false, "created": 1492053788.0, "created_utc": 1492024988.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dpmp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "sexdrugsjokes", "parent_id": "t1_dg6bl0t", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "That's a fantastic response thank you.\n\nMy math brings it to 51ish%. I had no idea the carbs would be so high. At least lamb is the first ingredient ... so that's nice. \n\nMaybe we will have to try some other food when we run out.  ... she is still a puppy if that makes a difference. I was under the impression that puppies need more protein and fat than adults. Especially bigger breed pups. So this is actually pretty disappointing.\n\nAgain:Thanks!  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a fantastic response thank you.&lt;/p&gt;\n\n&lt;p&gt;My math brings it to 51ish%. I had no idea the carbs would be so high. At least lamb is the first ingredient ... so that&amp;#39;s nice. &lt;/p&gt;\n\n&lt;p&gt;Maybe we will have to try some other food when we run out.  ... she is still a puppy if that makes a difference. I was under the impression that puppies need more protein and fat than adults. Especially bigger breed pups. So this is actually pretty disappointing.&lt;/p&gt;\n\n&lt;p&gt;Again:Thanks!  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6dpmp", "score_hidden": false, "stickied": false, "created": 1492053165.0, "created_utc": 1492024365.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bl0t", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "starflite", "parent_id": "t1_dg5yej7", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Not sure why you're being down voted for asking a question.\n\nLower carb diets are always best, and higher moisture lower carb diets are better still. If you can afford a commercially prepared canned or raw meat diet, that's my go-to recommendation. My vet is an advocate of raw or canned diets if they are properly planned, so don't just give your dog nothing but raw chicken wings and expect them to be healthy. You also can't give your dog the same exact canned product for the rest of its life if it is labeled \"for supplemental feeding only\" because those diets are not complete. Those diets are meant for rotational feeding or supplementation with a complete diet.\n\nHigh quality kibble is also a great place to start if you can't quite afford a more meat-based diet. I would recommend a kibble with less than 30% carbs if possible. Companies are not required to put carbs on their labels, so you need to [do a little easy math here](https://www.dogfoodadvisor.com/choosing-dog-food/dog-food-carbohydrate-content/) to estimate carbohydrate content of your food.\nI did the math on your kibble and came out with *roughly* *51% carbohydrates, which I consider to be too high. Dogs need more protein and fat, and don't require carbohydrates in their diet at all.\n\nEdited because oops math.", "edited": 1492027017.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not sure why you&amp;#39;re being down voted for asking a question.&lt;/p&gt;\n\n&lt;p&gt;Lower carb diets are always best, and higher moisture lower carb diets are better still. If you can afford a commercially prepared canned or raw meat diet, that&amp;#39;s my go-to recommendation. My vet is an advocate of raw or canned diets if they are properly planned, so don&amp;#39;t just give your dog nothing but raw chicken wings and expect them to be healthy. You also can&amp;#39;t give your dog the same exact canned product for the rest of its life if it is labeled &amp;quot;for supplemental feeding only&amp;quot; because those diets are not complete. Those diets are meant for rotational feeding or supplementation with a complete diet.&lt;/p&gt;\n\n&lt;p&gt;High quality kibble is also a great place to start if you can&amp;#39;t quite afford a more meat-based diet. I would recommend a kibble with less than 30% carbs if possible. Companies are not required to put carbs on their labels, so you need to &lt;a href=\"https://www.dogfoodadvisor.com/choosing-dog-food/dog-food-carbohydrate-content/\"&gt;do a little easy math here&lt;/a&gt; to estimate carbohydrate content of your food.\nI did the math on your kibble and came out with &lt;em&gt;roughly&lt;/em&gt; *51% carbohydrates, which I consider to be too high. Dogs need more protein and fat, and don&amp;#39;t require carbohydrates in their diet at all.&lt;/p&gt;\n\n&lt;p&gt;Edited because oops math.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6bl0t", "score_hidden": false, "stickied": false, "created": 1492050961.0, "created_utc": 1492022161.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg6mgcl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sexdrugsjokes", "parent_id": "t1_dg6l2qq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Mine is an Aussie and I am trying to get her kind of working because she has the drive for it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mine is an Aussie and I am trying to get her kind of working because she has the drive for it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6mgcl", "score_hidden": false, "stickied": false, "created": 1492062557.0, "created_utc": 1492033757.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6l2qq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "contrarian_barbarian", "parent_id": "t1_dg5yej7", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "That's the exact food I use for my Samoyed. According to the vet, she's in fantastic health (a touch overweight, but that's due to table scraps, not her food). I supplement it with some salmon oil.\n\nA lot of people recommend grain-free food, but it depends on the dog. I've tried switching her to other diets on a few occasions (high end brands, different proteins, and using a proper shift over the course of a couple of weeks of fading one food into the other); she gets sick every time. It's possible for a food to be too rich for some dogs to digest it properly, especially if they aren't an active working dog.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the exact food I use for my Samoyed. According to the vet, she&amp;#39;s in fantastic health (a touch overweight, but that&amp;#39;s due to table scraps, not her food). I supplement it with some salmon oil.&lt;/p&gt;\n\n&lt;p&gt;A lot of people recommend grain-free food, but it depends on the dog. I&amp;#39;ve tried switching her to other diets on a few occasions (high end brands, different proteins, and using a proper shift over the course of a couple of weeks of fading one food into the other); she gets sick every time. It&amp;#39;s possible for a food to be too rich for some dogs to digest it properly, especially if they aren&amp;#39;t an active working dog.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6l2qq", "score_hidden": false, "stickied": false, "created": 1492060921.0, "created_utc": 1492032121.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5yej7", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "sexdrugsjokes", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "So what dog food should I use?\n\nBecause I'm feeding Nutro large breed limited ingredient lamb and rice. I did some research and I think it's a good one but have no way to verify this (my vet is useless)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So what dog food should I use?&lt;/p&gt;\n\n&lt;p&gt;Because I&amp;#39;m feeding Nutro large breed limited ingredient lamb and rice. I did some research and I think it&amp;#39;s a good one but have no way to verify this (my vet is useless)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5yej7", "score_hidden": false, "stickied": false, "created": 1492037091.0, "created_utc": 1492008291.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg5wvbo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sparkly_Rainbows", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I had a cat for a total of 3.5 months shy of 13 years (2 months before he could leave mom, passed about a month amd a half from his birthday). He was always chubby (maybe a pound or two overweight) but a big cat. If he dropped weight, I got scared.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a cat for a total of 3.5 months shy of 13 years (2 months before he could leave mom, passed about a month amd a half from his birthday). He was always chubby (maybe a pound or two overweight) but a big cat. If he dropped weight, I got scared.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg5wvbo", "score_hidden": false, "stickied": false, "created": 1492035283.0, "created_utc": 1492006483.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg8nmtl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VetTechnicallyNotYet", "parent_id": "t1_dg6un0a", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Someone wrote out some good stuff for how to tell what foods to feed to a cat and how to tell if they're good or not. I don't own a cat, and I don't know many cat foods off the top of my head, but when you look at a bag of cat food, check out the ingredients. Make sure you don't see grains or corn in the first 5 ingredients. It should really list out meats taking up those slots. The carb and fat content should be low, and the protein should be moderate to high, depending on your cats' needs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Someone wrote out some good stuff for how to tell what foods to feed to a cat and how to tell if they&amp;#39;re good or not. I don&amp;#39;t own a cat, and I don&amp;#39;t know many cat foods off the top of my head, but when you look at a bag of cat food, check out the ingredients. Make sure you don&amp;#39;t see grains or corn in the first 5 ingredients. It should really list out meats taking up those slots. The carb and fat content should be low, and the protein should be moderate to high, depending on your cats&amp;#39; needs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8nmtl", "score_hidden": false, "stickied": false, "created": 1492167109.0, "created_utc": 1492138309.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6un0a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Y0y0r0ck3r", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Wait, what food DO you recommend? Just curious", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait, what food DO you recommend? Just curious&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6un0a", "score_hidden": false, "stickied": false, "created": 1492072648.0, "created_utc": 1492043848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg8p2bp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hemlocky_ergot", "parent_id": "t1_dg8nt15", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Perfect!  Thanks for responding.  I may take her in for a vet visit just to make sure everything is going good.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perfect!  Thanks for responding.  I may take her in for a vet visit just to make sure everything is going good.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8p2bp", "score_hidden": false, "stickied": false, "created": 1492169280.0, "created_utc": 1492140480.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nt15", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VetTechnicallyNotYet", "parent_id": "t1_dg6xafn", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I'm not a vet, so I can't say for certain, but it's not unusual for cats to take a long time to lose weight. \n\nNow I know rapid fat/weight loss can lead to some issues with the liver, but right now I forget why and how, and I don't want to say \"it'll make fatty liver and stuff!\" Because I don't want to accidentally feed(teehee) you the wrong information. \n\nOne tip I hear at work though, is to feed for the weight you want them to be, not the weight they are. Good luck with your kitkat, I hope she does well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not a vet, so I can&amp;#39;t say for certain, but it&amp;#39;s not unusual for cats to take a long time to lose weight. &lt;/p&gt;\n\n&lt;p&gt;Now I know rapid fat/weight loss can lead to some issues with the liver, but right now I forget why and how, and I don&amp;#39;t want to say &amp;quot;it&amp;#39;ll make fatty liver and stuff!&amp;quot; Because I don&amp;#39;t want to accidentally feed(teehee) you the wrong information. &lt;/p&gt;\n\n&lt;p&gt;One tip I hear at work though, is to feed for the weight you want them to be, not the weight they are. Good luck with your kitkat, I hope she does well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8nt15", "score_hidden": false, "stickied": false, "created": 1492167370.0, "created_utc": 1492138570.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xafn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hemlocky_ergot", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Hey just was hoping to get some input!  I have a fat cat and I'm working on getting  her to lose weight for about 1 and a half months.  She has lost a bit of weight which I'm super happy about  \nI also have her on vibrant maturity Purina one.  She is still full of energy and acts the same.  This is going to sound crazy- but what's too fast for weight loss?  It's not coming off super fast and I've only reduced her food by a bit but I want to make sure she isn't going to get sick. \n\nAs long as she acts the same and has energy she's okay right?  Sorry for the pet fatlogic.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey just was hoping to get some input!  I have a fat cat and I&amp;#39;m working on getting  her to lose weight for about 1 and a half months.  She has lost a bit of weight which I&amp;#39;m super happy about&lt;br/&gt;\nI also have her on vibrant maturity Purina one.  She is still full of energy and acts the same.  This is going to sound crazy- but what&amp;#39;s too fast for weight loss?  It&amp;#39;s not coming off super fast and I&amp;#39;ve only reduced her food by a bit but I want to make sure she isn&amp;#39;t going to get sick. &lt;/p&gt;\n\n&lt;p&gt;As long as she acts the same and has energy she&amp;#39;s okay right?  Sorry for the pet fatlogic.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6xafn", "score_hidden": false, "stickied": false, "created": 1492075876.0, "created_utc": 1492047076.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg8yj5d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SecondComingOfYeezus", "parent_id": "t1_dg6yijh", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "The mom is neglecting both her pet and her child, and unfortunately there's very little recourse for either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The mom is neglecting both her pet and her child, and unfortunately there&amp;#39;s very little recourse for either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8yj5d", "score_hidden": false, "stickied": false, "created": 1492190879.0, "created_utc": 1492162079.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6yijh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Larrytheflyingpenis", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I think what these two hams are doing should be considered animal abuse.Have em arrested and put em in jail for a nice long time for abusing the poor thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think what these two hams are doing should be considered animal abuse.Have em arrested and put em in jail for a nice long time for abusing the poor thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg6yijh", "score_hidden": false, "stickied": false, "created": 1492077394.0, "created_utc": 1492048594.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg8pdg9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VetTechnicallyNotYet", "parent_id": "t1_dg7nmc3", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Unfortunately I didn't get to see him after that. It could be that I never worked on his checkup days, he passed, or the owners never came back(unlikely considering we \"were the only clinic they could trust\" for their guinea pigs.)\n\nI work at a different clinic now, so I can't check up on them and find out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately I didn&amp;#39;t get to see him after that. It could be that I never worked on his checkup days, he passed, or the owners never came back(unlikely considering we &amp;quot;were the only clinic they could trust&amp;quot; for their guinea pigs.)&lt;/p&gt;\n\n&lt;p&gt;I work at a different clinic now, so I can&amp;#39;t check up on them and find out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8pdg9", "score_hidden": false, "stickied": false, "created": 1492169769.0, "created_utc": 1492140969.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7nmc3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Gato1486", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Oh my god that poor child.  Did he ever really recover?  Or did he at least get to go to sleep away from those abusers?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh my god that poor child.  Did he ever really recover?  Or did he at least get to go to sleep away from those abusers?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg7nmc3", "score_hidden": false, "stickied": false, "created": 1492124153.0, "created_utc": 1492095353.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg7r5yr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lilmisschainsaw", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Our most recent foster dog came into the shelter at 93 pounds, down from 102 at the vet. She should be 60 pounds.  \nShe's 3 years old, is diabetic, has joint issues, and has those lovely fleshy calluses from laying on hard surfaces with so much weight. But she is well trained with perfect manners; only thing her people failed on was her weight and her nails. The dog is so fat she can't run for more than a minute at a time. I don't understand people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Our most recent foster dog came into the shelter at 93 pounds, down from 102 at the vet. She should be 60 pounds.&lt;br/&gt;\nShe&amp;#39;s 3 years old, is diabetic, has joint issues, and has those lovely fleshy calluses from laying on hard surfaces with so much weight. But she is well trained with perfect manners; only thing her people failed on was her weight and her nails. The dog is so fat she can&amp;#39;t run for more than a minute at a time. I don&amp;#39;t understand people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg7r5yr", "score_hidden": false, "stickied": false, "created": 1492127970.0, "created_utc": 1492099170.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dg8yp7d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SecondComingOfYeezus", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "&gt; OF COURSE we don't want him losing weight\n\n&gt; we want him to be happy\n\nPick one, you neglectful fuck jar. \n\n&gt; After all, there's nothing wrong with being overweight!\n\nExcept that it's literally killing your cat. (And probably your daughter and yourself, but tbh I feel more sorry for the cat).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;OF COURSE we don&amp;#39;t want him losing weight&lt;/p&gt;\n\n&lt;p&gt;we want him to be happy&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Pick one, you neglectful fuck jar. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;After all, there&amp;#39;s nothing wrong with being overweight!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Except that it&amp;#39;s literally killing your cat. (And probably your daughter and yourself, but tbh I feel more sorry for the cat).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg8yp7d", "score_hidden": false, "stickied": false, "created": 1492191422.0, "created_utc": 1492162622.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_64w4sq", "likes": null, "replies": "", "user_reports": [], "id": "dgciiuo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Type_II_Bot", "parent_id": "t3_64w4sq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "\nOther stories from /u/VetTechnicallyNotYet:\n\n* 04/16/2017 - [Not even organ failure.](http://www.reddit.com/r/fatpeoplestories/comments/65ncl6/not_even_organ_failure/)\n\n* 04/12/2017 - [Fatlogic in the Veterinary Field](http://www.reddit.com/r/fatpeoplestories/comments/64w4sq/fatlogic_in_the_veterinary_field/) (this)\n\n_____\n^If ^you ^want ^to ^get ^notified ^as ^soon ^as ^VetTechnicallyNotYet ^posts ^a ^new ^story, [^click ^here](http://www.reddit.com/message/compose/?to=Type_II_Bot&amp;subject=subscribe&amp;message=subscribe%20/u/VetTechnicallyNotYet)^.\n\n^(Hi I'm Type_II_Bot, for more info about me visit /r/Type_II_Bot)\n\n^Find ^this ^bot ^helpful? ^Consider ^donating [^$1](https://www.paypal.me/r3d4rmy/1)^, [^$5](https://www.paypal.me/r3d4rmy/5)^, ^or ^with ^BTC: ^1FEjYZAeUvY6zEx4x3SShxMwCZcqSHfNoH", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Other stories from &lt;a href=\"/u/VetTechnicallyNotYet\"&gt;/u/VetTechnicallyNotYet&lt;/a&gt;:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;04/16/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/65ncl6/not_even_organ_failure/\"&gt;Not even organ failure.&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/12/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/64w4sq/fatlogic_in_the_veterinary_field/\"&gt;Fatlogic in the Veterinary Field&lt;/a&gt; (this)&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;If&lt;/sup&gt; &lt;sup&gt;you&lt;/sup&gt; &lt;sup&gt;want&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;get&lt;/sup&gt; &lt;sup&gt;notified&lt;/sup&gt; &lt;sup&gt;as&lt;/sup&gt; &lt;sup&gt;soon&lt;/sup&gt; &lt;sup&gt;as&lt;/sup&gt; &lt;sup&gt;VetTechnicallyNotYet&lt;/sup&gt; &lt;sup&gt;posts&lt;/sup&gt; &lt;sup&gt;a&lt;/sup&gt; &lt;sup&gt;new&lt;/sup&gt; &lt;sup&gt;story,&lt;/sup&gt; &lt;a href=\"http://www.reddit.com/message/compose/?to=Type_II_Bot&amp;amp;subject=subscribe&amp;amp;message=subscribe%20/u/VetTechnicallyNotYet\"&gt;&lt;sup&gt;click&lt;/sup&gt; &lt;sup&gt;here&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;.&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;Hi I&amp;#39;m Type_II_Bot, for more info about me visit &lt;a href=\"/r/Type_II_Bot\"&gt;/r/Type_II_Bot&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;Find&lt;/sup&gt; &lt;sup&gt;this&lt;/sup&gt; &lt;sup&gt;bot&lt;/sup&gt; &lt;sup&gt;helpful?&lt;/sup&gt; &lt;sup&gt;Consider&lt;/sup&gt; &lt;sup&gt;donating&lt;/sup&gt; &lt;a href=\"https://www.paypal.me/r3d4rmy/1\"&gt;&lt;sup&gt;$1&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;,&lt;/sup&gt; &lt;a href=\"https://www.paypal.me/r3d4rmy/5\"&gt;&lt;sup&gt;$5&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;,&lt;/sup&gt; &lt;sup&gt;or&lt;/sup&gt; &lt;sup&gt;with&lt;/sup&gt; &lt;sup&gt;BTC:&lt;/sup&gt; &lt;sup&gt;1FEjYZAeUvY6zEx4x3SShxMwCZcqSHfNoH&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgciiuo", "score_hidden": false, "stickied": false, "created": 1492402688.0, "created_utc": 1492373888.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]