[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "fatpeoplestories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;have rapid metabolism, can&amp;#39;t miss a meal without getting very hungry&lt;/p&gt;\n\n&lt;p&gt;have access to school food kitchen due to being teacher&amp;#39;s pet with the cuisine teaching staff, and passion for cooking&lt;/p&gt;\n\n&lt;p&gt;bring a large pizza in and cook it&lt;/p&gt;\n\n&lt;p&gt;have a large pizza which I begin eating for lunch&lt;/p&gt;\n\n&lt;p&gt;fat person sees me eating pizza, is eating a salad and complains I&amp;#39;m making them extremely hungry&lt;/p&gt;\n\n&lt;p&gt;it&amp;#39;s not my issue to deal with. Smile and tuck in.&lt;/p&gt;\n\n&lt;p&gt;they weigh twice as much as me, same age&lt;/p&gt;\n\n&lt;p&gt;eat most of the pizza for lunch, sans two slices which is shared with a disadvantaged person I know&lt;/p&gt;\n\n&lt;p&gt;fat person gained complains about gaining weight the next day&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t understand. I barely did exercise back then. How do people get fat? It seems so easy to simply lose weight. Do some fat people genuinely believe that a diet alone loses weight, or do they cheat on their diet?&lt;/p&gt;\n\n&lt;p&gt;TL;DR: Thin OP eats 3/4 of a large pizza for lunch, accidentally torments a fat person who is hungry and forced to eat salads, who gains weight the next day&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "&gt;have rapid metabolism, can't miss a meal without getting very hungry\n\n&gt;have access to school food kitchen due to being teacher's pet with the cuisine teaching staff, and passion for cooking\n\n&gt;bring a large pizza in and cook it\n\n&gt;have a large pizza which I begin eating for lunch\n\n&gt;fat person sees me eating pizza, is eating a salad and complains I'm making them extremely hungry\n\n&gt;it's not my issue to deal with. Smile and tuck in.\n\n&gt;they weigh twice as much as me, same age\n\n&gt;eat most of the pizza for lunch, sans two slices which is shared with a disadvantaged person I know\n\n&gt;fat person gained complains about gaining weight the next day\n\nI don't understand. I barely did exercise back then. How do people get fat? It seems so easy to simply lose weight. Do some fat people genuinely believe that a diet alone loses weight, or do they cheat on their diet?\n\nTL;DR: Thin OP eats 3/4 of a large pizza for lunch, accidentally torments a fat person who is hungry and forced to eat salads, who gains weight the next day", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Short", "id": "65e5o0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "V_Akesson", "saved": false, "mod_reports": [], "name": "t3_65e5o0", "subreddit_name_prefixed": "r/fatpeoplestories", "approved_by": null, "over_18": false, "domain": "self.fatpeoplestories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vzax", "edited": false, "link_flair_css_class": "short", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/fatpeoplestories/comments/65e5o0/accidentally_tormented_a_fat_persons_hunger_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492222151.0, "url": "https://www.reddit.com/r/fatpeoplestories/comments/65e5o0/accidentally_tormented_a_fat_persons_hunger_and/", "author_flair_text": null, "quarantine": false, "title": "Accidentally tormented a fat person's hunger and diet with my lunch", "created_utc": 1492193351.0, "distinguished": null, "media": null, "upvote_ratio": 0.49, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65e5o0", "likes": null, "replies": "", "user_reports": [], "id": "dgao9ts", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "mattricide", "parent_id": "t3_65e5o0", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "if that's all you eat in a day then it makes sense that you didnt get fat. its not metabolism. its you correlating that one large meal with you eating a lot. sure you ate a lot... once a day. fat people eat a lot all the time. you pretty much practiced intermittent fasting without meaning to.\n\ntl;dr you might have a fast metabolism but it wouldnt be enough to prevent you from getting fat if you actually ate like a fatty", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;if that&amp;#39;s all you eat in a day then it makes sense that you didnt get fat. its not metabolism. its you correlating that one large meal with you eating a lot. sure you ate a lot... once a day. fat people eat a lot all the time. you pretty much practiced intermittent fasting without meaning to.&lt;/p&gt;\n\n&lt;p&gt;tl;dr you might have a fast metabolism but it wouldnt be enough to prevent you from getting fat if you actually ate like a fatty&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgao9ts", "score_hidden": false, "stickied": false, "created": 1492293896.0, "created_utc": 1492265096.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65e5o0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65e5o0", "likes": null, "replies": "", "user_reports": [], "id": "dg9lnkl", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Shadowpaddlingaway", "parent_id": "t1_dg9jre0", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Agree. Even though I lost all the weight, I still remember the struggle with food. I ate a bunch of things which I later discovered I was allergic to and intolerant. Stuff just made me not only bloated by I felt like a fucking puff fish. When young, I use to eat bread and drink milk regularly but the same quantity as my mother and she wasn't fat. I did more exercise than her including the cleaning was all on me. But I was fat. She never believed me when I complained about food making me sick. There was always tones of veggies (which I loved) but also pasta (which I hate). Soda only in special occasions but I hate the stuff. Coke you say? Didn't you mean liquid rubber with sugar? Awful. So yeah. My metabolism is slow alright. But that's not an excuse. Especially after getting your diet right without the shit that makes you sick. I don't really miss anything except for cheese and sometimes I eat it even if I will balloon up again and pass the next few days farting out the fifth symphony. People want to simplify shit too much, that's the problem. CICO is the foundation you should build your diet upon but it's not only the amount of calories that influences ones looks and health. And it's true that a slow metabolism only gives a few extra pounds but stuff adds up. C'est la vie. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agree. Even though I lost all the weight, I still remember the struggle with food. I ate a bunch of things which I later discovered I was allergic to and intolerant. Stuff just made me not only bloated by I felt like a fucking puff fish. When young, I use to eat bread and drink milk regularly but the same quantity as my mother and she wasn&amp;#39;t fat. I did more exercise than her including the cleaning was all on me. But I was fat. She never believed me when I complained about food making me sick. There was always tones of veggies (which I loved) but also pasta (which I hate). Soda only in special occasions but I hate the stuff. Coke you say? Didn&amp;#39;t you mean liquid rubber with sugar? Awful. So yeah. My metabolism is slow alright. But that&amp;#39;s not an excuse. Especially after getting your diet right without the shit that makes you sick. I don&amp;#39;t really miss anything except for cheese and sometimes I eat it even if I will balloon up again and pass the next few days farting out the fifth symphony. People want to simplify shit too much, that&amp;#39;s the problem. CICO is the foundation you should build your diet upon but it&amp;#39;s not only the amount of calories that influences ones looks and health. And it&amp;#39;s true that a slow metabolism only gives a few extra pounds but stuff adds up. C&amp;#39;est la vie. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg9lnkl", "score_hidden": false, "stickied": false, "created": 1492226154.0, "created_utc": 1492197354.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65e5o0", "likes": null, "replies": "", "user_reports": [], "id": "dgag7xo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Bicit", "parent_id": "t1_dg9jre0", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I've only seen evidence to the contrary. every fat person I've known is stuffing down candy from somewhere or there's like full cakes gone in a week from just a couple people ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve only seen evidence to the contrary. every fat person I&amp;#39;ve known is stuffing down candy from somewhere or there&amp;#39;s like full cakes gone in a week from just a couple people &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgag7xo", "score_hidden": false, "stickied": false, "created": 1492272923.0, "created_utc": 1492244123.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jre0", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "BoofahKingWho", "parent_id": "t3_65e5o0", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Having a fast metabolism is a real thing, as is having a slow one.  I'm on the latter side these days so I can't eat like that. Not that I'd want to, mind you; overeating makes me feel ill now.  \n\nA decade or so ago I decided being fat sucked.  I ate about 750 calories a day for a few months and dropped 70lbs. and I've kept it off ever since.  I talk to fat friends about what I did and they just cannot comprehend making such a choice and sticking to it.  I feel bad for them, but even they confess that at the end of the day it's what it is: **a choice.**", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having a fast metabolism is a real thing, as is having a slow one.  I&amp;#39;m on the latter side these days so I can&amp;#39;t eat like that. Not that I&amp;#39;d want to, mind you; overeating makes me feel ill now.  &lt;/p&gt;\n\n&lt;p&gt;A decade or so ago I decided being fat sucked.  I ate about 750 calories a day for a few months and dropped 70lbs. and I&amp;#39;ve kept it off ever since.  I talk to fat friends about what I did and they just cannot comprehend making such a choice and sticking to it.  I feel bad for them, but even they confess that at the end of the day it&amp;#39;s what it is: &lt;strong&gt;a choice.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dg9jre0", "score_hidden": false, "stickied": false, "created": 1492223872.0, "created_utc": 1492195072.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}]