[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "fatpeoplestories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Only recently dicovered this sub, first time posting.  &lt;/p&gt;\n\n&lt;p&gt;So here&amp;#39;s the thing.  I have run the gamut of body sizes.  When I was a child/teenager, I was thin, like &amp;quot;built like a shotgun&amp;quot; thin, to the point where I had some significant blood sugar issues.  Then I started having babies, and got plump.  Okay, I was getting pretty darned fat before it was all over with (6&amp;#39;0&amp;quot;, close to 300lbs; yeah, I&amp;#39;m a girl, we grow &amp;#39;em tall in my family).  &lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m back to thin again.  It&amp;#39;s not out of any hard work or merit on my part, sadly.  I spent over a year with undiagnosed Crohn&amp;#39;s.  It was awful.  Excruciating pain, vomiting, diarrhea, food phobias, you name it.  I had hundreds of dollars of food in my house, and I was starving to death; weird, no?  I lost over 150lbs of weight (in the worst way possible).  At one point, the only thing I could keep down without agony was clear soup and cottage cheese.  On Monday I&amp;#39;d have a half a bowl of soup; on Tuesday, I&amp;#39;d have a cup of cottage cheese.  Wednesday, do without.  Thursday, start the cycle over again.  &lt;/p&gt;\n\n&lt;p&gt;My hair fell out.  Between vomiting and vitamin deficiencies, I &lt;em&gt;demolished&lt;/em&gt; my teeth.  Permanent liver damage; permanent heart damage.  Lost so much muscle mass and calcium (not to mention spending so much time bedridden) it permanently deformed my posture. I ended up in emergency surgery twice, goodbye two feet of intestine, hello wheelchair and complete lifestyle rebuild.  I count it a gift from God that I didn&amp;#39;t end up with a colostomy bag and a feeding tube (like some Crohn&amp;#39;s patients).  Or dead; not dead is good.&lt;/p&gt;\n\n&lt;p&gt;-100/10, would not recommend.&lt;/p&gt;\n\n&lt;p&gt;Why did I go so long undiagnosed?  Because, just as I was becoming seriously ill, my mother&amp;#39;s life was ending; Alzheimer&amp;#39;s.  I was primary caregiver, so I felt my attention and my energy needed to be on her.  In hindsight, not my wisest decision. &lt;/p&gt;\n\n&lt;p&gt;There were a few good things that came of it, though.  First, maybe I couldn&amp;#39;t eat, but damn it, I could THINK about food.  I would spend hours and hours every day, pouring over cooking videos, recipe websites, you name it.  I used to think it was odd when I read about ED patients obsessing about food; now it makes perfect sense.  I swore, when I got better, I was gonna cook all these terrific recipes I kept reading about.  AND I DID!  And it was every bit as awesome as it sounds.  Who needs Disneyland?  I had allrecipes.com!&lt;/p&gt;\n\n&lt;p&gt;Second:  my tastes changed.  Before I got sick, I was a junk food junkie.  Not so much about sweets, but I never met a fried food I didn&amp;#39;t like.  You couldn&amp;#39;t pay me to eat a tomato.  Nowadays, my husband teases me because I buy a couple pounds of tomatoes every week or so in winter (we grow them in summer).  The same is true for cabbage, broccoli, squash, most veggies:  I still won&amp;#39;t eat peas or raw celery (blech!), but beyond that, yum! Everything tastes soooo gooooood!  I look at it like a pregnant woman&amp;#39;s cravings:  my body must need the minerals in those foods, or they wouldn&amp;#39;t taste so nice to me.&lt;/p&gt;\n\n&lt;p&gt;For the record:  double tomato bruschetta, half fresh tomato, half sundried (I dry my own, it&amp;#39;s cheaper in the long run), onion, generous splash of balsamic vinegar, a little basil and oregano, chill overnight, holy moley, it&amp;#39;s good.  A couple slices of toast with bruschetta, plus a cup of cottage cheese and a bottle of water is a heavenly breakfast for me.&lt;/p&gt;\n\n&lt;p&gt;Third, I had to learn to maximize my food quality.  Crohn&amp;#39;s doesn&amp;#39;t go away.  Even after the surgery, there is still pain, there is still vomiting/nausea, there is still chronic bathroom issues, there&amp;#39;s all the damage done to my entire GI tract.  Thanks to all that, there is a constant battle with malabsorption/malnutrition.  I have vitamin injections, lots of pills, and I am constantly fighting to keep my weight up.  I have to eat five small meals a day, and every meal has to &lt;em&gt;count.&lt;/em&gt;  No sweets, no junk food, very little soda.  Lots of good protein, lots of veggies, only good carbs.  Avoid the foods that trigger an attack. Nothing fried (instant nausea); mostly baked, steamed, or stewed.  I am an absolute fiend for soups, and grilled veggies are like crack cocaine.&lt;/p&gt;\n\n&lt;p&gt;Fifth:  I need to state how wonderful my family is.  When I got sick, my family stepped up.  My daughter, particularly, quit work to look after me, and basically took over the house, did all cooking, did all cleaning, did all errand running; she became the Mom while I was too sick to do it.  Now I&amp;#39;m doing better, she&amp;#39;s gone back to work, and my son is here during the day to help me when I need it; husband and daughter help when they&amp;#39;re home.  My husband quit his job (he was a long haul truck driver) and took a job that paid half as much, but let him be home every night so he could be here to help.  I am soooo proud of them; I can&amp;#39;t praise them enough.&lt;/p&gt;\n\n&lt;p&gt;Sixth:  one nice thing about losing my hair.  I lost &lt;em&gt;all&lt;/em&gt; of it.  I haven&amp;#39;t had to shave my legs in ages.  It all disappeared and never came back.  That&amp;#39;s one job I don&amp;#39;t miss! LOL&lt;/p&gt;\n\n&lt;p&gt;Now, as to why I&amp;#39;m on FPS.  There are five people in my household:  my husband, my younger daughter, my younger son, my unmarried sister, and myself (I have an older son and an older daughter, but both are married and on their own).  Until I got sick, all of us were in the mildly overweight category.  I&amp;#39;m responsible for most of the cooking in the house.  They eat what I eat, and most of them are delighted to be eating healthy.&lt;/p&gt;\n\n&lt;p&gt;The problem is my sister.  She is not quite in Hambeast territory (6&amp;#39;1&amp;quot;, 350-ish lbs; told ya, we grow &amp;#39;em tall), but she&amp;#39;s getting there.  I understand, really I do:  she&amp;#39;s lonely, she&amp;#39;s bored, and she&amp;#39;s sad.   She is still in mourning for our mother; the two of them were very close.  She doesn&amp;#39;t work outside the home (she had a job, but quit).  She doesn&amp;#39;t help inside the house.  Even when I was bedridden, she wouldn&amp;#39;t sweep the living room or cook herself a grilled cheese sandwich.  She does  do her own laundry (because nobody else will do it).  &lt;/p&gt;\n\n&lt;p&gt;She medicates her sadness with food.  All she does is sit in her room, all day, every day, and eat.  My food budget is tight enough with me not working, and sweets are right off my diet; but when I buy fruit (the only real sweet stuff in my food plan), she doesn&amp;#39;t want that.  She wants cakes and cookies and grumbles when I don&amp;#39;t buy them.  On pizza night, she&amp;#39;ll buy herself two pizzas, saying, &amp;quot;One for tonight, one for tomorrow.&amp;quot;  And then eat them both at one go, and ask for Taco Bell the next day, as though I forgot all about that extra pizza.  &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t make nasty food, and I make generous amounts (I adore leftovers, so I always try to make extra).  But she doesn&amp;#39;t want it.  Baked lemonade pork chops with grilled veg and rice pilaf?  Nope.  Minestrone soup and homemade bread?  Not interested.   Every once in a while my husband will spitchcock a turkey and slow smoke it with a mulled cider glaze, and wow is it good!  She wants nothing to do with it.  She wants cakes and potato chips and fast food, and that&amp;#39;s it.&lt;/p&gt;\n\n&lt;p&gt;My doctor has encouraged me to &lt;em&gt;gently&lt;/em&gt; exercise, to rebuild muscle mass and help with my posture (has to be gentle, because of the heart damage and the need to hang onto whatever  weight I gain).  This ends up being &amp;quot;assisted walks,&amp;quot; using my wheelchair as a walker, and sitting down and riding if my heart rate gets too high.  My son and I downloaded the Zombies Run exergame, and we do a slow-speed zombie chase in the mornings, LOL.  I&amp;#39;ve begged my sister to come with us. Hell, I even paid for a YMCA membership (which I couldn&amp;#39;t afford), so Sister and I could go swimming year round. Nope, she wasn&amp;#39;t having it.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what &amp;quot;fatlogic&amp;quot; she&amp;#39;s using; it&amp;#39;s not a subject that&amp;#39;s allowed to come up.  Any effort to talk about it is instantly shut down.  I know her body image is very warped, she&amp;#39;s very down on herself, but again, that discussion is verboten.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t get me wrong. I love my sister desperately.  I want her to be happy. As long as I have a home, she has a home. As long as I have food, she&amp;#39;ll have food. But I can&amp;#39;t afford to support my diet plus hers.  I have way too much on me, just staying alive; I don&amp;#39;t have the strength to help her, too.  She balks at every effort to make her life a little better.  My husband has seriously started to lose patience with her.  I&amp;#39;m frustrated, too.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Only recently dicovered this sub, first time posting.  \n\nSo here's the thing.  I have run the gamut of body sizes.  When I was a child/teenager, I was thin, like \"built like a shotgun\" thin, to the point where I had some significant blood sugar issues.  Then I started having babies, and got plump.  Okay, I was getting pretty darned fat before it was all over with (6'0\", close to 300lbs; yeah, I'm a girl, we grow 'em tall in my family).  \n\nNow I'm back to thin again.  It's not out of any hard work or merit on my part, sadly.  I spent over a year with undiagnosed Crohn's.  It was awful.  Excruciating pain, vomiting, diarrhea, food phobias, you name it.  I had hundreds of dollars of food in my house, and I was starving to death; weird, no?  I lost over 150lbs of weight (in the worst way possible).  At one point, the only thing I could keep down without agony was clear soup and cottage cheese.  On Monday I'd have a half a bowl of soup; on Tuesday, I'd have a cup of cottage cheese.  Wednesday, do without.  Thursday, start the cycle over again.  \n\nMy hair fell out.  Between vomiting and vitamin deficiencies, I *demolished* my teeth.  Permanent liver damage; permanent heart damage.  Lost so much muscle mass and calcium (not to mention spending so much time bedridden) it permanently deformed my posture. I ended up in emergency surgery twice, goodbye two feet of intestine, hello wheelchair and complete lifestyle rebuild.  I count it a gift from God that I didn't end up with a colostomy bag and a feeding tube (like some Crohn's patients).  Or dead; not dead is good.\n\n-100/10, would not recommend.\n\nWhy did I go so long undiagnosed?  Because, just as I was becoming seriously ill, my mother's life was ending; Alzheimer's.  I was primary caregiver, so I felt my attention and my energy needed to be on her.  In hindsight, not my wisest decision. \n\nThere were a few good things that came of it, though.  First, maybe I couldn't eat, but damn it, I could THINK about food.  I would spend hours and hours every day, pouring over cooking videos, recipe websites, you name it.  I used to think it was odd when I read about ED patients obsessing about food; now it makes perfect sense.  I swore, when I got better, I was gonna cook all these terrific recipes I kept reading about.  AND I DID!  And it was every bit as awesome as it sounds.  Who needs Disneyland?  I had allrecipes.com!\n\nSecond:  my tastes changed.  Before I got sick, I was a junk food junkie.  Not so much about sweets, but I never met a fried food I didn't like.  You couldn't pay me to eat a tomato.  Nowadays, my husband teases me because I buy a couple pounds of tomatoes every week or so in winter (we grow them in summer).  The same is true for cabbage, broccoli, squash, most veggies:  I still won't eat peas or raw celery (blech!), but beyond that, yum! Everything tastes soooo gooooood!  I look at it like a pregnant woman's cravings:  my body must need the minerals in those foods, or they wouldn't taste so nice to me.\n\nFor the record:  double tomato bruschetta, half fresh tomato, half sundried (I dry my own, it's cheaper in the long run), onion, generous splash of balsamic vinegar, a little basil and oregano, chill overnight, holy moley, it's good.  A couple slices of toast with bruschetta, plus a cup of cottage cheese and a bottle of water is a heavenly breakfast for me.\n\nThird, I had to learn to maximize my food quality.  Crohn's doesn't go away.  Even after the surgery, there is still pain, there is still vomiting/nausea, there is still chronic bathroom issues, there's all the damage done to my entire GI tract.  Thanks to all that, there is a constant battle with malabsorption/malnutrition.  I have vitamin injections, lots of pills, and I am constantly fighting to keep my weight up.  I have to eat five small meals a day, and every meal has to *count.*  No sweets, no junk food, very little soda.  Lots of good protein, lots of veggies, only good carbs.  Avoid the foods that trigger an attack. Nothing fried (instant nausea); mostly baked, steamed, or stewed.  I am an absolute fiend for soups, and grilled veggies are like crack cocaine.\n\nFifth:  I need to state how wonderful my family is.  When I got sick, my family stepped up.  My daughter, particularly, quit work to look after me, and basically took over the house, did all cooking, did all cleaning, did all errand running; she became the Mom while I was too sick to do it.  Now I'm doing better, she's gone back to work, and my son is here during the day to help me when I need it; husband and daughter help when they're home.  My husband quit his job (he was a long haul truck driver) and took a job that paid half as much, but let him be home every night so he could be here to help.  I am soooo proud of them; I can't praise them enough.\n\nSixth:  one nice thing about losing my hair.  I lost *all* of it.  I haven't had to shave my legs in ages.  It all disappeared and never came back.  That's one job I don't miss! LOL\n\nNow, as to why I'm on FPS.  There are five people in my household:  my husband, my younger daughter, my younger son, my unmarried sister, and myself (I have an older son and an older daughter, but both are married and on their own).  Until I got sick, all of us were in the mildly overweight category.  I'm responsible for most of the cooking in the house.  They eat what I eat, and most of them are delighted to be eating healthy.\n\nThe problem is my sister.  She is not quite in Hambeast territory (6'1\", 350-ish lbs; told ya, we grow 'em tall), but she's getting there.  I understand, really I do:  she's lonely, she's bored, and she's sad.   She is still in mourning for our mother; the two of them were very close.  She doesn't work outside the home (she had a job, but quit).  She doesn't help inside the house.  Even when I was bedridden, she wouldn't sweep the living room or cook herself a grilled cheese sandwich.  She does  do her own laundry (because nobody else will do it).  \n\nShe medicates her sadness with food.  All she does is sit in her room, all day, every day, and eat.  My food budget is tight enough with me not working, and sweets are right off my diet; but when I buy fruit (the only real sweet stuff in my food plan), she doesn't want that.  She wants cakes and cookies and grumbles when I don't buy them.  On pizza night, she'll buy herself two pizzas, saying, \"One for tonight, one for tomorrow.\"  And then eat them both at one go, and ask for Taco Bell the next day, as though I forgot all about that extra pizza.  \n\nI don't make nasty food, and I make generous amounts (I adore leftovers, so I always try to make extra).  But she doesn't want it.  Baked lemonade pork chops with grilled veg and rice pilaf?  Nope.  Minestrone soup and homemade bread?  Not interested.   Every once in a while my husband will spitchcock a turkey and slow smoke it with a mulled cider glaze, and wow is it good!  She wants nothing to do with it.  She wants cakes and potato chips and fast food, and that's it.\n\nMy doctor has encouraged me to *gently* exercise, to rebuild muscle mass and help with my posture (has to be gentle, because of the heart damage and the need to hang onto whatever  weight I gain).  This ends up being \"assisted walks,\" using my wheelchair as a walker, and sitting down and riding if my heart rate gets too high.  My son and I downloaded the Zombies Run exergame, and we do a slow-speed zombie chase in the mornings, LOL.  I've begged my sister to come with us. Hell, I even paid for a YMCA membership (which I couldn't afford), so Sister and I could go swimming year round. Nope, she wasn't having it.\n\nI don't know what \"fatlogic\" she's using; it's not a subject that's allowed to come up.  Any effort to talk about it is instantly shut down.  I know her body image is very warped, she's very down on herself, but again, that discussion is verboten.\n\nDon't get me wrong. I love my sister desperately.  I want her to be happy. As long as I have a home, she has a home. As long as I have food, she'll have food. But I can't afford to support my diet plus hers.  I have way too much on me, just staying alive; I don't have the strength to help her, too.  She balks at every effort to make her life a little better.  My husband has seriously started to lose patience with her.  I'm frustrated, too.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Epic", "id": "65pbpb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 138, "report_reasons": null, "author": "AJClarkson", "saved": false, "mod_reports": [], "name": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "approved_by": null, "over_18": false, "domain": "self.fatpeoplestories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vzax", "edited": false, "link_flair_css_class": "epic", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/fatpeoplestories/comments/65pbpb/frustration/", "num_reports": null, "locked": false, "stickied": false, "created": 1492381274.0, "url": "https://www.reddit.com/r/fatpeoplestories/comments/65pbpb/frustration/", "author_flair_text": null, "quarantine": false, "title": "Frustration", "created_utc": 1492352474.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 138}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgddw94", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Mitch_Mitcherson", "parent_id": "t1_dgddr0s", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Humira is one of those drugs you prescribe when everything else fails. I'd ask about Apriso first, then Mercaptopurine (M-6) if that doesn't work. Once you start Humira or Remicade there really isn't any stopping. They're immunosuppresants, so if you stop taking them for too long your body builds up an immunity to them and they won't work again. Those first two are pills, much easier than injections (humira) or infusions (remicade).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Humira is one of those drugs you prescribe when everything else fails. I&amp;#39;d ask about Apriso first, then Mercaptopurine (M-6) if that doesn&amp;#39;t work. Once you start Humira or Remicade there really isn&amp;#39;t any stopping. They&amp;#39;re immunosuppresants, so if you stop taking them for too long your body builds up an immunity to them and they won&amp;#39;t work again. Those first two are pills, much easier than injections (humira) or infusions (remicade).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgddw94", "score_hidden": false, "stickied": false, "created": 1492458374.0, "created_utc": 1492429574.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgddr0s", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "AJClarkson", "parent_id": "t1_dgc3r55", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Thank you so much!  I'll definitely check them out.  My doctor has not prescribed Humira, though I don't know why.  Several people have recommended it.  Right now, I'm on omaprazole and ranitidine, both basically antacids; it does nothing for the diarrhea or pain.  The situation is very frustrating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much!  I&amp;#39;ll definitely check them out.  My doctor has not prescribed Humira, though I don&amp;#39;t know why.  Several people have recommended it.  Right now, I&amp;#39;m on omaprazole and ranitidine, both basically antacids; it does nothing for the diarrhea or pain.  The situation is very frustrating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgddr0s", "score_hidden": false, "stickied": false, "created": 1492458018.0, "created_utc": 1492429218.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3r55", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "Mitch_Mitcherson", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Hey OP, you may want to check out /r/CrohnsDisease if you want to talk about it. Are you taking anything for it? Humira has done wonders for my U.C.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey OP, you may want to check out &lt;a href=\"/r/CrohnsDisease\"&gt;/r/CrohnsDisease&lt;/a&gt; if you want to talk about it. Are you taking anything for it? Humira has done wonders for my U.C.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgc3r55", "score_hidden": false, "stickied": false, "created": 1492382929.0, "created_utc": 1492354129.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgde0ke", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AJClarkson", "parent_id": "t1_dgc4xkq", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Thank you.  I know my story is very downbeat, compared to a lot of the hysterically funny (and shocking) stories here.  But I don't want to give the wrong impression.  We are a happy family 99.99% of the time; I count myself an unbelievably blessed woman.  I talk to all my sisters (there are four of us) every day.  My married daughter calls me every day (my married son does not, but we're working on that). My husband grumbles at us because he's trying to watch Cincinnati lose another game, and he can't hear it because Younger Daughter and I are talking about books, or Younger Son is telling me about the new FF7 reboot or whatever.\n\nMaybe that's part of the problem?  We're all incredibly tight, almost weirdly so.  Maybe Sister feels left out?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you.  I know my story is very downbeat, compared to a lot of the hysterically funny (and shocking) stories here.  But I don&amp;#39;t want to give the wrong impression.  We are a happy family 99.99% of the time; I count myself an unbelievably blessed woman.  I talk to all my sisters (there are four of us) every day.  My married daughter calls me every day (my married son does not, but we&amp;#39;re working on that). My husband grumbles at us because he&amp;#39;s trying to watch Cincinnati lose another game, and he can&amp;#39;t hear it because Younger Daughter and I are talking about books, or Younger Son is telling me about the new FF7 reboot or whatever.&lt;/p&gt;\n\n&lt;p&gt;Maybe that&amp;#39;s part of the problem?  We&amp;#39;re all incredibly tight, almost weirdly so.  Maybe Sister feels left out?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgde0ke", "score_hidden": false, "stickied": false, "created": 1492458658.0, "created_utc": 1492429858.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4xkq", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "FixedMyFace", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I'm so sorry for your painful struggle!  I really hope that your sister has an aha moment and becomes appreciative of the love you are all giving her.  Sounds like you married a wonderful man and raised some great kids ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry for your painful struggle!  I really hope that your sister has an aha moment and becomes appreciative of the love you are all giving her.  Sounds like you married a wonderful man and raised some great kids &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgc4xkq", "score_hidden": false, "stickied": false, "created": 1492384668.0, "created_utc": 1492355868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgc5y1d", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "BoofahKingWho", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I too have supported family and friends who had nowhere to go.  Ultimately I have found time &amp; time again the best remedy was to make them man up (er, person up) and go elsewhere.  I have a serenity now I never had then and I won't be giving it up without some serious soul-searching.  Blood of the covenant and womb and all that shit, you know.\n\nYou have a family of your own and plenty of struggles by all accounts.  I am happy to hear you've dodged some bad things even while struggling with others.  I too lost hair (albeit not all, blessedly) and dealt with vitamin deficiencies.  I never had Crohn's but my hair is a glorified comb over and my spine which already was bad off is bad now too.  I could not imagine taking on someone else's burdens a this point in my life.\n\nI don't know your struggle and I never will, but I do care.  Do not let anyone else's problems become your own.  Please take care of yourself, AJC, and be well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I too have supported family and friends who had nowhere to go.  Ultimately I have found time &amp;amp; time again the best remedy was to make them man up (er, person up) and go elsewhere.  I have a serenity now I never had then and I won&amp;#39;t be giving it up without some serious soul-searching.  Blood of the covenant and womb and all that shit, you know.&lt;/p&gt;\n\n&lt;p&gt;You have a family of your own and plenty of struggles by all accounts.  I am happy to hear you&amp;#39;ve dodged some bad things even while struggling with others.  I too lost hair (albeit not all, blessedly) and dealt with vitamin deficiencies.  I never had Crohn&amp;#39;s but my hair is a glorified comb over and my spine which already was bad off is bad now too.  I could not imagine taking on someone else&amp;#39;s burdens a this point in my life.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know your struggle and I never will, but I do care.  Do not let anyone else&amp;#39;s problems become your own.  Please take care of yourself, AJC, and be well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgc5y1d", "score_hidden": false, "stickied": false, "created": 1492386065.0, "created_utc": 1492357265.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgcuarn", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "surprise_b1tch", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I'm sorry to hear about your struggles and I'm glad you're back on the road to recovery!\n\nAfter reading your post, I wonder if you are perhaps enabling your sister. Especially that last paragraph. You say she'll always have a home, but you can't afford to support her diet. Perhaps it may be time for some tough love. If she is not disabled, she needs to at least get a part-time position to pay for her food. If she isn't contributing to the household at all - not even doing chores?! - well, that sounds an awful lot like her freeloading off your generosity, to me. \n\nI spent some time homeless last year and all my efforts were focused on getting a job to get back on my feet. I cooked &amp; cleaned to earn my keep. I've been clinically depressed before, &amp; I understand the exhaustion and lack of motivation, but having a job during that time really helped my depression. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry to hear about your struggles and I&amp;#39;m glad you&amp;#39;re back on the road to recovery!&lt;/p&gt;\n\n&lt;p&gt;After reading your post, I wonder if you are perhaps enabling your sister. Especially that last paragraph. You say she&amp;#39;ll always have a home, but you can&amp;#39;t afford to support her diet. Perhaps it may be time for some tough love. If she is not disabled, she needs to at least get a part-time position to pay for her food. If she isn&amp;#39;t contributing to the household at all - not even doing chores?! - well, that sounds an awful lot like her freeloading off your generosity, to me. &lt;/p&gt;\n\n&lt;p&gt;I spent some time homeless last year and all my efforts were focused on getting a job to get back on my feet. I cooked &amp;amp; cleaned to earn my keep. I&amp;#39;ve been clinically depressed before, &amp;amp; I understand the exhaustion and lack of motivation, but having a job during that time really helped my depression. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgcuarn", "score_hidden": false, "stickied": false, "created": 1492418455.0, "created_utc": 1492389655.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgc3fkg", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "AJClarkson", "parent_id": "t1_dgc3b01", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I never said I could count!  LOL", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I never said I could count!  LOL&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgc3fkg", "score_hidden": false, "stickied": false, "created": 1492382432.0, "created_utc": 1492353632.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3b01", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "mattricide", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Whats fourth? the suspense is killing me", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whats fourth? the suspense is killing me&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgc3b01", "score_hidden": false, "stickied": false, "created": 1492382237.0, "created_utc": 1492353437.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgde3br", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AJClarkson", "parent_id": "t1_dgcb1sr", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "My husband is gonna kill you now, LOL.  All I need is another place to get recipe ideas!  \n\nLOL, thanks, I just checked it out and it's awesome!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My husband is gonna kill you now, LOL.  All I need is another place to get recipe ideas!  &lt;/p&gt;\n\n&lt;p&gt;LOL, thanks, I just checked it out and it&amp;#39;s awesome!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgde3br", "score_hidden": false, "stickied": false, "created": 1492458838.0, "created_utc": 1492430038.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcb1sr", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "SilverBear_92", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Hey OP, checkout r/kitchenprivilege\n\nYou can find great recipes and post your own", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey OP, checkout &lt;a href=\"/r/kitchenprivilege\"&gt;r/kitchenprivilege&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;You can find great recipes and post your own&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgcb1sr", "score_hidden": false, "stickied": false, "created": 1492392830.0, "created_utc": 1492364030.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgdfmto", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AJClarkson", "parent_id": "t1_dgcuyl8", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Oh, I definitely think there's a part of her that's maybe a little jealous of me.  I'm surrounded by my husband and children, and she's lonely.  We try to include her -- being the Cool Aunt is a rocking role, one she used to enjoy -- but she's not having it.\n\nNOTE:  She's not Miss Lonelyhearts.  From the time she was a teen, she never wanted a husband or children.  She's had several lovers, but I don't think she's had a traditional sweetheart since high school, by her own choice.  Perfectly acceptable, and no judgment from me.  But it does have its downsides, same as any other lifestyle choice.  She needs some sort of companionship, and I'm just not cutting the mustard right now.  \n\nMy dad always swore Sister could sell shoes to a legless man.  Even as a kid she was good at talking to people, connecting with them (as a lifelong nerd, you betcha Teenage Me was jealous as hell!).  She worked like ten or twelve years as a sales rep for a grocery wholesaler, and was damned good at it.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, I definitely think there&amp;#39;s a part of her that&amp;#39;s maybe a little jealous of me.  I&amp;#39;m surrounded by my husband and children, and she&amp;#39;s lonely.  We try to include her -- being the Cool Aunt is a rocking role, one she used to enjoy -- but she&amp;#39;s not having it.&lt;/p&gt;\n\n&lt;p&gt;NOTE:  She&amp;#39;s not Miss Lonelyhearts.  From the time she was a teen, she never wanted a husband or children.  She&amp;#39;s had several lovers, but I don&amp;#39;t think she&amp;#39;s had a traditional sweetheart since high school, by her own choice.  Perfectly acceptable, and no judgment from me.  But it does have its downsides, same as any other lifestyle choice.  She needs some sort of companionship, and I&amp;#39;m just not cutting the mustard right now.  &lt;/p&gt;\n\n&lt;p&gt;My dad always swore Sister could sell shoes to a legless man.  Even as a kid she was good at talking to people, connecting with them (as a lifelong nerd, you betcha Teenage Me was jealous as hell!).  She worked like ten or twelve years as a sales rep for a grocery wholesaler, and was damned good at it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgdfmto", "score_hidden": false, "stickied": false, "created": 1492462038.0, "created_utc": 1492433238.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcuyl8", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "needsahammer", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "**You can't save someone who does not want to be saved.** \n\nI'm sorry that your sister isn't receptive to your efforts to help. \n\nI don't want to make assumptions, but I'll offer a theory: I think it's possible that she sees you working very hard to battle Crohn's, knows she isn't healthy, feels guilty for not trying harder, and her self-esteem dips lower. She declines the healthy food you offer because she doesn't feel like its worth the effort, and probably thinks you're being condescending by offering. She seeks comfort food to make her feel better for a moment. Maybe she doesn't go to the YMCA with you because she thinks it's too late to try, and you asking her to come is rubbing it in her face the path she's chosen. Even though you have good intentions, she will see these efforts as an attack on her and will get defensive. It's an unhealthy thought cycle. \n\nI'm sorry that she doesn't see it coming from a place of love and concern. It's not your fault. It's also not your responsibility, she's a grown adult. I say stop buying her groceries and leave her out of any healthy talk. Maybe work on ways to increase her self-esteem. What are the things she is good at? \n\nIt sounds like you are making great progress in managing your disease and you have a loving support system from your husband and children. \nFocus on yourself and them. Stay positive. Be a stellar example for her to look up to and hopefully, your sister will see how happy you are and want it for herself. She's going to have to want it first. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;You can&amp;#39;t save someone who does not want to be saved.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry that your sister isn&amp;#39;t receptive to your efforts to help. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to make assumptions, but I&amp;#39;ll offer a theory: I think it&amp;#39;s possible that she sees you working very hard to battle Crohn&amp;#39;s, knows she isn&amp;#39;t healthy, feels guilty for not trying harder, and her self-esteem dips lower. She declines the healthy food you offer because she doesn&amp;#39;t feel like its worth the effort, and probably thinks you&amp;#39;re being condescending by offering. She seeks comfort food to make her feel better for a moment. Maybe she doesn&amp;#39;t go to the YMCA with you because she thinks it&amp;#39;s too late to try, and you asking her to come is rubbing it in her face the path she&amp;#39;s chosen. Even though you have good intentions, she will see these efforts as an attack on her and will get defensive. It&amp;#39;s an unhealthy thought cycle. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry that she doesn&amp;#39;t see it coming from a place of love and concern. It&amp;#39;s not your fault. It&amp;#39;s also not your responsibility, she&amp;#39;s a grown adult. I say stop buying her groceries and leave her out of any healthy talk. Maybe work on ways to increase her self-esteem. What are the things she is good at? &lt;/p&gt;\n\n&lt;p&gt;It sounds like you are making great progress in managing your disease and you have a loving support system from your husband and children. \nFocus on yourself and them. Stay positive. Be a stellar example for her to look up to and hopefully, your sister will see how happy you are and want it for herself. She&amp;#39;s going to have to want it first. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgcuyl8", "score_hidden": false, "stickied": false, "created": 1492419334.0, "created_utc": 1492390534.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgcvpn6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "vi0lent", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "She sounds depressed. Enabling her isn't doing her any favours. If she's not disabled then she needs to sort out her mental health, get a job, and start pitching in around the house.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She sounds depressed. Enabling her isn&amp;#39;t doing her any favours. If she&amp;#39;s not disabled then she needs to sort out her mental health, get a job, and start pitching in around the house.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgcvpn6", "score_hidden": false, "stickied": false, "created": 1492420316.0, "created_utc": 1492391516.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgdegyv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AJClarkson", "parent_id": "t1_dgcch1c", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "You have all my sympathy, sincerely.  There is one food I miss, too.  Southerner here; we take our fried chicken seriously.  My mother-in-law makes fried chicken that is a religious experience, even by Southern standards.  So much goodness.  So much unhappiness if I eat it.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have all my sympathy, sincerely.  There is one food I miss, too.  Southerner here; we take our fried chicken seriously.  My mother-in-law makes fried chicken that is a religious experience, even by Southern standards.  So much goodness.  So much unhappiness if I eat it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgdegyv", "score_hidden": false, "stickied": false, "created": 1492459714.0, "created_utc": 1492430914.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcch1c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Mmizzy", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I miss tomatoes so much. Just severe ibs and ibd thank god no chrohns but those delicious tomatoes are a nono ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I miss tomatoes so much. Just severe ibs and ibd thank god no chrohns but those delicious tomatoes are a nono &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgcch1c", "score_hidden": false, "stickied": false, "created": 1492394698.0, "created_utc": 1492365898.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgdfvmw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AJClarkson", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Small victory! tiny tiny minuscule victory, but I'll take it, whatever the size.  Getting Sister out and moving is like pulling teeth, but I think we managed it.  Our Older Sister and i love MST3K and Rifftrax -- Thanks to Sister, btw, she turned us onto it -- and they have periodic live shows, simulcast to theaters all over.  Older Sister and I go to these simulcast shows when I feel well enough.  We always invite Sister, but she never comes.\n\nThere's a re-showing of last week's live show tomorrow at our local theater (we didn't get to the actual live simulcast because Holy Week).  Older Sister and I were talking about it last night, confirming times and discussing The Plan.  Sister popped out of her room and said, \"Can I tag along?\"  HURRAH!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Small victory! tiny tiny minuscule victory, but I&amp;#39;ll take it, whatever the size.  Getting Sister out and moving is like pulling teeth, but I think we managed it.  Our Older Sister and i love MST3K and Rifftrax -- Thanks to Sister, btw, she turned us onto it -- and they have periodic live shows, simulcast to theaters all over.  Older Sister and I go to these simulcast shows when I feel well enough.  We always invite Sister, but she never comes.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a re-showing of last week&amp;#39;s live show tomorrow at our local theater (we didn&amp;#39;t get to the actual live simulcast because Holy Week).  Older Sister and I were talking about it last night, confirming times and discussing The Plan.  Sister popped out of her room and said, &amp;quot;Can I tag along?&amp;quot;  HURRAH!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgdfvmw", "score_hidden": false, "stickied": false, "created": 1492462486.0, "created_utc": 1492433686.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgd1mwp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ExistentialPain", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Has your sister been like this for over three months? It sounds like your sister has severe depression and would see great benefit in seeking counseling and medication. As someone with lifelong severe depression, I've seen the benefit in medication every time I need to go back to taking it.\n\n\nRegardless of what others are saying about tough love, I wouldn't suggest kicking your sister when she's down and throwing her out on the street. She just needs some prodding to get going again.\n\n\nIt would be a very good idea to explain that money is tight and she needs to start helping out with that. If you can get her to go to a doctor before all, do so. If they can help her, it will make everything else so much easier. Then have her get a temp job if she doesn't want to get a real job. That's better than nothing and it will get her out of the house. \n\n\nGetting her to see a therapist is probably the most important thing. They can suggest medication if it's appropriate and also speak to her about the process of mourning. Right now she's just spinning her wheels and self medicating with carbs and sugar. It's a phase that can't be allowed to continue long term. \n\n\nWith no income, she should be eligible for all kinds of assistance as long as she doesn't claim to be part of your household.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Has your sister been like this for over three months? It sounds like your sister has severe depression and would see great benefit in seeking counseling and medication. As someone with lifelong severe depression, I&amp;#39;ve seen the benefit in medication every time I need to go back to taking it.&lt;/p&gt;\n\n&lt;p&gt;Regardless of what others are saying about tough love, I wouldn&amp;#39;t suggest kicking your sister when she&amp;#39;s down and throwing her out on the street. She just needs some prodding to get going again.&lt;/p&gt;\n\n&lt;p&gt;It would be a very good idea to explain that money is tight and she needs to start helping out with that. If you can get her to go to a doctor before all, do so. If they can help her, it will make everything else so much easier. Then have her get a temp job if she doesn&amp;#39;t want to get a real job. That&amp;#39;s better than nothing and it will get her out of the house. &lt;/p&gt;\n\n&lt;p&gt;Getting her to see a therapist is probably the most important thing. They can suggest medication if it&amp;#39;s appropriate and also speak to her about the process of mourning. Right now she&amp;#39;s just spinning her wheels and self medicating with carbs and sugar. It&amp;#39;s a phase that can&amp;#39;t be allowed to continue long term. &lt;/p&gt;\n\n&lt;p&gt;With no income, she should be eligible for all kinds of assistance as long as she doesn&amp;#39;t claim to be part of your household.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgd1mwp", "score_hidden": false, "stickied": false, "created": 1492428499.0, "created_utc": 1492399699.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65pbpb", "likes": null, "replies": "", "user_reports": [], "id": "dgebqx5", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Mini_Mongoose", "parent_id": "t3_65pbpb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Sometimes I feel like some ham planets are beyond saving.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes I feel like some ham planets are beyond saving.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgebqx5", "score_hidden": false, "stickied": false, "created": 1492501224.0, "created_utc": 1492472424.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]