[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "fatpeoplestories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this story really won&amp;#39;t contain too much fat logic. You will probably just leave after reading this story and just feel sad for the kid. Let&amp;#39;s start off with a little context first doh.&lt;/p&gt;\n\n&lt;p&gt;My grandma had 11 kids. 4 girls 7 boys. Grandpa died when my mom was 6. Yeah yeh, ya know babyboomer generation, post-WW2, it was kinda common for huge families to be a thing around that time. Be me, only child, of course, while the rest of my family all has brothers and sisters with them.&lt;/p&gt;\n\n&lt;p&gt;Meet my older cousin Candy with her two sons Nick and Chris. Nick is age 11. Chris is age 9. Candy is notorious for playing beta to them, she really lets them do whatever they want and takes no initiative to discipline them. As a result, the two brothers can be quite a handful. Well, at least they used to be. I can remember a time when Chris and Nick were full of energy. They were a lively, annoying, go-all-out kind of bunch that just couldn&amp;#39;t be controlled at family gatherings. They caused A LOT of mischief at Easter dinner, Christmas, Labor Day, Memorial day picnics, my family had all dat shizz because we&amp;#39;re so big. I even overheard how Nick and Chris were a huge handful at school too where they would get in trouble A LOT. Nick had to repeat the 3rd grade, but Chris was doing really well in his academics. And I&amp;#39;ll be damned if I say this kid isn&amp;#39;t smart. This kid is a genius. He always thinks of the absolute best places to hide the Easter eggs for the little kids during egg hunts.&lt;/p&gt;\n\n&lt;p&gt;Now as you can imagine... 3 years ago when Chris was 6 he started putting on A LOT of weight. I&amp;#39;d say that when he was 6 he was maybe 70 pounds, now he&amp;#39;s like 150. Sure the kid&amp;#39;s tall for his age. I mean he&amp;#39;s 2 years behind Nick and already over an inch taller than him standing at 5 foot 0. I look at the kid now and just think:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;That kid is gonna grow up to be way taller than me.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;My reasoning? Well, his dad&amp;#39;s like 6 foot and it&amp;#39;s quite obvious since he&amp;#39;s already taller than his older brother that he got the &amp;quot;big&amp;quot; genes in him. But unfortunately, I guess, here&amp;#39;s where the good news ends for Chris&amp;#39; situation and well being.&lt;/p&gt;\n\n&lt;p&gt;After Chris&amp;#39; &amp;quot;ballooning&amp;quot; a very distinct emotional change began happening to him. He was no longer the annoying, gun-hoe, leech of a kid he used to be. Now he was shy, low self-esteem, isolated, anti-social, etc. The kid is a damn recluse. Why just last Labor Day he spent nearly the entire family picnic cramped up inside his mom&amp;#39;s car for 4 hours playing his Gameboy until it ran out of power and he had to go outside. I guess I should be sort of thankful. Candy his mom seems to have gotten his weight gain under control since he&amp;#39;s not ballooning anymore. I can only hope his belly doesn&amp;#39;t get too much bigger than it already is. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s kinda strange but I miss the old Chris. Sure he was a nuisance and a bully at family gatherings, but now he&amp;#39;s just a sad, shy little kid. I can tell he gets bullied. He wears glasses, he&amp;#39;s really smart, he&amp;#39;s fat, and he&amp;#39;s so anti-social, those are like all the pointers kids need to bully you like crazy at school. Why just this Easter dinner he was sitting out in the living room of my Uncle Frank&amp;#39;s house looking all depressed not knowing what to do with himself. Nick his brother, often misses that he can&amp;#39;t play with Chris like he used to when they were younger because now Chris is so much different. He&amp;#39;s full of so much self-doubt about himself and I couldn&amp;#39;t help but feel so sorry for him. I miss the old Chris. The Chris that would literally team up with his brother Nick and drag me around the picnic gatherings through the dirt. I miss the super annoying almost psuedo-bully Chris. I miss the mischievous prankster he used to be. And I can tell his older brother Nick, who is like 90 pounds, misses how his younger brother used to be too. I am not sure if his older brother, Nick, also partakes in bullying him about his weight or body, but I would hope not. &lt;/p&gt;\n\n&lt;p&gt;If there&amp;#39;s any silver lining it&amp;#39;s that Chris loves animals. There&amp;#39;s this 1 stray cat that hides out by my Uncle Frank&amp;#39;s house that Chris always spends time with everytime he&amp;#39;s at our family gatherings. This stray cat has been living by my uncle&amp;#39;s house for as long as I can remember. Candy refuses to let Chris take the cat home because she&amp;#39;ll basically shower them with anything their heart desires, except for pets. I don&amp;#39;t like the way my cousin Candy raises her kids, but of course, I&amp;#39;m not the parent so it&amp;#39;s not my place. All I can say to you guys is she is really damn good at playing beta.&lt;/p&gt;\n\n&lt;p&gt;Chris spent over an hour at Easter dinner today just spending time with that stray cat outside. Feeding it ham, giving it water, petting it, picking the snot out of its eyes and nose, this kid really loves animals. I&amp;#39;ve really detected no fat logic or HAES from him but I can plainly see that he does drown his depression in food. His body is a reflection of that. I&amp;#39;m just glad his weight is sorta under control right now. He definitely needs to lose A LOT of weight though. I can only hope that when he gets into middle school, Candy enrolls him in football or something. Because like I said, you look at Chris now at 9, and you can tell this kid is gonna be tall and big. And I just look at Nick who&amp;#39;s 2 years older than him and see how he got the small genes from his mom. Chris looks a lot like his 6 foot tall dad. But still. If Chris gains too much weight, not even a growth spurt will save him from adolescent hamminess.&lt;/p&gt;\n\n&lt;p&gt;For now though, Chris is just the poster board of low self-esteem, anti-social, super shy, super smart, animal lover, who just has a fat kid body. I really hope the best for him. I can tell he gets bullied at school. I can only hope things get better for him. And I  really hope super-beta mom Candy, actually takes charge to gets Chris&amp;#39; emotional state back in order. I hate seeing a depressed lonely kid at family gatherings who only feels like himself when he&amp;#39;s around animals. &lt;/p&gt;\n\n&lt;p&gt;Ugh... Anyways... That&amp;#39;s the story of my cousin Chris. You might hear more of these stories if he comes to more of my family gatherings. I&amp;#39;ll keep you guys updated. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So this story really won't contain too much fat logic. You will probably just leave after reading this story and just feel sad for the kid. Let's start off with a little context first doh.\n\nMy grandma had 11 kids. 4 girls 7 boys. Grandpa died when my mom was 6. Yeah yeh, ya know babyboomer generation, post-WW2, it was kinda common for huge families to be a thing around that time. Be me, only child, of course, while the rest of my family all has brothers and sisters with them.\n\nMeet my older cousin Candy with her two sons Nick and Chris. Nick is age 11. Chris is age 9. Candy is notorious for playing beta to them, she really lets them do whatever they want and takes no initiative to discipline them. As a result, the two brothers can be quite a handful. Well, at least they used to be. I can remember a time when Chris and Nick were full of energy. They were a lively, annoying, go-all-out kind of bunch that just couldn't be controlled at family gatherings. They caused A LOT of mischief at Easter dinner, Christmas, Labor Day, Memorial day picnics, my family had all dat shizz because we're so big. I even overheard how Nick and Chris were a huge handful at school too where they would get in trouble A LOT. Nick had to repeat the 3rd grade, but Chris was doing really well in his academics. And I'll be damned if I say this kid isn't smart. This kid is a genius. He always thinks of the absolute best places to hide the Easter eggs for the little kids during egg hunts.\n\nNow as you can imagine... 3 years ago when Chris was 6 he started putting on A LOT of weight. I'd say that when he was 6 he was maybe 70 pounds, now he's like 150. Sure the kid's tall for his age. I mean he's 2 years behind Nick and already over an inch taller than him standing at 5 foot 0. I look at the kid now and just think:\n\n&gt;\"That kid is gonna grow up to be way taller than me.\"\n\nMy reasoning? Well, his dad's like 6 foot and it's quite obvious since he's already taller than his older brother that he got the \"big\" genes in him. But unfortunately, I guess, here's where the good news ends for Chris' situation and well being.\n\nAfter Chris' \"ballooning\" a very distinct emotional change began happening to him. He was no longer the annoying, gun-hoe, leech of a kid he used to be. Now he was shy, low self-esteem, isolated, anti-social, etc. The kid is a damn recluse. Why just last Labor Day he spent nearly the entire family picnic cramped up inside his mom's car for 4 hours playing his Gameboy until it ran out of power and he had to go outside. I guess I should be sort of thankful. Candy his mom seems to have gotten his weight gain under control since he's not ballooning anymore. I can only hope his belly doesn't get too much bigger than it already is. \n\nIt's kinda strange but I miss the old Chris. Sure he was a nuisance and a bully at family gatherings, but now he's just a sad, shy little kid. I can tell he gets bullied. He wears glasses, he's really smart, he's fat, and he's so anti-social, those are like all the pointers kids need to bully you like crazy at school. Why just this Easter dinner he was sitting out in the living room of my Uncle Frank's house looking all depressed not knowing what to do with himself. Nick his brother, often misses that he can't play with Chris like he used to when they were younger because now Chris is so much different. He's full of so much self-doubt about himself and I couldn't help but feel so sorry for him. I miss the old Chris. The Chris that would literally team up with his brother Nick and drag me around the picnic gatherings through the dirt. I miss the super annoying almost psuedo-bully Chris. I miss the mischievous prankster he used to be. And I can tell his older brother Nick, who is like 90 pounds, misses how his younger brother used to be too. I am not sure if his older brother, Nick, also partakes in bullying him about his weight or body, but I would hope not. \n\nIf there's any silver lining it's that Chris loves animals. There's this 1 stray cat that hides out by my Uncle Frank's house that Chris always spends time with everytime he's at our family gatherings. This stray cat has been living by my uncle's house for as long as I can remember. Candy refuses to let Chris take the cat home because she'll basically shower them with anything their heart desires, except for pets. I don't like the way my cousin Candy raises her kids, but of course, I'm not the parent so it's not my place. All I can say to you guys is she is really damn good at playing beta.\n\nChris spent over an hour at Easter dinner today just spending time with that stray cat outside. Feeding it ham, giving it water, petting it, picking the snot out of its eyes and nose, this kid really loves animals. I've really detected no fat logic or HAES from him but I can plainly see that he does drown his depression in food. His body is a reflection of that. I'm just glad his weight is sorta under control right now. He definitely needs to lose A LOT of weight though. I can only hope that when he gets into middle school, Candy enrolls him in football or something. Because like I said, you look at Chris now at 9, and you can tell this kid is gonna be tall and big. And I just look at Nick who's 2 years older than him and see how he got the small genes from his mom. Chris looks a lot like his 6 foot tall dad. But still. If Chris gains too much weight, not even a growth spurt will save him from adolescent hamminess.\n\nFor now though, Chris is just the poster board of low self-esteem, anti-social, super shy, super smart, animal lover, who just has a fat kid body. I really hope the best for him. I can tell he gets bullied at school. I can only hope things get better for him. And I  really hope super-beta mom Candy, actually takes charge to gets Chris' emotional state back in order. I hate seeing a depressed lonely kid at family gatherings who only feels like himself when he's around animals. \n\nUgh... Anyways... That's the story of my cousin Chris. You might hear more of these stories if he comes to more of my family gatherings. I'll keep you guys updated. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Long", "id": "65s46e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 60, "report_reasons": null, "author": "TheChubbyCustodian", "saved": false, "mod_reports": [], "name": "t3_65s46e", "subreddit_name_prefixed": "r/fatpeoplestories", "approved_by": null, "over_18": false, "domain": "self.fatpeoplestories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vzax", "edited": 1492386393.0, "link_flair_css_class": "long", "author_flair_css_class": "", "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/fatpeoplestories/comments/65s46e/meet_my_cousin_chris/", "num_reports": null, "locked": false, "stickied": false, "created": 1492413914.0, "url": "https://www.reddit.com/r/fatpeoplestories/comments/65s46e/meet_my_cousin_chris/", "author_flair_text": "Don't touch my Orange Juice!", "quarantine": false, "title": "Meet my cousin, Chris.", "created_utc": 1492385114.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 60}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65s46e", "likes": null, "replies": "", "user_reports": [], "id": "dgdf3wf", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "lilmisschainsaw", "parent_id": "t3_65s46e", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "My weight gain started when I was a kid, and it definitely messed me up. So did the bullying, and the shyness that can come from it; and eventually, depression.  \nYou should talk to Candy. Sometimes parents need an outside source to check them. You don't truly see what's going on sometimes when you see it every day- it's like a scent that you go nose blind too. Just do it gently, as a support instead of a come-to-Jesus type thing.  \n  \nIf nothing else, the kid needs help from the bullies and for his emotional state. Kids can suffer from all the same effects of depression that adults do, and he doesn't need that at 9.  From your description, he's in a very bad place. \n \nYou kind of have two choices here. Either say something and risk a fight, or say nothing and wish you had. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My weight gain started when I was a kid, and it definitely messed me up. So did the bullying, and the shyness that can come from it; and eventually, depression.&lt;br/&gt;\nYou should talk to Candy. Sometimes parents need an outside source to check them. You don&amp;#39;t truly see what&amp;#39;s going on sometimes when you see it every day- it&amp;#39;s like a scent that you go nose blind too. Just do it gently, as a support instead of a come-to-Jesus type thing.  &lt;/p&gt;\n\n&lt;p&gt;If nothing else, the kid needs help from the bullies and for his emotional state. Kids can suffer from all the same effects of depression that adults do, and he doesn&amp;#39;t need that at 9.  From your description, he&amp;#39;s in a very bad place. &lt;/p&gt;\n\n&lt;p&gt;You kind of have two choices here. Either say something and risk a fight, or say nothing and wish you had. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgdf3wf", "score_hidden": false, "stickied": false, "created": 1492461023.0, "created_utc": 1492432223.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65s46e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65s46e", "likes": null, "replies": "", "user_reports": [], "id": "dgdegqd", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "mirecupcakethanhuman", "parent_id": "t1_dgd7qxw", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Yeah! I want to root for him! He could ask around to dog owners in his neiborhood if he can walk the dogs for some spare change or like $1 per walk! That would be so cool even if he was only able to walk one or two doggies at a time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah! I want to root for him! He could ask around to dog owners in his neiborhood if he can walk the dogs for some spare change or like $1 per walk! That would be so cool even if he was only able to walk one or two doggies at a time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgdegqd", "score_hidden": false, "stickied": false, "created": 1492459699.0, "created_utc": 1492430899.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd7qxw", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "JuniperoBeachBabe", "parent_id": "t3_65s46e", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": " This is a good story.  It's different from what's usually put on here but I like it.  I think this kid is first person I truly as pulling for to get better.  Maybe the mom or you could take the little boy to the local animal shelter and walk the dogs.  They welcome any help and I think he'd love it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a good story.  It&amp;#39;s different from what&amp;#39;s usually put on here but I like it.  I think this kid is first person I truly as pulling for to get better.  Maybe the mom or you could take the little boy to the local animal shelter and walk the dogs.  They welcome any help and I think he&amp;#39;d love it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgd7qxw", "score_hidden": false, "stickied": false, "created": 1492439927.0, "created_utc": 1492411127.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65s46e", "likes": null, "replies": "", "user_reports": [], "id": "dgdg8wg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BrontosaurusK", "parent_id": "t3_65s46e", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "It's a shame she won't let him have pets - a dog would be a great way to get more exercise.\nEven cats can go on a leash....\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a shame she won&amp;#39;t let him have pets - a dog would be a great way to get more exercise.\nEven cats can go on a leash....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgdg8wg", "score_hidden": false, "stickied": false, "created": 1492463128.0, "created_utc": 1492434328.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65s46e", "likes": null, "replies": "", "user_reports": [], "id": "dgdn5im", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BoofahKingWho", "parent_id": "t3_65s46e", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "I was the chunky kid in my youth to tween years. When I hit middle school the bullying went ballistic; I'd cry every day. Thankfully puberty blessed me with a huge gain in height and metabolism. Seemingly overnight things got a lot better.\n\nI hope things work out for Chris too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was the chunky kid in my youth to tween years. When I hit middle school the bullying went ballistic; I&amp;#39;d cry every day. Thankfully puberty blessed me with a huge gain in height and metabolism. Seemingly overnight things got a lot better.&lt;/p&gt;\n\n&lt;p&gt;I hope things work out for Chris too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgdn5im", "score_hidden": false, "stickied": false, "created": 1492472573.0, "created_utc": 1492443773.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65s46e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65s46e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65s46e", "likes": null, "replies": "", "user_reports": [], "id": "dgd1s4g", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "jedderbob", "parent_id": "t1_dgcu3to", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Yeah but with how much you've written they shouldn't. Not every story should need to involve cleaning up mountains of shit or dealing with tantruming fatties. This was a humanizing story and one that really touched me, especially as a former fat kid. Keep up the good work.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah but with how much you&amp;#39;ve written they shouldn&amp;#39;t. Not every story should need to involve cleaning up mountains of shit or dealing with tantruming fatties. This was a humanizing story and one that really touched me, especially as a former fat kid. Keep up the good work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgd1s4g", "score_hidden": false, "stickied": false, "created": 1492428706.0, "created_utc": 1492399906.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65s46e", "likes": null, "replies": "", "user_reports": [], "id": "dgdkuk2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "GoAskAlice", "parent_id": "t1_dgcu3to", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Mod here. Your story is perfectly acceptable, since it shows some of what goes on behind the scenes. You've written an FPS documentary of sorts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mod here. Your story is perfectly acceptable, since it shows some of what goes on behind the scenes. You&amp;#39;ve written an FPS documentary of sorts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgdkuk2", "score_hidden": false, "stickied": false, "created": 1492469821.0, "created_utc": 1492441021.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcu3to", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "TheChubbyCustodian", "parent_id": "t1_dgctzy3", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Well if mods choose to delete it then that's their choice. IDK it's probably a bad FPS. So I'll leave it to the mods whether or not to leave it up or not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well if mods choose to delete it then that&amp;#39;s their choice. IDK it&amp;#39;s probably a bad FPS. So I&amp;#39;ll leave it to the mods whether or not to leave it up or not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgcu3to", "score_hidden": false, "stickied": false, "created": 1492418189.0, "created_utc": 1492389389.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctzy3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cynistera", "parent_id": "t3_65s46e", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 1, "body": "This* is like.. a fat person observation.", "edited": 1492391990.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This* is like.. a fat person observation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgctzy3", "score_hidden": false, "stickied": false, "created": 1492418042.0, "created_utc": 1492389242.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65s46e", "likes": null, "replies": "", "user_reports": [], "id": "dgdwbp4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TakeOnMe-TakeOnMe", "parent_id": "t3_65s46e", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Invite Chris for some one on one time (you and BF and him) and let him pick the activity. No limits except it needs to be something active and not revolving around food. Bowling, mini golf, a small hike, trip to the park, throw a ball around, anything to get him outside. Take him to the local zoo or farm and let him indulge in his love for animals. Explain to him how he can volunteer at shelters (sometimes a guardian is required based on age), just anything to indulge his interests. If there's food, choose something like fro yo and take the opportunity to explain portion sizes and healthful choices. Ask him how school is going. Get him to open up about his feelings. Surely no one would object to these attempts, right? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Invite Chris for some one on one time (you and BF and him) and let him pick the activity. No limits except it needs to be something active and not revolving around food. Bowling, mini golf, a small hike, trip to the park, throw a ball around, anything to get him outside. Take him to the local zoo or farm and let him indulge in his love for animals. Explain to him how he can volunteer at shelters (sometimes a guardian is required based on age), just anything to indulge his interests. If there&amp;#39;s food, choose something like fro yo and take the opportunity to explain portion sizes and healthful choices. Ask him how school is going. Get him to open up about his feelings. Surely no one would object to these attempts, right? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgdwbp4", "score_hidden": false, "stickied": false, "created": 1492482814.0, "created_utc": 1492454014.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65s46e", "likes": null, "replies": "", "user_reports": [], "id": "dgcr0k5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Type_II_Bot", "parent_id": "t3_65s46e", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "\nOther stories from /u/TheChubbyCustodian:\n\n* 04/16/2017 - [Meet my cousin, Chris.](http://www.reddit.com/r/fatpeoplestories/comments/65s46e/meet_my_cousin_chris/) (this)\n\n* 04/12/2017 - [Chubby Custodian Chronicles #11: Fight for the Fupature](http://www.reddit.com/r/fatpeoplestories/comments/64vuux/chubby_custodian_chronicles_11_fight_for_the/)\n\n* 04/10/2017 - [It's orange juice NOT water!](http://www.reddit.com/r/fatpeoplestories/comments/64ncb8/its_orange_juice_not_water/)\n\n* 04/09/2017 - [Chubby Custodian Chronicles #10: You want fries with that?](http://www.reddit.com/r/fatpeoplestories/comments/64fv89/chubby_custodian_chronicles_10_you_want_fries/)\n\n* 04/02/2017 - [Chubby Custodian Chronicles #9: Fupa Lady - Bathroom Terrorist](http://www.reddit.com/r/fatpeoplestories/comments/632n3y/chubby_custodian_chronicles_9_fupa_lady_bathroom/)\n\n* 04/01/2017 - [[April Fools] Imma Fat Son of a Bitch](http://www.reddit.com/r/fatpeoplestories/comments/62u9ag/april_fools_imma_fat_son_of_a_bitch/)\n\n* 03/31/2017 - [Chubby Custodian Chronicles #8: \"I'm raising the prices for beetus!\"](http://www.reddit.com/r/fatpeoplestories/comments/62if34/chubby_custodian_chronicles_8_im_raising_the/)\n\n* 03/29/2017 - [Chubby Custodian Chronicles #7: A White privileged man buys a belt](http://www.reddit.com/r/fatpeoplestories/comments/623x4w/chubby_custodian_chronicles_7_a_white_privileged/)\n\n* 03/25/2017 - [If I gain weight I'll get bigger boobs!](http://www.reddit.com/r/fatpeoplestories/comments/61i5my/if_i_gain_weight_ill_get_bigger_boobs/)\n\n* 03/25/2017 - [Chubby Custodian Chronicles #6: Multi-beetus mayhem](http://www.reddit.com/r/fatpeoplestories/comments/61coxl/chubby_custodian_chronicles_6_multibeetus_mayhem/)\n\n* 03/24/2017 - [Chubby Custodian Chronicles #5: This ham's got brains](http://www.reddit.com/r/fatpeoplestories/comments/616ap1/chubby_custodian_chronicles_5_this_hams_got_brains/)\n\n* 03/17/2017 - [Chubby Custodian Chronicles (mini-episode): The return of Fupa Lady](http://www.reddit.com/r/fatpeoplestories/comments/5zurhb/chubby_custodian_chronicles_miniepisode_the/)\n\n* 03/15/2017 - [Chubby Custodian Chronicles #4: Holylordjesus!](http://www.reddit.com/r/fatpeoplestories/comments/5zgj0z/chubby_custodian_chronicles_4_holylordjesus/)\n\n* 03/12/2017 - [Chubby Custodian Chronicles #3 Part 2: Hamlord Manager](http://www.reddit.com/r/fatpeoplestories/comments/5ywp7b/chubby_custodian_chronicles_3_part_2_hamlord/)\n\n* 03/12/2017 - [Chubby Custodian Chronicles #3 Part 1: Enlightenment](http://www.reddit.com/r/fatpeoplestories/comments/5ywjch/chubby_custodian_chronicles_3_part_1_enlightenment/)\n\n* 03/10/2017 - [Chubby Custodian the Official Reboot #2: MAH COLE SLAW!!](http://www.reddit.com/r/fatpeoplestories/comments/5yjwlr/chubby_custodian_the_official_reboot_2_mah_cole/)\n\n* 03/10/2017 - [Chubby Custodian the Official Reboot #1: My Shitlord Manager](http://www.reddit.com/r/fatpeoplestories/comments/5yjtuw/chubby_custodian_the_official_reboot_1_my/)\n\n_____\n^If ^you ^want ^to ^get ^notified ^as ^soon ^as ^TheChubbyCustodian ^posts ^a ^new ^story, [^click ^here](http://www.reddit.com/message/compose/?to=Type_II_Bot&amp;subject=subscribe&amp;message=subscribe%20/u/TheChubbyCustodian)^.\n\n^(Hi I'm Type_II_Bot, for more info about me visit /r/Type_II_Bot)\n\n^Find ^this ^bot ^helpful? ^Consider ^donating [^$1](https://www.paypal.me/r3d4rmy/1)^, [^$5](https://www.paypal.me/r3d4rmy/5)^, ^or ^with ^BTC: ^1FEjYZAeUvY6zEx4x3SShxMwCZcqSHfNoH", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Other stories from &lt;a href=\"/u/TheChubbyCustodian\"&gt;/u/TheChubbyCustodian&lt;/a&gt;:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;04/16/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/65s46e/meet_my_cousin_chris/\"&gt;Meet my cousin, Chris.&lt;/a&gt; (this)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/12/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/64vuux/chubby_custodian_chronicles_11_fight_for_the/\"&gt;Chubby Custodian Chronicles #11: Fight for the Fupature&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/10/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/64ncb8/its_orange_juice_not_water/\"&gt;It&amp;#39;s orange juice NOT water!&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/09/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/64fv89/chubby_custodian_chronicles_10_you_want_fries/\"&gt;Chubby Custodian Chronicles #10: You want fries with that?&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/02/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/632n3y/chubby_custodian_chronicles_9_fupa_lady_bathroom/\"&gt;Chubby Custodian Chronicles #9: Fupa Lady - Bathroom Terrorist&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/01/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/62u9ag/april_fools_imma_fat_son_of_a_bitch/\"&gt;[April Fools] Imma Fat Son of a Bitch&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;03/31/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/62if34/chubby_custodian_chronicles_8_im_raising_the/\"&gt;Chubby Custodian Chronicles #8: &amp;quot;I&amp;#39;m raising the prices for beetus!&amp;quot;&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;03/29/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/623x4w/chubby_custodian_chronicles_7_a_white_privileged/\"&gt;Chubby Custodian Chronicles #7: A White privileged man buys a belt&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;03/25/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/61i5my/if_i_gain_weight_ill_get_bigger_boobs/\"&gt;If I gain weight I&amp;#39;ll get bigger boobs!&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;03/25/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/61coxl/chubby_custodian_chronicles_6_multibeetus_mayhem/\"&gt;Chubby Custodian Chronicles #6: Multi-beetus mayhem&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;03/24/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/616ap1/chubby_custodian_chronicles_5_this_hams_got_brains/\"&gt;Chubby Custodian Chronicles #5: This ham&amp;#39;s got brains&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;03/17/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/5zurhb/chubby_custodian_chronicles_miniepisode_the/\"&gt;Chubby Custodian Chronicles (mini-episode): The return of Fupa Lady&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;03/15/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/5zgj0z/chubby_custodian_chronicles_4_holylordjesus/\"&gt;Chubby Custodian Chronicles #4: Holylordjesus!&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;03/12/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/5ywp7b/chubby_custodian_chronicles_3_part_2_hamlord/\"&gt;Chubby Custodian Chronicles #3 Part 2: Hamlord Manager&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;03/12/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/5ywjch/chubby_custodian_chronicles_3_part_1_enlightenment/\"&gt;Chubby Custodian Chronicles #3 Part 1: Enlightenment&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;03/10/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/5yjwlr/chubby_custodian_the_official_reboot_2_mah_cole/\"&gt;Chubby Custodian the Official Reboot #2: MAH COLE SLAW!!&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;03/10/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/5yjtuw/chubby_custodian_the_official_reboot_1_my/\"&gt;Chubby Custodian the Official Reboot #1: My Shitlord Manager&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;If&lt;/sup&gt; &lt;sup&gt;you&lt;/sup&gt; &lt;sup&gt;want&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;get&lt;/sup&gt; &lt;sup&gt;notified&lt;/sup&gt; &lt;sup&gt;as&lt;/sup&gt; &lt;sup&gt;soon&lt;/sup&gt; &lt;sup&gt;as&lt;/sup&gt; &lt;sup&gt;TheChubbyCustodian&lt;/sup&gt; &lt;sup&gt;posts&lt;/sup&gt; &lt;sup&gt;a&lt;/sup&gt; &lt;sup&gt;new&lt;/sup&gt; &lt;sup&gt;story,&lt;/sup&gt; &lt;a href=\"http://www.reddit.com/message/compose/?to=Type_II_Bot&amp;amp;subject=subscribe&amp;amp;message=subscribe%20/u/TheChubbyCustodian\"&gt;&lt;sup&gt;click&lt;/sup&gt; &lt;sup&gt;here&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;.&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;Hi I&amp;#39;m Type_II_Bot, for more info about me visit &lt;a href=\"/r/Type_II_Bot\"&gt;/r/Type_II_Bot&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;Find&lt;/sup&gt; &lt;sup&gt;this&lt;/sup&gt; &lt;sup&gt;bot&lt;/sup&gt; &lt;sup&gt;helpful?&lt;/sup&gt; &lt;sup&gt;Consider&lt;/sup&gt; &lt;sup&gt;donating&lt;/sup&gt; &lt;a href=\"https://www.paypal.me/r3d4rmy/1\"&gt;&lt;sup&gt;$1&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;,&lt;/sup&gt; &lt;a href=\"https://www.paypal.me/r3d4rmy/5\"&gt;&lt;sup&gt;$5&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;,&lt;/sup&gt; &lt;sup&gt;or&lt;/sup&gt; &lt;sup&gt;with&lt;/sup&gt; &lt;sup&gt;BTC:&lt;/sup&gt; &lt;sup&gt;1FEjYZAeUvY6zEx4x3SShxMwCZcqSHfNoH&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgcr0k5", "score_hidden": false, "stickied": false, "created": 1492414010.0, "created_utc": 1492385210.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]