[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "fatpeoplestories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;ve been doing a thing with the kiddo periodically where we go to the gym together in the early morning for two hours before lunch. (And for us, &amp;quot;early morning&amp;quot; means anywhere from 9:30 to 11 am. The one thing this kid inherited from me is her Daddy&amp;#39;s utter lack of motivation to get out of bed before 10AM voluntarily.) \nWhen we go, I drop her off in the supervised daycare/play area, and she goes NUTS having fun while I&amp;#39;m working out in the big room next door. When it&amp;#39;s time to go home (IE, we&amp;#39;re done with our 2 hour allotment of time) she almost always gets very upset, because she&amp;#39;s been having way too much fun. So most of the time, we go for a walk down the street to her favorite little store, where she gets to play with a kitchen gadget or two before heading home for lunch.&lt;/p&gt;\n\n&lt;p&gt;I should note I&amp;#39;m not the kind of asshole parent who treats any mercantile as a play center for my precious little spawnling.  When we go into this store, inevitably we buy something like a sponge or other minor gadget so the idea of us showing up doesn&amp;#39;t fill the poor retail people with dread. And if anything gets touched excessively or put on the floor that shouldn&amp;#39;t be, it comes home with us. So far, we have a lovely collection of sponges and bottle toppers, and get a smile when we come in the door.&lt;/p&gt;\n\n&lt;p&gt;Last week, I&amp;#39;m dropping her off after washing our hands (as required before entering the play area) and checking her in. Just then, in walks the Gym Hamplanet from the 80s.&lt;/p&gt;\n\n&lt;p&gt;Hell, I don&amp;#39;t want to smacktalk people at the gym. We&amp;#39;re all there for a reason, and it&amp;#39;s because we are hamsters who need to exercise our bodies in a society that treats public parks as spaces to be afraid of, and malls as a place to exercise in. So I don&amp;#39;t want to mock people for wearing what&amp;#39;s comfortable to work out, or shame someone for wearing stretchy lingerie when they&amp;#39;re just going to sweat through it and expose their terrible, terrible life choices to the rest of the gym. I really don&amp;#39;t. I am not a gorgeous muscular specimen, which is why I work out as much as I have time to do with full-time toddler ridealong, and I do not have anywhere near enough acrylic panels in my orangerie to start chucking stones randomly.&lt;/p&gt;\n\n&lt;p&gt;But there are laws, people. Laws of physics. Laws of nature. And laws of gravity. Those laws inform clothing decisions, or bloody well should. In this particular case, those immutable laws combined with neon pink spandex and an overly tight workout top created an effect on a 5&amp;#39;2&amp;quot; 300lb woman that I&amp;#39;ll just call &amp;quot;Exploded Raw Refrigerator Biscuit Dough Sculpture of 80s Aerobics instructor left to dry in the sun&amp;quot;. Or, less Modern Art Sculpturally, &amp;quot;The Female Michelin Man Got Squashed By A Microwave Elephant On Her Way To The 80s Big Hair Convention&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;There was so much wrong, it was extremely difficult to see anything right. So I focused on the extremely cute kid in the carrier - one that, not too long ago, I was hauling around on one arm, too.&lt;/p&gt;\n\n&lt;p&gt;Then she spoke, and the nasality of a New Joysee accent combined with the blocked passages of a chronic smoker along for the ride.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hi, I&amp;#39;m here to drop off my kids for daycare.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Now, our gym requires that you actually call ahead 24 hours to make sure there&amp;#39;s space for your kid. There&amp;#39;s fire codes, infant liability, etc.&lt;/p&gt;\n\n&lt;p&gt;The lady behind the desk, all perky smiles, says, &amp;quot;Of course! And you&amp;#39;re dropping off who, exactly?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The Spandex Michelin Woman rattles off her kids&amp;#39; names, and exasperatedly says, &amp;quot;Tsch. We&amp;#39;re here EVERY day. They&amp;#39;re on the list.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh, I&amp;#39;m sorry, but I don&amp;#39;t see them, and we&amp;#39;re full up today. Can I put you on the list for tomorrow?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So rather than actually go &amp;quot;oops, I made a mistake, guess we&amp;#39;ll have to come back again another time&amp;quot;, the Spandex Michelin Woman doubles down - and puts her infant down DIRECTLY IN THE PATH OF THE DOORWAY TO THE OUTSIDE, and begins yelling about how there&amp;#39;s nowhere near the number of kids at the daycare and she is fine to drop them off, they do this all the time.&lt;/p&gt;\n\n&lt;p&gt;The receptionist, of course, is carefully saying, &amp;quot;I&amp;#39;m sorry but our policy is 24 hour notification and we&amp;#39;re full up this morning. Some of our reservations haven&amp;#39;t arrived yet, so if you wait or they cancel, we may be able to make an exception.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And then there&amp;#39;s me, still waiting. I&amp;#39;m going, &amp;quot;um. Um. Um. UM.&amp;quot; because I know how fast that door opens, and a Graco carrier will immediately get bowled over with a potential forehead stamp for said kiddo riding in it due to the doorstop on it. Oh, and I can&amp;#39;t open the door because the kid is directly in its path, and if I moved the carrier, I would be committing Strange Man Moving Child Felony Number One - don&amp;#39;t touch another person&amp;#39;s kid or car carrier unless it&amp;#39;s an actual emergency.&lt;/p&gt;\n\n&lt;p&gt;So I quietly say, &amp;quot;Ma&amp;#39;am, you probably don&amp;#39;t want to put your baby there. That&amp;#39;s right in the way of the door.&amp;quot; I also would like her to move it, since I have to open the door to get out, but because she&amp;#39;s essentially blocked the door with her infant while she bitches at the receptionist, I can&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;She looks at me and says, &amp;quot;She&amp;#39;s fine, just leave.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Just then I reach up and catch the door as another parent comes in with THEIR kids to drop off, which whacks the car carrier and the infant wakes up and begins crying.&lt;/p&gt;\n\n&lt;p&gt;The woman then whirls around and says &amp;quot;DON&amp;#39;T MOVE MY CHILD.&amp;quot; My hand, of course, being on the door to keep it from whacking the carrier, and nowhere near the floor.&lt;/p&gt;\n\n&lt;p&gt;At this point, the daycare receptionist has had enough, and says, &amp;quot;Can I see your gym membership card?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Spandex Michelin Woman rolls her eyes and says &amp;quot;Tsch, I left it at home.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Of course you did.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I can look it up for you, but I can&amp;#39;t check your kids in until we have a cancellation.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Exasperation continues from Michelin for a minute. I wait until I&amp;#39;ve had enough, and finally say, &amp;quot;LADY. I am leaving. Your kid is blocking the only exit. MOVE YOUR KID. IT IS NOT SAFE FOR HER TO BE THERE.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Michelin rolls her eyes and huffs out, &amp;quot;FINE&amp;quot; and moves the kid to sit next to the desk - which would have been the more logical point. I should mention the kid is still fussing and grouching, but is Michelin paying attention? Nope.&lt;/p&gt;\n\n&lt;p&gt;I should also mention that Mini Michelin is trying like hell to get into the play area, which isn&amp;#39;t happening until the receptionist opens the door and lets him through. This kid is chubby as hell, but as a parent, I&amp;#39;m pretty aware that a lot of what looks like chub for kids is also baby fat that vanishes in every growing cycle.&lt;/p&gt;\n\n&lt;p&gt;And like I said, I don&amp;#39;t want to judge. But this kid is shrieking and throwing a fit the entire time, but the receptionist is holding firm.&lt;/p&gt;\n\n&lt;p&gt;At this point I&amp;#39;m just hanging around the handwash station, carefully unwinding my headphones from the carrier and casually making sure my kiddo has her snacks, water, and I have my phone turned up to max. Not because I can&amp;#39;t do this elsewhere, but because god help this retarded manatee of a woman if that kid bodychecks my daughter in front of me because she dropped him over the fence.&lt;/p&gt;\n\n&lt;p&gt;At this point, receptionist is holding firm and refuses to budge, so Michelin stomps to the door, flings it open (barely missing me this time) and gets Mini Michelin distracted and coming to her by waving (I kid you not) a Snickers bar at him.&lt;/p&gt;\n\n&lt;p&gt;I figure that&amp;#39;s the last I&amp;#39;ll see of her that day.&lt;/p&gt;\n\n&lt;p&gt;Oh no. No no, no.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m on an elliptical working out. My machine has just ticked over to 32 minutes completed out of a 65 minute workout when I hear &amp;quot;EXCUSE ME&amp;quot;. Since I usually plug in the &amp;#39;phones and turn them up high to do cardio, it must have been a bellow of epic proportions. Surprise! It&amp;#39;s Michelin! And she&amp;#39;s brought a bag of workout goodies (overflowing with electric Green Soda bottles and King-Size Snickers candy bars! Hooray!)&lt;/p&gt;\n\n&lt;p&gt;And she&amp;#39;s apparently decided to yell at me for being on the elliptical for longer than 30 minutes. This is exactly what she says, except that she adds, &amp;quot;It&amp;#39;s the rules!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;See, our gym is pretty crowded during the work week. Usually there&amp;#39;s a long wait for machines on certain days - Mondays, Tuesdays, Wednesdays and Thursdays are the worst from 6AM to 8AM and 4PM to 7:30PM as everyone is being &amp;quot;good&amp;quot; for the weekday, then it plummets, and goes insane from 10AM to 3PM on Saturday and Sunday. So there&amp;#39;s a courtesy rule - if there&amp;#39;s a lot of people in the gym, be nice and keep your workout on any one machine to 30 minutes or less. There&amp;#39;s signs that specifically say &amp;quot;As a courtesy to other patrons please limit your usage to 30 minutes during peak hours.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The key here being peak hours. Not hours like 3am when the only people are the quiet night shift cleaning staff and the insomniacs figuring if they have to watch infomercials on basic cable, they might as well do it on a treadmill to knock themselves out, or 11am when the only people are flabby middle-aged patrons and 2nd honeymooning retirees.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s 11:10 on a Tuesday morning. The very popular spinning class with the Greek former model turned athletic instructor is instructing his class to &amp;quot;Ride eet hard laydeeees&amp;quot; one floor below me, and I am surrounded by a smattering of people who will be eating their dinners around 4PM this afternoon at the local Denny&amp;#39;s and going to bed before the end of the Big Bang Theory - in short, Edna and Richard, my favorite retirees, who are laboring up an endless hill holding hands on separate treadmills twenty feet away. Other than that, there&amp;#39;s nobody around me, since all of the hot stay-at-home moms are busy working their asses off to impress each other and Yanni the Cyclist Instructor. I can count fifteen empty machines in my field of vision just looking around the gravitational field effect of Michelin lady. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s absolutely no reason to switch machines whatsoever, unless, as my evil brain reminds me, Michelin decides to take a machine directly in my line of sight, thus providing an effective erotic experience similar to getting thumped in the groin by a 20lb medicine ball traveling at 100mph while standing naked in an ice storm watching reruns of C-Span.&lt;/p&gt;\n\n&lt;p&gt;So against my better judgment, I say, &amp;quot;Yeah, and?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Michelin says, &amp;quot;Well, you know you&amp;#39;re supposed to only go for 30 minutes. It&amp;#39;s the rules.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I look around the gym. &amp;quot;Yeah, if there&amp;#39;s people waiting.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Michelin says, &amp;quot;You know you&amp;#39;re supposed to get off after thirty minutes and let someone else have a turn.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I look at her and have more or less had it with her, and ask, &amp;quot;Is this about me asking you to move your kid out of the way of the swinging door? Because if it is, please just go bother someone else, okay?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Michelin says, &amp;quot;NO IT&amp;#39;S NOT ABOUT THAT&amp;quot; in a way that says, &amp;quot;Oh yes, it&amp;#39;s very much about that.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So I say &amp;quot;Do you want me to move? Is this your favorite machine? Fine.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I get off and move three machines over to the left, and start up again. Does Michelin follow me? Oh yes, of course she does.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;NO, IT&amp;#39;S ABOUT SAFETY!&amp;quot; Michelin shouts. &amp;quot;YOU CAN&amp;#39;T WORK OUT THAT HARD!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Like I said. I&amp;#39;d more or less had it.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Lady, working out at a low cardio level for over an hour isn&amp;#39;t unsafe. It&amp;#39;s not going to give me a heart attack. Drinking a Mountain Dew while walking on an elliptical at the lowest setting at a sloth&amp;#39;s pace? That&amp;#39;s not going to give you a heart attack either. So why don&amp;#39;t you just leave me the fuck alone and I&amp;#39;ll leave you the fuck alone, okay? You go do whatever you want and stop harassing me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Edna, at this point, having watched this little interchange, stops her treadmill, comes over and says, &amp;quot;Mal, honey, is everything okay here?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Everything&amp;#39;s fine, Edna. This lovely lady was just reminding me of the time limits.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh, never you pay no mind. Hell, if I had a dollar for every time I ignored that sign, I&amp;#39;d have five dollars.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Richard yells over, &amp;quot;Yeah, because she quits 25 minutes into it and goes to get a drink of water down at the spinner class!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Girl&amp;#39;s gotta do some window shopping!&amp;quot; She winks and goes back to Richard, who is grinning, but still watching us.&lt;/p&gt;\n\n&lt;p&gt;Michelin is turning a lovely shade of puce, mottled with what I&amp;#39;m sure she thinks is a cutting stare, but really more or less appears as mild constipation. Finally she thumps back to the elliptical I was using, makes a huge show of wiping it down with a towel, then climbing on after shoving a pair of Mickey Mouse-sized OTE headphones on her head and cranking the volume up high enough that I can hear the strains of Insane Clown Posse start up from twelve feet away. Through my own damn in-ear noise-canceling headphones.&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s when it all goes so very, very wrong.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve mentioned I&amp;#39;m not a small person before.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve mentioned that I am careful about what I sit on and what I stand on, because I am not a small person. That being said, I also know when to NOT keep going.&lt;/p&gt;\n\n&lt;p&gt;Michelin apparently does not, because, as Edna told me later, five minutes into her workout the machine begins to make a noise, then the elliptical pedal just blocks up completely, and Michelin loses her stride, losing her balance and falling off the elliptical.&lt;/p&gt;\n\n&lt;p&gt;Of course, several of us go rushing over to her to help her up and find out what happened. The first thing she says once she gets her breath back is, &amp;quot;He...he...he...musta broke it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Now, the mechanics of the ellipticals are pretty simple, and these just don&amp;#39;t break unless they&amp;#39;re broken intentionally or they have something clogging them. They&amp;#39;re rated to 450lbs, something I know because I used to be around that weight and made sure to ask when starting on my workout regimen to lose the weight how much load these things can carry.&lt;/p&gt;\n\n&lt;p&gt;The gym staff member closest to this little tableau comes over to find out how bad it is. He bends over, frowns, and then pulls out...&lt;/p&gt;\n\n&lt;p&gt;...not just one, but two King-Size Snickers bars. Unwrapped. With a workout towel around each one. Smashed into all oblivion of white towel candy mush and crammed into a tiny space by a heavy driving force much like a 300lb whale forcing a small lever and pulley system up and down a track. &lt;/p&gt;\n\n&lt;p&gt;Immediately Michelin says &amp;quot;THAT&amp;#39;S NOT MINE!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Except Edna pulls another from the little workout cubby holding a Mountain Dew on the elliptical and quietly says, &amp;quot;Oh, honey&amp;quot; in the most perfectly timed &amp;quot;I&amp;#39;m so ashamed for you&amp;quot; mother voice I&amp;#39;ve ever heard.&lt;/p&gt;\n\n&lt;p&gt;And I figure that&amp;#39;s me good for the day, so I&amp;#39;m off to the showers, while Michelin gets a free ride to the lobby and daycare area. &lt;/p&gt;\n\n&lt;p&gt;I spend a bit more time than I should in the sauna - normally a place to silently wish your compatriots in Scandinavian fitness routines were younger, fitter, a different gender, and didn&amp;#39;t twine their nosehairs while reading the paper naked with one hand on their hip and one foot on a bench, commenting loudly on the state of the world, but today even this experience is a blessed refuge, even as Richard sticks one foot on a bench, grabs the Sports page, turns up his hearing aid, and says, &amp;quot;BOY, THAT WAS EXCITING!&amp;quot; and proceeds to fill in everyone within earshot on the weekend&amp;#39;s adventures of Edna and Richard, stopping thankfully right before he got to the part one would suspect Edna is revealed to not only be a silver fox, but also one who has a predilection for nautically-themed naughtiness on the high seas.&lt;/p&gt;\n\n&lt;p&gt;As I&amp;#39;m going down to pick up the kiddo from daycare, steeling myself for the inevitable temper tantrum as I take her out of the play area she loves so much, I see an ambulance pulled up with Michelin on a chair in the lobby with her kids nearby. I go in, pick up my kid, and go back out...&lt;/p&gt;\n\n&lt;p&gt;...only to see Michelin demand that one of the ambulance guys let her eat her Snickers, because if she doesn&amp;#39;t, her low blood sugar will kick in and she will crash because she had such a hard workout before the &amp;quot;accident&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve decided to start scheduling workouts and daycare at 8AM from now on.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I've been doing a thing with the kiddo periodically where we go to the gym together in the early morning for two hours before lunch. (And for us, \"early morning\" means anywhere from 9:30 to 11 am. The one thing this kid inherited from me is her Daddy's utter lack of motivation to get out of bed before 10AM voluntarily.) \nWhen we go, I drop her off in the supervised daycare/play area, and she goes NUTS having fun while I'm working out in the big room next door. When it's time to go home (IE, we're done with our 2 hour allotment of time) she almost always gets very upset, because she's been having way too much fun. So most of the time, we go for a walk down the street to her favorite little store, where she gets to play with a kitchen gadget or two before heading home for lunch.\n\nI should note I'm not the kind of asshole parent who treats any mercantile as a play center for my precious little spawnling.  When we go into this store, inevitably we buy something like a sponge or other minor gadget so the idea of us showing up doesn't fill the poor retail people with dread. And if anything gets touched excessively or put on the floor that shouldn't be, it comes home with us. So far, we have a lovely collection of sponges and bottle toppers, and get a smile when we come in the door.\n\nLast week, I'm dropping her off after washing our hands (as required before entering the play area) and checking her in. Just then, in walks the Gym Hamplanet from the 80s.\n\nHell, I don't want to smacktalk people at the gym. We're all there for a reason, and it's because we are hamsters who need to exercise our bodies in a society that treats public parks as spaces to be afraid of, and malls as a place to exercise in. So I don't want to mock people for wearing what's comfortable to work out, or shame someone for wearing stretchy lingerie when they're just going to sweat through it and expose their terrible, terrible life choices to the rest of the gym. I really don't. I am not a gorgeous muscular specimen, which is why I work out as much as I have time to do with full-time toddler ridealong, and I do not have anywhere near enough acrylic panels in my orangerie to start chucking stones randomly.\n\nBut there are laws, people. Laws of physics. Laws of nature. And laws of gravity. Those laws inform clothing decisions, or bloody well should. In this particular case, those immutable laws combined with neon pink spandex and an overly tight workout top created an effect on a 5'2\" 300lb woman that I'll just call \"Exploded Raw Refrigerator Biscuit Dough Sculpture of 80s Aerobics instructor left to dry in the sun\". Or, less Modern Art Sculpturally, \"The Female Michelin Man Got Squashed By A Microwave Elephant On Her Way To The 80s Big Hair Convention\".\n\nThere was so much wrong, it was extremely difficult to see anything right. So I focused on the extremely cute kid in the carrier - one that, not too long ago, I was hauling around on one arm, too.\n\nThen she spoke, and the nasality of a New Joysee accent combined with the blocked passages of a chronic smoker along for the ride.\n\n\"Hi, I'm here to drop off my kids for daycare.\"\n\nNow, our gym requires that you actually call ahead 24 hours to make sure there's space for your kid. There's fire codes, infant liability, etc.\n\nThe lady behind the desk, all perky smiles, says, \"Of course! And you're dropping off who, exactly?\"\n\nThe Spandex Michelin Woman rattles off her kids' names, and exasperatedly says, \"Tsch. We're here EVERY day. They're on the list.\"\n\n\"Oh, I'm sorry, but I don't see them, and we're full up today. Can I put you on the list for tomorrow?\"\n\nSo rather than actually go \"oops, I made a mistake, guess we'll have to come back again another time\", the Spandex Michelin Woman doubles down - and puts her infant down DIRECTLY IN THE PATH OF THE DOORWAY TO THE OUTSIDE, and begins yelling about how there's nowhere near the number of kids at the daycare and she is fine to drop them off, they do this all the time.\n\nThe receptionist, of course, is carefully saying, \"I'm sorry but our policy is 24 hour notification and we're full up this morning. Some of our reservations haven't arrived yet, so if you wait or they cancel, we may be able to make an exception.\"\n\nAnd then there's me, still waiting. I'm going, \"um. Um. Um. UM.\" because I know how fast that door opens, and a Graco carrier will immediately get bowled over with a potential forehead stamp for said kiddo riding in it due to the doorstop on it. Oh, and I can't open the door because the kid is directly in its path, and if I moved the carrier, I would be committing Strange Man Moving Child Felony Number One - don't touch another person's kid or car carrier unless it's an actual emergency.\n\nSo I quietly say, \"Ma'am, you probably don't want to put your baby there. That's right in the way of the door.\" I also would like her to move it, since I have to open the door to get out, but because she's essentially blocked the door with her infant while she bitches at the receptionist, I can't.\n\nShe looks at me and says, \"She's fine, just leave.\"\n\nJust then I reach up and catch the door as another parent comes in with THEIR kids to drop off, which whacks the car carrier and the infant wakes up and begins crying.\n\nThe woman then whirls around and says \"DON'T MOVE MY CHILD.\" My hand, of course, being on the door to keep it from whacking the carrier, and nowhere near the floor.\n\nAt this point, the daycare receptionist has had enough, and says, \"Can I see your gym membership card?\"\n\nSpandex Michelin Woman rolls her eyes and says \"Tsch, I left it at home.\"\n\nOf course you did.\n\n\"I can look it up for you, but I can't check your kids in until we have a cancellation.\"\n\nExasperation continues from Michelin for a minute. I wait until I've had enough, and finally say, \"LADY. I am leaving. Your kid is blocking the only exit. MOVE YOUR KID. IT IS NOT SAFE FOR HER TO BE THERE.\"\n\nMichelin rolls her eyes and huffs out, \"FINE\" and moves the kid to sit next to the desk - which would have been the more logical point. I should mention the kid is still fussing and grouching, but is Michelin paying attention? Nope.\n\nI should also mention that Mini Michelin is trying like hell to get into the play area, which isn't happening until the receptionist opens the door and lets him through. This kid is chubby as hell, but as a parent, I'm pretty aware that a lot of what looks like chub for kids is also baby fat that vanishes in every growing cycle.\n\nAnd like I said, I don't want to judge. But this kid is shrieking and throwing a fit the entire time, but the receptionist is holding firm.\n\nAt this point I'm just hanging around the handwash station, carefully unwinding my headphones from the carrier and casually making sure my kiddo has her snacks, water, and I have my phone turned up to max. Not because I can't do this elsewhere, but because god help this retarded manatee of a woman if that kid bodychecks my daughter in front of me because she dropped him over the fence.\n\nAt this point, receptionist is holding firm and refuses to budge, so Michelin stomps to the door, flings it open (barely missing me this time) and gets Mini Michelin distracted and coming to her by waving (I kid you not) a Snickers bar at him.\n\nI figure that's the last I'll see of her that day.\n\nOh no. No no, no.\n\nI'm on an elliptical working out. My machine has just ticked over to 32 minutes completed out of a 65 minute workout when I hear \"EXCUSE ME\". Since I usually plug in the 'phones and turn them up high to do cardio, it must have been a bellow of epic proportions. Surprise! It's Michelin! And she's brought a bag of workout goodies (overflowing with electric Green Soda bottles and King-Size Snickers candy bars! Hooray!)\n\nAnd she's apparently decided to yell at me for being on the elliptical for longer than 30 minutes. This is exactly what she says, except that she adds, \"It's the rules!\"\n\nSee, our gym is pretty crowded during the work week. Usually there's a long wait for machines on certain days - Mondays, Tuesdays, Wednesdays and Thursdays are the worst from 6AM to 8AM and 4PM to 7:30PM as everyone is being \"good\" for the weekday, then it plummets, and goes insane from 10AM to 3PM on Saturday and Sunday. So there's a courtesy rule - if there's a lot of people in the gym, be nice and keep your workout on any one machine to 30 minutes or less. There's signs that specifically say \"As a courtesy to other patrons please limit your usage to 30 minutes during peak hours.\"\n\nThe key here being peak hours. Not hours like 3am when the only people are the quiet night shift cleaning staff and the insomniacs figuring if they have to watch infomercials on basic cable, they might as well do it on a treadmill to knock themselves out, or 11am when the only people are flabby middle-aged patrons and 2nd honeymooning retirees.\n\nIt's 11:10 on a Tuesday morning. The very popular spinning class with the Greek former model turned athletic instructor is instructing his class to \"Ride eet hard laydeeees\" one floor below me, and I am surrounded by a smattering of people who will be eating their dinners around 4PM this afternoon at the local Denny's and going to bed before the end of the Big Bang Theory - in short, Edna and Richard, my favorite retirees, who are laboring up an endless hill holding hands on separate treadmills twenty feet away. Other than that, there's nobody around me, since all of the hot stay-at-home moms are busy working their asses off to impress each other and Yanni the Cyclist Instructor. I can count fifteen empty machines in my field of vision just looking around the gravitational field effect of Michelin lady. \n\nThere's absolutely no reason to switch machines whatsoever, unless, as my evil brain reminds me, Michelin decides to take a machine directly in my line of sight, thus providing an effective erotic experience similar to getting thumped in the groin by a 20lb medicine ball traveling at 100mph while standing naked in an ice storm watching reruns of C-Span.\n\nSo against my better judgment, I say, \"Yeah, and?\" \n\nMichelin says, \"Well, you know you're supposed to only go for 30 minutes. It's the rules.\"\n\nI look around the gym. \"Yeah, if there's people waiting.\"\n\nMichelin says, \"You know you're supposed to get off after thirty minutes and let someone else have a turn.\"\n\nI look at her and have more or less had it with her, and ask, \"Is this about me asking you to move your kid out of the way of the swinging door? Because if it is, please just go bother someone else, okay?\"\n\nMichelin says, \"NO IT'S NOT ABOUT THAT\" in a way that says, \"Oh yes, it's very much about that.\"\n\nSo I say \"Do you want me to move? Is this your favorite machine? Fine.\"\n\nI get off and move three machines over to the left, and start up again. Does Michelin follow me? Oh yes, of course she does.\n\n\"NO, IT'S ABOUT SAFETY!\" Michelin shouts. \"YOU CAN'T WORK OUT THAT HARD!\"\n\nLike I said. I'd more or less had it.\n\n\"Lady, working out at a low cardio level for over an hour isn't unsafe. It's not going to give me a heart attack. Drinking a Mountain Dew while walking on an elliptical at the lowest setting at a sloth's pace? That's not going to give you a heart attack either. So why don't you just leave me the fuck alone and I'll leave you the fuck alone, okay? You go do whatever you want and stop harassing me.\"\n\nEdna, at this point, having watched this little interchange, stops her treadmill, comes over and says, \"Mal, honey, is everything okay here?\"\n\n\"Everything's fine, Edna. This lovely lady was just reminding me of the time limits.\"\n\n\"Oh, never you pay no mind. Hell, if I had a dollar for every time I ignored that sign, I'd have five dollars.\"\n\nRichard yells over, \"Yeah, because she quits 25 minutes into it and goes to get a drink of water down at the spinner class!\"\n\n\"Girl's gotta do some window shopping!\" She winks and goes back to Richard, who is grinning, but still watching us.\n\nMichelin is turning a lovely shade of puce, mottled with what I'm sure she thinks is a cutting stare, but really more or less appears as mild constipation. Finally she thumps back to the elliptical I was using, makes a huge show of wiping it down with a towel, then climbing on after shoving a pair of Mickey Mouse-sized OTE headphones on her head and cranking the volume up high enough that I can hear the strains of Insane Clown Posse start up from twelve feet away. Through my own damn in-ear noise-canceling headphones.\n\nAnd that's when it all goes so very, very wrong.\n\nI've mentioned I'm not a small person before.\n\nI've mentioned that I am careful about what I sit on and what I stand on, because I am not a small person. That being said, I also know when to NOT keep going.\n\nMichelin apparently does not, because, as Edna told me later, five minutes into her workout the machine begins to make a noise, then the elliptical pedal just blocks up completely, and Michelin loses her stride, losing her balance and falling off the elliptical.\n\nOf course, several of us go rushing over to her to help her up and find out what happened. The first thing she says once she gets her breath back is, \"He...he...he...musta broke it.\"\n\nNow, the mechanics of the ellipticals are pretty simple, and these just don't break unless they're broken intentionally or they have something clogging them. They're rated to 450lbs, something I know because I used to be around that weight and made sure to ask when starting on my workout regimen to lose the weight how much load these things can carry.\n\nThe gym staff member closest to this little tableau comes over to find out how bad it is. He bends over, frowns, and then pulls out...\n\n...not just one, but two King-Size Snickers bars. Unwrapped. With a workout towel around each one. Smashed into all oblivion of white towel candy mush and crammed into a tiny space by a heavy driving force much like a 300lb whale forcing a small lever and pulley system up and down a track. \n\nImmediately Michelin says \"THAT'S NOT MINE!\"\n\nExcept Edna pulls another from the little workout cubby holding a Mountain Dew on the elliptical and quietly says, \"Oh, honey\" in the most perfectly timed \"I'm so ashamed for you\" mother voice I've ever heard.\n\nAnd I figure that's me good for the day, so I'm off to the showers, while Michelin gets a free ride to the lobby and daycare area. \n\nI spend a bit more time than I should in the sauna - normally a place to silently wish your compatriots in Scandinavian fitness routines were younger, fitter, a different gender, and didn't twine their nosehairs while reading the paper naked with one hand on their hip and one foot on a bench, commenting loudly on the state of the world, but today even this experience is a blessed refuge, even as Richard sticks one foot on a bench, grabs the Sports page, turns up his hearing aid, and says, \"BOY, THAT WAS EXCITING!\" and proceeds to fill in everyone within earshot on the weekend's adventures of Edna and Richard, stopping thankfully right before he got to the part one would suspect Edna is revealed to not only be a silver fox, but also one who has a predilection for nautically-themed naughtiness on the high seas.\n\nAs I'm going down to pick up the kiddo from daycare, steeling myself for the inevitable temper tantrum as I take her out of the play area she loves so much, I see an ambulance pulled up with Michelin on a chair in the lobby with her kids nearby. I go in, pick up my kid, and go back out...\n\n...only to see Michelin demand that one of the ambulance guys let her eat her Snickers, because if she doesn't, her low blood sugar will kick in and she will crash because she had such a hard workout before the \"accident\".\n\n\n\n\nI've decided to start scheduling workouts and daycare at 8AM from now on.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Epic", "id": "65zrr4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "thealmightymalachi", "saved": false, "mod_reports": [], "name": "t3_65zrr4", "subreddit_name_prefixed": "r/fatpeoplestories", "approved_by": null, "over_18": false, "domain": "self.fatpeoplestories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2vzax", "edited": 1492484094.0, "link_flair_css_class": "epic", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/fatpeoplestories/comments/65zrr4/a_gym_hamplanetoid_and_the_saga_of_the_gym_daycare/", "num_reports": null, "locked": false, "stickied": false, "created": 1492507023.0, "url": "https://www.reddit.com/r/fatpeoplestories/comments/65zrr4/a_gym_hamplanetoid_and_the_saga_of_the_gym_daycare/", "author_flair_text": null, "quarantine": false, "title": "A Gym Hamplanetoid And The Saga of The Gym Daycare", "created_utc": 1492478223.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65zrr4", "likes": null, "replies": "", "user_reports": [], "id": "dgeiykm", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "benkbloch", "parent_id": "t3_65zrr4", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Everything about this is just so beautiful, it's like watching an explosion in a stained glass museum in slow motion. There's entitlement, there's unwarranted aggression, there's crab behavior, there's fat logic in terms of both exercise *and* nutrition, all that's missing is some \"condishuns\" (though I suppose \"sugars\" will do.) I really hope one day your child grows up and reads this, then realizes, \"So THAT'S why Dad made us go to daycare earlier...\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything about this is just so beautiful, it&amp;#39;s like watching an explosion in a stained glass museum in slow motion. There&amp;#39;s entitlement, there&amp;#39;s unwarranted aggression, there&amp;#39;s crab behavior, there&amp;#39;s fat logic in terms of both exercise &lt;em&gt;and&lt;/em&gt; nutrition, all that&amp;#39;s missing is some &amp;quot;condishuns&amp;quot; (though I suppose &amp;quot;sugars&amp;quot; will do.) I really hope one day your child grows up and reads this, then realizes, &amp;quot;So THAT&amp;#39;S why Dad made us go to daycare earlier...&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgeiykm", "score_hidden": false, "stickied": false, "created": 1492510183.0, "created_utc": 1492481383.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65zrr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65zrr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65zrr4", "likes": null, "replies": "", "user_reports": [], "id": "dgejzz4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "vizsla_velcro", "parent_id": "t1_dgejyqb", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "That must be difficult for a bowling GOD such as yourself. ..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That must be difficult for a bowling GOD such as yourself. ..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgejzz4", "score_hidden": false, "stickied": false, "created": 1492511394.0, "created_utc": 1492482594.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgejyqb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thealmightymalachi", "parent_id": "t1_dgejjnm", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Surprisingly enough you have to go about 15 miles out of the city proper to go bowling at an actual alley, which curtailed my bowling activities a long while back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Surprisingly enough you have to go about 15 miles out of the city proper to go bowling at an actual alley, which curtailed my bowling activities a long while back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgejyqb", "score_hidden": false, "stickied": false, "created": 1492511353.0, "created_utc": 1492482553.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgejjnm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "vizsla_velcro", "parent_id": "t3_65zrr4", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "So,  does your gym offer bowling? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So,  does your gym offer bowling? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgejjnm", "score_hidden": false, "stickied": false, "created": 1492510858.0, "created_utc": 1492482058.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65zrr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65zrr4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65zrr4", "likes": null, "replies": "", "user_reports": [], "id": "dgelau3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheChubbyCustodian", "parent_id": "t1_dgekm9d", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Dude it was a rhetorical question. LOL \n\nBut hey good on yah! I play warcraft too. I guess I just wanted to make a spongebob reference because someone mentioned 3 am.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude it was a rhetorical question. LOL &lt;/p&gt;\n\n&lt;p&gt;But hey good on yah! I play warcraft too. I guess I just wanted to make a spongebob reference because someone mentioned 3 am.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgelau3", "score_hidden": false, "stickied": false, "created": 1492513019.0, "created_utc": 1492484219.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekm9d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thealmightymalachi", "parent_id": "t1_dgekbv0", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Me, when I was trying to lose weight and dealing with chronic insomnia, and not fall back into my alternative habit of staying up all night eating Doritos and playing video games when I couldn't sleep.\n\nIt took effort to get off my ass instead of booting up Warcraft or some other game, but the gym always had a couple other night owls working out or carefully lifting weights in the wee hours after their bar job closed, and it was always -QUIET-.\n\nPlus, the odds of having old man bait and tackle swinging free at eye level in the sauna were radically reduced.\n\nIt really is one of the keys I used to remove hamminess from my life - have the ability to substitute stupid decisions that are healthy at your disposal 24/7 instead of stupid decisions that are unhealthy.", "edited": 1492484293.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Me, when I was trying to lose weight and dealing with chronic insomnia, and not fall back into my alternative habit of staying up all night eating Doritos and playing video games when I couldn&amp;#39;t sleep.&lt;/p&gt;\n\n&lt;p&gt;It took effort to get off my ass instead of booting up Warcraft or some other game, but the gym always had a couple other night owls working out or carefully lifting weights in the wee hours after their bar job closed, and it was always -QUIET-.&lt;/p&gt;\n\n&lt;p&gt;Plus, the odds of having old man bait and tackle swinging free at eye level in the sauna were radically reduced.&lt;/p&gt;\n\n&lt;p&gt;It really is one of the keys I used to remove hamminess from my life - have the ability to substitute stupid decisions that are healthy at your disposal 24/7 instead of stupid decisions that are unhealthy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgekm9d", "score_hidden": false, "stickied": false, "created": 1492512158.0, "created_utc": 1492483358.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekbv0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheChubbyCustodian", "parent_id": "t3_65zrr4", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "&gt;The key here being peak hours. Not hours like 3 am.\n\nWell to be honest, the only reasonable thing to do at 3am is eat a krabby patty. Every ham know that. Who the hell works-out at 3 am?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The key here being peak hours. Not hours like 3 am.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well to be honest, the only reasonable thing to do at 3am is eat a krabby patty. Every ham know that. Who the hell works-out at 3 am?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgekbv0", "score_hidden": false, "stickied": false, "created": 1492511797.0, "created_utc": 1492482997.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65zrr4", "likes": null, "replies": "", "user_reports": [], "id": "dgemvyy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aquainst1", "parent_id": "t3_65zrr4", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "*Exploded Raw Refrigerator Biscuit Dough Sculpture of 80s Aerobics instructor left to dry in the sun\". Or, less Modern Art Sculpturally, \"The Female Michelin Man Got Squashed By A Microwave Elephant On Her Way To The 80s Big Hair Convention\".*\n\nBWAHAHAHAHAHA!!!  UPVOTE!!!\n\n(from a former aerobics instructor)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Exploded Raw Refrigerator Biscuit Dough Sculpture of 80s Aerobics instructor left to dry in the sun&amp;quot;. Or, less Modern Art Sculpturally, &amp;quot;The Female Michelin Man Got Squashed By A Microwave Elephant On Her Way To The 80s Big Hair Convention&amp;quot;.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;BWAHAHAHAHAHA!!!  UPVOTE!!!&lt;/p&gt;\n\n&lt;p&gt;(from a former aerobics instructor)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgemvyy", "score_hidden": false, "stickied": false, "created": 1492515109.0, "created_utc": 1492486309.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65zrr4", "likes": null, "replies": "", "user_reports": [], "id": "dgegdw5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Type_II_Bot", "parent_id": "t3_65zrr4", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "\nOther stories from /u/thealmightymalachi:\n\n* 04/18/2017 - [A Gym Hamplanetoid And The Saga of The Gym Daycare](http://www.reddit.com/r/fatpeoplestories/comments/65zrr4/a_gym_hamplanetoid_and_the_saga_of_the_gym_daycare/) (this)\n\n* 02/10/2017 - [Please, do explain to me how you are a paragon of health](http://www.reddit.com/r/fatpeoplestories/comments/5t4n1y/please_do_explain_to_me_how_you_are_a_paragon_of/)\n\n* 02/03/2017 - [From the Malachi Files: NSFW, possibly NSFAnyone CatfishHammianana Teaches Malachi Why It's A Good Idea To Go At Least Three Miles From Home On A First Date](http://www.reddit.com/r/fatpeoplestories/comments/5rsnzq/from_the_malachi_files_nsfw_possibly_nsfanyone/)\n\n* 02/02/2017 - [Diabeeetis is no big deal, y'know.](http://www.reddit.com/r/fatpeoplestories/comments/5rkteo/diabeeetis_is_no_big_deal_yknow/)\n\n* 01/03/2017 - [[Wayback Time Machine - 20 Years Previous] The Many Fetishes of TaxiDirectorHam (possibly NSFAnyone)](http://www.reddit.com/r/fatpeoplestories/comments/5lv1g3/wayback_time_machine_20_years_previous_the_many/)\n\n* 01/01/2017 - [New Year's Eve Ham](http://www.reddit.com/r/fatpeoplestories/comments/5lgsxr/new_years_eve_ham/)\n\n* 09/14/2016 - [Broken Foot? Missing Right Leg? \"You're Not Handicapped! REAL Handicapped People Like Me Have a Condition!\"](http://www.reddit.com/r/fatpeoplestories/comments/52oqhp/broken_foot_missing_right_leg_youre_not/)\n\n* 05/28/2016 - [Short and Not Very Sweet for Hambone the Elder - that's the baby's, NOT yours.](http://www.reddit.com/r/fatpeoplestories/comments/4lhe98/short_and_not_very_sweet_for_hambone_the_elder/)\n\n* 05/17/2016 - [Standup Paddleboards are not designed to be ridden by elephant seals.](http://www.reddit.com/r/fatpeoplestories/comments/4jsich/standup_paddleboards_are_not_designed_to_be/)\n\n* 05/09/2016 - [Flight of Doom, Part II - Yoga The Hutt Joins the Mile High Club and learns an aftersex smoke is a bad idea.](http://www.reddit.com/r/fatpeoplestories/comments/4ii51a/flight_of_doom_part_ii_yoga_the_hutt_joins_the/)\n\n* 05/09/2016 - [Get off my girlfriend, you goddamn manatee / why fat people need to pay for two seats](http://www.reddit.com/r/fatpeoplestories/comments/4ihbih/get_off_my_girlfriend_you_goddamn_manatee_why_fat/)\n\n* 04/22/2016 - [A FPS story starring...me.](http://www.reddit.com/r/fatpeoplestories/comments/4fx81p/a_fps_story_starringme/)\n\n_____\n^If ^you ^want ^to ^get ^notified ^as ^soon ^as ^thealmightymalachi ^posts ^a ^new ^story, [^click ^here](http://www.reddit.com/message/compose/?to=Type_II_Bot&amp;subject=subscribe&amp;message=subscribe%20/u/thealmightymalachi)^.\n\n^(Hi I'm Type_II_Bot, for more info about me visit /r/Type_II_Bot)\n\n^Find ^this ^bot ^helpful? ^Consider ^donating [^$1](https://www.paypal.me/r3d4rmy/1)^, [^$5](https://www.paypal.me/r3d4rmy/5)^, ^or ^with ^BTC: ^1FEjYZAeUvY6zEx4x3SShxMwCZcqSHfNoH", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Other stories from &lt;a href=\"/u/thealmightymalachi\"&gt;/u/thealmightymalachi&lt;/a&gt;:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;04/18/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/65zrr4/a_gym_hamplanetoid_and_the_saga_of_the_gym_daycare/\"&gt;A Gym Hamplanetoid And The Saga of The Gym Daycare&lt;/a&gt; (this)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;02/10/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/5t4n1y/please_do_explain_to_me_how_you_are_a_paragon_of/\"&gt;Please, do explain to me how you are a paragon of health&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;02/03/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/5rsnzq/from_the_malachi_files_nsfw_possibly_nsfanyone/\"&gt;From the Malachi Files: NSFW, possibly NSFAnyone CatfishHammianana Teaches Malachi Why It&amp;#39;s A Good Idea To Go At Least Three Miles From Home On A First Date&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;02/02/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/5rkteo/diabeeetis_is_no_big_deal_yknow/\"&gt;Diabeeetis is no big deal, y&amp;#39;know.&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;01/03/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/5lv1g3/wayback_time_machine_20_years_previous_the_many/\"&gt;[Wayback Time Machine - 20 Years Previous] The Many Fetishes of TaxiDirectorHam (possibly NSFAnyone)&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;01/01/2017 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/5lgsxr/new_years_eve_ham/\"&gt;New Year&amp;#39;s Eve Ham&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;09/14/2016 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/52oqhp/broken_foot_missing_right_leg_youre_not/\"&gt;Broken Foot? Missing Right Leg? &amp;quot;You&amp;#39;re Not Handicapped! REAL Handicapped People Like Me Have a Condition!&amp;quot;&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;05/28/2016 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/4lhe98/short_and_not_very_sweet_for_hambone_the_elder/\"&gt;Short and Not Very Sweet for Hambone the Elder - that&amp;#39;s the baby&amp;#39;s, NOT yours.&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;05/17/2016 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/4jsich/standup_paddleboards_are_not_designed_to_be/\"&gt;Standup Paddleboards are not designed to be ridden by elephant seals.&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;05/09/2016 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/4ii51a/flight_of_doom_part_ii_yoga_the_hutt_joins_the/\"&gt;Flight of Doom, Part II - Yoga The Hutt Joins the Mile High Club and learns an aftersex smoke is a bad idea.&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;05/09/2016 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/4ihbih/get_off_my_girlfriend_you_goddamn_manatee_why_fat/\"&gt;Get off my girlfriend, you goddamn manatee / why fat people need to pay for two seats&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;04/22/2016 - &lt;a href=\"http://www.reddit.com/r/fatpeoplestories/comments/4fx81p/a_fps_story_starringme/\"&gt;A FPS story starring...me.&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;If&lt;/sup&gt; &lt;sup&gt;you&lt;/sup&gt; &lt;sup&gt;want&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;get&lt;/sup&gt; &lt;sup&gt;notified&lt;/sup&gt; &lt;sup&gt;as&lt;/sup&gt; &lt;sup&gt;soon&lt;/sup&gt; &lt;sup&gt;as&lt;/sup&gt; &lt;sup&gt;thealmightymalachi&lt;/sup&gt; &lt;sup&gt;posts&lt;/sup&gt; &lt;sup&gt;a&lt;/sup&gt; &lt;sup&gt;new&lt;/sup&gt; &lt;sup&gt;story,&lt;/sup&gt; &lt;a href=\"http://www.reddit.com/message/compose/?to=Type_II_Bot&amp;amp;subject=subscribe&amp;amp;message=subscribe%20/u/thealmightymalachi\"&gt;&lt;sup&gt;click&lt;/sup&gt; &lt;sup&gt;here&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;.&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;Hi I&amp;#39;m Type_II_Bot, for more info about me visit &lt;a href=\"/r/Type_II_Bot\"&gt;/r/Type_II_Bot&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;Find&lt;/sup&gt; &lt;sup&gt;this&lt;/sup&gt; &lt;sup&gt;bot&lt;/sup&gt; &lt;sup&gt;helpful?&lt;/sup&gt; &lt;sup&gt;Consider&lt;/sup&gt; &lt;sup&gt;donating&lt;/sup&gt; &lt;a href=\"https://www.paypal.me/r3d4rmy/1\"&gt;&lt;sup&gt;$1&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;,&lt;/sup&gt; &lt;a href=\"https://www.paypal.me/r3d4rmy/5\"&gt;&lt;sup&gt;$5&lt;/sup&gt;&lt;/a&gt;&lt;sup&gt;,&lt;/sup&gt; &lt;sup&gt;or&lt;/sup&gt; &lt;sup&gt;with&lt;/sup&gt; &lt;sup&gt;BTC:&lt;/sup&gt; &lt;sup&gt;1FEjYZAeUvY6zEx4x3SShxMwCZcqSHfNoH&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgegdw5", "score_hidden": false, "stickied": false, "created": 1492507063.0, "created_utc": 1492478263.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vzax", "removal_reason": null, "link_id": "t3_65zrr4", "likes": null, "replies": "", "user_reports": [], "id": "dgeog6b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JerseyDevil90", "parent_id": "t3_65zrr4", "subreddit_name_prefixed": "r/fatpeoplestories", "controversiality": 0, "body": "Okay, I loved the story, but I am super triggered. No one in Jersey says Joysee. At all. Ever. In history.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, I loved the story, but I am super triggered. No one in Jersey says Joysee. At all. Ever. In history.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "fatpeoplestories", "name": "t1_dgeog6b", "score_hidden": false, "stickied": false, "created": 1492517393.0, "created_utc": 1492488593.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]