[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "UnresolvedMysteries", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Can anyone recommend good podcasts that pertain to this sort of thing? Thanks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Can anyone recommend good podcasts that pertain to this sort of thing? Thanks.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Request", "id": "64v02z", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "SuicideBonger", "saved": false, "mod_reports": [], "name": "t3_64v02z", "subreddit_name_prefixed": "r/UnresolvedMysteries", "approved_by": null, "over_18": false, "domain": "self.UnresolvedMysteries", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2wvvc", "edited": false, "link_flair_css_class": "reqst", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/UnresolvedMysteries/comments/64v02z/unresolved_mystery_podcasts/", "num_reports": null, "locked": false, "stickied": false, "created": 1491987139.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/64v02z/unresolved_mystery_podcasts/", "author_flair_text": null, "quarantine": false, "title": "Unresolved Mystery Podcasts", "created_utc": 1491958339.0, "distinguished": null, "media": null, "upvote_ratio": 0.71, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": "", "user_reports": [], "id": "dg5c2gz", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "fqing", "parent_id": "t3_64v02z", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "The Trail Went Cold is my current obsession ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Trail Went Cold is my current obsession &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg5c2gz", "score_hidden": false, "stickied": false, "created": 1491992754.0, "created_utc": 1491963954.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": "", "user_reports": [], "id": "dg5fu0r", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "heidivonhoop", "parent_id": "t3_64v02z", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "The Trail Went Cold, cannot stop listening! DEFINITELY my new fave. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Trail Went Cold, cannot stop listening! DEFINITELY my new fave. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg5fu0r", "score_hidden": false, "stickied": false, "created": 1491998296.0, "created_utc": 1491969496.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": "", "user_reports": [], "id": "dg8z7vb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thebrandedman", "parent_id": "t1_dg5wi5c", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I like his detached style. All the focus is on the story, not the storyteller. It's very refreshing and professional.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like his detached style. All the focus is on the story, not the storyteller. It&amp;#39;s very refreshing and professional.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8z7vb", "score_hidden": false, "stickied": false, "created": 1492193144.0, "created_utc": 1492164344.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wi5c", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "tyler_sleepy", "parent_id": "t3_64v02z", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Casefile is really well done, even if the host does speak a little too quickly", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Casefile is really well done, even if the host does speak a little too quickly&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg5wi5c", "score_hidden": false, "stickied": false, "created": 1492034826.0, "created_utc": 1492006026.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": "", "user_reports": [], "id": "dg5a6lj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SuicideBonger", "parent_id": "t1_dg59dck", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg5a6lj", "score_hidden": false, "stickied": false, "created": 1491990211.0, "created_utc": 1491961411.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": "", "user_reports": [], "id": "dg5j64x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "topgunadam", "parent_id": "t1_dg59dck", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "The unresolved podcast is good", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The unresolved podcast is good&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg5j64x", "score_hidden": false, "stickied": false, "created": 1492004406.0, "created_utc": 1491975606.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg59dck", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "lovelydove1234", "parent_id": "t3_64v02z", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "- The unresolved podcast\n- Thin Air podcast \n- Vanished podcast \n\nI would check out other threads on this sub about podcasts. You should be able to find plenty. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;The unresolved podcast&lt;/li&gt;\n&lt;li&gt;Thin Air podcast &lt;/li&gt;\n&lt;li&gt;Vanished podcast &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I would check out other threads on this sub about podcasts. You should be able to find plenty. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg59dck", "score_hidden": false, "stickied": false, "created": 1491989156.0, "created_utc": 1491960356.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": "", "user_reports": [], "id": "dg86p2s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SuicideBonger", "parent_id": "t1_dg86iy0", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Holy shit, thanks!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit, thanks!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg86p2s", "score_hidden": false, "stickied": false, "created": 1492144684.0, "created_utc": 1492115884.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86iy0", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bowe_spergdahl", "parent_id": "t3_64v02z", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "\"The Trail Went Cold\" is definitely the filet mignon of single-serving true crime podcasts. The cases selected are excellent. Many are less oft-discussed, and they are all genuinely unresolved and, for the most part, mysterious and freaky. That's more what I'm into than in hearing about the life, times, and capture of serial killers or other notable criminals, so TTWC is pretty much perfect for me. Robin Warder is a great story-teller, and the only true crime host who tries to present his cases as scripted stories rather than going through them in a more disjointed or conversational way. The atmosphere of the podcast is great, helped along by some good music. It's a very tight production overall. Only knock I can think of is that as well as being kind of a spiritual successor to UM, TTWC does cover quite a few cases that the TV show did also. Not a problem for me since I haven't seen much UM, but if you know that show like the back of your hand, maybe some of the episodes will feel like going over old ground. \n\nFor me the 2 and 3 spots are close between \"Thinkin Sideways\" and \"True Crime Garage\". But I'd put them in that order because I still get kind of an excited feeling when new episodes of the former show up in my podcast feed.\n\nTS benefits from the array of cases it covers, and I think it gets to a pretty good sweet spot in that regard. It's far from just a true crime podcast -- the hosts have covered many historical mysteries, unexplained phenomena, and some apocrypha/cryptid stuff. They also delve much further back into history for their cases at times than the other shows. But they also steer clear of being a paranormal-type podcast (with a couple of exceptions I can think of over the course of a few years). They're not \"Astonishing Legends\" (not that I have anything against ALP -- their more grounded episodes are very well-researched and effective). I really like that middle point, and so they discuss many cases other shows don't. The other main strength of the show is the chemistry between the three hosts, who all have clearly-defined \"voices\" and personas. Especially early in the show's life, you really got the feeling of overhearing a bar room conversation between three friends, which is pleasant. The major weakness of the show, I think, is that some of the episodes do feel more like dramatic readings of Wikipedia entries. If you know a case reasonably well, you probably won't find out much that is novel from a TS episode. Though the hosts do at least discuss theories and their respective likelihoods explicitly and clearly, even offering their own original theories at times.\n\nTCG has really gathered momentum since it began, and has a number of unique qualities. The production is probably the best of any of these shows. I really like the Captain's music, and the use of news and documentary footage adds atmosphere without making the show feel like collage. That really helps with immersion. As with TS, the hosts have clear and distinctive personality, and there is some humour in the show. The episodes are long and so feel exhaustive though, as with TS, someone who knows a case well probably won't learn much that is new. The cases they cover stand out a little less for distinctiveness than the above. They've covered a lot of famous cases, and they don't focus on unresolved or especially mysterious cases (it's a straight-up true crime show). Earlier in the show's life they did cover some more obscure cases and even had kind of a focus on Ohio, where the show is based.\n\nI'd put \"Generation Why?\" fourth here. There are some strong episodes of the show, and several lesser known cases are covered. There's an exhaustive back catalogue, so chances are if you want a quick overview of a certain case GW will be able to accommodate you. Some of the treatments just feel cursory, though -- Casey Anthony is an example that sticks out, or JonBenet. Like TCG, this is a true crime podcast and features many resolved and/or relatively mundane cases. There is something of a focus on controversial or \"wrongful\" convictions. This might be a strong hook for some people, but personally I'm a bit tired of hearing that a conviction is \"wrongful\" based on slim evidence, wishful thinking, or an eccentric understanding of what constitutes reasonable doubt. But my main problem with the podcast is the blandness of the hosts. I first listened to the podcast close to a year ago and I still can't tell them apart, either by voice or personality. There doesn't seem to be much desire to insert any kind of personality or colour into the show, and it feels like the auditory equivalent of a bread sandwich.\n\nThose are the four single-serving shows where I listen to all or almost all (or, in the case of GW, most) of the episodes. As far as single-case shows go:\n\n\"Serial\" is the show that got me into this in the first place. I don't know how well it holds up, but nothing I've listened to since competes for immersion or production values.\n\n\"Accused\", regarding the 1978 murder of Beth Andes, doesn't get enough love and is probably a worthier successor to \"Serial\" series 1 than series 2 of \"Serial\" was. A very interesting cast of characters who the host winkles some interesting information out of. High immersion factor. Genuinely wrongful arrest (thankfully not conviction). Just does a very good job of recreating the scene, which is particularly marvelous given that we're talking about events of 40 years ago. Obviously there's no resolution to be had, which is frustrating, but what are you going to do?\n\nNot sure if this really counts but the series of episodes of \"The Night Time Podcast\" on Emma Filipoff's disappearance are really pretty good, I think. They begin with a clear and comprehensive laying out of the case, and since then have featured interviews with people close to Emma who shed light on her psychology at the time. The case is a genuinely mysterious \"into thin air\" disappearance. A young man who was implied to be the prime suspect in a Canadian TV documentary gets a chance to put his side of the story, which is especially fascinating.\n\n\"Up and Vanished\", concerning the disappearance (now, as we know, murder) of Tara Grinstead, started off very well but ran out of steam a long time ago. There were some fascinating insights, interviews and potential leads in the early going. As we now know, none of them were even close to illuminating the actual cause of Tara's disappearance and murder. Just a few weeks before arrests were made, the cohost and his sidekicks were screaming about \"mysterious\" Facebook posts that ended up being totally unrelated to the case. The names of people in the local area were dragged through the mud on podcast episodes without any basis and, as it turned out, entirely without justification. Yet after the arrests were made, the host became very self-congratulatory about his supposed contribution to the resolution -- he \"kept interest alive\" and \"raised awareness\", don't you know. I'm not really sure what the purpose of the podcast is now. It also feels somewhat ghoulish to have adverts for Blue Apron and Squarespace introing a podcast about a woman who was recently found to have been murdered and the resultant ongoing investigation.\n\nThe meandering, self-regarding, monomaniacal quality that U&amp;V has taken on more recently was there pretty much from the start in \"Missing Maura Murray\". Her case is an unpopular one in these parts -- at this point for good reason -- but is (or was) fascinating due to the wealth of information about Maura's precarious social, financial, and psychological position at the time of her disappearance, and the relatively clear division of opinion between a few sharply-delineated and plausible theories. After rehashing this information, however, MMM really started to wander off the path. It obsessed over inconsequential details (the rag in the tailpipe), swung between (conflicting, unsubstantiated, and sometimes offensive) portrayals of Maura, invited on psychics and crackpot conspiracy theorists, developed a smug and passive-aggressive mien towards those who criticised these developments, and found itself stranded in tall, tall corn pursuing weird theories about some kind of multi-layered police cover-up. At points it threatened to come out the other side and become interesting as an exercise in voyeurism, but mostly it remained weird and boring.\n\nThose guys have a new podcast out now, concerning the Brianna Maitland disappearance (\"Crawlspace\"). At this point they've set the scene and exhausted the three useful and interesting informants they have available, piecing together a convincing outline of what happened to Brianna though not identifying specific suspects. So in six months time, episode 46 will feature a guy with a blog holding forth about how Brianna was a traumatized victim of Pizzagate disappeared by DNC operatives whilst Tim and Lance say 'mmm' and 'interesting!' thoughtfully.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;The Trail Went Cold&amp;quot; is definitely the filet mignon of single-serving true crime podcasts. The cases selected are excellent. Many are less oft-discussed, and they are all genuinely unresolved and, for the most part, mysterious and freaky. That&amp;#39;s more what I&amp;#39;m into than in hearing about the life, times, and capture of serial killers or other notable criminals, so TTWC is pretty much perfect for me. Robin Warder is a great story-teller, and the only true crime host who tries to present his cases as scripted stories rather than going through them in a more disjointed or conversational way. The atmosphere of the podcast is great, helped along by some good music. It&amp;#39;s a very tight production overall. Only knock I can think of is that as well as being kind of a spiritual successor to UM, TTWC does cover quite a few cases that the TV show did also. Not a problem for me since I haven&amp;#39;t seen much UM, but if you know that show like the back of your hand, maybe some of the episodes will feel like going over old ground. &lt;/p&gt;\n\n&lt;p&gt;For me the 2 and 3 spots are close between &amp;quot;Thinkin Sideways&amp;quot; and &amp;quot;True Crime Garage&amp;quot;. But I&amp;#39;d put them in that order because I still get kind of an excited feeling when new episodes of the former show up in my podcast feed.&lt;/p&gt;\n\n&lt;p&gt;TS benefits from the array of cases it covers, and I think it gets to a pretty good sweet spot in that regard. It&amp;#39;s far from just a true crime podcast -- the hosts have covered many historical mysteries, unexplained phenomena, and some apocrypha/cryptid stuff. They also delve much further back into history for their cases at times than the other shows. But they also steer clear of being a paranormal-type podcast (with a couple of exceptions I can think of over the course of a few years). They&amp;#39;re not &amp;quot;Astonishing Legends&amp;quot; (not that I have anything against ALP -- their more grounded episodes are very well-researched and effective). I really like that middle point, and so they discuss many cases other shows don&amp;#39;t. The other main strength of the show is the chemistry between the three hosts, who all have clearly-defined &amp;quot;voices&amp;quot; and personas. Especially early in the show&amp;#39;s life, you really got the feeling of overhearing a bar room conversation between three friends, which is pleasant. The major weakness of the show, I think, is that some of the episodes do feel more like dramatic readings of Wikipedia entries. If you know a case reasonably well, you probably won&amp;#39;t find out much that is novel from a TS episode. Though the hosts do at least discuss theories and their respective likelihoods explicitly and clearly, even offering their own original theories at times.&lt;/p&gt;\n\n&lt;p&gt;TCG has really gathered momentum since it began, and has a number of unique qualities. The production is probably the best of any of these shows. I really like the Captain&amp;#39;s music, and the use of news and documentary footage adds atmosphere without making the show feel like collage. That really helps with immersion. As with TS, the hosts have clear and distinctive personality, and there is some humour in the show. The episodes are long and so feel exhaustive though, as with TS, someone who knows a case well probably won&amp;#39;t learn much that is new. The cases they cover stand out a little less for distinctiveness than the above. They&amp;#39;ve covered a lot of famous cases, and they don&amp;#39;t focus on unresolved or especially mysterious cases (it&amp;#39;s a straight-up true crime show). Earlier in the show&amp;#39;s life they did cover some more obscure cases and even had kind of a focus on Ohio, where the show is based.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d put &amp;quot;Generation Why?&amp;quot; fourth here. There are some strong episodes of the show, and several lesser known cases are covered. There&amp;#39;s an exhaustive back catalogue, so chances are if you want a quick overview of a certain case GW will be able to accommodate you. Some of the treatments just feel cursory, though -- Casey Anthony is an example that sticks out, or JonBenet. Like TCG, this is a true crime podcast and features many resolved and/or relatively mundane cases. There is something of a focus on controversial or &amp;quot;wrongful&amp;quot; convictions. This might be a strong hook for some people, but personally I&amp;#39;m a bit tired of hearing that a conviction is &amp;quot;wrongful&amp;quot; based on slim evidence, wishful thinking, or an eccentric understanding of what constitutes reasonable doubt. But my main problem with the podcast is the blandness of the hosts. I first listened to the podcast close to a year ago and I still can&amp;#39;t tell them apart, either by voice or personality. There doesn&amp;#39;t seem to be much desire to insert any kind of personality or colour into the show, and it feels like the auditory equivalent of a bread sandwich.&lt;/p&gt;\n\n&lt;p&gt;Those are the four single-serving shows where I listen to all or almost all (or, in the case of GW, most) of the episodes. As far as single-case shows go:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Serial&amp;quot; is the show that got me into this in the first place. I don&amp;#39;t know how well it holds up, but nothing I&amp;#39;ve listened to since competes for immersion or production values.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Accused&amp;quot;, regarding the 1978 murder of Beth Andes, doesn&amp;#39;t get enough love and is probably a worthier successor to &amp;quot;Serial&amp;quot; series 1 than series 2 of &amp;quot;Serial&amp;quot; was. A very interesting cast of characters who the host winkles some interesting information out of. High immersion factor. Genuinely wrongful arrest (thankfully not conviction). Just does a very good job of recreating the scene, which is particularly marvelous given that we&amp;#39;re talking about events of 40 years ago. Obviously there&amp;#39;s no resolution to be had, which is frustrating, but what are you going to do?&lt;/p&gt;\n\n&lt;p&gt;Not sure if this really counts but the series of episodes of &amp;quot;The Night Time Podcast&amp;quot; on Emma Filipoff&amp;#39;s disappearance are really pretty good, I think. They begin with a clear and comprehensive laying out of the case, and since then have featured interviews with people close to Emma who shed light on her psychology at the time. The case is a genuinely mysterious &amp;quot;into thin air&amp;quot; disappearance. A young man who was implied to be the prime suspect in a Canadian TV documentary gets a chance to put his side of the story, which is especially fascinating.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Up and Vanished&amp;quot;, concerning the disappearance (now, as we know, murder) of Tara Grinstead, started off very well but ran out of steam a long time ago. There were some fascinating insights, interviews and potential leads in the early going. As we now know, none of them were even close to illuminating the actual cause of Tara&amp;#39;s disappearance and murder. Just a few weeks before arrests were made, the cohost and his sidekicks were screaming about &amp;quot;mysterious&amp;quot; Facebook posts that ended up being totally unrelated to the case. The names of people in the local area were dragged through the mud on podcast episodes without any basis and, as it turned out, entirely without justification. Yet after the arrests were made, the host became very self-congratulatory about his supposed contribution to the resolution -- he &amp;quot;kept interest alive&amp;quot; and &amp;quot;raised awareness&amp;quot;, don&amp;#39;t you know. I&amp;#39;m not really sure what the purpose of the podcast is now. It also feels somewhat ghoulish to have adverts for Blue Apron and Squarespace introing a podcast about a woman who was recently found to have been murdered and the resultant ongoing investigation.&lt;/p&gt;\n\n&lt;p&gt;The meandering, self-regarding, monomaniacal quality that U&amp;amp;V has taken on more recently was there pretty much from the start in &amp;quot;Missing Maura Murray&amp;quot;. Her case is an unpopular one in these parts -- at this point for good reason -- but is (or was) fascinating due to the wealth of information about Maura&amp;#39;s precarious social, financial, and psychological position at the time of her disappearance, and the relatively clear division of opinion between a few sharply-delineated and plausible theories. After rehashing this information, however, MMM really started to wander off the path. It obsessed over inconsequential details (the rag in the tailpipe), swung between (conflicting, unsubstantiated, and sometimes offensive) portrayals of Maura, invited on psychics and crackpot conspiracy theorists, developed a smug and passive-aggressive mien towards those who criticised these developments, and found itself stranded in tall, tall corn pursuing weird theories about some kind of multi-layered police cover-up. At points it threatened to come out the other side and become interesting as an exercise in voyeurism, but mostly it remained weird and boring.&lt;/p&gt;\n\n&lt;p&gt;Those guys have a new podcast out now, concerning the Brianna Maitland disappearance (&amp;quot;Crawlspace&amp;quot;). At this point they&amp;#39;ve set the scene and exhausted the three useful and interesting informants they have available, piecing together a convincing outline of what happened to Brianna though not identifying specific suspects. So in six months time, episode 46 will feature a guy with a blog holding forth about how Brianna was a traumatized victim of Pizzagate disappeared by DNC operatives whilst Tim and Lance say &amp;#39;mmm&amp;#39; and &amp;#39;interesting!&amp;#39; thoughtfully.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg86iy0", "score_hidden": false, "stickied": false, "created": 1492144490.0, "created_utc": 1492115690.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": "", "user_reports": [], "id": "dg9wpaf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SuicideBonger", "parent_id": "t1_dg9vag9", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9wpaf", "score_hidden": false, "stickied": false, "created": 1492240076.0, "created_utc": 1492211276.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9vag9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "historicalblindness", "parent_id": "t3_64v02z", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Try mine, Historical Blindness. I cover historical mysteries and post on here sometimes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try mine, Historical Blindness. I cover historical mysteries and post on here sometimes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9vag9", "score_hidden": false, "stickied": false, "created": 1492238176.0, "created_utc": 1492209376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": "", "user_reports": [], "id": "dg5a6aq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SuicideBonger", "parent_id": "t1_dg59t86", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg5a6aq", "score_hidden": false, "stickied": false, "created": 1491990199.0, "created_utc": 1491961399.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg59t86", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Minerva8918", "parent_id": "t3_64v02z", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "* In the Dark\n\n* The Accused \n\n* Someone Knows Something (both seasons)\n\n* Who Killed Alberta Williams\n\n* Finding Tammy Jo\n\n* Real Crime Profile\n\n* Undisclosed Podcast (season 1 is about Adnan Syed; season 2 is about Joey Watkins - highly recommend!)\n\n* Bowraville Murders\n\n* Who Took Vishal \n\nLots of good suggestions in the many threads related to podcasts. I'm sure you'll find something you enjoy!", "edited": 1491963986.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;In the Dark&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The Accused &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Someone Knows Something (both seasons)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Who Killed Alberta Williams&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Finding Tammy Jo&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Real Crime Profile&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Undisclosed Podcast (season 1 is about Adnan Syed; season 2 is about Joey Watkins - highly recommend!)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Bowraville Murders&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Who Took Vishal &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Lots of good suggestions in the many threads related to podcasts. I&amp;#39;m sure you&amp;#39;ll find something you enjoy!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg59t86", "score_hidden": false, "stickied": false, "created": 1491989724.0, "created_utc": 1491960924.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": "", "user_reports": [], "id": "dg5p569", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "neuroshiii", "parent_id": "t3_64v02z", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thinking Sideways is great!  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thinking Sideways is great!  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg5p569", "score_hidden": false, "stickied": false, "created": 1492021146.0, "created_utc": 1491992346.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": "", "user_reports": [], "id": "dg7n8mb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Narwhal79", "parent_id": "t3_64v02z", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I like Generation Why", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like Generation Why&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg7n8mb", "score_hidden": false, "stickied": false, "created": 1492123717.0, "created_utc": 1492094917.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_64v02z", "likes": null, "replies": "", "user_reports": [], "id": "dg63nat", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ufo8152", "parent_id": "t3_64v02z", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": " Jackson Baly Spooks America", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jackson Baly Spooks America&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg63nat", "score_hidden": false, "stickied": false, "created": 1492042858.0, "created_utc": 1492014058.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]