[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "UnresolvedMysteries", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Elaine Johnson &amp;quot;Lonnie&amp;quot; was 41 when she disappeared. She was last seen at her apartment in Parma, Ohio on November 30th 1990. Police say Elaine’s boyfriend Brian was the last person to see her, but he has given two different accounts of the story over the years. In the first account he said he saw her for 40 minutes on the 29th November (a Thursday) and left around 8.30pm. In the second account he says he stayed overnight and left the next morning. When he left her apartment and made his way downstairs he claims he saw a note on the intercom for her, so went back up to take it to her. He found her in the laundry room on her floor. It is not clear what happened next, but some think they may have argued. &lt;/p&gt;\n\n&lt;p&gt;An article from &lt;a href=\"http://crimefeed.com/2016/11/daughter-begs-for-answers-still-searching-nearly-26-years-later-for-her-missing-mom/\"&gt;Crimefeed.com&lt;/a&gt; states that &amp;quot;The Sun News looked into the case and spoke with Elaine’s daughter, Jodi Johnson Malcolm, who told police she went to her mother’s home on December 3, 1990, to check on her after she hadn’t shown up to work for 48 hours. Her mother was missing, but the apartment was tidy, and her wallet, identification, and credit cards, were all left behind. Elaine’s car was in the parking lot. There was laundry in the laundry room, and a locker had been left open. The only thing that seemed to be missing was the actual key to her apartment. As authorities attempted to figure out what happened to Elaine, The Sun Times reveals the last person who may have allegedly seen her was her ex-boyfriend. In a 2011 report, he is identified as 56-year-old Brian Sachs. Although he was questioned at the time, the publication says at some point he stopped cooperating with authorities. Sachs has not been charged with any crime related to this case.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Here is the &lt;a href=\"https://www.facebook.com/FindElaineBenichJohnson/\"&gt;Facebook page for Elaine&lt;/a&gt; that Jodi keeps active. Recently it was posted that there had been &lt;a href=\"https://m.facebook.com/notes/missing-person-elaine-benich-johnson/notes-left-behind/1335805616459138/\"&gt;notes&lt;/a&gt; left behind on a pad in Elaine&amp;#39;s handwriting in her apartment. It is not fully understood what the notes mean, but it could be an indication of Elaine&amp;#39;s state of mind leading up to her disappearance. Police didn’t interpret the notes as a suicide letter as it looked as though she was simply venting her feelings, although on one page in drunken scrawl it says “bye” and “see you later.” Elaine went through periods of drinking and you can see how her handwriting goes from neat to rushed in the notes. An interpretation of the notes by Elaine’s sister in-law can be found &lt;a href=\"http://imgur.com/yBc9RCn\"&gt;here&lt;/a&gt; &lt;a href=\"http://imgur.com/V2n7J0J\"&gt;here&lt;/a&gt; and &lt;a href=\"http://imgur.com/rBbSt6S\"&gt;here.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;One of the notes says, &amp;quot;in private to the one that ordained this miasma. He loves me. He loves me not. but I am that ambivalent, too. So I don&amp;#39;t blame (crossed out word) circumstances. I ordinarily blame me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Elaine had been to pick up her pay check from work on the Thursday and had told a colleague that if she wasn’t heard from in the next few days that she would be dead. The co-worker stated that Elaine was upset and shaky. &lt;a href=\"http://imgur.com/hdHXSye\"&gt;This&lt;/a&gt; &lt;a href=\"http://imgur.com/QT0Ir7J\"&gt;here&lt;/a&gt; and &lt;a href=\"http://imgur.com/4Utb21L\"&gt;here&lt;/a&gt; had been typed up by Elaine’s sister Geraldine after Elaine disappeared and was kept as a record while memories were fresh in their minds.&lt;/p&gt;\n\n&lt;p&gt;There were phone numbers written down too, one of which was for the local mental health and substance abuse service. The &lt;a href=\"http://www.charleyproject.org/cases/j/johnson_elaine.html\"&gt;CharleyProject&lt;/a&gt; page states that she did have depression. An &lt;a href=\"https://www.facebook.com/notes/missing-person-elaine-benich-johnson/1995-parma-sun-post-article/567789013260806\"&gt;article written in 1995 by the Palma Sun Post&lt;/a&gt; says that she called Southwest General Medical Centre 4 or 5 times in the hours before she disappeared. &lt;/p&gt;\n\n&lt;p&gt;One article of interest from &lt;a href=\"http://www.onntv.com/content/stories/2011/...-cold-case.html\"&gt;onntv.com&lt;/a&gt; has since been deleted. Luckily, I was able to find a copied and pasted version on a &lt;a href=\"http://z10.invisionfree.com/usedtobedoe/index.php?showtopic=32087\"&gt;forum.&lt;/a&gt;\nPlease take no notice of the mix up in Jodi&amp;#39;s name (there is no Judy).&lt;/p&gt;\n\n&lt;p&gt;NE Ohio Police Reopen Cold Case\nFriday November 18, 2011 9:38 PM\nUPDATED: Friday November 18, 2011 9:41 PM\nPARMA, Ohio - No one has seen or heard from Elaine Johnson, 41, since November 30 1990.&lt;br/&gt;\nBut now, police said that there are several reasons they are talking about the 21-year-old cold case on Friday.\nApparently, the case was never closed. The last time this case was talked about in the media was 1995 and technology used to find missing people has changed drastically.\nThe police department has gathered DNA from family members and put Johnson&amp;#39;s dental records into a national database in case a body is ever found.\nAlso, the only person of interest won&amp;#39;t talk to police or take a lie detector test\nOn Friday, pictures were scattered across Judy Malcolm&amp;#39;s kitchen table filled her with sadness.\nThey are of a mother Malcolm hasn&amp;#39;t seen for 21 years and a grandmother who never got to know her grandkids Jessica and Jordan.\n&amp;quot;I&amp;#39;ll never know what she could have done with her life,&amp;quot; said Malcolm. &amp;quot;I&amp;#39;ll never know what she looks like now. She&amp;#39;s not going to get to see Jessica get married or have kids. What I see is all the years lost.&amp;quot;\nJohnson went missing at the age Malcolm is now.\nMalcolm reported her missing December 3, 1990, ONN&amp;#39;s Cristin Severance reported.\n&amp;quot;Her shoes were there, her coat was there and her clothing was there,&amp;quot; said Capt. DeSimone, Parma Police Department.\nPolice said that her ex-boyfriend, Brian Sachs, last saw her in her apartment buildings laundry room.\nNow years later, police said that Sachs story and details about that night keep changing.\n&amp;quot;He was offered to take a polygraph test here but he has refused,&amp;quot; DeSimone said. &amp;quot;He refused to sign a statement and then he refused to cooperate with this investigation.&amp;quot;\n&lt;strong&gt;Police said that there is tone part of the case that is troubling. There&amp;#39;s only one way out of that laundry room.\n&amp;quot;So somehow, mysteriously, Elaine left,&amp;quot; DeSimone said. &amp;quot;The only avenue out of the room without anybody being carried out of the apartment or anything would be the rubbish shoot which then goes to the trash compacter.&amp;quot;&lt;/strong&gt;\nPolice do said that days had passed between when Johnson was last seen and when she was reported missing.\nPolice said that the trash was compacted and there was no foul play suspected, so the room or trash shoot was never treated as a crime scene.\n&amp;quot;I need him to come forward with anything he knows,&amp;quot; Malcolm said.\nJohnson&amp;#39;s family is convinced that she&amp;#39;s gone forever and they just want to say goodbye.\n&amp;quot;You&amp;#39;d think I wouldn&amp;#39;t be this upset 21 years later, but this is why I need closure,&amp;quot; Malcolm said. &amp;quot;It&amp;#39;s hard to live with. Having a funeral is a way of saying goodbye and I never got that chance.&amp;quot;\nSachs did not return ONN&amp;#39;s request for comment.\nIf you know any information on this cold case you are asked to call the Parma Police Department. \n-End of article.&lt;/p&gt;\n\n&lt;p&gt;There was a video a few years ago of news reporters going to Brian’s house and he was refusing to speak to them. I am unable to find the video, I believe it was deleted along with the ONN.COM article.&lt;/p&gt;\n\n&lt;p&gt;The timeline and two different accounts of the story that Brian Sachs gave of the last time he saw Elaine can be found &lt;a href=\"https://www.facebook.com/notes/missing-person-elaine-benich-johnson/twelve-day-window-november-and-december-1990/1022877554418614\"&gt;here.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;On the Facebook page it states:&lt;/p&gt;\n\n&lt;p&gt;Thursday 29th November 1990\n&amp;quot;One account: Elaine&amp;#39;s boyfriend visited her in her apartment. (Over the years he has given at least two accounts. In one, he came over that night for about 40 minutes and then left at about 8.30pm).&lt;/p&gt;\n\n&lt;p&gt;Friday 30th November 1990 \nIn another account Elaine&amp;#39;s boyfriend said he stayed overnight and left in the morning. He reported that when he passed the first floor lobby, he saw a note that had been left for her on the intercom, and so went back upstairs to take it to her, and saw her in the laundry room on her floor. (The note was never located). The boyfriend later said that between 3pm-6pm he called the Palma police department to say Elaine was not answering her phone, and that she had been acting weird, and that she might be in danger. (The police have no record of this phone call).&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Some other facts:&lt;/p&gt;\n\n&lt;p&gt;1) There was a wooded area behind the apartments where Elaine lived which were searched after her disappearance by sniffer dogs and police but nothing was found. &lt;/p&gt;\n\n&lt;p&gt;2) Elaine&amp;#39;s boyfriend Brian DID take a polygraph but he passed it. He was later asked to take another polygraph but refused, which is what the deleted ONN.COM above article is referring to.&lt;/p&gt;\n\n&lt;p&gt;3) The police have and still suspect Brian as being involved but without a body or evidence there is a dead end. &lt;/p&gt;\n\n&lt;p&gt;4) She had been previously married to a man called Roger but he was cleared by police, as he was in living in Texas at the time. There doesn’t seem to be any other suspects in the case. Elaine refers to a man named “Bob” in her notes. Bob had passed away in the January of 1989.&lt;/p&gt;\n\n&lt;p&gt;5) Leading up to the disappearance Elaine had said she hadn&amp;#39;t been feeling well and thought she might have cancer (she didn’t) so when she initially went missing the family thought that is what had happened, until no one was able to locate her.&lt;/p&gt;\n\n&lt;p&gt;7) The last time Jodi saw her mum was on Thanksgiving 22nd Nov. They had an argument but they spoke on the phone later that night. Elaine was drunk and not making very much sense. She told Jodi that she was going to marry Brian in the coming February (even though they had only been dating for a few weeks). Elaine had previously told Jodi that she didn’t want her to meet Brian because she didn’t think Jodi would like him. Jodi did eventually meet Brian but not until the night Jodi reported her mom missing.  &lt;/p&gt;\n\n&lt;p&gt;Given everything you know so far, what do you think happened to Elaine? Why would she leave her laundry half finished and vanish like she did if she had planned her own disappearance or suicide? Family members say she was a bit of a perfectionist and this was uncharacteristic of her. Does Brian Sachs know more than he is saying? &lt;/p&gt;\n\n&lt;p&gt;Thoughts:&lt;/p&gt;\n\n&lt;p&gt;Brian himself said that the last place he saw Elaine was in the laundry room, and as the police saw that the washing had been left there it is thought that she had willingly gone with him on spare of the moment in his car or that she was forced to go. The buck really does stop with Brian.&lt;/p&gt;\n\n&lt;p&gt;If Brian is concerned enough to be calling the police he would be concerned enough to know WHEN he was calling the police. &amp;quot;Between 3pm-6pm&amp;quot; is a long time. You would think he would be able to tell specifically the time he called even if it was within an hour, but not between three hours. Also, why call the police right away after she wasn&amp;#39;t answering her phone, for all he knew she might have just gone out. Why panic unless you KNOW there is a problem. If he thought she was suicidal why not say that to police instead of just that she thought she was in danger? In danger from whom? You would think that had she chosen to commit suicide that her body would have been found by now. It is like someone has deliberately hidden her.&lt;/p&gt;\n\n&lt;p&gt;Why did she kick him out of her apartment that morning? What was written on the note found on the intercom? What did they argue about in the laundry room?&lt;/p&gt;\n\n&lt;p&gt;Is there anywhere else you can think she could have gone, or been taken to? Theories welcome! Thanks for reading. Please be sensitive in your replies :)&lt;/p&gt;\n\n&lt;p&gt;Links:&lt;/p&gt;\n\n&lt;p&gt;Original newspaper cuttings that have been saved &lt;a href=\"http://imgur.com/Pr5jE8Q\"&gt;here&lt;/a&gt; and &lt;a href=\"http://imgur.com/CuXn5Jh\"&gt;here.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Apartment buildings where Elaine lived at &lt;a href=\"https://www.forrent.com/apartment-community-profile/1001444\"&gt;5934 Stumph Road, Kimberly Park.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Elaine is #1304 on the &lt;a href=\"https://www.findthemissing.org/en/cases/1304/5/\"&gt;NamUS&lt;/a&gt; database.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.facebook.com/FindElaineBenichJohnson/posts/1025518760821160\"&gt;Police report&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;She worked at &lt;a href=\"http://www.tri-c.edu/campuses-and-locations/unified-technologies-center/index.html\"&gt;Tri-C Unified Technology Centre&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;There is the &lt;a href=\"http://www.websleuths.com/forums/showthread.php?155159-OH-Elaine-Benich-Johnson-41-Parma-22-Nov-1990\"&gt;Websleuths page&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Elaine Johnson \"Lonnie\" was 41 when she disappeared. She was last seen at her apartment in Parma, Ohio on November 30th 1990. Police say Elaine’s boyfriend Brian was the last person to see her, but he has given two different accounts of the story over the years. In the first account he said he saw her for 40 minutes on the 29th November (a Thursday) and left around 8.30pm. In the second account he says he stayed overnight and left the next morning. When he left her apartment and made his way downstairs he claims he saw a note on the intercom for her, so went back up to take it to her. He found her in the laundry room on her floor. It is not clear what happened next, but some think they may have argued. \n\n\nAn article from [Crimefeed.com](http://crimefeed.com/2016/11/daughter-begs-for-answers-still-searching-nearly-26-years-later-for-her-missing-mom/) states that \"The Sun News looked into the case and spoke with Elaine’s daughter, Jodi Johnson Malcolm, who told police she went to her mother’s home on December 3, 1990, to check on her after she hadn’t shown up to work for 48 hours. Her mother was missing, but the apartment was tidy, and her wallet, identification, and credit cards, were all left behind. Elaine’s car was in the parking lot. There was laundry in the laundry room, and a locker had been left open. The only thing that seemed to be missing was the actual key to her apartment. As authorities attempted to figure out what happened to Elaine, The Sun Times reveals the last person who may have allegedly seen her was her ex-boyfriend. In a 2011 report, he is identified as 56-year-old Brian Sachs. Although he was questioned at the time, the publication says at some point he stopped cooperating with authorities. Sachs has not been charged with any crime related to this case.\"\n\n\nHere is the [Facebook page for Elaine](https://www.facebook.com/FindElaineBenichJohnson/) that Jodi keeps active. Recently it was posted that there had been [notes] (https://m.facebook.com/notes/missing-person-elaine-benich-johnson/notes-left-behind/1335805616459138/) left behind on a pad in Elaine's handwriting in her apartment. It is not fully understood what the notes mean, but it could be an indication of Elaine's state of mind leading up to her disappearance. Police didn’t interpret the notes as a suicide letter as it looked as though she was simply venting her feelings, although on one page in drunken scrawl it says “bye” and “see you later.” Elaine went through periods of drinking and you can see how her handwriting goes from neat to rushed in the notes. An interpretation of the notes by Elaine’s sister in-law can be found [here](http://imgur.com/yBc9RCn) [here](http://imgur.com/V2n7J0J) and [here.](http://imgur.com/rBbSt6S)\n\n\nOne of the notes says, \"in private to the one that ordained this miasma. He loves me. He loves me not. but I am that ambivalent, too. So I don't blame (crossed out word) circumstances. I ordinarily blame me.\"\n\n\nElaine had been to pick up her pay check from work on the Thursday and had told a colleague that if she wasn’t heard from in the next few days that she would be dead. The co-worker stated that Elaine was upset and shaky. [This](http://imgur.com/hdHXSye) [here](http://imgur.com/QT0Ir7J) and [here](http://imgur.com/4Utb21L) had been typed up by Elaine’s sister Geraldine after Elaine disappeared and was kept as a record while memories were fresh in their minds.\n\n\n\nThere were phone numbers written down too, one of which was for the local mental health and substance abuse service. The [CharleyProject](http://www.charleyproject.org/cases/j/johnson_elaine.html) page states that she did have depression. An [article written in 1995 by the Palma Sun Post] (https://www.facebook.com/notes/missing-person-elaine-benich-johnson/1995-parma-sun-post-article/567789013260806) says that she called Southwest General Medical Centre 4 or 5 times in the hours before she disappeared. \n\n\nOne article of interest from [onntv.com] (http://www.onntv.com/content/stories/2011/...-cold-case.html) has since been deleted. Luckily, I was able to find a copied and pasted version on a [forum.] (http://z10.invisionfree.com/usedtobedoe/index.php?showtopic=32087)\nPlease take no notice of the mix up in Jodi's name (there is no Judy).\n\n\nNE Ohio Police Reopen Cold Case\nFriday November 18, 2011 9:38 PM\nUPDATED: Friday November 18, 2011 9:41 PM\nPARMA, Ohio - No one has seen or heard from Elaine Johnson, 41, since November 30 1990.  \nBut now, police said that there are several reasons they are talking about the 21-year-old cold case on Friday.\nApparently, the case was never closed. The last time this case was talked about in the media was 1995 and technology used to find missing people has changed drastically.\nThe police department has gathered DNA from family members and put Johnson's dental records into a national database in case a body is ever found.\nAlso, the only person of interest won't talk to police or take a lie detector test\nOn Friday, pictures were scattered across Judy Malcolm's kitchen table filled her with sadness.\nThey are of a mother Malcolm hasn't seen for 21 years and a grandmother who never got to know her grandkids Jessica and Jordan.\n\"I'll never know what she could have done with her life,\" said Malcolm. \"I'll never know what she looks like now. She's not going to get to see Jessica get married or have kids. What I see is all the years lost.\"\nJohnson went missing at the age Malcolm is now.\nMalcolm reported her missing December 3, 1990, ONN's Cristin Severance reported.\n\"Her shoes were there, her coat was there and her clothing was there,\" said Capt. DeSimone, Parma Police Department.\nPolice said that her ex-boyfriend, Brian Sachs, last saw her in her apartment buildings laundry room.\nNow years later, police said that Sachs story and details about that night keep changing.\n\"He was offered to take a polygraph test here but he has refused,\" DeSimone said. \"He refused to sign a statement and then he refused to cooperate with this investigation.\"\n**Police said that there is tone part of the case that is troubling. There's only one way out of that laundry room.\n\"So somehow, mysteriously, Elaine left,\" DeSimone said. \"The only avenue out of the room without anybody being carried out of the apartment or anything would be the rubbish shoot which then goes to the trash compacter.\"**\nPolice do said that days had passed between when Johnson was last seen and when she was reported missing.\nPolice said that the trash was compacted and there was no foul play suspected, so the room or trash shoot was never treated as a crime scene.\n\"I need him to come forward with anything he knows,\" Malcolm said.\nJohnson's family is convinced that she's gone forever and they just want to say goodbye.\n\"You'd think I wouldn't be this upset 21 years later, but this is why I need closure,\" Malcolm said. \"It's hard to live with. Having a funeral is a way of saying goodbye and I never got that chance.\"\nSachs did not return ONN's request for comment.\nIf you know any information on this cold case you are asked to call the Parma Police Department. \n-End of article.\n\n\nThere was a video a few years ago of news reporters going to Brian’s house and he was refusing to speak to them. I am unable to find the video, I believe it was deleted along with the ONN.COM article.\n\n\nThe timeline and two different accounts of the story that Brian Sachs gave of the last time he saw Elaine can be found [here.] (https://www.facebook.com/notes/missing-person-elaine-benich-johnson/twelve-day-window-november-and-december-1990/1022877554418614)\n\n\n\nOn the Facebook page it states:\n\n\nThursday 29th November 1990\n\"One account: Elaine's boyfriend visited her in her apartment. (Over the years he has given at least two accounts. In one, he came over that night for about 40 minutes and then left at about 8.30pm).\n\n\nFriday 30th November 1990 \nIn another account Elaine's boyfriend said he stayed overnight and left in the morning. He reported that when he passed the first floor lobby, he saw a note that had been left for her on the intercom, and so went back upstairs to take it to her, and saw her in the laundry room on her floor. (The note was never located). The boyfriend later said that between 3pm-6pm he called the Palma police department to say Elaine was not answering her phone, and that she had been acting weird, and that she might be in danger. (The police have no record of this phone call).\"\n\n\nSome other facts:\n\n1) There was a wooded area behind the apartments where Elaine lived which were searched after her disappearance by sniffer dogs and police but nothing was found. \n\n\n2) Elaine's boyfriend Brian DID take a polygraph but he passed it. He was later asked to take another polygraph but refused, which is what the deleted ONN.COM above article is referring to.\n\n\n3) The police have and still suspect Brian as being involved but without a body or evidence there is a dead end. \n\n\n4) She had been previously married to a man called Roger but he was cleared by police, as he was in living in Texas at the time. There doesn’t seem to be any other suspects in the case. Elaine refers to a man named “Bob” in her notes. Bob had passed away in the January of 1989.\n\n\n5) Leading up to the disappearance Elaine had said she hadn't been feeling well and thought she might have cancer (she didn’t) so when she initially went missing the family thought that is what had happened, until no one was able to locate her.\n\n\n7) The last time Jodi saw her mum was on Thanksgiving 22nd Nov. They had an argument but they spoke on the phone later that night. Elaine was drunk and not making very much sense. She told Jodi that she was going to marry Brian in the coming February (even though they had only been dating for a few weeks). Elaine had previously told Jodi that she didn’t want her to meet Brian because she didn’t think Jodi would like him. Jodi did eventually meet Brian but not until the night Jodi reported her mom missing.  \n\n\nGiven everything you know so far, what do you think happened to Elaine? Why would she leave her laundry half finished and vanish like she did if she had planned her own disappearance or suicide? Family members say she was a bit of a perfectionist and this was uncharacteristic of her. Does Brian Sachs know more than he is saying? \n\n\n\nThoughts:\n\n\nBrian himself said that the last place he saw Elaine was in the laundry room, and as the police saw that the washing had been left there it is thought that she had willingly gone with him on spare of the moment in his car or that she was forced to go. The buck really does stop with Brian.\n\n\nIf Brian is concerned enough to be calling the police he would be concerned enough to know WHEN he was calling the police. \"Between 3pm-6pm\" is a long time. You would think he would be able to tell specifically the time he called even if it was within an hour, but not between three hours. Also, why call the police right away after she wasn't answering her phone, for all he knew she might have just gone out. Why panic unless you KNOW there is a problem. If he thought she was suicidal why not say that to police instead of just that she thought she was in danger? In danger from whom? You would think that had she chosen to commit suicide that her body would have been found by now. It is like someone has deliberately hidden her.\n\n\nWhy did she kick him out of her apartment that morning? What was written on the note found on the intercom? What did they argue about in the laundry room?\n\n\nIs there anywhere else you can think she could have gone, or been taken to? Theories welcome! Thanks for reading. Please be sensitive in your replies :)\n\n\nLinks:\n\nOriginal newspaper cuttings that have been saved [here](http://imgur.com/Pr5jE8Q) and [here.](http://imgur.com/CuXn5Jh)\n\n\nApartment buildings where Elaine lived at [5934 Stumph Road, Kimberly Park.](https://www.forrent.com/apartment-community-profile/1001444)\n\n\nElaine is #1304 on the [NamUS](https://www.findthemissing.org/en/cases/1304/5/) database.\n\n\n[Police report](https://www.facebook.com/FindElaineBenichJohnson/posts/1025518760821160)\n\n\nShe worked at [Tri-C Unified Technology Centre](http://www.tri-c.edu/campuses-and-locations/unified-technologies-center/index.html)\n\n\nThere is the [Websleuths page](http://www.websleuths.com/forums/showthread.php?155159-OH-Elaine-Benich-Johnson-41-Parma-22-Nov-1990)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "654hf3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 40, "report_reasons": null, "author": "rachelchocolate", "saved": false, "mod_reports": [], "name": "t3_654hf3", "subreddit_name_prefixed": "r/UnresolvedMysteries", "approved_by": null, "over_18": false, "domain": "self.UnresolvedMysteries", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2wvvc", "edited": 1492084418.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/UnresolvedMysteries/comments/654hf3/unsolved_disappearance_case_elaine_benich_johnson/", "num_reports": null, "locked": false, "stickied": false, "created": 1492105306.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/654hf3/unsolved_disappearance_case_elaine_benich_johnson/", "author_flair_text": null, "quarantine": false, "title": "Unsolved Disappearance Case: Elaine Benich Johnson, missing for 26 years. Murder or Suicide?", "created_utc": 1492076506.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 40}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_654hf3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_654hf3", "likes": null, "replies": "", "user_reports": [], "id": "dg7eyhz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "rachelchocolate", "parent_id": "t1_dg7ev4k", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thank you. I believe there were books on chemotherapy found in the apartment but it's a possibility that she was going through menopause at the time and had mistaken her symptoms. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I believe there were books on chemotherapy found in the apartment but it&amp;#39;s a possibility that she was going through menopause at the time and had mistaken her symptoms. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg7eyhz", "score_hidden": false, "stickied": false, "created": 1492111239.0, "created_utc": 1492082439.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_654hf3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_654hf3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_654hf3", "likes": null, "replies": "", "user_reports": [], "id": "dgccym6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RudineHoward", "parent_id": "t1_dgaurdp", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "yes, it's also not uncommon either to [become hypocondriac](https://www.google.com.br/search?q=hypocondriac+when+the+alcoholic+tries+to+be+sober&amp;rlz=1C1PRFB_enBR703BR704&amp;oq=hypocondriac+when+the+alcoholic+tries+to+be+sober&amp;aqs=chrome..69i57&amp;sourceid=chrome&amp;ie=UTF-8#q=hypochondriac+when+the+alcoholic+tries+to+be+sober+site:www.soberrecovery.com) when an alcoholic tries to be sober. It's related to anxiety, the fear and belief that the person has a severe illness like cancer is real, some people spend a lot of money going to several doctors and never believe that there is nothing wrong. \n\nThanks for your comment and I'm really sorry about your relative, my mother is an alcoholic and I know how awful it is :( ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yes, it&amp;#39;s also not uncommon either to &lt;a href=\"https://www.google.com.br/search?q=hypocondriac+when+the+alcoholic+tries+to+be+sober&amp;amp;rlz=1C1PRFB_enBR703BR704&amp;amp;oq=hypocondriac+when+the+alcoholic+tries+to+be+sober&amp;amp;aqs=chrome..69i57&amp;amp;sourceid=chrome&amp;amp;ie=UTF-8#q=hypochondriac+when+the+alcoholic+tries+to+be+sober+site:www.soberrecovery.com\"&gt;become hypocondriac&lt;/a&gt; when an alcoholic tries to be sober. It&amp;#39;s related to anxiety, the fear and belief that the person has a severe illness like cancer is real, some people spend a lot of money going to several doctors and never believe that there is nothing wrong. &lt;/p&gt;\n\n&lt;p&gt;Thanks for your comment and I&amp;#39;m really sorry about your relative, my mother is an alcoholic and I know how awful it is :( &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgccym6", "score_hidden": false, "stickied": false, "created": 1492395354.0, "created_utc": 1492366554.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaurdp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "joeythenaiveone", "parent_id": "t1_dg8lxl0", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "A close relative of mine is a severe alcoholic and has gone through bouts of hypochondria, including telling family members she thought she probably had cancer (while refusing to go to a doctor to confirm - she was fine). I've always thought it was her way of channeling her stress about the long-term health consequences of her alcoholism into something that was out of her control. People are more willing to lend a sympathetic ear to cancer concerns than an alcoholic worrying about liver failure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A close relative of mine is a severe alcoholic and has gone through bouts of hypochondria, including telling family members she thought she probably had cancer (while refusing to go to a doctor to confirm - she was fine). I&amp;#39;ve always thought it was her way of channeling her stress about the long-term health consequences of her alcoholism into something that was out of her control. People are more willing to lend a sympathetic ear to cancer concerns than an alcoholic worrying about liver failure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgaurdp", "score_hidden": false, "stickied": false, "created": 1492303435.0, "created_utc": 1492274635.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8lxl0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "RudineHoward", "parent_id": "t1_dg7ev4k", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "maybe she was suffering from [hypochondriasis] (https://en.wikipedia.org/wiki/Hypochondriasis) triggered by depression, anxiety or bipolar disorder. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;maybe she was suffering from &lt;a href=\"https://en.wikipedia.org/wiki/Hypochondriasis\"&gt;hypochondriasis&lt;/a&gt; triggered by depression, anxiety or bipolar disorder. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8lxl0", "score_hidden": false, "stickied": false, "created": 1492164687.0, "created_utc": 1492135887.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ev4k", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "loveagreatmystery", "parent_id": "t3_654hf3", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Excellent write up!\n\nI am curious about Elaine saying she did not feel well and thought she had cancer. What were her symptoms? Was she diagnosed with anything?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent write up!&lt;/p&gt;\n\n&lt;p&gt;I am curious about Elaine saying she did not feel well and thought she had cancer. What were her symptoms? Was she diagnosed with anything?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg7ev4k", "score_hidden": false, "stickied": false, "created": 1492111012.0, "created_utc": 1492082212.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_654hf3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_654hf3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_654hf3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_654hf3", "likes": null, "replies": "", "user_reports": [], "id": "dg9e04b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fakedaisies", "parent_id": "t1_dg8jzys", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "What a shame. Seems to happen in a lot of missing persons cases unfortunately, esp the older cold ones - police assumed no foul play until too many days had passed and the scene was contaminated. A lot of PDs now say they treat most dead body and MP calls as crime scenes first and rule that out before concluding suicide or voluntary missing for just this reason. I think too many jurisdictions still don't, though, and a lot of victims and their loved ones suffer for the oversight and/or incompetence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a shame. Seems to happen in a lot of missing persons cases unfortunately, esp the older cold ones - police assumed no foul play until too many days had passed and the scene was contaminated. A lot of PDs now say they treat most dead body and MP calls as crime scenes first and rule that out before concluding suicide or voluntary missing for just this reason. I think too many jurisdictions still don&amp;#39;t, though, and a lot of victims and their loved ones suffer for the oversight and/or incompetence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9e04b", "score_hidden": false, "stickied": false, "created": 1492217172.0, "created_utc": 1492188372.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8jzys", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "rachelchocolate", "parent_id": "t1_dg8gt8s", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I believe it was with the change in investigator from Detective William Hennessey mentioned in the 1995 article to Captain Robert DeSimone who took over the case that the new theory of the shoot/compactor has emerged. Jodi did know about the laundry room and states early on that she thought something had happened to her mom mid-way through doing laundry but detectives at the time thought Elaine had taken off and this is why the apartments were never treated as a crime scene. It seems like police oversight. This is how I understand it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe it was with the change in investigator from Detective William Hennessey mentioned in the 1995 article to Captain Robert DeSimone who took over the case that the new theory of the shoot/compactor has emerged. Jodi did know about the laundry room and states early on that she thought something had happened to her mom mid-way through doing laundry but detectives at the time thought Elaine had taken off and this is why the apartments were never treated as a crime scene. It seems like police oversight. This is how I understand it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8jzys", "score_hidden": false, "stickied": false, "created": 1492161985.0, "created_utc": 1492133185.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8gt8s", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "becausefrog", "parent_id": "t1_dg83t9d", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I'm pretty sure anyone who took a lie detector test and passed it would be strongly advised by their lawyer not to take another one, innocent or guilty.\n\nI am curious about the timeline of the two different accounts, and why the laundry room and trash compacter weren't treated like a crime scene when she had obviously been down there last. Did they not know until too much time had passed about the laundry room because he didn't mention it until a later interview, or did they just leave it because it was several days before she was even reported missing and they thought too many people had probably already been through there?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty sure anyone who took a lie detector test and passed it would be strongly advised by their lawyer not to take another one, innocent or guilty.&lt;/p&gt;\n\n&lt;p&gt;I am curious about the timeline of the two different accounts, and why the laundry room and trash compacter weren&amp;#39;t treated like a crime scene when she had obviously been down there last. Did they not know until too much time had passed about the laundry room because he didn&amp;#39;t mention it until a later interview, or did they just leave it because it was several days before she was even reported missing and they thought too many people had probably already been through there?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8gt8s", "score_hidden": false, "stickied": false, "created": 1492157608.0, "created_utc": 1492128808.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_654hf3", "likes": null, "replies": "", "user_reports": [], "id": "dgd7c8q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pasta4u", "parent_id": "t1_dg83t9d", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "lie detector tests don't work ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lie detector tests don&amp;#39;t work &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgd7c8q", "score_hidden": false, "stickied": false, "created": 1492439000.0, "created_utc": 1492410200.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83t9d", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "raidmytomb", "parent_id": "t3_654hf3", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "This is very interesting. I would like to know why he denied the second lie detector and what his reason was for giving two different accounts... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is very interesting. I would like to know why he denied the second lie detector and what his reason was for giving two different accounts... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg83t9d", "score_hidden": false, "stickied": false, "created": 1492141497.0, "created_utc": 1492112697.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}]