[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "UnresolvedMysteries", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "655ewk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "canesole", "saved": false, "mod_reports": [], "name": "t3_655ewk", "subreddit_name_prefixed": "r/UnresolvedMysteries", "approved_by": null, "over_18": false, "domain": "self.UnresolvedMysteries", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2wvvc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/UnresolvedMysteries/comments/655ewk/are_there_any_cases_that_were_solved_by_a/", "num_reports": null, "locked": false, "stickied": false, "created": 1492118424.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/655ewk/are_there_any_cases_that_were_solved_by_a/", "author_flair_text": null, "quarantine": false, "title": "Are there any cases that were solved by a deathbed confession?", "created_utc": 1492089624.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_655ewk", "likes": null, "replies": "", "user_reports": [], "id": "dg93u9l", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Kbit2", "parent_id": "t3_655ewk", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I believe Ben Needham's disappearance was solved by a death bed confession. https://www.google.com/amp/www.mirror.co.uk/news/world-news/ben-needham-timeline-how-25-9063522.amp", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe Ben Needham&amp;#39;s disappearance was solved by a death bed confession. &lt;a href=\"https://www.google.com/amp/www.mirror.co.uk/news/world-news/ben-needham-timeline-how-25-9063522.amp\"&gt;https://www.google.com/amp/www.mirror.co.uk/news/world-news/ben-needham-timeline-how-25-9063522.amp&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg93u9l", "score_hidden": false, "stickied": false, "created": 1492204267.0, "created_utc": 1492175467.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_655ewk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_655ewk", "likes": null, "replies": "", "user_reports": [], "id": "dgaghru", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "katiegrant0719", "parent_id": "t1_dg9yagv", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "After some investigation, police eventually concluded that Adam was abducted by a drifter named Ottis Toole near the front exterior of the Sears that afternoon, after being instructed to leave by a security guard. He lured Adam into his white 1971 Cadillac with a damaged right bumper with promises of toys and candy, then proceeded to drive north on Interstate 95 toward his home in Jacksonville. Adam, at first docile and compliant, began to panic as they drove on. Toole punched him in the face, but as this just made the situation worse, he then \"walloped him unconscious\". While Adam was knocked out, Toole drove north on the Florida Turnpike to a deserted service road just north of the Radebaugh Road overpass in northwest St. Lucia County (27°32′07″N 80°36′35″W),[11] and raped him for around two hours. When Toole realized Adam was still breathing, he strangled him to death with a seat belt, dragged him out of the car, and decapitated him with a machete. Toole later claimed to have disposed of Adam's body by incinerating it in an old refrigerator when he returned to Jacksonville. He drove around with Adam's severed head in his car for a few days until remembering it was in there, and then threw it into a canal, just north of where he said he killed Adam. He claimed that he wanted to make Adam his adopted son, but given the close relationship he had with loving parents, this was not very feasible. The police ultimately lost the bloodstained carpet from Toole's Cadillac, the machete used to decapitate Adam, and eventually, the car itself. DNA profiling was in a rudimentary state in the early 1980s and it was not possible then to determine the source of the blood found in the Cadillac.[4] Toole, a confidant of convicted serial killer Henry Lee Lucas, repeatedly confessed and then retracted accounts of his involvement.\n\nToole was never charged in the Walsh case, although he provided seemingly accurate descriptions as to how he committed the crime. Several witnesses also placed him in the Hollywood area in the days leading up to Adam's disappearance.[4] In September 1996, he died in prison, aged 49, of cirrhosis while serving a life sentence for other crimes.[7] Afterwards, his niece told John that her uncle made a deathbed confession to the murder of Adam.[7][12] His confession was viewed as reliable,[by whom?] since he and Lucas confessed to or implicated themselves in more than 200 different homicides.[13] However, it was later revealed that most of Lucas's confessions were false, having been coerced by the Texas Rangers.[14]\n\nIn 1997, Hollywood Police Chief Rick Stone conducted an exhaustive review of the Adam Walsh case after the release of John Walsh's book. At the time, Stone was a 22-year veteran of the Dallas, Texas, and Wichita, Kansas, police departments and had been appointed Hollywood's chief of police in the previous year. Although the crime was 16 years old at the time of Chief Stone's review, he provided an analysis of the evidence, including reviewing taped interrogations of Toole by Hollywood Police Detective Mark Smith. Stone says his review found evidence to prove \"beyond a reasonable doubt\" that Toole murdered Adam. Both Toole and his close friend, convicted serial killer Henry Lee Lucas, were notorious, Stone noted, for confessing to crimes they committed and recanting.[15]\n\nIn 2007, allegations earned widespread publicity that Jeffrey Dahmer, arrested in Wisconsin in 1991 after killing more than a dozen men and boys, was also named as a suspect in Adam's murder. He was living in Miami Beach at the time Adam was murdered, and two eyewitnesses placed him at the shopping mall on the day Adam was abducted. One of the witnesses claimed to have seen a strange man walking into the toy department where Adam was abducted. The other said that he saw a young, blond man with a protruding chin throw a struggling child into a blue van and sped off. Both witnesses recognized the man they had seen as Dahmer when pictures of him were released in the newspapers after his arrest. Reports showed that the delivery shop where he worked had a blue van at the time. He preyed on young men and boys (the youngest being eight years older than Adam), and his modus operandi included severing his victims' heads. When interviewed about Adam in the early 1990s, he repeatedly denied involvement in the crime, even stating; \"I've told you everything—how I killed them, how I cooked them, who I ate. Why wouldn't I tell you if I did someone else?\"[16] After this rumor surfaced, John Walsh stated that he had \"seen no evidence\" linking his son's kidnapping and murder to Dahmer.[17]\n\nOn December 16, 2008, Hollywood, Florida, Police Chief Chad Wagner, a friend of John, announced, with him present, that the case was now closed. An external review of the case had been conducted and police announced that they were satisfied that Ottis Toole was the murderer.[4][13][18]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;After some investigation, police eventually concluded that Adam was abducted by a drifter named Ottis Toole near the front exterior of the Sears that afternoon, after being instructed to leave by a security guard. He lured Adam into his white 1971 Cadillac with a damaged right bumper with promises of toys and candy, then proceeded to drive north on Interstate 95 toward his home in Jacksonville. Adam, at first docile and compliant, began to panic as they drove on. Toole punched him in the face, but as this just made the situation worse, he then &amp;quot;walloped him unconscious&amp;quot;. While Adam was knocked out, Toole drove north on the Florida Turnpike to a deserted service road just north of the Radebaugh Road overpass in northwest St. Lucia County (27°32′07″N 80°36′35″W),[11] and raped him for around two hours. When Toole realized Adam was still breathing, he strangled him to death with a seat belt, dragged him out of the car, and decapitated him with a machete. Toole later claimed to have disposed of Adam&amp;#39;s body by incinerating it in an old refrigerator when he returned to Jacksonville. He drove around with Adam&amp;#39;s severed head in his car for a few days until remembering it was in there, and then threw it into a canal, just north of where he said he killed Adam. He claimed that he wanted to make Adam his adopted son, but given the close relationship he had with loving parents, this was not very feasible. The police ultimately lost the bloodstained carpet from Toole&amp;#39;s Cadillac, the machete used to decapitate Adam, and eventually, the car itself. DNA profiling was in a rudimentary state in the early 1980s and it was not possible then to determine the source of the blood found in the Cadillac.[4] Toole, a confidant of convicted serial killer Henry Lee Lucas, repeatedly confessed and then retracted accounts of his involvement.&lt;/p&gt;\n\n&lt;p&gt;Toole was never charged in the Walsh case, although he provided seemingly accurate descriptions as to how he committed the crime. Several witnesses also placed him in the Hollywood area in the days leading up to Adam&amp;#39;s disappearance.[4] In September 1996, he died in prison, aged 49, of cirrhosis while serving a life sentence for other crimes.[7] Afterwards, his niece told John that her uncle made a deathbed confession to the murder of Adam.[7][12] His confession was viewed as reliable,[by whom?] since he and Lucas confessed to or implicated themselves in more than 200 different homicides.[13] However, it was later revealed that most of Lucas&amp;#39;s confessions were false, having been coerced by the Texas Rangers.[14]&lt;/p&gt;\n\n&lt;p&gt;In 1997, Hollywood Police Chief Rick Stone conducted an exhaustive review of the Adam Walsh case after the release of John Walsh&amp;#39;s book. At the time, Stone was a 22-year veteran of the Dallas, Texas, and Wichita, Kansas, police departments and had been appointed Hollywood&amp;#39;s chief of police in the previous year. Although the crime was 16 years old at the time of Chief Stone&amp;#39;s review, he provided an analysis of the evidence, including reviewing taped interrogations of Toole by Hollywood Police Detective Mark Smith. Stone says his review found evidence to prove &amp;quot;beyond a reasonable doubt&amp;quot; that Toole murdered Adam. Both Toole and his close friend, convicted serial killer Henry Lee Lucas, were notorious, Stone noted, for confessing to crimes they committed and recanting.[15]&lt;/p&gt;\n\n&lt;p&gt;In 2007, allegations earned widespread publicity that Jeffrey Dahmer, arrested in Wisconsin in 1991 after killing more than a dozen men and boys, was also named as a suspect in Adam&amp;#39;s murder. He was living in Miami Beach at the time Adam was murdered, and two eyewitnesses placed him at the shopping mall on the day Adam was abducted. One of the witnesses claimed to have seen a strange man walking into the toy department where Adam was abducted. The other said that he saw a young, blond man with a protruding chin throw a struggling child into a blue van and sped off. Both witnesses recognized the man they had seen as Dahmer when pictures of him were released in the newspapers after his arrest. Reports showed that the delivery shop where he worked had a blue van at the time. He preyed on young men and boys (the youngest being eight years older than Adam), and his modus operandi included severing his victims&amp;#39; heads. When interviewed about Adam in the early 1990s, he repeatedly denied involvement in the crime, even stating; &amp;quot;I&amp;#39;ve told you everything—how I killed them, how I cooked them, who I ate. Why wouldn&amp;#39;t I tell you if I did someone else?&amp;quot;[16] After this rumor surfaced, John Walsh stated that he had &amp;quot;seen no evidence&amp;quot; linking his son&amp;#39;s kidnapping and murder to Dahmer.[17]&lt;/p&gt;\n\n&lt;p&gt;On December 16, 2008, Hollywood, Florida, Police Chief Chad Wagner, a friend of John, announced, with him present, that the case was now closed. An external review of the case had been conducted and police announced that they were satisfied that Ottis Toole was the murderer.[4][13][18]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgaghru", "score_hidden": false, "stickied": false, "created": 1492273737.0, "created_utc": 1492244937.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9yagv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JeanHuguesAnglade", "parent_id": "t3_655ewk", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I think the murder of Adam Walsh (son of John Walsh, the presenter of \"America's Most Wanted\" TV show) was finally solved through a deathbed confession by his murderer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the murder of Adam Walsh (son of John Walsh, the presenter of &amp;quot;America&amp;#39;s Most Wanted&amp;quot; TV show) was finally solved through a deathbed confession by his murderer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9yagv", "score_hidden": false, "stickied": false, "created": 1492242165.0, "created_utc": 1492213365.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_655ewk", "likes": null, "replies": "", "user_reports": [], "id": "dgciup3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hith_Ransir", "parent_id": "t3_655ewk", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "The famous loch ness monster picture.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The famous loch ness monster picture.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgciup3", "score_hidden": false, "stickied": false, "created": 1492403108.0, "created_utc": 1492374308.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_655ewk", "likes": null, "replies": "", "user_reports": [], "id": "dg8rkgw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ColdHeartedSleuth", "parent_id": "t3_655ewk", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "http://www.therichest.com/shocking/15-people-who-confessed-to-terrible-crimes-on-their-deathbed/\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.therichest.com/shocking/15-people-who-confessed-to-terrible-crimes-on-their-deathbed/\"&gt;http://www.therichest.com/shocking/15-people-who-confessed-to-terrible-crimes-on-their-deathbed/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8rkgw", "score_hidden": false, "stickied": false, "created": 1492173376.0, "created_utc": 1492144576.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_655ewk", "likes": null, "replies": "", "user_reports": [], "id": "dga11ss", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dwayla", "parent_id": "t3_655ewk", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Margaret Gibson confessed to killing William Desmond Taylor in a deathbed confession...not everybody believes it though? I'm on my phone I can't link sorry:(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Margaret Gibson confessed to killing William Desmond Taylor in a deathbed confession...not everybody believes it though? I&amp;#39;m on my phone I can&amp;#39;t link sorry:(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dga11ss", "score_hidden": false, "stickied": false, "created": 1492245840.0, "created_utc": 1492217040.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]