[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "UnresolvedMysteries", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Here is my &lt;a href=\"https://www.reddit.com/r/UnresolvedMysteries/comments/652bj8/the_odd_circumstances_revolving_around_the_death/\"&gt;last post&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;&lt;strong&gt;Circleville Letters Mystery&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;p&gt;&lt;em&gt;They thought it was over, but the Circleville letters didn’t stop.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Travel approximately 25 miles from Columbus in Ohio and it is quite possible to overlook one of many small towns dotted around America. Situated along the banks of the Scioto River, Circleville is the type of small-town America in which everyone knows everyone else. It is likely to be the kind of place where residents can leave their doors unlocked overnight without fear of recriminations. On the face of it, Circleville does seem like the kind of place that big city citizens might turn to in order ‘to get away from it all’. For a few terrifying weeks during 1976, all of that changed. Someone began a campaign of &lt;em&gt;terror&lt;/em&gt; against the entire town with the Circleville letters.&lt;/p&gt;\n\n&lt;p&gt;The letters contained threats of violence and personal information that, in some cases, only the recipient was aware of. Many of these letters were hatefully written with vulgarisms and lewd artwork. None of the Circleville letters had any return address and all appeared to come from somewhere within Columbus. Every single letter was written in the same distinct style – block-letters – and might have been an attempt to cover up the author’s personal handwriting.&lt;/p&gt;\n\n&lt;h2&gt;&lt;strong&gt;The Circleville Writer Targets Mary and Ron Gillespie&lt;/strong&gt;&lt;/h2&gt;\n\n&lt;p&gt;Even though many of the town’s 14,000 inhabitants were targeted, one woman was seemingly singled out for some severe and/or harsh treatment. Mary Gillespie drove a school bus for a living and was among the initial targets for the volatile author. In addition to revealing disturbing facts, such as her home being under surveillance by the author and that she was a married mother, the letter also contained an allegation that Gillespie was having an affair with a superintendent of schools. In no uncertain terms, the author demanded that she stop and that she was not a subject of a hoax or prank.&lt;/p&gt;\n\n&lt;p&gt;Anyone receiving the Circleville letters would be understandably upset at it. Worse was to follow though. Several additional letters were sent to her, all of a similar nature. At first, the terrified woman just hid them all away and began to keep a discreet and panicked eye on her everyday activities – just in case the unknown stalker made the mistake of being spotted. Gillespie did an admirable job at concealing her terror, until one of the Circleville letters arrived addressed to Ron Gillespie, Mary’s husband. This one was blunt and to the point. Ron was ordered to put an end to the affair or die.&lt;/p&gt;\n\n&lt;h2&gt;&lt;strong&gt;Mary is Accused of an Affair&lt;/strong&gt;&lt;/h2&gt;\n\n&lt;p&gt;Mary first admitted to Ron that she had no clue what the author was referring to and that no affair was taking place. Perhaps this was a failed attempt at blackmail, but the damage to Mary’s reputation had already been done. Just the idea that a mild-mannered woman that would easily blend into a crowd was having an extra-marital affair was enough to get the gossip-mongers talking. Both Ron and Mary Gillespie worked together to try and ignore the threats and intimidation and carry on. Another chilling letter quickly changed that.&lt;/p&gt;\n\n&lt;p&gt;Gillispie, you have had 2 weeks and done nothing. Admit the truth and inform the school board. If not, I will broadcast it on CBS, posters, signs, and billboards, until the truth comes out.&lt;/p&gt;\n\n&lt;p&gt;The couple began to deliberate about who the possible Circleville letter writer could be. Their suspicions centered on Ron’s brother-in-law, Paul Freshour. To test this hypothesis, the Gillespie’s used the rampant panic as a tool and sent Freshour several similarly written letters, outlining that they knew who he was and what he was up to. A request to stop all activities without resorting to any violence was included, and that ploy looked as though it had worked.&lt;/p&gt;\n\n&lt;h2&gt;&lt;strong&gt;Ron Gillespie’s Body is Found&lt;/strong&gt;&lt;/h2&gt;\n\n&lt;p&gt;While the Gillespie’s could not be certain that Freshour was responsible for their torment, they at least considered that it was over.&lt;/p&gt;\n\n&lt;p&gt;August 19th, 1977 began as just another day. Whatever had plagued them before was just a bad memory and things had returned to normal. When the phone rang that day it was treated as just another phone call. Ron answered. Mary never did find out what was said or who made the call, but it was assumed to be the phantom author and he was back with a bang.&lt;/p&gt;\n\n&lt;p&gt;Ron lost his temper, grabbed his pistol and left the house. At an intersection close to where they lived, &lt;em&gt;Ron’s vehicle struck a tree and killed Ron Gillespie.&lt;/em&gt; If the caller was indeed the letter writer, then he or she had clearly carried out on the threat to Ron’s life. When the police investigated the crash, they discovered that Ron’s gun had been fired once. Detectives could find no reason or excuse for Ron to have fired at all whether it was deliberate or not. The crash happened moments after Ron drove away and no shot was reported.&lt;/p&gt;\n\n&lt;p&gt;The crash was ruled to be a genuine accident even though strange facts emerged. &lt;em&gt;A postmortem examination recorded that Ron’s blood-alcohol level was 1.5 times the legal limit.&lt;/em&gt; Those that knew Ron best all confirmed that he was actually teetotal. The Sheriff was once said to have admitted that there was more to the crash than met the eye but later denied those ascertains. And the phantom letter writer began to get in contact with several residents, almost begging for a more thorough investigation to be conducted. It was almost as if the author wasn’t satisfied with the accident conclusion.&lt;/p&gt;\n\n&lt;h2&gt;&lt;strong&gt;The Circleville Writer Tries to Kill Mary&lt;/strong&gt;&lt;/h2&gt;\n\n&lt;p&gt;The Circleville letters began once more in earnest. As well as Mary Gillespie and her immediate family, elected officials were almost targeted. The threats and vulgar nature of the prose was the same as it had been before. The hostility shown to Mary proved to be too much for her to bear any longer. She admitted to the affair taking place, but insisted that it only began after the first of the letters had been delivered. When Freshour was accused of being the Circleville letter writer, he vehemently denied it.&lt;/p&gt;\n\n&lt;p&gt;Despite all of this harassment and the scandal that made her the talk of the town, Mary managed to keep her job. Six years after the campaign had began, whoever was behind this took a bold step in furthering their tactics. While at work, Mary noticed a sign on route that threatened the life of her daughter. Angered by this, she stopped the bus and removed the sign.&lt;/p&gt;\n\n&lt;p&gt;She noticed a box with a string tied to another post. Mary removed the box and returned to the bus in order to open it. Inside was a crude booby trap in the form of a pistol. Thankfully the trap failed to execute at all. Once again she called the police, and they quickly discovered that someone had made a crude attempt to file off the gun’s serial number. Police traced the gun to Freshour who, not for the first time, insisted he knew nothing about the events. Freshour stated that the gun went missing long before.&lt;/p&gt;\n\n&lt;h2&gt;&lt;strong&gt;Freshour Takes Handwriting Test&lt;/strong&gt;&lt;/h2&gt;\n\n&lt;p&gt;The gun was about the only solid lead that the police had available to them at the time. So they coerced Freshour into taking a handwriting test in which he had to copy some of the Circleville letters. Even if experts were able to prove that the handwriting was his, the investigation was criticized for the incorrect manner for administering the handwriting test in the first place. The Sheriff was satisfied that Freshour was the Circleville letter writer – or that the handwriting was close enough at least – and he arrested Freshour for attempted murder.&lt;/p&gt;\n\n&lt;p&gt;The trial began in late October 1983 and even though he had an alibi for the day of the booby-trap attempt on Mary’s life, he was convicted and given a sentence of 25 years in prison with the recommendation that he spent at least 7 years behind bars. Many of Circleville’s residents had already convinced themselves that Freshour was guilty despite the evidence given during the trial. Freshour maintained his innocence until his death in 2012.&lt;/p&gt;\n\n&lt;h2&gt;&lt;em&gt;Letters Continue During Freshour’s Term&lt;/em&gt;*&lt;/h2&gt;\n\n&lt;p&gt;While serving his time, Freshour was considered to be a model prisoner. He rarely got the chance to correspond with the outside world. In the decade that he was incarcerated, the letters carried on regardless. Like before, they were all postmarked Columbus and Freshour was not sentenced to prison anywhere near Columbus. Even the prison wardens doubted that Freshour was guilty of writing the letters. Authorities, on the other hand, were not convinced. They maintained that, somehow, he was responsible for everything the police accused him.&lt;/p&gt;\n\n&lt;p&gt;While he was in prison he even received a mysterious letter that stated: “Now when are you going to believe you aren’t going to get out of there? I told you 2 years ago. When we set ’em up, they stay set up. Don’t you listen at all?” Six months after Freshour’s release, TV show Unsolved Mysteries aired a segment on the Circleville Letters. A few days later, the network got one of their own.&lt;/p&gt;\n\n&lt;p&gt;It simply said: “Forget Circleville, Ohio… if you come to Ohio, you el sickos will pay. The Circleville Writer.”&lt;/p&gt;\n\n&lt;p&gt;TL;DR - Woman receives thousands of threatening letters, residents receive letters too, writer kills man, writer tries killing wife, man is arrested, writer is still loose and writing. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.google.com/url?sa=t&amp;amp;source=web&amp;amp;rct=j&amp;amp;url=http://unsolvedmysteries.wikia.com/wiki/Circleville_Writer&amp;amp;ved=0ahUKEwjc-Z6j_aHTAhUa24MKHav_CxoQFggaMAA&amp;amp;usg=AFQjCNGDC9ErP_AGClmuJJ-YcNO81_1sRw\"&gt;Circleville Writer&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Here is my [last post](https://www.reddit.com/r/UnresolvedMysteries/comments/652bj8/the_odd_circumstances_revolving_around_the_death/)\n\n#**Circleville Letters Mystery**    \n*They thought it was over, but the Circleville letters didn’t stop.*\n\nTravel approximately 25 miles from Columbus in Ohio and it is quite possible to overlook one of many small towns dotted around America. Situated along the banks of the Scioto River, Circleville is the type of small-town America in which everyone knows everyone else. It is likely to be the kind of place where residents can leave their doors unlocked overnight without fear of recriminations. On the face of it, Circleville does seem like the kind of place that big city citizens might turn to in order ‘to get away from it all’. For a few terrifying weeks during 1976, all of that changed. Someone began a campaign of *terror* against the entire town with the Circleville letters.\n\nThe letters contained threats of violence and personal information that, in some cases, only the recipient was aware of. Many of these letters were hatefully written with vulgarisms and lewd artwork. None of the Circleville letters had any return address and all appeared to come from somewhere within Columbus. Every single letter was written in the same distinct style – block-letters – and might have been an attempt to cover up the author’s personal handwriting.\n\n##**The Circleville Writer Targets Mary and Ron Gillespie**\n\nEven though many of the town’s 14,000 inhabitants were targeted, one woman was seemingly singled out for some severe and/or harsh treatment. Mary Gillespie drove a school bus for a living and was among the initial targets for the volatile author. In addition to revealing disturbing facts, such as her home being under surveillance by the author and that she was a married mother, the letter also contained an allegation that Gillespie was having an affair with a superintendent of schools. In no uncertain terms, the author demanded that she stop and that she was not a subject of a hoax or prank.\n\nAnyone receiving the Circleville letters would be understandably upset at it. Worse was to follow though. Several additional letters were sent to her, all of a similar nature. At first, the terrified woman just hid them all away and began to keep a discreet and panicked eye on her everyday activities – just in case the unknown stalker made the mistake of being spotted. Gillespie did an admirable job at concealing her terror, until one of the Circleville letters arrived addressed to Ron Gillespie, Mary’s husband. This one was blunt and to the point. Ron was ordered to put an end to the affair or die.\n\n##**Mary is Accused of an Affair**\n\nMary first admitted to Ron that she had no clue what the author was referring to and that no affair was taking place. Perhaps this was a failed attempt at blackmail, but the damage to Mary’s reputation had already been done. Just the idea that a mild-mannered woman that would easily blend into a crowd was having an extra-marital affair was enough to get the gossip-mongers talking. Both Ron and Mary Gillespie worked together to try and ignore the threats and intimidation and carry on. Another chilling letter quickly changed that.\n\nGillispie, you have had 2 weeks and done nothing. Admit the truth and inform the school board. If not, I will broadcast it on CBS, posters, signs, and billboards, until the truth comes out.\n\nThe couple began to deliberate about who the possible Circleville letter writer could be. Their suspicions centered on Ron’s brother-in-law, Paul Freshour. To test this hypothesis, the Gillespie’s used the rampant panic as a tool and sent Freshour several similarly written letters, outlining that they knew who he was and what he was up to. A request to stop all activities without resorting to any violence was included, and that ploy looked as though it had worked.\n\n##**Ron Gillespie’s Body is Found**\n\nWhile the Gillespie’s could not be certain that Freshour was responsible for their torment, they at least considered that it was over.\n\nAugust 19th, 1977 began as just another day. Whatever had plagued them before was just a bad memory and things had returned to normal. When the phone rang that day it was treated as just another phone call. Ron answered. Mary never did find out what was said or who made the call, but it was assumed to be the phantom author and he was back with a bang.\n\nRon lost his temper, grabbed his pistol and left the house. At an intersection close to where they lived, *Ron’s vehicle struck a tree and killed Ron Gillespie.* If the caller was indeed the letter writer, then he or she had clearly carried out on the threat to Ron’s life. When the police investigated the crash, they discovered that Ron’s gun had been fired once. Detectives could find no reason or excuse for Ron to have fired at all whether it was deliberate or not. The crash happened moments after Ron drove away and no shot was reported.\n\nThe crash was ruled to be a genuine accident even though strange facts emerged. *A postmortem examination recorded that Ron’s blood-alcohol level was 1.5 times the legal limit.* Those that knew Ron best all confirmed that he was actually teetotal. The Sheriff was once said to have admitted that there was more to the crash than met the eye but later denied those ascertains. And the phantom letter writer began to get in contact with several residents, almost begging for a more thorough investigation to be conducted. It was almost as if the author wasn’t satisfied with the accident conclusion.\n\n##**The Circleville Writer Tries to Kill Mary**\n\nThe Circleville letters began once more in earnest. As well as Mary Gillespie and her immediate family, elected officials were almost targeted. The threats and vulgar nature of the prose was the same as it had been before. The hostility shown to Mary proved to be too much for her to bear any longer. She admitted to the affair taking place, but insisted that it only began after the first of the letters had been delivered. When Freshour was accused of being the Circleville letter writer, he vehemently denied it.\n\nDespite all of this harassment and the scandal that made her the talk of the town, Mary managed to keep her job. Six years after the campaign had began, whoever was behind this took a bold step in furthering their tactics. While at work, Mary noticed a sign on route that threatened the life of her daughter. Angered by this, she stopped the bus and removed the sign.\n\nShe noticed a box with a string tied to another post. Mary removed the box and returned to the bus in order to open it. Inside was a crude booby trap in the form of a pistol. Thankfully the trap failed to execute at all. Once again she called the police, and they quickly discovered that someone had made a crude attempt to file off the gun’s serial number. Police traced the gun to Freshour who, not for the first time, insisted he knew nothing about the events. Freshour stated that the gun went missing long before.\n\n##**Freshour Takes Handwriting Test**\n\nThe gun was about the only solid lead that the police had available to them at the time. So they coerced Freshour into taking a handwriting test in which he had to copy some of the Circleville letters. Even if experts were able to prove that the handwriting was his, the investigation was criticized for the incorrect manner for administering the handwriting test in the first place. The Sheriff was satisfied that Freshour was the Circleville letter writer – or that the handwriting was close enough at least – and he arrested Freshour for attempted murder.\n\nThe trial began in late October 1983 and even though he had an alibi for the day of the booby-trap attempt on Mary’s life, he was convicted and given a sentence of 25 years in prison with the recommendation that he spent at least 7 years behind bars. Many of Circleville’s residents had already convinced themselves that Freshour was guilty despite the evidence given during the trial. Freshour maintained his innocence until his death in 2012.\n\n##*Letters Continue During Freshour’s Term**\n\nWhile serving his time, Freshour was considered to be a model prisoner. He rarely got the chance to correspond with the outside world. In the decade that he was incarcerated, the letters carried on regardless. Like before, they were all postmarked Columbus and Freshour was not sentenced to prison anywhere near Columbus. Even the prison wardens doubted that Freshour was guilty of writing the letters. Authorities, on the other hand, were not convinced. They maintained that, somehow, he was responsible for everything the police accused him.\n\nWhile he was in prison he even received a mysterious letter that stated: “Now when are you going to believe you aren’t going to get out of there? I told you 2 years ago. When we set ’em up, they stay set up. Don’t you listen at all?” Six months after Freshour’s release, TV show Unsolved Mysteries aired a segment on the Circleville Letters. A few days later, the network got one of their own.\n\nIt simply said: “Forget Circleville, Ohio… if you come to Ohio, you el sickos will pay. The Circleville Writer.”\n\n\nTL;DR - Woman receives thousands of threatening letters, residents receive letters too, writer kills man, writer tries killing wife, man is arrested, writer is still loose and writing. \n\n\n\n[Circleville Writer](https://www.google.com/url?sa=t&amp;source=web&amp;rct=j&amp;url=http://unsolvedmysteries.wikia.com/wiki/Circleville_Writer&amp;ved=0ahUKEwjc-Z6j_aHTAhUa24MKHav_CxoQFggaMAA&amp;usg=AFQjCNGDC9ErP_AGClmuJJ-YcNO81_1sRw)\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6571nh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 101, "report_reasons": null, "author": "ieatspacedust", "saved": false, "mod_reports": [], "name": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "approved_by": null, "over_18": false, "domain": "self.UnresolvedMysteries", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2wvvc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/UnresolvedMysteries/comments/6571nh/the_mystery_of_the_circleville_writer/", "num_reports": null, "locked": false, "stickied": false, "created": 1492134326.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/6571nh/the_mystery_of_the_circleville_writer/", "author_flair_text": null, "quarantine": false, "title": "The Mystery of the Circleville Writer", "created_utc": 1492105526.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 66, "visited": false, "subreddit_type": "public", "ups": 101}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9g2bp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "verifiedshitlord", "parent_id": "t1_dg9c43n", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "&gt; (not sure how to tag someone)\n\n/u/johnnyville is all you gotta do /u/serendipityjones14", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;(not sure how to tag someone)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"/u/johnnyville\"&gt;/u/johnnyville&lt;/a&gt; is all you gotta do &lt;a href=\"/u/serendipityjones14\"&gt;/u/serendipityjones14&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9g2bp", "score_hidden": false, "stickied": false, "created": 1492219520.0, "created_utc": 1492190720.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dga10ce", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bluorg", "parent_id": "t1_dg9c43n", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Although in that case, wouldn't the handwriting be different enough between later letters for the police to notice?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Although in that case, wouldn&amp;#39;t the handwriting be different enough between later letters for the police to notice?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dga10ce", "score_hidden": false, "stickied": false, "created": 1492245787.0, "created_utc": 1492216987.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9c43n", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "serendipityjones14", "parent_id": "t1_dg8rool", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "That's an excellent point. I'm not fully sold on Mary being the letter writer, but I do have some serious concerns about her behavior and the letters she received. I like Johnnyville's theory (not sure how to tag someone) below that Mary heard about the anonymous letters and pulled a copycat stunt for her own reasons.\n\nOr ... maybe Mary started it, and then mass hysteria took over the town, and several people with axes to grind got involved. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s an excellent point. I&amp;#39;m not fully sold on Mary being the letter writer, but I do have some serious concerns about her behavior and the letters she received. I like Johnnyville&amp;#39;s theory (not sure how to tag someone) below that Mary heard about the anonymous letters and pulled a copycat stunt for her own reasons.&lt;/p&gt;\n\n&lt;p&gt;Or ... maybe Mary started it, and then mass hysteria took over the town, and several people with axes to grind got involved. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9c43n", "score_hidden": false, "stickied": false, "created": 1492215079.0, "created_utc": 1492186279.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8rool", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "rose_and_valerie", "parent_id": "t1_dg83avl", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "This is a solid theory, but there's one thing that bothers me: If she went to the effort of setting up her brother-in-law, I don't understand why she would continue sending letters that cast serious doubt on his guilt. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a solid theory, but there&amp;#39;s one thing that bothers me: If she went to the effort of setting up her brother-in-law, I don&amp;#39;t understand why she would continue sending letters that cast serious doubt on his guilt. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8rool", "score_hidden": false, "stickied": false, "created": 1492173588.0, "created_utc": 1492144788.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg84ucp", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "beccaASDC", "parent_id": "t1_dg83avl", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I thought almost exactly the same thing. Exactly. It simply doesn't make sense. You explained it exactly. Everything is connected back to this one woman? Weird. \n\nI'd add - the husband received a letter that he needs to end his wife's affair? That sounds like a cry for attention from the wife.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought almost exactly the same thing. Exactly. It simply doesn&amp;#39;t make sense. You explained it exactly. Everything is connected back to this one woman? Weird. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d add - the husband received a letter that he needs to end his wife&amp;#39;s affair? That sounds like a cry for attention from the wife.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg84ucp", "score_hidden": false, "stickied": false, "created": 1492142622.0, "created_utc": 1492113822.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9nm1j", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "SamuraiDrifter42", "parent_id": "t1_dg83avl", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I agree that Mary should be subject to some suspicion here... One contradiction, though, would be the letters urging the police to investigate Ron's death more thoroughly and claiming it wasn't an accident. \n\nIf Mary was the writer, and also killed Ron or was involved in his death, why would she send letters telling the police to do further investigation of a crime she committed?\n\nOne of the very weird parts of this case, to me, is how many contrary motives the writer seems to have. He/she threatens peoples' lives but urges the police to investigate a suspicious death. He/she demands that the HUSBAND of a woman having an affair take action to end it. He/she then tells the woman having the affair (that the writer wanted her to end) to MARRY her affair partner.\n\nThis person (or group) is contradicting themselves at every turn... Ultimately that will make it very difficult to nail down a motive that ties back to anyone. I think most likely the person just likes watching people suffer and squirm. It doesn't matter to them exactly what happens... They just want to get a reaction.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that Mary should be subject to some suspicion here... One contradiction, though, would be the letters urging the police to investigate Ron&amp;#39;s death more thoroughly and claiming it wasn&amp;#39;t an accident. &lt;/p&gt;\n\n&lt;p&gt;If Mary was the writer, and also killed Ron or was involved in his death, why would she send letters telling the police to do further investigation of a crime she committed?&lt;/p&gt;\n\n&lt;p&gt;One of the very weird parts of this case, to me, is how many contrary motives the writer seems to have. He/she threatens peoples&amp;#39; lives but urges the police to investigate a suspicious death. He/she demands that the HUSBAND of a woman having an affair take action to end it. He/she then tells the woman having the affair (that the writer wanted her to end) to MARRY her affair partner.&lt;/p&gt;\n\n&lt;p&gt;This person (or group) is contradicting themselves at every turn... Ultimately that will make it very difficult to nail down a motive that ties back to anyone. I think most likely the person just likes watching people suffer and squirm. It doesn&amp;#39;t matter to them exactly what happens... They just want to get a reaction.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9nm1j", "score_hidden": false, "stickied": false, "created": 1492228513.0, "created_utc": 1492199713.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8e56z", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Dwayla", "parent_id": "t1_dg83avl", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I like this theory! Terribly frustrating case but so far the best theory I've heard.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like this theory! Terribly frustrating case but so far the best theory I&amp;#39;ve heard.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8e56z", "score_hidden": false, "stickied": false, "created": 1492154021.0, "created_utc": 1492125221.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8nxo4", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "emiliogt", "parent_id": "t1_dg83avl", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I would put money on Mary being the writer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would put money on Mary being the writer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8nxo4", "score_hidden": false, "stickied": false, "created": 1492167561.0, "created_utc": 1492138761.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8ybu4", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "witch--king", "parent_id": "t1_dg83avl", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Oh no this makes my \"Mary was acting out subconsciously and sending the letters herself\" conspiracy theory suddenly too real!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh no this makes my &amp;quot;Mary was acting out subconsciously and sending the letters herself&amp;quot; conspiracy theory suddenly too real!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8ybu4", "score_hidden": false, "stickied": false, "created": 1492190228.0, "created_utc": 1492161428.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dga32jz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg83avl", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I wonder if some of the initial threatening letters might have been genuine, but Mary -- perhaps feeling that people were not taking her plight seriously enough -- set up the supposed booby trap/murder attempt in order to garner more sympathy?\n\nMy unified field theory of the case, such as it is: the Letter Writer is a disturbed local with plenty of axes to grind, who among other people targets Mary Gillespie. Mary, as previously speculated, resorts to the faked murder attempt in order to garner more sympathy - the letters and their accusations having made her a pariah, rather than being recognized as a victim - perhaps using a gun stolen from her brother-in-law (or one he misplaced that she somehow came into possession of) because, who knows, she may honestly believe that he is the one behind the letters. Her husband's death is an accident or suicide, brought about by the stress of the whole situation and, possibly, by Mary finally admitting to the affair. \n\nDoes anyone know why Mary and her husband suspected Freshour in the first place?", "edited": 1492220499.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder if some of the initial threatening letters might have been genuine, but Mary -- perhaps feeling that people were not taking her plight seriously enough -- set up the supposed booby trap/murder attempt in order to garner more sympathy?&lt;/p&gt;\n\n&lt;p&gt;My unified field theory of the case, such as it is: the Letter Writer is a disturbed local with plenty of axes to grind, who among other people targets Mary Gillespie. Mary, as previously speculated, resorts to the faked murder attempt in order to garner more sympathy - the letters and their accusations having made her a pariah, rather than being recognized as a victim - perhaps using a gun stolen from her brother-in-law (or one he misplaced that she somehow came into possession of) because, who knows, she may honestly believe that he is the one behind the letters. Her husband&amp;#39;s death is an accident or suicide, brought about by the stress of the whole situation and, possibly, by Mary finally admitting to the affair. &lt;/p&gt;\n\n&lt;p&gt;Does anyone know why Mary and her husband suspected Freshour in the first place?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dga32jz", "score_hidden": false, "stickied": false, "created": 1492248613.0, "created_utc": 1492219813.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9hnih", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SecondRyan", "parent_id": "t1_dg83avl", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "&gt; particularly cynical person\n\nthat's actually a particularly perceptive comment. I've always suspected she had something to do with it, just as I believe the family in Long Island receiving letters from \"The Watcher\" is involved. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;particularly cynical person&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;that&amp;#39;s actually a particularly perceptive comment. I&amp;#39;ve always suspected she had something to do with it, just as I believe the family in Long Island receiving letters from &amp;quot;The Watcher&amp;quot; is involved. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9hnih", "score_hidden": false, "stickied": false, "created": 1492221367.0, "created_utc": 1492192567.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8m2y8", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "Carl_Solomon", "parent_id": "t1_dg83avl", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 1, "body": "Mary is definitely suspicious. I mean, what rightminded adult human drives a school bus? Also, she was at the nexus of every event and there are no other witnesses to any of the goings on who can corroborate her yarns.\n\nEdit: The PDF linked above seems like a first generation copy, which is dissimilar from most documents I've seen which are heavily redacted.", "edited": 1492136481.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mary is definitely suspicious. I mean, what rightminded adult human drives a school bus? Also, she was at the nexus of every event and there are no other witnesses to any of the goings on who can corroborate her yarns.&lt;/p&gt;\n\n&lt;p&gt;Edit: The PDF linked above seems like a first generation copy, which is dissimilar from most documents I&amp;#39;ve seen which are heavily redacted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8m2y8", "score_hidden": false, "stickied": false, "created": 1492164888.0, "created_utc": 1492136088.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83avl", "gilded": 0, "archived": false, "score": 53, "report_reasons": null, "author": "serendipityjones14", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "If I were a particularly cynical person, I'd be looking a bit askance at Mary. Here we have a situation in which this woman is receiving all these abusive letters, and then suddenly the letter writer turns on her husband and threatens his life. It seems like in a normal anonymous letter-writing situation, there'd be extortion attempts, blackmail, etc., first before the LW would decide to threaten some innocent person's life. And the LW is not threatening Mary with her husband's death -- they're telling HIM to end HER affair. He has no power to do that, so it's silly to even suggest it. And yet ... \n\nThen, we really only have Mary's word for the next set of events. Presumably there was no record of the originating phone call. And Mary conveniently doesn't have a clue who called, nor did Ron tell her where he was going. He just headed out of the house after grabbing his gun. But he's found full of alcohol, dead and with one shot fired. Even though he doesn't drink. But Mary could easily add alcohol to something he was eating or drinking before he left to interfere with his ability to react.\n\nMary was then \"almost killed\" by a booby trap that failed to execute but that was quickly and easily traced to her primary suspect. But there's no real explanation as to why Freshour was her primary suspect. And along those lines: Wouldn't a better suspect be the wife of the superintendent, Mary's supposed affair partner? Because she'd have a darn good reason for wanting Mary dead. Ron's brother-in-law, one would think, probably would have little reason for actually caring much about Mary's petty dabbling in extra-marital-land and certainly not caring enough to murder people over it. Why did Freshour supposedly care so much? What was his interest in what Mary did in her spare time?\n\nTHEN Mary admits to starting an affair with the superintendent -- but only AFTER these poison pen letters begin. So the letters haven't destroyed her rep. She's gotten sympathy from at least one source, or so she wants people to believe she has. Or was she already having the affair? Either way, Mary is looking more and more contrary from where I sit.\n\nI wonder if Freshour's wife divorced him before or during this mess or his prison term. I wonder if she was close to Mary. I wonder if these two got closer after the poison pen events. I wonder if they got any more letters after he went to jail.\n\nI also wonder if I watch way too many mystery shows.\n\nETA: According to [this] (https://circlevilleletters.files.wordpress.com/2011/10/circleville-letters-3_0001.pdf), Mary got an anonymous letter telling her to marry her affair partner or she'd die. Then there was the attempt on her life. (It's on page 26, so you'll need to scroll a bit). \n\nAlso ETA: The fly in my theory's ointment. Apparently Mary got 39 nasty letters, and a total of ~1,000 letters were sent. Is any woman really that determined that she'd send 960 obscene letters to people around town just to hide her own dirty deeds? Even children were targeted, apparently.\n", "edited": 1492115062.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I were a particularly cynical person, I&amp;#39;d be looking a bit askance at Mary. Here we have a situation in which this woman is receiving all these abusive letters, and then suddenly the letter writer turns on her husband and threatens his life. It seems like in a normal anonymous letter-writing situation, there&amp;#39;d be extortion attempts, blackmail, etc., first before the LW would decide to threaten some innocent person&amp;#39;s life. And the LW is not threatening Mary with her husband&amp;#39;s death -- they&amp;#39;re telling HIM to end HER affair. He has no power to do that, so it&amp;#39;s silly to even suggest it. And yet ... &lt;/p&gt;\n\n&lt;p&gt;Then, we really only have Mary&amp;#39;s word for the next set of events. Presumably there was no record of the originating phone call. And Mary conveniently doesn&amp;#39;t have a clue who called, nor did Ron tell her where he was going. He just headed out of the house after grabbing his gun. But he&amp;#39;s found full of alcohol, dead and with one shot fired. Even though he doesn&amp;#39;t drink. But Mary could easily add alcohol to something he was eating or drinking before he left to interfere with his ability to react.&lt;/p&gt;\n\n&lt;p&gt;Mary was then &amp;quot;almost killed&amp;quot; by a booby trap that failed to execute but that was quickly and easily traced to her primary suspect. But there&amp;#39;s no real explanation as to why Freshour was her primary suspect. And along those lines: Wouldn&amp;#39;t a better suspect be the wife of the superintendent, Mary&amp;#39;s supposed affair partner? Because she&amp;#39;d have a darn good reason for wanting Mary dead. Ron&amp;#39;s brother-in-law, one would think, probably would have little reason for actually caring much about Mary&amp;#39;s petty dabbling in extra-marital-land and certainly not caring enough to murder people over it. Why did Freshour supposedly care so much? What was his interest in what Mary did in her spare time?&lt;/p&gt;\n\n&lt;p&gt;THEN Mary admits to starting an affair with the superintendent -- but only AFTER these poison pen letters begin. So the letters haven&amp;#39;t destroyed her rep. She&amp;#39;s gotten sympathy from at least one source, or so she wants people to believe she has. Or was she already having the affair? Either way, Mary is looking more and more contrary from where I sit.&lt;/p&gt;\n\n&lt;p&gt;I wonder if Freshour&amp;#39;s wife divorced him before or during this mess or his prison term. I wonder if she was close to Mary. I wonder if these two got closer after the poison pen events. I wonder if they got any more letters after he went to jail.&lt;/p&gt;\n\n&lt;p&gt;I also wonder if I watch way too many mystery shows.&lt;/p&gt;\n\n&lt;p&gt;ETA: According to &lt;a href=\"https://circlevilleletters.files.wordpress.com/2011/10/circleville-letters-3_0001.pdf\"&gt;this&lt;/a&gt;, Mary got an anonymous letter telling her to marry her affair partner or she&amp;#39;d die. Then there was the attempt on her life. (It&amp;#39;s on page 26, so you&amp;#39;ll need to scroll a bit). &lt;/p&gt;\n\n&lt;p&gt;Also ETA: The fly in my theory&amp;#39;s ointment. Apparently Mary got 39 nasty letters, and a total of ~1,000 letters were sent. Is any woman really that determined that she&amp;#39;d send 960 obscene letters to people around town just to hide her own dirty deeds? Even children were targeted, apparently.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg83avl", "score_hidden": false, "stickied": false, "created": 1492140945.0, "created_utc": 1492112145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 53}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8nrg5", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Johnnyvile", "parent_id": "t1_dg8k9h7", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Man crazy people in circle like. Crap just goes round and round.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man crazy people in circle like. Crap just goes round and round.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8nrg5", "score_hidden": false, "stickied": false, "created": 1492167302.0, "created_utc": 1492138502.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8ydx4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "witch--king", "parent_id": "t1_dg8k9h7", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "WILD!\n\nI'm so sorry your friend had to go through that!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;WILD!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so sorry your friend had to go through that!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8ydx4", "score_hidden": false, "stickied": false, "created": 1492190417.0, "created_utc": 1492161617.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9he9p", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "SecondRyan", "parent_id": "t1_dg9g6gd", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I asked around about him last night - still alive! He apparently had a bizarre rivalry with his cousin and made a second dramatic and public suicide attempt at a different college after his hated cousin seduced a girl he liked. Mr. Circleville did not cut himself in the second episode, but he did climb onto a window ledge and threaten to take a dive. The fire department had to rescue him and he went off to a different college elsewhere in the country. \n\nSo we've got one guy from Circleville terrorizing his neighbors with letters, and another guy terrorizing college towns with outlandish suicide attempts.\n\nToday he's one of those guys working for a relative's business - i.e. he has a low-stress life, which he clearly needs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I asked around about him last night - still alive! He apparently had a bizarre rivalry with his cousin and made a second dramatic and public suicide attempt at a different college after his hated cousin seduced a girl he liked. Mr. Circleville did not cut himself in the second episode, but he did climb onto a window ledge and threaten to take a dive. The fire department had to rescue him and he went off to a different college elsewhere in the country. &lt;/p&gt;\n\n&lt;p&gt;So we&amp;#39;ve got one guy from Circleville terrorizing his neighbors with letters, and another guy terrorizing college towns with outlandish suicide attempts.&lt;/p&gt;\n\n&lt;p&gt;Today he&amp;#39;s one of those guys working for a relative&amp;#39;s business - i.e. he has a low-stress life, which he clearly needs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9he9p", "score_hidden": false, "stickied": false, "created": 1492221070.0, "created_utc": 1492192270.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9g6gd", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "verifiedshitlord", "parent_id": "t1_dg8k9h7", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "&gt; So yeah, dude, keep blaming Robert Stack\n\nIf he's even still alive considering that's how he reacts to break ups. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So yeah, dude, keep blaming Robert Stack&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If he&amp;#39;s even still alive considering that&amp;#39;s how he reacts to break ups. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9g6gd", "score_hidden": false, "stickied": false, "created": 1492219654.0, "created_utc": 1492190854.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8k9h7", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "SecondRyan", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Back in the 90s, one of my friends in college dated a guy originally from Circleville. She asked him about the Letter Writer and he got defensive, saying that Unsolved Mysteries made his hometown look like it was populated with maniacs. \n\nA few weeks later when she broke up with him, he slashed his wrists, left her a message that he was going to die for her love, then climbed onto the ledge of his dorm room, bleeding and shrieking until some other students talked him back inside. \n\nSo yeah, dude, keep blaming Robert Stack for people believing your hometown is screwy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Back in the 90s, one of my friends in college dated a guy originally from Circleville. She asked him about the Letter Writer and he got defensive, saying that Unsolved Mysteries made his hometown look like it was populated with maniacs. &lt;/p&gt;\n\n&lt;p&gt;A few weeks later when she broke up with him, he slashed his wrists, left her a message that he was going to die for her love, then climbed onto the ledge of his dorm room, bleeding and shrieking until some other students talked him back inside. &lt;/p&gt;\n\n&lt;p&gt;So yeah, dude, keep blaming Robert Stack for people believing your hometown is screwy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8k9h7", "score_hidden": false, "stickied": false, "created": 1492162352.0, "created_utc": 1492133552.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9h07v", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "tea-and-smoothies", "parent_id": "t1_dg9dvrr", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "&gt;  It's not officially \"solved\" because Paul Freshour remains guilty in the court of law but nobody bothered to try and find the letter writer who kept writing letters while Paul was in prison.\n\ngood grief, the lengths prosecutors will go to in order to preserve a conviction.....\n\nnow off to read your link!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s not officially &amp;quot;solved&amp;quot; because Paul Freshour remains guilty in the court of law but nobody bothered to try and find the letter writer who kept writing letters while Paul was in prison.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;good grief, the lengths prosecutors will go to in order to preserve a conviction.....&lt;/p&gt;\n\n&lt;p&gt;now off to read your link!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9h07v", "score_hidden": false, "stickied": false, "created": 1492220616.0, "created_utc": 1492191816.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9dxfx", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ieatspacedust", "parent_id": "t1_dg9dvrr", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "OH! Okay! Thanks for clarifying! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OH! Okay! Thanks for clarifying! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9dxfx", "score_hidden": false, "stickied": false, "created": 1492217088.0, "created_utc": 1492188288.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dvrr", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "DJHJR86", "parent_id": "t1_dg99s87", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "You don't have to delete it...it's an interesting case and you did a great write up on it.  IMO it's been \"solved\".  It's not officially \"solved\" because Paul Freshour remains guilty in the court of law but nobody bothered to try and find the letter writer who kept writing letters while Paul was in prison.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t have to delete it...it&amp;#39;s an interesting case and you did a great write up on it.  IMO it&amp;#39;s been &amp;quot;solved&amp;quot;.  It&amp;#39;s not officially &amp;quot;solved&amp;quot; because Paul Freshour remains guilty in the court of law but nobody bothered to try and find the letter writer who kept writing letters while Paul was in prison.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9dvrr", "score_hidden": false, "stickied": false, "created": 1492217036.0, "created_utc": 1492188236.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9cvh6", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "araradia", "parent_id": "t1_dg99s87", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Please don't delete it! This is such a unique story and write up!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please don&amp;#39;t delete it! This is such a unique story and write up!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9cvh6", "score_hidden": false, "stickied": false, "created": 1492215899.0, "created_utc": 1492187099.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99s87", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ieatspacedust", "parent_id": "t1_dg95qe0", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thank you! I will remove this post for a new one!! If anyone can prove a case solved, I will choose a different one. Upvote, friend. :) thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! I will remove this post for a new one!! If anyone can prove a case solved, I will choose a different one. Upvote, friend. :) thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg99s87", "score_hidden": false, "stickied": false, "created": 1492212390.0, "created_utc": 1492183590.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dgddyki", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DJHJR86", "parent_id": "t1_dgabs9r", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "&gt; There is a terribly written and paranoid sounding letter authored by Freshour that is floating around online somewhere that spells alot of this out more clearly.\n\nI took everything that Freshour claimed with a grain of salt, being that he wouldn't necessarily be an unbiased source.  When I double checked information and even contacted Martin Yant (PI who investigated the case and who was featured on Unsolved Mysteries), everything in his story checked out.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There is a terribly written and paranoid sounding letter authored by Freshour that is floating around online somewhere that spells alot of this out more clearly.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I took everything that Freshour claimed with a grain of salt, being that he wouldn&amp;#39;t necessarily be an unbiased source.  When I double checked information and even contacted Martin Yant (PI who investigated the case and who was featured on Unsolved Mysteries), everything in his story checked out.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgddyki", "score_hidden": false, "stickied": false, "created": 1492458523.0, "created_utc": 1492429723.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgabs9r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nolurk_turk", "parent_id": "t1_dg95qe0", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "As a postscript IRC David Longberry was latter accused of molesting an underage girl and after fleeing Ohio eventually committed suicide in another state. However his body went unidentified for some period of time before he was officially identified and declared dead.\n\nThere is a terribly written and paranoid sounding letter authored by Freshour that is floating around online somewhere that spells alot of this out more clearly. I 100 percent agree with the above theory as far as there being at least two letter writers and that there was at least as much evidence that Freshour's ex-wife was responsible for framing him as there was for Freshour being guilty of setting an incredibly flimsy and pathetic attempt at a murder trap to kill Mary G. She had lost everything in a nasty divorce a few years prior to him being arrested and accused of being the letter writer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a postscript IRC David Longberry was latter accused of molesting an underage girl and after fleeing Ohio eventually committed suicide in another state. However his body went unidentified for some period of time before he was officially identified and declared dead.&lt;/p&gt;\n\n&lt;p&gt;There is a terribly written and paranoid sounding letter authored by Freshour that is floating around online somewhere that spells alot of this out more clearly. I 100 percent agree with the above theory as far as there being at least two letter writers and that there was at least as much evidence that Freshour&amp;#39;s ex-wife was responsible for framing him as there was for Freshour being guilty of setting an incredibly flimsy and pathetic attempt at a murder trap to kill Mary G. She had lost everything in a nasty divorce a few years prior to him being arrested and accused of being the letter writer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgabs9r", "score_hidden": false, "stickied": false, "created": 1492262267.0, "created_utc": 1492233467.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95qe0", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "DJHJR86", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "This mystery has been solved, IMO.  I post over at the Unsolved Mysteries section of sitcomsonline and posted [this](http://www.sitcomsonline.com/boards/showpost.php?p=5116604&amp;postcount=1) awhile back.  The man was named David Longberry, and he tried to \"court\" Mary Gillespie, but was rebuffed.  When Mary started her affair with Gordon Massie, Longberry was pissed and started writing the letters.  Once Freshour and his wife started going through divorce proceedings (which resulted in Freshour receiving their house and custody of their children) the wife started to write letters as the writer to set up Freshour and extract revenge.  So technically there were 2 writers.  Longberry (who's letters targeted the affair and other problems within the school system) and Freshour's ex-wife (who went out of her way to frame Freshour as the writer).  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This mystery has been solved, IMO.  I post over at the Unsolved Mysteries section of sitcomsonline and posted &lt;a href=\"http://www.sitcomsonline.com/boards/showpost.php?p=5116604&amp;amp;postcount=1\"&gt;this&lt;/a&gt; awhile back.  The man was named David Longberry, and he tried to &amp;quot;court&amp;quot; Mary Gillespie, but was rebuffed.  When Mary started her affair with Gordon Massie, Longberry was pissed and started writing the letters.  Once Freshour and his wife started going through divorce proceedings (which resulted in Freshour receiving their house and custody of their children) the wife started to write letters as the writer to set up Freshour and extract revenge.  So technically there were 2 writers.  Longberry (who&amp;#39;s letters targeted the affair and other problems within the school system) and Freshour&amp;#39;s ex-wife (who went out of her way to frame Freshour as the writer).  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg95qe0", "score_hidden": false, "stickied": false, "created": 1492207154.0, "created_utc": 1492178354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9xvsa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tea-and-smoothies", "parent_id": "t1_dg9l2hm", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "&gt; it's just breaking my brain\n\nhahaha!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;it&amp;#39;s just breaking my brain&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;hahaha!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9xvsa", "score_hidden": false, "stickied": false, "created": 1492241636.0, "created_utc": 1492212836.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9l2hm", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "witch--king", "parent_id": "t1_dg9gx5m", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I'm trying to imagine what it would be like if the first theory was even remotely true and it's just breaking my brain lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m trying to imagine what it would be like if the first theory was even remotely true and it&amp;#39;s just breaking my brain lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9l2hm", "score_hidden": false, "stickied": false, "created": 1492225444.0, "created_utc": 1492196644.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9gx5m", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "tea-and-smoothies", "parent_id": "t1_dg8y943", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "&gt; ETA: although the top post in this thread is suddenly giving my first theory credence. Uh oh.\n\noh, you gave me a laugh!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;ETA: although the top post in this thread is suddenly giving my first theory credence. Uh oh.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;oh, you gave me a laugh!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9gx5m", "score_hidden": false, "stickied": false, "created": 1492220518.0, "created_utc": 1492191718.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9odnu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "witch--king", "parent_id": "t1_dg9nb9c", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Oh whoa thank you. I really just came up with them off the top of my head.\n\nI agree with you, though. Since the whole case seems to be centered around her, it's natural to be suspicious, especially considering all that's happened... but you ask pretty much the most important question to the theory. Not only that, but I'm under the impression other people besides the immediate family surrounding Mary received letters as well that contained personal info (though I could be misinterpreting). If that's the case, then how would Mary know? Also, if it is really her writing the letters, I'm blown away by the level of... narcissism? I guess? and attention seeking behavior and can't help but wonder if she's shown signs of attention seeking behavior before.\n\nEdit: I misread a word in your comment and WHOOPS. had to fix my reply", "edited": 1492201009.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh whoa thank you. I really just came up with them off the top of my head.&lt;/p&gt;\n\n&lt;p&gt;I agree with you, though. Since the whole case seems to be centered around her, it&amp;#39;s natural to be suspicious, especially considering all that&amp;#39;s happened... but you ask pretty much the most important question to the theory. Not only that, but I&amp;#39;m under the impression other people besides the immediate family surrounding Mary received letters as well that contained personal info (though I could be misinterpreting). If that&amp;#39;s the case, then how would Mary know? Also, if it is really her writing the letters, I&amp;#39;m blown away by the level of... narcissism? I guess? and attention seeking behavior and can&amp;#39;t help but wonder if she&amp;#39;s shown signs of attention seeking behavior before.&lt;/p&gt;\n\n&lt;p&gt;Edit: I misread a word in your comment and WHOOPS. had to fix my reply&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9odnu", "score_hidden": false, "stickied": false, "created": 1492229433.0, "created_utc": 1492200633.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9nb9c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "loversalibi", "parent_id": "t1_dg8y943", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "no, they're not lame at all! honestly I think it was probably Mary herself. the only thing that gives me pause is how would she have time to write all those letters? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;no, they&amp;#39;re not lame at all! honestly I think it was probably Mary herself. the only thing that gives me pause is how would she have time to write all those letters? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9nb9c", "score_hidden": false, "stickied": false, "created": 1492228150.0, "created_utc": 1492199350.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8y943", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "witch--king", "parent_id": "t1_dg8ptd2", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "HOO BOY! Okay, I will try, but it's sometimes hard for me to make sense when I try to articulate certain thoughts so please bear with me :) this is going to be so rough for me because this theories are so wild and out there and I don't generally take stock in conspiracy theories lol. \n\n1. What if Mary was writing these letters out of deep shame and guilt for her affair (although she staunchly stands by the affair only happening after the letters). She could have been doing it consciously or unconsciously. Like how people sleep walk and preform actions that they're not even aware they're doing because they're asleep. Maybe, subconsciously, she was punishing herself for her transgression and wanted to get it out there so she no longer had to carry her guilt in secret. The only problem with this is that tons of other people got letters, too, with details only really known to them. I mean I guess she could have written those too to throw people off her trail... but Lordy is this a reach. Also would someone's handwriting change so drastically like that?\n\n2. This goes along with the subconsciously acting out theory. Maybe she had an alter ego or other personality that manifested because of her guilt and shame and this personality started acting out as a form of punishment. Impossible though because it's hard to conceal something like that from your family.\n\n3. Somewhere out there is a disgruntled priest playing vigilante. Except of course not really because who knows if there really is a Catholic Church in town and it's unlikely everyone who received these letters is catholic or goes to church.\n\n4. Mass copy cat hysteria. Some people wanted to be a part of the action! But if that's the case then every letter would absolutely not be identical.\n\nVery silly theories that I don't believe in at all, haha! Sorry if these are lame, but to me they're so ridiculous that I can't even believe I thought about them lol. Also not looking to debate these because they're flimsy and silly.\n\nETA: although the top post in this thread is suddenly giving my first theory credence. Uh oh.", "edited": 1492161528.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;HOO BOY! Okay, I will try, but it&amp;#39;s sometimes hard for me to make sense when I try to articulate certain thoughts so please bear with me :) this is going to be so rough for me because this theories are so wild and out there and I don&amp;#39;t generally take stock in conspiracy theories lol. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;What if Mary was writing these letters out of deep shame and guilt for her affair (although she staunchly stands by the affair only happening after the letters). She could have been doing it consciously or unconsciously. Like how people sleep walk and preform actions that they&amp;#39;re not even aware they&amp;#39;re doing because they&amp;#39;re asleep. Maybe, subconsciously, she was punishing herself for her transgression and wanted to get it out there so she no longer had to carry her guilt in secret. The only problem with this is that tons of other people got letters, too, with details only really known to them. I mean I guess she could have written those too to throw people off her trail... but Lordy is this a reach. Also would someone&amp;#39;s handwriting change so drastically like that?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;This goes along with the subconsciously acting out theory. Maybe she had an alter ego or other personality that manifested because of her guilt and shame and this personality started acting out as a form of punishment. Impossible though because it&amp;#39;s hard to conceal something like that from your family.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Somewhere out there is a disgruntled priest playing vigilante. Except of course not really because who knows if there really is a Catholic Church in town and it&amp;#39;s unlikely everyone who received these letters is catholic or goes to church.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Mass copy cat hysteria. Some people wanted to be a part of the action! But if that&amp;#39;s the case then every letter would absolutely not be identical.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Very silly theories that I don&amp;#39;t believe in at all, haha! Sorry if these are lame, but to me they&amp;#39;re so ridiculous that I can&amp;#39;t even believe I thought about them lol. Also not looking to debate these because they&amp;#39;re flimsy and silly.&lt;/p&gt;\n\n&lt;p&gt;ETA: although the top post in this thread is suddenly giving my first theory credence. Uh oh.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8y943", "score_hidden": false, "stickied": false, "created": 1492189981.0, "created_utc": 1492161181.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ptd2", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "loversalibi", "parent_id": "t1_dg82wes", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I wanna hear your outlandish theories", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wanna hear your outlandish theories&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8ptd2", "score_hidden": false, "stickied": false, "created": 1492170470.0, "created_utc": 1492141670.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82wes", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "witch--king", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I remember when I heard about this case on unsolved mysteries. In fact, I have the episode segment on my computer (back during the times when finding UM content on the internet was a rarity). Great, solid write up, OP!\n\nI have some wildly outlandish theories as to who the writer could be, though they are ones I don't really believe and one could easily poke holes in them. It's just interesting to speculate I suppose. Regardless, at this point I don't think we'll ever know who the writer is unless we get a death bed confession.\n\nWas the BIL the only suspect that the LE zeroed in on?\n\nHonestly, you gotta wonder if this is the work of some vindictive priest who has heard too much sinful confessions! (I kid of course)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember when I heard about this case on unsolved mysteries. In fact, I have the episode segment on my computer (back during the times when finding UM content on the internet was a rarity). Great, solid write up, OP!&lt;/p&gt;\n\n&lt;p&gt;I have some wildly outlandish theories as to who the writer could be, though they are ones I don&amp;#39;t really believe and one could easily poke holes in them. It&amp;#39;s just interesting to speculate I suppose. Regardless, at this point I don&amp;#39;t think we&amp;#39;ll ever know who the writer is unless we get a death bed confession.&lt;/p&gt;\n\n&lt;p&gt;Was the BIL the only suspect that the LE zeroed in on?&lt;/p&gt;\n\n&lt;p&gt;Honestly, you gotta wonder if this is the work of some vindictive priest who has heard too much sinful confessions! (I kid of course)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg82wes", "score_hidden": false, "stickied": false, "created": 1492140508.0, "created_utc": 1492111708.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8o5um", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Johnnyvile", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I'm going to say there was probably some person(or two) that started this as a prank or something. Once it got out another person Ron on Mary pulled a copycat move. Maybe Ron did it to get his wife to stop. Maybe Mary did it to end her marriage or get serious with her affair. The booby trapped box sounds like BS and something Mary setup. She sees a box, doesn't open it, takes it on the bus, takes it home, opens it, then way later gives it to the police, and it just so happens to be Paul's gun.\n\nPaul's ex was cheating on him and I believe was living in a trailer on the Gillespie's property. Could be motive for Paul, could be motive to set him up.\n\nAs for Ron I think he did drink. When a good person dies from drugs or alcohol friends and family always say they never did that. He probably wasn't a drunk. I assume that day he got drunk(wife is cheating on him, stress of the letters) they got into a fight and he grabbed his gun to go confront the guy his wife was cheating on him with, which sounds like something a drunk person would do. Unfortunately he got in an accident.\n\nI recall reading somewhere that there was originally two different handwritings in the letters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to say there was probably some person(or two) that started this as a prank or something. Once it got out another person Ron on Mary pulled a copycat move. Maybe Ron did it to get his wife to stop. Maybe Mary did it to end her marriage or get serious with her affair. The booby trapped box sounds like BS and something Mary setup. She sees a box, doesn&amp;#39;t open it, takes it on the bus, takes it home, opens it, then way later gives it to the police, and it just so happens to be Paul&amp;#39;s gun.&lt;/p&gt;\n\n&lt;p&gt;Paul&amp;#39;s ex was cheating on him and I believe was living in a trailer on the Gillespie&amp;#39;s property. Could be motive for Paul, could be motive to set him up.&lt;/p&gt;\n\n&lt;p&gt;As for Ron I think he did drink. When a good person dies from drugs or alcohol friends and family always say they never did that. He probably wasn&amp;#39;t a drunk. I assume that day he got drunk(wife is cheating on him, stress of the letters) they got into a fight and he grabbed his gun to go confront the guy his wife was cheating on him with, which sounds like something a drunk person would do. Unfortunately he got in an accident.&lt;/p&gt;\n\n&lt;p&gt;I recall reading somewhere that there was originally two different handwritings in the letters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8o5um", "score_hidden": false, "stickied": false, "created": 1492167899.0, "created_utc": 1492139099.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8rx3g", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "rose_and_valerie", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I don't think the writer killed Ron. He wasn't a habitual drinker, but a lot of people will drink when they're stressed (which he certainly was.) That's not a red flag at all to me. He was emotional and drunk, the perfect recipe for an accident. The gun was most likely fired on some previous occasion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think the writer killed Ron. He wasn&amp;#39;t a habitual drinker, but a lot of people will drink when they&amp;#39;re stressed (which he certainly was.) That&amp;#39;s not a red flag at all to me. He was emotional and drunk, the perfect recipe for an accident. The gun was most likely fired on some previous occasion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8rx3g", "score_hidden": false, "stickied": false, "created": 1492174008.0, "created_utc": 1492145208.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8rutv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TBoneBaggetteBaggins", "parent_id": "t1_dg828tv", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I suspect this is not your first writing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suspect this is not your first writing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8rutv", "score_hidden": false, "stickied": false, "created": 1492173894.0, "created_utc": 1492145094.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg828tv", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "feelsinitalics", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Holy cow! I used to live fairly close to Circleville in my youth, yet I've never heard of any of this. So interesting! Down the rabbit hole I go!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy cow! I used to live fairly close to Circleville in my youth, yet I&amp;#39;ve never heard of any of this. So interesting! Down the rabbit hole I go!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg828tv", "score_hidden": false, "stickied": false, "created": 1492139794.0, "created_utc": 1492110994.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8hfen", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BiscuitCat1", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I've always been intrigued by this bizarre case. Great post ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always been intrigued by this bizarre case. Great post &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8hfen", "score_hidden": false, "stickied": false, "created": 1492158467.0, "created_utc": 1492129667.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dgcsduw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Max_Trollbot_", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I just would like call attention to my ongoing campaign to have the writer renamed \"The Circleville Jerk\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just would like call attention to my ongoing campaign to have the writer renamed &amp;quot;The Circleville Jerk&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgcsduw", "score_hidden": false, "stickied": false, "created": 1492415847.0, "created_utc": 1492387047.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8jrwq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MrsBoombastic98", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I just searched Reddit for this case just two days ago.\nI think it is most likely someone in town that lives a seemingly normal life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just searched Reddit for this case just two days ago.\nI think it is most likely someone in town that lives a seemingly normal life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8jrwq", "score_hidden": false, "stickied": false, "created": 1492161680.0, "created_utc": 1492132880.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8q5bi", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "winwood_one", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I've always been absolutely fascinated by this case.  I've thought that possibly Mary was the letter writer. Did the police investigate her at all? So bizarre! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always been absolutely fascinated by this case.  I&amp;#39;ve thought that possibly Mary was the letter writer. Did the police investigate her at all? So bizarre! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8q5bi", "score_hidden": false, "stickied": false, "created": 1492171012.0, "created_utc": 1492142212.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg91a0n", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Nina_Innsted", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "In Sight Podcast did an episode on this case. \n\nThere is a similar story, also in Ohio about the death of 14 year old [Bill Comeans](https://www.reddit.com/r/UnresolvedMysteries/comments/5aw0pz/who_left_threatening_notes_then_murdered_14_year/)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In Sight Podcast did an episode on this case. &lt;/p&gt;\n\n&lt;p&gt;There is a similar story, also in Ohio about the death of 14 year old &lt;a href=\"https://www.reddit.com/r/UnresolvedMysteries/comments/5aw0pz/who_left_threatening_notes_then_murdered_14_year/\"&gt;Bill Comeans&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg91a0n", "score_hidden": false, "stickied": false, "created": 1492199123.0, "created_utc": 1492170323.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8loah", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JKeel99", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Man, I have been fascinated with this since Unsolved Mysteries in the 90's!  Absolutely bizarre!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, I have been fascinated with this since Unsolved Mysteries in the 90&amp;#39;s!  Absolutely bizarre!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8loah", "score_hidden": false, "stickied": false, "created": 1492164315.0, "created_utc": 1492135515.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8q0ji", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tea-and-smoothies", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "This pry makes me shallow, but if i could know the answer to one mystery it would be this one - i just can't stand not knowing!!!!\n\nETA: thank you for a great writeup spacedust :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This pry makes me shallow, but if i could know the answer to one mystery it would be this one - i just can&amp;#39;t stand not knowing!!!!&lt;/p&gt;\n\n&lt;p&gt;ETA: thank you for a great writeup spacedust :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8q0ji", "score_hidden": false, "stickied": false, "created": 1492170794.0, "created_utc": 1492141994.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg8z4y7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bwdawatt", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I've been fascinated by this for years. I'm working from memory so forgive me if some of what I say is a bit askew:\n\nI'm skeptical that this car crash is anything other than a car crash. I don't think a fired gun is anything to be suspicious of. If anything, it makes me think that he may have fired it accidentally whilst driving, which led him to be startled and crash the car himself. \n\nThe reason I'm skeptical is that it would be damn near impossible to intercept him on his way to wherever he was going. How would the writer of the letter know that Ron would leave the house at that specific time, or take that specific route, or read the letter at that time? Is the killer just lurking behind a tree for hours on end waiting for Ron's car to come? And besides, how would he get Ron to crash? It just stretches the imagination too much to think that Ron was purposefully killed. It stinks more like an accidental death caused by the letters. Just a chance occurence after the threats in the letter.\n\n-----------------------------------------------------------------------------\nMary's bus incident....now am I right in thinking that Mary was driving the bus *alone* when she noticed the sign? Are there any verified eyewitnesses who saw the sign on the road other than Mary? Unfortunately the story is always told more like an *old wives tale* than a documented criminal case, so it's hard to verify *anything* in the Circleville case. \n\nUnfortunately the story *does* sound like Mary might have had something to do with it, but one wonders about motive. If she *did* do it, on the face of it, she damn-near ruined her own life. Was it a guilty conscience because of the affair? Was it all just a histrionic cry for attention? Again, you have to stretch imagination. \n\n\nIn conclusion, I'd probably lean towards the 'prank that got out of hand' theory. I think the plot to kill Mary was perhaps Mary's way of dealing with the prank, and the prankster just claimed responsibility for it anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been fascinated by this for years. I&amp;#39;m working from memory so forgive me if some of what I say is a bit askew:&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m skeptical that this car crash is anything other than a car crash. I don&amp;#39;t think a fired gun is anything to be suspicious of. If anything, it makes me think that he may have fired it accidentally whilst driving, which led him to be startled and crash the car himself. &lt;/p&gt;\n\n&lt;p&gt;The reason I&amp;#39;m skeptical is that it would be damn near impossible to intercept him on his way to wherever he was going. How would the writer of the letter know that Ron would leave the house at that specific time, or take that specific route, or read the letter at that time? Is the killer just lurking behind a tree for hours on end waiting for Ron&amp;#39;s car to come? And besides, how would he get Ron to crash? It just stretches the imagination too much to think that Ron was purposefully killed. It stinks more like an accidental death caused by the letters. Just a chance occurence after the threats in the letter.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Mary&amp;#39;s bus incident....now am I right in thinking that Mary was driving the bus &lt;em&gt;alone&lt;/em&gt; when she noticed the sign? Are there any verified eyewitnesses who saw the sign on the road other than Mary? Unfortunately the story is always told more like an &lt;em&gt;old wives tale&lt;/em&gt; than a documented criminal case, so it&amp;#39;s hard to verify &lt;em&gt;anything&lt;/em&gt; in the Circleville case. &lt;/p&gt;\n\n&lt;p&gt;Unfortunately the story &lt;em&gt;does&lt;/em&gt; sound like Mary might have had something to do with it, but one wonders about motive. If she &lt;em&gt;did&lt;/em&gt; do it, on the face of it, she damn-near ruined her own life. Was it a guilty conscience because of the affair? Was it all just a histrionic cry for attention? Again, you have to stretch imagination. &lt;/p&gt;\n\n&lt;p&gt;In conclusion, I&amp;#39;d probably lean towards the &amp;#39;prank that got out of hand&amp;#39; theory. I think the plot to kill Mary was perhaps Mary&amp;#39;s way of dealing with the prank, and the prankster just claimed responsibility for it anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8z4y7", "score_hidden": false, "stickied": false, "created": 1492192872.0, "created_utc": 1492164072.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9d0ps", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "araradia", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "This reminds me of a short story I read where a writer is terrorizing a town and it ends up being the old lady narrator herself. Must have been inspired by this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This reminds me of a short story I read where a writer is terrorizing a town and it ends up being the old lady narrator herself. Must have been inspired by this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9d0ps", "score_hidden": false, "stickied": false, "created": 1492216062.0, "created_utc": 1492187262.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dgbairp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Solar_Pons", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Dang I wish I'd seen this post sooner!\n\nWhen I was a kid I remember being freaked out when I saw it on Unsolved Mysteries--the Circleville Writer had actually sent a letter to the UM crew (I guess they were filming there at the time) warning them to leave the then-sheriff alone and calling them among other things \"el sickos\" (\"you el sickos will pay\"). I thought it was so freaky that this would-be killer was actually threatening the show...I wonder if any of them looked over their shoulders a bit more afterwards? \n\nAt any rate, if anyone has watched the segment on UM (you can watch it for free if you don't mind seeing it as part of the Dennis Farina series on YouTube… It's season 4 episode 6) you'll note they interview a local journalist named Martin Yant. Recently someone on the sitcomsonline message boards actually got in touch with Yant, and discusses Yant's opinions on the case in a VERY interesting post which suggests, among other things, that Paul Freshour's ex-wife (he was getting divorced at the time) perhaps played a role in what occurred--certainly the taunting letters to Freshour in jail suggest someone didn't like him very much. \n\n[Here's the link!](http://www.sitcomsonline.com/boards/archive/index.php/t-348999.html) \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dang I wish I&amp;#39;d seen this post sooner!&lt;/p&gt;\n\n&lt;p&gt;When I was a kid I remember being freaked out when I saw it on Unsolved Mysteries--the Circleville Writer had actually sent a letter to the UM crew (I guess they were filming there at the time) warning them to leave the then-sheriff alone and calling them among other things &amp;quot;el sickos&amp;quot; (&amp;quot;you el sickos will pay&amp;quot;). I thought it was so freaky that this would-be killer was actually threatening the show...I wonder if any of them looked over their shoulders a bit more afterwards? &lt;/p&gt;\n\n&lt;p&gt;At any rate, if anyone has watched the segment on UM (you can watch it for free if you don&amp;#39;t mind seeing it as part of the Dennis Farina series on YouTube… It&amp;#39;s season 4 episode 6) you&amp;#39;ll note they interview a local journalist named Martin Yant. Recently someone on the sitcomsonline message boards actually got in touch with Yant, and discusses Yant&amp;#39;s opinions on the case in a VERY interesting post which suggests, among other things, that Paul Freshour&amp;#39;s ex-wife (he was getting divorced at the time) perhaps played a role in what occurred--certainly the taunting letters to Freshour in jail suggest someone didn&amp;#39;t like him very much. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.sitcomsonline.com/boards/archive/index.php/t-348999.html\"&gt;Here&amp;#39;s the link!&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgbairp", "score_hidden": false, "stickied": false, "created": 1492325059.0, "created_utc": 1492296259.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9hr2g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dorednmar", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Gaslighting techniques.Mental control thru fear.\nSomeone with military knowledge or background, or a special interest in those topics.\nMary is the victim here. Unfortunately, one can always find plenty of victim- blaming on this sub.", "edited": 1492192869.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gaslighting techniques.Mental control thru fear.\nSomeone with military knowledge or background, or a special interest in those topics.\nMary is the victim here. Unfortunately, one can always find plenty of victim- blaming on this sub.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9hr2g", "score_hidden": false, "stickied": false, "created": 1492221480.0, "created_utc": 1492192680.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dgd3lwt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JBirdSD", "parent_id": "t1_dg9h64o", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Agreed! I love a meaty post. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed! I love a meaty post. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgd3lwt", "score_hidden": false, "stickied": false, "created": 1492431614.0, "created_utc": 1492402814.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9h64o", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "tea-and-smoothies", "parent_id": "t1_dg8w39n", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "&gt; Should I have said 'Circleville guy writes notes someone dies and attempts another one too the rascal!' and left it at that?\n\nhahaha! Actually not a bad \"tl;dr\"!!  But most people on this sub love a meaty post, others can just go on to something else or write a post themselves :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Should I have said &amp;#39;Circleville guy writes notes someone dies and attempts another one too the rascal!&amp;#39; and left it at that?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;hahaha! Actually not a bad &amp;quot;tl;dr&amp;quot;!!  But most people on this sub love a meaty post, others can just go on to something else or write a post themselves :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9h64o", "score_hidden": false, "stickied": false, "created": 1492220804.0, "created_utc": 1492192004.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9kcde", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hellopaper1", "parent_id": "t1_dg99nfe", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "This was a great write-up. I thought as I was reading it how good it was. Your writing style is fantastic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was a great write-up. I thought as I was reading it how good it was. Your writing style is fantastic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9kcde", "score_hidden": false, "stickied": false, "created": 1492224567.0, "created_utc": 1492195767.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9nuty", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dorednmar", "parent_id": "t1_dg99nfe", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "i like your writing style, also.\n\n &gt;&gt;Reddit is a place to safely share opinions,  not to bully, harass, or tear people down on a personal level. That behavior brings degrades the entire community,  and it should be reported.&lt;&lt;", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i like your writing style, also.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Reddit is a place to safely share opinions,  not to bully, harass, or tear people down on a personal level. That behavior brings degrades the entire community,  and it should be reported.&amp;lt;&amp;lt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9nuty", "score_hidden": false, "stickied": false, "created": 1492228800.0, "created_utc": 1492200000.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99nfe", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ieatspacedust", "parent_id": "t1_dg97o9f", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thank you, sorry for the random drama! I appreciate your kind words. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, sorry for the random drama! I appreciate your kind words. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg99nfe", "score_hidden": false, "stickied": false, "created": 1492212229.0, "created_utc": 1492183429.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97o9f", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "haloarh", "parent_id": "t1_dg8wd23", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I appreciate your write-ups and enjoy your writing style. I know that a lot of other people do as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I appreciate your write-ups and enjoy your writing style. I know that a lot of other people do as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg97o9f", "score_hidden": false, "stickied": false, "created": 1492209781.0, "created_utc": 1492180981.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9ky1p", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg9j0ai", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9ky1p", "score_hidden": false, "stickied": false, "created": 1492225297.0, "created_utc": 1492196497.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9j0ai", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg9irbr", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "[removed]", "edited": 1492194993.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9j0ai", "score_hidden": false, "stickied": false, "created": 1492222969.0, "created_utc": 1492194169.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_6571nh", "likes": null, "replies": "", "user_reports": [], "id": "dg9maha", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg9klde", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9maha", "score_hidden": false, "stickied": false, "created": 1492226924.0, "created_utc": 1492198124.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9klde", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg9irbr", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9klde", "score_hidden": false, "stickied": false, "created": 1492224870.0, "created_utc": 1492196070.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9irbr", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8wd23", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9irbr", "score_hidden": false, "stickied": false, "created": 1492222672.0, "created_utc": 1492193872.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8wd23", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "ieatspacedust", "parent_id": "t1_dg8wbgj", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": ".....was that a point? \n\nThis sub has no place for trolling or criticising someone's write ups. Its for discussing the case. \n\nI work VERY hard writing these up. I'd appreciate it if you didn't make comments to tear me down. ", "edited": 1492155472.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;.....was that a point? &lt;/p&gt;\n\n&lt;p&gt;This sub has no place for trolling or criticising someone&amp;#39;s write ups. Its for discussing the case. &lt;/p&gt;\n\n&lt;p&gt;I work VERY hard writing these up. I&amp;#39;d appreciate it if you didn&amp;#39;t make comments to tear me down. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8wd23", "score_hidden": false, "stickied": false, "created": 1492184080.0, "created_utc": 1492155280.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8wbgj", "gilded": 0, "archived": false, "score": -13, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8w39n", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8wbgj", "score_hidden": false, "stickied": false, "created": 1492183952.0, "created_utc": 1492155152.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8w39n", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ieatspacedust", "parent_id": "t1_dg8slnk", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Please darling, explain. Should I have said 'Circleville guy writes notes someone dies and attempts another one too the rascal!' and left it at that?", "edited": 1492154784.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please darling, explain. Should I have said &amp;#39;Circleville guy writes notes someone dies and attempts another one too the rascal!&amp;#39; and left it at that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8w39n", "score_hidden": false, "stickied": false, "created": 1492183307.0, "created_utc": 1492154507.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8slnk", "gilded": 0, "archived": false, "score": -14, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_6571nh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8slnk", "score_hidden": false, "stickied": false, "created": 1492175298.0, "created_utc": 1492146498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -14}}], "after": null, "before": null}}]