[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "UnresolvedMysteries", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this case happened in 1992, in a city near where I live, in southern Brazil. I have family in this city, and one of my aunts actually knew the missing boy&amp;#39;s family, so, for us, it was kind of a big deal. It definitely did hit national news at the time, but I haven&amp;#39;t found anything about it in this sub, so I decided to tell the story. &lt;/p&gt;\n\n&lt;p&gt;Basically, a 6 year old boy went missing, and, after a dubious investigation, the wife and daughter of the mayor of the city were accused of ordering his murder in a black magic ritual. They confessed, but then, after that, started to swear their innocence, and reported being tortured so they would confess the crime. It was the longest trial of the Brazilian history, and it&amp;#39;s a quite controversial case, and, to this day, I don&amp;#39;t know what to believe. This might be really long, and I apologize for any mistakes, as English is not my native language.&lt;/p&gt;\n\n&lt;p&gt;I found only &lt;a href=\"http://www.tulsaworld.com/news/satanic-cult-killings-spread-fear-in-brazil/article_8740ae98-48e8-5773-8fac-6049ed826457.html\"&gt;one article in english&lt;/a&gt; about the case. I&amp;#39;ll link more at the end, but, unfortunately, they&amp;#39;ll be in portuguese only. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;An overlook of the case&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A 6 year old boy, Evandro Ramos Caetano, went missing on April 7th 1992, in the seaside town of Guaratuba - PR, in southern Brazil. Five days later, a mutilated body was found in a bush. The corpse was given as it were Evandro&amp;#39;s body, and the police concluded that he had been murdered in a ritual performed by the &amp;quot;pai de santo&amp;quot; (male priest of Umbanda or Candomblé, afro-brazilian religions) Osvaldo Marcineiro, with the help of Vicente de Paula, Davi dos Santos, Sergio Crithofolini e Airton Bardelli, ordered by Celina and Beatriz Abagge (wife and daughter of the then Mayor of the town, Aldo Abagge).&lt;/p&gt;\n\n&lt;p&gt;They were all arrested, and, after a confession, started to swear their innocence. In the confession, a black magic ritual was described in detail, in which the child was held by his hands and feet, while De Paula strangled him and cut his neck. Then the genitals and viscera were removed from the body, and the hands and feet cut off. &lt;/p&gt;\n\n&lt;p&gt;The brutal story took on frightening proportions when the accused began to report scenes of torture they would had been subjected to confessing to the crime. Through legal procedures the trials of those involved were successively postponed.  To this day, four of the seven people involved were considered guilty. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1992 - The crime&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In 1992, the Mayor of Guaratuba was Aldo Abagge. The family was well known and considered very wealthy. They also owned a sawmill in the city. &lt;/p&gt;\n\n&lt;p&gt;Maria Ramos Caetano, mother of the missing boy, Evandro Ramos Caetano, worked as a secretary in a public school run by the city hall. She worked on mornings and Evandro went to school on afternoons. So, she usually took him with her when she went to work, because she didn&amp;#39;t have anyone to take care of him while she was working.&lt;/p&gt;\n\n&lt;p&gt;In the morning of the crime, April 6th 1992, he was with her at the school, as always. They lived less than 100 meters from the school, and it was a small town so, when, around 10 AM he complained that he was feeling hungry, his mother gave him the house key and told him to go get something to eat at home. &lt;/p&gt;\n\n&lt;p&gt;He didn&amp;#39;t return to the school, and, when she got off work and went home, she saw that he wasn&amp;#39;t there too. She noted that he probably hadn&amp;#39;t even got home, because it seemed like nothing had been touched. So, he probably disappeared in the way home from school. His disappearance caused a commotion in the town, police was involved, everyone was looking for him. A witness said that she saw a boy getting in a car at the place and time he was believed to had been kidnapped.&lt;/p&gt;\n\n&lt;p&gt;Saturday, April 11th 1992, five days after he disappeared, a body was found in a bush. Some construction workers noted vultures in the area, and went to check out what was happening, finding the body of a child, laying in its back, with two straight cuts in the chest and nothing in its interior. His hands and feet were cut off, his scalp was removed and his eyes were missing. There were also some other lesions. He was wearing only a pair of shorts, and there was a key chain next to the body. The police was called, and, later, Evandro&amp;#39;s parents recognized the body as their son&amp;#39;s.  The shorts were the same that he was wearing, and the key chain was the one from the key to their home. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1992 - The Investigation&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Several evidence was found to support the black magic theory. Some believe that police was led to believe in that by Diogenes Caetano, cousin of Evandro&amp;#39;s father, and son of a former mayor of the town who had a personal grudge towards the Abagge&amp;#39;s family. That&amp;#39;s where the controversy begins. I&amp;#39;ll just present what was found and what the police believed was true at the time, and try to be as impartial as I can. It&amp;#39;s really hard to find reliable information, because the case is very controversial and the visions are so polarized that the articles will almost always tend to one side or the other, and it&amp;#39;s very hard to know that to believe.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;The witness who saw a boy getting into a car at the same time and place Evandro disappeared confirmed that the car was the same color and model as Celina&amp;#39;s. But her testimony was then ruled out of the investigation because she had history of drug use.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The body was recognized as Evandro by the parents. The clothes were the same as his, and the key was found near the body. There is a DNA report that says the body is Evandro&amp;#39;s, as well as a dental arch match. Yet, there were controversial reports during the investigation. It was said that the body didn&amp;#39;t match Evandro&amp;#39;s age, that it must had been an older boy. Other report said that the corpse estimated time of death didn&amp;#39;t match Evandro&amp;#39;s disappearance time, and that boy was dead for a longer time. The inconsistency in the investigation, and the controversy about whose body&amp;#39;s it was is very important in the story.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Police believed that Beatriz Abagge was having an affair with &amp;quot;pai de santo&amp;quot; Osvaldo Marcineiro. It is said that this was no secret and &amp;quot;the whole town knew that&amp;quot;.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A witness said that, in the rituals Osvaldo performed, he was known to do to animal bodies the same kind of mutilation that was made in Evandro&amp;#39;s body (taking out the viscera, removing the scalp, the genitals and the eyes, cutting off hands and feet). &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The city hall prohibited the papers to talk about the case initially. Some people believe they were concerned about the town&amp;#39;s reputation, but others believe this was the Abagge&amp;#39;s family way of trying to cover up what was happening.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A witness saw a black car in the street the body was found several times that week. It was believed that car belonged to Osvald Marcineiro, or one of his associates. This same witness claim that in the night of April 8, two cars parked very quickly in the street where the body was found. A woman, identified as Celina Abagge, left one of the cars and got inside of the other. Then, both of the cars left.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;They believed that the crime was committed in the Abagge&amp;#39;s family sawmill. In the location, some objects linked to black magic rituals and Afro-Brazillian religions were found. There was human blood in some of the objects, but it was never confirmed that the blood was Evandro&amp;#39;s.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Osvaldo Marcineiro and some of his associates were arrested in July 1st 1992, and confessed to have committed the crime. They pointed Celina and Beatriz as the ones who ordered the crime.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;On July 1992, police invaded the Abagge&amp;#39;s home and arrested Celina and Beatriz. The case gained national repercussion, and they started to be known as &amp;quot;The Witches from Guaratuba&amp;quot;. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Celina and Beatriz confessed to participate in Evandro&amp;#39;s murder, in a tape recorded by the police. The confession is said to be &amp;quot;very detailed&amp;quot;. Yet, two months after the confession, they claimed to have been tortured by the police to confess. A report states that there were found bruises on Beatriz&amp;#39;s body, but there was no sign further of torture. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Diogenes Caetano is said to had been involved in the investigation since the beginning. He said that &amp;quot;everybody knew that she [Celina] was involved with black magic stuff for a while&amp;quot;. It&amp;#39;s said that he has a personal grudge against Celina, so his view of the story might not be impartial because of that, and, to those who believe the Abagge&amp;#39;s innocence, he&amp;#39;s the &amp;quot;villan&amp;quot; of the story, who led the police to believe his own delusion. He even wrote a book called &amp;quot;A Verdadeira História do Caso Evandro&amp;quot; (The truth about Evandro&amp;#39;s case), that tells, in detail, what he and the family of the victim believe to be true.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There are several interviews with Beatriz and Celina, in which they cry and talk about having been tortured physically, psychologically and sexually by the police to confess the crime. Celina even argues that Diogenes was involved in those tortures, and that she remembers being in the trunk of his car, being taken to his father&amp;#39;s house. They say that Osvaldo and the other men were also tortured to point them as the orderers of the crime. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Celina and Beatriz spent 3 years and nine months in prison, and other 3 years in home prison until the first trial, in 1998.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;1998 - The first trial&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In 1998, Celina and Beatriz were judged not guilty by a popular jury. The jurors understood that there was no concrete evidence that the body found in a bush was Evandro&amp;#39;s. In spite of the sentence, the judge determined, at the time, a new investigation to ascertain the identity of the corpse and the conditions of the death. It has never been known whether this determination was adhered to.&lt;/p&gt;\n\n&lt;p&gt;The prosecutor was not satisfied with the decision and assured that he would appeal and obtain the annulment of the jury. The parents were also desolated, and affirmed that they had recognized the body of their son and protested against the result. Finally, Celina and Beatriz left the courtroom as innocent women, celebrating the sentence.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2003 - The second trial&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;On September 4th 2003 the jury that acquitted Celina and Beatriz was annulled. The annulment occurred because the decision of the jurors was contrary to the evidence in the case. The jurors didn&amp;#39;t recognize the corpse found to be Evandro&amp;#39;s. But the matter was further examined and it was concluded that the jury&amp;#39;s decision is manifestly contrary to the evidence in the case file, since there were reports of dental examinations and DNA - this resulted in 99,99% positive - scientifically proving the identity of the corpse.&lt;/p&gt;\n\n&lt;p&gt;According to the defense, among the reports presented during the trial, there was a necropsy examination that denied that the body found was Evandro&amp;#39;s and based on this document the jurors decided for the acquittal of the defendants.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2004 - The third trial&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Three of the five men involved were found guilty by the jury on the night of April 26th 2004. &amp;quot;Pai de santo&amp;quot; Osvaldo Marcineiro, 43, and the painter Vicente de Paula Ferreira, 54, were sentenced to 20 years and 2 months. The third accused, the craftsman Davi dos Santos Soares, 42, was acquitted of the crime of abduction, but guilty of the murder. His sentence was stipulated in 18 years and 8 months in prison. The three men were handcuffed straight to the prison after the trial.&lt;/p&gt;\n\n&lt;p&gt;The argument most used by defense lawyers was that the only evidence that existed was the confessions of the accused, which they said were obtained by the police through torture.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2011 - Fourth Trial&lt;/strong&gt;\nBeatriz was judged again. At the time, Celina, Beatriz&amp;#39;s mother, wasn&amp;#39;t judged. The Brazilian law establishes that the maximum period of prescription of a crime is 20 years and that, when the defendant turns 70, the term counts in half, which is the case of Beatriz&amp;#39;s mother. As more than ten years elapsed between the trials, Celina can no longer be punished for this crime.&lt;/p&gt;\n\n&lt;p&gt;Beatriz Abagge was sentenced on Saturday, May 28th 2011 by the jurors in the Court of Jury, for the death of the boy Evandro Ramos Caetano, that took place in 1992, in Guaratuba. Voting was tight: 4 x 3. Evandro&amp;#39;s mother, Maria Ramos Caetano, declared at the end of the trial that justice was finally done and believes that now the son&amp;#39;s soul will rest in peace.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;But... what really happened?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a very controversial case, and opinions are divided. The media coverage paints Celina and Beatriz Abagge as poor innocent women who were falsely accused of a crime they didn&amp;#39;t commit. Almost every article about the case is very partial, and takes the side of the defense. But the family of the missing boy is very sure about the Abagge&amp;#39;s guilt.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1st Theory -&lt;/strong&gt; Celina and Beatriz Abagge are innocent, and the police was led to believe they committed the crime. For people who believe this story, a staging was set up with the intention of harming the Abagge family. The mayor of Guaratuba at the time, was the father of Beatriz and husband of Celina, and was also suspected of the crime. It&amp;#39;s believed that the true responsible for this is Diogenes Caetano, who grew up believing that the reason his parents divorced was an extra marital affair his father, also a former mayor of Guaratuba, had with Celina Abagge when he was still a teenager. These people believe that, motived by revenge, he led the police to error, and, after that, the investigation had no return. The confessions signed by Beatriz and Celina are believed to have been obtained under torture. They think Evandro may have been kidnapped to, to be sold abroad by gangs that, at the time, practiced this type of crime in the region. Another boy had also disappeared in the town earlier in 1992, named Leandro Bossi.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2nd Theory -&lt;/strong&gt; Celina and Beatriz Abagge are guilty. They asked for a ritual of black magic to Osvaldo Marcineiro, a &amp;quot;pai de santo&amp;quot; who had lived in Guaratuba, to bring money and prosperity to the family, because the Abagge business was in difficulties. They would have kidnapped the boy, who was held for 24 hours gagged and then killed inside the Abagge family sawmill. Evandro had his hands, feet and ears cut off, being found without the viscera and without the scalp, in an advanced state of putrefaction, in a brush near the Abagge house. Clay objects that would have been used in the ritual were found in the sawmill. They confessed the crime.&lt;/p&gt;\n\n&lt;p&gt;I, personaly, have no idea. I realize the whole case may sound ridiculous to someone outside of the country, but a person asking for a black magic ritual is actually very believable here in Brazil, even more like 25 years ago. I must say, Afro Brazillian religions have nothing to do with black magic rituals and the murder of children, they are very popular and very legitimate religions with tons of followers here, and I&amp;#39;m not saying that all of this people are murderers and &amp;quot;witches&amp;quot;. But, you know, there&amp;#39;s crazy people everywhere. I&amp;#39;m just saying that rituals to spirits (what they call &amp;quot;trabalhos&amp;quot; or &amp;quot;macumba&amp;quot; here) are really a thing and very popular. So it&amp;#39;s not crazy to believe that someone would order a ritual asking for money and prosperity, as people do this all the time. Killing a child in the process is, in fact, not common, and very sick and weird. But, like I said, psychos are everywhere. People have killed and still do in the name of various religions, so, it&amp;#39;s not that hard to believe that this could have happened.&lt;/p&gt;\n\n&lt;p&gt;But the way the crime was investigated was, indeed, very skecthy. It&amp;#39;s hard to know what&amp;#39;s true and what&amp;#39;s not, because, like I said, the media took sides on this case and usually only tells the Abagge&amp;#39;s family side of the story, painting what happened to them as a terrible tragedy, and almost forgetting the pain of the missing boy&amp;#39;s family. The only way you can have access to the other side of the story is through the book written by Diogenes Caetano Filho, cousin of Evandro&amp;#39;s father. But, as it was explained, many people believe that his view of the case is also very partial, as he has a personal vendetta with the Abagge family. &lt;/p&gt;\n\n&lt;p&gt;But, if the Abagge&amp;#39;s are innocent, then who killed Evandro? If the body is not Evandro&amp;#39;s body, then who is it? If Evandro was not killed, then where is he? If it wasn&amp;#39;t a satanic ritual, then who killed a child, cut off his hands and feet, removed his eyes, his scalp, his genitals and his viscera? And why would anyone do that? Also... if the family is porposefully trying to blame the Abagge&amp;#39;s even knowing they didn&amp;#39;t do it, why? Is the personal grudge more important than finding who really did kill Evandro? &lt;/p&gt;\n\n&lt;p&gt;So many questions. I&amp;#39;d love to hear some opinions. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Some Links (in portuguese)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.gabrielasoudapaz.org/memorial/303-Evandro-Ramos-Caetano.htm\"&gt;collection of news about the case through the years&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://istoe.com.br/133790_AS+BRUXAS+DE+GUARATUBA/\"&gt;Interview with the Abagge&amp;#39;s where they claim their innocence&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.fabiocampana.com.br/2011/05/delegado-diz-que-caso-evandro-foi-uma-farsa-para-acusar-familia-abagge/comment-page-1/\"&gt;Interview with a police officer who says the case is a farce&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://books.google.com.br/books?id=PAEx__zN4hsC&amp;amp;pg=PA49&amp;amp;lpg=PA50&amp;amp;focus=viewport&amp;amp;dq=%22caso+evandro%22+*+o+globo&amp;amp;hl=pt-BR#v=onepage&amp;amp;q&amp;amp;f=false\"&gt;Book Evandro&amp;#39;s uncle wrote about the family&amp;#39;s view of what happened - only parts are avaliable online&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://pr.ricmais.com.br/balanco-geral-curitiba/videos/familia-do-garoto-evandro-desabafa-24-anos-apos-o-crime-em-guaratuba/\"&gt;Video interview with Evandro&amp;#39;s family asking for justice&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://sao-paulo.estadao.com.br/noticias/geral,o-juri-da-bruxa-de-guaratuba-imp-,725252\"&gt;National news about Beatriz Abagge being condemmed in 2011&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://soundcloud.com/projetohumanos/o-caso-evandro-trailer-s04\"&gt;A very cool podcast about the case, with interviews and even audios of the confession tapes&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So this case happened in 1992, in a city near where I live, in southern Brazil. I have family in this city, and one of my aunts actually knew the missing boy's family, so, for us, it was kind of a big deal. It definitely did hit national news at the time, but I haven't found anything about it in this sub, so I decided to tell the story. \n\nBasically, a 6 year old boy went missing, and, after a dubious investigation, the wife and daughter of the mayor of the city were accused of ordering his murder in a black magic ritual. They confessed, but then, after that, started to swear their innocence, and reported being tortured so they would confess the crime. It was the longest trial of the Brazilian history, and it's a quite controversial case, and, to this day, I don't know what to believe. This might be really long, and I apologize for any mistakes, as English is not my native language.\n\nI found only [one article in english](http://www.tulsaworld.com/news/satanic-cult-killings-spread-fear-in-brazil/article_8740ae98-48e8-5773-8fac-6049ed826457.html) about the case. I'll link more at the end, but, unfortunately, they'll be in portuguese only. \n\n**An overlook of the case**\n\nA 6 year old boy, Evandro Ramos Caetano, went missing on April 7th 1992, in the seaside town of Guaratuba - PR, in southern Brazil. Five days later, a mutilated body was found in a bush. The corpse was given as it were Evandro's body, and the police concluded that he had been murdered in a ritual performed by the \"pai de santo\" (male priest of Umbanda or Candomblé, afro-brazilian religions) Osvaldo Marcineiro, with the help of Vicente de Paula, Davi dos Santos, Sergio Crithofolini e Airton Bardelli, ordered by Celina and Beatriz Abagge (wife and daughter of the then Mayor of the town, Aldo Abagge).\n\nThey were all arrested, and, after a confession, started to swear their innocence. In the confession, a black magic ritual was described in detail, in which the child was held by his hands and feet, while De Paula strangled him and cut his neck. Then the genitals and viscera were removed from the body, and the hands and feet cut off. \n\nThe brutal story took on frightening proportions when the accused began to report scenes of torture they would had been subjected to confessing to the crime. Through legal procedures the trials of those involved were successively postponed.  To this day, four of the seven people involved were considered guilty. \n\n**1992 - The crime**\n\nIn 1992, the Mayor of Guaratuba was Aldo Abagge. The family was well known and considered very wealthy. They also owned a sawmill in the city. \n\nMaria Ramos Caetano, mother of the missing boy, Evandro Ramos Caetano, worked as a secretary in a public school run by the city hall. She worked on mornings and Evandro went to school on afternoons. So, she usually took him with her when she went to work, because she didn't have anyone to take care of him while she was working.\n\nIn the morning of the crime, April 6th 1992, he was with her at the school, as always. They lived less than 100 meters from the school, and it was a small town so, when, around 10 AM he complained that he was feeling hungry, his mother gave him the house key and told him to go get something to eat at home. \n\nHe didn't return to the school, and, when she got off work and went home, she saw that he wasn't there too. She noted that he probably hadn't even got home, because it seemed like nothing had been touched. So, he probably disappeared in the way home from school. His disappearance caused a commotion in the town, police was involved, everyone was looking for him. A witness said that she saw a boy getting in a car at the place and time he was believed to had been kidnapped.\n\nSaturday, April 11th 1992, five days after he disappeared, a body was found in a bush. Some construction workers noted vultures in the area, and went to check out what was happening, finding the body of a child, laying in its back, with two straight cuts in the chest and nothing in its interior. His hands and feet were cut off, his scalp was removed and his eyes were missing. There were also some other lesions. He was wearing only a pair of shorts, and there was a key chain next to the body. The police was called, and, later, Evandro's parents recognized the body as their son's.  The shorts were the same that he was wearing, and the key chain was the one from the key to their home. \n\n**1992 - The Investigation**\n\nSeveral evidence was found to support the black magic theory. Some believe that police was led to believe in that by Diogenes Caetano, cousin of Evandro's father, and son of a former mayor of the town who had a personal grudge towards the Abagge's family. That's where the controversy begins. I'll just present what was found and what the police believed was true at the time, and try to be as impartial as I can. It's really hard to find reliable information, because the case is very controversial and the visions are so polarized that the articles will almost always tend to one side or the other, and it's very hard to know that to believe.\n\n* The witness who saw a boy getting into a car at the same time and place Evandro disappeared confirmed that the car was the same color and model as Celina's. But her testimony was then ruled out of the investigation because she had history of drug use.\n \n* The body was recognized as Evandro by the parents. The clothes were the same as his, and the key was found near the body. There is a DNA report that says the body is Evandro's, as well as a dental arch match. Yet, there were controversial reports during the investigation. It was said that the body didn't match Evandro's age, that it must had been an older boy. Other report said that the corpse estimated time of death didn't match Evandro's disappearance time, and that boy was dead for a longer time. The inconsistency in the investigation, and the controversy about whose body's it was is very important in the story.\n\n* Police believed that Beatriz Abagge was having an affair with \"pai de santo\" Osvaldo Marcineiro. It is said that this was no secret and \"the whole town knew that\".\n\n*  A witness said that, in the rituals Osvaldo performed, he was known to do to animal bodies the same kind of mutilation that was made in Evandro's body (taking out the viscera, removing the scalp, the genitals and the eyes, cutting off hands and feet). \n\n* The city hall prohibited the papers to talk about the case initially. Some people believe they were concerned about the town's reputation, but others believe this was the Abagge's family way of trying to cover up what was happening.\n\n* A witness saw a black car in the street the body was found several times that week. It was believed that car belonged to Osvald Marcineiro, or one of his associates. This same witness claim that in the night of April 8, two cars parked very quickly in the street where the body was found. A woman, identified as Celina Abagge, left one of the cars and got inside of the other. Then, both of the cars left.\n\n* They believed that the crime was committed in the Abagge's family sawmill. In the location, some objects linked to black magic rituals and Afro-Brazillian religions were found. There was human blood in some of the objects, but it was never confirmed that the blood was Evandro's.\n\n* Osvaldo Marcineiro and some of his associates were arrested in July 1st 1992, and confessed to have committed the crime. They pointed Celina and Beatriz as the ones who ordered the crime.\n\n* On July 1992, police invaded the Abagge's home and arrested Celina and Beatriz. The case gained national repercussion, and they started to be known as \"The Witches from Guaratuba\". \n\n* Celina and Beatriz confessed to participate in Evandro's murder, in a tape recorded by the police. The confession is said to be \"very detailed\". Yet, two months after the confession, they claimed to have been tortured by the police to confess. A report states that there were found bruises on Beatriz's body, but there was no sign further of torture. \n\n* Diogenes Caetano is said to had been involved in the investigation since the beginning. He said that \"everybody knew that she [Celina] was involved with black magic stuff for a while\". It's said that he has a personal grudge against Celina, so his view of the story might not be impartial because of that, and, to those who believe the Abagge's innocence, he's the \"villan\" of the story, who led the police to believe his own delusion. He even wrote a book called \"A Verdadeira História do Caso Evandro\" (The truth about Evandro's case), that tells, in detail, what he and the family of the victim believe to be true.\n\n* There are several interviews with Beatriz and Celina, in which they cry and talk about having been tortured physically, psychologically and sexually by the police to confess the crime. Celina even argues that Diogenes was involved in those tortures, and that she remembers being in the trunk of his car, being taken to his father's house. They say that Osvaldo and the other men were also tortured to point them as the orderers of the crime. \n\n* Celina and Beatriz spent 3 years and nine months in prison, and other 3 years in home prison until the first trial, in 1998.\n\n**1998 - The first trial**\n\nIn 1998, Celina and Beatriz were judged not guilty by a popular jury. The jurors understood that there was no concrete evidence that the body found in a bush was Evandro's. In spite of the sentence, the judge determined, at the time, a new investigation to ascertain the identity of the corpse and the conditions of the death. It has never been known whether this determination was adhered to.\n\nThe prosecutor was not satisfied with the decision and assured that he would appeal and obtain the annulment of the jury. The parents were also desolated, and affirmed that they had recognized the body of their son and protested against the result. Finally, Celina and Beatriz left the courtroom as innocent women, celebrating the sentence.\n\n**2003 - The second trial**\n\nOn September 4th 2003 the jury that acquitted Celina and Beatriz was annulled. The annulment occurred because the decision of the jurors was contrary to the evidence in the case. The jurors didn't recognize the corpse found to be Evandro's. But the matter was further examined and it was concluded that the jury's decision is manifestly contrary to the evidence in the case file, since there were reports of dental examinations and DNA - this resulted in 99,99% positive - scientifically proving the identity of the corpse.\n\nAccording to the defense, among the reports presented during the trial, there was a necropsy examination that denied that the body found was Evandro's and based on this document the jurors decided for the acquittal of the defendants.\n\n**2004 - The third trial**\n\nThree of the five men involved were found guilty by the jury on the night of April 26th 2004. \"Pai de santo\" Osvaldo Marcineiro, 43, and the painter Vicente de Paula Ferreira, 54, were sentenced to 20 years and 2 months. The third accused, the craftsman Davi dos Santos Soares, 42, was acquitted of the crime of abduction, but guilty of the murder. His sentence was stipulated in 18 years and 8 months in prison. The three men were handcuffed straight to the prison after the trial.\n\nThe argument most used by defense lawyers was that the only evidence that existed was the confessions of the accused, which they said were obtained by the police through torture.\n\n**2011 - Fourth Trial**\nBeatriz was judged again. At the time, Celina, Beatriz's mother, wasn't judged. The Brazilian law establishes that the maximum period of prescription of a crime is 20 years and that, when the defendant turns 70, the term counts in half, which is the case of Beatriz's mother. As more than ten years elapsed between the trials, Celina can no longer be punished for this crime.\n\nBeatriz Abagge was sentenced on Saturday, May 28th 2011 by the jurors in the Court of Jury, for the death of the boy Evandro Ramos Caetano, that took place in 1992, in Guaratuba. Voting was tight: 4 x 3. Evandro's mother, Maria Ramos Caetano, declared at the end of the trial that justice was finally done and believes that now the son's soul will rest in peace.\n\n**But... what really happened?**\n\nIt's a very controversial case, and opinions are divided. The media coverage paints Celina and Beatriz Abagge as poor innocent women who were falsely accused of a crime they didn't commit. Almost every article about the case is very partial, and takes the side of the defense. But the family of the missing boy is very sure about the Abagge's guilt.  \n\n**1st Theory -** Celina and Beatriz Abagge are innocent, and the police was led to believe they committed the crime. For people who believe this story, a staging was set up with the intention of harming the Abagge family. The mayor of Guaratuba at the time, was the father of Beatriz and husband of Celina, and was also suspected of the crime. It's believed that the true responsible for this is Diogenes Caetano, who grew up believing that the reason his parents divorced was an extra marital affair his father, also a former mayor of Guaratuba, had with Celina Abagge when he was still a teenager. These people believe that, motived by revenge, he led the police to error, and, after that, the investigation had no return. The confessions signed by Beatriz and Celina are believed to have been obtained under torture. They think Evandro may have been kidnapped to, to be sold abroad by gangs that, at the time, practiced this type of crime in the region. Another boy had also disappeared in the town earlier in 1992, named Leandro Bossi.\n\n**2nd Theory -** Celina and Beatriz Abagge are guilty. They asked for a ritual of black magic to Osvaldo Marcineiro, a \"pai de santo\" who had lived in Guaratuba, to bring money and prosperity to the family, because the Abagge business was in difficulties. They would have kidnapped the boy, who was held for 24 hours gagged and then killed inside the Abagge family sawmill. Evandro had his hands, feet and ears cut off, being found without the viscera and without the scalp, in an advanced state of putrefaction, in a brush near the Abagge house. Clay objects that would have been used in the ritual were found in the sawmill. They confessed the crime.\n\nI, personaly, have no idea. I realize the whole case may sound ridiculous to someone outside of the country, but a person asking for a black magic ritual is actually very believable here in Brazil, even more like 25 years ago. I must say, Afro Brazillian religions have nothing to do with black magic rituals and the murder of children, they are very popular and very legitimate religions with tons of followers here, and I'm not saying that all of this people are murderers and \"witches\". But, you know, there's crazy people everywhere. I'm just saying that rituals to spirits (what they call \"trabalhos\" or \"macumba\" here) are really a thing and very popular. So it's not crazy to believe that someone would order a ritual asking for money and prosperity, as people do this all the time. Killing a child in the process is, in fact, not common, and very sick and weird. But, like I said, psychos are everywhere. People have killed and still do in the name of various religions, so, it's not that hard to believe that this could have happened.\n\nBut the way the crime was investigated was, indeed, very skecthy. It's hard to know what's true and what's not, because, like I said, the media took sides on this case and usually only tells the Abagge's family side of the story, painting what happened to them as a terrible tragedy, and almost forgetting the pain of the missing boy's family. The only way you can have access to the other side of the story is through the book written by Diogenes Caetano Filho, cousin of Evandro's father. But, as it was explained, many people believe that his view of the case is also very partial, as he has a personal vendetta with the Abagge family. \n\nBut, if the Abagge's are innocent, then who killed Evandro? If the body is not Evandro's body, then who is it? If Evandro was not killed, then where is he? If it wasn't a satanic ritual, then who killed a child, cut off his hands and feet, removed his eyes, his scalp, his genitals and his viscera? And why would anyone do that? Also... if the family is porposefully trying to blame the Abagge's even knowing they didn't do it, why? Is the personal grudge more important than finding who really did kill Evandro? \n\nSo many questions. I'd love to hear some opinions. \n\n**Some Links (in portuguese)**\n\n[collection of news about the case through the years] (http://www.gabrielasoudapaz.org/memorial/303-Evandro-Ramos-Caetano.htm)\n\n[Interview with the Abagge's where they claim their innocence](http://istoe.com.br/133790_AS+BRUXAS+DE+GUARATUBA/)\n\n[Interview with a police officer who says the case is a farce]( http://www.fabiocampana.com.br/2011/05/delegado-diz-que-caso-evandro-foi-uma-farsa-para-acusar-familia-abagge/comment-page-1/)\n\n[Book Evandro's uncle wrote about the family's view of what happened - only parts are avaliable online] (https://books.google.com.br/books?id=PAEx__zN4hsC&amp;pg=PA49&amp;lpg=PA50&amp;focus=viewport&amp;dq=%22caso+evandro%22+*+o+globo&amp;hl=pt-BR#v=onepage&amp;q&amp;f=false)\n\n[Video interview with Evandro's family asking for justice](https://pr.ricmais.com.br/balanco-geral-curitiba/videos/familia-do-garoto-evandro-desabafa-24-anos-apos-o-crime-em-guaratuba/)\n\n[National news about Beatriz Abagge being condemmed in 2011](http://sao-paulo.estadao.com.br/noticias/geral,o-juri-da-bruxa-de-guaratuba-imp-,725252)\n\n[A very cool podcast about the case, with interviews and even audios of the confession tapes](https://soundcloud.com/projetohumanos/o-caso-evandro-trailer-s04)\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657wnz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 60, "report_reasons": null, "author": "magicbeings", "saved": false, "mod_reports": [], "name": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "approved_by": null, "over_18": false, "domain": "self.UnresolvedMysteries", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2wvvc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/UnresolvedMysteries/comments/657wnz/6yearold_boy_goes_missing_in_brazil_in_1992_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492142435.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/657wnz/6yearold_boy_goes_missing_in_brazil_in_1992_and/", "author_flair_text": null, "quarantine": false, "title": "6-year-old boy goes missing in Brazil in 1992, and his death is attributed to a black magic ritual. Case known as \"The Witches of Guaratuba\".", "created_utc": 1492113635.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 25, "visited": false, "subreddit_type": "public", "ups": 60}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dg8u2sz", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "amuckinwa", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Wow, how sad for his parents to know their son was so badly mutilated. I have no idea what to think about all of the trails. Great post! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, how sad for his parents to know their son was so badly mutilated. I have no idea what to think about all of the trails. Great post! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8u2sz", "score_hidden": false, "stickied": false, "created": 1492178297.0, "created_utc": 1492149497.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dg9nfdq", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "magicbeings", "parent_id": "t1_dg90goy", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Yes, I wouldn't say it's a common everyday thing here, but it does happen. It's terrible. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I wouldn&amp;#39;t say it&amp;#39;s a common everyday thing here, but it does happen. It&amp;#39;s terrible. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9nfdq", "score_hidden": false, "stickied": false, "created": 1492228289.0, "created_utc": 1492199489.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90goy", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "rain_dragon", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thanks for writing this up. You did a great job, and it's very interesting. Years ago, I read a book called \"The Highest Altar\" by Patrick Tierney about the history of human sacrifice in South America. The author put forth a lot of evidence for child sacrifice still happening in the region and led off with a re-telling of a well documented case of child sacrifice following the Valdivia earthquake in Chile in 1960 so it's not hard to believe it could happen in other similar areas.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for writing this up. You did a great job, and it&amp;#39;s very interesting. Years ago, I read a book called &amp;quot;The Highest Altar&amp;quot; by Patrick Tierney about the history of human sacrifice in South America. The author put forth a lot of evidence for child sacrifice still happening in the region and led off with a re-telling of a well documented case of child sacrifice following the Valdivia earthquake in Chile in 1960 so it&amp;#39;s not hard to believe it could happen in other similar areas.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg90goy", "score_hidden": false, "stickied": false, "created": 1492197003.0, "created_utc": 1492168203.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dg9nkp5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "magicbeings", "parent_id": "t1_dg994rl", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thank you! \nYes, surely it wasn't the most reliable investigation, and, since so much time has passed, I doubt someone will ever find out what really happen. But I do think that the boy's family genuinelly believe that those women did it, I don't think they accused them because they are evil or trying to do something bad on purpose. They might be wrong, but they do think they're right, I think. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! \nYes, surely it wasn&amp;#39;t the most reliable investigation, and, since so much time has passed, I doubt someone will ever find out what really happen. But I do think that the boy&amp;#39;s family genuinelly believe that those women did it, I don&amp;#39;t think they accused them because they are evil or trying to do something bad on purpose. They might be wrong, but they do think they&amp;#39;re right, I think. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9nkp5", "score_hidden": false, "stickied": false, "created": 1492228467.0, "created_utc": 1492199667.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg994rl", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "fakedaisies", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Fantastic write-up. No need to apologize for your English; this was well-written and very easy to follow. Certainly a damn sight better than anything I could've tried to write in Portuguese ;)\n\nAs for the case itself... Wow. It certainly sounds like the two women were railroaded. I don't know who actually killed Evandro, but it sounds like there was an awful lot of investigative tunnel vision here. Very sad case all around; beneath the media circus and the wild accusations there is a little boy who died a terrible death and a family that I imagine will never know real closure or peace.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fantastic write-up. No need to apologize for your English; this was well-written and very easy to follow. Certainly a damn sight better than anything I could&amp;#39;ve tried to write in Portuguese ;)&lt;/p&gt;\n\n&lt;p&gt;As for the case itself... Wow. It certainly sounds like the two women were railroaded. I don&amp;#39;t know who actually killed Evandro, but it sounds like there was an awful lot of investigative tunnel vision here. Very sad case all around; beneath the media circus and the wild accusations there is a little boy who died a terrible death and a family that I imagine will never know real closure or peace.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg994rl", "score_hidden": false, "stickied": false, "created": 1492211607.0, "created_utc": 1492182807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dg9nwpx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "magicbeings", "parent_id": "t1_dg9bkjp", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Like I said, there were some contradicting reports, saying the body was of an older boy, or that it had been dead for longer. Some even say it was a girl. I don't know which ones are just rumors, which are true, and if they are reliable. Maybe the DNA test they did 25 years ago is not as reliable? I don't know. But sure there's some evidence pointing the body is not Evandro's, because they were considered not guilty on the firt trial based on that. \nI, myself, think the boy is Evandro. Because, well, it had to be SOMEONE, right. Some child died in that horrible way about the same time he went missing. It's a small town, there weren't many kids missing. And he never showed up again, so there's a big chance that he's dead. So, idk, I'm pretty sure it is him. But some people are sure that he's alive still.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like I said, there were some contradicting reports, saying the body was of an older boy, or that it had been dead for longer. Some even say it was a girl. I don&amp;#39;t know which ones are just rumors, which are true, and if they are reliable. Maybe the DNA test they did 25 years ago is not as reliable? I don&amp;#39;t know. But sure there&amp;#39;s some evidence pointing the body is not Evandro&amp;#39;s, because they were considered not guilty on the firt trial based on that. \nI, myself, think the boy is Evandro. Because, well, it had to be SOMEONE, right. Some child died in that horrible way about the same time he went missing. It&amp;#39;s a small town, there weren&amp;#39;t many kids missing. And he never showed up again, so there&amp;#39;s a big chance that he&amp;#39;s dead. So, idk, I&amp;#39;m pretty sure it is him. But some people are sure that he&amp;#39;s alive still.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9nwpx", "score_hidden": false, "stickied": false, "created": 1492228862.0, "created_utc": 1492200062.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9bkjp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Iownamovingcastle", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thanks for this post. I always like hearing about cases that would otherwise be out of my reach because I don't speak the language. Unfortunately, I do not think this case will ever be solved for real. It seems like there was too much confusion and manipulation right from the start so I am not even sure where actual law enforcement would start. \n\nThe confusion over the body jumps out to me though-if they did dentals and DNA why would there be any question? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for this post. I always like hearing about cases that would otherwise be out of my reach because I don&amp;#39;t speak the language. Unfortunately, I do not think this case will ever be solved for real. It seems like there was too much confusion and manipulation right from the start so I am not even sure where actual law enforcement would start. &lt;/p&gt;\n\n&lt;p&gt;The confusion over the body jumps out to me though-if they did dentals and DNA why would there be any question? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9bkjp", "score_hidden": false, "stickied": false, "created": 1492214472.0, "created_utc": 1492185672.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dg9o4mv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "magicbeings", "parent_id": "t1_dg9m5oy", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "There's reason to doubt it, because, like I said, there are some contradicting reports. I do think it's him. That body has to be someone, like, some child died in a terrible way at the time, that we have to be sure of. And it's a really small town, there weren't a lot of children missing. So, he went missing and, about that same time, that body turned up. And he never showed up again. I think there's a pretty good chance that it's him. Besides, the parents recognized him, I think it's so disrespectful to them to think that they got it wrong.\nI'm still not sure if those women did it, but I do think the body is Evandro's. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s reason to doubt it, because, like I said, there are some contradicting reports. I do think it&amp;#39;s him. That body has to be someone, like, some child died in a terrible way at the time, that we have to be sure of. And it&amp;#39;s a really small town, there weren&amp;#39;t a lot of children missing. So, he went missing and, about that same time, that body turned up. And he never showed up again. I think there&amp;#39;s a pretty good chance that it&amp;#39;s him. Besides, the parents recognized him, I think it&amp;#39;s so disrespectful to them to think that they got it wrong.\nI&amp;#39;m still not sure if those women did it, but I do think the body is Evandro&amp;#39;s. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9o4mv", "score_hidden": false, "stickied": false, "created": 1492229130.0, "created_utc": 1492200330.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9m5oy", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "rubelet", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Amazing write up! Thank you for doing this. It's a fascinating case. Do you believe it is Evandro's body? Or is there still reason to doubt this, even with DNA testing - given the questionable investigation?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Amazing write up! Thank you for doing this. It&amp;#39;s a fascinating case. Do you believe it is Evandro&amp;#39;s body? Or is there still reason to doubt this, even with DNA testing - given the questionable investigation?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9m5oy", "score_hidden": false, "stickied": false, "created": 1492226768.0, "created_utc": 1492197968.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dg8szrc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SpyGlassez", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Great write up. I have nothing to speculate but I had never heard of this before.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great write up. I have nothing to speculate but I had never heard of this before.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg8szrc", "score_hidden": false, "stickied": false, "created": 1492176067.0, "created_utc": 1492147267.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dgct0nl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "magicbeings", "parent_id": "t1_dgcr33i", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Yes, unfortunatelly, it seems very very plausible that they did it, right? And the way the media covers the story just bugs me. Because they are from a rich and important family, while the boy who died was from a middle class family at best (actually, probably not even that). And his family lost a 6-year-old and is painted as evil people who wanted revenge, while the ladies get to be painted as poor inocent people who were injusticed. Like, maybe they were, idk. It just bothers me, because it's just like how things are here, poor people always get f*cked over. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, unfortunatelly, it seems very very plausible that they did it, right? And the way the media covers the story just bugs me. Because they are from a rich and important family, while the boy who died was from a middle class family at best (actually, probably not even that). And his family lost a 6-year-old and is painted as evil people who wanted revenge, while the ladies get to be painted as poor inocent people who were injusticed. Like, maybe they were, idk. It just bothers me, because it&amp;#39;s just like how things are here, poor people always get f*cked over. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgct0nl", "score_hidden": false, "stickied": false, "created": 1492416730.0, "created_utc": 1492387930.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcr33i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RudineHoward", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "great post! What a horrible case, sadly I think it was a ritual and both women and the 'magic man' are guilty, they really killed the boy believing a child sacrifice would bring fortune. \n\nI live in the northeast of Brazil (Salvador) and a lot of people here follow those african syncretic religions and it's a fact that they sacrifice animals even black cats or dogs, sheep, goats etc, two weeks ago they killed one of my black cats when he went outside for a walk. I wouldn't be surprised if they did the same to children. Nothing surprises me anymore, what I observed is that usually white middle age women with lots of money are into this stuff here, the woman who lives upstairs is bipolar and is a follower of that religion, she paid about US$ 7000 for a ritual and shaved her head a year ago hoping for fortune and prosperity. Every time she sees me she says I have dead folk surrounding me and that I should join her and do a ritual. It's really messed up\n\nSo yes, I really think it was a ritual, greedy and mentally ill people here join those cults. I don't think anybody framed those ladies, it would be easier to pay a hitman to murder them instead of killing the little boy. That would make more sense as a revenge.\n", "edited": 1492386692.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;great post! What a horrible case, sadly I think it was a ritual and both women and the &amp;#39;magic man&amp;#39; are guilty, they really killed the boy believing a child sacrifice would bring fortune. &lt;/p&gt;\n\n&lt;p&gt;I live in the northeast of Brazil (Salvador) and a lot of people here follow those african syncretic religions and it&amp;#39;s a fact that they sacrifice animals even black cats or dogs, sheep, goats etc, two weeks ago they killed one of my black cats when he went outside for a walk. I wouldn&amp;#39;t be surprised if they did the same to children. Nothing surprises me anymore, what I observed is that usually white middle age women with lots of money are into this stuff here, the woman who lives upstairs is bipolar and is a follower of that religion, she paid about US$ 7000 for a ritual and shaved her head a year ago hoping for fortune and prosperity. Every time she sees me she says I have dead folk surrounding me and that I should join her and do a ritual. It&amp;#39;s really messed up&lt;/p&gt;\n\n&lt;p&gt;So yes, I really think it was a ritual, greedy and mentally ill people here join those cults. I don&amp;#39;t think anybody framed those ladies, it would be easier to pay a hitman to murder them instead of killing the little boy. That would make more sense as a revenge.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgcr33i", "score_hidden": false, "stickied": false, "created": 1492414108.0, "created_utc": 1492385308.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dg924bw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ShamrocksAndSocks", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Incredibly interesting. Thanks for the writeup! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Incredibly interesting. Thanks for the writeup! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg924bw", "score_hidden": false, "stickied": false, "created": 1492201030.0, "created_utc": 1492172230.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dgcsrat", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "magicbeings", "parent_id": "t1_dgbtlal", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Well, the public trust in the judicial system, or any other form of government, institution or any kind of politics is not high at all, from what I see here. There's a lot of corruption here, sadly. I just did a quick google search, and they actually did a survey on here and only 25% of people trusted the judicial system in 2015. So yeah, not high at all.\n\nAnd yes, we have 27 states, plus the federal district. I think they are not as independent as I think they are in the US. Like, important things are usually federal laws. But some stuff like minimal wage or taxes, that kind of stuff, is different from one state to another. I'm not sure what are the rules concerning what can be a state law and what has to follow federal law at all. But I get the impression that in the US the states seem to be a lot more independant than here. \n\nAnyway, here's a [map](https://www.aprendda.com/wp-content/uploads/2013/04/regioes-do-brasi-mapa.gif), in case you're curious. There are five main regions, and 27 states. This case happened in Paraná, that is in the South, the blue region on the map. Rio de Janeiro and São Paulo (most famous cities) are in the red region (southest). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, the public trust in the judicial system, or any other form of government, institution or any kind of politics is not high at all, from what I see here. There&amp;#39;s a lot of corruption here, sadly. I just did a quick google search, and they actually did a survey on here and only 25% of people trusted the judicial system in 2015. So yeah, not high at all.&lt;/p&gt;\n\n&lt;p&gt;And yes, we have 27 states, plus the federal district. I think they are not as independent as I think they are in the US. Like, important things are usually federal laws. But some stuff like minimal wage or taxes, that kind of stuff, is different from one state to another. I&amp;#39;m not sure what are the rules concerning what can be a state law and what has to follow federal law at all. But I get the impression that in the US the states seem to be a lot more independant than here. &lt;/p&gt;\n\n&lt;p&gt;Anyway, here&amp;#39;s a &lt;a href=\"https://www.aprendda.com/wp-content/uploads/2013/04/regioes-do-brasi-mapa.gif\"&gt;map&lt;/a&gt;, in case you&amp;#39;re curious. There are five main regions, and 27 states. This case happened in Paraná, that is in the South, the blue region on the map. Rio de Janeiro and São Paulo (most famous cities) are in the red region (southest). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgcsrat", "score_hidden": false, "stickied": false, "created": 1492416364.0, "created_utc": 1492387564.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbtlal", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "truenoise", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Interesting case - it's always great to see a case from somewhere outside the US.\n\nIt sounds like public opinions ran high - an innocent child found murdered and maimed - and the police were under a great deal of pressure to solve the crime. \n\nWe had the whole devil-worshippers-did horrible-things-to-innocent-children wave of false accusations, overzealous prosecutors that led to false convictions here in the US in the 1980s. It's now known as \"Satanic Panic'. \n\nWe've had criminals here claim to have been influenced by worshipping Satan, but it's almost always a way to deflect responsibility, or to make themselves look \"evil\" and to get more press coverage.\n\nWhat's the public trust like in your judicial system? \n\nAlso, thank you for teaching me something new today - until I read your post, I had no idea that Brazil had states! Do different states have different laws?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting case - it&amp;#39;s always great to see a case from somewhere outside the US.&lt;/p&gt;\n\n&lt;p&gt;It sounds like public opinions ran high - an innocent child found murdered and maimed - and the police were under a great deal of pressure to solve the crime. &lt;/p&gt;\n\n&lt;p&gt;We had the whole devil-worshippers-did horrible-things-to-innocent-children wave of false accusations, overzealous prosecutors that led to false convictions here in the US in the 1980s. It&amp;#39;s now known as &amp;quot;Satanic Panic&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve had criminals here claim to have been influenced by worshipping Satan, but it&amp;#39;s almost always a way to deflect responsibility, or to make themselves look &amp;quot;evil&amp;quot; and to get more press coverage.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s the public trust like in your judicial system? &lt;/p&gt;\n\n&lt;p&gt;Also, thank you for teaching me something new today - until I read your post, I had no idea that Brazil had states! Do different states have different laws?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgbtlal", "score_hidden": false, "stickied": false, "created": 1492356872.0, "created_utc": 1492328072.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dgdehia", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Butchtherazor", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Great job, your English is better than my own, and I'm an American! the case write up is awesome as well! I hope two kid didn't suffer long, but I am afraid he probably did.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great job, your English is better than my own, and I&amp;#39;m an American! the case write up is awesome as well! I hope two kid didn&amp;#39;t suffer long, but I am afraid he probably did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgdehia", "score_hidden": false, "stickied": false, "created": 1492459748.0, "created_utc": 1492430948.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dge469t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "magicbeings", "parent_id": "t1_dgdf2mr", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Yes, unfortunately, it's very possible that they're wrong, and it's actually kind of sad, because it just makes a whole lot more people suffer and doesn't give them clousure. \n\nI've heard about the \"Satanic Panic\" on some TV shows I watch. I admit it sounds similar, but I don't think those kind of crimes have the same conotation here as they do in North America. I heard there never was a confirmed case of a satanic ritual murder in the US, but unfortunatelly, South America is a very different situation, it's not as crazy to consider something like that happening here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, unfortunately, it&amp;#39;s very possible that they&amp;#39;re wrong, and it&amp;#39;s actually kind of sad, because it just makes a whole lot more people suffer and doesn&amp;#39;t give them clousure. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve heard about the &amp;quot;Satanic Panic&amp;quot; on some TV shows I watch. I admit it sounds similar, but I don&amp;#39;t think those kind of crimes have the same conotation here as they do in North America. I heard there never was a confirmed case of a satanic ritual murder in the US, but unfortunatelly, South America is a very different situation, it&amp;#39;s not as crazy to consider something like that happening here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dge469t", "score_hidden": false, "stickied": false, "created": 1492491655.0, "created_utc": 1492462855.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdf2mr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "anonymouse278", "parent_id": "t1_dgdezpa", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "But I do think it's absolutely possible for a family to become fixated on a single explanation early on in an investigation and to make that part of their grief/coping process in a way that keeps them from letting new information in or accepting that they might have been wrong. Meredith Kercher's family seems like a clear example of that to me. So they may genuinely believe that the Abagges are responsible and hate them even in the face of conflicting evidence- I don't think that necessarily means they've realized they're wrong but are pursuing a grudge anyway. Grief isn't rational.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But I do think it&amp;#39;s absolutely possible for a family to become fixated on a single explanation early on in an investigation and to make that part of their grief/coping process in a way that keeps them from letting new information in or accepting that they might have been wrong. Meredith Kercher&amp;#39;s family seems like a clear example of that to me. So they may genuinely believe that the Abagges are responsible and hate them even in the face of conflicting evidence- I don&amp;#39;t think that necessarily means they&amp;#39;ve realized they&amp;#39;re wrong but are pursuing a grudge anyway. Grief isn&amp;#39;t rational.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgdf2mr", "score_hidden": false, "stickied": false, "created": 1492460955.0, "created_utc": 1492432155.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdezpa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "anonymouse278", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Very interesting. The claims the prosecution made about the crime sound so much like the \"Satanic Panic\" that had just ended in the US at that time that it makes me instantly skeptical, since those claims were universally debunked. But obviously there was a real mutilated child, which was not the case in most of the Panic cases here.\n\nIt sounds like the investigation was so badly bungled that it will probably never be clear what really happened. So sad. Poor kid.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very interesting. The claims the prosecution made about the crime sound so much like the &amp;quot;Satanic Panic&amp;quot; that had just ended in the US at that time that it makes me instantly skeptical, since those claims were universally debunked. But obviously there was a real mutilated child, which was not the case in most of the Panic cases here.&lt;/p&gt;\n\n&lt;p&gt;It sounds like the investigation was so badly bungled that it will probably never be clear what really happened. So sad. Poor kid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgdezpa", "score_hidden": false, "stickied": false, "created": 1492460792.0, "created_utc": 1492431992.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dgebxb8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "oshitson", "parent_id": "t1_dge3xzr", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Ok than to me this falls under occam's razor. Between the parents identifying the clothing and the key near the body it has to be the boy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok than to me this falls under occam&amp;#39;s razor. Between the parents identifying the clothing and the key near the body it has to be the boy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgebxb8", "score_hidden": false, "stickied": false, "created": 1492501453.0, "created_utc": 1492472653.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge3xzr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "magicbeings", "parent_id": "t1_dgdzztq", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "No, from what I read, they just state that the key was there near the body, but it doesn't seem that people pay much attention to it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, from what I read, they just state that the key was there near the body, but it doesn&amp;#39;t seem that people pay much attention to it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dge3xzr", "score_hidden": false, "stickied": false, "created": 1492491394.0, "created_utc": 1492462594.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzztq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "oshitson", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Was there any debate over the keychain found near the body? That seems like a huge piece of evidence as it relates to the identity. Obviously not as good as DNA but what are the odds that key ends up next to the body if it's not the boy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Was there any debate over the keychain found near the body? That seems like a huge piece of evidence as it relates to the identity. Obviously not as good as DNA but what are the odds that key ends up next to the body if it&amp;#39;s not the boy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgdzztq", "score_hidden": false, "stickied": false, "created": 1492486978.0, "created_utc": 1492458178.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dgadtfi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "historicalblindness", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "It's hard to imagine holding off an angry mob of 2000 people with machine guns. What a story!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s hard to imagine holding off an angry mob of 2000 people with machine guns. What a story!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgadtfi", "score_hidden": false, "stickied": false, "created": 1492266628.0, "created_utc": 1492237828.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_657wnz", "likes": null, "replies": "", "user_reports": [], "id": "dgdabpb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "magicbeings", "parent_id": "t1_dgcziqi", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I don't know their ancestral history. But you should know that the chances its portuguese OR indigenous are very low. Brazilian population is not just a mixture of portuguese and indigenous. More than half of our population is considered \"black\", and african slaves played an important part in our history. There was also imigration from a bunch of other countries, european, asian, arabic, you name it. It's a very mixed population, and it's hard to know your family's history (I, for one, know I have french, polish, italian and portuguese ancestry, only the ones I know of). In the south, most of brazilian population is of white european ancestry (mostly German, italian or polish).  There was a lot of imigration from european countries to here in the end of 19th century and beginning of the 20th. They look very white, and I just did a google search and it looks like \"Abage\" is an arabic name, so there you have it. If they are arabic, the family probably got here in the 19th or 20th century, and most of the indigenous population already had been killed by then. \nAlso, actually, the 90's and the 2000's were a period of actually very good economy and a lot of growth for Brazil. Up until 94, there was a lot of problems, and since 2014 at least things haven't look so good either. But in between was a period where the economy growth was high, the unemployment rates were low and millions of brazilian families managed to step over the poverty line.\nBut, if they were involved with corruption? Can't say for sure, but yeah, probably. Most of people involved with politics are, at some level.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know their ancestral history. But you should know that the chances its portuguese OR indigenous are very low. Brazilian population is not just a mixture of portuguese and indigenous. More than half of our population is considered &amp;quot;black&amp;quot;, and african slaves played an important part in our history. There was also imigration from a bunch of other countries, european, asian, arabic, you name it. It&amp;#39;s a very mixed population, and it&amp;#39;s hard to know your family&amp;#39;s history (I, for one, know I have french, polish, italian and portuguese ancestry, only the ones I know of). In the south, most of brazilian population is of white european ancestry (mostly German, italian or polish).  There was a lot of imigration from european countries to here in the end of 19th century and beginning of the 20th. They look very white, and I just did a google search and it looks like &amp;quot;Abage&amp;quot; is an arabic name, so there you have it. If they are arabic, the family probably got here in the 19th or 20th century, and most of the indigenous population already had been killed by then. \nAlso, actually, the 90&amp;#39;s and the 2000&amp;#39;s were a period of actually very good economy and a lot of growth for Brazil. Up until 94, there was a lot of problems, and since 2014 at least things haven&amp;#39;t look so good either. But in between was a period where the economy growth was high, the unemployment rates were low and millions of brazilian families managed to step over the poverty line.\nBut, if they were involved with corruption? Can&amp;#39;t say for sure, but yeah, probably. Most of people involved with politics are, at some level.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgdabpb", "score_hidden": false, "stickied": false, "created": 1492447213.0, "created_utc": 1492418413.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcziqi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Puremisty", "parent_id": "t3_657wnz", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I suspect it was someone who had a deep hatred for the Abagge clan. I need to know their ancestral history: were they 100% Portuguese or were they descended from indigenous Brazilians. Also I would check to see if the Abagges had some sort of connection to corruption. If they are Portuguese-Brazilians I suspect that the killer, or killers, may have wanted to punish them for crippling the indigenous population or for committing a perceived wrong against them. Right now Brazil is suffering from corruption and during the 90s Brazil began its slow descent into recession. \n As a Wiccan, I uphold the belief that any harm we do comes back to us threefold so for a person to commit such a terrible act suggests they may not have been in the right state of mind. The only time a person would even contemplate using such dark magick is if they were focused on revenge. By arranging for the death of a child they would have been making a clear threat to their enemies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suspect it was someone who had a deep hatred for the Abagge clan. I need to know their ancestral history: were they 100% Portuguese or were they descended from indigenous Brazilians. Also I would check to see if the Abagges had some sort of connection to corruption. If they are Portuguese-Brazilians I suspect that the killer, or killers, may have wanted to punish them for crippling the indigenous population or for committing a perceived wrong against them. Right now Brazil is suffering from corruption and during the 90s Brazil began its slow descent into recession. \n As a Wiccan, I uphold the belief that any harm we do comes back to us threefold so for a person to commit such a terrible act suggests they may not have been in the right state of mind. The only time a person would even contemplate using such dark magick is if they were focused on revenge. By arranging for the death of a child they would have been making a clear threat to their enemies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgcziqi", "score_hidden": false, "stickied": false, "created": 1492425499.0, "created_utc": 1492396699.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]