[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "UnresolvedMysteries", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Nancy Pfister was a popular socialite in Aspen, Colorado and came from an extremely popular, wealthy family from the area.  Nancy was found dead in the closet of her Aspen home in February 2014.  Nancy had been renting out her home to Trey and Nancy Styler while she spent Aspen&amp;#39;s peak skiing season in Australia.&lt;/p&gt;\n\n&lt;p&gt;Trey Styler was a recently retired anesthesiologist.  Dr. Styler had to quit practicing medicine due to his rapidly declining health.  &lt;/p&gt;\n\n&lt;p&gt;Trey and Nancy Styler lived with Nancy Pfister, in her home, for a short period for time before she left for Australia, but they reportedly did not get along very well.  With Nancy Pfister on her vacation, the Styler&amp;#39;s reported appliances and hot water not working in the home.  Until these issues were fixed, the Styler&amp;#39;s withheld their rent payments.&lt;/p&gt;\n\n&lt;p&gt;Nancy Pfister had her &amp;quot;personal assistant&amp;quot;, Kathy Carpenter, check in with the tenants and collect rent while she was away.  She also tasked Kathy with fixing the issues presented by the Styler&amp;#39;s.  The Styler&amp;#39;s paid the rent charges once the issues were fixed, however, Nancy Pfister was fed up and decided to cut her vacation short.  &lt;/p&gt;\n\n&lt;p&gt;She returned from Australia, having evicted the Styler&amp;#39;s, and spent her first night back in town with Kathy Carpenter.  According to Carpenter, they laughed and unpacked and Nancy told countless witty stories about her short, but fabulous, trip.  &lt;/p&gt;\n\n&lt;p&gt;Two days later, Kathy Carpenter found Nancy Pfister dead in the closet of her master bedroom.  She had been a victim of blunt force trauma to the head, and a stabbing to the chest.&lt;/p&gt;\n\n&lt;p&gt;Kathy Carpenter immediately pointed the police in the direction of the Styler&amp;#39;s, asserting in the 911 call that Nancy had &amp;quot;PISSED THEM OFF&amp;quot;.  &lt;/p&gt;\n\n&lt;p&gt;A few things to note, before I continue my write-up:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Kathy Carpenter did not see Nancy Pfister dead.  However, on the 911 call, Kathy was in hysterics about seeing her dead friend and knowing she was &amp;quot;full of blood&amp;quot;.  Nancy&amp;#39;s body was found wrapped up multiple times and was not identifiable by just glancing into the closet, which Kathy claimed to do.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Trey Styler was in his 60&amp;#39;s at the time, not incredibly old, but he had a disease similar to Lou Gehrig&amp;#39;s disease which left him unable to even stand up on his own.  His wife was in her 60&amp;#39;s as well.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Nancy Pfister was killed in her bed.  The queen-sized mattress was flipped, and the body had been moved from the bed to the closet.  Investigators do not think this all could have been done by one assailant.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There were no signs of forced entry.  Both Kathy Carpenter and the Styler&amp;#39;s had sets of keys.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Trey and Nancy Styler were arrested after a city worker found a garbage bag containing a bloody hammer, a car payment receipt with the Styler&amp;#39;s name on it, and a prescription medication bottle with Pfister&amp;#39;s name on it.  The garbage bag was found in a trash bin behind the motel which the Styler&amp;#39;s had been staying since being evicted from Pfister&amp;#39;s.  &lt;/p&gt;\n\n&lt;p&gt;LE had enough evidence to soon arrest Kathy Carpenter, as well.  They developed a theory that Carpenter and the Styler&amp;#39;s had been in on it together, due to mutual disgust with the way Pfister sometimes treated them (she had been reported to order them around occasionally; &amp;quot;treated me like a slave&amp;quot; in Nancy Styler&amp;#39;s words).&lt;/p&gt;\n\n&lt;p&gt;Two weeks after his arrest, the frail, former Dr. Styler, now wheelchair-bound, confessed to the murder.  He said he acted completely alone, and that his wife had nothing to do with it.  In exchange for his confession, Nancy Styler and Kathy Carpenter were both released from prison.  &lt;/p&gt;\n\n&lt;p&gt;Trey Styler was convicted, and sentenced to 20 years in prison -- a life sentence, given his age and medical standing.  He committed suicide in August 2015, at the age of 67.&lt;/p&gt;\n\n&lt;p&gt;Nancy Styler soon divorced her husband, wrote a book on the ordeal, and now resides in Massachusetts.  She got a reported $1 million dollar life-insurance payout following her ex-husband&amp;#39;s suicide in prison.&lt;/p&gt;\n\n&lt;p&gt;Nancy Pfister&amp;#39;s daughter, Juliana, filed a wrongful death suit against Nancy Styler in 2016, alleging she had a huge hand in the murder and is only walking free because of her husband&amp;#39;s &amp;quot;confession&amp;quot;, which she does not believe to be true.  Juliana has no contact with Kathy Carpenter, and has not spoken to her since her mother&amp;#39;s murder.  Juliana has not spoken publicly regarding her mother&amp;#39;s murder, and did not appear on the Dateline episode about the case.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Murder_of_Nancy_Pfister\"&gt;https://en.wikipedia.org/wiki/Murder_of_Nancy_Pfister&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://crimewatchdaily.com/2015/11/02/ski-town-socialite-murdered-in-her-sleep/\"&gt;https://crimewatchdaily.com/2015/11/02/ski-town-socialite-murdered-in-her-sleep/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.aspentimes.com/news/wrongful-death-suit-filed-in-nancy-pfister-murder/\"&gt;http://www.aspentimes.com/news/wrongful-death-suit-filed-in-nancy-pfister-murder/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I just watched the Dateline episode for this case last night.  It is the most fascinating case I have heard of in a very long time.  From the (probable) false confession, to the civil suit, to Kathy Carpenter&amp;#39;s odd role in this whole thing, I&amp;#39;m not sure what to make of it all.&lt;/p&gt;\n\n&lt;p&gt;What do you think happened to Nancy Pfister?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Nancy Pfister was a popular socialite in Aspen, Colorado and came from an extremely popular, wealthy family from the area.  Nancy was found dead in the closet of her Aspen home in February 2014.  Nancy had been renting out her home to Trey and Nancy Styler while she spent Aspen's peak skiing season in Australia.\n\nTrey Styler was a recently retired anesthesiologist.  Dr. Styler had to quit practicing medicine due to his rapidly declining health.  \n\nTrey and Nancy Styler lived with Nancy Pfister, in her home, for a short period for time before she left for Australia, but they reportedly did not get along very well.  With Nancy Pfister on her vacation, the Styler's reported appliances and hot water not working in the home.  Until these issues were fixed, the Styler's withheld their rent payments.\n\nNancy Pfister had her \"personal assistant\", Kathy Carpenter, check in with the tenants and collect rent while she was away.  She also tasked Kathy with fixing the issues presented by the Styler's.  The Styler's paid the rent charges once the issues were fixed, however, Nancy Pfister was fed up and decided to cut her vacation short.  \n\nShe returned from Australia, having evicted the Styler's, and spent her first night back in town with Kathy Carpenter.  According to Carpenter, they laughed and unpacked and Nancy told countless witty stories about her short, but fabulous, trip.  \n\nTwo days later, Kathy Carpenter found Nancy Pfister dead in the closet of her master bedroom.  She had been a victim of blunt force trauma to the head, and a stabbing to the chest.\n\nKathy Carpenter immediately pointed the police in the direction of the Styler's, asserting in the 911 call that Nancy had \"PISSED THEM OFF\".  \n\nA few things to note, before I continue my write-up:\n\n1.  Kathy Carpenter did not see Nancy Pfister dead.  However, on the 911 call, Kathy was in hysterics about seeing her dead friend and knowing she was \"full of blood\".  Nancy's body was found wrapped up multiple times and was not identifiable by just glancing into the closet, which Kathy claimed to do.\n\n2.  Trey Styler was in his 60's at the time, not incredibly old, but he had a disease similar to Lou Gehrig's disease which left him unable to even stand up on his own.  His wife was in her 60's as well.\n\n3.  Nancy Pfister was killed in her bed.  The queen-sized mattress was flipped, and the body had been moved from the bed to the closet.  Investigators do not think this all could have been done by one assailant.\n\n4.  There were no signs of forced entry.  Both Kathy Carpenter and the Styler's had sets of keys.\n\nTrey and Nancy Styler were arrested after a city worker found a garbage bag containing a bloody hammer, a car payment receipt with the Styler's name on it, and a prescription medication bottle with Pfister's name on it.  The garbage bag was found in a trash bin behind the motel which the Styler's had been staying since being evicted from Pfister's.  \n\nLE had enough evidence to soon arrest Kathy Carpenter, as well.  They developed a theory that Carpenter and the Styler's had been in on it together, due to mutual disgust with the way Pfister sometimes treated them (she had been reported to order them around occasionally; \"treated me like a slave\" in Nancy Styler's words).\n\nTwo weeks after his arrest, the frail, former Dr. Styler, now wheelchair-bound, confessed to the murder.  He said he acted completely alone, and that his wife had nothing to do with it.  In exchange for his confession, Nancy Styler and Kathy Carpenter were both released from prison.  \n\nTrey Styler was convicted, and sentenced to 20 years in prison -- a life sentence, given his age and medical standing.  He committed suicide in August 2015, at the age of 67.\n\nNancy Styler soon divorced her husband, wrote a book on the ordeal, and now resides in Massachusetts.  She got a reported $1 million dollar life-insurance payout following her ex-husband's suicide in prison.\n\nNancy Pfister's daughter, Juliana, filed a wrongful death suit against Nancy Styler in 2016, alleging she had a huge hand in the murder and is only walking free because of her husband's \"confession\", which she does not believe to be true.  Juliana has no contact with Kathy Carpenter, and has not spoken to her since her mother's murder.  Juliana has not spoken publicly regarding her mother's murder, and did not appear on the Dateline episode about the case.\n\nhttps://en.wikipedia.org/wiki/Murder_of_Nancy_Pfister\n\nhttps://crimewatchdaily.com/2015/11/02/ski-town-socialite-murdered-in-her-sleep/\n\nhttp://www.aspentimes.com/news/wrongful-death-suit-filed-in-nancy-pfister-murder/\n\nI just watched the Dateline episode for this case last night.  It is the most fascinating case I have heard of in a very long time.  From the (probable) false confession, to the civil suit, to Kathy Carpenter's odd role in this whole thing, I'm not sure what to make of it all.\n\nWhat do you think happened to Nancy Pfister?\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Unresolved Murder", "id": "65de2m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 108, "report_reasons": null, "author": "redddddditaccount", "saved": false, "mod_reports": [], "name": "t3_65de2m", "subreddit_name_prefixed": "r/UnresolvedMysteries", "approved_by": null, "over_18": false, "domain": "self.UnresolvedMysteries", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2wvvc", "edited": 1492199426.0, "link_flair_css_class": "unmur", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/UnresolvedMysteries/comments/65de2m/nancy_pfister_what_the_heck_happened/", "num_reports": null, "locked": false, "stickied": false, "created": 1492214741.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/65de2m/nancy_pfister_what_the_heck_happened/", "author_flair_text": null, "quarantine": false, "title": "Nancy Pfister... what the heck happened?", "created_utc": 1492185941.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 29, "visited": false, "subreddit_type": "public", "ups": 108}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": "", "user_reports": [], "id": "dg9ie5h", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "redddddditaccount", "parent_id": "t1_dg9d2ck", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I agree.  I didn't include this in my write-up, but Styler had attempted to start a practice of some sort after his retirement. It failed, and then he attempted to sue somebody and lost his life savings (according to Dateline) through the court proceedings.  I think he felt extremely guilty for what he had done to his wife in the past few years and that was the basis for the \"confession\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree.  I didn&amp;#39;t include this in my write-up, but Styler had attempted to start a practice of some sort after his retirement. It failed, and then he attempted to sue somebody and lost his life savings (according to Dateline) through the court proceedings.  I think he felt extremely guilty for what he had done to his wife in the past few years and that was the basis for the &amp;quot;confession&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9ie5h", "score_hidden": false, "stickied": false, "created": 1492222237.0, "created_utc": 1492193437.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": "", "user_reports": [], "id": "dgac79n", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Unicorn_Parade", "parent_id": "t1_dga8p2j", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "&gt; And his voice is so soothing. I wish he narrated something benign - I'd fall asleep to it every night.\n\nFor about a month he was a guest voice on Waze. I am brokenhearted since that option has gone away. He'd say things like, \"it was a perfect trip...until it wasn't\" and \"uh-oh! Traffic ahead!\" It was just the best thing ever, if you imagine him saying those things. I think the guest voices rotate out, but I really hope they bring him back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And his voice is so soothing. I wish he narrated something benign - I&amp;#39;d fall asleep to it every night.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;For about a month he was a guest voice on Waze. I am brokenhearted since that option has gone away. He&amp;#39;d say things like, &amp;quot;it was a perfect trip...until it wasn&amp;#39;t&amp;quot; and &amp;quot;uh-oh! Traffic ahead!&amp;quot; It was just the best thing ever, if you imagine him saying those things. I think the guest voices rotate out, but I really hope they bring him back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgac79n", "score_hidden": false, "stickied": false, "created": 1492263097.0, "created_utc": 1492234297.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dga8p2j", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "beccaASDC", "parent_id": "t1_dga7qp0", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I remember specifically thinking to myself: there is no way her lawyer approved of her doing that. Especially with Keith Morrison - he's my favorite. He really knows how to ask questions, not just what questions to ask. And his voice is so soothing. I wish he narrated something benign - I'd fall asleep to it every night. I pick shows at bedtime based around the narrator. \n\nI know exactly what you mean here. It's easy to take things out of context. To me though, like someone else mentioned, it's very telling that the victims daughter wants nothing to do with her. IIRC - she had a very valuable piece of jewelry and several thousand dollars belonging to the victim thay she retrieved from a safe deposit box I think 2 days after the murder.  Her excuse was she was \"holding\" it for the daughter. The daughter never corroborated this, so for all we know she still has it. Amd why not just give the daughter the key. It was odd. A bank legally can't inventory a safe deposit box unless it's surrendered to the state. And even then, you need independent witnesses (source: I worked in that department at a bank). So for all we know she took way more out of that box. \n\nAnd like I said, there's just something I can't QUITE put my finger on that sets off red flags for me. Something about that woman was off.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember specifically thinking to myself: there is no way her lawyer approved of her doing that. Especially with Keith Morrison - he&amp;#39;s my favorite. He really knows how to ask questions, not just what questions to ask. And his voice is so soothing. I wish he narrated something benign - I&amp;#39;d fall asleep to it every night. I pick shows at bedtime based around the narrator. &lt;/p&gt;\n\n&lt;p&gt;I know exactly what you mean here. It&amp;#39;s easy to take things out of context. To me though, like someone else mentioned, it&amp;#39;s very telling that the victims daughter wants nothing to do with her. IIRC - she had a very valuable piece of jewelry and several thousand dollars belonging to the victim thay she retrieved from a safe deposit box I think 2 days after the murder.  Her excuse was she was &amp;quot;holding&amp;quot; it for the daughter. The daughter never corroborated this, so for all we know she still has it. Amd why not just give the daughter the key. It was odd. A bank legally can&amp;#39;t inventory a safe deposit box unless it&amp;#39;s surrendered to the state. And even then, you need independent witnesses (source: I worked in that department at a bank). So for all we know she took way more out of that box. &lt;/p&gt;\n\n&lt;p&gt;And like I said, there&amp;#39;s just something I can&amp;#39;t QUITE put my finger on that sets off red flags for me. Something about that woman was off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dga8p2j", "score_hidden": false, "stickied": false, "created": 1492256875.0, "created_utc": 1492228075.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dga7qp0", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "madameroach", "parent_id": "t1_dga6rkb", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "agreed, i would be extremely awkward on camera if i was interviewed for a crime show about someone that was killed.  \n\nwell, i probably would never agree to it, because that would be a horrible situation and i wouldn't want to articulate my feelings in front of a bunch of strangers and a camera.  that and i tend to smile or laugh when i'm uncomfortable at the most inappropriate time.  they would think i was a sociopath.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;agreed, i would be extremely awkward on camera if i was interviewed for a crime show about someone that was killed.  &lt;/p&gt;\n\n&lt;p&gt;well, i probably would never agree to it, because that would be a horrible situation and i wouldn&amp;#39;t want to articulate my feelings in front of a bunch of strangers and a camera.  that and i tend to smile or laugh when i&amp;#39;m uncomfortable at the most inappropriate time.  they would think i was a sociopath.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dga7qp0", "score_hidden": false, "stickied": false, "created": 1492255342.0, "created_utc": 1492226542.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6rkb", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Hollywoodisburning", "parent_id": "t1_dga3cwh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "It's really easy to make a slightly awkward person seem like a psycho when you control the footage. I'm not insinuating that's what happened, but I edit video for a living, and often have to turn 2 hours of incoherent rambling into 10 minutes worth of narrative. Crime shows are usually pushing a particular version of events. \n\nI also know that in most court cases, once they get a confession, the investigation is usually over unless the confession is completely unbelievable. I'm not saying this confession is believable, but it may have been the difference between an easy win and a cold case ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s really easy to make a slightly awkward person seem like a psycho when you control the footage. I&amp;#39;m not insinuating that&amp;#39;s what happened, but I edit video for a living, and often have to turn 2 hours of incoherent rambling into 10 minutes worth of narrative. Crime shows are usually pushing a particular version of events. &lt;/p&gt;\n\n&lt;p&gt;I also know that in most court cases, once they get a confession, the investigation is usually over unless the confession is completely unbelievable. I&amp;#39;m not saying this confession is believable, but it may have been the difference between an easy win and a cold case &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dga6rkb", "score_hidden": false, "stickied": false, "created": 1492253856.0, "created_utc": 1492225056.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dga3cwh", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "ModernMuse", "parent_id": "t1_dg9u04y", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I haven't seen the show, so just curious--do you think the show subtly suggests the friend is the guilty party? Sometimes I get the impression that editing can make a normal person seem really creepy, or even a creepy person seem fairly normal. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t seen the show, so just curious--do you think the show subtly suggests the friend is the guilty party? Sometimes I get the impression that editing can make a normal person seem really creepy, or even a creepy person seem fairly normal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dga3cwh", "score_hidden": false, "stickied": false, "created": 1492249013.0, "created_utc": 1492220213.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9u04y", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "beccaASDC", "parent_id": "t1_dg9t01d", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "She just seemed off. You know how you get that weird vibe off of someone? I really can't exactly put my finger on It, and I'll update if I think of the right wording, but there was something about that woman that set off red flags for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She just seemed off. You know how you get that weird vibe off of someone? I really can&amp;#39;t exactly put my finger on It, and I&amp;#39;ll update if I think of the right wording, but there was something about that woman that set off red flags for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9u04y", "score_hidden": false, "stickied": false, "created": 1492236463.0, "created_utc": 1492207663.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": "", "user_reports": [], "id": "dgbjdlk", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Mycoxadril", "parent_id": "t1_dgadvh8", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "This was what set off my suspicions that Kathy framed the couple.  Who tosses the murder weapon in a bag with identifying information linking not only yourself but your victim by name?  I am going solely off OPs write off and not having watched the episode or anything, but now I'm really curious why the daughter didn't sue Kathy for wrongful death and only Nancy.  Was it because she knew Nancy could pay if she lost and maybe Kathy couldn't?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was what set off my suspicions that Kathy framed the couple.  Who tosses the murder weapon in a bag with identifying information linking not only yourself but your victim by name?  I am going solely off OPs write off and not having watched the episode or anything, but now I&amp;#39;m really curious why the daughter didn&amp;#39;t sue Kathy for wrongful death and only Nancy.  Was it because she knew Nancy could pay if she lost and maybe Kathy couldn&amp;#39;t?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgbjdlk", "score_hidden": false, "stickied": false, "created": 1492337787.0, "created_utc": 1492308987.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgadvh8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "COLservaTiveFraTrump", "parent_id": "t1_dg9t01d", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Plus the pill bottle? Trey Styler was a doctor, while he may have had a pill habit, he probably didn't need to steal them. Kathy likely stole Nancy's pills while she was on vacation, somehow she was discovered and that fight puts her over the edge? Then frame the Stylers wit the hammer and a car registration she may have found laying around? I mean why would the Stylers make that mistake, plus who throws away their own car registration? Likely forgot it sitting out somewhere in the house while renewing car insurance or something and Kathy grabbed it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plus the pill bottle? Trey Styler was a doctor, while he may have had a pill habit, he probably didn&amp;#39;t need to steal them. Kathy likely stole Nancy&amp;#39;s pills while she was on vacation, somehow she was discovered and that fight puts her over the edge? Then frame the Stylers wit the hammer and a car registration she may have found laying around? I mean why would the Stylers make that mistake, plus who throws away their own car registration? Likely forgot it sitting out somewhere in the house while renewing car insurance or something and Kathy grabbed it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgadvh8", "score_hidden": false, "stickied": false, "created": 1492266757.0, "created_utc": 1492237957.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9t01d", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "redddddditaccount", "parent_id": "t1_dg9rl8b", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I was suspicious of Kathy, too. The 911 call and all the details she gave about the body (that she did not see when she \"discovered\" it) is what gave her away in my opinion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was suspicious of Kathy, too. The 911 call and all the details she gave about the body (that she did not see when she &amp;quot;discovered&amp;quot; it) is what gave her away in my opinion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9t01d", "score_hidden": false, "stickied": false, "created": 1492235158.0, "created_utc": 1492206358.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rl8b", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "beccaASDC", "parent_id": "t1_dg9f0uq", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "To be fair here. Let's say your the prosecutor. You have evidence the implicates the Stylers. Mainly the husband. He confesses and is adamant he acted alone. The likliehood you're going to get a conviction on the wife or the \"friend\" is actually relatively low. They can always charge either of them again in the future, but they only get one shot at it.\n\nFrom watching Dateline, I was actually more suspicious of the friend than the wife. I think it's actually MORE likely the friend and an unknown accomplice killed her and framed the Stylers. He was dying. He was afraid his wife would be convicted, so he confesses. IIRC - he didn't even know any details that weren't made public. The friend just really set off my creep radar.", "edited": 1492205741.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be fair here. Let&amp;#39;s say your the prosecutor. You have evidence the implicates the Stylers. Mainly the husband. He confesses and is adamant he acted alone. The likliehood you&amp;#39;re going to get a conviction on the wife or the &amp;quot;friend&amp;quot; is actually relatively low. They can always charge either of them again in the future, but they only get one shot at it.&lt;/p&gt;\n\n&lt;p&gt;From watching Dateline, I was actually more suspicious of the friend than the wife. I think it&amp;#39;s actually MORE likely the friend and an unknown accomplice killed her and framed the Stylers. He was dying. He was afraid his wife would be convicted, so he confesses. IIRC - he didn&amp;#39;t even know any details that weren&amp;#39;t made public. The friend just really set off my creep radar.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9rl8b", "score_hidden": false, "stickied": false, "created": 1492233355.0, "created_utc": 1492204555.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9f0uq", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "kikifadich", "parent_id": "t1_dg9d2ck", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "The thing about law enforcement and District Attorneys especially is that what really matters are \"wins\". Cleared cases and convictions. They don't care about justice or the truth. \nA confession is a win and looks good on the books. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing about law enforcement and District Attorneys especially is that what really matters are &amp;quot;wins&amp;quot;. Cleared cases and convictions. They don&amp;#39;t care about justice or the truth. \nA confession is a win and looks good on the books. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9f0uq", "score_hidden": false, "stickied": false, "created": 1492218322.0, "created_utc": 1492189522.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9d2ck", "gilded": 0, "archived": false, "score": 67, "report_reasons": null, "author": "ScarTissueWishYouSaw", "parent_id": "t3_65de2m", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "\"Trey Styler was in his 60's at the time, not incredibly old, but he had a disease similar to Lou Gehrig's disease which left him unable to even stand up on his own. His wife was in her 60's as well.\"\n\nyet he managed to walk up and down the stairs twice, grab an axe and hammer, tie her up, slaughter her, wrap her up and move her to the closet, flip the bed, and then \"grab some things quickly\" and left making it back inside cleaning off before his wife saw him?\n\nI feel like they totally took his confession and said screw the others so they could have a quick conviction instead of actually getting all three of them convicted. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Trey Styler was in his 60&amp;#39;s at the time, not incredibly old, but he had a disease similar to Lou Gehrig&amp;#39;s disease which left him unable to even stand up on his own. His wife was in her 60&amp;#39;s as well.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;yet he managed to walk up and down the stairs twice, grab an axe and hammer, tie her up, slaughter her, wrap her up and move her to the closet, flip the bed, and then &amp;quot;grab some things quickly&amp;quot; and left making it back inside cleaning off before his wife saw him?&lt;/p&gt;\n\n&lt;p&gt;I feel like they totally took his confession and said screw the others so they could have a quick conviction instead of actually getting all three of them convicted. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9d2ck", "score_hidden": false, "stickied": false, "created": 1492216114.0, "created_utc": 1492187314.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 67}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": "", "user_reports": [], "id": "dga9eqb", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "beccaASDC", "parent_id": "t1_dg9vie3", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thank you. I really believe there's such a strong stigma around suicide, and it's something most people are afraid to talk about. It took years (I'm 35 now), but I really think it's important. Online and IRL, I always try to be honest. A lot of people put up very strong walls around it, but they're suffering inside that box. No one should ever feel so alone, or afraid to talk about. \n\nI've been surprised on a popular site I frequent by private messages telling me thank you for being honest, because they simply don't have that outlet. Once IRL I had a teenage girl break down and start crying, because her surviving parent made her keep it a secret and she'd literally never said it out loud. I still talk to her - she's in college now.  \n\nI'm sorry for my soapbox. One thing I like about the community here is that suicide is talked about, as strange as that sounds. I prefer talking in the context of a greater conversation than in a place like a support group. And, more importantly, the families of those individuals are remembered. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I really believe there&amp;#39;s such a strong stigma around suicide, and it&amp;#39;s something most people are afraid to talk about. It took years (I&amp;#39;m 35 now), but I really think it&amp;#39;s important. Online and IRL, I always try to be honest. A lot of people put up very strong walls around it, but they&amp;#39;re suffering inside that box. No one should ever feel so alone, or afraid to talk about. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been surprised on a popular site I frequent by private messages telling me thank you for being honest, because they simply don&amp;#39;t have that outlet. Once IRL I had a teenage girl break down and start crying, because her surviving parent made her keep it a secret and she&amp;#39;d literally never said it out loud. I still talk to her - she&amp;#39;s in college now.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry for my soapbox. One thing I like about the community here is that suicide is talked about, as strange as that sounds. I prefer talking in the context of a greater conversation than in a place like a support group. And, more importantly, the families of those individuals are remembered. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dga9eqb", "score_hidden": false, "stickied": false, "created": 1492258044.0, "created_utc": 1492229244.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9vie3", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "imperialxcereal", "parent_id": "t1_dg9rocb", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Thanks for the answer and reassurance that it's not a stupid question. I'm terribly sorry to hear about the passing of your father. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the answer and reassurance that it&amp;#39;s not a stupid question. I&amp;#39;m terribly sorry to hear about the passing of your father. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9vie3", "score_hidden": false, "stickied": false, "created": 1492238476.0, "created_utc": 1492209676.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rocb", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "beccaASDC", "parent_id": "t1_dg9qipe", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Yes - IF the policy is older than a suicide clause. Most policies have waiting periods of at least 2 years, many have more. My father committed suicide and I collected on 2 of his policies that had been in effect since I was born, so 23 years.\n\nEdit to add: that is not even a remotely stupid question", "edited": 1492205533.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes - IF the policy is older than a suicide clause. Most policies have waiting periods of at least 2 years, many have more. My father committed suicide and I collected on 2 of his policies that had been in effect since I was born, so 23 years.&lt;/p&gt;\n\n&lt;p&gt;Edit to add: that is not even a remotely stupid question&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9rocb", "score_hidden": false, "stickied": false, "created": 1492233462.0, "created_utc": 1492204662.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": "", "user_reports": [], "id": "dg9x1lg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lalalutz", "parent_id": "t1_dg9qipe", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "No idea, but maybe because he died in prison it affects it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No idea, but maybe because he died in prison it affects it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9x1lg", "score_hidden": false, "stickied": false, "created": 1492240539.0, "created_utc": 1492211739.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9qipe", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "imperialxcereal", "parent_id": "t1_dg9lhn4", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "This is probably a stupid question, but can life insurance still be collected when a person commits suicide? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is probably a stupid question, but can life insurance still be collected when a person commits suicide? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9qipe", "score_hidden": false, "stickied": false, "created": 1492232014.0, "created_utc": 1492203214.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9lhn4", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "lalalutz", "parent_id": "t3_65de2m", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Never heard of this case but from just your write up it seems that the husband confessed as he knew his life was not going to be long and healthy, killed him self (in prison?) because he knew his wife would receive his hefty life insurance, at least letting her live comfortably after he was gone. The wife seems totally culpable but he took the bullet for her. Crazy story!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Never heard of this case but from just your write up it seems that the husband confessed as he knew his life was not going to be long and healthy, killed him self (in prison?) because he knew his wife would receive his hefty life insurance, at least letting her live comfortably after he was gone. The wife seems totally culpable but he took the bullet for her. Crazy story!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9lhn4", "score_hidden": false, "stickied": false, "created": 1492225955.0, "created_utc": 1492197155.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": "", "user_reports": [], "id": "dga69t2", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "redddddditaccount", "parent_id": "t1_dga3386", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Trey couldn't have done it himself, given his medical condition. I'm thinking they were likely in on it together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trey couldn&amp;#39;t have done it himself, given his medical condition. I&amp;#39;m thinking they were likely in on it together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dga69t2", "score_hidden": false, "stickied": false, "created": 1492253142.0, "created_utc": 1492224342.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dga3386", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "faint-smile", "parent_id": "t1_dg9n76g", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Why do you think she was definitely involved?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why do you think she was definitely involved?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dga3386", "score_hidden": false, "stickied": false, "created": 1492248639.0, "created_utc": 1492219839.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9n76g", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "redddddditaccount", "parent_id": "t1_dg9mboh", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Definitely! The Dateline was very well done, IMO. What stuck out to me was the fact that Juliana refuses to talk to Kathy.  That, plus the 911 call and Kathy detailing the body the way that she did, makes me lean a little bit towards her guilt.\n\nBut Nancy Styler was *definitely* involved.  Not to mention she divorced Trey immediately following his confession, but had no problem collecting the life insurance policy once he was gone.\n\nSuch a sad case all the way around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely! The Dateline was very well done, IMO. What stuck out to me was the fact that Juliana refuses to talk to Kathy.  That, plus the 911 call and Kathy detailing the body the way that she did, makes me lean a little bit towards her guilt.&lt;/p&gt;\n\n&lt;p&gt;But Nancy Styler was &lt;em&gt;definitely&lt;/em&gt; involved.  Not to mention she divorced Trey immediately following his confession, but had no problem collecting the life insurance policy once he was gone.&lt;/p&gt;\n\n&lt;p&gt;Such a sad case all the way around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9n76g", "score_hidden": false, "stickied": false, "created": 1492228014.0, "created_utc": 1492199214.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9mboh", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "fakedaisies", "parent_id": "t3_65de2m", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Great write-up! I remember watching this Dateline. I came away thinking Carpenter was an odd duck but prob not guilty. I couldn't see a compelling motive for her to kill her friend, although Nancy Pfister could be difficult at times and their friendship had had its ups and downs. \n\nNancy Styler and her husband seemed the more likely suspects, though I think Nancy did the bulk of the work due to Trey's condition. They had the stronger motive, and had both been under considerable personal stress for years before they encountered the landlady they deemed a tyrant.\n\nStill, though, there are enough questions that I still wonder. An interesting case for sure!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great write-up! I remember watching this Dateline. I came away thinking Carpenter was an odd duck but prob not guilty. I couldn&amp;#39;t see a compelling motive for her to kill her friend, although Nancy Pfister could be difficult at times and their friendship had had its ups and downs. &lt;/p&gt;\n\n&lt;p&gt;Nancy Styler and her husband seemed the more likely suspects, though I think Nancy did the bulk of the work due to Trey&amp;#39;s condition. They had the stronger motive, and had both been under considerable personal stress for years before they encountered the landlady they deemed a tyrant.&lt;/p&gt;\n\n&lt;p&gt;Still, though, there are enough questions that I still wonder. An interesting case for sure!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9mboh", "score_hidden": false, "stickied": false, "created": 1492226964.0, "created_utc": 1492198164.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": "", "user_reports": [], "id": "dg9nczl", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "redddddditaccount", "parent_id": "t1_dg9ncc4", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Oops!! I didn't even notice! Thanks :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oops!! I didn&amp;#39;t even notice! Thanks :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9nczl", "score_hidden": false, "stickied": false, "created": 1492228208.0, "created_utc": 1492199408.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ncc4", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "bciudthrowaway", "parent_id": "t3_65de2m", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "&gt; Trey and Nancy **Pfister** were arrested after a city worker found a garbage bag containing a bloody hammer, a car payment receipt with the Styler's name on it, \n\nmight wanna fix that, confused me for a moment :p", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Trey and Nancy &lt;strong&gt;Pfister&lt;/strong&gt; were arrested after a city worker found a garbage bag containing a bloody hammer, a car payment receipt with the Styler&amp;#39;s name on it, &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;might wanna fix that, confused me for a moment :p&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dg9ncc4", "score_hidden": false, "stickied": false, "created": 1492228186.0, "created_utc": 1492199386.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": "", "user_reports": [], "id": "dgale1b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "redddddditaccount", "parent_id": "t1_dgaghlx", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I did a quick Google/YouTube search and unfortunately it doesn't appear to be anywhere online in full. There are snippets of the episode out there, though! It was a two-hour episode and it was extremely intriguing! I hope you can find it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did a quick Google/YouTube search and unfortunately it doesn&amp;#39;t appear to be anywhere online in full. There are snippets of the episode out there, though! It was a two-hour episode and it was extremely intriguing! I hope you can find it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgale1b", "score_hidden": false, "stickied": false, "created": 1492288230.0, "created_utc": 1492259430.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaghlx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ElectricGypsy", "parent_id": "t3_65de2m", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Fantastic write up!!    This is such an intriguing case, and I would love to see the Dateline episode that featured it.\n\nIs it available online anywhere?  Thanks so much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fantastic write up!!    This is such an intriguing case, and I would love to see the Dateline episode that featured it.&lt;/p&gt;\n\n&lt;p&gt;Is it available online anywhere?  Thanks so much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgaghlx", "score_hidden": false, "stickied": false, "created": 1492273722.0, "created_utc": 1492244922.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": "", "user_reports": [], "id": "dgay79f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sobadatsnazzynames", "parent_id": "t3_65de2m", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "This was on Dateline recently I think (a rerun). I remember it saying they seriously twisted the words of the best friend", "edited": 1492392620.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was on Dateline recently I think (a rerun). I remember it saying they seriously twisted the words of the best friend&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgay79f", "score_hidden": false, "stickied": false, "created": 1492308128.0, "created_utc": 1492279328.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65de2m", "likes": null, "replies": "", "user_reports": [], "id": "dgbzkgn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Aroha11", "parent_id": "t3_65de2m", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "When you are talking about both Stylers it should be spelled 'Stylers', without an apostrophe. 'Styler' is singular, 'Stylers' plural. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you are talking about both Stylers it should be spelled &amp;#39;Stylers&amp;#39;, without an apostrophe. &amp;#39;Styler&amp;#39; is singular, &amp;#39;Stylers&amp;#39; plural. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgbzkgn", "score_hidden": false, "stickied": false, "created": 1492375408.0, "created_utc": 1492346608.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]