[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "UnresolvedMysteries", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Here is my &lt;a href=\"https://www.reddit.com/r/UnresolvedMysteries/comments/65irwh/the_mysterious_case_of_the_mad_gasser/\"&gt;last post&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;&lt;em&gt;Seattle Mass Hysteria?&lt;/em&gt;&lt;/h1&gt;\n\n&lt;h2&gt;&lt;em&gt;IT BEGINS&lt;/em&gt;&lt;/h2&gt;\n\n&lt;p&gt;The strange phenomena started in late March, 1954, when tiny pits in automobile windshields were first reported to the police in the northwestern Washington community of Bellingham. The small size of the pits led police to believe that the damage had been the work of vandals using buckshot or BBs. &lt;/p&gt;\n\n&lt;p&gt;Then, within a week, a few residents in Sedro Wooley and Mount Vernon, 25 miles south of Bellingham, also began noticing damage to their windshields. By the second week of April, the &amp;quot;vandals&amp;quot; had attacked further south in the town of Anacortes on Fidalgo Island. Losing no time, all available law enforcement officers in the area sped to town in the hope of apprehending the culprits. Road blocks were set up south of town, and all cars leaving or entering the city were given a detailed once-over, as were their drivers and passengers to no avail.&lt;/p&gt;\n\n&lt;h2&gt;&lt;em&gt;THEY&amp;#39;RE GETTING CLOSER!&lt;/em&gt;&lt;/h2&gt;\n\n&lt;p&gt;Farther south, cars at the Whidbey Island Naval Air Station in Oak Harbor were discovered to have the same mysterious dings. Nearly 75 Marines made an intensive five-hour search of the station looking for evidence -anything that might lead to the source of the mystery. They came up empty, yet by the end of the day, more than 2,000 cars from Bellingham to Oak Harbor were reported as having been damaged.&lt;/p&gt;\n\n&lt;p&gt;Two thing became abundantly clear: This could not be the work of roving hooligans; and whatever was causing windshield pits and dings was rapidly approaching Seattle.&lt;/p&gt;\n\n&lt;h2&gt;&lt;em&gt;SEATTLE UNDER SIEGE&lt;/em&gt;&lt;/h2&gt;\n\n&lt;p&gt;On the morning of April 14, Seattle newspapers ran front-page reports of the events that had transpired to the north. The afternoon papers carried similar stories. At 6 PM a report cam in to the Seattle police that three cars had been damaged in a lot at 6th Avenue and John Street. At 9 PM a motorist reported that his windshield had been hit at North 82nd Street. Then the floodgates opened.&lt;/p&gt;\n\n&lt;p&gt;Motorists began stopping police cars on the street to report windshield damage. Parking lots and auto sale lots were hit. Even police cars parked in front of precinct stations suffered damage. Extra clerks were brought into the station to answer the flurry of calls from angry and perplexed car owners. By the next morning, windshield pitting had reached epidemic levels.&lt;/p&gt;\n\n&lt;h2&gt;&lt;em&gt;GLASS MENAGERIE&lt;/em&gt;&lt;/h2&gt;\n\n&lt;p&gt;The sheer numbers of the damaged windshields ruled out hoodlums, and experts couldn&amp;#39;t explain the strange pits and holes appearing out of nowhere. &lt;/p&gt;\n\n&lt;h3&gt;&lt;strong&gt;&lt;em&gt;Theories&lt;/em&gt;&lt;/strong&gt;&lt;/h3&gt;\n\n&lt;p&gt;• &lt;em&gt;On Whidbey Island, Sheriff Tom Clark postulated that radioactivity released by recent H-bomb tests in the South Pacific was peppering windshields. Geiger counters were run over windshield glass, but all were free of radioactivity. Still, the sheriff held firm that &amp;quot;no human agency&amp;quot; could have created the scars on the glass.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;• &lt;em&gt;Some thought that the Navy&amp;#39;s new million-watt radio transmitter at Jim Creek near Arlington was converting electronic oscillations to physical oscillations in the glass. Navy Commander George Warren called this theory &amp;quot;completely absurd.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;• &lt;em&gt;Cosmic rays bombarding the Earth from the sun were considered, but since so little was known about cosmic rays, this theory could be neither proved nor refuted.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;• &lt;em&gt;A mysterious atmospheric event was theorized (although no one could explain exactly what kind that would be).&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;• &lt;em&gt;A few people reported seeing the glass bubble right before their eyes, leading some to postulate that sand-flea eggs had somehow been laid in the glass and were now hatching.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;• &lt;em&gt;Alternative suggestions: supersonic sound waves, non-radioactive core debris from nuclear bomb tests, or a shift in the Earth&amp;#39;s magnetic field. Other folks simply blamed the event on gremlins.&lt;/em&gt;&lt;/p&gt;\n\n&lt;h2&gt;&lt;strong&gt;So?..what is it?&lt;/strong&gt;&lt;/h2&gt;\n\n&lt;p&gt;By April 15, 1954, police were swamped with calls. Close to 3,000 windshields had been reported as being pitted, and no one knew what to do. Desperate, Seattle Mayor Allan Pomeroy first wired Washington Governor Langlie, then President Eisenhower.&lt;/p&gt;\n\n&lt;p&gt;What appeared to be a localized outbreak of vandalism in damaged auto windshields and windows in northern Washington State has now spread through the Puget Sound area. Chemical analysis of mysterious powder adhering to damaged windshields and windows indicates the material may simply be spread by wind and not a police matter at all. Urge appropriate agencies be instructed to cooperate with local authorities on emergency basis.&lt;/p&gt;\n\n&lt;h2&gt;&lt;strong&gt;Investigation&lt;/strong&gt;&lt;/h2&gt;\n\n&lt;p&gt;King County Sheriff Harlan Callahan&amp;#39;s deputies examined 15,000 cars throughout the county, and found damage to more than 3,000 of them. The sheriff and his deputies felt that this level of damage could not be explained by ordinary road use. They also claimed they&amp;#39;d found odd little pellets near some of the cars, and that the pellets reacted &amp;quot;violently&amp;quot; when a lead pencil was placed next to them. (Nobody knows what this meant, though.)&lt;/p&gt;\n\n&lt;p&gt;Further investigation by the Seattle Police Department disproved the deputies&amp;#39; claims. The police determined that most of the dings pitted the windshields of older cars. In cases were auto lots were involved, brand new cars were unpitted; used cars were.&lt;/p&gt;\n\n&lt;p&gt;Although there were a few rare instances of &amp;quot;copycat&amp;quot; vandalism, most of the cases had a simple explanation: The pits had been there all along -only no one had noticed them until now. And by April 17, 1954, pitting incidents abruptly ceased.&lt;/p&gt;\n\n&lt;h2&gt;&lt;strong&gt;Mass Hysteria?&lt;/strong&gt;&lt;/h2&gt;\n\n&lt;p&gt;The Seattle Windshield Pitting Epidemic of 1954 became a textbook example of collective delusion, sometimes referred to as &amp;quot;mass hysteria.&amp;quot; To this day, sociologists and psychologists refer to the incident in their courses and writings alongside similar events, such as Orson Welles&amp;#39; War of the Worlds Martian invasion panic of 1938, and sightings of the &amp;quot;Jersey Devil&amp;quot; in 1909.&lt;/p&gt;\n\n&lt;p&gt;The Seattle pitting incident has all the key factors, including &lt;em&gt;ambiguity&lt;/em&gt;, &lt;em&gt;the spread of rumors and false but plausible beliefs&lt;/em&gt;, &lt;em&gt;mass media influence&lt;/em&gt;, &lt;em&gt;recent geopolitical events&lt;/em&gt;, and &lt;em&gt;the reinforcement of false beliefs by authority figures&lt;/em&gt; (in this case, the police, military, and political figures). &lt;/p&gt;\n\n&lt;p&gt;This combination of factors -added to the simple fact that for the first time people actually looked at their windshields instead of through them- caused the hubbub. No vandals. No atomic fallout. No sand fleas. No cosmic rays. No electronic oscillations. Just a bunch of window dings that were there from the start.&lt;/p&gt;\n\n&lt;p&gt;What are your thoughts? This case confuses me... Mass hysteria is one thing, but proof cars WERE damaged?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.m.wikipedia.org/wiki/Seattle_windshield_pitting_epidemic\"&gt;The Wikipedia&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Here is my [last post](https://www.reddit.com/r/UnresolvedMysteries/comments/65irwh/the_mysterious_case_of_the_mad_gasser/)\n\n#*Seattle Mass Hysteria?*\n\n\n##*IT BEGINS*\n\nThe strange phenomena started in late March, 1954, when tiny pits in automobile windshields were first reported to the police in the northwestern Washington community of Bellingham. The small size of the pits led police to believe that the damage had been the work of vandals using buckshot or BBs. \n\n\nThen, within a week, a few residents in Sedro Wooley and Mount Vernon, 25 miles south of Bellingham, also began noticing damage to their windshields. By the second week of April, the \"vandals\" had attacked further south in the town of Anacortes on Fidalgo Island. Losing no time, all available law enforcement officers in the area sped to town in the hope of apprehending the culprits. Road blocks were set up south of town, and all cars leaving or entering the city were given a detailed once-over, as were their drivers and passengers to no avail.\n\n##*THEY'RE GETTING CLOSER!*\n\nFarther south, cars at the Whidbey Island Naval Air Station in Oak Harbor were discovered to have the same mysterious dings. Nearly 75 Marines made an intensive five-hour search of the station looking for evidence -anything that might lead to the source of the mystery. They came up empty, yet by the end of the day, more than 2,000 cars from Bellingham to Oak Harbor were reported as having been damaged.\n\n\nTwo thing became abundantly clear: This could not be the work of roving hooligans; and whatever was causing windshield pits and dings was rapidly approaching Seattle.\n\n\n##*SEATTLE UNDER SIEGE*\n\n\nOn the morning of April 14, Seattle newspapers ran front-page reports of the events that had transpired to the north. The afternoon papers carried similar stories. At 6 PM a report cam in to the Seattle police that three cars had been damaged in a lot at 6th Avenue and John Street. At 9 PM a motorist reported that his windshield had been hit at North 82nd Street. Then the floodgates opened.\n\nMotorists began stopping police cars on the street to report windshield damage. Parking lots and auto sale lots were hit. Even police cars parked in front of precinct stations suffered damage. Extra clerks were brought into the station to answer the flurry of calls from angry and perplexed car owners. By the next morning, windshield pitting had reached epidemic levels.\n\n\n##*GLASS MENAGERIE*\n\n\nThe sheer numbers of the damaged windshields ruled out hoodlums, and experts couldn't explain the strange pits and holes appearing out of nowhere. \n\n\n###***Theories***\n\n• *On Whidbey Island, Sheriff Tom Clark postulated that radioactivity released by recent H-bomb tests in the South Pacific was peppering windshields. Geiger counters were run over windshield glass, but all were free of radioactivity. Still, the sheriff held firm that \"no human agency\" could have created the scars on the glass.*\n\n• *Some thought that the Navy's new million-watt radio transmitter at Jim Creek near Arlington was converting electronic oscillations to physical oscillations in the glass. Navy Commander George Warren called this theory \"completely absurd.\"*\n\n• *Cosmic rays bombarding the Earth from the sun were considered, but since so little was known about cosmic rays, this theory could be neither proved nor refuted.*\n\n• *A mysterious atmospheric event was theorized (although no one could explain exactly what kind that would be).*\n\n• *A few people reported seeing the glass bubble right before their eyes, leading some to postulate that sand-flea eggs had somehow been laid in the glass and were now hatching.*\n\n• *Alternative suggestions: supersonic sound waves, non-radioactive core debris from nuclear bomb tests, or a shift in the Earth's magnetic field. Other folks simply blamed the event on gremlins.*\n\n\n##**So?..what is it?**\n\nBy April 15, 1954, police were swamped with calls. Close to 3,000 windshields had been reported as being pitted, and no one knew what to do. Desperate, Seattle Mayor Allan Pomeroy first wired Washington Governor Langlie, then President Eisenhower.\n\nWhat appeared to be a localized outbreak of vandalism in damaged auto windshields and windows in northern Washington State has now spread through the Puget Sound area. Chemical analysis of mysterious powder adhering to damaged windshields and windows indicates the material may simply be spread by wind and not a police matter at all. Urge appropriate agencies be instructed to cooperate with local authorities on emergency basis.\n\n\n##**Investigation**\n\nKing County Sheriff Harlan Callahan's deputies examined 15,000 cars throughout the county, and found damage to more than 3,000 of them. The sheriff and his deputies felt that this level of damage could not be explained by ordinary road use. They also claimed they'd found odd little pellets near some of the cars, and that the pellets reacted \"violently\" when a lead pencil was placed next to them. (Nobody knows what this meant, though.)\n\n\nFurther investigation by the Seattle Police Department disproved the deputies' claims. The police determined that most of the dings pitted the windshields of older cars. In cases were auto lots were involved, brand new cars were unpitted; used cars were.\n\n\nAlthough there were a few rare instances of \"copycat\" vandalism, most of the cases had a simple explanation: The pits had been there all along -only no one had noticed them until now. And by April 17, 1954, pitting incidents abruptly ceased.\n\n\n\n##**Mass Hysteria?**\n\nThe Seattle Windshield Pitting Epidemic of 1954 became a textbook example of collective delusion, sometimes referred to as \"mass hysteria.\" To this day, sociologists and psychologists refer to the incident in their courses and writings alongside similar events, such as Orson Welles' War of the Worlds Martian invasion panic of 1938, and sightings of the \"Jersey Devil\" in 1909.\n\n\nThe Seattle pitting incident has all the key factors, including *ambiguity*, *the spread of rumors and false but plausible beliefs*, *mass media influence*, *recent geopolitical events*, and *the reinforcement of false beliefs by authority figures* (in this case, the police, military, and political figures). \n\nThis combination of factors -added to the simple fact that for the first time people actually looked at their windshields instead of through them- caused the hubbub. No vandals. No atomic fallout. No sand fleas. No cosmic rays. No electronic oscillations. Just a bunch of window dings that were there from the start.\n\n\nWhat are your thoughts? This case confuses me... Mass hysteria is one thing, but proof cars WERE damaged?\n\n\n[The Wikipedia](https://en.m.wikipedia.org/wiki/Seattle_windshield_pitting_epidemic)\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Unexplained Phenomena", "id": "65ze8k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 33, "report_reasons": null, "author": "ieatspacedust", "saved": false, "mod_reports": [], "name": "t3_65ze8k", "subreddit_name_prefixed": "r/UnresolvedMysteries", "approved_by": null, "over_18": false, "domain": "self.UnresolvedMysteries", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2wvvc", "edited": false, "link_flair_css_class": "unphe", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/UnresolvedMysteries/comments/65ze8k/the_weird_case_of_possible_mass_hysteria/", "num_reports": null, "locked": false, "stickied": false, "created": 1492502790.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/65ze8k/the_weird_case_of_possible_mass_hysteria/", "author_flair_text": null, "quarantine": false, "title": "The Weird Case of Possible Mass Hysteria", "created_utc": 1492473990.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 33}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65ze8k", "likes": null, "replies": "", "user_reports": [], "id": "dgeddmb", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "KaseyMcFly", "parent_id": "t3_65ze8k", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Wow this is incredibly interesting! Great write up! I'm going to read more into this and I'll comment further but I wanted to let you know I really enjoyed this!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow this is incredibly interesting! Great write up! I&amp;#39;m going to read more into this and I&amp;#39;ll comment further but I wanted to let you know I really enjoyed this!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgeddmb", "score_hidden": false, "stickied": false, "created": 1492503322.0, "created_utc": 1492474522.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65ze8k", "likes": null, "replies": "", "user_reports": [], "id": "dgei1i2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "hectorabaya", "parent_id": "t3_65ze8k", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "I heard about this on some podcast a few months ago. It's a really interesting case! I think mass hysteria is quite likely, though. I would have sworn my windshield was in pristine condition, but just out of curiosity, I went and inspected it far more closely than I ever normally do. Sure enough, I found some little nicks and pits that I had no idea were there. They're invisible unless you get really close and pore over it.\n\nI mean, how often do you really inspect the surface of your windshield? I clean mine off when I get gas but that's about as much as I think about it unless there's a large chip or crack. And even the big ones can be easier to forget about than you'd think. I never used to fix chips on my windshield unless they were really bad and there were a few times something would draw my attention to one and I wouldn't be able to recall if it had always been there or not. It's the visual equivalent of not being able to smell an odor you've grown accustomed to.\n\nThis is a great write-up and a great story. Thanks for posting it!\n\nedit: I led off with the comment about the podcast because that's what prompted my windshield inspection; it seemed relevant to me as it was already dark where I am when I was reading your post. ;) I just want to clarify that as I realized it could come across as a little snarky.", "edited": 1492482438.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I heard about this on some podcast a few months ago. It&amp;#39;s a really interesting case! I think mass hysteria is quite likely, though. I would have sworn my windshield was in pristine condition, but just out of curiosity, I went and inspected it far more closely than I ever normally do. Sure enough, I found some little nicks and pits that I had no idea were there. They&amp;#39;re invisible unless you get really close and pore over it.&lt;/p&gt;\n\n&lt;p&gt;I mean, how often do you really inspect the surface of your windshield? I clean mine off when I get gas but that&amp;#39;s about as much as I think about it unless there&amp;#39;s a large chip or crack. And even the big ones can be easier to forget about than you&amp;#39;d think. I never used to fix chips on my windshield unless they were really bad and there were a few times something would draw my attention to one and I wouldn&amp;#39;t be able to recall if it had always been there or not. It&amp;#39;s the visual equivalent of not being able to smell an odor you&amp;#39;ve grown accustomed to.&lt;/p&gt;\n\n&lt;p&gt;This is a great write-up and a great story. Thanks for posting it!&lt;/p&gt;\n\n&lt;p&gt;edit: I led off with the comment about the podcast because that&amp;#39;s what prompted my windshield inspection; it seemed relevant to me as it was already dark where I am when I was reading your post. ;) I just want to clarify that as I realized it could come across as a little snarky.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgei1i2", "score_hidden": false, "stickied": false, "created": 1492509094.0, "created_utc": 1492480294.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65ze8k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wvvc", "removal_reason": null, "link_id": "t3_65ze8k", "likes": null, "replies": "", "user_reports": [], "id": "dgejwq0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hamdinger125", "parent_id": "t1_dgehazb", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "That's exactly what I thought.  Maybe there was something in the glass that manufacturers stopped using at a certain point.  That would explain why it was always older cars that were damaged.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s exactly what I thought.  Maybe there was something in the glass that manufacturers stopped using at a certain point.  That would explain why it was always older cars that were damaged.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgejwq0", "score_hidden": false, "stickied": false, "created": 1492511287.0, "created_utc": 1492482487.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgehazb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SaltySeahorses", "parent_id": "t3_65ze8k", "subreddit_name_prefixed": "r/UnresolvedMysteries", "controversiality": 0, "body": "Well I would definitely have checked the make of the cars, the manufacturers or, in the alternative, the supplier of the windshields. Could just be a product defect. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I would definitely have checked the make of the cars, the manufacturers or, in the alternative, the supplier of the windshields. Could just be a product defect. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "UnresolvedMysteries", "name": "t1_dgehazb", "score_hidden": false, "stickied": false, "created": 1492508220.0, "created_utc": 1492479420.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]