[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "UnresolvedMysteries", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;April Jean Sorensen (nee. Larson) was born March 26, 1980 in Albert Lea, Minnesota. She was 27 when she was stabbed and strangled in her home in Rochester, MN on April 17, 2007.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;BACKGROUND&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;April married Joshua Sorensen in August of 2003. She lived and worked in Rochester, Minnesota with her husband and planned to become a dental hygienist. Joshua worked for IBM and April worked for UPS inc in NW Rochester. April was taking classes at the local community college (RCTC). April and Joshua had lived in their home for four years until she was murdered&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TIMELINE OF 4/17/07&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;4:00am – 8:00am&lt;/em&gt;: April works the early morning shift at UPS inc&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;10:00am – 10:50am&lt;/em&gt;: April attends class on campus at RCTC&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;between the hours of 10:50am – 12:30pm&lt;/em&gt;: April is murdered in her home and her house set ablaze&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;12:30pm&lt;/em&gt;: April&amp;#39;s TV technician calls 911 after seeing smoke coming from inside the house.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;sometime after 12:30pm&lt;/em&gt;: Investigators arrive on scene to find April&amp;#39;s body in the bedroom of her home after the fire was extinguished. It was isolated in their bedroom. They determine the fire was not an accident. Autopsy reports would later confirm that April had been stabbed and strangled to death. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;INVESTIGATION&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Joshua and the TV serviceman have been cleared of the crime. Josh had an airtight alibi. IBM has a very secure corporate campus and he was working during the time of the murder. The TV serviceman was cleared due to the confirmation he had just arrived to the scene based on his work schedule for the day. Josh moved away from Rochester after the murder. &lt;/p&gt;\n\n&lt;p&gt;Rochester police worked with the FBI to create a potential suspect profile. &amp;quot;It&amp;#39;s safe to assume the attacker was a single male who likely blends into residential neighborhoods easily without raising suspicion... the offender was comfortable being in a strangers home uninvited... [indicating] he likely had burgled or stolen property from other homes&amp;quot;. Minnesota Bureau of Criminal Investigations and Rochester police have interviewed hundreds of people during the course of the investigation, however there are a number of individuals they have never been able to fully eliminate. This includes &amp;quot;one strong suspect&amp;quot; who is currently serving time for another crime.&lt;/p&gt;\n\n&lt;p&gt;DNA evidence has been collected by investigators, but they fail to specify what was found or where it was found. There has been no match so far. The fire, however, destroyed a lot of potential evidence that could help investigators solve the case. Police think that DNA technology will eventually improve enough to identify April&amp;#39;s killer.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;SPECULATIONS&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Here are my possibilities for the suspect:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;ul&gt;\n&lt;li&gt;April and Joshua&amp;#39;s home was approximately 15 minutes away from the RCTC campus. Someone followed her during her drive from campus to her home. Is it unlikely that a random stranger followed her all the way home to kill her? Maybe. But female college students have been targeted before. The RCTC parking lot is also quite large (I believe there are 3 separate lots) and mostly unsecured – I took PSEO classes there from 2012-14 and even at that point there were times where I was uncomfortable walking to my car alone in the middle of the day. &lt;/li&gt;\n&lt;li&gt;The killer was &amp;quot;just passing through the neighborhood&amp;quot;. This is the &amp;#39;theory&amp;#39; I hate the most, but is one still employed by the Rochester PD as a possibility.&lt;/li&gt;\n&lt;li&gt;The killer knew April. Again, a theory I don&amp;#39;t like as much because as far as I can find, everyone that knew April loved her. However, we never truly know what happens behind closed doors. &lt;/li&gt;\n&lt;li&gt;It is also possible a single young man out there was obsessed with April. Someone in her neighborhood, at her job or in her classes that had unsuccessful attempts to win her affections. This, however, is just pure speculation on my part, there is no evidence to show that &lt;em&gt;if&lt;/em&gt; someone was obsessed with her, that anyone(April, her husband, RPD) knew about it. But, if someone was obsessed with her, April had a relatively set schedule as most college students do. And supposedly people in the neighborhood believed there was a &amp;quot;squatter&amp;quot; in the abandoned house across the street. I cannot however find any hard evidence to back up that there was an abandoned house in the neighborhood though because most of the histories listed online only go back as far as 2011 and are not very detailed. &lt;/li&gt;\n&lt;/ul&gt;\n&lt;/blockquote&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;I am uncomfortable with the fact that the Rochester PD is not subjecting us with the knowledge of what DNA evidence they found at the scene. I don&amp;#39;t know an awful lot about police work, but I cannot seem to think of a valid reason why that information would be kept from the public. Also, could DNA technology improve enough to prove without a reasonable doubt who April&amp;#39;s killer is? Hard to say, especially when we don&amp;#39;t know what that evidence may be, but it is curious that RPD believe this.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Same with the strong suspect who is currently serving time (I&amp;#39;m going to refer to as &amp;#39;them&amp;#39; since there is no indication if they are male or female). They are already in the clink, but can the RPD not still investigate into them? RPD does still look into April&amp;#39;s case and still receives tips on it, why would RPD not look into their strong suspect, regardless of whether or not they were in jail? (Again, I don&amp;#39;t know enough about policing to know whether or not this is a possibility because of the fact that they are serving jail time)&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;What are your thoughts on April&amp;#39;s murder?&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;sources&lt;/em&gt; &lt;a href=\"http://www.postbulletin.com/news/crime/officials-remind-public-of-unsolved-sorensen-murder/article_d31414cb-502c-5884-82e1-f5b53903c246.html\"&gt;x&lt;/a&gt; &lt;a href=\"http://www.nbcnews.com/feature/cold-case-spotlight/10-years-later-officials-are-still-investigating-small-town-s-n742426\"&gt;x&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "April Jean Sorensen (nee. Larson) was born March 26, 1980 in Albert Lea, Minnesota. She was 27 when she was stabbed and strangled in her home in Rochester, MN on April 17, 2007.\n\n**BACKGROUND**\n\nApril married Joshua Sorensen in August of 2003. She lived and worked in Rochester, Minnesota with her husband and planned to become a dental hygienist. Joshua worked for IBM and April worked for UPS inc in NW Rochester. April was taking classes at the local community college (RCTC). April and Joshua had lived in their home for four years until she was murdered\n\n**TIMELINE OF 4/17/07**\n\n&gt;*4:00am – 8:00am*: April works the early morning shift at UPS inc\n\n&gt;*10:00am – 10:50am*: April attends class on campus at RCTC\n\n&gt;*between the hours of 10:50am – 12:30pm*: April is murdered in her home and her house set ablaze\n\n&gt;*12:30pm*: April's TV technician calls 911 after seeing smoke coming from inside the house.\n\n&gt;*sometime after 12:30pm*: Investigators arrive on scene to find April's body in the bedroom of her home after the fire was extinguished. It was isolated in their bedroom. They determine the fire was not an accident. Autopsy reports would later confirm that April had been stabbed and strangled to death. \n\n**INVESTIGATION**\n\nJoshua and the TV serviceman have been cleared of the crime. Josh had an airtight alibi. IBM has a very secure corporate campus and he was working during the time of the murder. The TV serviceman was cleared due to the confirmation he had just arrived to the scene based on his work schedule for the day. Josh moved away from Rochester after the murder. \n\nRochester police worked with the FBI to create a potential suspect profile. \"It's safe to assume the attacker was a single male who likely blends into residential neighborhoods easily without raising suspicion... the offender was comfortable being in a strangers home uninvited... [indicating] he likely had burgled or stolen property from other homes\". Minnesota Bureau of Criminal Investigations and Rochester police have interviewed hundreds of people during the course of the investigation, however there are a number of individuals they have never been able to fully eliminate. This includes \"one strong suspect\" who is currently serving time for another crime.\n\nDNA evidence has been collected by investigators, but they fail to specify what was found or where it was found. There has been no match so far. The fire, however, destroyed a lot of potential evidence that could help investigators solve the case. Police think that DNA technology will eventually improve enough to identify April's killer.\n\n**SPECULATIONS**\n\nHere are my possibilities for the suspect:\n&gt;* April and Joshua's home was approximately 15 minutes away from the RCTC campus. Someone followed her during her drive from campus to her home. Is it unlikely that a random stranger followed her all the way home to kill her? Maybe. But female college students have been targeted before. The RCTC parking lot is also quite large (I believe there are 3 separate lots) and mostly unsecured – I took PSEO classes there from 2012-14 and even at that point there were times where I was uncomfortable walking to my car alone in the middle of the day. \n&gt;* The killer was \"just passing through the neighborhood\". This is the 'theory' I hate the most, but is one still employed by the Rochester PD as a possibility.\n&gt;* The killer knew April. Again, a theory I don't like as much because as far as I can find, everyone that knew April loved her. However, we never truly know what happens behind closed doors. \n&gt;* It is also possible a single young man out there was obsessed with April. Someone in her neighborhood, at her job or in her classes that had unsuccessful attempts to win her affections. This, however, is just pure speculation on my part, there is no evidence to show that *if* someone was obsessed with her, that anyone(April, her husband, RPD) knew about it. But, if someone was obsessed with her, April had a relatively set schedule as most college students do. And supposedly people in the neighborhood believed there was a \"squatter\" in the abandoned house across the street. I cannot however find any hard evidence to back up that there was an abandoned house in the neighborhood though because most of the histories listed online only go back as far as 2011 and are not very detailed. \n\n* I am uncomfortable with the fact that the Rochester PD is not subjecting us with the knowledge of what DNA evidence they found at the scene. I don't know an awful lot about police work, but I cannot seem to think of a valid reason why that information would be kept from the public. Also, could DNA technology improve enough to prove without a reasonable doubt who April's killer is? Hard to say, especially when we don't know what that evidence may be, but it is curious that RPD believe this.\n\n* Same with the strong suspect who is currently serving time (I'm going to refer to as 'them' since there is no indication if they are male or female). They are already in the clink, but can the RPD not still investigate into them? RPD does still look into April's case and still receives tips on it, why would RPD not look into their strong suspect, regardless of whether or not they were in jail? (Again, I don't know enough about policing to know whether or not this is a possibility because of the fact that they are serving jail time)\n\nWhat are your thoughts on April's murder?\n\n*sources* [x](http://www.postbulletin.com/news/crime/officials-remind-public-of-unsolved-sorensen-murder/article_d31414cb-502c-5884-82e1-f5b53903c246.html) [x](http://www.nbcnews.com/feature/cold-case-spotlight/10-years-later-officials-are-still-investigating-small-town-s-n742426)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Unresolved Murder", "id": "65zspc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "earthtomakayla", "saved": false, "mod_reports": [], "name": "t3_65zspc", "subreddit_name_prefixed": "r/UnresolvedMysteries", "approved_by": null, "over_18": false, "domain": "self.UnresolvedMysteries", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2wvvc", "edited": 1492478767.0, "link_flair_css_class": "unmur", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": true, "spoiler": false, "permalink": "/r/UnresolvedMysteries/comments/65zspc/10_years_ago_today_the_april_jean_sorensen_murder/", "num_reports": null, "locked": false, "stickied": false, "created": 1492507316.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/65zspc/10_years_ago_today_the_april_jean_sorensen_murder/", "author_flair_text": null, "quarantine": false, "title": "10 Years Ago Today – The April Jean Sorensen Murder", "created_utc": 1492478516.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]