[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "edmproduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Apologies if this does not fit in this subreddit. I felt it was appropriate because I am approaching this from an EDM producer&amp;#39;s perspective. Apologies if this has already been asked. Apologies for using the cheesy word underground.&lt;/p&gt;\n\n&lt;p&gt;As producers working hard, we want to be heard. The EDM scene has always had a unique, very cool advantage in solving the problem of connecting listeners to less-than-discovered artists making great stuff: DJs. These days however, I feel DJs are no longer serving this curation function. Pretty much every [genre] DJ I know/see just pirates the latest Top 100 [genre] Beatport Tracks of [year] and makes their set out of that.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;So, as a producer, I have decided to stop complaining about this and be the change I want to see.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;What are some ways I can optimize the process of finding this music? I want to find good tracks by producers who are not already famous. Soundcloud is nowhere near the tool for this that it used to be. It&amp;#39;s totally saturated with both poor-quality half-finished sketches and already discovered, highly successful music. Both things I don&amp;#39;t want. The original idea of soundcloud using likes and plays to automatically curate the content is pretty much a joke now with the amount of pay-for-plays/likes, bots, etc. For a given soundcloud listening binge, I feel that less than 1% of the content is workable.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m looking for general techniques, subreddits, blogs, podcasts, youtube channels, the threads where people asked this before, and whatever else you can suggest. Maybe soundcloud is a good tool for this and I just don&amp;#39;t know how to search properly. (I don&amp;#39;t claim to have any idea what I&amp;#39;m doing, I&amp;#39;m just a producer trying to contribute). I know that there are already great people doing this, I&amp;#39;m trying to find out how they do it, because I can&amp;#39;t imagine people have time to listen to thousands of tracks just to find 10 decent ones.&lt;/p&gt;\n\n&lt;p&gt;Also I should mention I don&amp;#39;t want to limit this to genres, but if it helps I do House, DnB, and Psytrance.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL,DR: Given that Soundcloud has too much content and a broken rating system, how in 2017 do I find good music by non-famous producers?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Apologies if this does not fit in this subreddit. I felt it was appropriate because I am approaching this from an EDM producer's perspective. Apologies if this has already been asked. Apologies for using the cheesy word underground.\n\nAs producers working hard, we want to be heard. The EDM scene has always had a unique, very cool advantage in solving the problem of connecting listeners to less-than-discovered artists making great stuff: DJs. These days however, I feel DJs are no longer serving this curation function. Pretty much every [genre] DJ I know/see just pirates the latest Top 100 [genre] Beatport Tracks of [year] and makes their set out of that.\n\n**So, as a producer, I have decided to stop complaining about this and be the change I want to see.**\n\nWhat are some ways I can optimize the process of finding this music? I want to find good tracks by producers who are not already famous. Soundcloud is nowhere near the tool for this that it used to be. It's totally saturated with both poor-quality half-finished sketches and already discovered, highly successful music. Both things I don't want. The original idea of soundcloud using likes and plays to automatically curate the content is pretty much a joke now with the amount of pay-for-plays/likes, bots, etc. For a given soundcloud listening binge, I feel that less than 1% of the content is workable.\n\nI'm looking for general techniques, subreddits, blogs, podcasts, youtube channels, the threads where people asked this before, and whatever else you can suggest. Maybe soundcloud is a good tool for this and I just don't know how to search properly. (I don't claim to have any idea what I'm doing, I'm just a producer trying to contribute). I know that there are already great people doing this, I'm trying to find out how they do it, because I can't imagine people have time to listen to thousands of tracks just to find 10 decent ones.\n\nAlso I should mention I don't want to limit this to genres, but if it helps I do House, DnB, and Psytrance.\n\n**TL,DR: Given that Soundcloud has too much content and a broken rating system, how in 2017 do I find good music by non-famous producers?**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657h8t", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "D1zz1", "saved": false, "mod_reports": [], "name": "t3_657h8t", "subreddit_name_prefixed": "r/edmproduction", "approved_by": null, "over_18": false, "domain": "self.edmproduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sa4x", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/edmproduction/comments/657h8t/what_are_some_ways_to_efficiently_discover_good/", "num_reports": null, "locked": false, "stickied": false, "created": 1492138373.0, "url": "https://www.reddit.com/r/edmproduction/comments/657h8t/what_are_some_ways_to_efficiently_discover_good/", "author_flair_text": null, "quarantine": false, "title": "What are some ways to efficiently discover good underground music?", "created_utc": 1492109573.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_657h8t", "likes": null, "replies": "", "user_reports": [], "id": "dg84ivh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Griffadoo", "parent_id": "t3_657h8t", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "Pick a producer you like, figure out who they like, and who that producer likes, and where they take influence from, and just follow the thread. Listen to mixes from your favorite artists and follow the trail from a song you don't recognize. \n\nThe biggest one for me is finding labels that promote the genres that I like. SATURATERECORDS, Gravitas, OTODAYO, Courteous Fam, whatever floats your boat. It's those peoples jobs to find and curate music, trust their judgement.\n\nAlso don't be afraid to listen to stuff you don't like. Try a new genre and cherry pick what you like about it, find a different genre that utilizes those aspects more to your tastes. You'll refine your 'taste' and it'll be easier to find what you like cuz you can be crazy specific.\n\nAlso Spotify has some good suggestion features. Their radio is pretty decent and their 'Just For You' mixes are interesting. They even have a whole playlist that's just predicting what you might like. \n\nGood luck on your search :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pick a producer you like, figure out who they like, and who that producer likes, and where they take influence from, and just follow the thread. Listen to mixes from your favorite artists and follow the trail from a song you don&amp;#39;t recognize. &lt;/p&gt;\n\n&lt;p&gt;The biggest one for me is finding labels that promote the genres that I like. SATURATERECORDS, Gravitas, OTODAYO, Courteous Fam, whatever floats your boat. It&amp;#39;s those peoples jobs to find and curate music, trust their judgement.&lt;/p&gt;\n\n&lt;p&gt;Also don&amp;#39;t be afraid to listen to stuff you don&amp;#39;t like. Try a new genre and cherry pick what you like about it, find a different genre that utilizes those aspects more to your tastes. You&amp;#39;ll refine your &amp;#39;taste&amp;#39; and it&amp;#39;ll be easier to find what you like cuz you can be crazy specific.&lt;/p&gt;\n\n&lt;p&gt;Also Spotify has some good suggestion features. Their radio is pretty decent and their &amp;#39;Just For You&amp;#39; mixes are interesting. They even have a whole playlist that&amp;#39;s just predicting what you might like. &lt;/p&gt;\n\n&lt;p&gt;Good luck on your search :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg84ivh", "score_hidden": false, "stickied": false, "created": 1492142266.0, "created_utc": 1492113466.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_657h8t", "likes": null, "replies": "", "user_reports": [], "id": "dg84nxp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Oremm", "parent_id": "t3_657h8t", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "\n\n\n\n \n\n&gt;These days however, I feel DJs are no longer serving this curation function. Pretty much every [genre] DJ I know/see just pirates the latest Top 100 [genre] Beatport Tracks of [year] and makes their set out of that.\n\nLiterally the definition of a shit DJ.  Curation is what matters.\n\n&gt;because I can't imagine people have time to listen to thousands of tracks just to find 10 decent ones.\n\nI have about a 7% purchase rate.  For every 100 tracks I preview, I will only buy 7 or 8.  Being so selective/picky is a key factor in why I've gotten better as a DJ over the last 2 years.  I also shy away from picking up any tracks if I hear it in another DJ's set unless it is something REALLY special.\n\nHere's my secret technique, feel free to adopt it:\n\nI stopped following individual artists and instead began following very specific record labels and sounds - for example, I follow Selador for their melodic techno and Innocent Music for their minimal.\n\nOnce you have your core sound followed, branch out by using the recommended similar tracks.  Both SoundCloud and Beatport do really well with their suggestions after you start them off with enough information.  (The \"Radio\" button on SC is fantastic.)  If a suggested track tickles your fancy, hit up that label and preview another 3-5 of their recent releases to decide if you'll follow that label also.  Rinse, repeat.\n\nI add follows almost as judiciously as I purchase tracks, so it never gets overwhelming.  I spend a few hours a week previewing, and I'll scan 300-500 tracks a month, and buy less than 30 on average.\n\nI'm primarily a DJ, and I can link you to my most recent set if you're interested in hearing the results.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;These days however, I feel DJs are no longer serving this curation function. Pretty much every [genre] DJ I know/see just pirates the latest Top 100 [genre] Beatport Tracks of [year] and makes their set out of that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Literally the definition of a shit DJ.  Curation is what matters.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;because I can&amp;#39;t imagine people have time to listen to thousands of tracks just to find 10 decent ones.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I have about a 7% purchase rate.  For every 100 tracks I preview, I will only buy 7 or 8.  Being so selective/picky is a key factor in why I&amp;#39;ve gotten better as a DJ over the last 2 years.  I also shy away from picking up any tracks if I hear it in another DJ&amp;#39;s set unless it is something REALLY special.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s my secret technique, feel free to adopt it:&lt;/p&gt;\n\n&lt;p&gt;I stopped following individual artists and instead began following very specific record labels and sounds - for example, I follow Selador for their melodic techno and Innocent Music for their minimal.&lt;/p&gt;\n\n&lt;p&gt;Once you have your core sound followed, branch out by using the recommended similar tracks.  Both SoundCloud and Beatport do really well with their suggestions after you start them off with enough information.  (The &amp;quot;Radio&amp;quot; button on SC is fantastic.)  If a suggested track tickles your fancy, hit up that label and preview another 3-5 of their recent releases to decide if you&amp;#39;ll follow that label also.  Rinse, repeat.&lt;/p&gt;\n\n&lt;p&gt;I add follows almost as judiciously as I purchase tracks, so it never gets overwhelming.  I spend a few hours a week previewing, and I&amp;#39;ll scan 300-500 tracks a month, and buy less than 30 on average.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m primarily a DJ, and I can link you to my most recent set if you&amp;#39;re interested in hearing the results.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg84nxp", "score_hidden": false, "stickied": false, "created": 1492142421.0, "created_utc": 1492113621.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_657h8t", "likes": null, "replies": "", "user_reports": [], "id": "dg86kfp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kingalok", "parent_id": "t3_657h8t", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "If you do Psytrance then Ektoplazm is one of the greatest sites for this. Amazing new music is uploaded there everyday. (plus its free!)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you do Psytrance then Ektoplazm is one of the greatest sites for this. Amazing new music is uploaded there everyday. (plus its free!)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg86kfp", "score_hidden": false, "stickied": false, "created": 1492144537.0, "created_utc": 1492115737.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_657h8t", "likes": null, "replies": "", "user_reports": [], "id": "dg91ckg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PM-ME-UR-DRUMMACHINE", "parent_id": "t3_657h8t", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "•These days however, I feel DJs are no longer serving this curation function. Pretty much every [genre] DJ I know/see just pirates the latest Top 100 [genre] Beatport Tracks of [year] and makes their set out of that.\r\rFind better DJs?\r\rRA has a great podcast. And it's overall a great source for all things underground when it comes to techno and house. Discogs as somebody mentioned is great. Then there are music stores like hardwax and and also record labels which consistently release quality music, but those you gotta find, for example using the sites mentioned above.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;•These days however, I feel DJs are no longer serving this curation function. Pretty much every [genre] DJ I know/see just pirates the latest Top 100 [genre] Beatport Tracks of [year] and makes their set out of that.&lt;/p&gt;\n\n&lt;p&gt;Find better DJs?&lt;/p&gt;\n\n&lt;p&gt;RA has a great podcast. And it&amp;#39;s overall a great source for all things underground when it comes to techno and house. Discogs as somebody mentioned is great. Then there are music stores like hardwax and and also record labels which consistently release quality music, but those you gotta find, for example using the sites mentioned above.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg91ckg", "score_hidden": false, "stickied": false, "created": 1492199289.0, "created_utc": 1492170489.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_657h8t", "likes": null, "replies": "", "user_reports": [], "id": "dg8f15j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WHERE_IS_ZEZIMA", "parent_id": "t3_657h8t", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "YouTube playlists are really underrated, also there are a ton of small YouTube channels that promote unknown artists that I subscribe to. I'd link some but I don't think they'd fit fit your tastes, you just got to find the small channels that do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;YouTube playlists are really underrated, also there are a ton of small YouTube channels that promote unknown artists that I subscribe to. I&amp;#39;d link some but I don&amp;#39;t think they&amp;#39;d fit fit your tastes, you just got to find the small channels that do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg8f15j", "score_hidden": false, "stickied": false, "created": 1492155189.0, "created_utc": 1492126389.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_657h8t", "likes": null, "replies": "", "user_reports": [], "id": "dg8gn9v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Y6Y1Y9", "parent_id": "t3_657h8t", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "For me lately, some of the new underground artists i've found i found through bigger name artists i like starting their own record labels. I got into this young new guy named Jai Wolf because he's signed to the label Odesza started and they promoted him and some of their other artists on Odesza's Instagram. Deadmau5 has Mau5trap. Oliver Heldens has Heldeep Records. Skrillex has OWSLA. So i'd say check to see if artists you like have their own record labels and check those artists out. Those artists will be tomorrow's big names.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me lately, some of the new underground artists i&amp;#39;ve found i found through bigger name artists i like starting their own record labels. I got into this young new guy named Jai Wolf because he&amp;#39;s signed to the label Odesza started and they promoted him and some of their other artists on Odesza&amp;#39;s Instagram. Deadmau5 has Mau5trap. Oliver Heldens has Heldeep Records. Skrillex has OWSLA. So i&amp;#39;d say check to see if artists you like have their own record labels and check those artists out. Those artists will be tomorrow&amp;#39;s big names.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg8gn9v", "score_hidden": false, "stickied": false, "created": 1492157377.0, "created_utc": 1492128577.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_657h8t", "likes": null, "replies": "", "user_reports": [], "id": "dg8lkx9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pro-53_King", "parent_id": "t3_657h8t", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "Discogs.  You can't download anything from the site, but pretty much any track ever made is catalogued and it heavily favors electronic music.  You'll get all the basic info on tracks/artists (along with other groups they've been involved in) and it lists recommendations for similar records. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Discogs.  You can&amp;#39;t download anything from the site, but pretty much any track ever made is catalogued and it heavily favors electronic music.  You&amp;#39;ll get all the basic info on tracks/artists (along with other groups they&amp;#39;ve been involved in) and it lists recommendations for similar records. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg8lkx9", "score_hidden": false, "stickied": false, "created": 1492164178.0, "created_utc": 1492135378.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_657h8t", "likes": null, "replies": "", "user_reports": [], "id": "dg8meqo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jtpinnyc", "parent_id": "t3_657h8t", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "Take a journey through YouTube's \"related videos\" that appears on the right hand side of its video pages. Just start with a track that you like and then click on a related video and another one and so on. I have found a ton of either new, unfamous artists or old obscure stuff that I would have never found otherwise. It's way better than Spotify. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take a journey through YouTube&amp;#39;s &amp;quot;related videos&amp;quot; that appears on the right hand side of its video pages. Just start with a track that you like and then click on a related video and another one and so on. I have found a ton of either new, unfamous artists or old obscure stuff that I would have never found otherwise. It&amp;#39;s way better than Spotify. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg8meqo", "score_hidden": false, "stickied": false, "created": 1492165337.0, "created_utc": 1492136537.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_657h8t", "likes": null, "replies": "", "user_reports": [], "id": "dg8vhq0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deepgeneral", "parent_id": "t3_657h8t", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "If you want true underground sounds checkout traxsource", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you want true underground sounds checkout traxsource&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg8vhq0", "score_hidden": false, "stickied": false, "created": 1492181705.0, "created_utc": 1492152905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_657h8t", "likes": null, "replies": "", "user_reports": [], "id": "dg8z9do", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rmandraque", "parent_id": "t3_657h8t", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "to be underground doesnt mean to find lesser known producers, its to find lesser known gems. So focus on finding quality, not lesser known. I think going through discogs and just following what artists post and use in sets are the best ways. And most importantly go slowly. I have 23gbs right now, of most really high quality underground releases, just waiting to listen to it, but I have to go slowly. If you are based in America you are going to have to learn that the more underground stuff is just promoted differently elsewere, but the worldwide deep electronic scene has been going really strong for over 20 years, the world didnt have the break the US did.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;to be underground doesnt mean to find lesser known producers, its to find lesser known gems. So focus on finding quality, not lesser known. I think going through discogs and just following what artists post and use in sets are the best ways. And most importantly go slowly. I have 23gbs right now, of most really high quality underground releases, just waiting to listen to it, but I have to go slowly. If you are based in America you are going to have to learn that the more underground stuff is just promoted differently elsewere, but the worldwide deep electronic scene has been going really strong for over 20 years, the world didnt have the break the US did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg8z9do", "score_hidden": false, "stickied": false, "created": 1492193288.0, "created_utc": 1492164488.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]