[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "edmproduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever enrolled in a general music theory course at your college/university? How was your experience? Was it worth it as far as applying it to your music production? What was the atmosphere like ?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Have you ever enrolled in a general music theory course at your college/university? How was your experience? Was it worth it as far as applying it to your music production? What was the atmosphere like ?\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ckiw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "osonator", "saved": false, "mod_reports": [], "name": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "approved_by": null, "over_18": false, "domain": "self.edmproduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sa4x", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/edmproduction/comments/65ckiw/music_theory_course_in_college/", "num_reports": null, "locked": false, "stickied": false, "created": 1492206077.0, "url": "https://www.reddit.com/r/edmproduction/comments/65ckiw/music_theory_course_in_college/", "author_flair_text": null, "quarantine": false, "title": "Music Theory course in college?", "created_utc": 1492177277.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg9mqqo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MCB_1", "parent_id": "t1_dg95shr", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I am taking Rudimentary Music Theory course online right now with an unrelated major at the Indiana University of South Bend. It doesn't feel like waste of my time or money. I am comfortable with spending a 5th year in school since I also work full time though. If you have a good prof (which is hard to control obviously) it is valuable knowledge!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am taking Rudimentary Music Theory course online right now with an unrelated major at the Indiana University of South Bend. It doesn&amp;#39;t feel like waste of my time or money. I am comfortable with spending a 5th year in school since I also work full time though. If you have a good prof (which is hard to control obviously) it is valuable knowledge!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg9mqqo", "score_hidden": false, "stickied": false, "created": 1492227464.0, "created_utc": 1492198664.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95shr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "illpicklesPS4", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I took a fundamentals theory class a couple years ago. It was a very basic entry level course and it did help some. My professor broke things down to the simplest he could but the material was still challenging for me. I do think it helped a lot with understanding chords and chord progressions. That being said I'm still not comfortable reading music fluently. And there is still loads to learn when it comes to music theory for me. \n\nHonestly I would only suggest going the college route if you plan on going deep and taking more theory/production classes. If you just want a basic understanding then you could save a bunch of money just by googling things. The website musictheory.net is great for this and they also have some fantastic apps such as the Theory Lessons and Tenuto app which are very reasonably priced. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took a fundamentals theory class a couple years ago. It was a very basic entry level course and it did help some. My professor broke things down to the simplest he could but the material was still challenging for me. I do think it helped a lot with understanding chords and chord progressions. That being said I&amp;#39;m still not comfortable reading music fluently. And there is still loads to learn when it comes to music theory for me. &lt;/p&gt;\n\n&lt;p&gt;Honestly I would only suggest going the college route if you plan on going deep and taking more theory/production classes. If you just want a basic understanding then you could save a bunch of money just by googling things. The website musictheory.net is great for this and they also have some fantastic apps such as the Theory Lessons and Tenuto app which are very reasonably priced. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg95shr", "score_hidden": false, "stickied": false, "created": 1492207237.0, "created_utc": 1492178437.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg9fkt3", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Fishmanmanfish", "parent_id": "t1_dg9btl5", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I took theory for music majors after I took the non-major classes. I had an \"audition\" with the dept chair just to make sure that I wouldn't hold the class back too much.\n\nThe classes were incredibly challenging. Most of the other kids had been playing classical for their entire life, so it seemed effortless to them- there were a lot of kids there for the jazz program and they had a wider range of proficiency. Overall, I was lucky to get a B in the classes, but I learned a lot and was challenged.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took theory for music majors after I took the non-major classes. I had an &amp;quot;audition&amp;quot; with the dept chair just to make sure that I wouldn&amp;#39;t hold the class back too much.&lt;/p&gt;\n\n&lt;p&gt;The classes were incredibly challenging. Most of the other kids had been playing classical for their entire life, so it seemed effortless to them- there were a lot of kids there for the jazz program and they had a wider range of proficiency. Overall, I was lucky to get a B in the classes, but I learned a lot and was challenged.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg9fkt3", "score_hidden": false, "stickied": false, "created": 1492218961.0, "created_utc": 1492190161.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9btl5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "averynicehat", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "At my school, the general music classes were SO basic (we called them \"clapping for credit\"), and the real ones required you to be a music major.  You'll get better results out of taking some private lessons - find a piano teacher with a focus on theory.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At my school, the general music classes were SO basic (we called them &amp;quot;clapping for credit&amp;quot;), and the real ones required you to be a music major.  You&amp;#39;ll get better results out of taking some private lessons - find a piano teacher with a focus on theory.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg9btl5", "score_hidden": false, "stickied": false, "created": 1492214755.0, "created_utc": 1492185955.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg969dt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "justcallmetom13", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I took the equivalent of a classical music appreciation class as a prerequisite and then I tried the beginners theory class for about a week or two but had to change classes.\n\nWith music classes, the teacher really makes it or breaks. For appreciation, you'll mostly listen to classical pieces, learn their composition and then learn the appropriate theory for those compositions. Very basic stuff but its a prereq for higher theory at my uni so you take it whether you like it or not.\n\nFor the short time I took beginners theory, I found to be like math, because fundamentally that is kind of what it is. You'll be taught with students ranging from complete beginners to experienced marching band people to aspiring solo artists and of course the obligatory \"I'm an EDM producer\" people. You'll get ear training lessons and you'll learn classical notation, scales, and other classical stuff.\n\nI've been producing for around 5 years now. I'm at the level where I can potentially make some money (might be releasing an EP soon). I would say I rarely use the knowledge I acquired in those classes other than classical inspiration. If you want to produce EDM, there are already tons of free resources online that I think are more applicable.\n\nI didn't mean for the answer to be so long winded but If you're a fresh high school graduate that wants to be an EDM producer, I would just dive in headfirst into online tutorials and just try remaking your favorite songs or making songs of your own but if you have space to fill on your schedule, it's a great option.\n\nTL;DR If you're looking for inspiration or a hole to fill in your class schedule, I recommend it, but the real applicable knowledge you get for production is from online resources and inspiration.", "edited": 1492179465.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took the equivalent of a classical music appreciation class as a prerequisite and then I tried the beginners theory class for about a week or two but had to change classes.&lt;/p&gt;\n\n&lt;p&gt;With music classes, the teacher really makes it or breaks. For appreciation, you&amp;#39;ll mostly listen to classical pieces, learn their composition and then learn the appropriate theory for those compositions. Very basic stuff but its a prereq for higher theory at my uni so you take it whether you like it or not.&lt;/p&gt;\n\n&lt;p&gt;For the short time I took beginners theory, I found to be like math, because fundamentally that is kind of what it is. You&amp;#39;ll be taught with students ranging from complete beginners to experienced marching band people to aspiring solo artists and of course the obligatory &amp;quot;I&amp;#39;m an EDM producer&amp;quot; people. You&amp;#39;ll get ear training lessons and you&amp;#39;ll learn classical notation, scales, and other classical stuff.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been producing for around 5 years now. I&amp;#39;m at the level where I can potentially make some money (might be releasing an EP soon). I would say I rarely use the knowledge I acquired in those classes other than classical inspiration. If you want to produce EDM, there are already tons of free resources online that I think are more applicable.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t mean for the answer to be so long winded but If you&amp;#39;re a fresh high school graduate that wants to be an EDM producer, I would just dive in headfirst into online tutorials and just try remaking your favorite songs or making songs of your own but if you have space to fill on your schedule, it&amp;#39;s a great option.&lt;/p&gt;\n\n&lt;p&gt;TL;DR If you&amp;#39;re looking for inspiration or a hole to fill in your class schedule, I recommend it, but the real applicable knowledge you get for production is from online resources and inspiration.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg969dt", "score_hidden": false, "stickied": false, "created": 1492207904.0, "created_utc": 1492179104.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg96i83", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Erratus", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "The possibility to have someone to ask about theory or talk to is worth it on it's own imo. That teacher can be beneficial in many ways.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The possibility to have someone to ask about theory or talk to is worth it on it&amp;#39;s own imo. That teacher can be beneficial in many ways.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg96i83", "score_hidden": false, "stickied": false, "created": 1492208240.0, "created_utc": 1492179440.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg9c8v5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PackThat", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I had to take two theory classes for my music minor and I'd say the consistent exposure had a positive impact on me and the music I wrote. I really feel they deepened my understandings of the theory I looked up online. We started with pitches and rhythms then combined them for the rhythmic dictation exercises. These greatly helped me to figure out how to play melodies of the songs I was listening to, making it less of a guess and test method. The classes also covered scales, triad formation, and chord progressions, which helped me plan the chords I could use for a song. I would jam out with different chord progressions and worked out rhythms that I though fit. This can be done without a course but the classes made it feel more natural. All in all, I was making more music when I took those courses which helped me refine the music that I was making. \n\nAs for atmosphere, I was in a room with a bunch of other people actually interested in making music as opposed to someone who likes listening to songs. This was great. Became friends with a kid who made tons of rap beats and another who produced metal tracks. They each had different perspectives and worked on different genres than I did, which I feel was great for feedback. Also, unlike my other friends, they didn't get as irritated when I wanted to show them what I've been working on. My nonmusic friends were supportive but grew tired of me showing the the same song 20 times with me tweaking one thing to it. Its really nice to share with others and to hear what others were making. \n\nI'm not a musical master by any means but these courses were definitely a step in the right direction. I would say to try one out, they felt slow at first but I found them to be worthwhile.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had to take two theory classes for my music minor and I&amp;#39;d say the consistent exposure had a positive impact on me and the music I wrote. I really feel they deepened my understandings of the theory I looked up online. We started with pitches and rhythms then combined them for the rhythmic dictation exercises. These greatly helped me to figure out how to play melodies of the songs I was listening to, making it less of a guess and test method. The classes also covered scales, triad formation, and chord progressions, which helped me plan the chords I could use for a song. I would jam out with different chord progressions and worked out rhythms that I though fit. This can be done without a course but the classes made it feel more natural. All in all, I was making more music when I took those courses which helped me refine the music that I was making. &lt;/p&gt;\n\n&lt;p&gt;As for atmosphere, I was in a room with a bunch of other people actually interested in making music as opposed to someone who likes listening to songs. This was great. Became friends with a kid who made tons of rap beats and another who produced metal tracks. They each had different perspectives and worked on different genres than I did, which I feel was great for feedback. Also, unlike my other friends, they didn&amp;#39;t get as irritated when I wanted to show them what I&amp;#39;ve been working on. My nonmusic friends were supportive but grew tired of me showing the the same song 20 times with me tweaking one thing to it. Its really nice to share with others and to hear what others were making. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a musical master by any means but these courses were definitely a step in the right direction. I would say to try one out, they felt slow at first but I found them to be worthwhile.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg9c8v5", "score_hidden": false, "stickied": false, "created": 1492215218.0, "created_utc": 1492186418.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg9nqd2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "singfx", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I think studying in college with face to face professors and peers that you can interact with is something that can't be replaced by reading a book/watching youtube tutorials.\n\nOf course you can learn anything by yourself, but enrolling in an actual course, having to do homework, having deadlines, assignments and projects...for me having a proper schedule and expectations from my professors and peers is what really drives me to study harder.\n\nMost music theory courses will start with really basic stuff (scales, triads, notation, etc...), but more advanced courses will develope into complex chord progressions, chord tensions, modal music and more...it will cover pretty much anything from classical music to the most modern and experimental music.\n\nBeing able to understand how music is written and composed helps a lot to expand your own writing abilities. Basically, you get a lot more 'tools' that you can create with. It's absolutely worth it for any music producer IMO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think studying in college with face to face professors and peers that you can interact with is something that can&amp;#39;t be replaced by reading a book/watching youtube tutorials.&lt;/p&gt;\n\n&lt;p&gt;Of course you can learn anything by yourself, but enrolling in an actual course, having to do homework, having deadlines, assignments and projects...for me having a proper schedule and expectations from my professors and peers is what really drives me to study harder.&lt;/p&gt;\n\n&lt;p&gt;Most music theory courses will start with really basic stuff (scales, triads, notation, etc...), but more advanced courses will develope into complex chord progressions, chord tensions, modal music and more...it will cover pretty much anything from classical music to the most modern and experimental music.&lt;/p&gt;\n\n&lt;p&gt;Being able to understand how music is written and composed helps a lot to expand your own writing abilities. Basically, you get a lot more &amp;#39;tools&amp;#39; that you can create with. It&amp;#39;s absolutely worth it for any music producer IMO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg9nqd2", "score_hidden": false, "stickied": false, "created": 1492228656.0, "created_utc": 1492199856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg98uvf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dreem_kitten", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I don't produce edm, but I follow this board because I have aspirations. I took music theory because I needed a fuller schedule. But we covered so far (3 weeks left) note names, intervals, signatures, rhythm, chords , and I imagine we are going to do chord progression. Also ear training. It was for non music majors so it only covers the basics, but it was worth going to for me at least, the workload wasn't terrible and I learned a lot ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t produce edm, but I follow this board because I have aspirations. I took music theory because I needed a fuller schedule. But we covered so far (3 weeks left) note names, intervals, signatures, rhythm, chords , and I imagine we are going to do chord progression. Also ear training. It was for non music majors so it only covers the basics, but it was worth going to for me at least, the workload wasn&amp;#39;t terrible and I learned a lot &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg98uvf", "score_hidden": false, "stickied": false, "created": 1492211272.0, "created_utc": 1492182472.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg9clse", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "abigsandwich", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I did two years of theory, advanced and AP, during high school and I'd say it really solidified my knowledge of music.  I did already play guitar and bass though and learned a lot through improv jazz bass, but the theory courses helped formalize it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did two years of theory, advanced and AP, during high school and I&amp;#39;d say it really solidified my knowledge of music.  I did already play guitar and bass though and learned a lot through improv jazz bass, but the theory courses helped formalize it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg9clse", "score_hidden": false, "stickied": false, "created": 1492215607.0, "created_utc": 1492186807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg9rnm8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "wendigobass", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I was a music minor (engineering major) at university, so I spent roughly a third of my classes studying some sort of field pertaining to music.  I took a couple theory classes (skipped out on basic theory since I took AP Music Theory in high school), which included jazz theory and voicing and four-part harmony writing.  I played in my university's philharmonic orchestra as a violinist, I took lessons for piano, violin and vocals, and lastly I took a history course on twentieth-century music (Mahler, Schoenberg, Stravinsky, Ives, and the like).\n\nThe music classes were generally my favorite part of the day because, after spending a lot of time on tedious maths, circuit diagrams, and coding, it was an opportunity to flex the more creative side of me.  To be honest I feel as though I got most of my fundamental understandings of music theory itself from my lower-level or high-school classes; everything else felt like icing on the cake, designed to add that little bit of extra flourish (the only real exception here being my jazz theory class, which was incredibly dense and fascinating due to its free-form nature).  I've noticed that I haven't necessarily applied a whole lot of the advanced studies to my songwriting/production, however as a whole the classes have greatly helped me appreciate how music has evolved over time, and they've helped me pick up key, chords, modes, and some of the finer melodic/harmonic details from listening to music.  I do regret not taking any production courses, especially since I play my physical instruments less nowadays than I do my virtual ones.\n\nThe vast majority of people in my classes were music majors (performance, composition, theory, teaching, etc.), and there was a little overlap with those who were double majors in music and engineering.  This basically meant that most everyone who was there (except maybe one or two people) were there because they were incredibly passionate about music and about learning something new.  The philharmonic orchestra was a lot more diverse, and I had more friends from all studies in this class.\n\nTL;DR my music minor was a creative outlet while I studied engineering.  It helped a little with songwriting and even more with listening.  If you're looking to use it as an opportunity to learn, you'll probably get the most out of just basic theory classes unless there's something specific you want to focus on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was a music minor (engineering major) at university, so I spent roughly a third of my classes studying some sort of field pertaining to music.  I took a couple theory classes (skipped out on basic theory since I took AP Music Theory in high school), which included jazz theory and voicing and four-part harmony writing.  I played in my university&amp;#39;s philharmonic orchestra as a violinist, I took lessons for piano, violin and vocals, and lastly I took a history course on twentieth-century music (Mahler, Schoenberg, Stravinsky, Ives, and the like).&lt;/p&gt;\n\n&lt;p&gt;The music classes were generally my favorite part of the day because, after spending a lot of time on tedious maths, circuit diagrams, and coding, it was an opportunity to flex the more creative side of me.  To be honest I feel as though I got most of my fundamental understandings of music theory itself from my lower-level or high-school classes; everything else felt like icing on the cake, designed to add that little bit of extra flourish (the only real exception here being my jazz theory class, which was incredibly dense and fascinating due to its free-form nature).  I&amp;#39;ve noticed that I haven&amp;#39;t necessarily applied a whole lot of the advanced studies to my songwriting/production, however as a whole the classes have greatly helped me appreciate how music has evolved over time, and they&amp;#39;ve helped me pick up key, chords, modes, and some of the finer melodic/harmonic details from listening to music.  I do regret not taking any production courses, especially since I play my physical instruments less nowadays than I do my virtual ones.&lt;/p&gt;\n\n&lt;p&gt;The vast majority of people in my classes were music majors (performance, composition, theory, teaching, etc.), and there was a little overlap with those who were double majors in music and engineering.  This basically meant that most everyone who was there (except maybe one or two people) were there because they were incredibly passionate about music and about learning something new.  The philharmonic orchestra was a lot more diverse, and I had more friends from all studies in this class.&lt;/p&gt;\n\n&lt;p&gt;TL;DR my music minor was a creative outlet while I studied engineering.  It helped a little with songwriting and even more with listening.  If you&amp;#39;re looking to use it as an opportunity to learn, you&amp;#39;ll probably get the most out of just basic theory classes unless there&amp;#39;s something specific you want to focus on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg9rnm8", "score_hidden": false, "stickied": false, "created": 1492233437.0, "created_utc": 1492204637.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg9752t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Redfish518", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "You learn all the basics and stuff, maybe they do help out in the end, but I would say experimenting on your own is what gets you to come up with cool stuff with or without theory. If youre already comfortable with chord progressions, voicings, counterpoint, and melodies, you dont really need to take theory unless you want to analyze classical pieces. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You learn all the basics and stuff, maybe they do help out in the end, but I would say experimenting on your own is what gets you to come up with cool stuff with or without theory. If youre already comfortable with chord progressions, voicings, counterpoint, and melodies, you dont really need to take theory unless you want to analyze classical pieces. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg9752t", "score_hidden": false, "stickied": false, "created": 1492209084.0, "created_utc": 1492180284.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg9akc0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "osonator", "parent_id": "t1_dg99zva", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "^", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;^&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg9akc0", "score_hidden": false, "stickied": false, "created": 1492213312.0, "created_utc": 1492184512.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dgac8o1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "doggard3331", "parent_id": "t1_dg99zva", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "Still no reason to do it. He can learn an entire semesters worth of content in a few youtube videos. and go at his own pace. And its free. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Still no reason to do it. He can learn an entire semesters worth of content in a few youtube videos. and go at his own pace. And its free. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dgac8o1", "score_hidden": false, "stickied": false, "created": 1492263177.0, "created_utc": 1492234377.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99zva", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ninethea", "parent_id": "t1_dg978e1", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I'm assuming he's already in college and has room for this class on his schedule", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m assuming he&amp;#39;s already in college and has room for this class on his schedule&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg99zva", "score_hidden": false, "stickied": false, "created": 1492212641.0, "created_utc": 1492183841.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg978e1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "doggard3331", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "Everything you need to know on everything is on the internet. Same argument as \"is college still relevant\" for the general purpose. It's really not, especially for technology topics like producing. The resources are aplenty and spending money for less knowledge is absurd haha. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything you need to know on everything is on the internet. Same argument as &amp;quot;is college still relevant&amp;quot; for the general purpose. It&amp;#39;s really not, especially for technology topics like producing. The resources are aplenty and spending money for less knowledge is absurd haha. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg978e1", "score_hidden": false, "stickied": false, "created": 1492209205.0, "created_utc": 1492180405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg9l49v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VOLTDOGmusic", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "i took 2 semesters at community college and 1 semester at a 4 year, it was all very helpful in the long run and a good experience. However, all of it can easily be learned online for free. If you can use them for your Gen Ed reqs then go ahead. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i took 2 semesters at community college and 1 semester at a 4 year, it was all very helpful in the long run and a good experience. However, all of it can easily be learned online for free. If you can use them for your Gen Ed reqs then go ahead. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg9l49v", "score_hidden": false, "stickied": false, "created": 1492225504.0, "created_utc": 1492196704.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dg9q0b8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cadmeonrichter", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I went all in and got myself a Bachelor's in Jazz studies. It has helped my production immensely, as well as made me a better listener, opened my ears to new music, and really shaped me as a musician. Any theory you can get your hands on either in a college course or just online is definitely worth your time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went all in and got myself a Bachelor&amp;#39;s in Jazz studies. It has helped my production immensely, as well as made me a better listener, opened my ears to new music, and really shaped me as a musician. Any theory you can get your hands on either in a college course or just online is definitely worth your time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dg9q0b8", "score_hidden": false, "stickied": false, "created": 1492231395.0, "created_utc": 1492202595.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65ckiw", "likes": null, "replies": "", "user_reports": [], "id": "dgb7mga", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Theappunderground", "parent_id": "t3_65ckiw", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "I learned so much i would absolutely not be where i am today without it. Just the theory 101 course, the rest was way too specialized and \"steeped in history\" to be relevant to modern music at all imo. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I learned so much i would absolutely not be where i am today without it. Just the theory 101 course, the rest was way too specialized and &amp;quot;steeped in history&amp;quot; to be relevant to modern music at all imo. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dgb7mga", "score_hidden": false, "stickied": false, "created": 1492320956.0, "created_utc": 1492292156.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]