[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "edmproduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all - I&amp;#39;ve been reading various posts on this sub regarding layering - had one question - perhaps not trivial but looking for some guidance/resources on this topic. &lt;/p&gt;\n\n&lt;p&gt;Question: I understand the importance of layering arrangements where they don&amp;#39;t cause phase cancellation and also adding variations within them to allow for a thicker &amp;amp; more unique sound. However, are there still times where it makes sense to layering arrangements (with each having distinct sound) within the same frequency - to allow for a thicker sound, correct? Or is phase cancellation still going to be an issue?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all - I've been reading various posts on this sub regarding layering - had one question - perhaps not trivial but looking for some guidance/resources on this topic. \n\nQuestion: I understand the importance of layering arrangements where they don't cause phase cancellation and also adding variations within them to allow for a thicker &amp; more unique sound. However, are there still times where it makes sense to layering arrangements (with each having distinct sound) within the same frequency - to allow for a thicker sound, correct? Or is phase cancellation still going to be an issue?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zktj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "mixmastersang", "saved": false, "mod_reports": [], "name": "t3_65zktj", "subreddit_name_prefixed": "r/edmproduction", "approved_by": null, "over_18": false, "domain": "self.edmproduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sa4x", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/edmproduction/comments/65zktj/question_for_harmonymelody_difference_between/", "num_reports": null, "locked": false, "stickied": false, "created": 1492504851.0, "url": "https://www.reddit.com/r/edmproduction/comments/65zktj/question_for_harmonymelody_difference_between/", "author_flair_text": null, "quarantine": false, "title": "[Question] For harmony/melody - Difference between layering sounds vs layering arrangements", "created_utc": 1492476051.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65zktj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sa4x", "removal_reason": null, "link_id": "t3_65zktj", "likes": null, "replies": "", "user_reports": [], "id": "dgem757", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mixmastersang", "parent_id": "t1_dgell9a", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "thank you for the thorough response - really appreciate it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thank you for the thorough response - really appreciate it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dgem757", "score_hidden": false, "stickied": false, "created": 1492514167.0, "created_utc": 1492485367.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgell9a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DubiousTaintMargin", "parent_id": "t3_65zktj", "subreddit_name_prefixed": "r/edmproduction", "controversiality": 0, "body": "If two things have a distinct sound from one another the phase is largely going to be different along the frequency spectrum through time. You can still cancel phase at the moments where those frequencies are opposite one another in their phase and at the same level, but you'll probably be doing it in a broader but distributed fashion. This, to human ears, equates to less of a perceptual issue. But it can still be an problematic issue if the effect isn't a desired one.\n\nWith that said, your ears are the best tool with this. If it sounds better when you do something like this, when listening on multiple monitoring sources and also checking in mono, then you have created a good effect. If it doesn't, then you have not. It really is that simple.\n\nI think it's a mistake to label phase cancellation as a negative side-effect of an improper decision as a default. If done in the right way (or by happy accident), these side-effects can create something unexpected and relevant to a sound's context within a song. However, I don't think anything like it should be approached from a template. If you want to go for thick, you do what makes it thick. If your changes negatively affect that, then you know you're moving in the wrong direction.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If two things have a distinct sound from one another the phase is largely going to be different along the frequency spectrum through time. You can still cancel phase at the moments where those frequencies are opposite one another in their phase and at the same level, but you&amp;#39;ll probably be doing it in a broader but distributed fashion. This, to human ears, equates to less of a perceptual issue. But it can still be an problematic issue if the effect isn&amp;#39;t a desired one.&lt;/p&gt;\n\n&lt;p&gt;With that said, your ears are the best tool with this. If it sounds better when you do something like this, when listening on multiple monitoring sources and also checking in mono, then you have created a good effect. If it doesn&amp;#39;t, then you have not. It really is that simple.&lt;/p&gt;\n\n&lt;p&gt;I think it&amp;#39;s a mistake to label phase cancellation as a negative side-effect of an improper decision as a default. If done in the right way (or by happy accident), these side-effects can create something unexpected and relevant to a sound&amp;#39;s context within a song. However, I don&amp;#39;t think anything like it should be approached from a template. If you want to go for thick, you do what makes it thick. If your changes negatively affect that, then you know you&amp;#39;re moving in the wrong direction.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "edmproduction", "name": "t1_dgell9a", "score_hidden": false, "stickied": false, "created": 1492513402.0, "created_utc": 1492484602.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]