[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FlashTV", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just to start off, I want to say that I don&amp;#39;t dislike this season or really the FP episode at all. But it wasn&amp;#39;t up to snuff in the way I wanted it to be. So, I decided to do a basic rewrite! Here&amp;#39;s Part 1!&lt;/p&gt;\n\n&lt;p&gt;Flashpoint: &lt;/p&gt;\n\n&lt;p&gt;Barry wakes up in his new life. He gains these new memories and, while keeping Reverse Flash locked up, lives his life. Things are good. Eddie&amp;#39;s alive. His parents are too. But there is a gang war happening between Captain Cold and Plastique. Barry doesn&amp;#39;t even really realize the gravity of it all. He knows them as the guy that sacrificed themself to save others, same with Bette. Wally is off saving people as Kid Flash and Barry has taken a step back and let that be after helping him defeat the Rival. The particle accelerator still happened. But STAR Labs was then taken in a hostile takeover by Ramone Industries after Harrison Wells, the CEO, disappeared.&lt;/p&gt;\n\n&lt;p&gt;In the scene with Barry and Eobard, Barry gets heated and tells him that he just made his life the way it should be before. Eobard essentially gives him the speech in the episode. Barry gets a date with Iris. Things are looking up. But in a battle with Cold and Plastique, they kill an entire train of people and Barry tries to stop them, with Wally, but fail. Barry&amp;#39;s speed is slowing down and Wally isn&amp;#39;t fast enough. He tries to plead with Cold to stop, that he knows Snart can be better than this, but Snart freezes Barry&amp;#39;s legs and straight freezes a kid in front of Barry, then mocking him. Barry then angrily confronts Eabord about why he&amp;#39;s losing his powers, why he couldn&amp;#39;t save those people, that kid. Eabord laughs in Barry&amp;#39;s face, telling him that this timeline is starting to cement, taking him with it, making him into this timeline&amp;#39;s Barry. Barry says that he needs his powers to stop Cold and Plastique. Eabord says that the only way he can do that is to let him go so he murder his mom. Barry blows him off and goes to Cisco. Without realizing that Cold placed a tracker on and is watching Barry leave the building Eabord is in.&lt;/p&gt;\n\n&lt;p&gt;Barry heads to Ramone Industries, where he&amp;#39;s confronted by Iris and Wally, who has been gaining financial help from Cisco, whose an arrogant business owner. Cisco has peaced out on helping though, saying that there&amp;#39;s no benefit to him in this anymore. Barry tries to convince him, but he says that he&amp;#39;s sorry and that Barry and the brother-sister crimefighting duo are on their own. Suddenly Iris and Wally get a text from Joe, the captain of the police, to stay away from the station, because Cold&amp;#39;s #1 lackey Heatwave has swept in and is attacking it. Barry and Wally go as Flash and Kid Flash to confront him, Wally is burned and knocked down and Eddie steps up to help, Barry telling him to step back. But Eddie pulls his talisman out, using it to absorb Wally&amp;#39;s speed force, then igniting his blue flame powers. Barry&amp;#39;s shocked but accepts Eddie&amp;#39;s help and they&amp;#39;re able to defeat Heatwave. They interrogate him, discovering that he was a distraction.&lt;/p&gt;\n\n&lt;p&gt;Cut to where Eabord is locked up, being found by Snart. They talk, Eabord asking him what he wants. Snart starts to tell him about his sister who died due to Plastique killing her. Cold hates metahumans now and is gonna use an ice bomb powered by a metahuman to murder the entire city, so everyone will feel the same cold as him. Eabord asks him why he&amp;#39;s telling him this. Snart tells him that he knows what speedsters are capable of, that he is one, he has a scientist in his employ to figure that out, the same person who made his cold gun in this timeline, whose had a device sensing the energy spike from Kid Flash that has been sensing 2 more, him and Barry and he wants him to go back and save his sister, pull her out of time and bring her to him. Eabord asks him if he doesn&amp;#39;t want to prevent all of this. Snart says that he still wants the city of freaks to pay and nothing can change that. He&amp;#39;s committed to his goal. Eabord says that he likes that kinda thinking and agrees.&lt;/p&gt;\n\n&lt;p&gt;Tag is Harrison Wells chained up, insane and the one working for Snart, and the person powering the ice bomb is Caitlin.&lt;/p&gt;\n\n&lt;p&gt;Please review and tell me what you think and if you want to see Part 2! Have a very great day!&lt;/p&gt;\n\n&lt;p&gt;God bless you all!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just to start off, I want to say that I don't dislike this season or really the FP episode at all. But it wasn't up to snuff in the way I wanted it to be. So, I decided to do a basic rewrite! Here's Part 1!\n\nFlashpoint: \n\nBarry wakes up in his new life. He gains these new memories and, while keeping Reverse Flash locked up, lives his life. Things are good. Eddie's alive. His parents are too. But there is a gang war happening between Captain Cold and Plastique. Barry doesn't even really realize the gravity of it all. He knows them as the guy that sacrificed themself to save others, same with Bette. Wally is off saving people as Kid Flash and Barry has taken a step back and let that be after helping him defeat the Rival. The particle accelerator still happened. But STAR Labs was then taken in a hostile takeover by Ramone Industries after Harrison Wells, the CEO, disappeared.\n\nIn the scene with Barry and Eobard, Barry gets heated and tells him that he just made his life the way it should be before. Eobard essentially gives him the speech in the episode. Barry gets a date with Iris. Things are looking up. But in a battle with Cold and Plastique, they kill an entire train of people and Barry tries to stop them, with Wally, but fail. Barry's speed is slowing down and Wally isn't fast enough. He tries to plead with Cold to stop, that he knows Snart can be better than this, but Snart freezes Barry's legs and straight freezes a kid in front of Barry, then mocking him. Barry then angrily confronts Eabord about why he's losing his powers, why he couldn't save those people, that kid. Eabord laughs in Barry's face, telling him that this timeline is starting to cement, taking him with it, making him into this timeline's Barry. Barry says that he needs his powers to stop Cold and Plastique. Eabord says that the only way he can do that is to let him go so he murder his mom. Barry blows him off and goes to Cisco. Without realizing that Cold placed a tracker on and is watching Barry leave the building Eabord is in.\n\nBarry heads to Ramone Industries, where he's confronted by Iris and Wally, who has been gaining financial help from Cisco, whose an arrogant business owner. Cisco has peaced out on helping though, saying that there's no benefit to him in this anymore. Barry tries to convince him, but he says that he's sorry and that Barry and the brother-sister crimefighting duo are on their own. Suddenly Iris and Wally get a text from Joe, the captain of the police, to stay away from the station, because Cold's #1 lackey Heatwave has swept in and is attacking it. Barry and Wally go as Flash and Kid Flash to confront him, Wally is burned and knocked down and Eddie steps up to help, Barry telling him to step back. But Eddie pulls his talisman out, using it to absorb Wally's speed force, then igniting his blue flame powers. Barry's shocked but accepts Eddie's help and they're able to defeat Heatwave. They interrogate him, discovering that he was a distraction.\n\nCut to where Eabord is locked up, being found by Snart. They talk, Eabord asking him what he wants. Snart starts to tell him about his sister who died due to Plastique killing her. Cold hates metahumans now and is gonna use an ice bomb powered by a metahuman to murder the entire city, so everyone will feel the same cold as him. Eabord asks him why he's telling him this. Snart tells him that he knows what speedsters are capable of, that he is one, he has a scientist in his employ to figure that out, the same person who made his cold gun in this timeline, whose had a device sensing the energy spike from Kid Flash that has been sensing 2 more, him and Barry and he wants him to go back and save his sister, pull her out of time and bring her to him. Eabord asks him if he doesn't want to prevent all of this. Snart says that he still wants the city of freaks to pay and nothing can change that. He's committed to his goal. Eabord says that he likes that kinda thinking and agrees.\n\nTag is Harrison Wells chained up, insane and the one working for Snart, and the person powering the ice bomb is Caitlin.\n\nPlease review and tell me what you think and if you want to see Part 2! Have a very great day!\n\nGod bless you all!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65h9vu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 69, "report_reasons": null, "author": "Dagenspear", "saved": false, "mod_reports": [], "name": "t3_65h9vu", "subreddit_name_prefixed": "r/FlashTV", "approved_by": null, "over_18": false, "domain": "self.FlashTV", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2y6bs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FlashTV/comments/65h9vu/fan_contentflashpoint_episode_rewrite/", "num_reports": null, "locked": false, "stickied": false, "created": 1492258481.0, "url": "https://www.reddit.com/r/FlashTV/comments/65h9vu/fan_contentflashpoint_episode_rewrite/", "author_flair_text": null, "quarantine": false, "title": "[Fan Content]Flashpoint Episode Rewrite!", "created_utc": 1492229681.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 69}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65h9vu", "likes": null, "replies": "", "user_reports": [], "id": "dgaatch", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "MrClutch765", "parent_id": "t3_65h9vu", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "This is super awesome ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is super awesome &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgaatch", "score_hidden": false, "stickied": false, "created": 1492260488.0, "created_utc": 1492231688.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65h9vu", "likes": null, "replies": "", "user_reports": [], "id": "dgaj5eq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Fifa17K", "parent_id": "t3_65h9vu", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Eobard*\nFTFY\n\nOtherwise great story, enjoyed reading it, and I want part 2!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eobard*\nFTFY&lt;/p&gt;\n\n&lt;p&gt;Otherwise great story, enjoyed reading it, and I want part 2!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgaj5eq", "score_hidden": false, "stickied": false, "created": 1492282200.0, "created_utc": 1492253400.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65h9vu", "likes": null, "replies": "", "user_reports": [], "id": "dgabing", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Fuckhavingausername", "parent_id": "t3_65h9vu", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "👏🏻👏🏻👏🏻👏🏻", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;👏🏻👏🏻👏🏻👏🏻&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgabing", "score_hidden": false, "stickied": false, "created": 1492261763.0, "created_utc": 1492232963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65h9vu", "likes": null, "replies": "", "user_reports": [], "id": "dgak5f7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "WimpyKelv12", "parent_id": "t3_65h9vu", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Great!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgak5f7", "score_hidden": false, "stickied": false, "created": 1492285134.0, "created_utc": 1492256334.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]