[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FlashTV", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Agents of Shield is currently doing very well story wise after splitting its season down into smaller, connected story lines. Could The Flash (and by extension all arrowverse shows) succeed in using this layout?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Agents of Shield is currently doing very well story wise after splitting its season down into smaller, connected story lines. Could The Flash (and by extension all arrowverse shows) succeed in using this layout?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "no spoiler", "id": "65jqx5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 64, "report_reasons": null, "author": "axidentprone99", "saved": false, "mod_reports": [], "name": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "approved_by": null, "over_18": false, "domain": "self.FlashTV", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2y6bs", "edited": false, "link_flair_css_class": "nspoiler", "author_flair_css_class": "alchemy", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FlashTV/comments/65jqx5/could_the_flash_benefit_from_splitting_its/", "num_reports": null, "locked": false, "stickied": false, "created": 1492300312.0, "url": "https://www.reddit.com/r/FlashTV/comments/65jqx5/could_the_flash_benefit_from_splitting_its/", "author_flair_text": "", "quarantine": false, "title": "Could The Flash benefit from splitting it's seasons into pods?", "created_utc": 1492271512.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 64}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgavwhr", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "latinblu", "parent_id": "t1_dgau5le", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Would shorter seasons work for these shows? I can't say for certain, but the concept is intriguing. Lately I find myself more focused with shows in a 10, 13 or 16 episode format. For me it feels like they give enough to keep me entertained, and truly wishing I had more to watch. While most shows with longer seasons have me thinking, man when are they gonna resolve this, or sometimes it just takes to long to play out and I just stop watching.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would shorter seasons work for these shows? I can&amp;#39;t say for certain, but the concept is intriguing. Lately I find myself more focused with shows in a 10, 13 or 16 episode format. For me it feels like they give enough to keep me entertained, and truly wishing I had more to watch. While most shows with longer seasons have me thinking, man when are they gonna resolve this, or sometimes it just takes to long to play out and I just stop watching.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgavwhr", "score_hidden": false, "stickied": false, "created": 1492305015.0, "created_utc": 1492276215.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgb3yxz", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ItsZexxy", "parent_id": "t1_dgau5le", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Legion only had 8 episodes (which makes sense for their first season) and it was amazing. It didn't feel like there were any episodes that were filler, and every episode added something to the story. Obviously Flash is very different compared to Legion, but I think it would be much better if they shortened the seasons.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Legion only had 8 episodes (which makes sense for their first season) and it was amazing. It didn&amp;#39;t feel like there were any episodes that were filler, and every episode added something to the story. Obviously Flash is very different compared to Legion, but I think it would be much better if they shortened the seasons.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgb3yxz", "score_hidden": false, "stickied": false, "created": 1492315944.0, "created_utc": 1492287144.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgau5le", "gilded": 0, "archived": false, "score": 50, "report_reasons": null, "author": "Anubins", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "I think it'd help keep focus running with less filler and \"can I talk to you?\", at least, but honestly it's not like any one TV style is inherently better than others. They all have merits and downsides.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;d help keep focus running with less filler and &amp;quot;can I talk to you?&amp;quot;, at least, but honestly it&amp;#39;s not like any one TV style is inherently better than others. They all have merits and downsides.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgau5le", "score_hidden": false, "stickied": false, "created": 1492302571.0, "created_utc": 1492273771.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 50}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgb23ov", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "D3vilHo3", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "I think Flash would benefit greatly from pods. Caution: Possible spoilers for all seasons\n\nThe writers this season (and to an extent, last season), seem to be copying Flash Season 1's format: introduce a big bad, have \"Monsters of the Week,\" while still keeping big bad in the picture. This isn't a bad thing, per se. It was really effective in season 1 for a variety of reasons. Season 1 brought us the Reverse Flash, a villain who's mysterious, bad ass, and whose actions have a personal effect on our heroes, especially Barry. Even though we practically knew who he was in the beginning of the season, we didn't know WHAT he wanted or WHY he did the things he did. Take into account the fact that RF was part of the main cast, and every scene with him even in the frame was always so tense and mysterious. \n\nWas there filler in season 1? Yeah, especially near the end of the season. The Gorilla Grodd arc felt out of place, especially because it was introduced so late, practically an episode before the finale. The battle where RF gets captured should have been more 1 v 1 instead of making it a mini-crossover (although it was cool, so it get a pass).\n\nBut then season 2 happened. I think season 2 was good. Not great, but not bad. Was it using the same format as 1? Absolutely, but the show kept us guessing. \"Who was Zoom?\" There were some weak episodes, arguably more than that of Season 1, but the show had some good plot points. The finale was eh, but it wasn't terrible.\n\nAnd this brings us to season 3. We had Flashpoint, which wasn't great. To be fair, it was competing against the animated Justice League Flashpoint, so nothing short of that really would have been considered good. Then we get introduced to Alchemy. Some speculation happened, was interesting, then he gets unmasked and we get introduced to Savitar. Alright, another speedster, who is he? Well we don't know. Okay, fair enough, what does he want? We don't know. How is he going to affect our hero? He might kill Iris. Alright. \n\nThis wouldn't be an issue if it weren't brought up so early. In addition, I don't think Iris is a good character. Her role in the show is \"Barry's girlfriend.\" That's it. That's all she does. She's not a scientist, she's not a police officer, she's only Barry's girlfriend. So we as the viewers really don't care what happens to her.\n\nIn addition, this season in particular suffers from the Flash being too overpowered and thus, requiring the writers to adjust his speed to whatever the plot needs it to be. This was okay in the first season: the Flash was new to the superhero business, so he wasn't super fast. But we've followed Barry for nearly 3 seasons and he still doesn't seem to know what his powers are. Not to mention he doesn't know, or even try, to engage an enemy without consulting his friends immediately. The fight against Solovar is the best example of how NOT to make a Flash fight scene. Whereas [this fight with Savitar WARNING 3X15 SPOILERS](https://youtu.be/CdGR54viNXs?t=1m5s) was actually somewhat interesting because Barry wasn't asking his team what to do. This was a PERSONAL fight, and while Barry loses, we actually get a sense of how dangerous his enemy is. \n\n**tl;dr** Divide the Flash into pods. Give us one story line at a time. HINT at a big bad, but don't introduce a story line/villain too early or we just get sick of him. Make the Flash an actual competent superhero, give him challenges that can't just be solved by believing in himself. Hell, consult the comics if you're running out of stories. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think Flash would benefit greatly from pods. Caution: Possible spoilers for all seasons&lt;/p&gt;\n\n&lt;p&gt;The writers this season (and to an extent, last season), seem to be copying Flash Season 1&amp;#39;s format: introduce a big bad, have &amp;quot;Monsters of the Week,&amp;quot; while still keeping big bad in the picture. This isn&amp;#39;t a bad thing, per se. It was really effective in season 1 for a variety of reasons. Season 1 brought us the Reverse Flash, a villain who&amp;#39;s mysterious, bad ass, and whose actions have a personal effect on our heroes, especially Barry. Even though we practically knew who he was in the beginning of the season, we didn&amp;#39;t know WHAT he wanted or WHY he did the things he did. Take into account the fact that RF was part of the main cast, and every scene with him even in the frame was always so tense and mysterious. &lt;/p&gt;\n\n&lt;p&gt;Was there filler in season 1? Yeah, especially near the end of the season. The Gorilla Grodd arc felt out of place, especially because it was introduced so late, practically an episode before the finale. The battle where RF gets captured should have been more 1 v 1 instead of making it a mini-crossover (although it was cool, so it get a pass).&lt;/p&gt;\n\n&lt;p&gt;But then season 2 happened. I think season 2 was good. Not great, but not bad. Was it using the same format as 1? Absolutely, but the show kept us guessing. &amp;quot;Who was Zoom?&amp;quot; There were some weak episodes, arguably more than that of Season 1, but the show had some good plot points. The finale was eh, but it wasn&amp;#39;t terrible.&lt;/p&gt;\n\n&lt;p&gt;And this brings us to season 3. We had Flashpoint, which wasn&amp;#39;t great. To be fair, it was competing against the animated Justice League Flashpoint, so nothing short of that really would have been considered good. Then we get introduced to Alchemy. Some speculation happened, was interesting, then he gets unmasked and we get introduced to Savitar. Alright, another speedster, who is he? Well we don&amp;#39;t know. Okay, fair enough, what does he want? We don&amp;#39;t know. How is he going to affect our hero? He might kill Iris. Alright. &lt;/p&gt;\n\n&lt;p&gt;This wouldn&amp;#39;t be an issue if it weren&amp;#39;t brought up so early. In addition, I don&amp;#39;t think Iris is a good character. Her role in the show is &amp;quot;Barry&amp;#39;s girlfriend.&amp;quot; That&amp;#39;s it. That&amp;#39;s all she does. She&amp;#39;s not a scientist, she&amp;#39;s not a police officer, she&amp;#39;s only Barry&amp;#39;s girlfriend. So we as the viewers really don&amp;#39;t care what happens to her.&lt;/p&gt;\n\n&lt;p&gt;In addition, this season in particular suffers from the Flash being too overpowered and thus, requiring the writers to adjust his speed to whatever the plot needs it to be. This was okay in the first season: the Flash was new to the superhero business, so he wasn&amp;#39;t super fast. But we&amp;#39;ve followed Barry for nearly 3 seasons and he still doesn&amp;#39;t seem to know what his powers are. Not to mention he doesn&amp;#39;t know, or even try, to engage an enemy without consulting his friends immediately. The fight against Solovar is the best example of how NOT to make a Flash fight scene. Whereas &lt;a href=\"https://youtu.be/CdGR54viNXs?t=1m5s\"&gt;this fight with Savitar WARNING 3X15 SPOILERS&lt;/a&gt; was actually somewhat interesting because Barry wasn&amp;#39;t asking his team what to do. This was a PERSONAL fight, and while Barry loses, we actually get a sense of how dangerous his enemy is. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt; Divide the Flash into pods. Give us one story line at a time. HINT at a big bad, but don&amp;#39;t introduce a story line/villain too early or we just get sick of him. Make the Flash an actual competent superhero, give him challenges that can&amp;#39;t just be solved by believing in himself. Hell, consult the comics if you&amp;#39;re running out of stories. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgb23ov", "score_hidden": false, "stickied": false, "created": 1492313396.0, "created_utc": 1492284596.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgauair", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "axidentprone99", "parent_id": "t1_dgau5cy", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Yeah, it's ok. Legends is the only show i would keep as is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, it&amp;#39;s ok. Legends is the only show i would keep as is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgauair", "score_hidden": false, "stickied": false, "created": 1492302761.0, "created_utc": 1492273961.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgblp4c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "neoblackdragon", "parent_id": "t1_dgau5cy", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Basically you just think shorter seasons which may not truly solve the problem. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Basically you just think shorter seasons which may not truly solve the problem. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgblp4c", "score_hidden": false, "stickied": false, "created": 1492341215.0, "created_utc": 1492312415.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgbvt9m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "johan_hegg4", "parent_id": "t1_dgau5cy", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Supergirl lost the ability to tell a good story when it became \"my new gay sisters forced relationship drama hour\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Supergirl lost the ability to tell a good story when it became &amp;quot;my new gay sisters forced relationship drama hour&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgbvt9m", "score_hidden": false, "stickied": false, "created": 1492363996.0, "created_utc": 1492335196.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgau5cy", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "antimonybean", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "flash and supergirl would probably most benefit either from shorter seasons or small 6-8 episode pods. supergirl seems to have trouble consistently keeping a storyline that extends past a few episodes interesting, but has decent shorter stories (superman, cadmus, etc). flash has rather interesting stories, but (especially this season) tends to stretch stories that could be resolved within a few episodes over the entire season by adding in a bunch of unnecessary filler/drama. having pods would allow for both of these shows to still succeed in their stronger qualities while helping their lesser elements improve.\n\narrow could probably benefit from a slightly shorter season (13-16 episodes) to decrease the small amount of filler, but likely not from pods. its stories are (usually) super grounded in reality and, compared to the other dc cw shows, are really more focused on expanding and fleshing out the small details of the overarching storyline rather than of the shorter stories. having pods would shorten each arc and would possibly result in a decrease in the quality of each story, but having a slightly shorter season would help center the focus of the storyline without getting rid of essential details.\n\nlegends is actually fine how it is storytelling-wise. its episodes' stories are somewhat self-contained but they also contribute to the overarching story. having pods would be fine, but that would change the format of how the stories are told. it'd likely result in things like staying in one time period for the entire pod, which rids of the urgency and spontaneousness of the show (as seen in the weird two-parters in season 1). the show's 16 episode format, combined with the jumpy and goofy storytelling, probably wouldn't work well with the idea of separate pods.\n\nI hope this all makes sense because the more I read it over, the more I realize how confusing this is, but I don't know how else to explain it.\n\n**tl;dr:** flash and supergirl's formats are wonky and pods/shorter seasons could help; arrow is fine and I think they'd decline in quality if they used pods; legends would be completely screwed up if their stories were in pods", "edited": 1492274198.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;flash and supergirl would probably most benefit either from shorter seasons or small 6-8 episode pods. supergirl seems to have trouble consistently keeping a storyline that extends past a few episodes interesting, but has decent shorter stories (superman, cadmus, etc). flash has rather interesting stories, but (especially this season) tends to stretch stories that could be resolved within a few episodes over the entire season by adding in a bunch of unnecessary filler/drama. having pods would allow for both of these shows to still succeed in their stronger qualities while helping their lesser elements improve.&lt;/p&gt;\n\n&lt;p&gt;arrow could probably benefit from a slightly shorter season (13-16 episodes) to decrease the small amount of filler, but likely not from pods. its stories are (usually) super grounded in reality and, compared to the other dc cw shows, are really more focused on expanding and fleshing out the small details of the overarching storyline rather than of the shorter stories. having pods would shorten each arc and would possibly result in a decrease in the quality of each story, but having a slightly shorter season would help center the focus of the storyline without getting rid of essential details.&lt;/p&gt;\n\n&lt;p&gt;legends is actually fine how it is storytelling-wise. its episodes&amp;#39; stories are somewhat self-contained but they also contribute to the overarching story. having pods would be fine, but that would change the format of how the stories are told. it&amp;#39;d likely result in things like staying in one time period for the entire pod, which rids of the urgency and spontaneousness of the show (as seen in the weird two-parters in season 1). the show&amp;#39;s 16 episode format, combined with the jumpy and goofy storytelling, probably wouldn&amp;#39;t work well with the idea of separate pods.&lt;/p&gt;\n\n&lt;p&gt;I hope this all makes sense because the more I read it over, the more I realize how confusing this is, but I don&amp;#39;t know how else to explain it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr:&lt;/strong&gt; flash and supergirl&amp;#39;s formats are wonky and pods/shorter seasons could help; arrow is fine and I think they&amp;#39;d decline in quality if they used pods; legends would be completely screwed up if their stories were in pods&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgau5cy", "score_hidden": false, "stickied": false, "created": 1492302562.0, "created_utc": 1492273762.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgb2u03", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tragedyofphilosophy", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Maybe it would. I think it all comes down to how the writers plan.\n\nShort pods? Yeah, if they can handle the inevitable power scaling that comes with almost every conflict resolution.\n\nLong term? Yeah, if they can place introduction, explanation, and resolution of the villain into sizeable and well timed chunks. \n\nThey haven't done either.\n\nSo I doubt it. Changing the formula may work for a team of writers that lean towards a certain plot ethic, but I'm not sure what their plot ethic is anymore. I'm willing to give it a shot, especially since even from my criticism I admit I'm having fun, but I'm still uncertain of how they're planning all this, if anything is being planet concretely at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe it would. I think it all comes down to how the writers plan.&lt;/p&gt;\n\n&lt;p&gt;Short pods? Yeah, if they can handle the inevitable power scaling that comes with almost every conflict resolution.&lt;/p&gt;\n\n&lt;p&gt;Long term? Yeah, if they can place introduction, explanation, and resolution of the villain into sizeable and well timed chunks. &lt;/p&gt;\n\n&lt;p&gt;They haven&amp;#39;t done either.&lt;/p&gt;\n\n&lt;p&gt;So I doubt it. Changing the formula may work for a team of writers that lean towards a certain plot ethic, but I&amp;#39;m not sure what their plot ethic is anymore. I&amp;#39;m willing to give it a shot, especially since even from my criticism I admit I&amp;#39;m having fun, but I&amp;#39;m still uncertain of how they&amp;#39;re planning all this, if anything is being planet concretely at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgb2u03", "score_hidden": false, "stickied": false, "created": 1492314378.0, "created_utc": 1492285578.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgavusu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hood4Good", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "I don't know. I'd like to see it considering shorter stories allow for shit to happen in them and might have better writing in them, but at the same time, I don't see how well it'd do considering that Flash more or less has an overarching plot all the time (defeat the evil speedster).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know. I&amp;#39;d like to see it considering shorter stories allow for shit to happen in them and might have better writing in them, but at the same time, I don&amp;#39;t see how well it&amp;#39;d do considering that Flash more or less has an overarching plot all the time (defeat the evil speedster).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgavusu", "score_hidden": false, "stickied": false, "created": 1492304950.0, "created_utc": 1492276150.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgd5nvx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sentry459", "parent_id": "t1_dgb459d", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Arrow has been pretty consistent all season.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Arrow has been pretty consistent all season.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgd5nvx", "score_hidden": false, "stickied": false, "created": 1492435439.0, "created_utc": 1492406639.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb459d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rovanz", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Yeah, but, then again, you could say the same about all the DC CW shows.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, but, then again, you could say the same about all the DC CW shows.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgb459d", "score_hidden": false, "stickied": false, "created": 1492316182.0, "created_utc": 1492287382.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgb9nmt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Drayko_Sanbar", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "I think every 20+ episodes-a-season show could benefit from it, honestly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think every 20+ episodes-a-season show could benefit from it, honestly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgb9nmt", "score_hidden": false, "stickied": false, "created": 1492323794.0, "created_utc": 1492294994.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgbgz32", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JoshuaKevinPerry", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Legends figured out their format it's fine, Arrow and The Flash would be better if they did it in this method. Probably work for execs and creatives. The Caitlin is Frost arc worked pretty well in the beginning of the season. HR would have done better if there wasn't a sword of damocles always going on. When will he betray? Why did they introduce his partner and not ever show him outside of one little segment? \n\nThis season should have gone small pod Flashpoint, wally is flash--4 eps or so, 6 with Caitlyn is frost, hr wrapped with some savitar, this has been the weakest Flash season. ", "edited": 1492305675.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Legends figured out their format it&amp;#39;s fine, Arrow and The Flash would be better if they did it in this method. Probably work for execs and creatives. The Caitlin is Frost arc worked pretty well in the beginning of the season. HR would have done better if there wasn&amp;#39;t a sword of damocles always going on. When will he betray? Why did they introduce his partner and not ever show him outside of one little segment? &lt;/p&gt;\n\n&lt;p&gt;This season should have gone small pod Flashpoint, wally is flash--4 eps or so, 6 with Caitlyn is frost, hr wrapped with some savitar, this has been the weakest Flash season. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgbgz32", "score_hidden": false, "stickied": false, "created": 1492334266.0, "created_utc": 1492305466.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgbm2qu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "neoblackdragon", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Flash needs to take advantage of the villains. \n\nIt succeeds in season 1 due to Wells being the villain. We are aware of this from the start(or at least he is far more then he appears) and so every following episode is furthering the plot with him.\n\nSeason 2 falls on itself because while Jay is around, we aren't treated to the additional thing that made Wells, Slade, Merlyn(s1)(and the Netflix MCU shows  as well) work.\n\nThe antagonist was rarely seen on his own. We spent no time with him apart from Team Flash.\n\nWells we got to see when no one else was around, we got to see the plotting and the adjustments.\n\nZoom, we never got to see it. We knew only as much as the Team Flash could really know. This made the bad guy distant.\n\nSavitar is the same issue right now. Yes he's a threat but that's only because he's beaten Barry. Yawn, not too difficult to beat The Flash. Cold's done it without being some super meta.\n\nPods may help them focus up and cease with FOTW plots. Really the major benefit for the AOS pod structure is time. There is a long break in between but I think that strengthens each pod episode. \n\n\nFlash also has other assets. They can do episodes now without Barry. Just have Wally episodes. Just have Vibe episodes. \n\nNow the biggest thing they need to stop doing to dragging out mysteries that have no depth. If the mystery amounts to 10 minutes of exposition, they could have handled in ages ago.\n\nPrometheus was a good mystery. They posed a questions. They fed us plenty of clue and material to think about. Oliver actively followed up on it. The reveal was great. They just did it mid episode. We knew more then Oliver and so the reveal would be great. Even then the plan didn't stop there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Flash needs to take advantage of the villains. &lt;/p&gt;\n\n&lt;p&gt;It succeeds in season 1 due to Wells being the villain. We are aware of this from the start(or at least he is far more then he appears) and so every following episode is furthering the plot with him.&lt;/p&gt;\n\n&lt;p&gt;Season 2 falls on itself because while Jay is around, we aren&amp;#39;t treated to the additional thing that made Wells, Slade, Merlyn(s1)(and the Netflix MCU shows  as well) work.&lt;/p&gt;\n\n&lt;p&gt;The antagonist was rarely seen on his own. We spent no time with him apart from Team Flash.&lt;/p&gt;\n\n&lt;p&gt;Wells we got to see when no one else was around, we got to see the plotting and the adjustments.&lt;/p&gt;\n\n&lt;p&gt;Zoom, we never got to see it. We knew only as much as the Team Flash could really know. This made the bad guy distant.&lt;/p&gt;\n\n&lt;p&gt;Savitar is the same issue right now. Yes he&amp;#39;s a threat but that&amp;#39;s only because he&amp;#39;s beaten Barry. Yawn, not too difficult to beat The Flash. Cold&amp;#39;s done it without being some super meta.&lt;/p&gt;\n\n&lt;p&gt;Pods may help them focus up and cease with FOTW plots. Really the major benefit for the AOS pod structure is time. There is a long break in between but I think that strengthens each pod episode. &lt;/p&gt;\n\n&lt;p&gt;Flash also has other assets. They can do episodes now without Barry. Just have Wally episodes. Just have Vibe episodes. &lt;/p&gt;\n\n&lt;p&gt;Now the biggest thing they need to stop doing to dragging out mysteries that have no depth. If the mystery amounts to 10 minutes of exposition, they could have handled in ages ago.&lt;/p&gt;\n\n&lt;p&gt;Prometheus was a good mystery. They posed a questions. They fed us plenty of clue and material to think about. Oliver actively followed up on it. The reveal was great. They just did it mid episode. We knew more then Oliver and so the reveal would be great. Even then the plan didn&amp;#39;t stop there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgbm2qu", "score_hidden": false, "stickied": false, "created": 1492341798.0, "created_utc": 1492312998.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgbp500", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Officialginger2595", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "I personally didn't like the way that shield did the pods, the first one felt faaaar to disconnected from the 2nd and 3rd pod, and the story didn't really feel as fufilling to watch so far. Individual episodes have been awesome, but the story as a whole has felt like a letdown.\n\nWhat they need to do is just cut out the bs filler/ stupid talk to you moments that plague every episode. Shield doesnt have filler like that on its shown and is leagues better because of it, not because of pods.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I personally didn&amp;#39;t like the way that shield did the pods, the first one felt faaaar to disconnected from the 2nd and 3rd pod, and the story didn&amp;#39;t really feel as fufilling to watch so far. Individual episodes have been awesome, but the story as a whole has felt like a letdown.&lt;/p&gt;\n\n&lt;p&gt;What they need to do is just cut out the bs filler/ stupid talk to you moments that plague every episode. Shield doesnt have filler like that on its shown and is leagues better because of it, not because of pods.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgbp500", "score_hidden": false, "stickied": false, "created": 1492346857.0, "created_utc": 1492318057.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgbvkyg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Reddickk", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "I think what you are talking about is [story arc.](http://tvtropes.org/pmwiki/pmwiki.php/Main/StoryArc) I also think flash would benefit from smaller story arcs as opposed to season long ones.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think what you are talking about is &lt;a href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/StoryArc\"&gt;story arc.&lt;/a&gt; I also think flash would benefit from smaller story arcs as opposed to season long ones.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgbvkyg", "score_hidden": false, "stickied": false, "created": 1492363202.0, "created_utc": 1492334402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2y6bs", "removal_reason": null, "link_id": "t3_65jqx5", "likes": null, "replies": "", "user_reports": [], "id": "dgcyvs4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HalcyonTraveler", "parent_id": "t3_65jqx5", "subreddit_name_prefixed": "r/FlashTV", "controversiality": 0, "body": "Yes. The past two seasons have suffered from \"big bad fatigue\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. The past two seasons have suffered from &amp;quot;big bad fatigue&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FlashTV", "name": "t1_dgcyvs4", "score_hidden": false, "stickied": false, "created": 1492424599.0, "created_utc": 1492395799.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]