[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "math", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello &lt;a href=\"/r/math\"&gt;/r/math&lt;/a&gt;,&lt;/p&gt;\n\n&lt;p&gt;i recently discovered the Joel David Hamkins paper, &amp;quot;The Set-theoric Multiverse&amp;quot; (&lt;a href=\"https://arxiv.org/pdf/1108.4223.pdf\"&gt;https://arxiv.org/pdf/1108.4223.pdf&lt;/a&gt;).\nThe Well-Foundedness Mirage and Reverse Embedding axioms from this paper say that each model M is ill-founded from the perspective of another model N embedded in M. Something here trouble me, if i understand correctly, that means that each model of the natural numbers is non-standard from the perspective of another model, embedded as initial segment of the first. And so, we have an infinite descending chain of models, and each integer is nonstandard from the point of view of another model?! This is impossible, i surely missed something. I maybe have an idea but i&amp;#39;m not sure...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello /r/math,\n\ni recently discovered the Joel David Hamkins paper, \"The Set-theoric Multiverse\" (https://arxiv.org/pdf/1108.4223.pdf).\nThe Well-Foundedness Mirage and Reverse Embedding axioms from this paper say that each model M is ill-founded from the perspective of another model N embedded in M. Something here trouble me, if i understand correctly, that means that each model of the natural numbers is non-standard from the perspective of another model, embedded as initial segment of the first. And so, we have an infinite descending chain of models, and each integer is nonstandard from the point of view of another model?! This is impossible, i surely missed something. I maybe have an idea but i'm not sure...", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65f7mc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "E2pz", "saved": false, "mod_reports": [], "name": "t3_65f7mc", "subreddit_name_prefixed": "r/math", "approved_by": null, "over_18": false, "domain": "self.math", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh0n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/math/comments/65f7mc/hamkins_settheoretic_multiverse/", "num_reports": null, "locked": false, "stickied": false, "created": 1492232619.0, "url": "https://www.reddit.com/r/math/comments/65f7mc/hamkins_settheoretic_multiverse/", "author_flair_text": null, "quarantine": false, "title": "Hamkins' set-theoretic multiverse", "created_utc": 1492203819.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh0n", "removal_reason": null, "link_id": "t3_65f7mc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh0n", "removal_reason": null, "link_id": "t3_65f7mc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh0n", "removal_reason": null, "link_id": "t3_65f7mc", "likes": null, "replies": "", "user_reports": [], "id": "dgalj9g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "completely-ineffable", "parent_id": "t1_dgafzl3", "subreddit_name_prefixed": "r/math", "controversiality": 0, "body": "&gt; In this view, even our N is ill-founded, there is no smallest ω in the multiverse. That's really counter-intuitive.\n\nQuite.\n\nPersonally, I think this to be the most counter-intuitive part of Hamkins's view. I think it's not hard to motivate the idea that there isn't an absolute notion of set. Even if we ultimately think that view fails, it's still a natural thing to think about and it has a lot of attractive features. But giving up an absolute notion of finiteness means giving up a lot. For instance, it seems to undermine the idea that there is an absolute notion of proof, as models with different ωs can disagree about provability; one might think ZFC proves 0 = 1 while another thinks it doesn't. It also messes with the notion of computability, as illustrated by [this blog post](http://jdh.hamkins.org/every-function-can-be-computable/) by Hamkins himself. \n\nOn the other hand, there are multiverse views of set theory that don't admit nonstandard models. One is the so-called generic multiverse view, where we think of the multiverse as being formed by the process of forcing or taking grounds. Both of these preserve well-foundedness, so nonstandard models aren't part of the generic multiverse. (Woodin talks about this view in [this paper](http://logic.harvard.edu/EFI_Woodin_TheContinuumHypothesis.pdf), though he does think, modulo a conjecture, that the view is not reasonable.)\n\nAnother view is the 'hyperuniverse' view as put forth by Sy Friedman and others. [This paper](http://logika.ff.cuni.cz/radek/papers/HUP_joint.pdf) does a decent job at laying out the hyperuniverse view vis-à-vis other multiverse views.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In this view, even our N is ill-founded, there is no smallest ω in the multiverse. That&amp;#39;s really counter-intuitive.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Quite.&lt;/p&gt;\n\n&lt;p&gt;Personally, I think this to be the most counter-intuitive part of Hamkins&amp;#39;s view. I think it&amp;#39;s not hard to motivate the idea that there isn&amp;#39;t an absolute notion of set. Even if we ultimately think that view fails, it&amp;#39;s still a natural thing to think about and it has a lot of attractive features. But giving up an absolute notion of finiteness means giving up a lot. For instance, it seems to undermine the idea that there is an absolute notion of proof, as models with different ωs can disagree about provability; one might think ZFC proves 0 = 1 while another thinks it doesn&amp;#39;t. It also messes with the notion of computability, as illustrated by &lt;a href=\"http://jdh.hamkins.org/every-function-can-be-computable/\"&gt;this blog post&lt;/a&gt; by Hamkins himself. &lt;/p&gt;\n\n&lt;p&gt;On the other hand, there are multiverse views of set theory that don&amp;#39;t admit nonstandard models. One is the so-called generic multiverse view, where we think of the multiverse as being formed by the process of forcing or taking grounds. Both of these preserve well-foundedness, so nonstandard models aren&amp;#39;t part of the generic multiverse. (Woodin talks about this view in &lt;a href=\"http://logic.harvard.edu/EFI_Woodin_TheContinuumHypothesis.pdf\"&gt;this paper&lt;/a&gt;, though he does think, modulo a conjecture, that the view is not reasonable.)&lt;/p&gt;\n\n&lt;p&gt;Another view is the &amp;#39;hyperuniverse&amp;#39; view as put forth by Sy Friedman and others. &lt;a href=\"http://logika.ff.cuni.cz/radek/papers/HUP_joint.pdf\"&gt;This paper&lt;/a&gt; does a decent job at laying out the hyperuniverse view vis-à-vis other multiverse views.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "math", "name": "t1_dgalj9g", "score_hidden": false, "stickied": false, "created": 1492288551.0, "created_utc": 1492259751.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgafzl3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "E2pz", "parent_id": "t1_dg9u45j", "subreddit_name_prefixed": "r/math", "controversiality": 0, "body": "Thanks, i don't have problem with this, it's clear for me. I probably badly expressed my trouble.\nThe paper talk about the \"multiverse view\" of the set theory, according to which there is no \"absolute\" concept of set, and so no \"absolute\" standard or \"really finite\" numbers. In this view, even our **N** is ill-founded, there is no smallest ω in the multiverse. That's really counter-intuitive.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, i don&amp;#39;t have problem with this, it&amp;#39;s clear for me. I probably badly expressed my trouble.\nThe paper talk about the &amp;quot;multiverse view&amp;quot; of the set theory, according to which there is no &amp;quot;absolute&amp;quot; concept of set, and so no &amp;quot;absolute&amp;quot; standard or &amp;quot;really finite&amp;quot; numbers. In this view, even our &lt;strong&gt;N&lt;/strong&gt; is ill-founded, there is no smallest ω in the multiverse. That&amp;#39;s really counter-intuitive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "math", "name": "t1_dgafzl3", "score_hidden": false, "stickied": false, "created": 1492272249.0, "created_utc": 1492243449.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9u45j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "completely-ineffable", "parent_id": "t3_65f7mc", "subreddit_name_prefixed": "r/math", "controversiality": 0, "body": "&gt; And so, we have an infinite descending chain of models, and each integer is nonstandard from the point of view of another model?! This is impossible,\n \nFar from impossible, it is ubiquitous. Any countable model of ZFC with ill-founded ω has an initial segment which it is isomorphic to. (This result is due to Harvey Friedman, from his 1973 paper \"Countable models of set theories\".) By repeatedly applying this theorem you get that for any countable model *M* of ZFC with ill-founded ω you can find an infinite descending chain of submodels of *M*. \n\nIt's maybe easier to see how this can happen if we look at models of arithmetic instead of models of set theory. (A similar thing applies to models of set theory, but the details are more complicated.) If you look at how a a countable nonstandard model of arithmetic is ordered, it looks like a copy of **N** followed by **Q** many copies of **Z**. The model contains the natural numbers---which is the copy of **N**---and then lots and lots of nonstandard 'numbers'---the copies of **Z**. This nonstandard part consists of a copy of **Z** for every rational number, ordered according to the ordering on the rationals. There's lots of room to take cuts to find smaller models, simply by taking an initial segment of the rationals and restricting to the corresponding copies of **Z**. (Of course, it's a little more complicated than that, since you have to  ensure that your choice of initial segment of **Q** will produce a structure closed under + and × and satisfying the right theory. That doesn't happen in general, but it can be achieved by using a small amount of machinery from model theory.) Having an infinite descending sequence of nonstandard models of arithmetic (or nonstandard models of set theory) is no more impossible than having an infinite descending sequence of rationals.", "edited": 1492214907.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And so, we have an infinite descending chain of models, and each integer is nonstandard from the point of view of another model?! This is impossible,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Far from impossible, it is ubiquitous. Any countable model of ZFC with ill-founded ω has an initial segment which it is isomorphic to. (This result is due to Harvey Friedman, from his 1973 paper &amp;quot;Countable models of set theories&amp;quot;.) By repeatedly applying this theorem you get that for any countable model &lt;em&gt;M&lt;/em&gt; of ZFC with ill-founded ω you can find an infinite descending chain of submodels of &lt;em&gt;M&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s maybe easier to see how this can happen if we look at models of arithmetic instead of models of set theory. (A similar thing applies to models of set theory, but the details are more complicated.) If you look at how a a countable nonstandard model of arithmetic is ordered, it looks like a copy of &lt;strong&gt;N&lt;/strong&gt; followed by &lt;strong&gt;Q&lt;/strong&gt; many copies of &lt;strong&gt;Z&lt;/strong&gt;. The model contains the natural numbers---which is the copy of &lt;strong&gt;N&lt;/strong&gt;---and then lots and lots of nonstandard &amp;#39;numbers&amp;#39;---the copies of &lt;strong&gt;Z&lt;/strong&gt;. This nonstandard part consists of a copy of &lt;strong&gt;Z&lt;/strong&gt; for every rational number, ordered according to the ordering on the rationals. There&amp;#39;s lots of room to take cuts to find smaller models, simply by taking an initial segment of the rationals and restricting to the corresponding copies of &lt;strong&gt;Z&lt;/strong&gt;. (Of course, it&amp;#39;s a little more complicated than that, since you have to  ensure that your choice of initial segment of &lt;strong&gt;Q&lt;/strong&gt; will produce a structure closed under + and × and satisfying the right theory. That doesn&amp;#39;t happen in general, but it can be achieved by using a small amount of machinery from model theory.) Having an infinite descending sequence of nonstandard models of arithmetic (or nonstandard models of set theory) is no more impossible than having an infinite descending sequence of rationals.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "math", "name": "t1_dg9u45j", "score_hidden": false, "stickied": false, "created": 1492236609.0, "created_utc": 1492207809.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]