[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "math", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;A Bit of Background&lt;/h1&gt;\n\n&lt;p&gt;I currently have a BA in Japanese. The department where I earned it is part of a big research university. But, the overwhelming focus of research in that department is pedagogy. That is, they spend most of their research dollars on studying how to teach Japanese to undergraduates effectively. &lt;/p&gt;\n\n&lt;p&gt;As a result, I found the program incredibly fulfilling.  After intense study, I went from speaking virtually no Japanese to speaking Japanese well enough to study at Japan&amp;#39;s top, private university in only two years.&lt;/p&gt;\n\n&lt;p&gt;Several years later, I&amp;#39;m back in college getting a BS in Computer Science / Mathematics. I&amp;#39;m at the same university, putting in the same amount of work. But this time around, both departments ( Department of Computer Science and Department of Mathematics ) pointedly do &lt;em&gt;not&lt;/em&gt; conduct research in pedagogy. They are fairly open with their position that undergraduate education doesn&amp;#39;t matter. Their focus is almost entirely on getting graduate students to teach classes so that the faculty can focus all their effort on guiding Phd students. Furthermore, these graduate students are not given adequate guidance on how to effectively tech undergraduate classes. &lt;/p&gt;\n\n&lt;p&gt;As a result, I&amp;#39;m finding the experience in both departments very unfulfilling. &lt;/p&gt;\n\n&lt;h1&gt;My Assumption&lt;/h1&gt;\n\n&lt;p&gt;Academic departments, regardless of their subject area, provide better undergraduate education when their research focus is pedagogy for teaching at the undergraduate level. &lt;/p&gt;\n\n&lt;h1&gt;My Question&lt;/h1&gt;\n\n&lt;p&gt;My question isn&amp;#39;t whether or not my assumption is right. Rather, my question is--which universities have math or computer science departments that focus their research on training teachers for the undergraduate level? Do they exist? Are there journals I can use to suss out which universities they are and what their relative rank is?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "#A Bit of Background\n\nI currently have a BA in Japanese. The department where I earned it is part of a big research university. But, the overwhelming focus of research in that department is pedagogy. That is, they spend most of their research dollars on studying how to teach Japanese to undergraduates effectively. \n\nAs a result, I found the program incredibly fulfilling.  After intense study, I went from speaking virtually no Japanese to speaking Japanese well enough to study at Japan's top, private university in only two years.\n\nSeveral years later, I'm back in college getting a BS in Computer Science / Mathematics. I'm at the same university, putting in the same amount of work. But this time around, both departments ( Department of Computer Science and Department of Mathematics ) pointedly do *not* conduct research in pedagogy. They are fairly open with their position that undergraduate education doesn't matter. Their focus is almost entirely on getting graduate students to teach classes so that the faculty can focus all their effort on guiding Phd students. Furthermore, these graduate students are not given adequate guidance on how to effectively tech undergraduate classes. \n\nAs a result, I'm finding the experience in both departments very unfulfilling. \n\n#My Assumption\n\nAcademic departments, regardless of their subject area, provide better undergraduate education when their research focus is pedagogy for teaching at the undergraduate level. \n\n#My Question\n\nMy question isn't whether or not my assumption is right. Rather, my question is--which universities have math or computer science departments that focus their research on training teachers for the undergraduate level? Do they exist? Are there journals I can use to suss out which universities they are and what their relative rank is?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65okc3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "_Clever_Name_Here_", "saved": false, "mod_reports": [], "name": "t3_65okc3", "subreddit_name_prefixed": "r/math", "approved_by": null, "over_18": false, "domain": "self.math", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh0n", "edited": 1492370720.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/math/comments/65okc3/academic_departments_specializing_in_pedagogy/", "num_reports": null, "locked": false, "stickied": false, "created": 1492368601.0, "url": "https://www.reddit.com/r/math/comments/65okc3/academic_departments_specializing_in_pedagogy/", "author_flair_text": null, "quarantine": false, "title": "Academic Departments Specializing in Pedagogy", "created_utc": 1492339801.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh0n", "removal_reason": null, "link_id": "t3_65okc3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh0n", "removal_reason": null, "link_id": "t3_65okc3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh0n", "removal_reason": null, "link_id": "t3_65okc3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh0n", "removal_reason": null, "link_id": "t3_65okc3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh0n", "removal_reason": null, "link_id": "t3_65okc3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh0n", "removal_reason": null, "link_id": "t3_65okc3", "likes": null, "replies": "", "user_reports": [], "id": "dgdc0jv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JimH10", "parent_id": "t1_dgcr91e", "subreddit_name_prefixed": "r/math", "controversiality": 0, "body": "Good luck.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "math", "name": "t1_dgdc0jv", "score_hidden": false, "stickied": false, "created": 1492453029.0, "created_utc": 1492424229.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcr91e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sleeps_with_crazy", "parent_id": "t1_dgcq4vc", "subreddit_name_prefixed": "r/math", "controversiality": 0, "body": "Indeed, I am now nearly an academic year into a tenure-track position.\n\nI do put thought and effort into what I'm doing with teaching, and will continue to if for no other reason than that I can't stomach the idea of not doing the best I can at my job.  It's just disappointing to hear from colleagues who seem to genuinely not care.\n\nThe good news is that the administration has already been getting more than a bit annoyed with the department about the shoddy teaching so even if people are \"right\" that putting this much time into teaching will hurt my research program, it might work out well for me when it comes to going up for tenure (or not, who knows).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Indeed, I am now nearly an academic year into a tenure-track position.&lt;/p&gt;\n\n&lt;p&gt;I do put thought and effort into what I&amp;#39;m doing with teaching, and will continue to if for no other reason than that I can&amp;#39;t stomach the idea of not doing the best I can at my job.  It&amp;#39;s just disappointing to hear from colleagues who seem to genuinely not care.&lt;/p&gt;\n\n&lt;p&gt;The good news is that the administration has already been getting more than a bit annoyed with the department about the shoddy teaching so even if people are &amp;quot;right&amp;quot; that putting this much time into teaching will hurt my research program, it might work out well for me when it comes to going up for tenure (or not, who knows).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "math", "name": "t1_dgcr91e", "score_hidden": false, "stickied": false, "created": 1492414336.0, "created_utc": 1492385536.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcq4vc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JimH10", "parent_id": "t1_dgcnjs3", "subreddit_name_prefixed": "r/math", "controversiality": 0, "body": "&gt; It's a bit disconcerting since in theory our salaries are coming from tuition so teaching ought to be a significant part of the job.\n\nYes, it is.  I think you posted not long ago that you had gotten a position and I hope you are able to continue putting thought and effort in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s a bit disconcerting since in theory our salaries are coming from tuition so teaching ought to be a significant part of the job.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, it is.  I think you posted not long ago that you had gotten a position and I hope you are able to continue putting thought and effort in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "math", "name": "t1_dgcq4vc", "score_hidden": false, "stickied": false, "created": 1492412793.0, "created_utc": 1492383993.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcnjs3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sleeps_with_crazy", "parent_id": "t1_dgckkgq", "subreddit_name_prefixed": "r/math", "controversiality": 0, "body": "&gt; I'm at a small liberal arts school. The education that students get is very high quality.\n\nI am firmly convinced that deciding to attend a school like that for undergrad, rather than a large university, was exactly the right choice for me.  The benefits of the improved teaching and the time invested by the professors far outweighed the fact that I did not have access to many graduate level courses.\n\nI'm at a research university now and I occasionally have colleagues tell me I am wasting my time by actually putting thought and effort into the teaching.  It's a bit disconcerting since in theory our salaries are coming from tuition so teaching ought to be a significant part of the job.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m at a small liberal arts school. The education that students get is very high quality.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I am firmly convinced that deciding to attend a school like that for undergrad, rather than a large university, was exactly the right choice for me.  The benefits of the improved teaching and the time invested by the professors far outweighed the fact that I did not have access to many graduate level courses.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m at a research university now and I occasionally have colleagues tell me I am wasting my time by actually putting thought and effort into the teaching.  It&amp;#39;s a bit disconcerting since in theory our salaries are coming from tuition so teaching ought to be a significant part of the job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "math", "name": "t1_dgcnjs3", "score_hidden": false, "stickied": false, "created": 1492409251.0, "created_utc": 1492380451.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgckkgq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JimH10", "parent_id": "t1_dgbxchq", "subreddit_name_prefixed": "r/math", "controversiality": 0, "body": "While certainly there are people who study undergrad education, I agree that I have not heard of a department at a research university where that is the sole, or major, focus. \n\nI'm at a small liberal arts school.  The education that students get is very high quality.  My colleagues and I typically have other professional interests but we invest a lot of energy on pedagogy, and on the students as individuals.  For example, I spent most of today working on an Elementary Stats class.   If you are feeling a little flat, OP, you might want to have a look.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While certainly there are people who study undergrad education, I agree that I have not heard of a department at a research university where that is the sole, or major, focus. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m at a small liberal arts school.  The education that students get is very high quality.  My colleagues and I typically have other professional interests but we invest a lot of energy on pedagogy, and on the students as individuals.  For example, I spent most of today working on an Elementary Stats class.   If you are feeling a little flat, OP, you might want to have a look.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "math", "name": "t1_dgckkgq", "score_hidden": false, "stickied": false, "created": 1492405349.0, "created_utc": 1492376549.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxchq", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "sleeps_with_crazy", "parent_id": "t3_65okc3", "subreddit_name_prefixed": "r/math", "controversiality": 0, "body": "Research universities tend to focus on research.  The schools that focus on teaching are generally colleges rather than universities.  The top liberal arts schools probably have the best teaching, but they don't offer graduate courses so there is a tradeoff as far as the quality of the education.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Research universities tend to focus on research.  The schools that focus on teaching are generally colleges rather than universities.  The top liberal arts schools probably have the best teaching, but they don&amp;#39;t offer graduate courses so there is a tradeoff as far as the quality of the education.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "math", "name": "t1_dgbxchq", "score_hidden": false, "stickied": false, "created": 1492369273.0, "created_utc": 1492340473.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh0n", "removal_reason": null, "link_id": "t3_65okc3", "likes": null, "replies": "", "user_reports": [], "id": "dgc3kwh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "chebushka", "parent_id": "t3_65okc3", "subreddit_name_prefixed": "r/math", "controversiality": 0, "body": "You will not find such places among highly ranked, or even mid-ranked, math departments. Some research math departments may have a group of faculty interested in math education, but it will not be a huge number of the faculty. Research in *teaching* a subject is not research in the subject itself. The kind of faculty you describe would more often be found in schools of education, but math education faculty do not teach advanced math courses. I think you have misguided expectations based on your first degree being a language department, since I can imagine \"language acquisition\" is a conventional research focus in a language department. But \"math acquisition\" is no more a branch of math than \"history acquisition\" or \"psychology acquisition\" are branches of history or psychology. Do you think a research psychology department should focus their research on how to teach psychology?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You will not find such places among highly ranked, or even mid-ranked, math departments. Some research math departments may have a group of faculty interested in math education, but it will not be a huge number of the faculty. Research in &lt;em&gt;teaching&lt;/em&gt; a subject is not research in the subject itself. The kind of faculty you describe would more often be found in schools of education, but math education faculty do not teach advanced math courses. I think you have misguided expectations based on your first degree being a language department, since I can imagine &amp;quot;language acquisition&amp;quot; is a conventional research focus in a language department. But &amp;quot;math acquisition&amp;quot; is no more a branch of math than &amp;quot;history acquisition&amp;quot; or &amp;quot;psychology acquisition&amp;quot; are branches of history or psychology. Do you think a research psychology department should focus their research on how to teach psychology?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "math", "name": "t1_dgc3kwh", "score_hidden": false, "stickied": false, "created": 1492382662.0, "created_utc": 1492353862.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh0n", "removal_reason": null, "link_id": "t3_65okc3", "likes": null, "replies": "", "user_reports": [], "id": "dgcfyee", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "weeatfoodallday", "parent_id": "t3_65okc3", "subreddit_name_prefixed": "r/math", "controversiality": 0, "body": "Generally large research universities will not do this. As chebushka says, unllke language departments, pedagogy is not part of math research. In most fields there is no research in pedagogy, as there are other things to research. Languages are probably the only department where the main focus is pedagogy, the other areas of research relating to language end up really being history or linguistics.  However, many small liberal arts colleges generally have more of a focus on teaching (in their philosophy, not their research). Faculty go there in part because they prefer to teach, and would spend less time doing research and more in the classroom. There are no PhD students, so all courses will be taught by faculty members. The downside of these places is that there are no graduate courses, and not many of them are focused on math/cs. I'd recommend specifically Harvey Mudd and Williams, both schools have very strong math programs and care a lot about their undergraduates in those programs.", "edited": 1492371110.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Generally large research universities will not do this. As chebushka says, unllke language departments, pedagogy is not part of math research. In most fields there is no research in pedagogy, as there are other things to research. Languages are probably the only department where the main focus is pedagogy, the other areas of research relating to language end up really being history or linguistics.  However, many small liberal arts colleges generally have more of a focus on teaching (in their philosophy, not their research). Faculty go there in part because they prefer to teach, and would spend less time doing research and more in the classroom. There are no PhD students, so all courses will be taught by faculty members. The downside of these places is that there are no graduate courses, and not many of them are focused on math/cs. I&amp;#39;d recommend specifically Harvey Mudd and Williams, both schools have very strong math programs and care a lot about their undergraduates in those programs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "math", "name": "t1_dgcfyee", "score_hidden": false, "stickied": false, "created": 1492399357.0, "created_utc": 1492370557.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]