[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dbz", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Personally, I feel that adding ANOTHER set of dragonballs is kind of lazy, I mean, the dragonballs were meant to be these special things that not many in the universe knew about, they were kind of niche and only 2 planets had them, Earth and namek but now there are these giant dragonballs the size of planets and I just feel that the whole trope is kind of overdone, I mean, Z added another set of dragonballs with namek and then GT added another set with the black star dragonballs. Just feels a little tired IMO.&lt;/p&gt;\n\n&lt;p&gt;I liked the goku black arc but I really didn&amp;#39;t like the lack of explanation into what the heck trunk&amp;#39;s new transformation was, like no one asked any questions about it, they just rolled with it. That just seems a bit weird.&lt;/p&gt;\n\n&lt;p&gt;I like how more characters other than goku are getting a bit more time in the spotlight but I don&amp;#39;t like the massive power gap that&amp;#39;s occurred, now that goku and vegeta have god powers, it seems like gohan and gotenks are basically useless, atleast when goku and vegeta first learned how to go super saiyan, piccolo and tien were kind of still useful but now they&amp;#39;re all so useless. I also don&amp;#39;t really like how toryama rushed the introduction of super saiyan blue, I mean, he could&amp;#39;ve spent a bit more time with the super saiyan god form atleast, but because it only appeared for that one fight goku had against beerus, it feels like a cheap transformation with no real significance.&lt;/p&gt;\n\n&lt;p&gt;Overall, I like db super but I still prefer Z and GT due to (in my opinion) GT having better ideas (even though they were implemented horribly) and having better character designs and I felt it fit more with the themes of the series opposed to super (There being a dark consequence to using the dragonballs so much, the revenge of the tuffles against the saiyans in the form of baby), I also feel that the original dragonball series, along with Z and GT are all more dramatic and tense than super, I really miss this as well, that sense of danger just seems to be completely gone from super, I&amp;#39;m not sure why though. I still like dragonball super though, I just feel it could be a whole lot better in different parts of it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Personally, I feel that adding ANOTHER set of dragonballs is kind of lazy, I mean, the dragonballs were meant to be these special things that not many in the universe knew about, they were kind of niche and only 2 planets had them, Earth and namek but now there are these giant dragonballs the size of planets and I just feel that the whole trope is kind of overdone, I mean, Z added another set of dragonballs with namek and then GT added another set with the black star dragonballs. Just feels a little tired IMO.\n\nI liked the goku black arc but I really didn't like the lack of explanation into what the heck trunk's new transformation was, like no one asked any questions about it, they just rolled with it. That just seems a bit weird.\n\nI like how more characters other than goku are getting a bit more time in the spotlight but I don't like the massive power gap that's occurred, now that goku and vegeta have god powers, it seems like gohan and gotenks are basically useless, atleast when goku and vegeta first learned how to go super saiyan, piccolo and tien were kind of still useful but now they're all so useless. I also don't really like how toryama rushed the introduction of super saiyan blue, I mean, he could've spent a bit more time with the super saiyan god form atleast, but because it only appeared for that one fight goku had against beerus, it feels like a cheap transformation with no real significance.\n\nOverall, I like db super but I still prefer Z and GT due to (in my opinion) GT having better ideas (even though they were implemented horribly) and having better character designs and I felt it fit more with the themes of the series opposed to super (There being a dark consequence to using the dragonballs so much, the revenge of the tuffles against the saiyans in the form of baby), I also feel that the original dragonball series, along with Z and GT are all more dramatic and tense than super, I really miss this as well, that sense of danger just seems to be completely gone from super, I'm not sure why though. I still like dragonball super though, I just feel it could be a whole lot better in different parts of it.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Super", "id": "65p15q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 41, "report_reasons": null, "author": "monjonltd", "saved": false, "mod_reports": [], "name": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "approved_by": null, "over_18": false, "domain": "self.dbz", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2sdu8", "edited": 1492363255.0, "link_flair_css_class": "super", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dbz/comments/65p15q/discussion_what_are_some_things_you_think/", "num_reports": null, "locked": false, "stickied": false, "created": 1492377096.0, "url": "https://www.reddit.com/r/dbz/comments/65p15q/discussion_what_are_some_things_you_think/", "author_flair_text": null, "quarantine": false, "title": "[discussion] What are some things you think dragonball super is doing better/worse than Z/GT/og dragonball?", "created_utc": 1492348296.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 55, "visited": false, "subreddit_type": "public", "ups": 41}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcd96s", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Vegeto30294", "parent_id": "t1_dgcd36n", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I mean we're comparing Super as a \"whole\" to GT as a whole, so I don't know why you're trying to relate strength from one series to another.\n\nGohan fought and won in one series, Gohan fought and lost in another.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean we&amp;#39;re comparing Super as a &amp;quot;whole&amp;quot; to GT as a whole, so I don&amp;#39;t know why you&amp;#39;re trying to relate strength from one series to another.&lt;/p&gt;\n\n&lt;p&gt;Gohan fought and won in one series, Gohan fought and lost in another.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcd96s", "score_hidden": false, "stickied": false, "created": 1492395747.0, "created_utc": 1492366947.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcd36n", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BoomersGold", "parent_id": "t1_dgcctzw", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Against Frieza's fodder, who are weaker than anyone from GT and who he should've had no problems with. Gohan also fought against Lavender in episode 80 (almost 60 episodes after RoF). Did I miss any?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Against Frieza&amp;#39;s fodder, who are weaker than anyone from GT and who he should&amp;#39;ve had no problems with. Gohan also fought against Lavender in episode 80 (almost 60 episodes after RoF). Did I miss any?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcd36n", "score_hidden": false, "stickied": false, "created": 1492395523.0, "created_utc": 1492366723.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcctzw", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Vegeto30294", "parent_id": "t1_dgccjtz", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "And Gohan fought in Super too, and actually won a fight as well...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And Gohan fought in Super too, and actually won a fight as well...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcctzw", "score_hidden": false, "stickied": false, "created": 1492395181.0, "created_utc": 1492366381.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgccjtz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BoomersGold", "parent_id": "t1_dgcbx53", "subreddit_name_prefixed": "r/dbz", "controversiality": 1, "body": "Yes, Gohan actually fought in GT. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, Gohan actually fought in GT. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgccjtz", "score_hidden": false, "stickied": false, "created": 1492394803.0, "created_utc": 1492366003.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbx53", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Vegeto30294", "parent_id": "t1_dgcbccg", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "The inconsequential fight still gave those characters some screen time, just like how the villains escaping from Hell gave them screen time in GT, despite also being inconsequential. The only important ones were Freeza and Cell, the ones who never went to Earth in the first place.\n\n&gt; Being controlled by the main villain and fighting against the protagonists is better than having a few seconds of screen time fighting Raditz level fodder.\n\nSo basically the GT characters are only good when they...aren't themselves? That's not very convincing. It's almost like telling me Goten is a good character because he's part of Gotenks.\n\nEspecially since _that_ doesn't even fully hold true because they eventually became walking batteries for Baby before they became walking batteries for Goku.\n\n&gt; Gohan wasn't the same weakling that he is in Super.\n\nYou're right, he settled down and became fully useless.\n\n* Fights Baby Goten, gets cut and taken over.\n* Fights Rilldo, almost dies\n* Fights Super 17, almost dies\n* Fights Syn/Omega Sheron, is a distraction and almost dies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The inconsequential fight still gave those characters some screen time, just like how the villains escaping from Hell gave them screen time in GT, despite also being inconsequential. The only important ones were Freeza and Cell, the ones who never went to Earth in the first place.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Being controlled by the main villain and fighting against the protagonists is better than having a few seconds of screen time fighting Raditz level fodder.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So basically the GT characters are only good when they...aren&amp;#39;t themselves? That&amp;#39;s not very convincing. It&amp;#39;s almost like telling me Goten is a good character because he&amp;#39;s part of Gotenks.&lt;/p&gt;\n\n&lt;p&gt;Especially since &lt;em&gt;that&lt;/em&gt; doesn&amp;#39;t even fully hold true because they eventually became walking batteries for Baby before they became walking batteries for Goku.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Gohan wasn&amp;#39;t the same weakling that he is in Super.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re right, he settled down and became fully useless.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Fights Baby Goten, gets cut and taken over.&lt;/li&gt;\n&lt;li&gt;Fights Rilldo, almost dies&lt;/li&gt;\n&lt;li&gt;Fights Super 17, almost dies&lt;/li&gt;\n&lt;li&gt;Fights Syn/Omega Sheron, is a distraction and almost dies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcbx53", "score_hidden": false, "stickied": false, "created": 1492393969.0, "created_utc": 1492365169.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbccg", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "BoomersGold", "parent_id": "t1_dgcawdr", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "The RoF arc had side characters fighting inconsequential fights against fodder opponents that had no impact on the plot whatsoever. The entire plot was basically: \"Frieza comes back and fights Goku and Vegeta\". There's no build-up to it at all so it feels like a movie special that they tried to make into an entire arc (which it is). The actual fights, aside from Gohan's, lasted seconds. The U6-U7 Tournament arc was just Goku and Vegeta. The only other recurring character to fight (Piccolo) did nothing. \n\nIf you're referring to the filler episodes surrounding side characters, then sure, Super does most of these pretty well. It's also longer than GT, so I expected them. \n\nBeing controlled by the main villain and fighting against the protagonists is better than having a few seconds of screen time fighting Raditz level fodder. Gohan wasn't the same weakling that he is in Super. So the only arc to really get others involved is the current arc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The RoF arc had side characters fighting inconsequential fights against fodder opponents that had no impact on the plot whatsoever. The entire plot was basically: &amp;quot;Frieza comes back and fights Goku and Vegeta&amp;quot;. There&amp;#39;s no build-up to it at all so it feels like a movie special that they tried to make into an entire arc (which it is). The actual fights, aside from Gohan&amp;#39;s, lasted seconds. The U6-U7 Tournament arc was just Goku and Vegeta. The only other recurring character to fight (Piccolo) did nothing. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re referring to the filler episodes surrounding side characters, then sure, Super does most of these pretty well. It&amp;#39;s also longer than GT, so I expected them. &lt;/p&gt;\n\n&lt;p&gt;Being controlled by the main villain and fighting against the protagonists is better than having a few seconds of screen time fighting Raditz level fodder. Gohan wasn&amp;#39;t the same weakling that he is in Super. So the only arc to really get others involved is the current arc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcbccg", "score_hidden": false, "stickied": false, "created": 1492393216.0, "created_utc": 1492364416.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcawdr", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Vegeto30294", "parent_id": "t1_dgc9v2f", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Ressurection F Arc had multiple people fighting Freeza's forces until Goku and Vegeta arrived and dedicated more than a full episode to it.\n\nU6-U7 Tournament only had 3 people of the main cast actually fighting, 2 of which were Goku and Vegeta.\n\nThe Goku Black Arc involved Trunks, and his Gary Stu power is exactly what I'm talking about. Z's power scaling was straightfoward. If you're weaker, you're going to stay weaker unless you get a huge powerup or own an ability to change that.\n\nTrunks needed to be stronger than he currently was in order to be of any use in his own arc. Otherwise Black becomes a nonthreat in comparison and Goku and Vegeta would again handle the problem, which becomes exactly what you don't want.\n\nThat's why the manga has a problem right now in that arc. Trunks is reduced to being a mere distraction, asking questions about what's going on in the fight, and slapped around by Goku Black so much that he had to put effort to _not_ kill him. The character who kickstarted the arc isn't even a major character _in_ the arc.\n\nAnd then you have all the in-between episodes centered around other people such as Krillin and Gohan.\n\n&gt; We got entire arcs with Pan and Trunks as primary characters\n\nYou mean...the first arc? Once they came back to Earth, Pan was busy crying that everything is going wrong, Trunks was immediately taken over by Baby, and Goku _yet again_ is handling the situation.\n\n&gt; Gohan and Goten were still strong enough to have a role in the plot in the Baby arc.\n\nYeah, their role was to be controlled by Baby. They didn't do anything else otherwise. They were meant as puppets to get closer to Vegeta and then get fight Goku who just happened to be there.\n\nAfter they were freed from Baby's control \"Welp, can't do anything now, let's feed Goku more power!\"\n\nAfter that arc, the most successful thing they did was take down some villains that escaped from Hell, and Gohan _still_ couldn't do that without almost dying.\n\nShadow Dragon Arc, \"Welp, ~~can't~~ won't do anything now, let's feed Goku more power!\"\n\nSo pretty much what I said before, walking distractions and batteries so Goku can do his job.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ressurection F Arc had multiple people fighting Freeza&amp;#39;s forces until Goku and Vegeta arrived and dedicated more than a full episode to it.&lt;/p&gt;\n\n&lt;p&gt;U6-U7 Tournament only had 3 people of the main cast actually fighting, 2 of which were Goku and Vegeta.&lt;/p&gt;\n\n&lt;p&gt;The Goku Black Arc involved Trunks, and his Gary Stu power is exactly what I&amp;#39;m talking about. Z&amp;#39;s power scaling was straightfoward. If you&amp;#39;re weaker, you&amp;#39;re going to stay weaker unless you get a huge powerup or own an ability to change that.&lt;/p&gt;\n\n&lt;p&gt;Trunks needed to be stronger than he currently was in order to be of any use in his own arc. Otherwise Black becomes a nonthreat in comparison and Goku and Vegeta would again handle the problem, which becomes exactly what you don&amp;#39;t want.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why the manga has a problem right now in that arc. Trunks is reduced to being a mere distraction, asking questions about what&amp;#39;s going on in the fight, and slapped around by Goku Black so much that he had to put effort to &lt;em&gt;not&lt;/em&gt; kill him. The character who kickstarted the arc isn&amp;#39;t even a major character &lt;em&gt;in&lt;/em&gt; the arc.&lt;/p&gt;\n\n&lt;p&gt;And then you have all the in-between episodes centered around other people such as Krillin and Gohan.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We got entire arcs with Pan and Trunks as primary characters&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You mean...the first arc? Once they came back to Earth, Pan was busy crying that everything is going wrong, Trunks was immediately taken over by Baby, and Goku &lt;em&gt;yet again&lt;/em&gt; is handling the situation.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Gohan and Goten were still strong enough to have a role in the plot in the Baby arc.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, their role was to be controlled by Baby. They didn&amp;#39;t do anything else otherwise. They were meant as puppets to get closer to Vegeta and then get fight Goku who just happened to be there.&lt;/p&gt;\n\n&lt;p&gt;After they were freed from Baby&amp;#39;s control &amp;quot;Welp, can&amp;#39;t do anything now, let&amp;#39;s feed Goku more power!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;After that arc, the most successful thing they did was take down some villains that escaped from Hell, and Gohan &lt;em&gt;still&lt;/em&gt; couldn&amp;#39;t do that without almost dying.&lt;/p&gt;\n\n&lt;p&gt;Shadow Dragon Arc, &amp;quot;Welp, &lt;del&gt;can&amp;#39;t&lt;/del&gt; won&amp;#39;t do anything now, let&amp;#39;s feed Goku more power!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So pretty much what I said before, walking distractions and batteries so Goku can do his job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcawdr", "score_hidden": false, "stickied": false, "created": 1492392627.0, "created_utc": 1492363827.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9v2f", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "BoomersGold", "parent_id": "t1_dgc9k9e", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "You're really comparing the current arc of Super, which is only a few episodes in, to GT. The first 70+ episodes were the Goku and Vegeta show. When they tried to add Trunks to the mix, they had to take more \"liberties\" to do so to overcome the severe power scaling issues that the new God transformations have introduced to the series. GT at least tried to elevate new characters to the main cast. We got entire arcs with Pan and Trunks as primary characters and Gohan and Goten were still strong enough to have a role in the plot in the Baby arc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re really comparing the current arc of Super, which is only a few episodes in, to GT. The first 70+ episodes were the Goku and Vegeta show. When they tried to add Trunks to the mix, they had to take more &amp;quot;liberties&amp;quot; to do so to overcome the severe power scaling issues that the new God transformations have introduced to the series. GT at least tried to elevate new characters to the main cast. We got entire arcs with Pan and Trunks as primary characters and Gohan and Goten were still strong enough to have a role in the plot in the Baby arc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgc9v2f", "score_hidden": false, "stickied": false, "created": 1492391256.0, "created_utc": 1492362456.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9k9e", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "Vegeto30294", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Super is at least _trying_ to make other characters relevant again, even if they have to take some liberties to do so because of how straightfoward Z's power scaling was.\n\nGT doubles down on it, and anyone outside of Goku was essentially a distraction or a battery _for_ Goku. They've had really great concepts, but absolutely crashes less than halfway through each arc.\n\nSomething as simple as the Shadow Dragons were ruined, because instead of everyone splitting up and the weaker fighters take on the weaker Dragons, everyone just expects Goku and Pan to handle _every single problem,_ and then everyone jumps in to help against Syn/Omega Shenron when they were all outclassed anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Super is at least &lt;em&gt;trying&lt;/em&gt; to make other characters relevant again, even if they have to take some liberties to do so because of how straightfoward Z&amp;#39;s power scaling was.&lt;/p&gt;\n\n&lt;p&gt;GT doubles down on it, and anyone outside of Goku was essentially a distraction or a battery &lt;em&gt;for&lt;/em&gt; Goku. They&amp;#39;ve had really great concepts, but absolutely crashes less than halfway through each arc.&lt;/p&gt;\n\n&lt;p&gt;Something as simple as the Shadow Dragons were ruined, because instead of everyone splitting up and the weaker fighters take on the weaker Dragons, everyone just expects Goku and Pan to handle &lt;em&gt;every single problem,&lt;/em&gt; and then everyone jumps in to help against Syn/Omega Shenron when they were all outclassed anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgc9k9e", "score_hidden": false, "stickied": false, "created": 1492390860.0, "created_utc": 1492362060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgce6gt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "adrewfryman", "parent_id": "t1_dgc7ige", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Honestly I lightweight hope someone edits super to add more landscape panning and power up screaming I loved the anticipation of three nothing episodes before the actual fight started. I felt like it gave me time to grasp how screwed they were and made me panic trying to figure out how they will stop the bad guy. I know this is not going to be a shared opinion but just my two cents ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly I lightweight hope someone edits super to add more landscape panning and power up screaming I loved the anticipation of three nothing episodes before the actual fight started. I felt like it gave me time to grasp how screwed they were and made me panic trying to figure out how they will stop the bad guy. I know this is not going to be a shared opinion but just my two cents &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgce6gt", "score_hidden": false, "stickied": false, "created": 1492396994.0, "created_utc": 1492368194.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgciuuv", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "kivatbatV", "parent_id": "t1_dgc7ige", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "&gt; is that things aren't getting stretched out to death like they were in Z\n\nI mean, once we got out of the Battle of Gods part of Super it did that, sure.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;is that things aren&amp;#39;t getting stretched out to death like they were in Z&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I mean, once we got out of the Battle of Gods part of Super it did that, sure.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgciuuv", "score_hidden": false, "stickied": false, "created": 1492403114.0, "created_utc": 1492374314.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7ige", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "MeanAmbrose", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I think the best thing that Super's doing (which probably doesn't even need to be mentioned) is that things aren't getting stretched out to death like they were in Z. Granted, the pacing in the Goku Black arc had its issues but compared to things like the Frieza battle and most of the Buu arc it's nice to see things more condensed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the best thing that Super&amp;#39;s doing (which probably doesn&amp;#39;t even need to be mentioned) is that things aren&amp;#39;t getting stretched out to death like they were in Z. Granted, the pacing in the Goku Black arc had its issues but compared to things like the Frieza battle and most of the Buu arc it&amp;#39;s nice to see things more condensed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgc7ige", "score_hidden": false, "stickied": false, "created": 1492388190.0, "created_utc": 1492359390.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcipwi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kivatbatV", "parent_id": "t1_dgc1p8l", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "The main one is because they could just keep running back in the time machine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The main one is because they could just keep running back in the time machine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcipwi", "score_hidden": false, "stickied": false, "created": 1492402939.0, "created_utc": 1492374139.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgd2u61", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dwaatwood", "parent_id": "t1_dgc1p8l", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I don't understand why they couldn't just give Trunks SSB instead of introducing another transformation which Toriyama wanted to cut back on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t understand why they couldn&amp;#39;t just give Trunks SSB instead of introducing another transformation which Toriyama wanted to cut back on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgd2u61", "score_hidden": false, "stickied": false, "created": 1492430341.0, "created_utc": 1492401541.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcfchq", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Unity09", "parent_id": "t1_dgca5ml", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Super is similar to the first serie in this case. The only time the first serie had a true sense of danger was during King Piccolo's arc in my opinion.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Super is similar to the first serie in this case. The only time the first serie had a true sense of danger was during King Piccolo&amp;#39;s arc in my opinion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcfchq", "score_hidden": false, "stickied": false, "created": 1492398554.0, "created_utc": 1492369754.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcaqii", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DonIongschlong", "parent_id": "t1_dgca5ml", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "We agree then :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We agree then :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcaqii", "score_hidden": false, "stickied": false, "created": 1492392411.0, "created_utc": 1492363611.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgca5ml", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "monjonltd", "parent_id": "t1_dgc1p8l", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "you make a good point, I forgot to mention in my post that the black arc was one of the only exceptions to this so far in super, granted the series is fairly fresh so it has time to prove  me wrong but I'm just saying, so far, it's mostly been this way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you make a good point, I forgot to mention in my post that the black arc was one of the only exceptions to this so far in super, granted the series is fairly fresh so it has time to prove  me wrong but I&amp;#39;m just saying, so far, it&amp;#39;s mostly been this way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgca5ml", "score_hidden": false, "stickied": false, "created": 1492391648.0, "created_utc": 1492362848.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1p8l", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "DonIongschlong", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "&gt;I liked the goku black arc but I really didn't like the lack of explanation into what the heck trunk's new transformation was, like no one asked any questions about it, they just rolled with it. That just seems a bit weird.\n\ntbh it felt so completely obvious to me that it was just pseudo SSB, since we saw him controlling his KI, which is one of the requirements of SSB, and him having an blue aura\n\n&gt;I really miss this as well, that sense of danger just seems to be completely gone from super\n\ni really don't get this. zamasu is the first villain to have succeded in his plans and they needed zeno to come down to help them. i don't think anyone was ever as dangerous as zamasu :b", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I liked the goku black arc but I really didn&amp;#39;t like the lack of explanation into what the heck trunk&amp;#39;s new transformation was, like no one asked any questions about it, they just rolled with it. That just seems a bit weird.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;tbh it felt so completely obvious to me that it was just pseudo SSB, since we saw him controlling his KI, which is one of the requirements of SSB, and him having an blue aura&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I really miss this as well, that sense of danger just seems to be completely gone from super&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;i really don&amp;#39;t get this. zamasu is the first villain to have succeded in his plans and they needed zeno to come down to help them. i don&amp;#39;t think anyone was ever as dangerous as zamasu :b&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgc1p8l", "score_hidden": false, "stickied": false, "created": 1492379634.0, "created_utc": 1492350834.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcgc30", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "idosc", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "* Power scaling is even worse than the Buu saga and GT, not even getting into everything up to the Cell saga which managed to keep the Saiyans as the strongest and yet keep the others useful and relatively strong\n\n* Humor is better than the toilet humor of the first half of GT, but worse than anything else in the franchise. Fillers mostly stand out and are great in that regard though. In one part of Super there is *literal* toilet humor where Krillin is holding everyone back because of constipation.\n\n* World building is pretty bad. The world feels formulaic and, especially after the last few episodes, unbelievably small and empty. Even GT, despite being the worst in that regard before Super came along, was able to let characters travel the galaxy and it still felt ever expanding. The world of Dragon Ball always had an American comics/Star Wars feeling and felt magical and full of wonder. This goes hand in hand with power scaling by the way.\n\n* There was only one saga, out of 4 main sagas so far, where it actually felt like there was something at stake there. Future Trunks saga was amazing in that regard, making events feel helpless and bringing in a sense of urgency, but the other sagas really fail at it. It doesn't help that we know they prevail and that they keep referencing EoZ and Uub in the series (as a future event) of course, but I'm talking about something else here - the choices in direction and writing that you can definitely feel throughout DB, Z, the latter half of GT and the Zamasu saga. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Power scaling is even worse than the Buu saga and GT, not even getting into everything up to the Cell saga which managed to keep the Saiyans as the strongest and yet keep the others useful and relatively strong&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Humor is better than the toilet humor of the first half of GT, but worse than anything else in the franchise. Fillers mostly stand out and are great in that regard though. In one part of Super there is &lt;em&gt;literal&lt;/em&gt; toilet humor where Krillin is holding everyone back because of constipation.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;World building is pretty bad. The world feels formulaic and, especially after the last few episodes, unbelievably small and empty. Even GT, despite being the worst in that regard before Super came along, was able to let characters travel the galaxy and it still felt ever expanding. The world of Dragon Ball always had an American comics/Star Wars feeling and felt magical and full of wonder. This goes hand in hand with power scaling by the way.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There was only one saga, out of 4 main sagas so far, where it actually felt like there was something at stake there. Future Trunks saga was amazing in that regard, making events feel helpless and bringing in a sense of urgency, but the other sagas really fail at it. It doesn&amp;#39;t help that we know they prevail and that they keep referencing EoZ and Uub in the series (as a future event) of course, but I&amp;#39;m talking about something else here - the choices in direction and writing that you can definitely feel throughout DB, Z, the latter half of GT and the Zamasu saga. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcgc30", "score_hidden": false, "stickied": false, "created": 1492399856.0, "created_utc": 1492371056.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcz454", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Crowtamer1", "parent_id": "t1_dgckkj6", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "The new character designs make it easier on the animators and the staff", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The new character designs make it easier on the animators and the staff&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcz454", "score_hidden": false, "stickied": false, "created": 1492424921.0, "created_utc": 1492396121.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgckkj6", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "GrandpaGunther", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "The art is worse. I hate how skinny and lame everyone looks. The action is worse too. There's no battle damage and barely any environment damage. There's also no sense of urgency. The universe is ending and nobody really cares. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The art is worse. I hate how skinny and lame everyone looks. The action is worse too. There&amp;#39;s no battle damage and barely any environment damage. There&amp;#39;s also no sense of urgency. The universe is ending and nobody really cares. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgckkj6", "score_hidden": false, "stickied": false, "created": 1492405351.0, "created_utc": 1492376551.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgctiwt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "oldmangonzo", "parent_id": "t1_dgckhja", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "You're one hundred percent correct, by my estimation. But in \"Z\" it always felt like you could, if you were liberal enough, defend the power scaling. In Super, it is far less arguable.\n\nWhich is partially why I always find it hilarious when fanboys try to use Super to defend Goku in fantasy match ups. Unless you're purely using in universe statements, it's very arguable that he's barely more powerful than he was in the Freeza saga (if even that).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re one hundred percent correct, by my estimation. But in &amp;quot;Z&amp;quot; it always felt like you could, if you were liberal enough, defend the power scaling. In Super, it is far less arguable.&lt;/p&gt;\n\n&lt;p&gt;Which is partially why I always find it hilarious when fanboys try to use Super to defend Goku in fantasy match ups. Unless you&amp;#39;re purely using in universe statements, it&amp;#39;s very arguable that he&amp;#39;s barely more powerful than he was in the Freeza saga (if even that).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgctiwt", "score_hidden": false, "stickied": false, "created": 1492417403.0, "created_utc": 1492388603.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgckhja", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chipperpip", "parent_id": "t1_dgc8ww2", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I've always considered the beginning of each saga to be something of a soft reset in terms of power levels/destructive capabilities myself, anyway.  Everything's kind of quietly normalized and rebalanced at a lower level after the excesses of the last arc's climax.  It's the only way to really make sense of how things are depicted onscreen.  I mean, Krillin on paper could probably defeat 1st form Frieza at this point, but he's never really portrayed that way.  Considering all the powerups in the show as strict multipliers that are compounded on top of each other quickly leads to fairly ludicrous numbers, especially comparing across sagas.  I prefer to think of them as adding a somewhat set amount to a character's base power level rather than being multipliers, although that amount can change with training.  In this view, current Goku is a few hundreds (or being generous thousands) of times stronger than he was the first time he went Super Saiyan, rather than billions or whatever the formal powerscaling math would come up with, and which doesn't fit visually with anything we're actually shown.  \n\n(The \"universe-destroying shockwaves\" between Goku and Beerus may have been an attempt to give lip service to the formal power scaling, but it's an idea that seems to have been pretty quickly abandoned, despite supposedly much higher-powered fights later)         ", "edited": 1492401857.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always considered the beginning of each saga to be something of a soft reset in terms of power levels/destructive capabilities myself, anyway.  Everything&amp;#39;s kind of quietly normalized and rebalanced at a lower level after the excesses of the last arc&amp;#39;s climax.  It&amp;#39;s the only way to really make sense of how things are depicted onscreen.  I mean, Krillin on paper could probably defeat 1st form Frieza at this point, but he&amp;#39;s never really portrayed that way.  Considering all the powerups in the show as strict multipliers that are compounded on top of each other quickly leads to fairly ludicrous numbers, especially comparing across sagas.  I prefer to think of them as adding a somewhat set amount to a character&amp;#39;s base power level rather than being multipliers, although that amount can change with training.  In this view, current Goku is a few hundreds (or being generous thousands) of times stronger than he was the first time he went Super Saiyan, rather than billions or whatever the formal powerscaling math would come up with, and which doesn&amp;#39;t fit visually with anything we&amp;#39;re actually shown.  &lt;/p&gt;\n\n&lt;p&gt;(The &amp;quot;universe-destroying shockwaves&amp;quot; between Goku and Beerus may have been an attempt to give lip service to the formal power scaling, but it&amp;#39;s an idea that seems to have been pretty quickly abandoned, despite supposedly much higher-powered fights later)         &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgckhja", "score_hidden": false, "stickied": false, "created": 1492405236.0, "created_utc": 1492376436.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8ww2", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "oldmangonzo", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "The best and worst part of Super are the same: the creators don't care about power levels any more.\n\nThis is great, because now the focus is on telling the best story possible. And it means that every fight hasn't just ended with Goku powering up to a new level stronger than his opponent. This is what I like best about Super.\n\nBut it is really frustrating that scale/level has been so severely decreased from the end of Z. I wish there was a way to balance the two.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best and worst part of Super are the same: the creators don&amp;#39;t care about power levels any more.&lt;/p&gt;\n\n&lt;p&gt;This is great, because now the focus is on telling the best story possible. And it means that every fight hasn&amp;#39;t just ended with Goku powering up to a new level stronger than his opponent. This is what I like best about Super.&lt;/p&gt;\n\n&lt;p&gt;But it is really frustrating that scale/level has been so severely decreased from the end of Z. I wish there was a way to balance the two.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgc8ww2", "score_hidden": false, "stickied": false, "created": 1492390048.0, "created_utc": 1492361248.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgc9jp0", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "NoenummuneoN", "parent_id": "t1_dgc1k7w", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "^ cant agree more", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;^ cant agree more&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgc9jp0", "score_hidden": false, "stickied": false, "created": 1492390840.0, "created_utc": 1492362040.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcvli9", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DoktorSteven", "parent_id": "t1_dgc1k7w", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "GT just isn't that bad in general. The first part of the series before Baby is pretty boring but I do enjoy seeing Goku fight new people and use a bit of strategy. But the Baby saga is pretty great, Super 17 was fun, SSJ4 is legitimately awesome, and GT brought in some continuity from the entire Dragon Ball run. The finale few episodes with Gogeta and Goku leaving with Shenron are a great potential finale for the series too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;GT just isn&amp;#39;t that bad in general. The first part of the series before Baby is pretty boring but I do enjoy seeing Goku fight new people and use a bit of strategy. But the Baby saga is pretty great, Super 17 was fun, SSJ4 is legitimately awesome, and GT brought in some continuity from the entire Dragon Ball run. The finale few episodes with Gogeta and Goku leaving with Shenron are a great potential finale for the series too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcvli9", "score_hidden": false, "stickied": false, "created": 1492420162.0, "created_utc": 1492391362.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1k7w", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "BoomersGold", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "A well-thought-out, high quality post, whether you agree with their opinion or not, is immediately downvoted. \n\nGT had better character designs for the returning characters from Z and felt to me like a better continuation of Z. A lot of the lore from Z are built on and used as the basis for major arcs, like the excessive dragon ball use and the Saiyans  tyrant history. SSJ4 was also more creative and had a better concept. ", "edited": 1492351029.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A well-thought-out, high quality post, whether you agree with their opinion or not, is immediately downvoted. &lt;/p&gt;\n\n&lt;p&gt;GT had better character designs for the returning characters from Z and felt to me like a better continuation of Z. A lot of the lore from Z are built on and used as the basis for major arcs, like the excessive dragon ball use and the Saiyans  tyrant history. SSJ4 was also more creative and had a better concept. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgc1k7w", "score_hidden": false, "stickied": false, "created": 1492379386.0, "created_utc": 1492350586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcfl14", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Unity09", "parent_id": "t1_dgce52n", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "to be honest people predicted Black to be Goten, Future Goku, a shapeshifter or a clone too. As soon as the second Zamasu appeared everyone was confused as hell as to what was happening. Telling someone who hasn't watched the FT arc yet that Black is Zamasu probably the hugest spoiler, because until episode 61 it was still unclear who he was.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;to be honest people predicted Black to be Goten, Future Goku, a shapeshifter or a clone too. As soon as the second Zamasu appeared everyone was confused as hell as to what was happening. Telling someone who hasn&amp;#39;t watched the FT arc yet that Black is Zamasu probably the hugest spoiler, because until episode 61 it was still unclear who he was.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcfl14", "score_hidden": false, "stickied": false, "created": 1492398868.0, "created_utc": 1492370068.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgce52n", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "emilsayahi", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I feel as if people are becoming crazy strong way too easily. Like, Trunks and 17 could somehow realistically fight SSG Goku now? It makes no sense. Also, the Goku Black arc seemed lazy. People predicted Goku Black (common let's just admit he's a generic evil Goku) was Zamas, and the entire plot seemed rushed and lazilly put together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel as if people are becoming crazy strong way too easily. Like, Trunks and 17 could somehow realistically fight SSG Goku now? It makes no sense. Also, the Goku Black arc seemed lazy. People predicted Goku Black (common let&amp;#39;s just admit he&amp;#39;s a generic evil Goku) was Zamas, and the entire plot seemed rushed and lazilly put together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgce52n", "score_hidden": false, "stickied": false, "created": 1492396944.0, "created_utc": 1492368144.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgdr4y1", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "jokkergar666", "parent_id": "t1_dgdc1dh", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Who's attacking you? I think your statement  it's ignorant, that's it,  As far as i know that's not an insult. I know some people tend to put in the same bag the quality of the animation with the  characters not looking  “on model”, or looking very rough, which is not really always the case. To me Gt it's just  plane and dull  in comparation to Super, While the art maybe be  more consistent through the whole show, I can't think of any  highlights  that GT had in that regard, Unlike Super where we have Naoki tate,Higashide ,always Doing amazing Cuts. also Naotoshi Shida Showing up once in while . GT wasn't that well animated overall. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who&amp;#39;s attacking you? I think your statement  it&amp;#39;s ignorant, that&amp;#39;s it,  As far as i know that&amp;#39;s not an insult. I know some people tend to put in the same bag the quality of the animation with the  characters not looking  “on model”, or looking very rough, which is not really always the case. To me Gt it&amp;#39;s just  plane and dull  in comparation to Super, While the art maybe be  more consistent through the whole show, I can&amp;#39;t think of any  highlights  that GT had in that regard, Unlike Super where we have Naoki tate,Higashide ,always Doing amazing Cuts. also Naotoshi Shida Showing up once in while . GT wasn&amp;#39;t that well animated overall. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgdr4y1", "score_hidden": false, "stickied": false, "created": 1492477052.0, "created_utc": 1492448252.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdc1dh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheWeekdn", "parent_id": "t1_dgd0mkk", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Feel free to prove otherwise instead of passive aggressively attacking me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Feel free to prove otherwise instead of passive aggressively attacking me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgdc1dh", "score_hidden": false, "stickied": false, "created": 1492453105.0, "created_utc": 1492424305.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0mkk", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "jokkergar666", "parent_id": "t1_dgcqzsj", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Gt animation top-tier?? yeah, You have not idea what you're talking about.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gt animation top-tier?? yeah, You have not idea what you&amp;#39;re talking about.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgd0mkk", "score_hidden": false, "stickied": false, "created": 1492427036.0, "created_utc": 1492398236.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqzsj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "TheWeekdn", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I think both shows are amazing in both regards.\n\nI'll start with Super :\n\n**Strong points**\n\n\n- Gave us a new perspective on how the universe works with the gods, made the Kais relevant and added a lot of new interesting characters.\n\n- Power scaling, makes the storyline more important (big example is Zamasu fusion being literally immortal, cockblocking FTrunks' rage moment)\n\n- Brought back Frieza in a good way, I'm always down for more Frieza action.\n\n- Made 17 and 18 part of the main crew (17 being one of my favorite characters).\n\n**Weak points**\n\n- Bad color palette. Honestly, everything is too bright and the vibrance should be taken down a notch. Even worse considering every character has some different Aura color (purple, gold, red, blue, white, yay)\n\n- Awful awful animation. Compared to other shows on the same tier, Super has shit-tier animation and I'm not even being an asshole about it. I know they have time restraints and the animators are newbies, but it sucks.\n\n- Overuse of common  tropes we see in bad animes (Power of friendship, Talking during active fights, Fuckloads of beam attacks) which mostly cater to prepubescent teens, I understand.\n\nGT : \n\n**Strong points**\n\n- Top tier animation. We can't deny, the animators did a really good job at it, completely capturing the grunginess and darkness of the show.\n\n- Added a lot of throwbacks to the original DB by making Goku a kid again (with his original voice actor) and especially with  the Golden Oozaru.\n\n- SSJ4. Exactly. My childhood fantasy, the most badass form we'll ever see in the franchise.\n\n- Put Trunks and Pan in the foreground without fucking up their powerlevels. Even Gohan, Goten, Bulla, Bulma and Satan were relevant in some way.\n\n- Good idea on the dragon ball take (yet another throwback) with the dark energy build up, thus creating the shadow dragons which was cool too.\n\n- The last episode is the greatest of the series.\n\n**Weak points**\n\n- Short and felt rushed. In the same episode you'd see Goku fighting with Baby and 5 minutes later Baby Vegeta has already established a new planet.\n\n- The first arc took too long, was unexciting.\n\n- The american dub music was very repetitive, although it was cool, it got boring.\n\n- Lots of inconsistencies. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think both shows are amazing in both regards.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll start with Super :&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Strong points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Gave us a new perspective on how the universe works with the gods, made the Kais relevant and added a lot of new interesting characters.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Power scaling, makes the storyline more important (big example is Zamasu fusion being literally immortal, cockblocking FTrunks&amp;#39; rage moment)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Brought back Frieza in a good way, I&amp;#39;m always down for more Frieza action.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Made 17 and 18 part of the main crew (17 being one of my favorite characters).&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Weak points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Bad color palette. Honestly, everything is too bright and the vibrance should be taken down a notch. Even worse considering every character has some different Aura color (purple, gold, red, blue, white, yay)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Awful awful animation. Compared to other shows on the same tier, Super has shit-tier animation and I&amp;#39;m not even being an asshole about it. I know they have time restraints and the animators are newbies, but it sucks.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Overuse of common  tropes we see in bad animes (Power of friendship, Talking during active fights, Fuckloads of beam attacks) which mostly cater to prepubescent teens, I understand.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;GT : &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Strong points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Top tier animation. We can&amp;#39;t deny, the animators did a really good job at it, completely capturing the grunginess and darkness of the show.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Added a lot of throwbacks to the original DB by making Goku a kid again (with his original voice actor) and especially with  the Golden Oozaru.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;SSJ4. Exactly. My childhood fantasy, the most badass form we&amp;#39;ll ever see in the franchise.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Put Trunks and Pan in the foreground without fucking up their powerlevels. Even Gohan, Goten, Bulla, Bulma and Satan were relevant in some way.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Good idea on the dragon ball take (yet another throwback) with the dark energy build up, thus creating the shadow dragons which was cool too.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The last episode is the greatest of the series.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Weak points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Short and felt rushed. In the same episode you&amp;#39;d see Goku fighting with Baby and 5 minutes later Baby Vegeta has already established a new planet.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The first arc took too long, was unexciting.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The american dub music was very repetitive, although it was cool, it got boring.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Lots of inconsistencies. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcqzsj", "score_hidden": false, "stickied": false, "created": 1492413983.0, "created_utc": 1492385183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgc8q29", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Iloveliberaltears", "parent_id": "t1_dgc4l8w", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I would have to say yes to this. Especially with Uub! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would have to say yes to this. Especially with Uub! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgc8q29", "score_hidden": false, "stickied": false, "created": 1492389794.0, "created_utc": 1492360994.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4l8w", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "MyOtherTagsGood", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "GT continued proper power scaling", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;GT continued proper power scaling&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgc4l8w", "score_hidden": false, "stickied": false, "created": 1492384179.0, "created_utc": 1492355379.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcdzmd", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Lorddarryl", "parent_id": "t1_dgc77d3", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I swear that it sometimes feels like I'm the only person who dislikes the majority of the changes the Manga made.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I swear that it sometimes feels like I&amp;#39;m the only person who dislikes the majority of the changes the Manga made.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcdzmd", "score_hidden": false, "stickied": false, "created": 1492396740.0, "created_utc": 1492367940.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgepnsk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "In_a_silentway", "parent_id": "t1_dge4k48", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Then in the anime why does he need a 2nd Zamasu? That part didn't make sense until the manga explained it. Also how is the anime black characterized any differently from the manga? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then in the anime why does he need a 2nd Zamasu? That part didn&amp;#39;t make sense until the manga explained it. Also how is the anime black characterized any differently from the manga? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgepnsk", "score_hidden": true, "stickied": false, "created": 1492519237.0, "created_utc": 1492490437.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge4k48", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Unity09", "parent_id": "t1_dgdeb0d", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "The only thing the manga explains better is why Super Saiyan Rosè is rose and as you said the Zero Mortals Plan is more fleshed out. In the anime it's shown Black's power-ups happen when he fights with Goku, because he embodies his power and fighting style more. \n\nBy the way I would never ever trade off anime Black for a few more explanations. Manga Black is as generic as possible and he's quite a forgettable character.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only thing the manga explains better is why Super Saiyan Rosè is rose and as you said the Zero Mortals Plan is more fleshed out. In the anime it&amp;#39;s shown Black&amp;#39;s power-ups happen when he fights with Goku, because he embodies his power and fighting style more. &lt;/p&gt;\n\n&lt;p&gt;By the way I would never ever trade off anime Black for a few more explanations. Manga Black is as generic as possible and he&amp;#39;s quite a forgettable character.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dge4k48", "score_hidden": false, "stickied": false, "created": 1492492103.0, "created_utc": 1492463303.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdeb0d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "In_a_silentway", "parent_id": "t1_dgcffj4", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "What makes you say that? In the manga things are explained better like how Black got so strong or why he needed another version of himself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What makes you say that? In the manga things are explained better like how Black got so strong or why he needed another version of himself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgdeb0d", "score_hidden": false, "stickied": false, "created": 1492459334.0, "created_utc": 1492430534.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcffj4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Unity09", "parent_id": "t1_dgc77d3", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "come on, Toyotaro's FT arc is shit compared to the anime", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;come on, Toyotaro&amp;#39;s FT arc is shit compared to the anime&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcffj4", "score_hidden": false, "stickied": false, "created": 1492398664.0, "created_utc": 1492369864.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcacxt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "monjonltd", "parent_id": "t1_dgc77d3", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "This is pretty much the main reason I'm stopping watching the anime and will buy the manga when it's released soon, plus I can imagine the series in my head as looking more like the original series as opposed to the \"shiny\" modern anime look it has which I am not a fan of personally so that should be cool.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is pretty much the main reason I&amp;#39;m stopping watching the anime and will buy the manga when it&amp;#39;s released soon, plus I can imagine the series in my head as looking more like the original series as opposed to the &amp;quot;shiny&amp;quot; modern anime look it has which I am not a fan of personally so that should be cool.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcacxt", "score_hidden": false, "stickied": false, "created": 1492391915.0, "created_utc": 1492363115.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcb3zd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "features", "parent_id": "t1_dgcabtt", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Yes but he can always revisit something if its received badly in the anime\n\nNothings set in stone until its published.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes but he can always revisit something if its received badly in the anime&lt;/p&gt;\n\n&lt;p&gt;Nothings set in stone until its published.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcb3zd", "score_hidden": false, "stickied": false, "created": 1492392911.0, "created_utc": 1492364111.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcabtt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tko552", "parent_id": "t1_dgc77d3", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Toyatarus manga is well written in advance and not in response to fan backlash he in terms of writing is ahead of the anime right now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Toyatarus manga is well written in advance and not in response to fan backlash he in terms of writing is ahead of the anime right now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcabtt", "score_hidden": false, "stickied": false, "created": 1492391875.0, "created_utc": 1492363075.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc77d3", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "features", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I'm glad the Dragon Ball Super anime exists at this point simply as a driving force for the manga, which is SOOO good.\n\nThe show keeps fucking things up to the point where Toyotarou can use that fan feedback to make the manga better and even parody how bad the show can be at times.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad the Dragon Ball Super anime exists at this point simply as a driving force for the manga, which is SOOO good.&lt;/p&gt;\n\n&lt;p&gt;The show keeps fucking things up to the point where Toyotarou can use that fan feedback to make the manga better and even parody how bad the show can be at times.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgc77d3", "score_hidden": false, "stickied": false, "created": 1492387778.0, "created_utc": 1492358978.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcj89x", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "goatsanddragons", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I like how in Super the characters don't feel static in comparison to GT. GT was the Goku show with Pan as a tag along brat and Trunks as Mr. Exposition.\n\nIn Super we get the evolution of Vegeta, Gohan suffering for abadoning martial arts, the revelation that their Gods have been doing a poor job all along, Future Trunks dealing with a whole nother level of trauma,and  Krillin rediscovering his passion for martial arts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like how in Super the characters don&amp;#39;t feel static in comparison to GT. GT was the Goku show with Pan as a tag along brat and Trunks as Mr. Exposition.&lt;/p&gt;\n\n&lt;p&gt;In Super we get the evolution of Vegeta, Gohan suffering for abadoning martial arts, the revelation that their Gods have been doing a poor job all along, Future Trunks dealing with a whole nother level of trauma,and  Krillin rediscovering his passion for martial arts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcj89x", "score_hidden": false, "stickied": false, "created": 1492403607.0, "created_utc": 1492374807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgci8f7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ridethelightning469", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "The worst part about Super besides the animation is the lack of the Oozaru roar behind a SSJ transformation. That shit was legit badass.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The worst part about Super besides the animation is the lack of the Oozaru roar behind a SSJ transformation. That shit was legit badass.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgci8f7", "score_hidden": false, "stickied": false, "created": 1492402322.0, "created_utc": 1492373522.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcxl6f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "yuckfire", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "The best part of super is the worst part of GT. Super looks outward and expands. GT looks inwards and explores.\n\n\nWith super, we have gods of destruction, more kaioshin and more universes and it just keeps growing. This is what z did with the afterlife and planets.\n\n\nGT took plot points from z and explored them, which is bad in my opinion, because its not new. It doesn't make the series feel bigger. \n\nBoth of these series feel like fanfics at  times but the fact that GT took shit from z and made arcs out of them. Yeah, they takes the cake", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best part of super is the worst part of GT. Super looks outward and expands. GT looks inwards and explores.&lt;/p&gt;\n\n&lt;p&gt;With super, we have gods of destruction, more kaioshin and more universes and it just keeps growing. This is what z did with the afterlife and planets.&lt;/p&gt;\n\n&lt;p&gt;GT took plot points from z and explored them, which is bad in my opinion, because its not new. It doesn&amp;#39;t make the series feel bigger. &lt;/p&gt;\n\n&lt;p&gt;Both of these series feel like fanfics at  times but the fact that GT took shit from z and made arcs out of them. Yeah, they takes the cake&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcxl6f", "score_hidden": false, "stickied": false, "created": 1492422789.0, "created_utc": 1492393989.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgd46ih", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Knighthonor", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Animations and designs were unique looking and better in GT over Super", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Animations and designs were unique looking and better in GT over Super&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgd46ih", "score_hidden": false, "stickied": false, "created": 1492432589.0, "created_utc": 1492403789.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcp5bz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "batistabus", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I think GT is complete garbage. The ideas are bad and terribly executed. Moreover, it is incredibly boring and I can't watch multiple episodes without falling asleep.\n\nThe Super anime has many issues, but the manga is fantastic. The anime seems to be stepping it up lately in terms of animation and music.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think GT is complete garbage. The ideas are bad and terribly executed. Moreover, it is incredibly boring and I can&amp;#39;t watch multiple episodes without falling asleep.&lt;/p&gt;\n\n&lt;p&gt;The Super anime has many issues, but the manga is fantastic. The anime seems to be stepping it up lately in terms of animation and music.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcp5bz", "score_hidden": false, "stickied": false, "created": 1492411436.0, "created_utc": 1492382636.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcnbul", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sudojay1", "parent_id": "t1_dgca0qs", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "And there's a limit to how bad it can get since they said in the last episode of Z that there had been 5 years of peace. That's why I think they've been doing so much off-earth stuff. It's their attempt to not make that episode completely non-canon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And there&amp;#39;s a limit to how bad it can get since they said in the last episode of Z that there had been 5 years of peace. That&amp;#39;s why I think they&amp;#39;ve been doing so much off-earth stuff. It&amp;#39;s their attempt to not make that episode completely non-canon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcnbul", "score_hidden": false, "stickied": false, "created": 1492408974.0, "created_utc": 1492380174.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgca0qs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "monjonltd", "parent_id": "t1_dgc85m0", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Yeah, I forgot to specify that the black arc was one of the exceptions to this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I forgot to specify that the black arc was one of the exceptions to this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgca0qs", "score_hidden": false, "stickied": false, "created": 1492391469.0, "created_utc": 1492362669.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc85m0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Astronomer_X", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "&gt;I really miss this as well, that sense of danger just seems to be completely gone from super\n\nAre you sure about this? The amount of times Black and Zamasu beat up the main cast and sent them back to the past with their ^^nonexistent  tails between their legs really made the situation Bleak.\n\nOr when Black killed Bulma?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I really miss this as well, that sense of danger just seems to be completely gone from super&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Are you sure about this? The amount of times Black and Zamasu beat up the main cast and sent them back to the past with their &lt;sup&gt;&lt;sup&gt;nonexistent&lt;/sup&gt;&lt;/sup&gt;  tails between their legs really made the situation Bleak.&lt;/p&gt;\n\n&lt;p&gt;Or when Black killed Bulma?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgc85m0", "score_hidden": false, "stickied": false, "created": 1492389049.0, "created_utc": 1492360249.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgcwzpj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "compatriot8", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "Black Star Dragon Ball destroy all GT ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Black Star Dragon Ball destroy all GT &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgcwzpj", "score_hidden": false, "stickied": false, "created": 1492421965.0, "created_utc": 1492393165.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgendys", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mistressnein", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "I hate that there isn't any battle damage in Super. To me, Z did that really well. It helped create a feeling of suspense and concern for the characters that for me is profoundly lacking in Super. Fights are less exciting and less intense in Super; it just feels like no one is ever going to get hurt.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hate that there isn&amp;#39;t any battle damage in Super. To me, Z did that really well. It helped create a feeling of suspense and concern for the characters that for me is profoundly lacking in Super. Fights are less exciting and less intense in Super; it just feels like no one is ever going to get hurt.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgendys", "score_hidden": true, "stickied": false, "created": 1492515830.0, "created_utc": 1492487030.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sdu8", "removal_reason": null, "link_id": "t3_65p15q", "likes": null, "replies": "", "user_reports": [], "id": "dgczjct", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Kinto1", "parent_id": "t3_65p15q", "subreddit_name_prefixed": "r/dbz", "controversiality": 0, "body": "About the super dragon balls: they were mentioned in dragon ball that the dragon balls were taken off of larger orbs I was rewatching the series and thought this was cool Cruz I didn't like the super dragon balls either", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;About the super dragon balls: they were mentioned in dragon ball that the dragon balls were taken off of larger orbs I was rewatching the series and thought this was cool Cruz I didn&amp;#39;t like the super dragon balls either&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dbz", "name": "t1_dgczjct", "score_hidden": false, "stickied": false, "created": 1492425523.0, "created_utc": 1492396723.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]