[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "backpacking", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Years ago, when I was backpacking across Western Europe, I was just outside Barcelona, hiking in the foothills of mount Tibidabo. I was at the end of this path, and I came to a clearing, and there was a lake, very secluded, and there were tall trees all around. It was dead silent. Gorgeous. And across the lake I saw, a beautiful woman, bathing herself. but she was crying... I hesitated, watching, struck by her beauty. And also by how her presence; the delicate curve of her back, the dark sweep of her hair, the graceful length of her limbs, even her tears, added to the majesty of my surroundings. I felt my own tears burning behind my eyes, not in sympathy, but in appreciation of such a perfect moment. She spied me before I could compose myself. But she didn&amp;#39;t cry out. Instead our eyes held and she smiled, enigmatically, fresh tears still spilling down her cheeks. I was frozen. I knew nothing about this woman, and yet, as we stood on opposite sides of a pool of water, thousands of miles from my own home and everyone I had ever known, I felt the most intense connection. Not just to her, but to the earth, the sky, the water between us. And also to the entirety of mankind. As if she symbolized thousands of years of the human condition. I wanted to go to her, to comfort her, to probe this feeling of belonging I had never encountered before. But I couldn&amp;#39;t. Because I knew that if I spoke, if she spoke, that moment would be ruined. And I knew I would need the memory of that moment to carry me through the inevitable dark patches throughout my life. And so I watched her lower her hand, turn, and slowly walk to the shore opposite me. The rest of her perfect form was gradually revealed to me, and I held my breath as I watched her disappear behind a copse of trees near the water. I didn&amp;#39;t follow her, in fact I turned around. I knew there was nothing else we could experience together that would be more perfect than that moment... And it still remains the most profound experience of my life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Years ago, when I was backpacking across Western Europe, I was just outside Barcelona, hiking in the foothills of mount Tibidabo. I was at the end of this path, and I came to a clearing, and there was a lake, very secluded, and there were tall trees all around. It was dead silent. Gorgeous. And across the lake I saw, a beautiful woman, bathing herself. but she was crying... I hesitated, watching, struck by her beauty. And also by how her presence; the delicate curve of her back, the dark sweep of her hair, the graceful length of her limbs, even her tears, added to the majesty of my surroundings. I felt my own tears burning behind my eyes, not in sympathy, but in appreciation of such a perfect moment. She spied me before I could compose myself. But she didn't cry out. Instead our eyes held and she smiled, enigmatically, fresh tears still spilling down her cheeks. I was frozen. I knew nothing about this woman, and yet, as we stood on opposite sides of a pool of water, thousands of miles from my own home and everyone I had ever known, I felt the most intense connection. Not just to her, but to the earth, the sky, the water between us. And also to the entirety of mankind. As if she symbolized thousands of years of the human condition. I wanted to go to her, to comfort her, to probe this feeling of belonging I had never encountered before. But I couldn't. Because I knew that if I spoke, if she spoke, that moment would be ruined. And I knew I would need the memory of that moment to carry me through the inevitable dark patches throughout my life. And so I watched her lower her hand, turn, and slowly walk to the shore opposite me. The rest of her perfect form was gradually revealed to me, and I held my breath as I watched her disappear behind a copse of trees near the water. I didn't follow her, in fact I turned around. I knew there was nothing else we could experience together that would be more perfect than that moment... And it still remains the most profound experience of my life.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Wilderness", "id": "64wxem", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "AdzR", "saved": false, "mod_reports": [], "name": "t3_64wxem", "subreddit_name_prefixed": "r/backpacking", "approved_by": null, "over_18": false, "domain": "self.backpacking", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qpcz", "edited": false, "link_flair_css_class": "wBackpacking", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/backpacking/comments/64wxem/my_experience_backpacking_across_western_europe/", "num_reports": null, "locked": false, "stickied": false, "created": 1492014716.0, "url": "https://www.reddit.com/r/backpacking/comments/64wxem/my_experience_backpacking_across_western_europe/", "author_flair_text": null, "quarantine": false, "title": "My experience back-packing across Western Europe", "created_utc": 1491985916.0, "distinguished": null, "media": null, "upvote_ratio": 0.5, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpcz", "removal_reason": null, "link_id": "t3_64wxem", "likes": null, "replies": "", "user_reports": [], "id": "dg5sb2v", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "shayhtfc", "parent_id": "t3_64wxem", "subreddit_name_prefixed": "r/backpacking", "controversiality": 0, "body": "Ah, I see you've reached Amsterdam and the free coffee shop wifi!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah, I see you&amp;#39;ve reached Amsterdam and the free coffee shop wifi!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "backpacking", "name": "t1_dg5sb2v", "score_hidden": false, "stickied": false, "created": 1492028610.0, "created_utc": 1491999810.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpcz", "removal_reason": null, "link_id": "t3_64wxem", "likes": null, "replies": "", "user_reports": [], "id": "dg6xfn7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "18shookg", "parent_id": "t3_64wxem", "subreddit_name_prefixed": "r/backpacking", "controversiality": 0, "body": "Try shrooms dude. That x1000. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try shrooms dude. That x1000. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "backpacking", "name": "t1_dg6xfn7", "score_hidden": false, "stickied": false, "created": 1492076054.0, "created_utc": 1492047254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]