[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "backpacking", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all! If i&amp;#39;m aiming to go backpacking in September, it&amp;#39;s looking like I&amp;#39;ll have to buy my ticket soon! Few more questions:&lt;/p&gt;\n\n&lt;p&gt;Originally I was thinking of just touring Asia, but now I might be starting my trip in England and making my way east through Europe, possibly the Middle East and end in Australia/Asia. Adventurous! But I have some more concerns:&lt;/p&gt;\n\n&lt;p&gt;Is there such a thing as travel insurance for long periods through multiple countries?&lt;/p&gt;\n\n&lt;p&gt;How about a Canadian bank account that&amp;#39;s good for international travel?&lt;/p&gt;\n\n&lt;p&gt;Finally, my original plan was just to stay in Japan/Korea for Sept-Oct, then maybe migrate south to SEA/Australia when it gets cold. Now that I might be switching between cold/warm destinations, just how do I prepare for this with one backpack?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m almost tempted to just stick to warm countries still, I just don&amp;#39;t know how to map it out starting mid-September. If anyone cares to give me any ideas :) Thinking whatever European countries I can see while it&amp;#39;s warm starting September. Christmas and New Years in Australia, Thailand Jan-Mar (maybe) and then Japan/Korea April-May or so.&lt;/p&gt;\n\n&lt;p&gt;Thanks all!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "\nHi all! If i'm aiming to go backpacking in September, it's looking like I'll have to buy my ticket soon! Few more questions:\n\nOriginally I was thinking of just touring Asia, but now I might be starting my trip in England and making my way east through Europe, possibly the Middle East and end in Australia/Asia. Adventurous! But I have some more concerns:\n\nIs there such a thing as travel insurance for long periods through multiple countries?\n\nHow about a Canadian bank account that's good for international travel?\n\nFinally, my original plan was just to stay in Japan/Korea for Sept-Oct, then maybe migrate south to SEA/Australia when it gets cold. Now that I might be switching between cold/warm destinations, just how do I prepare for this with one backpack?\n\nI'm almost tempted to just stick to warm countries still, I just don't know how to map it out starting mid-September. If anyone cares to give me any ideas :) Thinking whatever European countries I can see while it's warm starting September. Christmas and New Years in Australia, Thailand Jan-Mar (maybe) and then Japan/Korea April-May or so.\n\nThanks all!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Travel", "id": "65t7nj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "u1timo", "saved": false, "mod_reports": [], "name": "t3_65t7nj", "subreddit_name_prefixed": "r/backpacking", "approved_by": null, "over_18": false, "domain": "self.backpacking", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qpcz", "edited": false, "link_flair_css_class": "tBackpacking", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/backpacking/comments/65t7nj/few_questions_insurance_canadian_bank_account/", "num_reports": null, "locked": false, "stickied": false, "created": 1492427650.0, "url": "https://www.reddit.com/r/backpacking/comments/65t7nj/few_questions_insurance_canadian_bank_account/", "author_flair_text": null, "quarantine": false, "title": "Few questions - insurance, Canadian bank account, switching between warm/cold climates", "created_utc": 1492398850.0, "distinguished": null, "media": null, "upvote_ratio": 0.57, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpcz", "removal_reason": null, "link_id": "t3_65t7nj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpcz", "removal_reason": null, "link_id": "t3_65t7nj", "likes": null, "replies": "", "user_reports": [], "id": "dgdpgff", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iwanttobackpack123", "parent_id": "t1_dgd4si3", "subreddit_name_prefixed": "r/backpacking", "controversiality": 0, "body": "I'm doing a similar trip and I went with an Amazon credit card too. It has no foreign exchange fees and if you pay in advance, there's no cash advance fees so you can withdraw money at an ATM.\n\nFor the cases it doesn't work or I want cash, I have the TD all-inclusive bank card which I can use to withdraw money. It has no non-TD ATM fees so I assume that applies for foreign ones too so I think I'll only have to pay the FEX fee at withdrawal of cash.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m doing a similar trip and I went with an Amazon credit card too. It has no foreign exchange fees and if you pay in advance, there&amp;#39;s no cash advance fees so you can withdraw money at an ATM.&lt;/p&gt;\n\n&lt;p&gt;For the cases it doesn&amp;#39;t work or I want cash, I have the TD all-inclusive bank card which I can use to withdraw money. It has no non-TD ATM fees so I assume that applies for foreign ones too so I think I&amp;#39;ll only have to pay the FEX fee at withdrawal of cash.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "backpacking", "name": "t1_dgdpgff", "score_hidden": false, "stickied": false, "created": 1492475190.0, "created_utc": 1492446390.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd4si3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RubberReptile", "parent_id": "t3_65t7nj", "subreddit_name_prefixed": "r/backpacking", "controversiality": 0, "body": "Instead of a bank card primarily, it might be worth getting a credit card. For example the Amazon.ca Chase Visa card has no additional fees for currency conversion (most cards are conversion rate +2.5% fee). Plus, if your card info is swiped it is fully covered whereas bank cards don't necessarily cover you in the event your info is stolen. \n\n\nJust pay your credit card bill online.\n\n\nMost banks will charge hefty foreign exchange fees as either a transaction fee or a percent (or both!) but maybe some are better than others. I haven't looked into it as extensively as credit cards. You can often use the bank card and get cash out as cash back at a grocery store (no ATM fees if you do it this way but it's not always possible), or just buy cash from an exchange place as a backup plan and/or for places that don't largely accept credit. Though I noted many cases buying cash cost more than using the no markup credit card.\n\n\nThe other no yearly fee no foreign exchange fee cards are the Rogers &amp; Fido credit cards, which have \"4% rewards\" on Foreign Exchange (forex). That gets rid of the 2.5% upcharge but you can only use their rewards for rogers/fido related stuff so it's strictly worse than the Amazon.ca card which is just no ForEx fee.   \n\n\nAlso keep your eyes out for vendors whose credit machines will offer to convert the currency for you. **Always** pay with your card in the local currency, otherwise the markup is big!", "edited": 1492405293.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Instead of a bank card primarily, it might be worth getting a credit card. For example the Amazon.ca Chase Visa card has no additional fees for currency conversion (most cards are conversion rate +2.5% fee). Plus, if your card info is swiped it is fully covered whereas bank cards don&amp;#39;t necessarily cover you in the event your info is stolen. &lt;/p&gt;\n\n&lt;p&gt;Just pay your credit card bill online.&lt;/p&gt;\n\n&lt;p&gt;Most banks will charge hefty foreign exchange fees as either a transaction fee or a percent (or both!) but maybe some are better than others. I haven&amp;#39;t looked into it as extensively as credit cards. You can often use the bank card and get cash out as cash back at a grocery store (no ATM fees if you do it this way but it&amp;#39;s not always possible), or just buy cash from an exchange place as a backup plan and/or for places that don&amp;#39;t largely accept credit. Though I noted many cases buying cash cost more than using the no markup credit card.&lt;/p&gt;\n\n&lt;p&gt;The other no yearly fee no foreign exchange fee cards are the Rogers &amp;amp; Fido credit cards, which have &amp;quot;4% rewards&amp;quot; on Foreign Exchange (forex). That gets rid of the 2.5% upcharge but you can only use their rewards for rogers/fido related stuff so it&amp;#39;s strictly worse than the Amazon.ca card which is just no ForEx fee.   &lt;/p&gt;\n\n&lt;p&gt;Also keep your eyes out for vendors whose credit machines will offer to convert the currency for you. &lt;strong&gt;Always&lt;/strong&gt; pay with your card in the local currency, otherwise the markup is big!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "backpacking", "name": "t1_dgd4si3", "score_hidden": false, "stickied": false, "created": 1492433718.0, "created_utc": 1492404918.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpcz", "removal_reason": null, "link_id": "t3_65t7nj", "likes": null, "replies": "", "user_reports": [], "id": "dgd3nqa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "down-with-schools", "parent_id": "t3_65t7nj", "subreddit_name_prefixed": "r/backpacking", "controversiality": 0, "body": "Hey so I'm Canadian and toured south east Asia this winter. \nWorld nomads does fixed rate travel insurance for multiple countries for 6 months at a time and covers many activities. I know of lots of travelers who have used them but look around at other policies as well. \nAs for Canadian banks The best I have seen is the PC visa that has minimal fees for withdrawing cash world wide and the tangerine bank (an online bank that doesn't have any brick and mortar stores) that charges 2$ per transaction when abroad. I used the tangerine card for most of my trip and had it work in most countries but carried back ups as there were times it wouldn't work.\nI met lots of travelers who did a similar trip to you with a variety of climates and were carrying clothing for all climates. I personally wouldn't recommend this, and think it would be better/easier to buy and ditch clothing as needed, but I understand that it can be hard on your budget to buy clothing in the more expensive countries. Layering can work but has its limits when it gets to the cold weather. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey so I&amp;#39;m Canadian and toured south east Asia this winter. \nWorld nomads does fixed rate travel insurance for multiple countries for 6 months at a time and covers many activities. I know of lots of travelers who have used them but look around at other policies as well. \nAs for Canadian banks The best I have seen is the PC visa that has minimal fees for withdrawing cash world wide and the tangerine bank (an online bank that doesn&amp;#39;t have any brick and mortar stores) that charges 2$ per transaction when abroad. I used the tangerine card for most of my trip and had it work in most countries but carried back ups as there were times it wouldn&amp;#39;t work.\nI met lots of travelers who did a similar trip to you with a variety of climates and were carrying clothing for all climates. I personally wouldn&amp;#39;t recommend this, and think it would be better/easier to buy and ditch clothing as needed, but I understand that it can be hard on your budget to buy clothing in the more expensive countries. Layering can work but has its limits when it gets to the cold weather. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "backpacking", "name": "t1_dgd3nqa", "score_hidden": false, "stickied": false, "created": 1492431697.0, "created_utc": 1492402897.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]