[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "startups", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TLDR: 3 years ago we launched an email marketing platform. We&amp;#39;ve struggled since with issues of spam and growing the platform, but we&amp;#39;ve come out the other side with some really promising growth and last month passed the billion email threshold. We&amp;#39;re profitable, have taken on no funding nor dipped into our own bank accounts.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a prettier version with some graphs and images on &lt;a href=\"https://medium.com/emailoctopus/the-road-to-one-billion-emails-4ed7d441e190\"&gt;Medium&lt;/a&gt;. We&amp;#39;re open to questions - we launched originally in &lt;a href=\"/r/Marketing\"&gt;/r/Marketing&lt;/a&gt; so likely owe something back.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h1&gt;The road to one billion emails&lt;/h1&gt;\n\n&lt;h2&gt;The story and lessons behind sustainably scaling EmailOctopus&lt;/h2&gt;\n\n&lt;p&gt;Last month we hit a significant milestone in the journey of our email marketing platform, EmailOctopus. Over the past couple of years we’ve hit a number of milestones; hundreds of customers, thousands of users and hundreds of thousands in revenue. But 1,000,000,000 emails, despite being very much a vanity metric, feels like our most significant milestone yet. We’re super proud of the difficult work, much of it complex and technical, in acquiring, keeping and servicing our users.&lt;/p&gt;\n\n&lt;p&gt;We’ve never shared too much about the story behind EmailOctopus, about how in a world awash with VC funding, we’re growing sustainably and organically without taking on any capital. Unlike Uber or AirBnb, at EmailOctopus we’re not setting out to own the universe. Instead, we’re looking to make a mere dent in it while having a fun, enlightening time doing so.&lt;/p&gt;\n\n&lt;p&gt;This is our story.&lt;/p&gt;\n\n&lt;h3&gt;How we started&lt;/h3&gt;\n\n&lt;p&gt;The idea behind EmailOctopus was conceived back in early 2014; a side project born from a personal need. At the time, our co-founder Jonathan was working on another project which had built up a reasonable base of users. Most of those opted into email updates but at 2,000 subscribers the costs of sending those monthly blasts through MailChimp became too great. Jonathan wrote a quick script which looped through his database and sent those emails through Amazon’s Simple Email Service, a platform for programmatically sending emails.It went well — deliverability was on a par with MailChimp and most importantly, it didn’t cost a penny.&lt;/p&gt;\n\n&lt;p&gt;Almost a year later and even though big players were sending all their email comms and marketing through SES (see Netflix, Uber, Spotify), no SaaS solution existed. Teaming up with his brother, Gareth (a marketer with an equally expensive email bill), EmailOctopus was born with the mission to fill that gap. A lander was launched and we started collecting emails for what promised to be a disruptive new platform.&lt;/p&gt;\n\n&lt;p&gt;Six months on and our MVP was barely more advanced than that initial script — a free platform which allowed users to hook up AWS and send emails and manage unsubscribes, bounces and complaints. We posted to Hacker News, &lt;a href=\"https://www.reddit.com/r/marketing/comments/31bfet/looking_for_a_cheaper_alternative_to_mailchimp_i/\"&gt;r/marketing&lt;/a&gt;, &lt;a href=\"https://twitter.com/emailoctopusco\"&gt;Twitter&lt;/a&gt; and sent an email announcement to the leads collected via our lander and we quickly generated 2,000 sign ups.&lt;/p&gt;\n\n&lt;p&gt;It wasn’t until July 2015 that we monetised the platform and added paid plans. In hindsight this wasn’t the smartest move — we’d spent almost a year validating our MVP against a free model. And while the large user base had helped us iron out a lot of the kinks and bugs in the service (users are a lot more forgiving when they’re not paying anything), over 99% of them dropped off when we imposed limits on the free plan. Things had started to get difficult.&lt;/p&gt;\n\n&lt;p&gt;Many businesses describe the first 10 customers as the hardest to get. While our user count had taken a huge hit overnight, we felt quietly confident that crossing that line had given our small business enough validation to keep going.&lt;/p&gt;\n\n&lt;h3&gt;All growth is not good growth&lt;/h3&gt;\n\n&lt;p&gt;Under our new pricing model we began to pull in a couple of hundred signups a month, around 10% of which were converting. However there are a lot of nefarious people in the email marketing industry (who knew!?) — and we’d inadvertently creating one of the most accessible email marketing platforms out there. For casual spammers and black-hat marketers, we must have seemed like a gift from God.&lt;/p&gt;\n\n&lt;p&gt;It was clear we had a spam issue. While all emails are sent through the user’s SES account (Amazon do a great job of shutting down spammers), we had a brand and a relationship with Amazon to protect and valued our relationship with Amazon. We put all new features on hold and began building in programmatic checks to avoid spam emails and questionable sign-ups.&lt;/p&gt;\n\n&lt;p&gt;Our growth naturally slowed and there was no doubt that this change meant less money in our own pockets — a bitter pill to swallow when you’re bootstrapped. But we always wanted to build an ethical, long-term product, doing business the right way. And certainly not one which fills up your inbox with penis enlargement emails.&lt;/p&gt;\n\n&lt;h3&gt;Acquiring users&lt;/h3&gt;\n\n&lt;p&gt;So how do we go about acquiring good quality users on a bootstrapped budget?&lt;/p&gt;\n\n&lt;p&gt;Side project marketing. This comes under a number of different monikers but it essentially involves creating a separate product and using it to promote your core product. Hubspot are one of the main proponents of this technique, launching apps such as &lt;a href=\"http://www.makemypersona.com/\"&gt;MakeMyPersona&lt;/a&gt; and &lt;a href=\"https://website.grader.com/\"&gt;Website Grader&lt;/a&gt;. At EmailOctopus we chose to spin out our responsive email templates into a free standalone product, complete with its own &lt;a href=\"https://templates.emailoctopus.com\"&gt;landing page&lt;/a&gt; and &lt;a href=\"https://github.com/threeheartsdigital/emailoctopus-templates\"&gt;Github repo&lt;/a&gt;. We launched on &lt;a href=\"https://www.producthunt.com/posts/templates-by-emailoctopus\"&gt;Product Hunt&lt;/a&gt; and were one of the most successful submissions of the week with over 650 upvotes. Six months on and this channel just keeps on giving, with hundreds of downloads a month and many users going on to become paid customers. If you want to read more on this we have a &lt;a href=\"https://blog.emailoctopus.com/the-secrets-being-a-successful-product-hunt-launch/\"&gt;dedicated post&lt;/a&gt; going into further detail.&lt;/p&gt;\n\n&lt;p&gt;When we’re not creating side projects, we’re regular focus on upgrading users who try us out but don’t upgrade. Our most successful push at doing this was during the Black Friday weekend. We weren’t alone — in 2016 a huge number of B2B SaaS businesses tried to jump on the holiday traditionally favoured by the retail sector. Our proposition for Black Friday revolved around encouraging our leads (free/churned users) to return to EmailOctopus to send out their Black Friday campaigns at a hugely discounted price — just $1 for an email campaign to 250,000 subscribers. The campaign consisted of a specific Black Friday landing page and an email campaign sent to all existing leads, both of which added almost $1000 in monthly recurring revenue.&lt;/p&gt;\n\n&lt;p&gt;We continue to come up with new and innovative ways of marketing EmailOctopus, but nothing beats the power of word of mouth. We always set out to offer a highly personal service to all of our users (even those on our free plan), and while it uses up a lot of our resources, we think it’s worth it. Over 20% of our customers come through a personal recommendation.&lt;/p&gt;\n\n&lt;h3&gt;Tech journey/challenges&lt;/h3&gt;\n\n&lt;p&gt;Building a system which is capable of sending millions an email a day has presented a number of unique challenges. Almost all of the code from our MVP has been thrown out (remember that big PHP loop we mentioned?), and in its place is a system that can expand as quickly as our customer base does. We strive to never let our growth get in the way of performance, and we’re proud to say that we’re the only product on the market that promises to send as quickly as an SES account allows. No matter how well we’re doing!&lt;/p&gt;\n\n&lt;p&gt;Another side effect of rapid growth is a rapidly expanding database; before setting out we never predicted quite how much data email marketing could generate (1 terrabyte to date!). A single campaign alone can generate hundreds of thousands of events that need to be categorised, stored, processed and presented to a user. Every open, click, bounce, spam report and unsubscribe goes through an EmailOctopus server to be tracked, so it’s vital we’re ready to receive and process them quickly. This is where self-hosted solutions can fall down — many of our customers tell us that they moved to us after what amounts to a DDOS of their own server during a large email blast.&lt;/p&gt;\n\n&lt;p&gt;We are, of course, using a large chunk of AWS’s suite to power this beast — around 15 of their products at last count. The core of EmailOctopus sits on a number of microservices spread over EC2 and Lambda, which allows us to selectively scale parts up and down depending on demand. That really helps keep our hefty AWS bill under control. Our most important lesson to date? Rigidly relying on CloudFormation to script and edit that infrastructure — every change is version-controlled and propagates across all of our environments.&lt;/p&gt;\n\n&lt;h3&gt;Scaling the team + moving offices + remote working&lt;/h3&gt;\n\n&lt;p&gt;At present we only have two full-time staff, sharing a small office in London with Ticket Tailor and PayHip.&lt;/p&gt;\n\n&lt;p&gt;Together our inhouse team handles all of the support, marketing, product work and oversee all technical development, but as our user base and revenue grows, we’re left wondering how much we should re-invest in scaling the team. As a bootstrapped business we’ve already become experts in rigorously prioritising features — with us often reverting to the simple question of; “Will it drive more revenue than Feature X? Will it save us time than Feature Y?”. But becoming more established brings extra demands on all of the team, many of which don’t involve feature development. It’s important to keep the pace — we aim to release a new feature every week — which means our small team has had to grow to accommodate.&lt;/p&gt;\n\n&lt;p&gt;We chose to use freelancers to to do this. Freelancers are great for a small growing business as it allows you to use the right person for that project without the long-term responsibility and paperwork that an employee may bring. At any one time we have up to 5 different freelancers working on EmailOctopus, in technical, design and content roles. All of these come from personal recommendations, which means the quality of work remains high. If you’re not so lucky then make sure to take your freelancers on for a small task before committing to a larger chunk of work. Pick your freelancers carefully.&lt;/p&gt;\n\n&lt;p&gt;This doesn’t mean we don’t plan to expand our inhouse team — we have a couple of desks free and expect to expand soon. But for now we’re enjoying the luxury of not having to manage contracts, HR and all the other distractions that employees can being. This will no doubt be a tough learning period and will surely be covered in a future blog post.&lt;/p&gt;\n\n&lt;h3&gt;Personal challenges&lt;/h3&gt;\n\n&lt;p&gt;For two years, Jonathan and Gareth were running EmailOctopus as a side project alongside their full time roles. As things got busier this put considerable strain on their personal time — evenings and weekends were consumed by coding and support. Jonathan took a long while before he felt able to take the plunge and go full time on EmailOctopus, however he strongly advocates this approach. On advising another founder in a similar position: “If you can, stay in employment a while longer and validate your MVP in your spare time. I had a few ideas which missed the mark and it took me almost a year to find a project that showed the growth I was looking for. If I hadn’t had the luxury of a monthly pay packet, I would have ran out of money before I had the chance to properly pursue the goal.”&lt;/p&gt;\n\n&lt;p&gt;For Tom, who begun working on EmailOctopus in April last year, moving from a position as a salaried Product Manager in an established scale-up to a much smaller start-up with no full time employees was an interesting transition. The change naturally meant a significant reduction in salary, so in order to cover that shortfall he also picked up contract roles for 2 days a week at other startups such as Property Partner, a London based property crowdfunding website. The day rates offered freelancing in Growth and Product covered much of the shortfall, allowing him to focus 3 days a week working on EmailOctopus.&lt;/p&gt;\n\n&lt;p&gt;2 years on the benefits of running our own business, far outweigh the negatives and challenges that we’ve had to overcome.&lt;/p&gt;\n\n&lt;h3&gt;Scaling sustainably&lt;/h3&gt;\n\n&lt;p&gt;Our focus since starting EmailOctopus has been to grow it sustainably. We want to grow as quickly as possible, but not by spending beyond our means.&lt;/p&gt;\n\n&lt;p&gt;The risk in focusing on profit and growing sustainably is that you quickly develop a lean mindsight. In fact we’ve all become quite averse to the idea of spending money on almost anything aside from our server fees and staff. We’ve seen strong growth for 2 years without a specific marketing budget — but that doesn’t mean it wouldn’t have been stronger with some money behind it. To overcome these fears we’ve started to allocate specific budgets for marketing; exploring new channels and scaling existing ones. Facebook ads are working fantastically, and with the help of freelancers, we’re able to regularly refresh the content.&lt;/p&gt;\n\n&lt;p&gt;To make sure we’re always moving in the right direction we’ve created a number of dashboards with our most important KPI’s; MRR number of customers (trialling, active, churned) and a funnel which tells us how many customers go from sign up to sending an email. Each month we choose a measurable metric which we are keen to move and focus at least 50% of our team efforts on that goal, Netflix style. We also rely heavily on ChartMogul to help us keep on top of our finances.&lt;/p&gt;\n\n&lt;p&gt;Automating or at the very least speeding up menial tasks, has also been important in growing the business. One of our biggest improvements in productivity came from quickly creating an admin dashboard.&lt;/p&gt;\n\n&lt;p&gt;As a team made up of technical users, we’d happily spend 10 minutes on a support ticket pulling the right data from our MySQL tables. Technical people are so used to solving problems that we become content in finding workarounds, they’re great at an early stage, but the time wasted as you scale will add up significantly. Now if we receive the same query 5 times (“Why doesn’t my campaign look right?!”) we make sure to add a quick diagnosis tool to the dashboard. Most importantly, we have a meeting every month to track exactly where time and money is being spent. Tracking that output is vital for growing a sustainable business.&lt;/p&gt;\n\n&lt;h3&gt;Round-up and where we hope to go&lt;/h3&gt;\n\n&lt;p&gt;So that’s our story so far. In the space of 3 years we’ve managed to take an idea and turn it into a viable, profitable, business without taking on a penny of funding or dipping into our own bank accounts. We’re looking to continue on the same track for years to come, using our money wisely and carefully to grow the business to an even greater scale.&lt;/p&gt;\n\n&lt;p&gt;By growing the business ourselves and taking on no funding from Venture Capitalists we think we’re more able to make decisions ourselves about the future for the business. We don’t have to concern ourselves with what will drive the best return on a moon-shot investment and instead we can zero-in and focus on doing what’s best for us and our customers.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "TLDR: 3 years ago we launched an email marketing platform. We've struggled since with issues of spam and growing the platform, but we've come out the other side with some really promising growth and last month passed the billion email threshold. We're profitable, have taken on no funding nor dipped into our own bank accounts.\n\nThere's a prettier version with some graphs and images on [Medium](https://medium.com/emailoctopus/the-road-to-one-billion-emails-4ed7d441e190). We're open to questions - we launched originally in /r/Marketing so likely owe something back.\n\n*****\n# The road to one billion emails\n\n## The story and lessons behind sustainably scaling EmailOctopus\n\nLast month we hit a significant milestone in the journey of our email marketing platform, EmailOctopus. Over the past couple of years we’ve hit a number of milestones; hundreds of customers, thousands of users and hundreds of thousands in revenue. But 1,000,000,000 emails, despite being very much a vanity metric, feels like our most significant milestone yet. We’re super proud of the difficult work, much of it complex and technical, in acquiring, keeping and servicing our users.\n\nWe’ve never shared too much about the story behind EmailOctopus, about how in a world awash with VC funding, we’re growing sustainably and organically without taking on any capital. Unlike Uber or AirBnb, at EmailOctopus we’re not setting out to own the universe. Instead, we’re looking to make a mere dent in it while having a fun, enlightening time doing so.\n\nThis is our story.\n\n### How we started\n\nThe idea behind EmailOctopus was conceived back in early 2014; a side project born from a personal need. At the time, our co-founder Jonathan was working on another project which had built up a reasonable base of users. Most of those opted into email updates but at 2,000 subscribers the costs of sending those monthly blasts through MailChimp became too great. Jonathan wrote a quick script which looped through his database and sent those emails through Amazon’s Simple Email Service, a platform for programmatically sending emails.It went well — deliverability was on a par with MailChimp and most importantly, it didn’t cost a penny.\n\nAlmost a year later and even though big players were sending all their email comms and marketing through SES (see Netflix, Uber, Spotify), no SaaS solution existed. Teaming up with his brother, Gareth (a marketer with an equally expensive email bill), EmailOctopus was born with the mission to fill that gap. A lander was launched and we started collecting emails for what promised to be a disruptive new platform.\n\nSix months on and our MVP was barely more advanced than that initial script — a free platform which allowed users to hook up AWS and send emails and manage unsubscribes, bounces and complaints. We posted to Hacker News, [r/marketing](https://www.reddit.com/r/marketing/comments/31bfet/looking_for_a_cheaper_alternative_to_mailchimp_i/), [Twitter](https://twitter.com/emailoctopusco) and sent an email announcement to the leads collected via our lander and we quickly generated 2,000 sign ups.\n\nIt wasn’t until July 2015 that we monetised the platform and added paid plans. In hindsight this wasn’t the smartest move — we’d spent almost a year validating our MVP against a free model. And while the large user base had helped us iron out a lot of the kinks and bugs in the service (users are a lot more forgiving when they’re not paying anything), over 99% of them dropped off when we imposed limits on the free plan. Things had started to get difficult.\n\nMany businesses describe the first 10 customers as the hardest to get. While our user count had taken a huge hit overnight, we felt quietly confident that crossing that line had given our small business enough validation to keep going.\n\n### All growth is not good growth\n\nUnder our new pricing model we began to pull in a couple of hundred signups a month, around 10% of which were converting. However there are a lot of nefarious people in the email marketing industry (who knew!?) — and we’d inadvertently creating one of the most accessible email marketing platforms out there. For casual spammers and black-hat marketers, we must have seemed like a gift from God.\n\nIt was clear we had a spam issue. While all emails are sent through the user’s SES account (Amazon do a great job of shutting down spammers), we had a brand and a relationship with Amazon to protect and valued our relationship with Amazon. We put all new features on hold and began building in programmatic checks to avoid spam emails and questionable sign-ups.\n\nOur growth naturally slowed and there was no doubt that this change meant less money in our own pockets — a bitter pill to swallow when you’re bootstrapped. But we always wanted to build an ethical, long-term product, doing business the right way. And certainly not one which fills up your inbox with penis enlargement emails.\n\n### Acquiring users\n\nSo how do we go about acquiring good quality users on a bootstrapped budget?\n\nSide project marketing. This comes under a number of different monikers but it essentially involves creating a separate product and using it to promote your core product. Hubspot are one of the main proponents of this technique, launching apps such as [MakeMyPersona](http://www.makemypersona.com/) and [Website Grader](https://website.grader.com/). At EmailOctopus we chose to spin out our responsive email templates into a free standalone product, complete with its own [landing page](https://templates.emailoctopus.com) and [Github repo](https://github.com/threeheartsdigital/emailoctopus-templates). We launched on [Product Hunt](https://www.producthunt.com/posts/templates-by-emailoctopus) and were one of the most successful submissions of the week with over 650 upvotes. Six months on and this channel just keeps on giving, with hundreds of downloads a month and many users going on to become paid customers. If you want to read more on this we have a [dedicated post](https://blog.emailoctopus.com/the-secrets-being-a-successful-product-hunt-launch/) going into further detail.\n\nWhen we’re not creating side projects, we’re regular focus on upgrading users who try us out but don’t upgrade. Our most successful push at doing this was during the Black Friday weekend. We weren’t alone — in 2016 a huge number of B2B SaaS businesses tried to jump on the holiday traditionally favoured by the retail sector. Our proposition for Black Friday revolved around encouraging our leads (free/churned users) to return to EmailOctopus to send out their Black Friday campaigns at a hugely discounted price — just $1 for an email campaign to 250,000 subscribers. The campaign consisted of a specific Black Friday landing page and an email campaign sent to all existing leads, both of which added almost $1000 in monthly recurring revenue.\n\nWe continue to come up with new and innovative ways of marketing EmailOctopus, but nothing beats the power of word of mouth. We always set out to offer a highly personal service to all of our users (even those on our free plan), and while it uses up a lot of our resources, we think it’s worth it. Over 20% of our customers come through a personal recommendation.\n\n### Tech journey/challenges\n\nBuilding a system which is capable of sending millions an email a day has presented a number of unique challenges. Almost all of the code from our MVP has been thrown out (remember that big PHP loop we mentioned?), and in its place is a system that can expand as quickly as our customer base does. We strive to never let our growth get in the way of performance, and we’re proud to say that we’re the only product on the market that promises to send as quickly as an SES account allows. No matter how well we’re doing!\n\nAnother side effect of rapid growth is a rapidly expanding database; before setting out we never predicted quite how much data email marketing could generate (1 terrabyte to date!). A single campaign alone can generate hundreds of thousands of events that need to be categorised, stored, processed and presented to a user. Every open, click, bounce, spam report and unsubscribe goes through an EmailOctopus server to be tracked, so it’s vital we’re ready to receive and process them quickly. This is where self-hosted solutions can fall down — many of our customers tell us that they moved to us after what amounts to a DDOS of their own server during a large email blast.\n\nWe are, of course, using a large chunk of AWS’s suite to power this beast — around 15 of their products at last count. The core of EmailOctopus sits on a number of microservices spread over EC2 and Lambda, which allows us to selectively scale parts up and down depending on demand. That really helps keep our hefty AWS bill under control. Our most important lesson to date? Rigidly relying on CloudFormation to script and edit that infrastructure — every change is version-controlled and propagates across all of our environments.\n### Scaling the team + moving offices + remote working\n\nAt present we only have two full-time staff, sharing a small office in London with Ticket Tailor and PayHip.\n\nTogether our inhouse team handles all of the support, marketing, product work and oversee all technical development, but as our user base and revenue grows, we’re left wondering how much we should re-invest in scaling the team. As a bootstrapped business we’ve already become experts in rigorously prioritising features — with us often reverting to the simple question of; “Will it drive more revenue than Feature X? Will it save us time than Feature Y?”. But becoming more established brings extra demands on all of the team, many of which don’t involve feature development. It’s important to keep the pace — we aim to release a new feature every week — which means our small team has had to grow to accommodate.\n\nWe chose to use freelancers to to do this. Freelancers are great for a small growing business as it allows you to use the right person for that project without the long-term responsibility and paperwork that an employee may bring. At any one time we have up to 5 different freelancers working on EmailOctopus, in technical, design and content roles. All of these come from personal recommendations, which means the quality of work remains high. If you’re not so lucky then make sure to take your freelancers on for a small task before committing to a larger chunk of work. Pick your freelancers carefully.\n\nThis doesn’t mean we don’t plan to expand our inhouse team — we have a couple of desks free and expect to expand soon. But for now we’re enjoying the luxury of not having to manage contracts, HR and all the other distractions that employees can being. This will no doubt be a tough learning period and will surely be covered in a future blog post.\n\n### Personal challenges\n\nFor two years, Jonathan and Gareth were running EmailOctopus as a side project alongside their full time roles. As things got busier this put considerable strain on their personal time — evenings and weekends were consumed by coding and support. Jonathan took a long while before he felt able to take the plunge and go full time on EmailOctopus, however he strongly advocates this approach. On advising another founder in a similar position: “If you can, stay in employment a while longer and validate your MVP in your spare time. I had a few ideas which missed the mark and it took me almost a year to find a project that showed the growth I was looking for. If I hadn’t had the luxury of a monthly pay packet, I would have ran out of money before I had the chance to properly pursue the goal.”\n\nFor Tom, who begun working on EmailOctopus in April last year, moving from a position as a salaried Product Manager in an established scale-up to a much smaller start-up with no full time employees was an interesting transition. The change naturally meant a significant reduction in salary, so in order to cover that shortfall he also picked up contract roles for 2 days a week at other startups such as Property Partner, a London based property crowdfunding website. The day rates offered freelancing in Growth and Product covered much of the shortfall, allowing him to focus 3 days a week working on EmailOctopus.\n\n2 years on the benefits of running our own business, far outweigh the negatives and challenges that we’ve had to overcome.\n\n### Scaling sustainably\n\nOur focus since starting EmailOctopus has been to grow it sustainably. We want to grow as quickly as possible, but not by spending beyond our means.\n\nThe risk in focusing on profit and growing sustainably is that you quickly develop a lean mindsight. In fact we’ve all become quite averse to the idea of spending money on almost anything aside from our server fees and staff. We’ve seen strong growth for 2 years without a specific marketing budget — but that doesn’t mean it wouldn’t have been stronger with some money behind it. To overcome these fears we’ve started to allocate specific budgets for marketing; exploring new channels and scaling existing ones. Facebook ads are working fantastically, and with the help of freelancers, we’re able to regularly refresh the content.\n\nTo make sure we’re always moving in the right direction we’ve created a number of dashboards with our most important KPI’s; MRR number of customers (trialling, active, churned) and a funnel which tells us how many customers go from sign up to sending an email. Each month we choose a measurable metric which we are keen to move and focus at least 50% of our team efforts on that goal, Netflix style. We also rely heavily on ChartMogul to help us keep on top of our finances.\n\nAutomating or at the very least speeding up menial tasks, has also been important in growing the business. One of our biggest improvements in productivity came from quickly creating an admin dashboard.\n\nAs a team made up of technical users, we’d happily spend 10 minutes on a support ticket pulling the right data from our MySQL tables. Technical people are so used to solving problems that we become content in finding workarounds, they’re great at an early stage, but the time wasted as you scale will add up significantly. Now if we receive the same query 5 times (“Why doesn’t my campaign look right?!”) we make sure to add a quick diagnosis tool to the dashboard. Most importantly, we have a meeting every month to track exactly where time and money is being spent. Tracking that output is vital for growing a sustainable business.\n\n### Round-up and where we hope to go\n\nSo that’s our story so far. In the space of 3 years we’ve managed to take an idea and turn it into a viable, profitable, business without taking on a penny of funding or dipping into our own bank accounts. We’re looking to continue on the same track for years to come, using our money wisely and carefully to grow the business to an even greater scale.\n\nBy growing the business ourselves and taking on no funding from Venture Capitalists we think we’re more able to make decisions ourselves about the future for the business. We don’t have to concern ourselves with what will drive the best return on a moon-shot investment and instead we can zero-in and focus on doing what’s best for us and our customers.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64rt2e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 49, "report_reasons": null, "author": "02thoeva", "saved": false, "mod_reports": [], "name": "t3_64rt2e", "subreddit_name_prefixed": "r/startups", "approved_by": null, "over_18": false, "domain": "self.startups", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh26", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/startups/comments/64rt2e/the_road_to_one_billion_emails_how_we_have/", "num_reports": null, "locked": false, "stickied": false, "created": 1491956015.0, "url": "https://www.reddit.com/r/startups/comments/64rt2e/the_road_to_one_billion_emails_how_we_have/", "author_flair_text": null, "quarantine": false, "title": "The road to one billion emails - how we have sustainably scaled our email marketing business", "created_utc": 1491927215.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 49}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": "", "user_reports": [], "id": "dg5ieip", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "humphreybc", "parent_id": "t1_dg563ra", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Why did this comment get downvoted?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why did this comment get downvoted?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5ieip", "score_hidden": false, "stickied": false, "created": 1492002871.0, "created_utc": 1491974071.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": "", "user_reports": [], "id": "dg5lmu7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "02thoeva", "parent_id": "t1_dg563ra", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Just checked out your site. Lovely logo and design! Definitely would personally want to add Pricing first, as that's what's going to pay the bills. Looks like you have some good clients on board though, which is very promising.\n\nThanks for flagging the typos and links. We spent about 3 weeks sitting on this in Google docs, before deciding to publish, so will make those changes.\n\nAs for the Admin Dashboard - really, it's so worth it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just checked out your site. Lovely logo and design! Definitely would personally want to add Pricing first, as that&amp;#39;s what&amp;#39;s going to pay the bills. Looks like you have some good clients on board though, which is very promising.&lt;/p&gt;\n\n&lt;p&gt;Thanks for flagging the typos and links. We spent about 3 weeks sitting on this in Google docs, before deciding to publish, so will make those changes.&lt;/p&gt;\n\n&lt;p&gt;As for the Admin Dashboard - really, it&amp;#39;s so worth it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5lmu7", "score_hidden": false, "stickied": false, "created": 1492010405.0, "created_utc": 1491981605.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg563ra", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "humphreybc", "parent_id": "t3_64rt2e", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Wow, what a fantastically relevant write-up. My co-founder and I are in a very, very similar boat with [our product](https://getdovetail.io) – it's bootstrapped and we're still working full time during the day. Everyone tells us to quit and go full time on the startup, but a bit like Jonathan I'm hesitant. We're only 6 months old and haven't added pricing yet, which I see as the ‘true’ validator of our product even though we're growing ~20% MoM with no paid marketing. \n\nWe've also been talking about building an admin dashboard to help with support cases (rather than just firing up Postico) but I haven't been convinced of the value until now.\n\nAlso, just thought I'd let you know there are a few typos. “We’d inadvertently creating” I think you mean “created” instead. Also, all of your links on the Medium article go to Google first, then the original URL.", "edited": 1491956763.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, what a fantastically relevant write-up. My co-founder and I are in a very, very similar boat with &lt;a href=\"https://getdovetail.io\"&gt;our product&lt;/a&gt; – it&amp;#39;s bootstrapped and we&amp;#39;re still working full time during the day. Everyone tells us to quit and go full time on the startup, but a bit like Jonathan I&amp;#39;m hesitant. We&amp;#39;re only 6 months old and haven&amp;#39;t added pricing yet, which I see as the ‘true’ validator of our product even though we&amp;#39;re growing ~20% MoM with no paid marketing. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve also been talking about building an admin dashboard to help with support cases (rather than just firing up Postico) but I haven&amp;#39;t been convinced of the value until now.&lt;/p&gt;\n\n&lt;p&gt;Also, just thought I&amp;#39;d let you know there are a few typos. “We’d inadvertently creating” I think you mean “created” instead. Also, all of your links on the Medium article go to Google first, then the original URL.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg563ra", "score_hidden": false, "stickied": false, "created": 1491984892.0, "created_utc": 1491956092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": "", "user_reports": [], "id": "dg5oh2j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BookSproutChris", "parent_id": "t1_dg5mgck", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Yeah, it definitely is. So far I've got it so that the authors who like the platform end up bringing in readers. Some authors bring in hundreds, while most don't bring many. That's something I need to work on as I haven't really setup a real onboarding flow yet.\n\nI'll continue watching you guys as well. I've almost signed up a few times, and keep meaning to. I'm on your mailing list at least :P", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, it definitely is. So far I&amp;#39;ve got it so that the authors who like the platform end up bringing in readers. Some authors bring in hundreds, while most don&amp;#39;t bring many. That&amp;#39;s something I need to work on as I haven&amp;#39;t really setup a real onboarding flow yet.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll continue watching you guys as well. I&amp;#39;ve almost signed up a few times, and keep meaning to. I&amp;#39;m on your mailing list at least :P&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5oh2j", "score_hidden": false, "stickied": false, "created": 1492019084.0, "created_utc": 1491990284.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mgck", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "02thoeva", "parent_id": "t1_dg5m0gm", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Definitely harder if you have to acquire users on both fronts, too! It's almost a chicken and egg situation. \n\nThe guide on self-publishing seems like a good idea though, that kind of evergreen content takes a while to create - but if it's good can provide a constant source of leads.\n\nGood luck with it all! Will keep an eye on your progress.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely harder if you have to acquire users on both fronts, too! It&amp;#39;s almost a chicken and egg situation. &lt;/p&gt;\n\n&lt;p&gt;The guide on self-publishing seems like a good idea though, that kind of evergreen content takes a while to create - but if it&amp;#39;s good can provide a constant source of leads.&lt;/p&gt;\n\n&lt;p&gt;Good luck with it all! Will keep an eye on your progress.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5mgck", "score_hidden": false, "stickied": false, "created": 1492012753.0, "created_utc": 1491983953.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5m0gm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BookSproutChris", "parent_id": "t1_dg5ltr8", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "I run [booksproutapp.com](https://booksproutapp.com).\n\nSo far to acquire users I'm a bit all over the map and just in the beginning stages, trying to figure out where my time is most valuable. I felt it was smart to first build the product that I wanted (since I make my living as an author). After that's done, then I'd spend all of my available time promoting rather than building.\n\nI'm on reddit and quora answering questions. I do a lot of cold emailing. I'm in the process of writing up a complete guide on self-publishing. I have over $500 in Amazon gift cards that I'm trying to figure out what to do with.\n\nSoon I'll be doing some press outreach and stuff like product hunt, but I need to make sure the latest IOS app gets approved first.\n\nSo far I have 800 users with the potential to pay (authors) and 3200 users in total. I think it's working, but only time will tell. I have to be honest and say that I thought it'd be easier to reach people!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I run &lt;a href=\"https://booksproutapp.com\"&gt;booksproutapp.com&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;So far to acquire users I&amp;#39;m a bit all over the map and just in the beginning stages, trying to figure out where my time is most valuable. I felt it was smart to first build the product that I wanted (since I make my living as an author). After that&amp;#39;s done, then I&amp;#39;d spend all of my available time promoting rather than building.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m on reddit and quora answering questions. I do a lot of cold emailing. I&amp;#39;m in the process of writing up a complete guide on self-publishing. I have over $500 in Amazon gift cards that I&amp;#39;m trying to figure out what to do with.&lt;/p&gt;\n\n&lt;p&gt;Soon I&amp;#39;ll be doing some press outreach and stuff like product hunt, but I need to make sure the latest IOS app gets approved first.&lt;/p&gt;\n\n&lt;p&gt;So far I have 800 users with the potential to pay (authors) and 3200 users in total. I think it&amp;#39;s working, but only time will tell. I have to be honest and say that I thought it&amp;#39;d be easier to reach people!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5m0gm", "score_hidden": false, "stickied": false, "created": 1492011472.0, "created_utc": 1491982672.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ltr8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "02thoeva", "parent_id": "t1_dg5gnqe", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "What's your business, out of interest? What are you doing to acquire users?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s your business, out of interest? What are you doing to acquire users?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5ltr8", "score_hidden": false, "stickied": false, "created": 1492010944.0, "created_utc": 1491982144.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gnqe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BookSproutChris", "parent_id": "t3_64rt2e", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Really enjoyed the write-up again. It's good to follow since I'm usually a couple steps behind and I have the same mindset towards money, hiring, and bootstrapping. Right now I'm at the point where I need to start convincing more of my sign-ups to start using the paid features. There's a lot still needing to be done in that area though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really enjoyed the write-up again. It&amp;#39;s good to follow since I&amp;#39;m usually a couple steps behind and I have the same mindset towards money, hiring, and bootstrapping. Right now I&amp;#39;m at the point where I need to start convincing more of my sign-ups to start using the paid features. There&amp;#39;s a lot still needing to be done in that area though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5gnqe", "score_hidden": false, "stickied": false, "created": 1491999676.0, "created_utc": 1491970876.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": "", "user_reports": [], "id": "dg5lok4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "02thoeva", "parent_id": "t1_dg4s855", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "We offer an API to interact with platform which can add contacts and lists. You can't send a campaign through it though, at this stage.\n\nSpeaking of API's, we launched on Zapier officially the other day which was a great little growth boost for us. If you're a SaaS business I'd recommend doing this, not only for your existing customers conveniences, but for the benefits in growing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We offer an API to interact with platform which can add contacts and lists. You can&amp;#39;t send a campaign through it though, at this stage.&lt;/p&gt;\n\n&lt;p&gt;Speaking of API&amp;#39;s, we launched on Zapier officially the other day which was a great little growth boost for us. If you&amp;#39;re a SaaS business I&amp;#39;d recommend doing this, not only for your existing customers conveniences, but for the benefits in growing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5lok4", "score_hidden": false, "stickied": false, "created": 1492010541.0, "created_utc": 1491981741.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4s855", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SupremeHumanBeing", "parent_id": "t3_64rt2e", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "That's amazing. Happy for you guys. \n\nDo you make your platform available via an API? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s amazing. Happy for you guys. &lt;/p&gt;\n\n&lt;p&gt;Do you make your platform available via an API? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg4s855", "score_hidden": false, "stickied": false, "created": 1491967936.0, "created_utc": 1491939136.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": "", "user_reports": [], "id": "dg5lt5b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "02thoeva", "parent_id": "t1_dg59pvp", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Jonathan, wrote almost all the initial code for it. He's reached out to old friends who he had worked with over the past 6/7 years to help code-review or provide little bits of freelance. Now we have 2 regular freelance developers, again who J worked with previously, who write much of our more recent code.\n\nAs for in 5 years, I think we're keen to get to a point where we can scale the email business to a stage where it runs itself and we can take a look at other areas of marketing which we can build another product in - though potentially an acquisition would be of interest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jonathan, wrote almost all the initial code for it. He&amp;#39;s reached out to old friends who he had worked with over the past 6/7 years to help code-review or provide little bits of freelance. Now we have 2 regular freelance developers, again who J worked with previously, who write much of our more recent code.&lt;/p&gt;\n\n&lt;p&gt;As for in 5 years, I think we&amp;#39;re keen to get to a point where we can scale the email business to a stage where it runs itself and we can take a look at other areas of marketing which we can build another product in - though potentially an acquisition would be of interest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5lt5b", "score_hidden": false, "stickied": false, "created": 1492010896.0, "created_utc": 1491982096.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg59pvp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PregnantMale", "parent_id": "t3_64rt2e", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Terrific write up. I have a few questions:\n\nWho wrote all the code for this?  \n\nWhere do you see this company in 5 years?  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Terrific write up. I have a few questions:&lt;/p&gt;\n\n&lt;p&gt;Who wrote all the code for this?  &lt;/p&gt;\n\n&lt;p&gt;Where do you see this company in 5 years?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg59pvp", "score_hidden": false, "stickied": false, "created": 1491989605.0, "created_utc": 1491960805.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": "", "user_reports": [], "id": "dg5vldi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stedaniels", "parent_id": "t1_dg5qguw", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Solid response :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Solid response :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5vldi", "score_hidden": false, "stickied": false, "created": 1492033650.0, "created_utc": 1492004850.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qguw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "02thoeva", "parent_id": "t1_dg5oqe5", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Interesting. We've certainly not intentionally directly copied anybody. It does go without saying that there are some companies in the industry such as Mailchimp, Campaign Monitor and Sendy who do things incredibly well and we've been inspired by each of their user interfaces. \n\nWe have just found a new freelance designer, so we'll be refreshing much of the site in the coming months. One of the shortcuts we have taken is by doing a lot of the front-end work ourselves, which is likely why our design is simple, but by no means groundbreaking.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting. We&amp;#39;ve certainly not intentionally directly copied anybody. It does go without saying that there are some companies in the industry such as Mailchimp, Campaign Monitor and Sendy who do things incredibly well and we&amp;#39;ve been inspired by each of their user interfaces. &lt;/p&gt;\n\n&lt;p&gt;We have just found a new freelance designer, so we&amp;#39;ll be refreshing much of the site in the coming months. One of the shortcuts we have taken is by doing a lot of the front-end work ourselves, which is likely why our design is simple, but by no means groundbreaking.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5qguw", "score_hidden": false, "stickied": false, "created": 1492024771.0, "created_utc": 1491995971.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5oqe5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stedaniels", "parent_id": "t3_64rt2e", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Your website is *very* similar to Sendy, who copied whom?\nIt's a genuine question, was on both websites yesterday, even scrolled to the footer to see if it was the same company behind the two services.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your website is &lt;em&gt;very&lt;/em&gt; similar to Sendy, who copied whom?\nIt&amp;#39;s a genuine question, was on both websites yesterday, even scrolled to the footer to see if it was the same company behind the two services.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg5oqe5", "score_hidden": false, "stickied": false, "created": 1492019885.0, "created_utc": 1491991085.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_64rt2e", "likes": null, "replies": "", "user_reports": [], "id": "dg6kph1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kevinstubbs", "parent_id": "t3_64rt2e", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "This was a good writeup, thanks!\n\nYou wrote\n&gt; Each month we choose a measurable metric which we are keen to move and focus at least 50% of our team efforts on that goal, Netflix style.\n\nWhere could I go and read about that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was a good writeup, thanks!&lt;/p&gt;\n\n&lt;p&gt;You wrote&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Each month we choose a measurable metric which we are keen to move and focus at least 50% of our team efforts on that goal, Netflix style.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Where could I go and read about that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dg6kph1", "score_hidden": false, "stickied": false, "created": 1492060495.0, "created_utc": 1492031695.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]