[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "startups", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a product guy. I&amp;#39;m a skilled engineer and designer. I feel like I&amp;#39;m stretched way too thin trying to build product and business at the same time and I want to have someone to build this company with me.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s nuts because I typically see the problem from the other end. Lots of idea folks / business folks needing to find their CTO and product folks. This must be naivety on my part, because apparently the problem exists on both sides.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re building a SaaS product, which should be super capital efficient. But without this person to build the business, finding this person (not building the product) has become a priority. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been passively looking for a year now on places like AngelList, F6S, CofoundersLab, etc. and no-one has panned out. There&amp;#39;s been a few very positive talks - but it&amp;#39;s really hard for someone to commit to a company this early. But I feel like we&amp;#39;re in the spot where we need this person to accelerate our growth.&lt;/p&gt;\n\n&lt;p&gt;What am I missing here? Where should I be pushing activity?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a product guy. I'm a skilled engineer and designer. I feel like I'm stretched way too thin trying to build product and business at the same time and I want to have someone to build this company with me.\n\nIt's nuts because I typically see the problem from the other end. Lots of idea folks / business folks needing to find their CTO and product folks. This must be naivety on my part, because apparently the problem exists on both sides.\n\nWe're building a SaaS product, which should be super capital efficient. But without this person to build the business, finding this person (not building the product) has become a priority. \n\nI've been passively looking for a year now on places like AngelList, F6S, CofoundersLab, etc. and no-one has panned out. There's been a few very positive talks - but it's really hard for someone to commit to a company this early. But I feel like we're in the spot where we need this person to accelerate our growth.\n\nWhat am I missing here? Where should I be pushing activity?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ygv4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "gregdizzia", "saved": false, "mod_reports": [], "name": "t3_65ygv4", "subreddit_name_prefixed": "r/startups", "approved_by": null, "over_18": false, "domain": "self.startups", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh26", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/startups/comments/65ygv4/how_do_i_find_a_ceotype/", "num_reports": null, "locked": false, "stickied": false, "created": 1492493026.0, "url": "https://www.reddit.com/r/startups/comments/65ygv4/how_do_i_find_a_ceotype/", "author_flair_text": null, "quarantine": false, "title": "How do I find a CEO-type?", "created_utc": 1492464226.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_65ygv4", "likes": null, "replies": "", "user_reports": [], "id": "dged287", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nate_rausch", "parent_id": "t3_65ygv4", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "A different way to think about it could be: what should I look for in a cofounder. And the best description of that I think is this by Paul Graham: relentlessly resourceful.\nhttp://www.paulgraham.com/relres.html\n\nThe skill you need in the beginning in addition to design &amp; development is, of course, sales. But don't get anyone with marketing/sales job, that's a bad signal. What you want is 1) high IQ 2) relentlessly resourceful (sometimes called hustler; essentially a person who gets anything done)\n\nWould start search in your network, on your linkedin you should have a relationship with your cofounder, it is so extremely hard to keep the relationship stable. See if you find someone who was a management consultant in a place like McKinsey or BCG, they have pretty good selection criteria for this sort of thing. And among those, go for the rule-breaker, like one who has some kind of startup-like-thing in their past. Or could be someone who already has been in a startup or worked in a startup, but went to a top tier University. \n\nPS. Have you already built something?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A different way to think about it could be: what should I look for in a cofounder. And the best description of that I think is this by Paul Graham: relentlessly resourceful.\n&lt;a href=\"http://www.paulgraham.com/relres.html\"&gt;http://www.paulgraham.com/relres.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The skill you need in the beginning in addition to design &amp;amp; development is, of course, sales. But don&amp;#39;t get anyone with marketing/sales job, that&amp;#39;s a bad signal. What you want is 1) high IQ 2) relentlessly resourceful (sometimes called hustler; essentially a person who gets anything done)&lt;/p&gt;\n\n&lt;p&gt;Would start search in your network, on your linkedin you should have a relationship with your cofounder, it is so extremely hard to keep the relationship stable. See if you find someone who was a management consultant in a place like McKinsey or BCG, they have pretty good selection criteria for this sort of thing. And among those, go for the rule-breaker, like one who has some kind of startup-like-thing in their past. Or could be someone who already has been in a startup or worked in a startup, but went to a top tier University. &lt;/p&gt;\n\n&lt;p&gt;PS. Have you already built something?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dged287", "score_hidden": false, "stickied": false, "created": 1492502913.0, "created_utc": 1492474113.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_65ygv4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_65ygv4", "likes": null, "replies": "", "user_reports": [], "id": "dgea5sk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gregdizzia", "parent_id": "t1_dge8wo4", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Thank you. What you're saying makes a lot of sense. From my perspective it would be hard to commit to a company at this stage, finding the ideal early-stage partner faces the same problems on both sides. I'll do some thinking on how I can bridge this gap currently, or resign to pursuing partnership at a later date.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. What you&amp;#39;re saying makes a lot of sense. From my perspective it would be hard to commit to a company at this stage, finding the ideal early-stage partner faces the same problems on both sides. I&amp;#39;ll do some thinking on how I can bridge this gap currently, or resign to pursuing partnership at a later date.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dgea5sk", "score_hidden": false, "stickied": false, "created": 1492499167.0, "created_utc": 1492470367.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8wo4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ssfreaky", "parent_id": "t3_65ygv4", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "CEO-type here, and i think it's always a 2-way street. You're definitely correct that CTO/dev are more sought after as good peeps are harder to come by, but that doesn't mean CEOs are a dime a dozen.\n\nAssume this, you are looking for a CEO to join your company, and you're asking them to help accelerate your company's growth. What in return are you offering that ensure there's growth to be had? Paying beta client(s)? Rock solid platform? Early signs of growth? \n&gt; We're building a SaaS product, which should be super capital efficient.\nyup, that's just what SaaS basically stands for... I'd be surprised to see one that isn't efficient.\n\n&gt; ...but it's really hard for someone to commit to a company this early.\nThink of it as a trade - you're essentially giving up something you have for something they have... product for time, time for experience, money for equity, etc. If they think its too early, it means the value of your product (or the value you conveyed) does not match their experience/value/time. \n\nIf you can, perhaps you can just push the product out and get traction - people will take bigger bets and join on successful/popular startups, even if they are early. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;CEO-type here, and i think it&amp;#39;s always a 2-way street. You&amp;#39;re definitely correct that CTO/dev are more sought after as good peeps are harder to come by, but that doesn&amp;#39;t mean CEOs are a dime a dozen.&lt;/p&gt;\n\n&lt;p&gt;Assume this, you are looking for a CEO to join your company, and you&amp;#39;re asking them to help accelerate your company&amp;#39;s growth. What in return are you offering that ensure there&amp;#39;s growth to be had? Paying beta client(s)? Rock solid platform? Early signs of growth? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We&amp;#39;re building a SaaS product, which should be super capital efficient.\nyup, that&amp;#39;s just what SaaS basically stands for... I&amp;#39;d be surprised to see one that isn&amp;#39;t efficient.&lt;/p&gt;\n\n&lt;p&gt;...but it&amp;#39;s really hard for someone to commit to a company this early.\nThink of it as a trade - you&amp;#39;re essentially giving up something you have for something they have... product for time, time for experience, money for equity, etc. If they think its too early, it means the value of your product (or the value you conveyed) does not match their experience/value/time. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you can, perhaps you can just push the product out and get traction - people will take bigger bets and join on successful/popular startups, even if they are early. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dge8wo4", "score_hidden": false, "stickied": false, "created": 1492497521.0, "created_utc": 1492468721.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_65ygv4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_65ygv4", "likes": null, "replies": "", "user_reports": [], "id": "dgeaji1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gregdizzia", "parent_id": "t1_dge6u4n", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Thank you for responding.\n\nI'm very open to discussing the idea and status of the company, but I -- frankly -- am a bit protective of how much I talk about on open forums (to my own disadvantage). It's hard to ask for help from strangers, but I'm completely comfortable going deep once an introduction has been made. Is this something that you think I should shed?\n\nI like the build it now then solve the problem later approach, so I'll do some thinking about how long I want to commit to this process. For now I'm thinking another day or two of mapping out what the end-goals look like.\n\nTo expose where we're at:\nWe've talked with potential customers and provided demos of what we have - Positive feedback, and verbal commitments to pilot for a bunch of seats. Sales guy is working on converting those verbals to letters or pre-committed $s. I completely understand that we need to convert these over to a stronger commitment.\n\nI'm chugging through development, fueled by a ton of designs, research, feedback and documented processes. Our tech is not 100%, we have around 20% to go (I hate using percentages, but it's the easiest way to illustrate it).\n\nWe're in good shape to launch, but I feel hesitant to push forward without figuring out the process of finding a CEO - Your advice addressed that.\n\nI think we have enough to convince someone if we can get some warm conversations / intros started. I'll need explore where those conversations go to figure out where we stand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for responding.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m very open to discussing the idea and status of the company, but I -- frankly -- am a bit protective of how much I talk about on open forums (to my own disadvantage). It&amp;#39;s hard to ask for help from strangers, but I&amp;#39;m completely comfortable going deep once an introduction has been made. Is this something that you think I should shed?&lt;/p&gt;\n\n&lt;p&gt;I like the build it now then solve the problem later approach, so I&amp;#39;ll do some thinking about how long I want to commit to this process. For now I&amp;#39;m thinking another day or two of mapping out what the end-goals look like.&lt;/p&gt;\n\n&lt;p&gt;To expose where we&amp;#39;re at:\nWe&amp;#39;ve talked with potential customers and provided demos of what we have - Positive feedback, and verbal commitments to pilot for a bunch of seats. Sales guy is working on converting those verbals to letters or pre-committed $s. I completely understand that we need to convert these over to a stronger commitment.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m chugging through development, fueled by a ton of designs, research, feedback and documented processes. Our tech is not 100%, we have around 20% to go (I hate using percentages, but it&amp;#39;s the easiest way to illustrate it).&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re in good shape to launch, but I feel hesitant to push forward without figuring out the process of finding a CEO - Your advice addressed that.&lt;/p&gt;\n\n&lt;p&gt;I think we have enough to convince someone if we can get some warm conversations / intros started. I&amp;#39;ll need explore where those conversations go to figure out where we stand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dgeaji1", "score_hidden": false, "stickied": false, "created": 1492499666.0, "created_utc": 1492470866.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge6u4n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bloqchains", "parent_id": "t3_65ygv4", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Little bit hard to answer without some idea of what you're working on but:\n\nI am a CEO-type (with decent technical skills, which I only say because it helped me in my search for a \"CTO\") but my plate is full, so no direct assistance from me, but definitely willing to offer a few thoughts. How open are you in discussing your idea on these sites and with other people? Sometimes being over protective of your idea makes it difficult for someone like me to understand the value prop, market size, competition, etc. I would need to grasp in order to see it as a viable venture or not.\n\nI obviously care deeply about your technical ability, so I would also recommend building and launching your product, no matter how terrible it is right now, and promoting it, with a \"hey! we're looking for cofounders!\" page to draw in some additional folks and passing it around as much as possible. The more I can \"see\" the more I can start to believe.\n\nIf you can share your progress thus far it would be helpful in drafting a plan that a CEO-type would need to understand your idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Little bit hard to answer without some idea of what you&amp;#39;re working on but:&lt;/p&gt;\n\n&lt;p&gt;I am a CEO-type (with decent technical skills, which I only say because it helped me in my search for a &amp;quot;CTO&amp;quot;) but my plate is full, so no direct assistance from me, but definitely willing to offer a few thoughts. How open are you in discussing your idea on these sites and with other people? Sometimes being over protective of your idea makes it difficult for someone like me to understand the value prop, market size, competition, etc. I would need to grasp in order to see it as a viable venture or not.&lt;/p&gt;\n\n&lt;p&gt;I obviously care deeply about your technical ability, so I would also recommend building and launching your product, no matter how terrible it is right now, and promoting it, with a &amp;quot;hey! we&amp;#39;re looking for cofounders!&amp;quot; page to draw in some additional folks and passing it around as much as possible. The more I can &amp;quot;see&amp;quot; the more I can start to believe.&lt;/p&gt;\n\n&lt;p&gt;If you can share your progress thus far it would be helpful in drafting a plan that a CEO-type would need to understand your idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dge6u4n", "score_hidden": false, "stickied": false, "created": 1492494889.0, "created_utc": 1492466089.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh26", "removal_reason": null, "link_id": "t3_65ygv4", "likes": null, "replies": "", "user_reports": [], "id": "dgektj5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "the_brizzler", "parent_id": "t3_65ygv4", "subreddit_name_prefixed": "r/startups", "controversiality": 0, "body": "Software engineer here (with some business background)...I have been in a similar boat. People think finding a software engineer to build their vision is hard...but I think finding a qualified CEO (who has built a business around a tech product before) is much harder to come by. Most people who pitch me ideas have never built a tech business.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Software engineer here (with some business background)...I have been in a similar boat. People think finding a software engineer to build their vision is hard...but I think finding a qualified CEO (who has built a business around a tech product before) is much harder to come by. Most people who pitch me ideas have never built a tech business.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "startups", "name": "t1_dgektj5", "score_hidden": false, "stickied": false, "created": 1492512409.0, "created_utc": 1492483609.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]