[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "newzealand", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;How the Day Unfolded&lt;/strong&gt;    &lt;/p&gt;\n\n&lt;p&gt;Deputy Speaker Chester Borrows (National – Whanganui) took the chair as Speaker David Carter (National – List) was absent. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Questions for Oral Answer&lt;/strong&gt;   &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.parliament.nz/en/pb/hansard-debates/rhr/combined/HansDeb_20170412_20170412_08\"&gt;12 Questions to Ministers were answered&lt;/a&gt;     &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.parliament.nz/en/pb/hansard-debates/rhr/combined/HansDeb_20170412_20170412_12\"&gt;10 Questions to Members were answered&lt;/a&gt; -  All of these questions were from New Zealand First MPs to other NZF Mps who had bills before the house.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Urgent Debate Application Denied&lt;/strong&gt;   &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Megan Woods (Labour-Wigram) sought an urgent debate under Standing Order 389 on the allegations of conflicts of interest within the now dissolved Canterbury Earthquake Recovery Authority.*   &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I have received a letter from Dr Megan Woods seeking to debate under Standing Order 389 the report and referral to the Serious Fraud Office following a State Services Commission - initiated inquiry by Michael Heron QC into allegations of conflicts of interest and the Canterbury Earthquake Recovery Authority, and I have received supplementary information in respect of this application. This is a particular case of recent occurrence involving ministerial responsibility. As the member notes in her application, any application of impropriety relating to the conduct of public sector employees is a serious one. In light of the fundings of the report, the State Services Commission has referred the matter to the Serious Fraud Office to consider whether any of the activity is of a potentially criminal nature that requires further investigation. The matter is now with the Serious Fraud Office for investigation. The House is not prevented from debating matters that are under investigation, but it is not likely to assist the administration of justice to do so. While this matter may receive further attention from the House in the future, I do not consider it appropriate to set aside the business of the House today to debate a matter that has just become the subject of a criminal investigation and the application is therefore declined.&lt;/p&gt;\n&lt;/blockquote&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;The General Debate Was Held&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;The general debate is held every week on Wednesday after Question Time. The formal procedure for the debate is that a member moves a motion that the house takes note of miscellaneous business. Members have 5 minutes to speak to whatever issue they wish. At the end of the hour the motion lapses and no question is put or vote taken.    &lt;/p&gt;\n\n&lt;p&gt;The speakers were:  &lt;/p&gt;\n\n&lt;table&gt;&lt;thead&gt;\n&lt;tr&gt;\n&lt;th align=\"center\"&gt;Call&lt;/th&gt;\n&lt;th align=\"center\"&gt;Member&lt;/th&gt;\n&lt;th align=\"center\"&gt;Party&lt;/th&gt;\n&lt;th align=\"center\"&gt;Seat&lt;/th&gt;\n&lt;th align=\"center\"&gt;Topic&lt;/th&gt;\n&lt;/tr&gt;\n&lt;/thead&gt;&lt;tbody&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;1.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=pejzYpAWm4M\"&gt;Nathan Guy&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;National&lt;/td&gt;\n&lt;td align=\"center\"&gt;Otaki&lt;/td&gt;\n&lt;td align=\"center\"&gt;Andrew Little, Edgecumbe and Farming and the Environment&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;2.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=ePP3ji2KsVg\"&gt;Jacinda Ardern&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;Labour&lt;/td&gt;\n&lt;td align=\"center\"&gt;Mount Albert&lt;/td&gt;\n&lt;td align=\"center\"&gt;Financial Insecurity and Maori Development&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;3.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=XzOg_5V-tdo\"&gt;Todd McClay&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;National&lt;/td&gt;\n&lt;td align=\"center\"&gt;Rotorua&lt;/td&gt;\n&lt;td align=\"center\"&gt;Trade&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;4.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=0ktbHDqrenc\"&gt;Ron Mark&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;New Zealand First&lt;/td&gt;\n&lt;td align=\"center\"&gt;List&lt;/td&gt;\n&lt;td align=\"center\"&gt;Police Numbers and announcements&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;5.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=xKy3bb3WnYo\"&gt;Hekia Parata&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;National&lt;/td&gt;\n&lt;td align=\"center\"&gt;List&lt;/td&gt;\n&lt;td align=\"center\"&gt;Reflecting on eight years of government and education policy&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;6.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=4yxbTMxT7Bs\"&gt;James Shaw&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;Green&lt;/td&gt;\n&lt;td align=\"center\"&gt;List&lt;/td&gt;\n&lt;td align=\"center\"&gt;Recent weather events and climate change&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;7.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=KyHRAYko_dY\"&gt;Melissa Lee&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;National&lt;/td&gt;\n&lt;td align=\"center\"&gt;List&lt;/td&gt;\n&lt;td align=\"center\"&gt;Eight years of National Government&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;8.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=12qDswAAjAM\"&gt;Megan Woods&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;Labour&lt;/td&gt;\n&lt;td align=\"center\"&gt;Wigram&lt;/td&gt;\n&lt;td align=\"center\"&gt;CERA Conflicts of Interest and Transparency in Government&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;9.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=660Ep2QTxwA\"&gt;Tim Macindoe&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;National&lt;/td&gt;\n&lt;td align=\"center\"&gt;Hamilton West&lt;/td&gt;\n&lt;td align=\"center\"&gt;WW1 Centenary, John Key &amp;amp; David Cunliffe speeches and Trade&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;10.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=IuVefSemffs\"&gt;Marama Fox&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;Maori&lt;/td&gt;\n&lt;td align=\"center\"&gt;List&lt;/td&gt;\n&lt;td align=\"center\"&gt;myth-busting 4 minutes with Marama Fox.&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;11.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=PmwDeC6sQc8\"&gt;Fletcher Tabuteau&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;New Zealand First&lt;/td&gt;\n&lt;td align=\"center\"&gt;List&lt;/td&gt;\n&lt;td align=\"center\"&gt;Electricity Sector in New Zealand&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"center\"&gt;12.&lt;/td&gt;\n&lt;td align=\"center\"&gt;&lt;a href=\"https://www.youtube.com/watch?v=cifVmxYfypk\"&gt;Kelvin Davis&lt;/a&gt;&lt;/td&gt;\n&lt;td align=\"center\"&gt;Labour&lt;/td&gt;\n&lt;td align=\"center\"&gt;Te Tai Tokerau&lt;/td&gt;\n&lt;td align=\"center\"&gt;Electricity and Waitangi Tribunal finding on Corrections&lt;/td&gt;\n&lt;/tr&gt;\n&lt;/tbody&gt;&lt;/table&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.parliament.nz/en/pb/hansard-debates/rhr/combined/HansDeb_20170412_20170412_20\"&gt;Transcript can be found here&lt;/a&gt;  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Member’s Bills&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;New Zealand First List MP Clayton Mitchell’s &lt;a href=\"https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/00DBHOH_BILL72061_1/broadcasting-games-of-national-significance-amendment\"&gt; Broadcasting (Games of National Significance) Amendment Bill&lt;/a&gt; failed 26 to 95.  The purpose of the bill was to define in law games and sporting events that are to be broadcast live on free-to-air television.   &lt;/p&gt;\n\n&lt;p&gt;The Greens were the only other party to vote in favour of the bill.   &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The &lt;a href=\"https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/00DBHOH_BILL72058_1/land-transport-vehicle-user-safety-amendment-bill\"&gt;Land Transport (Vehicle User Safety) Amendment Bill\n&lt;/a&gt;  was read a first time on a 93-28 vote and referred to the Transport and Industrial Relations Committee. This bill puts in place an enforcement regime against people soliciting money in exchange for washing car windows. Botany MP Jamie Lee Ross (National) is in charge of the bill.   &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Steffan Browning’s (Green-List) &lt;a href=\"https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/00DBHOH_BILL72059_1/consumers-right-to-know-country-of-origin-of-food-bill\"&gt;Consumers’ Right to Know (Country of Origin of Food) Bill\n&lt;/a&gt; sailed through first reading 120 - 1 .    &lt;/p&gt;\n\n&lt;p&gt;The purpose of this bill is to enshrine in law consumers’ right to know the country from which the food they are purchasing originated so that they can make informed purchasing decisions. The Act Party was the sole vote against the bill. The Primary Production Select Committee will now consider the bill.    &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The &lt;a href=\"https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_72525/education-teachers-code-of-ethics-amendment-bill\"&gt;Education (Teachers&amp;#39; Code of Ethics) Amendment Bill\n&lt;/a&gt; in the name of Port Hills Labour MP Ruth Dyson failed 58 – 63.     &lt;/p&gt;\n\n&lt;p&gt;This bill would have replaced the Code of Conduct referred to in section 387 of the Education Act 1989 with a new Code of Ethics, in order to reinstate the primacy of a code of ethics for the teaching profession.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Debate Interrupted&lt;/strong&gt;   &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;The debate on Paul Foster Bell’s (National – List) &lt;a href=\"https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_72527/arbitration-amendment-bill\"&gt;Arbitration Amendment Bill\n&lt;/a&gt; was interrupted when Paul Foster Bell was delivering his reply speech.   &lt;/p&gt;\n\n&lt;p&gt;The purpose of this bill is to amend the Arbitration Act 1996 to ensure arbitration clauses in trust deeds are given effect to extend the presumption of confidentiality in arbitration to a rebuttable presumption of confidentiality in related court proceedings under the Act, to clearly define the grounds for setting aside an arbitral award and bring New Zealand’s approach into line with foreign arbitration legislation, and to confirm the consequence of failing to raise a timely objection to an arbitral tribunal’s jurisdiction.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Biscuit Tin of Democracy&lt;/strong&gt;    &lt;/p&gt;\n\n&lt;p&gt;For a Members Bill to be introduced in Parliament it must go into a ballot. The ballot is a biscuit tin kept in the Clerk’s office and as bills are debated, a ballot is conducted withdrawing the next bill to be introduced onto the order paper.     &lt;/p&gt;\n\n&lt;p&gt;The winners were:  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_73908/friendly-societies-and-credit-unions-regulatory-improvements\"&gt;Friendly Societies and Credit Unions (Regulatory Improvements) Amendment Bill &lt;/a&gt; in the name of Kaikoura National MP Stuart Smith.  &lt;/p&gt;\n\n&lt;p&gt;The bill amends the Friendly Societies and Credit Unions Act 1982, and is intended to remove unnecessary operating and compliance costs, promote greater efficiency, innovation, and accountability, bring credit unions into alignment with other financial service providers in New Zealand, and maintain the element of mutuality and the requirement of a common bond between members.  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.scoop.co.nz/stories/PA1704/S00188/seymour-welcomes-credit-union-reforms.htm\"&gt;In a small press release from ACT they indicated they are supporting the bill&lt;/a&gt; - “I’m delighted this bill has been drawn. It brings the Act into the 21st century, allowing the co-operative banking sector to compete with other financial institutions without one hand tied behind its back. ACT looks forward to supporting this bill.”  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_73909/electoral-registration-by-special-vote-amendment-bill\"&gt;Electoral (Registration by Special Vote) Amendment Bill\n&lt;/a&gt; in the name of Meka Whaitiri (Labour - Ikaroa-Rāwhiti).  &lt;/p&gt;\n\n&lt;p&gt;This bill amends the Electoral Act 1993 to allow unregistered voters to register by completing a special vote and so ensure that their votes are counted.   &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_73910/international-transparent-treaties-bill\"&gt;International Transparent Treaties Bill\n&lt;/a&gt;  proposed by New Zealand First MP Fletcher Tabuteau.  &lt;/p&gt;\n\n&lt;p&gt;This bill proposes that all international treaties shall be approved by Parliament prior to the treaty being signed.  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.scoop.co.nz/stories/PA1704/S00185/more-transparency-on-trade-deals.htm\"&gt;Press release from New Zealand First&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_73911/marriage-court-consent-to-marriage-of-minors-amendment\"&gt;Marriage (Court Consent to Marriage of Minors) Amendment Bill&lt;/a&gt; from National list MP Jo Hayes.  &lt;/p&gt;\n\n&lt;p&gt;This bill proposes that 16 and 17 year olds who wish to marry must apply to the court, and sets out how the court is to consider the application.   &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Psephology Spotlight&lt;/strong&gt;   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Elections Concluded&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Aleksandar Vučić was elected president of Serbia in the first round of voting with 55% of the vote. This vote was marred by significant levels of voter intimidation, fraud and domination of the media by Vucic’s Serbian Progressive Party. Large protests lead by students and the unions have garnered international attention but it remains to be seen whether the government will yield.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In Armenia the new proportional voting system delivered a majority to the ruling Republican Party. On a turnout of 60% the RPA managed 49.17% of of the vote and 58 seats out of 105. The Organization for Security and Co Operation in Europe criticised the election by saying it had been tainted by vote-buying, and pressure on civil servants and employees of private companies.Transparency International, along with various other organizations confirmed cases of bribe distribution.  &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Upcoming Elections&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;South Korea goes to the polls on May 9. This election was called early after the impeachment of Park Geun-hye. Prime Minister Hwang Kyo-ahn succeeded Park as acting president and decided not to run for his own term in office.  &lt;/p&gt;\n\n&lt;p&gt;Each party had its own internal procedure for selecting their candidate. The Democratic party had an open primary that saw more than two million people participate. The Liberty Korea Party (which was Park’s former party and rebranded after the scandal) candidate was determined by a combination of opinion polls, conducted between March 30th to March 31st (50%), and the votes cast by the delegates at the party convention held in March 31st (50%). The Bareun Party candidate was determined by a combination of votes from an evaluation commission based on 4 debates, held in different region of the country (40%), votes from the party members (30%), and public opinion polls (30%).   &lt;/p&gt;\n\n&lt;p&gt;Voting is via First Past the Post in a single round of voting. Currently the Centre Left leaning Democratic Party, also known as the Minjoo Party, is leading with a margin of around 5% in polling. Moon Jae-in , who came second in the 2012 Presidential Election, seems favoured to win.  &lt;/p&gt;\n\n&lt;p&gt;Policy wise he is in favor of repealing Korea&amp;#39;s national security laws, which has been accused by the Korean liberals as a tool of historically right-wing establishment of South Korea to restrict and oppress left-wing voices in Korean politics. He also promised to abolish the domestic wing of NIS (National Intelligence Service) in order to maintain their political neutrality, transferring domestic affairs to the police force. Moon also promised transparency on his presidency, moving the president residence from palatial and isolated Blue House to Gwanghwamun in downtown Seoul.   &lt;/p&gt;\n\n&lt;p&gt;Moon’s main competition is Ahn Cheol-soo from the centrist People’s Party. Ahn has stated that he considers Franklin D. Roosevelt to be a role model, and has referred to himself as the Bernie Sanders of Korea. He supports an increased capital gains tax, higher public welfare spending, and a cautious approach to free trade agreements.Ahn has also made appeals to conservatives, however, and has associated the People&amp;#39;s Party with &amp;quot;reformative&amp;quot; currents of Korean conservatism.In September 2012, Ahn visited the graves of Syngman Rhee, Park Chung-hee, and Kim Dae-jung. Park Chung-hee and Syngman Rhee are often praised by Korean conservatives, and Kim Dae-jung by liberals. Ahn stated at the time that it would be &amp;quot;hypocritical to paint half the people as enemies and at the same time call for &amp;#39;unity&amp;#39;&amp;quot;.  &lt;/p&gt;\n\n&lt;p&gt;The Liberty Korea Party has dropped from 45% in polls this time last year to 8% since the scandal.   &lt;/p&gt;\n\n&lt;p&gt;The president must be a South Korean citizen, at least 40 years old and has lived in South Korea for 5 years. Constitutionally the president serves for a five year term and is prohibited from seeking re election.   &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In Turkey the campaign on the controversial constitutional amendments to grant the President more power concludes with a vote on April 16.  In total there are 18 amendments being voted on including a vote to raise the number of seats in Parliament, changing the parliamentary term to five years, having presidential and parliamentary elections at the same time every five years, making the president head of state and government and granting the president the power to make states.  &lt;/p&gt;\n\n&lt;p&gt;Elections in Turkey are known for fraud and corruption and with significant power at stake it is not surprising that both sides have been actively flouting election law. The police have been criticised for suppressing no voting protests and rallies aswell as arresting campaigners on charges such as ‘insulting the president’ or ‘inciting hatred’.&lt;br/&gt;\nCurrent polling is leaning towards the no vote but it remains close.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;On the 23rd of April France holds the first round of its presidential election. 11 candidates from across the political spectrum are standing. The President of the French Republic is elected to a five-year term in a two-round election under Article 7 of the Constitution: if no candidate secures an absolute majority (i.e. including blank and void ballots) of votes in the first round, a second round is held two weeks later between the two candidates who received the most votes.  &lt;/p&gt;\n\n&lt;p&gt;Currently no candidate is polling higher than 28% making a run off inevitable. The two contenders favoured to enter the runoff are known eurosceptic and National Front candidate Marine Le Pen and En Marche! Candidate Emmanuel Macron.  In a straight two party contest it is thought Macron could win by a margin as great as 20%. However, Le Pen is banking on the shy voter effect and points to Brexit and Trump as reasons why the polls shouldn’t be believed. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Fact of the Day – Ada Wells&lt;/strong&gt;      &lt;/p&gt;\n\n&lt;p&gt;Ada Wells worked tirelessly to achieve equality and economic independence for women. She is best remembered for her contribution to the women’s suffrage campaign in the 1880s and ’90s, and for becoming the first woman elected to the Christchurch City Council in 1917.  &lt;/p&gt;\n\n&lt;p&gt;Ada Wells (née Pike) was born in England in April 1863 and came to New Zealand with her parents at the age of 10. She was educated at Avonside School from 1874 and Christchurch West School from 1876. Between 1877 and 1881 she was employed at the latter school as a student teacher. In 1881 she won a university junior scholarship and attended Canterbury College, passing the first part of her BA in 1882. She was then briefly employed as an assistant teacher at Christchurch Girls’ High School.  &lt;/p&gt;\n\n&lt;p&gt;In January 1884 she married Harry Wells, an organist, with whom she would have four children. Her husband’s ‘volatile temper and continual drinking’ often saw her forced to financially support the family by taking on teaching positions and private patients for massage and healing. This marital experience has been credited with strengthening her views on the importance of equality and economic independence for women.  &lt;/p&gt;\n\n&lt;p&gt;Wells became active in the women’s suffrage campaign in the 1880s, a period during which ‘the movement was generally condemned and ridiculed’. While Kate Sheppard led the campaign, Wells made an invaluable contribution as a ‘fervent, efficient organiser and campaigner’. In 1892 she was involved in the foundation of the Canterbury Women’s Institute (CWI). The CWI spearheaded the suffrage campaign in Canterbury, in a similar manner to the Women’s Franchise Leagues formed in other parts of the country.  &lt;/p&gt;\n\n&lt;p&gt;After women were granted the vote on 19 September 1893, Wells did not retire from public life. The CWI had always been ‘forward looking’, advocating a broader platform of women’s rights beyond suffrage. Wells continued to serve the organisation as president, secretary or committee member until its demise in 1921. She was also involved in the foundation of the NCW on 13 April 1896, and was appointed as its first secretary.  &lt;/p&gt;\n\n&lt;p&gt;In 1899 she won public office, becoming one of the first two women to be elected to the Ashburton and North Canterbury United Charitable Aid Board. She bettered this in 1917 when she was the first woman elected to the Christchurch City Council. By the time of her death in March 1933, Wells was acknowledged as one of New Zealand’s foremost public women.  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Previous Facts of the Day:&lt;br/&gt;\n  &lt;a href=\"https://www.reddit.com/r/newzealand/comments/3osc7e/restoration_of_democracy_to_university_councils/\"&gt;Speaker&amp;#39;s flat&lt;/a&gt;,  &lt;a href=\"https://www.reddit.com/r/newzealand/comments/3sgtry/supermarket_code_of_conduct_protection_of_new/\"&gt;Urgency&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/3v7irx/prohibition_of_imports_made_by_slave_labour/\"&gt;Jernigham Wakefield&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/48osky/mr_speaker_i_move_the_first_members_day_update_of/\"&gt;Sidney Holland and the Suicide Squad&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/4an80j/members_day_update_second_reading/\"&gt;1951 the last majority election&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/4dojs8/abolition_of_charter_schools_drawn_from_the/\"&gt;The Business Committee&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/4hxfiq/retirement_village_residents_rates_rebates_drawn/\"&gt;New Zealand&amp;#39;s First Parliament in Auckland&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/4l2mwy/andrew_littles_our_work_our_future_bill_drawn/\"&gt;1947 Greymouth beer boycott&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/4n4xja/members_day_update_the_veto_looms/\"&gt;So goes Hamilton so goes the nation&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/4qf4d2/members_day_update_vetoed/\"&gt;Australia and Compulsory Voting&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/4x59s6/foreign_ownership_of_land_register_safe_and/\"&gt;Housing the Prime Minister&lt;/a&gt;,   &lt;a href=\"https://www.reddit.com/r/newzealand/comments/4zfon6/companies_amendment_bill_drawn_from_ballot/\"&gt;Mabel Howard – New Zealand’s First Female Cabinet Minsiter&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/53w98x/private_international_law_choice_of_law_in_tort/\"&gt;Early Elections in New Zealand&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/58gaa4/members_day_update_19_october/\"&gt;New Zealand’s First State House&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/5c4gqo/changing_media_interim_restriction_order/\"&gt;New Zealand&amp;#39;s Day with LBJ&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/5fszrf/domestic_violence_victims_protection_affordable/\"&gt;The Great Strike of 1913&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/5h3bca/allowing_higher_earners_to_contract_out_of/\"&gt;What Happens When The Prime Minister Resigns&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/5ybejj/teachers_code_of_ethics_arbitration_amendment_and/\"&gt;Premier Julius Vogel and the Railways&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/newzealand/comments/60zj06/ombudsman_cost_recovery_equal_pay_through/\"&gt;New Zealand in Samoa&lt;/a&gt;   &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Standing Order of the Day – 244 Special Reports&lt;/strong&gt;     &lt;/p&gt;\n\n&lt;p&gt;A select committee may from time to time make a special report to the House seeking authority from the House to do something, or seeking guidance from the House on some procedural question which has occurred in the committee, or informing the House of some other matter connected with its proceedings which it considers should be reported to the House.   &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;To see today&amp;#39;s order paper &lt;a href=\"https://www.parliament.nz/resource/en-NZ/OrderPaper_20170413/effd059ee5d1aa9eec97daaf2d01a4729ae28ef2\"&gt;click here&lt;/a&gt;    &lt;/p&gt;\n\n&lt;p&gt;To see business  currently before Select Committee &lt;a href=\"https://www.parliament.nz/en/pb/sc/business-before-committees/\"&gt;Click Here&lt;/a&gt;   &lt;/p&gt;\n\n&lt;p&gt;To see past Members Day Updates &lt;a href=\"https://www.reddit.com/r/newzealand/search?q=members+day+author%3Akiwikibbles&amp;amp;sort=new&amp;amp;restrict_sr=on\"&gt;Click Here&lt;/a&gt;  &lt;/p&gt;\n\n&lt;p&gt;Enrolling or updating your voter registration is easy - go online at &lt;a href=\"http://www.elections.org.nz/\"&gt;elections.org.nz&lt;/a&gt;, freetext your name and address to 3676, call 0800 36 76 56 or go to any PostShop. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**How the Day Unfolded**    \n  \nDeputy Speaker Chester Borrows (National – Whanganui) took the chair as Speaker David Carter (National – List) was absent. \n  \n**Questions for Oral Answer**   \n  \n* [12 Questions to Ministers were answered]( https://www.parliament.nz/en/pb/hansard-debates/rhr/combined/HansDeb_20170412_20170412_08)     \n  \n* [10 Questions to Members were answered]( https://www.parliament.nz/en/pb/hansard-debates/rhr/combined/HansDeb_20170412_20170412_12) -  All of these questions were from New Zealand First MPs to other NZF Mps who had bills before the house.\n   \n**Urgent Debate Application Denied**   \n   \n* Megan Woods (Labour-Wigram) sought an urgent debate under Standing Order 389 on the allegations of conflicts of interest within the now dissolved Canterbury Earthquake Recovery Authority.*   \n  \n  &gt;I have received a letter from Dr Megan Woods seeking to debate under Standing Order 389 the report and referral to the Serious Fraud Office following a State Services Commission - initiated inquiry by Michael Heron QC into allegations of conflicts of interest and the Canterbury Earthquake Recovery Authority, and I have received supplementary information in respect of this application. This is a particular case of recent occurrence involving ministerial responsibility. As the member notes in her application, any application of impropriety relating to the conduct of public sector employees is a serious one. In light of the fundings of the report, the State Services Commission has referred the matter to the Serious Fraud Office to consider whether any of the activity is of a potentially criminal nature that requires further investigation. The matter is now with the Serious Fraud Office for investigation. The House is not prevented from debating matters that are under investigation, but it is not likely to assist the administration of justice to do so. While this matter may receive further attention from the House in the future, I do not consider it appropriate to set aside the business of the House today to debate a matter that has just become the subject of a criminal investigation and the application is therefore declined.\n   \n  \n**The General Debate Was Held**  \n  \n  The general debate is held every week on Wednesday after Question Time. The formal procedure for the debate is that a member moves a motion that the house takes note of miscellaneous business. Members have 5 minutes to speak to whatever issue they wish. At the end of the hour the motion lapses and no question is put or vote taken.    \n    \nThe speakers were:  \n  \n| Call   | Member | Party   | Seat     | Topic     |\n|:------------:|:------------:|:------------:|:------------:|:------------:|\n1.  |  [Nathan Guy]( https://www.youtube.com/watch?v=pejzYpAWm4M) | National| Otaki | Andrew Little, Edgecumbe and Farming and the Environment|  \n2.  | [Jacinda Ardern]( https://www.youtube.com/watch?v=ePP3ji2KsVg)  | Labour | Mount Albert | Financial Insecurity and Maori Development  |\n3. | [Todd McClay]( https://www.youtube.com/watch?v=XzOg_5V-tdo) | National | Rotorua | Trade |   \n4. | [Ron Mark]( https://www.youtube.com/watch?v=0ktbHDqrenc) | New Zealand First | List  |Police Numbers and announcements|\n5. | [Hekia Parata]( https://www.youtube.com/watch?v=xKy3bb3WnYo) | National | List | Reflecting on eight years of government and education policy|\n6. | [James Shaw]( https://www.youtube.com/watch?v=4yxbTMxT7Bs) | Green | List |Recent weather events and climate change |  \n7. | [Melissa Lee]( https://www.youtube.com/watch?v=KyHRAYko_dY) | National| List | Eight years of National Government|  \n8. | [Megan Woods]( https://www.youtube.com/watch?v=12qDswAAjAM) | Labour | Wigram | CERA Conflicts of Interest and Transparency in Government|  \n9. | [Tim Macindoe]( https://www.youtube.com/watch?v=660Ep2QTxwA) | National | Hamilton West | WW1 Centenary, John Key &amp; David Cunliffe speeches and Trade |   \n10. | [Marama Fox]( https://www.youtube.com/watch?v=IuVefSemffs) | Maori | List | myth-busting 4 minutes with Marama Fox.|  \n11. | [Fletcher Tabuteau]( https://www.youtube.com/watch?v=PmwDeC6sQc8) | New Zealand First| List |Electricity Sector in New Zealand |   \n12. | [Kelvin Davis]( https://www.youtube.com/watch?v=cifVmxYfypk)| Labour | Te Tai Tokerau |Electricity and Waitangi Tribunal finding on Corrections |      \n    \n[Transcript can be found here]( https://www.parliament.nz/en/pb/hansard-debates/rhr/combined/HansDeb_20170412_20170412_20)  \n  \n-------------\n**Member’s Bills**  \n   \n* New Zealand First List MP Clayton Mitchell’s [ Broadcasting (Games of National Significance) Amendment Bill](https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/00DBHOH_BILL72061_1/broadcasting-games-of-national-significance-amendment) failed 26 to 95.  The purpose of the bill was to define in law games and sporting events that are to be broadcast live on free-to-air television.   \n\n The Greens were the only other party to vote in favour of the bill.   \n   \n*   The [Land Transport (Vehicle User Safety) Amendment Bill\n]( https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/00DBHOH_BILL72058_1/land-transport-vehicle-user-safety-amendment-bill)  was read a first time on a 93-28 vote and referred to the Transport and Industrial Relations Committee. This bill puts in place an enforcement regime against people soliciting money in exchange for washing car windows. Botany MP Jamie Lee Ross (National) is in charge of the bill.   \n  \n\n*  Steffan Browning’s (Green-List) [Consumers’ Right to Know (Country of Origin of Food) Bill\n]( https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/00DBHOH_BILL72059_1/consumers-right-to-know-country-of-origin-of-food-bill) sailed through first reading 120 - 1 .    \n    \n   The purpose of this bill is to enshrine in law consumers’ right to know the country from which the food they are purchasing originated so that they can make informed purchasing decisions. The Act Party was the sole vote against the bill. The Primary Production Select Committee will now consider the bill.    \n  \n  \n*  The [Education (Teachers' Code of Ethics) Amendment Bill\n](https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_72525/education-teachers-code-of-ethics-amendment-bill) in the name of Port Hills Labour MP Ruth Dyson failed 58 – 63.     \n    \n  This bill would have replaced the Code of Conduct referred to in section 387 of the Education Act 1989 with a new Code of Ethics, in order to reinstate the primacy of a code of ethics for the teaching profession.\n    \n**Debate Interrupted**   \n  \n* The debate on Paul Foster Bell’s (National – List) [Arbitration Amendment Bill\n](https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_72527/arbitration-amendment-bill) was interrupted when Paul Foster Bell was delivering his reply speech.   \n  \n\n The purpose of this bill is to amend the Arbitration Act 1996 to ensure arbitration clauses in trust deeds are given effect to extend the presumption of confidentiality in arbitration to a rebuttable presumption of confidentiality in related court proceedings under the Act, to clearly define the grounds for setting aside an arbitral award and bring New Zealand’s approach into line with foreign arbitration legislation, and to confirm the consequence of failing to raise a timely objection to an arbitral tribunal’s jurisdiction.\n  \n---------  \n  \n**Biscuit Tin of Democracy**    \n  \nFor a Members Bill to be introduced in Parliament it must go into a ballot. The ballot is a biscuit tin kept in the Clerk’s office and as bills are debated, a ballot is conducted withdrawing the next bill to be introduced onto the order paper.     \n     \nThe winners were:  \n  \n   \n* [Friendly Societies and Credit Unions (Regulatory Improvements) Amendment Bill ]( https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_73908/friendly-societies-and-credit-unions-regulatory-improvements) in the name of Kaikoura National MP Stuart Smith.  \n  \n  The bill amends the Friendly Societies and Credit Unions Act 1982, and is intended to remove unnecessary operating and compliance costs, promote greater efficiency, innovation, and accountability, bring credit unions into alignment with other financial service providers in New Zealand, and maintain the element of mutuality and the requirement of a common bond between members.  \n  \n  [In a small press release from ACT they indicated they are supporting the bill](http://www.scoop.co.nz/stories/PA1704/S00188/seymour-welcomes-credit-union-reforms.htm) - “I’m delighted this bill has been drawn. It brings the Act into the 21st century, allowing the co-operative banking sector to compete with other financial institutions without one hand tied behind its back. ACT looks forward to supporting this bill.”  \n    \n    \n  \n* [Electoral (Registration by Special Vote) Amendment Bill\n](https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_73909/electoral-registration-by-special-vote-amendment-bill) in the name of Meka Whaitiri (Labour - Ikaroa-Rāwhiti).  \n  \n  This bill amends the Electoral Act 1993 to allow unregistered voters to register by completing a special vote and so ensure that their votes are counted.   \n  \n* [International Transparent Treaties Bill\n](https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_73910/international-transparent-treaties-bill)  proposed by New Zealand First MP Fletcher Tabuteau.  \n  \n  This bill proposes that all international treaties shall be approved by Parliament prior to the treaty being signed.  \n  \n  [Press release from New Zealand First](http://www.scoop.co.nz/stories/PA1704/S00185/more-transparency-on-trade-deals.htm)\n  \n* [Marriage (Court Consent to Marriage of Minors) Amendment Bill]( https://www.parliament.nz/en/pb/bills-and-laws/bills-proposed-laws/document/BILL_73911/marriage-court-consent-to-marriage-of-minors-amendment) from National list MP Jo Hayes.  \n  \n  This bill proposes that 16 and 17 year olds who wish to marry must apply to the court, and sets out how the court is to consider the application.   \n \n\n   \n     \n---------\n  \n**Psephology Spotlight**   \n  \n**Elections Concluded**  \n  \n* Aleksandar Vučić was elected president of Serbia in the first round of voting with 55% of the vote. This vote was marred by significant levels of voter intimidation, fraud and domination of the media by Vucic’s Serbian Progressive Party. Large protests lead by students and the unions have garnered international attention but it remains to be seen whether the government will yield.\n  \n* In Armenia the new proportional voting system delivered a majority to the ruling Republican Party. On a turnout of 60% the RPA managed 49.17% of of the vote and 58 seats out of 105. The Organization for Security and Co Operation in Europe criticised the election by saying it had been tainted by vote-buying, and pressure on civil servants and employees of private companies.Transparency International, along with various other organizations confirmed cases of bribe distribution.  \n    \n**Upcoming Elections**  \n      \n*    South Korea goes to the polls on May 9. This election was called early after the impeachment of Park Geun-hye. Prime Minister Hwang Kyo-ahn succeeded Park as acting president and decided not to run for his own term in office.  \n   \n  Each party had its own internal procedure for selecting their candidate. The Democratic party had an open primary that saw more than two million people participate. The Liberty Korea Party (which was Park’s former party and rebranded after the scandal) candidate was determined by a combination of opinion polls, conducted between March 30th to March 31st (50%), and the votes cast by the delegates at the party convention held in March 31st (50%). The Bareun Party candidate was determined by a combination of votes from an evaluation commission based on 4 debates, held in different region of the country (40%), votes from the party members (30%), and public opinion polls (30%).   \n  \n  Voting is via First Past the Post in a single round of voting. Currently the Centre Left leaning Democratic Party, also known as the Minjoo Party, is leading with a margin of around 5% in polling. Moon Jae-in , who came second in the 2012 Presidential Election, seems favoured to win.  \n    \n  Policy wise he is in favor of repealing Korea's national security laws, which has been accused by the Korean liberals as a tool of historically right-wing establishment of South Korea to restrict and oppress left-wing voices in Korean politics. He also promised to abolish the domestic wing of NIS (National Intelligence Service) in order to maintain their political neutrality, transferring domestic affairs to the police force. Moon also promised transparency on his presidency, moving the president residence from palatial and isolated Blue House to Gwanghwamun in downtown Seoul.   \n  \n  Moon’s main competition is Ahn Cheol-soo from the centrist People’s Party. Ahn has stated that he considers Franklin D. Roosevelt to be a role model, and has referred to himself as the Bernie Sanders of Korea. He supports an increased capital gains tax, higher public welfare spending, and a cautious approach to free trade agreements.Ahn has also made appeals to conservatives, however, and has associated the People's Party with \"reformative\" currents of Korean conservatism.In September 2012, Ahn visited the graves of Syngman Rhee, Park Chung-hee, and Kim Dae-jung. Park Chung-hee and Syngman Rhee are often praised by Korean conservatives, and Kim Dae-jung by liberals. Ahn stated at the time that it would be \"hypocritical to paint half the people as enemies and at the same time call for 'unity'\".  \n  \n  The Liberty Korea Party has dropped from 45% in polls this time last year to 8% since the scandal.   \n   \n  The president must be a South Korean citizen, at least 40 years old and has lived in South Korea for 5 years. Constitutionally the president serves for a five year term and is prohibited from seeking re election.   \n  \n*   In Turkey the campaign on the controversial constitutional amendments to grant the President more power concludes with a vote on April 16.  In total there are 18 amendments being voted on including a vote to raise the number of seats in Parliament, changing the parliamentary term to five years, having presidential and parliamentary elections at the same time every five years, making the president head of state and government and granting the president the power to make states.  \n  \n  Elections in Turkey are known for fraud and corruption and with significant power at stake it is not surprising that both sides have been actively flouting election law. The police have been criticised for suppressing no voting protests and rallies aswell as arresting campaigners on charges such as ‘insulting the president’ or ‘inciting hatred’.  \n   Current polling is leaning towards the no vote but it remains close.  \n  \n  \n  \n  \n* On the 23rd of April France holds the first round of its presidential election. 11 candidates from across the political spectrum are standing. The President of the French Republic is elected to a five-year term in a two-round election under Article 7 of the Constitution: if no candidate secures an absolute majority (i.e. including blank and void ballots) of votes in the first round, a second round is held two weeks later between the two candidates who received the most votes.  \n  \n  Currently no candidate is polling higher than 28% making a run off inevitable. The two contenders favoured to enter the runoff are known eurosceptic and National Front candidate Marine Le Pen and En Marche! Candidate Emmanuel Macron.  In a straight two party contest it is thought Macron could win by a margin as great as 20%. However, Le Pen is banking on the shy voter effect and points to Brexit and Trump as reasons why the polls shouldn’t be believed. \n     \n\n    \n-------  \n  \n**Fact of the Day – Ada Wells**      \n     \nAda Wells worked tirelessly to achieve equality and economic independence for women. She is best remembered for her contribution to the women’s suffrage campaign in the 1880s and ’90s, and for becoming the first woman elected to the Christchurch City Council in 1917.  \n  \n  Ada Wells (née Pike) was born in England in April 1863 and came to New Zealand with her parents at the age of 10. She was educated at Avonside School from 1874 and Christchurch West School from 1876. Between 1877 and 1881 she was employed at the latter school as a student teacher. In 1881 she won a university junior scholarship and attended Canterbury College, passing the first part of her BA in 1882. She was then briefly employed as an assistant teacher at Christchurch Girls’ High School.  \n  \n  In January 1884 she married Harry Wells, an organist, with whom she would have four children. Her husband’s ‘volatile temper and continual drinking’ often saw her forced to financially support the family by taking on teaching positions and private patients for massage and healing. This marital experience has been credited with strengthening her views on the importance of equality and economic independence for women.  \n  \n  Wells became active in the women’s suffrage campaign in the 1880s, a period during which ‘the movement was generally condemned and ridiculed’. While Kate Sheppard led the campaign, Wells made an invaluable contribution as a ‘fervent, efficient organiser and campaigner’. In 1892 she was involved in the foundation of the Canterbury Women’s Institute (CWI). The CWI spearheaded the suffrage campaign in Canterbury, in a similar manner to the Women’s Franchise Leagues formed in other parts of the country.  \n  \n  After women were granted the vote on 19 September 1893, Wells did not retire from public life. The CWI had always been ‘forward looking’, advocating a broader platform of women’s rights beyond suffrage. Wells continued to serve the organisation as president, secretary or committee member until its demise in 1921. She was also involved in the foundation of the NCW on 13 April 1896, and was appointed as its first secretary.  \n  \n  In 1899 she won public office, becoming one of the first two women to be elected to the Ashburton and North Canterbury United Charitable Aid Board. She bettered this in 1917 when she was the first woman elected to the Christchurch City Council. By the time of her death in March 1933, Wells was acknowledged as one of New Zealand’s foremost public women.  \n  \n    \n----------    \n   \nPrevious Facts of the Day:   \n  [Speaker's flat](https://www.reddit.com/r/newzealand/comments/3osc7e/restoration_of_democracy_to_university_councils/),  [Urgency](https://www.reddit.com/r/newzealand/comments/3sgtry/supermarket_code_of_conduct_protection_of_new/), [Jernigham Wakefield](https://www.reddit.com/r/newzealand/comments/3v7irx/prohibition_of_imports_made_by_slave_labour/), [Sidney Holland and the Suicide Squad](https://www.reddit.com/r/newzealand/comments/48osky/mr_speaker_i_move_the_first_members_day_update_of/), [1951 the last majority election](https://www.reddit.com/r/newzealand/comments/4an80j/members_day_update_second_reading/), [The Business Committee](https://www.reddit.com/r/newzealand/comments/4dojs8/abolition_of_charter_schools_drawn_from_the/), [New Zealand's First Parliament in Auckland](https://www.reddit.com/r/newzealand/comments/4hxfiq/retirement_village_residents_rates_rebates_drawn/), [1947 Greymouth beer boycott](https://www.reddit.com/r/newzealand/comments/4l2mwy/andrew_littles_our_work_our_future_bill_drawn/), [So goes Hamilton so goes the nation](https://www.reddit.com/r/newzealand/comments/4n4xja/members_day_update_the_veto_looms/), [Australia and Compulsory Voting](https://www.reddit.com/r/newzealand/comments/4qf4d2/members_day_update_vetoed/), [Housing the Prime Minister]( https://www.reddit.com/r/newzealand/comments/4x59s6/foreign_ownership_of_land_register_safe_and/),   [Mabel Howard – New Zealand’s First Female Cabinet Minsiter]( https://www.reddit.com/r/newzealand/comments/4zfon6/companies_amendment_bill_drawn_from_ballot/), [Early Elections in New Zealand]( https://www.reddit.com/r/newzealand/comments/53w98x/private_international_law_choice_of_law_in_tort/), [New Zealand’s First State House]( https://www.reddit.com/r/newzealand/comments/58gaa4/members_day_update_19_october/), [New Zealand's Day with LBJ](https://www.reddit.com/r/newzealand/comments/5c4gqo/changing_media_interim_restriction_order/), [The Great Strike of 1913](https://www.reddit.com/r/newzealand/comments/5fszrf/domestic_violence_victims_protection_affordable/), [What Happens When The Prime Minister Resigns]( https://www.reddit.com/r/newzealand/comments/5h3bca/allowing_higher_earners_to_contract_out_of/), [Premier Julius Vogel and the Railways]( https://www.reddit.com/r/newzealand/comments/5ybejj/teachers_code_of_ethics_arbitration_amendment_and/), [New Zealand in Samoa]( https://www.reddit.com/r/newzealand/comments/60zj06/ombudsman_cost_recovery_equal_pay_through/)   \n     \n \n    \n-------------\n    \n**Standing Order of the Day – 244 Special Reports**     \n       \nA select committee may from time to time make a special report to the House seeking authority from the House to do something, or seeking guidance from the House on some procedural question which has occurred in the committee, or informing the House of some other matter connected with its proceedings which it considers should be reported to the House.   \n  \n  \n      \n  \n------  \n  \nTo see today's order paper [click here]( https://www.parliament.nz/resource/en-NZ/OrderPaper_20170413/effd059ee5d1aa9eec97daaf2d01a4729ae28ef2)    \n  \n  \nTo see business  currently before Select Committee [Click Here]( https://www.parliament.nz/en/pb/sc/business-before-committees/)   \n   \nTo see past Members Day Updates [Click Here]( https://www.reddit.com/r/newzealand/search?q=members+day+author%3Akiwikibbles&amp;sort=new&amp;restrict_sr=on)  \n  \nEnrolling or updating your voter registration is easy - go online at [elections.org.nz](http://www.elections.org.nz/), freetext your name and address to 3676, call 0800 36 76 56 or go to any PostShop. \n\n\n\n\n\n\n\n\n  \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Politics", "id": "653c7c", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 37, "report_reasons": null, "author": "KiwiKibbles", "saved": false, "mod_reports": [], "name": "t3_653c7c", "subreddit_name_prefixed": "r/newzealand", "approved_by": null, "over_18": false, "domain": "self.newzealand", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/2MNjt3xyQy0l9KlbbkJevqK7Fi6Et0jxQqNXfLuKwSo.jpg?s=bdbeba2237eb06ea7e06d505808a7f2c", "width": 920, "height": 518}, "resolutions": [{"url": "https://i.redditmedia.com/2MNjt3xyQy0l9KlbbkJevqK7Fi6Et0jxQqNXfLuKwSo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=b73754c01e2de2d9c9d89bd785e47c82", "width": 108, "height": 60}, {"url": "https://i.redditmedia.com/2MNjt3xyQy0l9KlbbkJevqK7Fi6Et0jxQqNXfLuKwSo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=7937c83e59eed78cb6e994472701084b", "width": 216, "height": 121}, {"url": "https://i.redditmedia.com/2MNjt3xyQy0l9KlbbkJevqK7Fi6Et0jxQqNXfLuKwSo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=e3c5afaa951462e4b87815a3fb6686c6", "width": 320, "height": 180}, {"url": "https://i.redditmedia.com/2MNjt3xyQy0l9KlbbkJevqK7Fi6Et0jxQqNXfLuKwSo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=007377607aa9bf53e134c7c4448b6e87", "width": 640, "height": 360}], "variants": {}, "id": "oWYy3s_pL_s6lHs-MhOO-xtvNYjNsnpzE7pJBjJETls"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2qhma", "edited": 1492058008.0, "link_flair_css_class": "politics", "author_flair_css_class": "national", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/newzealand/comments/653c7c/enrollment_by_special_vote_regulatory/", "num_reports": null, "locked": false, "stickied": false, "created": 1492086134.0, "url": "https://www.reddit.com/r/newzealand/comments/653c7c/enrollment_by_special_vote_regulatory/", "author_flair_text": "", "quarantine": false, "title": "Enrollment by special vote, Regulatory improvements to societies and credit unions, Court to consent to marriage of minors and Parliament to vote on treaties prior to being signed + Members Day Update", "created_utc": 1492057334.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 37}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhma", "removal_reason": null, "link_id": "t3_653c7c", "likes": null, "replies": "", "user_reports": [], "id": "dg76crn", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "antisock", "parent_id": "t3_653c7c", "subreddit_name_prefixed": "r/newzealand", "controversiality": 0, "body": "Informative as usual, thanks for the effort. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Informative as usual, thanks for the effort. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "newzealand", "name": "t1_dg76crn", "score_hidden": false, "stickied": false, "created": 1492088524.0, "created_utc": 1492059724.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhma", "removal_reason": null, "link_id": "t3_653c7c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhma", "removal_reason": null, "link_id": "t3_653c7c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhma", "removal_reason": null, "link_id": "t3_653c7c", "likes": null, "replies": "", "user_reports": [], "id": "dg7l8e4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PodocarpusT", "parent_id": "t1_dg7e2f7", "subreddit_name_prefixed": "r/newzealand", "controversiality": 0, "body": "*robot* *voice* - Consumers already have perfect information. This will increase compliance costs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;robot&lt;/em&gt; &lt;em&gt;voice&lt;/em&gt; - Consumers already have perfect information. This will increase compliance costs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "newzealand", "name": "t1_dg7l8e4", "score_hidden": false, "stickied": false, "created": 1492121355.0, "created_utc": 1492092555.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7e2f7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KiwiKibbles", "parent_id": "t1_dg7d4un", "subreddit_name_prefixed": "r/newzealand", "controversiality": 0, "body": "Seymour never took a call in the debate so his exact reason isn't on the official record. But I suspect it's the whole additional regulation that achieves little argument  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seymour never took a call in the debate so his exact reason isn&amp;#39;t on the official record. But I suspect it&amp;#39;s the whole additional regulation that achieves little argument  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "newzealand", "name": "t1_dg7e2f7", "score_hidden": false, "stickied": false, "created": 1492108927.0, "created_utc": 1492080127.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d4un", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Richard7666", "parent_id": "t3_653c7c", "subreddit_name_prefixed": "r/newzealand", "controversiality": 0, "body": "I wonder what Act's releasoning was for voting against the country of origin on food bill?\n\nHopefully not just \"cos regulation and socialism\" or something. Ugh.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder what Act&amp;#39;s releasoning was for voting against the country of origin on food bill?&lt;/p&gt;\n\n&lt;p&gt;Hopefully not just &amp;quot;cos regulation and socialism&amp;quot; or something. Ugh.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "newzealand", "name": "t1_dg7d4un", "score_hidden": false, "stickied": false, "created": 1492106188.0, "created_utc": 1492077388.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhma", "removal_reason": null, "link_id": "t3_653c7c", "likes": null, "replies": "", "user_reports": [], "id": "dg7d499", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MyPacman", "parent_id": "t3_653c7c", "subreddit_name_prefixed": "r/newzealand", "controversiality": 0, "body": "If ACT is for \" bring credit unions into alignment with other financial service providers in New Zealand, \"  then I worry what the actual amendments are.  \n\nThankyou /u/KiwiKibbles these are always an amazing summary that makes it so much easier and quicker to understand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If ACT is for &amp;quot; bring credit unions into alignment with other financial service providers in New Zealand, &amp;quot;  then I worry what the actual amendments are.  &lt;/p&gt;\n\n&lt;p&gt;Thankyou &lt;a href=\"/u/KiwiKibbles\"&gt;/u/KiwiKibbles&lt;/a&gt; these are always an amazing summary that makes it so much easier and quicker to understand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "newzealand", "name": "t1_dg7d499", "score_hidden": false, "stickied": false, "created": 1492106137.0, "created_utc": 1492077337.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]