[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry if this is all over the place, I&amp;#39;m pretty tired/upset. I tried to overdose about 6-7 years ago. It really should have worked out, I&amp;#39;m still unsure of how it went wrong. &lt;/p&gt;\n\n&lt;p&gt;Whatever, got some of my shit together. Things were going decently for a year or two. Then I got with a guy that ended up sexually assaulting me. I went down a really shitty spiral that lasted a few months. I talked to nobody, I really didn&amp;#39;t care to do anything. I was an asshole to most people. I still haven&amp;#39;t been able to have a functioning romantic relationship with anyone, and I haven&amp;#39;t even had sex since it happened. But I somehow drug myself out of it. I was finally getting to a good place with my relationship with my mom, had some friends. Things were looking up.&lt;/p&gt;\n\n&lt;p&gt;Then my mom got diagnosed with dementia. It was an awful 3 years of watching her decline. I lost friends, had no social life, put my school on hold, and just did whatever I could to help her and spend time with her. I feel robbed of any good time I could have had with her. She forgot who I was about a year into it. I&amp;#39;m really mad about the fact that I spent so much time being a shithead because I was so depressed. About 4 days after she died I had to put my dog to sleep and I am absolutely gutted. I&amp;#39;m so drained in every aspect. I work in a very people-oriented profession and put so much into it, and still get told that it isnt good enough. Just striking up small talk with people feels so draining. Everything else feels so trivial. My life was on hold for 3 years and I feel so behind and I also feel so selfish for feeling that way. &lt;/p&gt;\n\n&lt;p&gt;I have so many people that say that they care about me, and I genuinely believe that they do. I just feel like the person I portray is a facade, I don&amp;#39;t think that there is a single person in my life that actually knows me. I feel completely alone. I have such a hard time talking to people and genuinely connecting with them. I come off as kind of a bitch or an asshole, but I really just don&amp;#39;t know what to do. I feel like I can&amp;#39;t be fixed because the only place I even feel comfortable to say anything is anonymously in a post that nobody will probably ever read. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sorry if this is all over the place, I'm pretty tired/upset. I tried to overdose about 6-7 years ago. It really should have worked out, I'm still unsure of how it went wrong. \n\nWhatever, got some of my shit together. Things were going decently for a year or two. Then I got with a guy that ended up sexually assaulting me. I went down a really shitty spiral that lasted a few months. I talked to nobody, I really didn't care to do anything. I was an asshole to most people. I still haven't been able to have a functioning romantic relationship with anyone, and I haven't even had sex since it happened. But I somehow drug myself out of it. I was finally getting to a good place with my relationship with my mom, had some friends. Things were looking up.\n\nThen my mom got diagnosed with dementia. It was an awful 3 years of watching her decline. I lost friends, had no social life, put my school on hold, and just did whatever I could to help her and spend time with her. I feel robbed of any good time I could have had with her. She forgot who I was about a year into it. I'm really mad about the fact that I spent so much time being a shithead because I was so depressed. About 4 days after she died I had to put my dog to sleep and I am absolutely gutted. I'm so drained in every aspect. I work in a very people-oriented profession and put so much into it, and still get told that it isnt good enough. Just striking up small talk with people feels so draining. Everything else feels so trivial. My life was on hold for 3 years and I feel so behind and I also feel so selfish for feeling that way. \n\nI have so many people that say that they care about me, and I genuinely believe that they do. I just feel like the person I portray is a facade, I don't think that there is a single person in my life that actually knows me. I feel completely alone. I have such a hard time talking to people and genuinely connecting with them. I come off as kind of a bitch or an asshole, but I really just don't know what to do. I feel like I can't be fixed because the only place I even feel comfortable to say anything is anonymously in a post that nobody will probably ever read. ", "likes": null, "suggested_sort": "new", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64puaq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 97, "report_reasons": null, "author": "throwmeaway6401", "saved": false, "mod_reports": [], "name": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qqqf", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/depression/comments/64puaq/i_feel_like_im_stuck_in_an_endless_purgatory/", "num_reports": null, "locked": false, "stickied": false, "created": 1491932414.0, "url": "https://www.reddit.com/r/depression/comments/64puaq/i_feel_like_im_stuck_in_an_endless_purgatory/", "author_flair_text": null, "quarantine": false, "title": "I feel like I'm stuck in an endless purgatory", "created_utc": 1491903614.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 97}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg52h4a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "baddadyeahthatsme", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "We're all stuck in purgatory. Read a description of what purgatory is and the parallels are terrifying. Destined or sentenced to live your worst sins and failures over and over and over. We've been decieved somewhere and now we're here with almost no way out. Driving deeper and darker into eternity. Life is purgatory. Children a constant reminder of what life could have been. Slaves to an unatainable dream, destined to grind away trying to reach it until we start the day again. Breaks in the pain, torture, disappointment and failures are only there to serve as a fog, masking reality. It always clears and reveals this awful, hazardous, emotionally draining landscape that we all walk alone. Remaining until we reach our worst fear, death. Finally free of our prison through a final destination comprised of nothing at all. Oblivion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;re all stuck in purgatory. Read a description of what purgatory is and the parallels are terrifying. Destined or sentenced to live your worst sins and failures over and over and over. We&amp;#39;ve been decieved somewhere and now we&amp;#39;re here with almost no way out. Driving deeper and darker into eternity. Life is purgatory. Children a constant reminder of what life could have been. Slaves to an unatainable dream, destined to grind away trying to reach it until we start the day again. Breaks in the pain, torture, disappointment and failures are only there to serve as a fog, masking reality. It always clears and reveals this awful, hazardous, emotionally draining landscape that we all walk alone. Remaining until we reach our worst fear, death. Finally free of our prison through a final destination comprised of nothing at all. Oblivion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg52h4a", "score_hidden": false, "stickied": false, "created": 1491980008.0, "created_utc": 1491951208.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg4xqte", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NewpChew", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Yeah I don't think anyone truly knows me either. It's a facade at first, but they usually don't stick around for the real deal. My parents kind of know my erratic personality and moods, but know nothing about what I'm interested in, or personal shit like that ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I don&amp;#39;t think anyone truly knows me either. It&amp;#39;s a facade at first, but they usually don&amp;#39;t stick around for the real deal. My parents kind of know my erratic personality and moods, but know nothing about what I&amp;#39;m interested in, or personal shit like that &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg4xqte", "score_hidden": false, "stickied": false, "created": 1491974112.0, "created_utc": 1491945312.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg4oqjr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fourdimethylt", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "i love you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i love you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg4oqjr", "score_hidden": false, "stickied": false, "created": 1491964208.0, "created_utc": 1491935408.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg4lon7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Zach-uh-ri-uh", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Oh fucking shitballs. I'm so sorry. That's really rough. \n\nVisited a group/community re: sexual trauma? My friends and all all have some sort of trauma in the background and having friends who aren't trying to pretend it can't happen changed my life to the better.\n\nMy reading comprehension is shit atm so I'm sorry if you already mentioned this but have you tried snris, ndris, nris, and/or new generation antidepressants? \n\nThere's also a few that aren't antidepressants but can help with it anyway, like certain central stimulants, some antipsychotics (olanzapine- if you get this you can mention that diabetes medication has been shown to halt the weight that is common to gain on it) some doctors are also willing to work with medicine for bipolar.\n\nThen of course there is also marijuana, and most importantly, psychedelics taken carefully, at best together with a councilor or psychologist who is willing to work with you on that. \n\nThere is also ECT as a treatment. \n\nI guess what I'm saying is that it took me a really long time of thinking life was like this before finding medicine that worked for me. \n\n\nWithout it, I just wasn't ready to make any changes to my life and stick to them without losing momentum.\nIdk if this helps, I hope it does ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh fucking shitballs. I&amp;#39;m so sorry. That&amp;#39;s really rough. &lt;/p&gt;\n\n&lt;p&gt;Visited a group/community re: sexual trauma? My friends and all all have some sort of trauma in the background and having friends who aren&amp;#39;t trying to pretend it can&amp;#39;t happen changed my life to the better.&lt;/p&gt;\n\n&lt;p&gt;My reading comprehension is shit atm so I&amp;#39;m sorry if you already mentioned this but have you tried snris, ndris, nris, and/or new generation antidepressants? &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also a few that aren&amp;#39;t antidepressants but can help with it anyway, like certain central stimulants, some antipsychotics (olanzapine- if you get this you can mention that diabetes medication has been shown to halt the weight that is common to gain on it) some doctors are also willing to work with medicine for bipolar.&lt;/p&gt;\n\n&lt;p&gt;Then of course there is also marijuana, and most importantly, psychedelics taken carefully, at best together with a councilor or psychologist who is willing to work with you on that. &lt;/p&gt;\n\n&lt;p&gt;There is also ECT as a treatment. &lt;/p&gt;\n\n&lt;p&gt;I guess what I&amp;#39;m saying is that it took me a really long time of thinking life was like this before finding medicine that worked for me. &lt;/p&gt;\n\n&lt;p&gt;Without it, I just wasn&amp;#39;t ready to make any changes to my life and stick to them without losing momentum.\nIdk if this helps, I hope it does &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg4lon7", "score_hidden": false, "stickied": false, "created": 1491960851.0, "created_utc": 1491932051.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg4fp7d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "perasleeps", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "If you decide you need to act a certain way to get through your life right now, then do what you need. Chances are those who can relate will relate. Those who can't...at this point you need to put yourself first. I lost a family member to dementia and it was nothing short of excruciating for everyone. \n\nDo you have the option of professional counselling? Therapy can help you to manage the feelings so you don't spend too long overwhelmed. Then you may be able to cope a little better. I'm very sorry to hear about your situation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you decide you need to act a certain way to get through your life right now, then do what you need. Chances are those who can relate will relate. Those who can&amp;#39;t...at this point you need to put yourself first. I lost a family member to dementia and it was nothing short of excruciating for everyone. &lt;/p&gt;\n\n&lt;p&gt;Do you have the option of professional counselling? Therapy can help you to manage the feelings so you don&amp;#39;t spend too long overwhelmed. Then you may be able to cope a little better. I&amp;#39;m very sorry to hear about your situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg4fp7d", "score_hidden": false, "stickied": false, "created": 1491954309.0, "created_utc": 1491925509.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg4bc4v", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Invisibelle101", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "well shit..\n\nGirl what can I say.. You've had it rough and you're not alone that's for sure (whether you believe it our not)\n\nI post anonymous on here too for my safety, posting about my life experiences.. depression, about my suicidal attempts and about how my husband abuses me, just wanting someone to listen. \n\nSomehow there is always help out there.\n\nAnd yeah, I'm here if you ever need to inbox me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well shit..&lt;/p&gt;\n\n&lt;p&gt;Girl what can I say.. You&amp;#39;ve had it rough and you&amp;#39;re not alone that&amp;#39;s for sure (whether you believe it our not)&lt;/p&gt;\n\n&lt;p&gt;I post anonymous on here too for my safety, posting about my life experiences.. depression, about my suicidal attempts and about how my husband abuses me, just wanting someone to listen. &lt;/p&gt;\n\n&lt;p&gt;Somehow there is always help out there.&lt;/p&gt;\n\n&lt;p&gt;And yeah, I&amp;#39;m here if you ever need to inbox me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg4bc4v", "score_hidden": false, "stickied": false, "created": 1491949323.0, "created_utc": 1491920523.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg4b5zx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "snount", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I don't know what to do either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what to do either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg4b5zx", "score_hidden": false, "stickied": false, "created": 1491949113.0, "created_utc": 1491920313.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg5e8ed", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ciammarino", "parent_id": "t1_dg49yzm", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I agree. It's pretty crazy when you get in here and start reading the posts and about peoples' *feelings* which match yours.\n\nIt's validating. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree. It&amp;#39;s pretty crazy when you get in here and start reading the posts and about peoples&amp;#39; &lt;em&gt;feelings&lt;/em&gt; which match yours.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s validating. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg5e8ed", "score_hidden": false, "stickied": false, "created": 1491995812.0, "created_utc": 1491967012.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg4dtwk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PM_me_cyborgs", "parent_id": "t1_dg49yzm", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "People describe depression and suicidal idealization very often online and it is always identical to how I feel. \n\nWe are all just unfortunate human souls on this rock in space, floating through a useless existence we didn't ask to be brought into. I am not surprised that others feel the same as me. I think we are more similar than people realize.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People describe depression and suicidal idealization very often online and it is always identical to how I feel. &lt;/p&gt;\n\n&lt;p&gt;We are all just unfortunate human souls on this rock in space, floating through a useless existence we didn&amp;#39;t ask to be brought into. I am not surprised that others feel the same as me. I think we are more similar than people realize.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg4dtwk", "score_hidden": false, "stickied": false, "created": 1491952231.0, "created_utc": 1491923431.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg49yzm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "meaning_searcher", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Each post that I read in this sub makes me wonder how can someone describe exactly the way I feel. Somehow, it makes me feel home, or among people that understand each other.\n\nFriend, I feel myself becoming bitter and bitter as I continue to sabotage every connection people try to create with me. I have such a hard emotional shell... I shove away family, friends, colleagues... and recently I'm shoving away the mother of my son, who always takes care of me, but no matter what good she tries to do to me, if she can't fit into the perfect hero role, the one who will perfectly know how to handle my delicate emotional system, I shove her off too. One thing wrong and I snap at her...\n\nI feel an awful mix of being guilty and victim of circumstance (I just wanted someone to understande me, but nobody seems to be able to...).\n\nI feel like the stereotypical bitter old man, although I'm only 31.\n\n\nPlease, please, feel very comfortable venting out your stuff to me (or us). From here, isolated from actual human physical connection, I can easily say I would love to hug you and make that pain go away for a bit. (I know that personally it's harder to open up!)", "edited": 1491922245.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Each post that I read in this sub makes me wonder how can someone describe exactly the way I feel. Somehow, it makes me feel home, or among people that understand each other.&lt;/p&gt;\n\n&lt;p&gt;Friend, I feel myself becoming bitter and bitter as I continue to sabotage every connection people try to create with me. I have such a hard emotional shell... I shove away family, friends, colleagues... and recently I&amp;#39;m shoving away the mother of my son, who always takes care of me, but no matter what good she tries to do to me, if she can&amp;#39;t fit into the perfect hero role, the one who will perfectly know how to handle my delicate emotional system, I shove her off too. One thing wrong and I snap at her...&lt;/p&gt;\n\n&lt;p&gt;I feel an awful mix of being guilty and victim of circumstance (I just wanted someone to understande me, but nobody seems to be able to...).&lt;/p&gt;\n\n&lt;p&gt;I feel like the stereotypical bitter old man, although I&amp;#39;m only 31.&lt;/p&gt;\n\n&lt;p&gt;Please, please, feel very comfortable venting out your stuff to me (or us). From here, isolated from actual human physical connection, I can easily say I would love to hug you and make that pain go away for a bit. (I know that personally it&amp;#39;s harder to open up!)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg49yzm", "score_hidden": false, "stickied": false, "created": 1491947581.0, "created_utc": 1491918781.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg49t02", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thisiswhatittakes2", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I feel like that is the one of the hardest parts of depression... knowing you are depressed, feeling it every day and yet not knowing what to do about it.  You could have really great friends/family asking you what you need or what you want, what will help and they genuinely want to help and would go to the ends of the Earth to help you but you just don't know what to tell them, don't know what would make it better.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like that is the one of the hardest parts of depression... knowing you are depressed, feeling it every day and yet not knowing what to do about it.  You could have really great friends/family asking you what you need or what you want, what will help and they genuinely want to help and would go to the ends of the Earth to help you but you just don&amp;#39;t know what to tell them, don&amp;#39;t know what would make it better.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg49t02", "score_hidden": false, "stickied": false, "created": 1491947361.0, "created_utc": 1491918561.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg46ggs", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "InsomniaMelody", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "&gt; I come off as kind of a bitch or an asshole, but I really just don't know what to do.\n\nSome people are acting like that to other people, not for the sake of hurting others out of spite or malice, but because they can't cope with the hurt and pain they feel... can't bear it silently anymore.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I come off as kind of a bitch or an asshole, but I really just don&amp;#39;t know what to do.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Some people are acting like that to other people, not for the sake of hurting others out of spite or malice, but because they can&amp;#39;t cope with the hurt and pain they feel... can&amp;#39;t bear it silently anymore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg46ggs", "score_hidden": false, "stickied": false, "created": 1491942319.0, "created_utc": 1491913519.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg5g40e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "healybitch", "parent_id": "t1_dg52k1k", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Well I've always believed that nothing is permanent,  not even our troubles. Have I (offended) you in any way though? I apologize in case", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I&amp;#39;ve always believed that nothing is permanent,  not even our troubles. Have I (offended) you in any way though? I apologize in case&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg5g40e", "score_hidden": false, "stickied": false, "created": 1491998741.0, "created_utc": 1491969941.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52k1k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "baddadyeahthatsme", "parent_id": "t1_dg43s8e", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Where will get be at when we get through? Get through to where?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where will get be at when we get through? Get through to where?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg52k1k", "score_hidden": false, "stickied": false, "created": 1491980116.0, "created_utc": 1491951316.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43s8e", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "healybitch", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I'm with you. We will get through this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m with you. We will get through this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg43s8e", "score_hidden": false, "stickied": false, "created": 1491936504.0, "created_utc": 1491907704.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64puaq", "likes": null, "replies": "", "user_reports": [], "id": "dg43rp1", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Opsec82", "parent_id": "t3_64puaq", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I have read it...\n\nTo be honest i dont respond to this stuff because i dont feel right putting my 2c in, because in my head i know youll tell me that what im writing doesnt mean shit to you. \n\nYou are not alone.\n\nI feel like a joke telling you this but I am here if you need to talk, depending where you are the time delay may be a bit shitty but I will always respond. \n\nYou dont need to connect with me if you dont feel you can but id like to try and  at least help with the day to day.  \n\nPersonally i understand the facade i work in a glorified customer service position in IT you can only say \"have you turned it off and on again\" so many times before you are about to snap. \"But must be happy must be smiling customers must love you\" its a joke\n\nI dont expect you to write back but hope I can try and help if you want.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have read it...&lt;/p&gt;\n\n&lt;p&gt;To be honest i dont respond to this stuff because i dont feel right putting my 2c in, because in my head i know youll tell me that what im writing doesnt mean shit to you. &lt;/p&gt;\n\n&lt;p&gt;You are not alone.&lt;/p&gt;\n\n&lt;p&gt;I feel like a joke telling you this but I am here if you need to talk, depending where you are the time delay may be a bit shitty but I will always respond. &lt;/p&gt;\n\n&lt;p&gt;You dont need to connect with me if you dont feel you can but id like to try and  at least help with the day to day.  &lt;/p&gt;\n\n&lt;p&gt;Personally i understand the facade i work in a glorified customer service position in IT you can only say &amp;quot;have you turned it off and on again&amp;quot; so many times before you are about to snap. &amp;quot;But must be happy must be smiling customers must love you&amp;quot; its a joke&lt;/p&gt;\n\n&lt;p&gt;I dont expect you to write back but hope I can try and help if you want.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg43rp1", "score_hidden": false, "stickied": false, "created": 1491936465.0, "created_utc": 1491907665.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}]