[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I realise &lt;a href=\"/r/suicidewatch\"&gt;r/suicidewatch&lt;/a&gt; exists but I am more of a lurker/ex-contributor to &lt;a href=\"/r/depression\"&gt;r/depression&lt;/a&gt; and I have a lot more faith in this community.&lt;/p&gt;\n\n&lt;p&gt;So this just happened in the last week. There&amp;#39;s no point giving you a page long story of all the issues I have in my life. I can put it into basics;&lt;/p&gt;\n\n&lt;p&gt;I lost the life I used to have because I neglect my own needs. I don&amp;#39;t have a job, a home, or any supportive family. I don&amp;#39;t have a phone, or internet access. I don&amp;#39;t have any income. I can&amp;#39;t cook as I don&amp;#39;t have access to a kitchen. I can&amp;#39;t wash my clothes as I don&amp;#39;t have access to a washing machine. I&amp;#39;m currently at my local library typing this up and I am at a complete loss.&lt;/p&gt;\n\n&lt;p&gt;I have been to my local homeless charities, foodbanks etc but I am not in a position (mentally or physically) to continue living life in this way. I live around heroin addicts and people with serious mental issues in a council funded hostel. I believe that these people were probably in a very similar position to myself before they went down their own depraved routes. I&amp;#39;d rather not live than become an addict. I&amp;#39;ve already had enough problems smoking weed and that relatively mundane drug gave me enough issues. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m currently supporting myself by racking up debt using contactless payments. It&amp;#39;s the only way I can eat properly and live somewhat dissociated from my actual surroundings.&lt;/p&gt;\n\n&lt;p&gt;Last week I had a mental breakdown. Was considering jumping off of a bridge but instead I jumped on a bus and went to my local A&amp;amp;E. I waited for a few hours until two people from the mental health team came to the hospital to speak with me. They took a lot  of notes as I explained my situation and went away to discuss it. They came back and decided the best course was to send me home in a pre-paid taxi and wait for upcoming GP appointments.&lt;/p&gt;\n\n&lt;p&gt;They obviously didn&amp;#39;t think there was enough of a concearn. I might have downplayed my issues slightly because I was very conscious of being judged - sounds ridiculous I know but I was in a very bad headspace.&lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m not sure where to go from here. I can&amp;#39;t conceivably live in this way anymore. I&amp;#39;m male for what it&amp;#39;s worth, so I can&amp;#39;t really tell anyone without it being a huge burden to them.&lt;/p&gt;\n\n&lt;p&gt;Everyone expects me to support myself but I can&amp;#39;t bring myself out of this negative place. All of my bank accounts are overdrawn into the hundreds. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tried to get every type of loan to no avail. I have lost all motivation, all sense of self worth. &lt;/p&gt;\n\n&lt;p&gt;Please help.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I realise r/suicidewatch exists but I am more of a lurker/ex-contributor to r/depression and I have a lot more faith in this community.\n\nSo this just happened in the last week. There's no point giving you a page long story of all the issues I have in my life. I can put it into basics;\n\nI lost the life I used to have because I neglect my own needs. I don't have a job, a home, or any supportive family. I don't have a phone, or internet access. I don't have any income. I can't cook as I don't have access to a kitchen. I can't wash my clothes as I don't have access to a washing machine. I'm currently at my local library typing this up and I am at a complete loss.\n\nI have been to my local homeless charities, foodbanks etc but I am not in a position (mentally or physically) to continue living life in this way. I live around heroin addicts and people with serious mental issues in a council funded hostel. I believe that these people were probably in a very similar position to myself before they went down their own depraved routes. I'd rather not live than become an addict. I've already had enough problems smoking weed and that relatively mundane drug gave me enough issues. \n\nI'm currently supporting myself by racking up debt using contactless payments. It's the only way I can eat properly and live somewhat dissociated from my actual surroundings.\n\nLast week I had a mental breakdown. Was considering jumping off of a bridge but instead I jumped on a bus and went to my local A&amp;E. I waited for a few hours until two people from the mental health team came to the hospital to speak with me. They took a lot  of notes as I explained my situation and went away to discuss it. They came back and decided the best course was to send me home in a pre-paid taxi and wait for upcoming GP appointments.\n\nThey obviously didn't think there was enough of a concearn. I might have downplayed my issues slightly because I was very conscious of being judged - sounds ridiculous I know but I was in a very bad headspace.\n\nNow I'm not sure where to go from here. I can't conceivably live in this way anymore. I'm male for what it's worth, so I can't really tell anyone without it being a huge burden to them.\n\nEveryone expects me to support myself but I can't bring myself out of this negative place. All of my bank accounts are overdrawn into the hundreds. \n\nI've tried to get every type of loan to no avail. I have lost all motivation, all sense of self worth. \n\nPlease help.\n", "likes": null, "suggested_sort": "new", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64savf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 45, "report_reasons": null, "author": "lost4lyf", "saved": false, "mod_reports": [], "name": "t3_64savf", "subreddit_name_prefixed": "r/depression", "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qqqf", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/depression/comments/64savf/went_to_my_local_hospital_because_i_was_suicidal/", "num_reports": null, "locked": false, "stickied": false, "created": 1491960603.0, "url": "https://www.reddit.com/r/depression/comments/64savf/went_to_my_local_hospital_because_i_was_suicidal/", "author_flair_text": null, "quarantine": false, "title": "Went to my local hospital because I was suicidal - was sent home.", "created_utc": 1491931803.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 45}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64savf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64savf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64savf", "likes": null, "replies": "", "user_reports": [], "id": "dg6gzhy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "myweeawaythrow", "parent_id": "t1_dg62tyj", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "You are welcome.  \n\nI've never heard about Neville Goddard, but it seems people really think that the book your referencing helps them. At least that's the impression I get when I read a few reviews here and there. So that sound like a good book to read.  \n\nI also fear my impulsiveness. That suddenly I've just done it. It's very peculiar, this impulsiveness. At least to me suicide attempts (and perhaps even suicide) sounds like an act that requires will. For there to be a suicide attempt the person must will it. Though, to me, when I've been closest to doing it, the impulsiveness was not will, rather there was a feeling that there was a lack of will and that it was pure non-reflective behavior.  \nIf you feel the same, you might not, and perhaps even if you don't, I hope that your will will be just as strong as you are when you wrote the original post, when you go to the hospital, when you try to get appointments in order. Perhaps your book can also help with that, I can see there might be a chapter on free will.  \nThough, if you should find yourself in the situation, and the impulsiveness and horrible state of mind takes control, I would like to plea that you don't run in front of a car or jump in front of a train. At a minimum the emotional pain these random people driving the vehicle will feel will be tremendous. I know it seems unreasonable, it's impulsive, not a planned act, but I would just try to plea anyways.  \n\nAlso, I've done some quick research, and mind you, I don't know where you live in the UK nor do I have that much comprehension of how stuff works in the UK, but here's some links that might be of help:  \n\n\nShould you feel suicidal, then it seems like these people can help and perhaps there are some in your area, at least it seems like there are quite a few places. So perhaps write the nearest address down and keep it on you. That way it will be available to you in your times of need.  \nhttp://www.samaritans.org/branches  \nTake a look around the website, perhaps there are other stuff you can use.  \nIf it is not a possibility, try the hospital again.  \n\nIf you have the energy, the health and the opportunity, perhaps something like exercise can help? Not much, just a little bit, like a 20 minute walk or a small run, perhaps some pushups and crunches? At least this is a sub-reddit I might begin to look at:  \nhttps://www.reddit.com/r/EOOD/  \n(EOOD = Exercise Out Of Depression)  \n\nI've also found some web-pages that might (I really don't know any of the agencies or institutions in the UK) lead to help concerning your homelessness. Give them a look if you feel like it:  \nhttp://www.homeless.org.uk/search-homelessness-services  \nhttp://england.shelter.org.uk/get_advice/homelessness  \nhttp://www.crisis.org.uk/pages/get-help.html  \n\nAnd lastly, concerning your unemployment, I've just found a single web-page. You must judge if you can use it or not:  \nhttps://www.gov.uk/contact-jobcentre-plus/how-to-contact  \n\nHope things begins to turn the right way for you.  \n\nKind regards,  \nMyweeawaythrow\n", "edited": 1492038686.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are welcome.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never heard about Neville Goddard, but it seems people really think that the book your referencing helps them. At least that&amp;#39;s the impression I get when I read a few reviews here and there. So that sound like a good book to read.  &lt;/p&gt;\n\n&lt;p&gt;I also fear my impulsiveness. That suddenly I&amp;#39;ve just done it. It&amp;#39;s very peculiar, this impulsiveness. At least to me suicide attempts (and perhaps even suicide) sounds like an act that requires will. For there to be a suicide attempt the person must will it. Though, to me, when I&amp;#39;ve been closest to doing it, the impulsiveness was not will, rather there was a feeling that there was a lack of will and that it was pure non-reflective behavior.&lt;br/&gt;\nIf you feel the same, you might not, and perhaps even if you don&amp;#39;t, I hope that your will will be just as strong as you are when you wrote the original post, when you go to the hospital, when you try to get appointments in order. Perhaps your book can also help with that, I can see there might be a chapter on free will.&lt;br/&gt;\nThough, if you should find yourself in the situation, and the impulsiveness and horrible state of mind takes control, I would like to plea that you don&amp;#39;t run in front of a car or jump in front of a train. At a minimum the emotional pain these random people driving the vehicle will feel will be tremendous. I know it seems unreasonable, it&amp;#39;s impulsive, not a planned act, but I would just try to plea anyways.  &lt;/p&gt;\n\n&lt;p&gt;Also, I&amp;#39;ve done some quick research, and mind you, I don&amp;#39;t know where you live in the UK nor do I have that much comprehension of how stuff works in the UK, but here&amp;#39;s some links that might be of help:  &lt;/p&gt;\n\n&lt;p&gt;Should you feel suicidal, then it seems like these people can help and perhaps there are some in your area, at least it seems like there are quite a few places. So perhaps write the nearest address down and keep it on you. That way it will be available to you in your times of need.&lt;br/&gt;\n&lt;a href=\"http://www.samaritans.org/branches\"&gt;http://www.samaritans.org/branches&lt;/a&gt;&lt;br/&gt;\nTake a look around the website, perhaps there are other stuff you can use.&lt;br/&gt;\nIf it is not a possibility, try the hospital again.  &lt;/p&gt;\n\n&lt;p&gt;If you have the energy, the health and the opportunity, perhaps something like exercise can help? Not much, just a little bit, like a 20 minute walk or a small run, perhaps some pushups and crunches? At least this is a sub-reddit I might begin to look at:&lt;br/&gt;\n&lt;a href=\"https://www.reddit.com/r/EOOD/\"&gt;https://www.reddit.com/r/EOOD/&lt;/a&gt;&lt;br/&gt;\n(EOOD = Exercise Out Of Depression)  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also found some web-pages that might (I really don&amp;#39;t know any of the agencies or institutions in the UK) lead to help concerning your homelessness. Give them a look if you feel like it:&lt;br/&gt;\n&lt;a href=\"http://www.homeless.org.uk/search-homelessness-services\"&gt;http://www.homeless.org.uk/search-homelessness-services&lt;/a&gt;&lt;br/&gt;\n&lt;a href=\"http://england.shelter.org.uk/get_advice/homelessness\"&gt;http://england.shelter.org.uk/get_advice/homelessness&lt;/a&gt;&lt;br/&gt;\n&lt;a href=\"http://www.crisis.org.uk/pages/get-help.html\"&gt;http://www.crisis.org.uk/pages/get-help.html&lt;/a&gt;  &lt;/p&gt;\n\n&lt;p&gt;And lastly, concerning your unemployment, I&amp;#39;ve just found a single web-page. You must judge if you can use it or not:&lt;br/&gt;\n&lt;a href=\"https://www.gov.uk/contact-jobcentre-plus/how-to-contact\"&gt;https://www.gov.uk/contact-jobcentre-plus/how-to-contact&lt;/a&gt;  &lt;/p&gt;\n\n&lt;p&gt;Hope things begins to turn the right way for you.  &lt;/p&gt;\n\n&lt;p&gt;Kind regards,&lt;br/&gt;\nMyweeawaythrow&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg6gzhy", "score_hidden": false, "stickied": false, "created": 1492056521.0, "created_utc": 1492027721.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62tyj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lost4lyf", "parent_id": "t1_dg55x5d", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Thank you for taking the time to write to me (and possibly others in a similar situation). I'm in a better headspace just from seeing your response. I enjoy reading philosophical work. I am currently trying to wrap my head around \"the power of awareness\" by NevilleGoddard. Printed it off at my local library, and it's radically improving my sense of being. It does preach about God, but even if your a stout atheist, it presents some abstract philosophical ideas. \n\nYou're completely right - i don't want to die. Suicide presents itself as an escape route when I'm thinking irrationally. I get so hung up on the idea that it would be acceptable - but deep down i know it's not an option. It's my impulsiveness that I have to be aware of. I'm worried I'm going to get pissed drunk and run in front of a car. \n\nRegardless, thank you for being a good person to me.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for taking the time to write to me (and possibly others in a similar situation). I&amp;#39;m in a better headspace just from seeing your response. I enjoy reading philosophical work. I am currently trying to wrap my head around &amp;quot;the power of awareness&amp;quot; by NevilleGoddard. Printed it off at my local library, and it&amp;#39;s radically improving my sense of being. It does preach about God, but even if your a stout atheist, it presents some abstract philosophical ideas. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re completely right - i don&amp;#39;t want to die. Suicide presents itself as an escape route when I&amp;#39;m thinking irrationally. I get so hung up on the idea that it would be acceptable - but deep down i know it&amp;#39;s not an option. It&amp;#39;s my impulsiveness that I have to be aware of. I&amp;#39;m worried I&amp;#39;m going to get pissed drunk and run in front of a car. &lt;/p&gt;\n\n&lt;p&gt;Regardless, thank you for being a good person to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg62tyj", "score_hidden": false, "stickied": false, "created": 1492041987.0, "created_utc": 1492013187.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg55x5d", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "myweeawaythrow", "parent_id": "t3_64savf", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I'm not the best at advices nor do I have anything specific that I know will help to suggest, so I'm just going to toss something out, it might not have any relevance, but at the chance it have I'll write it anyways. Also, I’m not a native English speaker or writer, but I hope I can convey my thoughts anyway. \n\nFirst and foremost I had this weird idea, but since you have access to a library, is it possible for you to read books? Perhaps just a few pages a day or a couple of times pr. week? Perhaps read some Kierkegaard, Dostoevsky, Sartre or Camus? Or if that kind of stuff does not suit your taste then perhaps something else, like Lord of the Rings, Moby Dick etc.?  \n(I don't know if the library is free?).  \nIt was just a weird idea I had. Perhaps the world of existential literature or the world of fiction can do something for your view on life or your will to cling to life. Though, it could also worsen your situation. But we (or at least I) can't know that at the moment.  \n\nSecondly, we, as commentators, do not know where you live, how old you are, what your background is, but I don't know if you have any kind of place you could go to either for free counseling or for help to get a job? Where I live we have these places, perhaps you do too in your country?  \n\nThirdly, you have some bank accounts. I don't know if it is possible or relevant, but perhaps someone at the bank could help with a plan to get you unto your feet? It is in their interest to have you back on track since I could imagine if you die, they have lost a lot of money due to your debt (though IANAL or anything related to a bank). Yeah, I know, that connection is hollow and probably not genuine, but it's an opportunity. \n\nFourthly, where I live during their education priests also learn therapy. I've always thought that if I had no place to go, no one to talk to, I would try to contact a priest, just to see if that person would be able to help in any way. \n\nAnd lastly (and I know this probably sound so cliché from where you stand) I think you sound like kind of a strong person. Look at your position. You are still alive. You are still fighting, if you were not, you would not have typed out your post. I would even dare assume there is still some hope in you somewhere, at least that's the conclusion I've reached about my own situation: I'm still here, so I must have some kind of hope that it will get better. I might not feel it, I might not be able to see it, but it must be there.  \nAlso, something else, you write that you are not able to continue living the way you do. While that definitely have a high risk negative side, it also opens up for the positive side, that change to the better must happen. A kind of motivation of sorts, even though its origin is dire. Also remember, even though you probably know that, that suicide is not a way to live in another way that you do now, it is an end to life. To many people, at least what I've read, suicide and/or suicidal thoughts are not symptoms of a genuine death wish, but rather a drastic and final solution to a problematic situation. I don't know why I am typing this anymore, I might have lost the point, so I'm just gonna return to what I was going on about before.  \nYou realizing that you can't keep living this way can also be the opening for change that you need. Yeah I know, I'm sounding overly positive here, but at least we can accept the theoretical opportunity, yes?  \n\nIn regards to the health care personal: that was a bummer! There's not much else to say. It happened. It sucks. It hurts. I know the feeling of downplaying suicidal thoughts, but if you can, then at least when dealing with health professionals, try to be honest. Rather than avoiding a stupid and unprofessional person judging you, you might miss a clever and professional person who can help you. Is that not a risk worth taking? I would think it is.  \nAt least it sounds like you have another appointment? If that's true, that's a good thing! And then learn from your past experience and avoid downplaying your situation when you attend that appointment. \n\n\nAlso, as a final thing (yeah I wrote that a while back) try use the internet at the library to see if there are any hotlines (if you can borrow a phone somewhere?), chat services or email services in your country to help people struggling with suicide or to help people struggling in general. And if there is, and you decide to give it a try and call/write, and the people on the other end is just not helpful, please try again at another time until you get another person. And even if no one at that place can help, know that it is an issue with their tools and knowledge, and not with you. \n\n\nI hope you can make it through, that you find some self worth, some motivation, some vitality or what ever you need. It will take time. Maybe a long time.  \nSometimes I live for the beauty of the leaves, the smell of the grass and the longing for walking in the mountains. Perhaps you have simply pleasant experiences and dreams too?\n\nKind regards  \nMyweeawaythrow\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not the best at advices nor do I have anything specific that I know will help to suggest, so I&amp;#39;m just going to toss something out, it might not have any relevance, but at the chance it have I&amp;#39;ll write it anyways. Also, I’m not a native English speaker or writer, but I hope I can convey my thoughts anyway. &lt;/p&gt;\n\n&lt;p&gt;First and foremost I had this weird idea, but since you have access to a library, is it possible for you to read books? Perhaps just a few pages a day or a couple of times pr. week? Perhaps read some Kierkegaard, Dostoevsky, Sartre or Camus? Or if that kind of stuff does not suit your taste then perhaps something else, like Lord of the Rings, Moby Dick etc.?&lt;br/&gt;\n(I don&amp;#39;t know if the library is free?).&lt;br/&gt;\nIt was just a weird idea I had. Perhaps the world of existential literature or the world of fiction can do something for your view on life or your will to cling to life. Though, it could also worsen your situation. But we (or at least I) can&amp;#39;t know that at the moment.  &lt;/p&gt;\n\n&lt;p&gt;Secondly, we, as commentators, do not know where you live, how old you are, what your background is, but I don&amp;#39;t know if you have any kind of place you could go to either for free counseling or for help to get a job? Where I live we have these places, perhaps you do too in your country?  &lt;/p&gt;\n\n&lt;p&gt;Thirdly, you have some bank accounts. I don&amp;#39;t know if it is possible or relevant, but perhaps someone at the bank could help with a plan to get you unto your feet? It is in their interest to have you back on track since I could imagine if you die, they have lost a lot of money due to your debt (though IANAL or anything related to a bank). Yeah, I know, that connection is hollow and probably not genuine, but it&amp;#39;s an opportunity. &lt;/p&gt;\n\n&lt;p&gt;Fourthly, where I live during their education priests also learn therapy. I&amp;#39;ve always thought that if I had no place to go, no one to talk to, I would try to contact a priest, just to see if that person would be able to help in any way. &lt;/p&gt;\n\n&lt;p&gt;And lastly (and I know this probably sound so cliché from where you stand) I think you sound like kind of a strong person. Look at your position. You are still alive. You are still fighting, if you were not, you would not have typed out your post. I would even dare assume there is still some hope in you somewhere, at least that&amp;#39;s the conclusion I&amp;#39;ve reached about my own situation: I&amp;#39;m still here, so I must have some kind of hope that it will get better. I might not feel it, I might not be able to see it, but it must be there.&lt;br/&gt;\nAlso, something else, you write that you are not able to continue living the way you do. While that definitely have a high risk negative side, it also opens up for the positive side, that change to the better must happen. A kind of motivation of sorts, even though its origin is dire. Also remember, even though you probably know that, that suicide is not a way to live in another way that you do now, it is an end to life. To many people, at least what I&amp;#39;ve read, suicide and/or suicidal thoughts are not symptoms of a genuine death wish, but rather a drastic and final solution to a problematic situation. I don&amp;#39;t know why I am typing this anymore, I might have lost the point, so I&amp;#39;m just gonna return to what I was going on about before.&lt;br/&gt;\nYou realizing that you can&amp;#39;t keep living this way can also be the opening for change that you need. Yeah I know, I&amp;#39;m sounding overly positive here, but at least we can accept the theoretical opportunity, yes?  &lt;/p&gt;\n\n&lt;p&gt;In regards to the health care personal: that was a bummer! There&amp;#39;s not much else to say. It happened. It sucks. It hurts. I know the feeling of downplaying suicidal thoughts, but if you can, then at least when dealing with health professionals, try to be honest. Rather than avoiding a stupid and unprofessional person judging you, you might miss a clever and professional person who can help you. Is that not a risk worth taking? I would think it is.&lt;br/&gt;\nAt least it sounds like you have another appointment? If that&amp;#39;s true, that&amp;#39;s a good thing! And then learn from your past experience and avoid downplaying your situation when you attend that appointment. &lt;/p&gt;\n\n&lt;p&gt;Also, as a final thing (yeah I wrote that a while back) try use the internet at the library to see if there are any hotlines (if you can borrow a phone somewhere?), chat services or email services in your country to help people struggling with suicide or to help people struggling in general. And if there is, and you decide to give it a try and call/write, and the people on the other end is just not helpful, please try again at another time until you get another person. And even if no one at that place can help, know that it is an issue with their tools and knowledge, and not with you. &lt;/p&gt;\n\n&lt;p&gt;I hope you can make it through, that you find some self worth, some motivation, some vitality or what ever you need. It will take time. Maybe a long time.&lt;br/&gt;\nSometimes I live for the beauty of the leaves, the smell of the grass and the longing for walking in the mountains. Perhaps you have simply pleasant experiences and dreams too?&lt;/p&gt;\n\n&lt;p&gt;Kind regards&lt;br/&gt;\nMyweeawaythrow&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg55x5d", "score_hidden": false, "stickied": false, "created": 1491984650.0, "created_utc": 1491955850.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64savf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64savf", "likes": null, "replies": "", "user_reports": [], "id": "dg62uls", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lost4lyf", "parent_id": "t1_dg52pru", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Thank you very much", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you very much&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg62uls", "score_hidden": false, "stickied": false, "created": 1492042007.0, "created_utc": 1492013207.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52pru", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ragna12", "parent_id": "t3_64savf", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I don't know what to say or suggest but I hope things turn in your favor immediately. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what to say or suggest but I hope things turn in your favor immediately. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg52pru", "score_hidden": false, "stickied": false, "created": 1491980324.0, "created_utc": 1491951524.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64savf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64savf", "likes": null, "replies": "", "user_reports": [], "id": "dg62zrd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lost4lyf", "parent_id": "t1_dg4qmyn", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I've picked up occasional cleaning shifts, but it's quite embarrassing showing up in a shirt you washed in your sink with dettol/washing up liquid. Also I'm based in the UK. Had my benefits cancelled for neglecting my appointments. Currently trying to set it up again. Thank you very much for the advice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve picked up occasional cleaning shifts, but it&amp;#39;s quite embarrassing showing up in a shirt you washed in your sink with dettol/washing up liquid. Also I&amp;#39;m based in the UK. Had my benefits cancelled for neglecting my appointments. Currently trying to set it up again. Thank you very much for the advice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg62zrd", "score_hidden": false, "stickied": false, "created": 1492042161.0, "created_utc": 1492013361.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_64savf", "likes": null, "replies": "", "user_reports": [], "id": "dg5ozvf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "idontmeanmuchnomoar", "parent_id": "t1_dg4qmyn", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "OP's references to \"council funded hostel, \"A&amp;E,\" and \"GP appointment\" indicate to me that OP likely is located in the UK. I don't know anything about how the public assistance stuff works there (other than references to \"benefits\" in UK tv series) - so I would suspect that medicade, food stamps, and other USA public welfare programs are probably not available to the OP.\n\nDamn, I wish I had some good advice to give. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP&amp;#39;s references to &amp;quot;council funded hostel, &amp;quot;A&amp;amp;E,&amp;quot; and &amp;quot;GP appointment&amp;quot; indicate to me that OP likely is located in the UK. I don&amp;#39;t know anything about how the public assistance stuff works there (other than references to &amp;quot;benefits&amp;quot; in UK tv series) - so I would suspect that medicade, food stamps, and other USA public welfare programs are probably not available to the OP.&lt;/p&gt;\n\n&lt;p&gt;Damn, I wish I had some good advice to give. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg5ozvf", "score_hidden": false, "stickied": false, "created": 1492020697.0, "created_utc": 1491991897.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qmyn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "pussy_diet", "parent_id": "t3_64savf", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "are you able to get a job somewhere? /apply for Medicaid, foodstamps in the meantime?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;are you able to get a job somewhere? /apply for Medicaid, foodstamps in the meantime?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg4qmyn", "score_hidden": false, "stickied": false, "created": 1491966237.0, "created_utc": 1491937437.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]