[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I will make this short, I&amp;#39;m in mid twenties, I don&amp;#39;t want to climb career steps, office job is just to get money and I get enough of it to pay for what I need. I would like to do as little as possible when it comes to earning money if I make enough as it is.&lt;/p&gt;\n\n&lt;p&gt;Relationship wise, few unsuccessful relationships which left my heart broken couple of times. I cut my ties with friends since all the talk is seems meaningless to me, I&amp;#39;m not interested in how was your day, nor listening what happened to you. &lt;/p&gt;\n\n&lt;p&gt;Where I&amp;#39;m headed to? I&amp;#39;m fucking miserable, I just exist. My reddit name is from 4 years ago, and I feel the same as I felt then. Nothing changed... When not at work I fill the time with distractions movies/reddit/games. When the next day comes, I put a mask and head of to office. That&amp;#39;s my day to day life. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I will make this short, I'm in mid twenties, I don't want to climb career steps, office job is just to get money and I get enough of it to pay for what I need. I would like to do as little as possible when it comes to earning money if I make enough as it is.\n\nRelationship wise, few unsuccessful relationships which left my heart broken couple of times. I cut my ties with friends since all the talk is seems meaningless to me, I'm not interested in how was your day, nor listening what happened to you. \n\nWhere I'm headed to? I'm fucking miserable, I just exist. My reddit name is from 4 years ago, and I feel the same as I felt then. Nothing changed... When not at work I fill the time with distractions movies/reddit/games. When the next day comes, I put a mask and head of to office. That's my day to day life. ", "likes": null, "suggested_sort": "new", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657gki", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 32, "report_reasons": null, "author": "headingtoabyss", "saved": false, "mod_reports": [], "name": "t3_657gki", "subreddit_name_prefixed": "r/depression", "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qqqf", "edited": 1492109622.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/depression/comments/657gki/living_life_without_goals/", "num_reports": null, "locked": false, "stickied": false, "created": 1492138188.0, "url": "https://www.reddit.com/r/depression/comments/657gki/living_life_without_goals/", "author_flair_text": null, "quarantine": false, "title": "Living life without goals?", "created_utc": 1492109388.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_657gki", "likes": null, "replies": "", "user_reports": [], "id": "dga0k1s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "morimushroom", "parent_id": "t3_657gki", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I feel the same way.  No goals, no ambitions, no fucks given about my future.  I'm going to college now with a major that I used to love.  I think I'm decent at it but I just don't care enough about it to put in the effort.  I don't really care what job I have when (if) I graduate, I just want to get everything over with.  I've had people give me weird looks when I tell them I don't know what I want to do with my major.p", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel the same way.  No goals, no ambitions, no fucks given about my future.  I&amp;#39;m going to college now with a major that I used to love.  I think I&amp;#39;m decent at it but I just don&amp;#39;t care enough about it to put in the effort.  I don&amp;#39;t really care what job I have when (if) I graduate, I just want to get everything over with.  I&amp;#39;ve had people give me weird looks when I tell them I don&amp;#39;t know what I want to do with my major.p&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dga0k1s", "score_hidden": false, "stickied": false, "created": 1492245190.0, "created_utc": 1492216390.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_657gki", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_657gki", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_657gki", "likes": null, "replies": "", "user_reports": [], "id": "dga8nur", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bronzebeagle", "parent_id": "t1_dg9o3k5", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I don't think your feelings are existential, I think they are depressed.\n\nWhat you do between the time you're born and the time you die has a huge effect on the universe.\n\nWhen the brain is in a healthy state, people have goals. Everyone has different goals. But they have goals because they have things they care about.\n\nWhen you're depressed, the parts of your brain that motivate you aren't being used as much. Your brain gets stuck in a state of emergency where it tries to survive by shutting down unnecessary parts of the brain.\n\nWhen you're depressed you don't enjoy things nearly as much as you would with a healthy brain. You also don't care about your goals.\n\nA healthy person would be really upset if it was announced that an asteroid was ending all life on Earth next week. Because the end of the world would mean they would lose out on the opportunity to do lots of fun things they wanted to do. Depending on the person, the things they care about might be: spending years with family and friends, work regarding a career or a passion or a hobby, etc.\n\nA depressed person wouldn't mind too much if the world came to an end next week. Because they don't have lots of things they are excited about.\n\nImagine someone living their perfect, ideal life. So many things would be lighting up the happy part of their brain that they would never want to die or the world to end. But now imagine that same person got depressed. Suddenly the parts of the brain that control happiness and motivation aren't working. It no longer matters that they are surrounded by things they used to enjoy, they don't care about those things anymore.\n\nSo when you take a pill it can give your brain different chemicals and nutrients to better light up all areas of your brain.\n\nStart by seeing a therapist. They can work you through your issues so that you can get your brain out of a depressed, emergency state. And back to a normal state.\n\nHope this helps.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think your feelings are existential, I think they are depressed.&lt;/p&gt;\n\n&lt;p&gt;What you do between the time you&amp;#39;re born and the time you die has a huge effect on the universe.&lt;/p&gt;\n\n&lt;p&gt;When the brain is in a healthy state, people have goals. Everyone has different goals. But they have goals because they have things they care about.&lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re depressed, the parts of your brain that motivate you aren&amp;#39;t being used as much. Your brain gets stuck in a state of emergency where it tries to survive by shutting down unnecessary parts of the brain.&lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re depressed you don&amp;#39;t enjoy things nearly as much as you would with a healthy brain. You also don&amp;#39;t care about your goals.&lt;/p&gt;\n\n&lt;p&gt;A healthy person would be really upset if it was announced that an asteroid was ending all life on Earth next week. Because the end of the world would mean they would lose out on the opportunity to do lots of fun things they wanted to do. Depending on the person, the things they care about might be: spending years with family and friends, work regarding a career or a passion or a hobby, etc.&lt;/p&gt;\n\n&lt;p&gt;A depressed person wouldn&amp;#39;t mind too much if the world came to an end next week. Because they don&amp;#39;t have lots of things they are excited about.&lt;/p&gt;\n\n&lt;p&gt;Imagine someone living their perfect, ideal life. So many things would be lighting up the happy part of their brain that they would never want to die or the world to end. But now imagine that same person got depressed. Suddenly the parts of the brain that control happiness and motivation aren&amp;#39;t working. It no longer matters that they are surrounded by things they used to enjoy, they don&amp;#39;t care about those things anymore.&lt;/p&gt;\n\n&lt;p&gt;So when you take a pill it can give your brain different chemicals and nutrients to better light up all areas of your brain.&lt;/p&gt;\n\n&lt;p&gt;Start by seeing a therapist. They can work you through your issues so that you can get your brain out of a depressed, emergency state. And back to a normal state.&lt;/p&gt;\n\n&lt;p&gt;Hope this helps.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dga8nur", "score_hidden": false, "stickied": false, "created": 1492256821.0, "created_utc": 1492228021.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9o3k5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "headingtoabyss", "parent_id": "t1_dg8mtg2", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Never had any treatment, since I always thought that the feelings I'm coping with are existential in nature. How would a pill make me change my mind? Universe is vast, and whether I do something or not, it doesn't effect it in any way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Never had any treatment, since I always thought that the feelings I&amp;#39;m coping with are existential in nature. How would a pill make me change my mind? Universe is vast, and whether I do something or not, it doesn&amp;#39;t effect it in any way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg9o3k5", "score_hidden": false, "stickied": false, "created": 1492229093.0, "created_utc": 1492200293.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mtg2", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "bronzebeagle", "parent_id": "t3_657gki", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Hi, it sounds like you're extremely depressed.\n\nWhen you're depressed certain parts of your brain are less active. You have fewer goals. You have less willpower/motivation/drive. You have trouble making decisions. You feel like things don't matter. You feel miserable and you feel like you're existing rather than thriving.\n\nHaving goals related to an area of your life comes from really caring about that area of your life.\n\nBut when you're depressed, you don't care about anything.\n\nI know what it's like. I used to be very depressed.\n\nWhat are you doing to get your brain unstuck out of its depressed state? Are you seeing a therapist to work through your issues?\n\nHope this helps", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi, it sounds like you&amp;#39;re extremely depressed.&lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re depressed certain parts of your brain are less active. You have fewer goals. You have less willpower/motivation/drive. You have trouble making decisions. You feel like things don&amp;#39;t matter. You feel miserable and you feel like you&amp;#39;re existing rather than thriving.&lt;/p&gt;\n\n&lt;p&gt;Having goals related to an area of your life comes from really caring about that area of your life.&lt;/p&gt;\n\n&lt;p&gt;But when you&amp;#39;re depressed, you don&amp;#39;t care about anything.&lt;/p&gt;\n\n&lt;p&gt;I know what it&amp;#39;s like. I used to be very depressed.&lt;/p&gt;\n\n&lt;p&gt;What are you doing to get your brain unstuck out of its depressed state? Are you seeing a therapist to work through your issues?&lt;/p&gt;\n\n&lt;p&gt;Hope this helps&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg8mtg2", "score_hidden": false, "stickied": false, "created": 1492165932.0, "created_utc": 1492137132.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_657gki", "likes": null, "replies": "", "user_reports": [], "id": "dg8mmht", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "slothtrop6", "parent_id": "t3_657gki", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "You'll find you may come up with a career goal not out of sheer interest in the work, but self-preservation. The mindless grind is not only boring but leaves you in a vulnerable position for the future. Your job may not exist 5 years from now.\n\nAll the same, you're not your job. We do what we have to do to make a living, if I knew for a fact I could have a boring job for 30+ years and a decent pension I'd take it. You just have to make it work for you, bring music and podcasts that sort of thing. And socialize. It's mundane and awkward at first but becomes more enjoyable the better you get at it.\n\nYou have leisure time, so maybe that isn't used to its full potential. Unless you particularly enjoy being a complete hermit every day, it's better you find ways to remain active and social outside of work. It's difficult to distract yourself with only solitary hobbies when you're depressed - it all seems pointless, because you have NEEDS that aren't being met. \n\nUn-cut ties with your friends, and make new ones. And if those aren't to your satisfaction, make new ones again. There are people out there ready and willing to have fun and want validation as much as you do. They want to be life affirming. When that infrastructure is all built up and settled you can start thinking about goals beyond not being unhappy.\n\nI'm saying this as much for me as for you. I've gotten out of this shit before (through luck and temporary effort), but I'm aiming for a more striking transformation now. I think I'll need the luck anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ll find you may come up with a career goal not out of sheer interest in the work, but self-preservation. The mindless grind is not only boring but leaves you in a vulnerable position for the future. Your job may not exist 5 years from now.&lt;/p&gt;\n\n&lt;p&gt;All the same, you&amp;#39;re not your job. We do what we have to do to make a living, if I knew for a fact I could have a boring job for 30+ years and a decent pension I&amp;#39;d take it. You just have to make it work for you, bring music and podcasts that sort of thing. And socialize. It&amp;#39;s mundane and awkward at first but becomes more enjoyable the better you get at it.&lt;/p&gt;\n\n&lt;p&gt;You have leisure time, so maybe that isn&amp;#39;t used to its full potential. Unless you particularly enjoy being a complete hermit every day, it&amp;#39;s better you find ways to remain active and social outside of work. It&amp;#39;s difficult to distract yourself with only solitary hobbies when you&amp;#39;re depressed - it all seems pointless, because you have NEEDS that aren&amp;#39;t being met. &lt;/p&gt;\n\n&lt;p&gt;Un-cut ties with your friends, and make new ones. And if those aren&amp;#39;t to your satisfaction, make new ones again. There are people out there ready and willing to have fun and want validation as much as you do. They want to be life affirming. When that infrastructure is all built up and settled you can start thinking about goals beyond not being unhappy.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m saying this as much for me as for you. I&amp;#39;ve gotten out of this shit before (through luck and temporary effort), but I&amp;#39;m aiming for a more striking transformation now. I think I&amp;#39;ll need the luck anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg8mmht", "score_hidden": false, "stickied": false, "created": 1492165647.0, "created_utc": 1492136847.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_657gki", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_657gki", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_657gki", "likes": null, "replies": "", "user_reports": [], "id": "dg88a39", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thirdeyeape", "parent_id": "t1_dg87i7h", "subreddit_name_prefixed": "r/depression", "controversiality": 1, "body": "Homeless/homefree it's all perception man. I know this is something not so easy to grasp when you've been so heavily brain washed by the capitalistic cult running the world. So don't be homeless be a traveler. Buy half an anchor of land and build a tiny home on it so you have a home to come back to when you're done. Look man these are just suggestion. The underlining problem is you're too comfortable being miserable and you have to do something about it to change it, if of course that's what you want. Think of it like this, out ancestors were too busy surviving to worry about silly things such as anxiety and depression. I'm not saying they didn't experience those things but they didn't have time to sit around and write each other letters about it. So try and live and if all fails you can say you tried right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Homeless/homefree it&amp;#39;s all perception man. I know this is something not so easy to grasp when you&amp;#39;ve been so heavily brain washed by the capitalistic cult running the world. So don&amp;#39;t be homeless be a traveler. Buy half an anchor of land and build a tiny home on it so you have a home to come back to when you&amp;#39;re done. Look man these are just suggestion. The underlining problem is you&amp;#39;re too comfortable being miserable and you have to do something about it to change it, if of course that&amp;#39;s what you want. Think of it like this, out ancestors were too busy surviving to worry about silly things such as anxiety and depression. I&amp;#39;m not saying they didn&amp;#39;t experience those things but they didn&amp;#39;t have time to sit around and write each other letters about it. So try and live and if all fails you can say you tried right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg88a39", "score_hidden": false, "stickied": false, "created": 1492146499.0, "created_utc": 1492117699.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87i7h", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "headingtoabyss", "parent_id": "t1_dg86314", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Are you suggesting me to try being homeless?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you suggesting me to try being homeless?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg87i7h", "score_hidden": false, "stickied": false, "created": 1492145609.0, "created_utc": 1492116809.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86314", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "thirdeyeape", "parent_id": "t3_657gki", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Pack a back pack full of things and just go. See what happens. What do you have to lose?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pack a back pack full of things and just go. See what happens. What do you have to lose?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg86314", "score_hidden": false, "stickied": false, "created": 1492143988.0, "created_utc": 1492115188.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_657gki", "likes": null, "replies": "", "user_reports": [], "id": "dg81hvy", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "sadhoppipolla", "parent_id": "t3_657gki", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Kind of like me. I hate myself. How can you have goals or enjoy things when you don't even like yourself", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kind of like me. I hate myself. How can you have goals or enjoy things when you don&amp;#39;t even like yourself&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dg81hvy", "score_hidden": false, "stickied": false, "created": 1492138979.0, "created_utc": 1492110179.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}]