[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been struggling for a good twelve years now, running through various mills of treatment and meds. I&amp;#39;m still doing pretty abysmal, but recently started a job, which for me is a pretty big deal. It&amp;#39;s not a very good job, it&amp;#39;s dulling any creativity I had left and the pay is just enough to get by, but the fact that I go out every day and interact with people, again, is a pretty big deal seeing as I&amp;#39;ve spent the last two years isolated from the outside world. Still, I feel like a failure when I see all these people around me, former friends, ex lovers and even just mere acquaintances, move along with their lives succeed in everything, while I&amp;#39;m still in the same place I was during those relationships or when those relationships came to an end. It&amp;#39;s like I&amp;#39;m stuck at 10% in while they&amp;#39;re already at 70%. I currently don&amp;#39;t really have any friends and I feel like this &amp;#39;&amp;#39;behind on everyone else&amp;#39;&amp;#39; feeling plays a big part in not being able to make any. I just never feel good enough for anyone or worth anyone&amp;#39;s time, because look at what I&amp;#39;ve accomplished or rather what I SHOULD have accomplished, but haven&amp;#39;t. I feel like a snail that&amp;#39;ll get stepped on anyway, before ever figuring it all out, putting me in the mindset that it&amp;#39;s not really worth it anyway, so why bother?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been struggling for a good twelve years now, running through various mills of treatment and meds. I'm still doing pretty abysmal, but recently started a job, which for me is a pretty big deal. It's not a very good job, it's dulling any creativity I had left and the pay is just enough to get by, but the fact that I go out every day and interact with people, again, is a pretty big deal seeing as I've spent the last two years isolated from the outside world. Still, I feel like a failure when I see all these people around me, former friends, ex lovers and even just mere acquaintances, move along with their lives succeed in everything, while I'm still in the same place I was during those relationships or when those relationships came to an end. It's like I'm stuck at 10% in while they're already at 70%. I currently don't really have any friends and I feel like this ''behind on everyone else'' feeling plays a big part in not being able to make any. I just never feel good enough for anyone or worth anyone's time, because look at what I've accomplished or rather what I SHOULD have accomplished, but haven't. I feel like a snail that'll get stepped on anyway, before ever figuring it all out, putting me in the mindset that it's not really worth it anyway, so why bother?", "likes": null, "suggested_sort": "new", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65f1cb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 318, "report_reasons": null, "author": "swordsforhands", "saved": false, "mod_reports": [], "name": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qqqf", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/depression/comments/65f1cb/seeing_people_my_age_around_me_succeed_makes_me/", "num_reports": null, "locked": false, "stickied": false, "created": 1492230826.0, "url": "https://www.reddit.com/r/depression/comments/65f1cb/seeing_people_my_age_around_me_succeed_makes_me/", "author_flair_text": null, "quarantine": false, "title": "Seeing people my age around me succeed makes me feel like a failure", "created_utc": 1492202026.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 36, "visited": false, "subreddit_type": "public", "ups": 318}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgc1v0q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "swordsforhands", "parent_id": "t1_dgazugv", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Stopped using it about six months ago, definitely makes a difference.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stopped using it about six months ago, definitely makes a difference.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgc1v0q", "score_hidden": false, "stickied": false, "created": 1492379917.0, "created_utc": 1492351117.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgazugv", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "shoutout_to_burritos", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Are you on Facebook? If so, get off it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you on Facebook? If so, get off it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgazugv", "score_hidden": false, "stickied": false, "created": 1492310386.0, "created_utc": 1492281586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgasoa9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThrillOTheHunt", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Everyone lives different lives. We are brought up differently and we don't all have the same opportunities as our peers. Some get luckier than others, you know. I hate to say it but s lot of times it really boils down to luck, so it's not fair to yourself to compare yourself to others. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone lives different lives. We are brought up differently and we don&amp;#39;t all have the same opportunities as our peers. Some get luckier than others, you know. I hate to say it but s lot of times it really boils down to luck, so it&amp;#39;s not fair to yourself to compare yourself to others. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgasoa9", "score_hidden": false, "stickied": false, "created": 1492300515.0, "created_utc": 1492271715.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dganid8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TurinTurambar499", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "And feeling like a failure is what got me depressed in the first place...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And feeling like a failure is what got me depressed in the first place...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dganid8", "score_hidden": false, "stickied": false, "created": 1492292539.0, "created_utc": 1492263739.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgamqc2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yonce0303", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I'm in the same boat. I don't work nor do I study so if I cut out social media, I could become pretty bored. Shitty cycle. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in the same boat. I don&amp;#39;t work nor do I study so if I cut out social media, I could become pretty bored. Shitty cycle. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgamqc2", "score_hidden": false, "stickied": false, "created": 1492291077.0, "created_utc": 1492262277.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgakyax", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Sadpanda212", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Not to repeat everyone on here, but it really is true that when it comes to social media, you're really only seeing the highlights or edited version of those people's lives, so don't assume it's all a gravy train for them. One of the best quotes I've seen on how everything is relative, to anybody at any point in their lives is this snippet from a Huffington Post article I came across a while back. I hope this helps.\n\n\n\"Everyone is worried about their choices. Those in cities worry if they’ll ever get out to the country, and those in the woods think they might be missing the opportunities of city life. Young professionals are terrified they’ve forever bid farewell to fun and freedom, and those with throw-away jobs are down about not making as much money as they could be and not appearing accomplished enough. Some who are dedicated to school want more room in their lives for other things, those with roomy lives desire that space to be filled. Single people want relationships, settled people wonder if they’re missing out on something, traveling types miss stability, stable ones are restless, old friends want new friends, new friends miss old friends, and basically almost everyone my age has some dangling worry trailing around after them everywhere that they’re somehow not doing everything, that what they’re doing is not altogether the right thing, that they are missing out.\nA million lessons can be taken from this. All I want to say is, don’t for a second convince yourself that you are the only one who knows this doubt. Do not be ashamed. The doubt is natural, and everyone you know — yes, even that person — carries it sometimes too. Allow yourself to be peaceful. Allow yourself satisfaction in what you have. If you really don’t like it, allow yourself permission to make changes. \n\nAll y’all are beautiful. Unclench those butts.\" - Lillian Schneider \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not to repeat everyone on here, but it really is true that when it comes to social media, you&amp;#39;re really only seeing the highlights or edited version of those people&amp;#39;s lives, so don&amp;#39;t assume it&amp;#39;s all a gravy train for them. One of the best quotes I&amp;#39;ve seen on how everything is relative, to anybody at any point in their lives is this snippet from a Huffington Post article I came across a while back. I hope this helps.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Everyone is worried about their choices. Those in cities worry if they’ll ever get out to the country, and those in the woods think they might be missing the opportunities of city life. Young professionals are terrified they’ve forever bid farewell to fun and freedom, and those with throw-away jobs are down about not making as much money as they could be and not appearing accomplished enough. Some who are dedicated to school want more room in their lives for other things, those with roomy lives desire that space to be filled. Single people want relationships, settled people wonder if they’re missing out on something, traveling types miss stability, stable ones are restless, old friends want new friends, new friends miss old friends, and basically almost everyone my age has some dangling worry trailing around after them everywhere that they’re somehow not doing everything, that what they’re doing is not altogether the right thing, that they are missing out.\nA million lessons can be taken from this. All I want to say is, don’t for a second convince yourself that you are the only one who knows this doubt. Do not be ashamed. The doubt is natural, and everyone you know — yes, even that person — carries it sometimes too. Allow yourself to be peaceful. Allow yourself satisfaction in what you have. If you really don’t like it, allow yourself permission to make changes. &lt;/p&gt;\n\n&lt;p&gt;All y’all are beautiful. Unclench those butts.&amp;quot; - Lillian Schneider &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgakyax", "score_hidden": false, "stickied": false, "created": 1492287191.0, "created_utc": 1492258391.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgakkye", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "homiiie", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I have the exact same problem, so many times when I was about to start something with my life and then see my friends and other people my age doing much better with their lives I feel like shit and get depressed I even isolated myself for the last couple of years which made things even worse and got me social anxiety, now it's just a mindset whenever I see someone having something going on with their life I instantly blame myself and get really jealous, but I didn't see the hard times they passed through our minds tend to see the good results about others and forget the struggles they had to pass, the first thing you have to do is love and accept yourself if you made bad decisions before admit it to yourself and try to get lessons from them and DO YOUR BEST to not repeat them, try to read self help books they helped me a lot, and don't let your mind trick you and victimize you, you are much more than that never stop improving and THINGS WILL GET BETTER", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have the exact same problem, so many times when I was about to start something with my life and then see my friends and other people my age doing much better with their lives I feel like shit and get depressed I even isolated myself for the last couple of years which made things even worse and got me social anxiety, now it&amp;#39;s just a mindset whenever I see someone having something going on with their life I instantly blame myself and get really jealous, but I didn&amp;#39;t see the hard times they passed through our minds tend to see the good results about others and forget the struggles they had to pass, the first thing you have to do is love and accept yourself if you made bad decisions before admit it to yourself and try to get lessons from them and DO YOUR BEST to not repeat them, try to read self help books they helped me a lot, and don&amp;#39;t let your mind trick you and victimize you, you are much more than that never stop improving and THINGS WILL GET BETTER&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgakkye", "score_hidden": false, "stickied": false, "created": 1492286269.0, "created_utc": 1492257469.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgaio3q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "welsh_dragon_roar", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "One of my first steps in dealing with this wretched condition was to stop comparing myself to everyone - sertraline gave me a good bedrock to allow for that. Reality also helped - I realised that for most of the people I was envious of, scratch the surface a little and a lot of them are barely holding things together themselves.. mortgage repayments destroying them.. loveless relationships (so much more common than you realise).. realising too late they didn't want kids.. that super high-flying dream job causing all sorts of real stress.\n\nNow that's not intended as consolation, but more to put another perspective on matters. Most of us live on a foundation where a biochemical imbalance dominates our life, but to some people, you might appear to have an idyllic carefree lifestyle!\n\nThe upshot is: don't compare yourself to other people. You are you, completely unique, so focus on that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of my first steps in dealing with this wretched condition was to stop comparing myself to everyone - sertraline gave me a good bedrock to allow for that. Reality also helped - I realised that for most of the people I was envious of, scratch the surface a little and a lot of them are barely holding things together themselves.. mortgage repayments destroying them.. loveless relationships (so much more common than you realise).. realising too late they didn&amp;#39;t want kids.. that super high-flying dream job causing all sorts of real stress.&lt;/p&gt;\n\n&lt;p&gt;Now that&amp;#39;s not intended as consolation, but more to put another perspective on matters. Most of us live on a foundation where a biochemical imbalance dominates our life, but to some people, you might appear to have an idyllic carefree lifestyle!&lt;/p&gt;\n\n&lt;p&gt;The upshot is: don&amp;#39;t compare yourself to other people. You are you, completely unique, so focus on that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgaio3q", "score_hidden": false, "stickied": false, "created": 1492280688.0, "created_utc": 1492251888.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgampr3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mind101", "parent_id": "t1_dgahq2u", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "OK, but does this necessarily mean that the guy is a balanced, contented and healthy individual?\n\nMy mother used to work with a guy whose kids turned out to become world-class musicians. Sure, they were fantastically gifted and perfected their craft from an early age, but you could feel there was something off when interacting with them. The never-ending hours of practice, the pressure to succeed and the lack of experiences other people take for granted certainly took its toll on these people. \n\nIf having an accomplished career is someone's only metric for success, then yeah, the law office guy is great. Will he be able to maintain that pace though? What will happen to his social life / marriage / overall health 10 years from now, or 20?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OK, but does this necessarily mean that the guy is a balanced, contented and healthy individual?&lt;/p&gt;\n\n&lt;p&gt;My mother used to work with a guy whose kids turned out to become world-class musicians. Sure, they were fantastically gifted and perfected their craft from an early age, but you could feel there was something off when interacting with them. The never-ending hours of practice, the pressure to succeed and the lack of experiences other people take for granted certainly took its toll on these people. &lt;/p&gt;\n\n&lt;p&gt;If having an accomplished career is someone&amp;#39;s only metric for success, then yeah, the law office guy is great. Will he be able to maintain that pace though? What will happen to his social life / marriage / overall health 10 years from now, or 20?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgampr3", "score_hidden": false, "stickied": false, "created": 1492291045.0, "created_utc": 1492262245.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgaicyb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Pinkluvtaco", "parent_id": "t1_dgahq2u", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Yeah, comparing  yourself to others is a surefire oneway ticket to a double nut punch.\n\n20, with own law firm? And he's probably not finished yet.  Neurosurgeon by 25 and accomplished violinist by 28. Some people just strike the genetic lottery. Its impossible not to be jealous.\n\nOn the flipside someone always has it much much worse but for some reason that never makes us feel better.  I'm not sure why the human brain works like that.\n\nOne more punch to the bits", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, comparing  yourself to others is a surefire oneway ticket to a double nut punch.&lt;/p&gt;\n\n&lt;p&gt;20, with own law firm? And he&amp;#39;s probably not finished yet.  Neurosurgeon by 25 and accomplished violinist by 28. Some people just strike the genetic lottery. Its impossible not to be jealous.&lt;/p&gt;\n\n&lt;p&gt;On the flipside someone always has it much much worse but for some reason that never makes us feel better.  I&amp;#39;m not sure why the human brain works like that.&lt;/p&gt;\n\n&lt;p&gt;One more punch to the bits&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgaicyb", "score_hidden": false, "stickied": false, "created": 1492279703.0, "created_utc": 1492250903.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgahq2u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FuckedLastAccountLOL", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "A few months ago I met some dude who was around my age (20-22) and he already graduated law school and runs his own office. Like wtf?! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A few months ago I met some dude who was around my age (20-22) and he already graduated law school and runs his own office. Like wtf?! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgahq2u", "score_hidden": false, "stickied": false, "created": 1492277632.0, "created_utc": 1492248832.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgag8wi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dotcubed", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Hey you said \"lovers\" right? I broke up with my high school crush a lifetime ago, was so sad about it that wanted to slit my wrist having had only two women in my life at that point. I actually called a company that made caffeine pills as a concerned friend that wanted to make sure an OD wasn't possible. \n\nAlmost twenty years later I'm miserable but I have a life of some kind with some pretty great memories since then. I did some college then, had a break, a girl, more college that got an associates, a job, another job, another college with a Bachelors degree and a meltdown over Christmas because I got only one gift which I knew what it was and really felt my life was out of my control. \n\nI did a few days in an inpatient metal facility without getting medication. In a few weeks I'll see a doctor that will hopefully give me some drugs. \n\nYou have so much more time than I did, make sure that you don't waste it. If you can get girls that's great! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey you said &amp;quot;lovers&amp;quot; right? I broke up with my high school crush a lifetime ago, was so sad about it that wanted to slit my wrist having had only two women in my life at that point. I actually called a company that made caffeine pills as a concerned friend that wanted to make sure an OD wasn&amp;#39;t possible. &lt;/p&gt;\n\n&lt;p&gt;Almost twenty years later I&amp;#39;m miserable but I have a life of some kind with some pretty great memories since then. I did some college then, had a break, a girl, more college that got an associates, a job, another job, another college with a Bachelors degree and a meltdown over Christmas because I got only one gift which I knew what it was and really felt my life was out of my control. &lt;/p&gt;\n\n&lt;p&gt;I did a few days in an inpatient metal facility without getting medication. In a few weeks I&amp;#39;ll see a doctor that will hopefully give me some drugs. &lt;/p&gt;\n\n&lt;p&gt;You have so much more time than I did, make sure that you don&amp;#39;t waste it. If you can get girls that&amp;#39;s great! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgag8wi", "score_hidden": false, "stickied": false, "created": 1492273001.0, "created_utc": 1492244201.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgbtbx9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "swordsforhands", "parent_id": "t1_dgafpfx", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgbtbx9", "score_hidden": false, "stickied": false, "created": 1492356165.0, "created_utc": 1492327365.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgafpfx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Newwby", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "*Run when you can, walk if you have to, crawl if you must; just never give up*\n\nYou are still going, still fighting OP, and that's more important than anything. Even if you were at 0%, scrabbling for 1%, the fact that you're trying is huge.\n\nYou've probably heard this before but comparing yourself to others is only going to lead to misery; people always have varying levels of opportunity and luck in their lives, they face challenges of a different nature. Depression is not a minor stumbling block, it is a significant detriment to your life and motivation so don't kid yourself into thinking you're failing or even playing the same game - your difficulty is likely many steps higher.\n\nFor what it's worth it doesn't sound to me like you're failing, getting by and getting out to interact with people is huge. Take care of yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Run when you can, walk if you have to, crawl if you must; just never give up&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;You are still going, still fighting OP, and that&amp;#39;s more important than anything. Even if you were at 0%, scrabbling for 1%, the fact that you&amp;#39;re trying is huge.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve probably heard this before but comparing yourself to others is only going to lead to misery; people always have varying levels of opportunity and luck in their lives, they face challenges of a different nature. Depression is not a minor stumbling block, it is a significant detriment to your life and motivation so don&amp;#39;t kid yourself into thinking you&amp;#39;re failing or even playing the same game - your difficulty is likely many steps higher.&lt;/p&gt;\n\n&lt;p&gt;For what it&amp;#39;s worth it doesn&amp;#39;t sound to me like you&amp;#39;re failing, getting by and getting out to interact with people is huge. Take care of yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgafpfx", "score_hidden": false, "stickied": false, "created": 1492271467.0, "created_utc": 1492242667.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgaffsw", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "babynecro", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Little bit long-winded but follow me here. \n\nI'm currently living with my mother, old enough to have kids, watching my friends get their own places, travel, get married, buy the car of their dreams, that sort of thing, so I completely understand. However, I've done some thinking on this and it has helped me deal with my situation so, hopefully it will help you too.\n\nMachiavelli, despite his morally ambiguous advice, provides some advice that's always stuck to me: \"greatness comes through power and opportunity.\" While this sounds like good advice if you don't have the power to take opportunities or it seems as if opportunities don't come around for you, (after tons of what others have described as merely 'bad luck') I realized that this recipe for success wasn't entirely accurate for my life and probably nobody else's. \n\nI tried to become a pilot in the USAF and was told at literally every turn that there was a 2% chance that I'd get all the way to where I wanted to be. Some time later I heard a statistic from the film/TV industry saying that 98% of people wanting to get into film or television don't make it.\n\nI have no way of verifying if either of these are true, or whether the chances of success are truly 2% for an average person but it brought me to realize that despite what Machiavelli thinks, even if you know you're doing exactly what you need to be doing to succeed, and you know for a fact that the opportunity for you to succeed is here and available for you, there is a very real possibility that you won't succeed. \n\nIt sucks when you think about it in that way but let me put it another way: 2% chance corresponds to (if I'm not mistaken) a 1 in 50 chance, meaning that on average each success comes with the possibility of around 49 failures. While that doesn't necessarily help, it does help to think that if something seems to fail every time, the truth may be that you simply haven't gone through as many failures as necessary for success to occur. It's a matter of personal luck that some people get success in the first 10 tries, and others get it somewhere in the 100s. Some people won't ever get it, some people don't even have to try but if you're making an effort to succeed or improve your life you bring that probability from 0% to quite possibly 2% which, isn't much but, if you look at the rest of the world, some people have succeeded so it's definitely possible. \n\nCourtesy of Sir Patrick Stewart as Jean-Luc Picard: \"It is possible to commit no mistakes and still lose. That is not a weakness, that is life.\"", "edited": 1492242397.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Little bit long-winded but follow me here. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m currently living with my mother, old enough to have kids, watching my friends get their own places, travel, get married, buy the car of their dreams, that sort of thing, so I completely understand. However, I&amp;#39;ve done some thinking on this and it has helped me deal with my situation so, hopefully it will help you too.&lt;/p&gt;\n\n&lt;p&gt;Machiavelli, despite his morally ambiguous advice, provides some advice that&amp;#39;s always stuck to me: &amp;quot;greatness comes through power and opportunity.&amp;quot; While this sounds like good advice if you don&amp;#39;t have the power to take opportunities or it seems as if opportunities don&amp;#39;t come around for you, (after tons of what others have described as merely &amp;#39;bad luck&amp;#39;) I realized that this recipe for success wasn&amp;#39;t entirely accurate for my life and probably nobody else&amp;#39;s. &lt;/p&gt;\n\n&lt;p&gt;I tried to become a pilot in the USAF and was told at literally every turn that there was a 2% chance that I&amp;#39;d get all the way to where I wanted to be. Some time later I heard a statistic from the film/TV industry saying that 98% of people wanting to get into film or television don&amp;#39;t make it.&lt;/p&gt;\n\n&lt;p&gt;I have no way of verifying if either of these are true, or whether the chances of success are truly 2% for an average person but it brought me to realize that despite what Machiavelli thinks, even if you know you&amp;#39;re doing exactly what you need to be doing to succeed, and you know for a fact that the opportunity for you to succeed is here and available for you, there is a very real possibility that you won&amp;#39;t succeed. &lt;/p&gt;\n\n&lt;p&gt;It sucks when you think about it in that way but let me put it another way: 2% chance corresponds to (if I&amp;#39;m not mistaken) a 1 in 50 chance, meaning that on average each success comes with the possibility of around 49 failures. While that doesn&amp;#39;t necessarily help, it does help to think that if something seems to fail every time, the truth may be that you simply haven&amp;#39;t gone through as many failures as necessary for success to occur. It&amp;#39;s a matter of personal luck that some people get success in the first 10 tries, and others get it somewhere in the 100s. Some people won&amp;#39;t ever get it, some people don&amp;#39;t even have to try but if you&amp;#39;re making an effort to succeed or improve your life you bring that probability from 0% to quite possibly 2% which, isn&amp;#39;t much but, if you look at the rest of the world, some people have succeeded so it&amp;#39;s definitely possible. &lt;/p&gt;\n\n&lt;p&gt;Courtesy of Sir Patrick Stewart as Jean-Luc Picard: &amp;quot;It is possible to commit no mistakes and still lose. That is not a weakness, that is life.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgaffsw", "score_hidden": false, "stickied": false, "created": 1492270731.0, "created_utc": 1492241931.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgadttw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mightdai85", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "It's really really hard and I struggle with this a lot.  I find it very hard to be around other people who are \"more successful\" which is a broad term for me feeling inferior in some aspect of life.\n\nThat said, I look at the people who seem to be very comfortable in their skin and who can easily socialize or be around others more successful and I find a common theme.  They have achieved or obtained enough in life that deep down they truly believe they have done enough as a person.  They can easily say things like \"oh that guy is crazy rich, but I have everything I need and in the end it's cool to be friends with someone like that and hear what he has to say.\"\n\nI, on the other hand, believe that deep down inside I am a failure.  And I think that has to change.  Maybe we need to find something that we can be proud of that is unique and makes us special in some way.  We should also spend time with those who are less fortunate (there is always someone worse off) to help put our life in perspective.  The old you would look at the new you with awe, with how far you've come to get this job.", "edited": 1492238927.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s really really hard and I struggle with this a lot.  I find it very hard to be around other people who are &amp;quot;more successful&amp;quot; which is a broad term for me feeling inferior in some aspect of life.&lt;/p&gt;\n\n&lt;p&gt;That said, I look at the people who seem to be very comfortable in their skin and who can easily socialize or be around others more successful and I find a common theme.  They have achieved or obtained enough in life that deep down they truly believe they have done enough as a person.  They can easily say things like &amp;quot;oh that guy is crazy rich, but I have everything I need and in the end it&amp;#39;s cool to be friends with someone like that and hear what he has to say.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I, on the other hand, believe that deep down inside I am a failure.  And I think that has to change.  Maybe we need to find something that we can be proud of that is unique and makes us special in some way.  We should also spend time with those who are less fortunate (there is always someone worse off) to help put our life in perspective.  The old you would look at the new you with awe, with how far you&amp;#39;ve come to get this job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgadttw", "score_hidden": false, "stickied": false, "created": 1492266653.0, "created_utc": 1492237853.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgclibn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throwoda", "parent_id": "t1_dgafku3", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I've already done that.  I never liked social media, can't stand facebook or twitter. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve already done that.  I never liked social media, can&amp;#39;t stand facebook or twitter. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgclibn", "score_hidden": false, "stickied": false, "created": 1492406566.0, "created_utc": 1492377766.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgafku3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Newwby", "parent_id": "t1_dgaelte", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I'm going to heavily second this /u/throwoda, and I recommend it for anyone else in this sub. Deleting/deactivating social media (particularly comparison based ones like Facebook and Instagram) has been the single best thing I've done for my mental health in the past year. It's been extremely freeing.\n\nIt does have the side-effect of isolating you a little from your social circles so make sure you have up-to-date mobile numbers, whatsapp or some other way of contacting friends before you do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to heavily second this &lt;a href=\"/u/throwoda\"&gt;/u/throwoda&lt;/a&gt;, and I recommend it for anyone else in this sub. Deleting/deactivating social media (particularly comparison based ones like Facebook and Instagram) has been the single best thing I&amp;#39;ve done for my mental health in the past year. It&amp;#39;s been extremely freeing.&lt;/p&gt;\n\n&lt;p&gt;It does have the side-effect of isolating you a little from your social circles so make sure you have up-to-date mobile numbers, whatsapp or some other way of contacting friends before you do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgafku3", "score_hidden": false, "stickied": false, "created": 1492271117.0, "created_utc": 1492242317.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaelte", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MagentaTangerine", "parent_id": "t1_dgadrxh", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "It helps to delete social media to stop you from comparing yourself to others who had easier lives.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It helps to delete social media to stop you from comparing yourself to others who had easier lives.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgaelte", "score_hidden": false, "stickied": false, "created": 1492268548.0, "created_utc": 1492239748.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgadrxh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "throwoda", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "At 26 I don't know where to go in life. Only job opportunities that are decent are white collar business jobs that I would not be interested in, nor have the skills for. \n\nI couldn't afford college. Everyone I knew who went to college is in major debt from it. Struggling with my mental illness, everyday is a challenge, all my money goes to helping my father support my 2 sisters. \n\nI do see all these rich people, (some young) who treat me like shit, and had everything handed to them. It makes me very resentful. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At 26 I don&amp;#39;t know where to go in life. Only job opportunities that are decent are white collar business jobs that I would not be interested in, nor have the skills for. &lt;/p&gt;\n\n&lt;p&gt;I couldn&amp;#39;t afford college. Everyone I knew who went to college is in major debt from it. Struggling with my mental illness, everyday is a challenge, all my money goes to helping my father support my 2 sisters. &lt;/p&gt;\n\n&lt;p&gt;I do see all these rich people, (some young) who treat me like shit, and had everything handed to them. It makes me very resentful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgadrxh", "score_hidden": false, "stickied": false, "created": 1492266533.0, "created_utc": 1492237733.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgacw9e", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Maddiestone95", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Do you want to know how I fixed this particular problem? I dropped all my friends and now I have no one to compare myself too :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you want to know how I fixed this particular problem? I dropped all my friends and now I have no one to compare myself too :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgacw9e", "score_hidden": false, "stickied": false, "created": 1492264584.0, "created_utc": 1492235784.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgacdjd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RSFan1234", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "When all my classmates try to show off their Big Four jobs and their travels or their grad school, like, who are they trying to impress? Me? Well, I can't say I'm not impressed, but I'd still rather not listen. Then people ask me \"Why are you antisocial, do you have a problem? Are you avoiding us?\" Hell yeah, I'm avoiding every single person that complains about their job schedule. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When all my classmates try to show off their Big Four jobs and their travels or their grad school, like, who are they trying to impress? Me? Well, I can&amp;#39;t say I&amp;#39;m not impressed, but I&amp;#39;d still rather not listen. Then people ask me &amp;quot;Why are you antisocial, do you have a problem? Are you avoiding us?&amp;quot; Hell yeah, I&amp;#39;m avoiding every single person that complains about their job schedule. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgacdjd", "score_hidden": false, "stickied": false, "created": 1492263459.0, "created_utc": 1492234659.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgacu97", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Notthepizza", "parent_id": "t1_dgabzyw", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "You shouldn't feel bad about that, of course you'd feel bad, I mean even if no one straight out compares you to other people, it sure as hell feels like everyone is. \n\nI don't think you're a jerk because right now you can't feel happy for others, it doesn't make you a bad person. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You shouldn&amp;#39;t feel bad about that, of course you&amp;#39;d feel bad, I mean even if no one straight out compares you to other people, it sure as hell feels like everyone is. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think you&amp;#39;re a jerk because right now you can&amp;#39;t feel happy for others, it doesn&amp;#39;t make you a bad person. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgacu97", "score_hidden": false, "stickied": false, "created": 1492264463.0, "created_utc": 1492235663.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgac7bg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blissfoolignorance", "parent_id": "t1_dgabzyw", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Try to see the beauty in it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try to see the beauty in it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgac7bg", "score_hidden": false, "stickied": false, "created": 1492263099.0, "created_utc": 1492234299.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgabzyw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "swordsforhands", "parent_id": "t1_dgabtji", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Now I feel like a jerk, I can't really feel happy for others..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Now I feel like a jerk, I can&amp;#39;t really feel happy for others..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgabzyw", "score_hidden": false, "stickied": false, "created": 1492262691.0, "created_utc": 1492233891.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgabtji", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blissfoolignorance", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Other people do make me feel like a failure but I like to see people who have a partner and seem successful and happy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Other people do make me feel like a failure but I like to see people who have a partner and seem successful and happy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgabtji", "score_hidden": false, "stickied": false, "created": 1492262339.0, "created_utc": 1492233539.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dga6rak", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "drauch52", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Don't get me started. It's bullshit ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t get me started. It&amp;#39;s bullshit &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dga6rak", "score_hidden": false, "stickied": false, "created": 1492253845.0, "created_utc": 1492225045.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dgac1qa", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "swordsforhands", "parent_id": "t1_dga5m29", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Hey, at least you are studying. I dropped out two years ago and have no plans (or money, for that matter) to start studying again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, at least you are studying. I dropped out two years ago and have no plans (or money, for that matter) to start studying again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgac1qa", "score_hidden": false, "stickied": false, "created": 1492262785.0, "created_utc": 1492233985.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dga5m29", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "changesaccountsoften", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "22 here. My only friend(?) is graduating next year, and my cousin who is only one year older than me has a house and in medical school, but I'm just here....eating granola bars.\n\nI say *take it slowly* there's no rush. But my parents, especially my mom, make me feel like shit bc I'm no where near done with studies. Btw, I'm studying English so that's a other blow to my self-esteem since no one gives a fuck about that subject and getring an undergraduate in English is seen as a joke.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;22 here. My only friend(?) is graduating next year, and my cousin who is only one year older than me has a house and in medical school, but I&amp;#39;m just here....eating granola bars.&lt;/p&gt;\n\n&lt;p&gt;I say &lt;em&gt;take it slowly&lt;/em&gt; there&amp;#39;s no rush. But my parents, especially my mom, make me feel like shit bc I&amp;#39;m no where near done with studies. Btw, I&amp;#39;m studying English so that&amp;#39;s a other blow to my self-esteem since no one gives a fuck about that subject and getring an undergraduate in English is seen as a joke.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dga5m29", "score_hidden": false, "stickied": false, "created": 1492252215.0, "created_utc": 1492223415.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dga51qh", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "DidntWeHaveFun", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Everyone is fighting their own secret war. Even if they do smile everyday and seem to be really successful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone is fighting their own secret war. Even if they do smile everyday and seem to be really successful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dga51qh", "score_hidden": false, "stickied": false, "created": 1492251389.0, "created_utc": 1492222589.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dga43d6", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "JaceBentley", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I completely understand. I'm in my 20s and everyone I went to school with is doing 100 times better than I am. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I completely understand. I&amp;#39;m in my 20s and everyone I went to school with is doing 100 times better than I am. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dga43d6", "score_hidden": false, "stickied": false, "created": 1492250008.0, "created_utc": 1492221208.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dga2o6y", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Wasthereonce", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "People grow at their own pace. Everyone is different. There are people doing better than you, and there are people that are doing worse than you. But all that is subjective to what you value. If you value what they have, find a way to get it. Make your envy and jealousy into a drive for your success, which you will surely have if you pursue what you value. If your jealousy is too much, cut yourself off from knowing about them and get focused on what you value.\n\nYou have regret that is misplaced because you go at a different pace.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People grow at their own pace. Everyone is different. There are people doing better than you, and there are people that are doing worse than you. But all that is subjective to what you value. If you value what they have, find a way to get it. Make your envy and jealousy into a drive for your success, which you will surely have if you pursue what you value. If your jealousy is too much, cut yourself off from knowing about them and get focused on what you value.&lt;/p&gt;\n\n&lt;p&gt;You have regret that is misplaced because you go at a different pace.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dga2o6y", "score_hidden": false, "stickied": false, "created": 1492248053.0, "created_utc": 1492219253.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65f1cb", "likes": null, "replies": "", "user_reports": [], "id": "dga25wr", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65f1cb", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dga25wr", "score_hidden": false, "stickied": false, "created": 1492247346.0, "created_utc": 1492218546.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]