[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(My first post here, I don&amp;#39;t think I broke any of the rules. Let me know and I can change things.)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also desperately hoping somebody else has been through something similar and has advice for what to do, because I&amp;#39;m completely lost. Probably going to be a long post.&lt;/p&gt;\n\n&lt;p&gt;So, my daughter is 16. For most of her life, she was fine. She was shyer than most people (e.g. wouldn&amp;#39;t play in a park with other kids she didn&amp;#39;t know well, even as a toddler; hated talking to strangers and would sometimes just not respond if somebody talked to her because she was so shy), but still played outside on our street, had friends at school, volunteered in school plays, etc. She was perfectly happy playing on her own, and I would&amp;#39;ve described her as generally quiet and shy. She has a 3-years-younger sister, who is the opposite, generally loud and outgoing.&lt;/p&gt;\n\n&lt;p&gt;Even with her shyness, there was no hint of any depression, she was almost always very cheerful, had positive thoughts, and would bring herself out of a low mood, and her shyness didn&amp;#39;t seem to hold her back from anything.&lt;/p&gt;\n\n&lt;p&gt;Starting at around 13, she grew to be more and more shy, and became very anxious about what other people were thinking of her. She stopped playing outside with other kids in the neighborhood. She stopped going into shops on her own. If you shopped with her, she would not select a garment from the rack by herself; she said she was anxious she would drop it and be laughed at, or something like that.&lt;/p&gt;\n\n&lt;p&gt;She gradually had less and less friends at school. She worried that the friends she did have actually didn&amp;#39;t like her, and were only pretending.&lt;/p&gt;\n\n&lt;p&gt;At age 14 she started having panic attacks. Sometimes it would be about something (watching a scary movie), and other times brought on seemingly by nothing, like just sitting in class. They started out a few months apart, but became more frequent, probably weekly. But still she was (at least outwardly) happy. She had plenty of interests (mostly solitary). She enjoyed reading, writing, playing videogames, baking, fashion design, playing her guitar, and keeping a hamster. She also generally got along well with her younger sister, they played together a lot.&lt;/p&gt;\n\n&lt;p&gt;When she started doing her GCSE exams, things got worse. For non-English people, GCSEs are subjects you choose and then take exams in, you then leave high school at 16 with your qualifications from those GCSEs. GCSE grades are important to the schools (they&amp;#39;re ranked nationally against all schools), and the schools really drum it into you the importance of them, tell you to be thinking about a career, what you want to do for the rest of your life, etc. She felt really anxious about the future, and she had no idea what she wanted to do. She said everyone around her at school was doing well and knew what they wanted to do.&lt;/p&gt;\n\n&lt;p&gt;She still enjoyed school, and was always enthusiastic about her subjects. But when it came to exam time, she was having panic attacks more or less daily. She started saying she couldn&amp;#39;t get out of bed. She would lay awake at night worrying about things. She struggled through, passed 5 GCSEs with good grades and stayed home for a further 2 exams so she failed them. It was a really stressful time for all of us. Then it was summer vacation, and things were fine. She turned 16 and decided to stay at the same school for sixth form (for Americans, this is like midway between high school and college). In sixth form you get to choose all of your subjects, and you get about 10 hours of school less each week than in high school.&lt;/p&gt;\n\n&lt;p&gt;We went to the doctor and got her a prescription for an anti-anxiety medicine, which doesn&amp;#39;t stop you being anxious but damps down the symptoms (heart rate, sweating, breathing) so it doesn&amp;#39;t spiral into panic attacks. That helped some, and she didn&amp;#39;t have any panic attacks while on it.&lt;/p&gt;\n\n&lt;p&gt;On the first week of school, she missed a day and said she couldn&amp;#39;t get out of bed. She said she needed a break from school. She said she couldn&amp;#39;t do it. Things carried on like that for a month or so, with her missing one or two days a week. Then it moved to three days a week. We tried all kinds of punishments and rewards, to no effect. Eventually she was missing four days a week. We talked to the school, they said she could go to a special room on her own in school, that she could change her classes, reduce her classload, get her schoolwork sent home some days, etc. but it gave no improvement. A couple months into the new school year, she dropped out of school.&lt;/p&gt;\n\n&lt;p&gt;We got her a therapist, who she saw I think four times. The therapist said she has depression. The first three times, she lied about things and said what she thought the therapist wanted to hear. The fourth time, after we talked about that, she was honest about her feelings, and she said it was a good session and that she felt hopeful about the future. Then she stopped going. First she said she didn&amp;#39;t want help, that she didn&amp;#39;t want to get better. Then she said that she would get better on her own.&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s been out of school for four months now, but things are just getting worse. She started physically harming herself. She&amp;#39;s applied for paid apprenticeships in fields she&amp;#39;s interested in, but even when they&amp;#39;ve told her she will definitely get the position, she has not contacted them back because of anxiety. She&amp;#39;s been staying up later and later, often until 6 in the morning just before everyone else gets up, and then sleeping until mid-afternoon. She isn&amp;#39;t fat, but she says she is, and tries to eat less. But when she has allowance money, she spends almost 100% of it on stuff like ice cream and chips. It&amp;#39;s common for her to have a pint of ice cream every day if she has the money for it. She&amp;#39;s very, very down on herself. She asks why I&amp;#39;m being nice if I tell her I love her. She says she doesn&amp;#39;t deserve it if I give her a gift. She says she has no skills and there is nothing interesting about her. She asks why we don&amp;#39;t just give up on her. She will sometimes do some baking (if one of us is helping her), but the whole time she&amp;#39;s saying things like &amp;quot;This is going to be terrible,&amp;quot; &amp;quot;I&amp;#39;m doing this wrong,&amp;quot; &amp;quot;I&amp;#39;ve messed it all up,&amp;quot; even though basically everything she makes is great. She says she feels like she&amp;#39;s a bad person, and sometimes says her depression is a punishment for being bad. Sometimes she tries to punish herself even further, for ex. by avoiding food and saying she doesn&amp;#39;t deserve it.&lt;/p&gt;\n\n&lt;p&gt;Her shyness continues to get worse. She&amp;#39;s completely fine with us and her sister, but absolutely nobody else. Her grandparents visit every few weeks, but she won&amp;#39;t even come out of her room to see them. If I ask her to come out and see them, she says she can&amp;#39;t. She rarely goes out of the house. She won&amp;#39;t go into our corner shop (literally 50 feet away from the house), and actually pays her sister to go buy things for her.&lt;/p&gt;\n\n&lt;p&gt;She needs new glasses, but won&amp;#39;t go to the optometrist. She missed her last two appointments at the dentist, so they&amp;#39;ve discharged her as a patient.&lt;/p&gt;\n\n&lt;p&gt;About a month ago she tried to kill herself, but called the police in the middle of it and was taken to a hospitall.&lt;/p&gt;\n\n&lt;p&gt;For a couple months she carried on saying she didn&amp;#39;t want help, that she didn&amp;#39;t want things to change. She still refused to see the therapist. I told her I thought that she did want change, but that she was afraid of it, that she was afraid of getting better because she would have to do uncomfortable things for it (i.e. things outside her comfort zone). She cried and agreed, which felt like a major breakthrough even though it didn&amp;#39;t change anything. So she sabotages herself in lots of ways. Like, recently we tried triple chronotherapy, a 4 day treatment for depression which involves resetting your circadian rhythm with a SAD light daily, restricting your sleep, and going to bed and getting up at prescribed times. I did it along with her. She was hopeful about it before we started, although also worried and said she was anxious that if she got better she would have to do things. It went great the first two days, but on the third day she intentionally stayed up past the prescribed sleep time so that the whole things was ruined.&lt;/p&gt;\n\n&lt;p&gt;So, here we are. My daughter is depressed, anxious almost beyond belief, and refuses or sabotages anything that could possibly help. What can I do? How can I help her with this?&lt;/p&gt;\n\n&lt;p&gt;I posted this on &lt;a href=\"/r/parenting\"&gt;r/parenting&lt;/a&gt;, and their general consensus seems to be a) tough love b) involuntary commitment, c) physically forcing her to appointments. None of that really feels like it would work (and might make it worse!), but I don&amp;#39;t know what to do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "(My first post here, I don't think I broke any of the rules. Let me know and I can change things.)\n\nI'm also desperately hoping somebody else has been through something similar and has advice for what to do, because I'm completely lost. Probably going to be a long post.\n\nSo, my daughter is 16. For most of her life, she was fine. She was shyer than most people (e.g. wouldn't play in a park with other kids she didn't know well, even as a toddler; hated talking to strangers and would sometimes just not respond if somebody talked to her because she was so shy), but still played outside on our street, had friends at school, volunteered in school plays, etc. She was perfectly happy playing on her own, and I would've described her as generally quiet and shy. She has a 3-years-younger sister, who is the opposite, generally loud and outgoing.\n\nEven with her shyness, there was no hint of any depression, she was almost always very cheerful, had positive thoughts, and would bring herself out of a low mood, and her shyness didn't seem to hold her back from anything.\n\nStarting at around 13, she grew to be more and more shy, and became very anxious about what other people were thinking of her. She stopped playing outside with other kids in the neighborhood. She stopped going into shops on her own. If you shopped with her, she would not select a garment from the rack by herself; she said she was anxious she would drop it and be laughed at, or something like that.\n\nShe gradually had less and less friends at school. She worried that the friends she did have actually didn't like her, and were only pretending.\n\nAt age 14 she started having panic attacks. Sometimes it would be about something (watching a scary movie), and other times brought on seemingly by nothing, like just sitting in class. They started out a few months apart, but became more frequent, probably weekly. But still she was (at least outwardly) happy. She had plenty of interests (mostly solitary). She enjoyed reading, writing, playing videogames, baking, fashion design, playing her guitar, and keeping a hamster. She also generally got along well with her younger sister, they played together a lot.\n\nWhen she started doing her GCSE exams, things got worse. For non-English people, GCSEs are subjects you choose and then take exams in, you then leave high school at 16 with your qualifications from those GCSEs. GCSE grades are important to the schools (they're ranked nationally against all schools), and the schools really drum it into you the importance of them, tell you to be thinking about a career, what you want to do for the rest of your life, etc. She felt really anxious about the future, and she had no idea what she wanted to do. She said everyone around her at school was doing well and knew what they wanted to do.\n\nShe still enjoyed school, and was always enthusiastic about her subjects. But when it came to exam time, she was having panic attacks more or less daily. She started saying she couldn't get out of bed. She would lay awake at night worrying about things. She struggled through, passed 5 GCSEs with good grades and stayed home for a further 2 exams so she failed them. It was a really stressful time for all of us. Then it was summer vacation, and things were fine. She turned 16 and decided to stay at the same school for sixth form (for Americans, this is like midway between high school and college). In sixth form you get to choose all of your subjects, and you get about 10 hours of school less each week than in high school.\n\nWe went to the doctor and got her a prescription for an anti-anxiety medicine, which doesn't stop you being anxious but damps down the symptoms (heart rate, sweating, breathing) so it doesn't spiral into panic attacks. That helped some, and she didn't have any panic attacks while on it.\n\nOn the first week of school, she missed a day and said she couldn't get out of bed. She said she needed a break from school. She said she couldn't do it. Things carried on like that for a month or so, with her missing one or two days a week. Then it moved to three days a week. We tried all kinds of punishments and rewards, to no effect. Eventually she was missing four days a week. We talked to the school, they said she could go to a special room on her own in school, that she could change her classes, reduce her classload, get her schoolwork sent home some days, etc. but it gave no improvement. A couple months into the new school year, she dropped out of school.\n\nWe got her a therapist, who she saw I think four times. The therapist said she has depression. The first three times, she lied about things and said what she thought the therapist wanted to hear. The fourth time, after we talked about that, she was honest about her feelings, and she said it was a good session and that she felt hopeful about the future. Then she stopped going. First she said she didn't want help, that she didn't want to get better. Then she said that she would get better on her own.\n\nShe's been out of school for four months now, but things are just getting worse. She started physically harming herself. She's applied for paid apprenticeships in fields she's interested in, but even when they've told her she will definitely get the position, she has not contacted them back because of anxiety. She's been staying up later and later, often until 6 in the morning just before everyone else gets up, and then sleeping until mid-afternoon. She isn't fat, but she says she is, and tries to eat less. But when she has allowance money, she spends almost 100% of it on stuff like ice cream and chips. It's common for her to have a pint of ice cream every day if she has the money for it. She's very, very down on herself. She asks why I'm being nice if I tell her I love her. She says she doesn't deserve it if I give her a gift. She says she has no skills and there is nothing interesting about her. She asks why we don't just give up on her. She will sometimes do some baking (if one of us is helping her), but the whole time she's saying things like \"This is going to be terrible,\" \"I'm doing this wrong,\" \"I've messed it all up,\" even though basically everything she makes is great. She says she feels like she's a bad person, and sometimes says her depression is a punishment for being bad. Sometimes she tries to punish herself even further, for ex. by avoiding food and saying she doesn't deserve it.\n\nHer shyness continues to get worse. She's completely fine with us and her sister, but absolutely nobody else. Her grandparents visit every few weeks, but she won't even come out of her room to see them. If I ask her to come out and see them, she says she can't. She rarely goes out of the house. She won't go into our corner shop (literally 50 feet away from the house), and actually pays her sister to go buy things for her.\n\nShe needs new glasses, but won't go to the optometrist. She missed her last two appointments at the dentist, so they've discharged her as a patient.\n\nAbout a month ago she tried to kill herself, but called the police in the middle of it and was taken to a hospitall.\n\nFor a couple months she carried on saying she didn't want help, that she didn't want things to change. She still refused to see the therapist. I told her I thought that she did want change, but that she was afraid of it, that she was afraid of getting better because she would have to do uncomfortable things for it (i.e. things outside her comfort zone). She cried and agreed, which felt like a major breakthrough even though it didn't change anything. So she sabotages herself in lots of ways. Like, recently we tried triple chronotherapy, a 4 day treatment for depression which involves resetting your circadian rhythm with a SAD light daily, restricting your sleep, and going to bed and getting up at prescribed times. I did it along with her. She was hopeful about it before we started, although also worried and said she was anxious that if she got better she would have to do things. It went great the first two days, but on the third day she intentionally stayed up past the prescribed sleep time so that the whole things was ruined.\n\nSo, here we are. My daughter is depressed, anxious almost beyond belief, and refuses or sabotages anything that could possibly help. What can I do? How can I help her with this?\n\nI posted this on r/parenting, and their general consensus seems to be a) tough love b) involuntary commitment, c) physically forcing her to appointments. None of that really feels like it would work (and might make it worse!), but I don't know what to do.", "likes": null, "suggested_sort": "new", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65hjjs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 33, "report_reasons": null, "author": "SimpleMcflea", "saved": false, "mod_reports": [], "name": "t3_65hjjs", "subreddit_name_prefixed": "r/depression", "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qqqf", "edited": 1492235898.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/depression/comments/65hjjs/teenage_daughter_has_depression_and_anxiety_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492262672.0, "url": "https://www.reddit.com/r/depression/comments/65hjjs/teenage_daughter_has_depression_and_anxiety_and/", "author_flair_text": null, "quarantine": false, "title": "Teenage daughter has depression and anxiety and refuses help", "created_utc": 1492233872.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 33}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": "", "user_reports": [], "id": "dgb3q5a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pop9181", "parent_id": "t3_65hjjs", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Hey man. I don't have any real advice for you because I'm not a dad in any way. But. Have you tried finding something you two like together? Also I just wanted to tell you that you sound like your doing a great job. I had a friend get kicked out of her house due to her mental breakdowns but you seem like a fantastic parent who's taking care of her well. Keep it up!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man. I don&amp;#39;t have any real advice for you because I&amp;#39;m not a dad in any way. But. Have you tried finding something you two like together? Also I just wanted to tell you that you sound like your doing a great job. I had a friend get kicked out of her house due to her mental breakdowns but you seem like a fantastic parent who&amp;#39;s taking care of her well. Keep it up!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgb3q5a", "score_hidden": false, "stickied": false, "created": 1492315603.0, "created_utc": 1492286803.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": "", "user_reports": [], "id": "dgb1t5r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jamoz330", "parent_id": "t3_65hjjs", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Heya, firstly thank you for being awesome and caring, secondly what she is going through cannot be understood by defining it as depression, it will haunt her and stay with her for the rest of her life. But there is always hope. Remember that. Always fight till the bitter end for her.\n\nNow I have one question, have you checked her for learning difficulties? If not she might be in the exact same position I am in. Pm me if you haven't. I understand privacy is an issue.", "edited": 1492284496.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Heya, firstly thank you for being awesome and caring, secondly what she is going through cannot be understood by defining it as depression, it will haunt her and stay with her for the rest of her life. But there is always hope. Remember that. Always fight till the bitter end for her.&lt;/p&gt;\n\n&lt;p&gt;Now I have one question, have you checked her for learning difficulties? If not she might be in the exact same position I am in. Pm me if you haven&amp;#39;t. I understand privacy is an issue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgb1t5r", "score_hidden": false, "stickied": false, "created": 1492313004.0, "created_utc": 1492284204.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": "", "user_reports": [], "id": "dgak8h4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "xX_SuperSic58_Xx", "parent_id": "t3_65hjjs", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I have a good doctor. He's got me on a 3 pronged approach: exercise, therapy, medication.\n\nSounds to me your daughter has strong social phobia that is only going to be resolved through therapy. Be supportive but not forcing and know that you can't do anything to help your daughter besides leading a horse to water. That's a tough pill for a loved one who only wants to help to swallow, but that's what it is. Your daughter has to find the will to help herself and that could take years or not even happen at all.\n\nEncourage her to join support groups online, they can be very beneficial.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a good doctor. He&amp;#39;s got me on a 3 pronged approach: exercise, therapy, medication.&lt;/p&gt;\n\n&lt;p&gt;Sounds to me your daughter has strong social phobia that is only going to be resolved through therapy. Be supportive but not forcing and know that you can&amp;#39;t do anything to help your daughter besides leading a horse to water. That&amp;#39;s a tough pill for a loved one who only wants to help to swallow, but that&amp;#39;s what it is. Your daughter has to find the will to help herself and that could take years or not even happen at all.&lt;/p&gt;\n\n&lt;p&gt;Encourage her to join support groups online, they can be very beneficial.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgak8h4", "score_hidden": false, "stickied": false, "created": 1492285367.0, "created_utc": 1492256567.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": "", "user_reports": [], "id": "dgbqjmy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dgahd7z", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "It does seem really shitty for her. Sometimes she's just laying in bed, and I know she's thinking what a terrible person she is. Her slide into this seems soooo gradual, and she's always been anxious to some degree, so it's hard to identify any one cause. I've never thought to talk about it, though, maybe she will have more of an idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It does seem really shitty for her. Sometimes she&amp;#39;s just laying in bed, and I know she&amp;#39;s thinking what a terrible person she is. Her slide into this seems soooo gradual, and she&amp;#39;s always been anxious to some degree, so it&amp;#39;s hard to identify any one cause. I&amp;#39;ve never thought to talk about it, though, maybe she will have more of an idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgbqjmy", "score_hidden": false, "stickied": false, "created": 1492349466.0, "created_utc": 1492320666.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgahd7z", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "EternalJanus", "parent_id": "t3_65hjjs", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I am guy in my late 20s. From personal experience anxiety fueled depression is absolute hell. Her actions other than self harm mirror my own at my worse. My trigger was a financial mistake that could've ruined my life. Her trigger seems to be associated with school? What helped me was an eventual resolution of my mistake. It's kind of hard to say what her resolution might be. Even then it probably won't fix her but at least give her some hope.\n\nUnless someone is in imminent danger to themselves or others forcing them to do anything will only lead to mistrust and resentment. I say this from personal experience. Even a threat of force led to panic attacks.\n\nIt would be beneficial to identify exactly how she arrived to her current state. You can then see if there is something you could do to make the situation better. Though the goal would be to convince her to see a therapist again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am guy in my late 20s. From personal experience anxiety fueled depression is absolute hell. Her actions other than self harm mirror my own at my worse. My trigger was a financial mistake that could&amp;#39;ve ruined my life. Her trigger seems to be associated with school? What helped me was an eventual resolution of my mistake. It&amp;#39;s kind of hard to say what her resolution might be. Even then it probably won&amp;#39;t fix her but at least give her some hope.&lt;/p&gt;\n\n&lt;p&gt;Unless someone is in imminent danger to themselves or others forcing them to do anything will only lead to mistrust and resentment. I say this from personal experience. Even a threat of force led to panic attacks.&lt;/p&gt;\n\n&lt;p&gt;It would be beneficial to identify exactly how she arrived to her current state. You can then see if there is something you could do to make the situation better. Though the goal would be to convince her to see a therapist again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgahd7z", "score_hidden": false, "stickied": false, "created": 1492276491.0, "created_utc": 1492247691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": "", "user_reports": [], "id": "dgbq4ob", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dgafny9", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Thanks, guys. I'm pretty amazed by the support in this sub!\n\nIt helps that my brother has been depressed, and I had anxiety as a teenager, so I know a lot about what it's like. Even so, it's very difficult to be supportive of her sometimes, when she's not doing anything to help herself. Sometimes she makes me really angry, I just want to shake some sense into her. But I remember her from just a couple of years ago, when she didn't have these problems, and I know that nobody would make a choice to change from how she was then to how she is now; I know it's not her fault. As long as there's any kind of hope for her to feel better, we won't stop.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, guys. I&amp;#39;m pretty amazed by the support in this sub!&lt;/p&gt;\n\n&lt;p&gt;It helps that my brother has been depressed, and I had anxiety as a teenager, so I know a lot about what it&amp;#39;s like. Even so, it&amp;#39;s very difficult to be supportive of her sometimes, when she&amp;#39;s not doing anything to help herself. Sometimes she makes me really angry, I just want to shake some sense into her. But I remember her from just a couple of years ago, when she didn&amp;#39;t have these problems, and I know that nobody would make a choice to change from how she was then to how she is now; I know it&amp;#39;s not her fault. As long as there&amp;#39;s any kind of hope for her to feel better, we won&amp;#39;t stop.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgbq4ob", "score_hidden": false, "stickied": false, "created": 1492348667.0, "created_utc": 1492319867.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": "", "user_reports": [], "id": "dgarzy2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bluepineleaf", "parent_id": "t1_dgafny9", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Yep, I think of the years I spent not getting help because I was too young and my parents just didn't understand that I needed it. She's so lucky to have you, OP. You guys will get through this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, I think of the years I spent not getting help because I was too young and my parents just didn&amp;#39;t understand that I needed it. She&amp;#39;s so lucky to have you, OP. You guys will get through this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgarzy2", "score_hidden": false, "stickied": false, "created": 1492299565.0, "created_utc": 1492270765.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": "", "user_reports": [], "id": "dgalbut", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mytwocats11", "parent_id": "t1_dgafny9", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I third it. I tried to tell my folks something was wrong several times (and at one point they couldn't deny it...I attempted suicide) and they told me nothing was wrong with me. I wish I'd had parents like you...you obviously care. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I third it. I tried to tell my folks something was wrong several times (and at one point they couldn&amp;#39;t deny it...I attempted suicide) and they told me nothing was wrong with me. I wish I&amp;#39;d had parents like you...you obviously care. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgalbut", "score_hidden": false, "stickied": false, "created": 1492288097.0, "created_utc": 1492259297.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": "", "user_reports": [], "id": "dgag63i", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "mynormalheart", "parent_id": "t1_dgafny9", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I second this. What an amazing parent you are, OP", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I second this. What an amazing parent you are, OP&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgag63i", "score_hidden": false, "stickied": false, "created": 1492272777.0, "created_utc": 1492243977.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgafny9", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "aheliya", "parent_id": "t3_65hjjs", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I wish I my parents cared and understood like you do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I my parents cared and understood like you do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgafny9", "score_hidden": false, "stickied": false, "created": 1492271354.0, "created_utc": 1492242554.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": "", "user_reports": [], "id": "dgbqh0p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dgadf44", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I was similar as a kid, with anxiety (not as bad as it is with my daughter). I was homeschooled, actually, so I had very little reason to leave the house. I had no friends, and poor social skills, and it wasn't until my mid-20s that things got better.\n\nI agree with you on all of that, and she does too. Depending on her mood, she'll eat healthily, go out for a walk in the sun, stay off Facebook. But then, she'll say she doesn't deserve to live, that there's no point in eating healthily, etc. We recently bought her two rats, and they do seem to help some. For the first week she was saying it was an awful idea, and two days in she said she was giving up on them and to take them back because one of them bit her and she said neither of them liked her because she wasn't a good rat owner. But after a couple months, she's getting a lot of enjoyment out of them. Every day she plays with them, and she's got enough confidence now that she can walk around the house with one on her shoulder.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was similar as a kid, with anxiety (not as bad as it is with my daughter). I was homeschooled, actually, so I had very little reason to leave the house. I had no friends, and poor social skills, and it wasn&amp;#39;t until my mid-20s that things got better.&lt;/p&gt;\n\n&lt;p&gt;I agree with you on all of that, and she does too. Depending on her mood, she&amp;#39;ll eat healthily, go out for a walk in the sun, stay off Facebook. But then, she&amp;#39;ll say she doesn&amp;#39;t deserve to live, that there&amp;#39;s no point in eating healthily, etc. We recently bought her two rats, and they do seem to help some. For the first week she was saying it was an awful idea, and two days in she said she was giving up on them and to take them back because one of them bit her and she said neither of them liked her because she wasn&amp;#39;t a good rat owner. But after a couple months, she&amp;#39;s getting a lot of enjoyment out of them. Every day she plays with them, and she&amp;#39;s got enough confidence now that she can walk around the house with one on her shoulder.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgbqh0p", "score_hidden": false, "stickied": false, "created": 1492349322.0, "created_utc": 1492320522.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgadf44", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Stoictrader", "parent_id": "t3_65hjjs", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I'm a 25 year old guy without kids, so my situation is a bit different. But I can see similarities between what you wrote, and my life over the last 10 years. You obviously put alot of effort into writing that, so I didn't want to leave without commenting. So here is what I came up with. 1. Ive found that social media can make depression worse. 2. a healthy diet is important. Eating to much junk food makes you feel sick, and leads to acne which causes self image problems in teens. 3. Sun, exercise, nature and animals, are always good for mood 4. Guided meditations on youtube. I still use these for anxiety. They really help for temporary relief. 5. Really push her to get out and do things. Sounds like you are, but my Mom was ok with me never leaving, and staying home from school. So as an introvert, I never left and this hurt me down the line.     ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a 25 year old guy without kids, so my situation is a bit different. But I can see similarities between what you wrote, and my life over the last 10 years. You obviously put alot of effort into writing that, so I didn&amp;#39;t want to leave without commenting. So here is what I came up with. 1. Ive found that social media can make depression worse. 2. a healthy diet is important. Eating to much junk food makes you feel sick, and leads to acne which causes self image problems in teens. 3. Sun, exercise, nature and animals, are always good for mood 4. Guided meditations on youtube. I still use these for anxiety. They really help for temporary relief. 5. Really push her to get out and do things. Sounds like you are, but my Mom was ok with me never leaving, and staying home from school. So as an introvert, I never left and this hurt me down the line.     &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgadf44", "score_hidden": false, "stickied": false, "created": 1492265730.0, "created_utc": 1492236930.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65hjjs", "likes": null, "replies": "", "user_reports": [], "id": "dgbqaoj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dgact17", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Thanks for your reply. This is what me and my wife have been discussing just today. There's only so much help we can personally give, we're not trained for this, we don't have the skills. We're going to tell her that she absolutely must have treatment, and she can choose things about it like having a say in which therapist she has, helping to decide about medications, choosing what she does at home to work towards it, etc. or if she still refuses, we're going to get professionals involved more, and she's still going to get treatment, even it it involves people coming here for it, or them taking her somewhere else, and she'll have less choice about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your reply. This is what me and my wife have been discussing just today. There&amp;#39;s only so much help we can personally give, we&amp;#39;re not trained for this, we don&amp;#39;t have the skills. We&amp;#39;re going to tell her that she absolutely must have treatment, and she can choose things about it like having a say in which therapist she has, helping to decide about medications, choosing what she does at home to work towards it, etc. or if she still refuses, we&amp;#39;re going to get professionals involved more, and she&amp;#39;s still going to get treatment, even it it involves people coming here for it, or them taking her somewhere else, and she&amp;#39;ll have less choice about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgbqaoj", "score_hidden": false, "stickied": false, "created": 1492348984.0, "created_utc": 1492320184.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgact17", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "anonymouseightyseven", "parent_id": "t3_65hjjs", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "Ooh that's a tough one. \nI'm not a parent BUT I've been a daughter with depression. \nFirst I want to tell you how strong you are for being proactive with your daughter. She is lucky to have you. \nShe needs some help you aren't going to be able to provide her, no parenting tips are going to fix this. I watched my parents wear themselves out trying to help me but bc they aren't mental health professionals they couldn't give me what I needed. So please don't expect to be able to. That's an unrealistic expectation that will only hurt you. \n\nExplain to her, very frankly, that you love her and have tried everything you can but you want what's best for her so she can have a happy life. \nAsk what she thinks would help her. \nIf she's willing to try and make a plan with you then give it a shot. Tell her this is serious, that if she can't or isn't willing to try anything at home that you guys will have to get her in a setting where professionals will help her. (If that's what you decide to do)\n\nI'm not a mental health professional by any means. I'm merely sharing my opinion as someone on the other side. \nIf she's suicidal, that doesn't go away. It just doesn't. \nDon't let her tell you it does. \n\nYou are apparently a wonderful and loving parent. Please remember to also take care of yourself. \nI wish you both the best. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ooh that&amp;#39;s a tough one. \nI&amp;#39;m not a parent BUT I&amp;#39;ve been a daughter with depression. \nFirst I want to tell you how strong you are for being proactive with your daughter. She is lucky to have you. \nShe needs some help you aren&amp;#39;t going to be able to provide her, no parenting tips are going to fix this. I watched my parents wear themselves out trying to help me but bc they aren&amp;#39;t mental health professionals they couldn&amp;#39;t give me what I needed. So please don&amp;#39;t expect to be able to. That&amp;#39;s an unrealistic expectation that will only hurt you. &lt;/p&gt;\n\n&lt;p&gt;Explain to her, very frankly, that you love her and have tried everything you can but you want what&amp;#39;s best for her so she can have a happy life. \nAsk what she thinks would help her. \nIf she&amp;#39;s willing to try and make a plan with you then give it a shot. Tell her this is serious, that if she can&amp;#39;t or isn&amp;#39;t willing to try anything at home that you guys will have to get her in a setting where professionals will help her. (If that&amp;#39;s what you decide to do)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a mental health professional by any means. I&amp;#39;m merely sharing my opinion as someone on the other side. \nIf she&amp;#39;s suicidal, that doesn&amp;#39;t go away. It just doesn&amp;#39;t. \nDon&amp;#39;t let her tell you it does. &lt;/p&gt;\n\n&lt;p&gt;You are apparently a wonderful and loving parent. Please remember to also take care of yourself. \nI wish you both the best. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgact17", "score_hidden": false, "stickied": false, "created": 1492264387.0, "created_utc": 1492235587.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}]