[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Been suffering thru a bad down turn in my depression for the past 6 months. Hadn&amp;#39;t seen my friends or have been anywhere near social for well over a month and a half. But last night was a dear friend&amp;#39;s 30th and I knew all my close friends that I&amp;#39;ve been missing would also be there. I didn&amp;#39;t wanna miss it and was looking forward to seeing everyone and feeling connected with my loved ones again. In sharing life&amp;#39;s moments. After the day being pretty productive and balanced, I thought I was up to it. &lt;/p&gt;\n\n&lt;p&gt;I lasted 30 min. &lt;/p&gt;\n\n&lt;p&gt;I felt so disassociated from the second I arrived. I had three conversations that felt like they were happening to someone else. Like I was a ghost driving a shell. A distant observer watching it unfold. Actively creating the mask as I wore it, hoping I was getting the reactions and emotions right. Each of those conversations ending abruptly. The other party excusing themselves, to disappear into the party. Anywhere else in the party. Each time it felt like it left behind a bigger and bigger gap between me and everyone else. Then the yelling in my head started and got   loud, super loud, super fast. The voice that lies was all I could hear. &amp;quot;What are you even doing here&amp;quot; &amp;quot;No body wants to be around you&amp;quot; &amp;quot;No body cares&amp;quot; &amp;quot;If they cared they would have reached out to you by now&amp;quot; &amp;quot;You shouldn&amp;#39;t be here&amp;quot; &amp;quot;Why are you even here&amp;quot; &amp;quot;See how they&amp;#39;re all avoiding you&amp;quot; &amp;quot;No body actually wants you here&amp;quot; and so on and so on. Locked in the bathroom my breathing exercises weren&amp;#39;t accomplishing anything and I was spiraling. I couldn&amp;#39;t do it it.&lt;/p&gt;\n\n&lt;p&gt;I broke and bolted for the door. &lt;/p&gt;\n\n&lt;p&gt;I spoke to no one. &lt;/p&gt;\n\n&lt;p&gt;Keep it painless. Avoid questions.&lt;/p&gt;\n\n&lt;p&gt;My friend managed to locked I eyes with me as I squeezed out the back. He looked at me quizically. I tried meekly to smile something reassuring but worry flashed across his brow anyways. I picked up the pace. I kept to a walk trying not to draw anymore attention to myself but moved as fast as I could hustle. My legs wanted to run. Everything wanted to run.&lt;/p&gt;\n\n&lt;p&gt;At home I cried, uncontrollably, for hours. I cried and dangerous thoughts took center stage, entertaining themselves. Nothing that usually worked was. Not the beer, not the weed, not the sugar, not the exercise. So I wrote this out instead. And it seems to have gotten my hand back on the helm. \nSo thank you. For listening. And for being here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Been suffering thru a bad down turn in my depression for the past 6 months. Hadn't seen my friends or have been anywhere near social for well over a month and a half. But last night was a dear friend's 30th and I knew all my close friends that I've been missing would also be there. I didn't wanna miss it and was looking forward to seeing everyone and feeling connected with my loved ones again. In sharing life's moments. After the day being pretty productive and balanced, I thought I was up to it. \n\nI lasted 30 min. \n\nI felt so disassociated from the second I arrived. I had three conversations that felt like they were happening to someone else. Like I was a ghost driving a shell. A distant observer watching it unfold. Actively creating the mask as I wore it, hoping I was getting the reactions and emotions right. Each of those conversations ending abruptly. The other party excusing themselves, to disappear into the party. Anywhere else in the party. Each time it felt like it left behind a bigger and bigger gap between me and everyone else. Then the yelling in my head started and got   loud, super loud, super fast. The voice that lies was all I could hear. \"What are you even doing here\" \"No body wants to be around you\" \"No body cares\" \"If they cared they would have reached out to you by now\" \"You shouldn't be here\" \"Why are you even here\" \"See how they're all avoiding you\" \"No body actually wants you here\" and so on and so on. Locked in the bathroom my breathing exercises weren't accomplishing anything and I was spiraling. I couldn't do it it.\n\nI broke and bolted for the door. \n\nI spoke to no one. \n\nKeep it painless. Avoid questions.\n\nMy friend managed to locked I eyes with me as I squeezed out the back. He looked at me quizically. I tried meekly to smile something reassuring but worry flashed across his brow anyways. I picked up the pace. I kept to a walk trying not to draw anymore attention to myself but moved as fast as I could hustle. My legs wanted to run. Everything wanted to run.\n\nAt home I cried, uncontrollably, for hours. I cried and dangerous thoughts took center stage, entertaining themselves. Nothing that usually worked was. Not the beer, not the weed, not the sugar, not the exercise. So I wrote this out instead. And it seems to have gotten my hand back on the helm. \nSo thank you. For listening. And for being here.", "likes": null, "suggested_sort": "new", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65onqo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 38, "report_reasons": null, "author": "MissTuesdayV", "saved": false, "mod_reports": [], "name": "t3_65onqo", "subreddit_name_prefixed": "r/depression", "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qqqf", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/depression/comments/65onqo/bolted_from_the_party/", "num_reports": null, "locked": false, "stickied": false, "created": 1492370542.0, "url": "https://www.reddit.com/r/depression/comments/65onqo/bolted_from_the_party/", "author_flair_text": null, "quarantine": false, "title": "Bolted from the party.", "created_utc": 1492341742.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 38}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65onqo", "likes": null, "replies": "", "user_reports": [], "id": "dgcvde0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bonesteel50", "parent_id": "t3_65onqo", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I spent the whole day with all the people I love. Literally all of them. Still miserable! haha Life is just dumb like that sometimes man. Spend weeks seeing nobody, actually see people and you can't help but wanting to be alone again! Ahh depression.\n\nYou're not alone!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I spent the whole day with all the people I love. Literally all of them. Still miserable! haha Life is just dumb like that sometimes man. Spend weeks seeing nobody, actually see people and you can&amp;#39;t help but wanting to be alone again! Ahh depression.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re not alone!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgcvde0", "score_hidden": false, "stickied": false, "created": 1492419875.0, "created_utc": 1492391075.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65onqo", "likes": null, "replies": "", "user_reports": [], "id": "dgcr1ve", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hilbertastronaut", "parent_id": "t3_65onqo", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "i'm glad you wrote this out and that it helped.  i know it seems weird to say this, but it sounds like you did the right thing.  you were having a panic attack, and you held it together long enough to get out of there and get some breathing room.  i've felt that way before -- like everything is fake and everybody hates me and why am i doing this stupid thing? etc.  it's really hard to hold yourself together and keep going through those feelings.  usually the best i can do is pretend for a little while, then get myself out of there.  so i get it :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i&amp;#39;m glad you wrote this out and that it helped.  i know it seems weird to say this, but it sounds like you did the right thing.  you were having a panic attack, and you held it together long enough to get out of there and get some breathing room.  i&amp;#39;ve felt that way before -- like everything is fake and everybody hates me and why am i doing this stupid thing? etc.  it&amp;#39;s really hard to hold yourself together and keep going through those feelings.  usually the best i can do is pretend for a little while, then get myself out of there.  so i get it :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgcr1ve", "score_hidden": false, "stickied": false, "created": 1492414060.0, "created_utc": 1492385260.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65onqo", "likes": null, "replies": "", "user_reports": [], "id": "dgcb7z5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mytwocats11", "parent_id": "t3_65onqo", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I'm glad writing this out helped. I know how dark things can get sometimes\n\nI haven't been to any parties lately but any social gathering has been pretty bad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad writing this out helped. I know how dark things can get sometimes&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t been to any parties lately but any social gathering has been pretty bad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgcb7z5", "score_hidden": false, "stickied": false, "created": 1492393057.0, "created_utc": 1492364257.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65onqo", "likes": null, "replies": "", "user_reports": [], "id": "dgc5uc4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ypmr", "parent_id": "t3_65onqo", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I had to leave a party last night aswell. I thought I was in an OK mood, nothing particular was bothering me, but when I got to the party where there were mostly close friends and acquaintances, I just couldn't keep up a conversation without being overrun by negative thoughts. I couldn't concentrate, it was impossible to be engaged when I talked to people. I just wanted to cry tbh, but there was no place to hide, so I told two people that I wasn't feeling well and then I left. I cried all the way home, but weed helped calm me down when I got home. I felt really bad this morning though. \nI think its important to let my friends know that I'm having trouble with anxiety and depression. I don't like to talk about it because I don't want to be a bother, but I think its important that they know that when I leave early and seem uninterested its because of me, not them... And I guess that even though I don't talk to anyone about my thoughts and feelings, just knowing that they know that I have depression and anxiety feels a bit comforting. So if you haven't opened up to your friends I would consider doing that, it might help and most people know what its like to feel bad even though they're not suffering from mental illness =) \n\nStay strong and keep going! It's so fucking hard to fight the negative thoughts but I hope you pull through and that things lightens up a bit for you soon, they usually do for me after a couple of days and I can at least keep my head above water until next bout arrives.\n\nI wish you all the best! And don't feel bad that you only managed 3 convos and then had to leave, be proud that you showed up and that you tried your best, and then you respected your boundaries and went home, and eventually found a way to cope that worked for you which is great! I really hope you feel better soon, don't give up. Try to remember that things have been better before (even though its very easy to forget when you're depressed, but my experience at least is that I do have good memories too, they're just hard to recollect) and they can and most probably will get better again. &lt;3\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had to leave a party last night aswell. I thought I was in an OK mood, nothing particular was bothering me, but when I got to the party where there were mostly close friends and acquaintances, I just couldn&amp;#39;t keep up a conversation without being overrun by negative thoughts. I couldn&amp;#39;t concentrate, it was impossible to be engaged when I talked to people. I just wanted to cry tbh, but there was no place to hide, so I told two people that I wasn&amp;#39;t feeling well and then I left. I cried all the way home, but weed helped calm me down when I got home. I felt really bad this morning though. \nI think its important to let my friends know that I&amp;#39;m having trouble with anxiety and depression. I don&amp;#39;t like to talk about it because I don&amp;#39;t want to be a bother, but I think its important that they know that when I leave early and seem uninterested its because of me, not them... And I guess that even though I don&amp;#39;t talk to anyone about my thoughts and feelings, just knowing that they know that I have depression and anxiety feels a bit comforting. So if you haven&amp;#39;t opened up to your friends I would consider doing that, it might help and most people know what its like to feel bad even though they&amp;#39;re not suffering from mental illness =) &lt;/p&gt;\n\n&lt;p&gt;Stay strong and keep going! It&amp;#39;s so fucking hard to fight the negative thoughts but I hope you pull through and that things lightens up a bit for you soon, they usually do for me after a couple of days and I can at least keep my head above water until next bout arrives.&lt;/p&gt;\n\n&lt;p&gt;I wish you all the best! And don&amp;#39;t feel bad that you only managed 3 convos and then had to leave, be proud that you showed up and that you tried your best, and then you respected your boundaries and went home, and eventually found a way to cope that worked for you which is great! I really hope you feel better soon, don&amp;#39;t give up. Try to remember that things have been better before (even though its very easy to forget when you&amp;#39;re depressed, but my experience at least is that I do have good memories too, they&amp;#39;re just hard to recollect) and they can and most probably will get better again. &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgc5uc4", "score_hidden": false, "stickied": false, "created": 1492385924.0, "created_utc": 1492357124.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "removal_reason": null, "link_id": "t3_65onqo", "likes": null, "replies": "", "user_reports": [], "id": "dgby2lv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "euphoria2080", "parent_id": "t3_65onqo", "subreddit_name_prefixed": "r/depression", "controversiality": 0, "body": "I'm here &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m here &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "depression", "name": "t1_dgby2lv", "score_hidden": false, "stickied": false, "created": 1492371515.0, "created_utc": 1492342715.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]