[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Paleo", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just finished reading yet anther &amp;quot;no-comments&amp;quot; attack on the paleo diet, and feel like I have to vent somewhere (so here I am).  It seems like there&amp;#39;s been at least one article every few weeks for the last several months regurgitating a years-old clickbait straw-man.&lt;/p&gt;\n\n&lt;p&gt;They all focus entirely on tearing down the idea that there is no one &amp;quot;paleo&amp;quot; diet, but completely miss the underlying principles of the movement.  IIRC even the very first book I read on the subject covered that base, and anyone with half a brain can realize that without needing a doctorate in the subject.  These articles come even from very reputable sources, too.  You&amp;#39;d think these people would be above such disgenuine tactics.&lt;/p&gt;\n\n&lt;p&gt;They get one study finding that one group of pre-agricultural humans ate uncultivated grains and use it to &amp;quot;validate&amp;quot; a full-scale attack on the diet in mainstream media.  This is senseless, as wild grains are nothing like bread or cereal, and starchy tubers are a world apart from refined sugar.  Paleo is about shooting for the middle of that bell curve of what would most-likely have existed in nature for most of our ancestors to eat for most of pre-neolithic human history.  Bread, pasta, sugar, and seed oils are quite far-removed from this ideal.  &amp;quot;Natural is better&amp;quot; is absolutely a fallacy, but I believe the burden of proof still lies with those advocating for &amp;quot;unnatural&amp;quot; foods, if the burden lies anywhere.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll be the first to tell you that many proponents are way off in their ratios (far too much meat, way too many nuts, not enough veggies), but that doesn&amp;#39;t counter the principles themselves.  Some blame for the pop hype of the diet belongs squarely with the medical community for producing such unreliable findings for so long (just search for studies on the reproducibility crisis, yes I see the irony).  When people are told to buy food with whole grains and vegetables for their dogs and cats (carnivores and &lt;em&gt;obligate&lt;/em&gt; carnivores), you know there&amp;#39;s a problem.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s been a few years since I&amp;#39;ve been very strict in my paleo ways, but it absolutely helped me when I had terrible allergies and persistent acne issues.  For as long as I can remember before the diet I had to be on full-strength benadryl almhst constantly except for during winter.  My allergies got even worse when I tried to incorporate more whole grains into my diet - shortly before finding the paleo diet.  But within my first year of following paleo I no longer had to take anything for allergies (I still don&amp;#39;t, but even as a big cheater I don&amp;#39;t eat sugar or grains if I can avoid them).  My skin has never been clearer than when I was strict paleo (and with no nuts).&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s my rant.  Let me know what you think ;P&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just finished reading yet anther \"no-comments\" attack on the paleo diet, and feel like I have to vent somewhere (so here I am).  It seems like there's been at least one article every few weeks for the last several months regurgitating a years-old clickbait straw-man.\n\nThey all focus entirely on tearing down the idea that there is no one \"paleo\" diet, but completely miss the underlying principles of the movement.  IIRC even the very first book I read on the subject covered that base, and anyone with half a brain can realize that without needing a doctorate in the subject.  These articles come even from very reputable sources, too.  You'd think these people would be above such disgenuine tactics.\n\nThey get one study finding that one group of pre-agricultural humans ate uncultivated grains and use it to \"validate\" a full-scale attack on the diet in mainstream media.  This is senseless, as wild grains are nothing like bread or cereal, and starchy tubers are a world apart from refined sugar.  Paleo is about shooting for the middle of that bell curve of what would most-likely have existed in nature for most of our ancestors to eat for most of pre-neolithic human history.  Bread, pasta, sugar, and seed oils are quite far-removed from this ideal.  \"Natural is better\" is absolutely a fallacy, but I believe the burden of proof still lies with those advocating for \"unnatural\" foods, if the burden lies anywhere.\n\nI'll be the first to tell you that many proponents are way off in their ratios (far too much meat, way too many nuts, not enough veggies), but that doesn't counter the principles themselves.  Some blame for the pop hype of the diet belongs squarely with the medical community for producing such unreliable findings for so long (just search for studies on the reproducibility crisis, yes I see the irony).  When people are told to buy food with whole grains and vegetables for their dogs and cats (carnivores and *obligate* carnivores), you know there's a problem.\n\nIt's been a few years since I've been very strict in my paleo ways, but it absolutely helped me when I had terrible allergies and persistent acne issues.  For as long as I can remember before the diet I had to be on full-strength benadryl almhst constantly except for during winter.  My allergies got even worse when I tried to incorporate more whole grains into my diet - shortly before finding the paleo diet.  But within my first year of following paleo I no longer had to take anything for allergies (I still don't, but even as a big cheater I don't eat sugar or grains if I can avoid them).  My skin has never been clearer than when I was strict paleo (and with no nuts).\n\nThere's my rant.  Let me know what you think ;P", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "660hxx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 31, "report_reasons": null, "author": "DoktoroKiu", "saved": false, "mod_reports": [], "name": "t3_660hxx", "subreddit_name_prefixed": "r/Paleo", "approved_by": null, "over_18": false, "domain": "self.Paleo", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qzzs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Paleo/comments/660hxx/discussionwhats_up_with_all_of_the_recent_attacks/", "num_reports": null, "locked": false, "stickied": false, "created": 1492515572.0, "url": "https://www.reddit.com/r/Paleo/comments/660hxx/discussionwhats_up_with_all_of_the_recent_attacks/", "author_flair_text": null, "quarantine": false, "title": "[Discussion]What's up with all of the recent attacks on Paleo?", "created_utc": 1492486772.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 31}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzzs", "removal_reason": null, "link_id": "t3_660hxx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzzs", "removal_reason": null, "link_id": "t3_660hxx", "likes": null, "replies": "", "user_reports": [], "id": "dgf0v8w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DoktoroKiu", "parent_id": "t1_dgesnvt", "subreddit_name_prefixed": "r/Paleo", "controversiality": 0, "body": "Yeah, I can see that being a large part of it, but you'd think an academic would evaluate the arguments put forward in the various books instead of looking at pop recipes in food blogs.  It sucks for those just starting out for sure, because it's very easy to fall into the \"well, it isn't un-paleo\" rut where you're not eating any forbidden ingredients, but are far from actually following the diet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I can see that being a large part of it, but you&amp;#39;d think an academic would evaluate the arguments put forward in the various books instead of looking at pop recipes in food blogs.  It sucks for those just starting out for sure, because it&amp;#39;s very easy to fall into the &amp;quot;well, it isn&amp;#39;t un-paleo&amp;quot; rut where you&amp;#39;re not eating any forbidden ingredients, but are far from actually following the diet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paleo", "name": "t1_dgf0v8w", "score_hidden": false, "stickied": false, "created": 1492546818.0, "created_utc": 1492518018.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgesnvt", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "FiveMagicBeans", "parent_id": "t3_660hxx", "subreddit_name_prefixed": "r/Paleo", "controversiality": 0, "body": "*Paleo is about shooting for the middle of that bell curve of what would most-likely have existed in nature for most of our ancestors to eat for most of pre-neolithic human history.*\n\nI feel the need to point out here that a massive number of the \"paleo\" recipes that I see posted throughout the internet and here on the subreddit don't come anywhere close to what neolithic man may have eaten.\n\nProcessed extracts, nut flours, giant servings of starches, sugar substitutes...\n\nYou have to take all of that into consideration when you're looking at paleo's reputation. I think that if people would stop desperately trying to find an acceptable way to stuff their face with enormous servings of garbage that's slightly better than the garbage they ate last year, it would do wonders for their overall health. A lot of people try paleo and then fail miserably because their health jumps all over the place and they came into the game expecting some sort of silver bullet that would allow them to eat like pigs and be healthy... it doesn't work like that, it requires real changes and effort to be successful long term.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Paleo is about shooting for the middle of that bell curve of what would most-likely have existed in nature for most of our ancestors to eat for most of pre-neolithic human history.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I feel the need to point out here that a massive number of the &amp;quot;paleo&amp;quot; recipes that I see posted throughout the internet and here on the subreddit don&amp;#39;t come anywhere close to what neolithic man may have eaten.&lt;/p&gt;\n\n&lt;p&gt;Processed extracts, nut flours, giant servings of starches, sugar substitutes...&lt;/p&gt;\n\n&lt;p&gt;You have to take all of that into consideration when you&amp;#39;re looking at paleo&amp;#39;s reputation. I think that if people would stop desperately trying to find an acceptable way to stuff their face with enormous servings of garbage that&amp;#39;s slightly better than the garbage they ate last year, it would do wonders for their overall health. A lot of people try paleo and then fail miserably because their health jumps all over the place and they came into the game expecting some sort of silver bullet that would allow them to eat like pigs and be healthy... it doesn&amp;#39;t work like that, it requires real changes and effort to be successful long term.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paleo", "name": "t1_dgesnvt", "score_hidden": false, "stickied": false, "created": 1492524860.0, "created_utc": 1492496060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzzs", "removal_reason": null, "link_id": "t3_660hxx", "likes": null, "replies": "", "user_reports": [], "id": "dgeuiod", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Morterius", "parent_id": "t3_660hxx", "subreddit_name_prefixed": "r/Paleo", "controversiality": 0, "body": "Bacause \"paleo\" is a shtick that was made to sell books, there is no \"paleolithic diet\" and the paleolithic man certainly didn't eat factory-farmed meat from overfed and overdrugged animals and didn't cook it with processed fats. It should've been called the \"cut the processed crap\" diet, not \"paleo\". I do get the pushback of unnecesary vilification of omega-3 rich fats, but fats are still hard to come-by in nature, game is lean, eggs are very rare, oils and butter doesn't exist. That's why even little fat is enough and it can still be problematic if eaten too much. Also, paleo as it is, is ecologically unsustainable diet. So far the poorer parts of the world are still very starch-based (and not very fat, or acne ridden, mind you), but as wealth and appetite for meat increases in places like China and India, we're coming to a breaking point of already terrible and ecologically damaging animal welfare system in an age of climate change. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bacause &amp;quot;paleo&amp;quot; is a shtick that was made to sell books, there is no &amp;quot;paleolithic diet&amp;quot; and the paleolithic man certainly didn&amp;#39;t eat factory-farmed meat from overfed and overdrugged animals and didn&amp;#39;t cook it with processed fats. It should&amp;#39;ve been called the &amp;quot;cut the processed crap&amp;quot; diet, not &amp;quot;paleo&amp;quot;. I do get the pushback of unnecesary vilification of omega-3 rich fats, but fats are still hard to come-by in nature, game is lean, eggs are very rare, oils and butter doesn&amp;#39;t exist. That&amp;#39;s why even little fat is enough and it can still be problematic if eaten too much. Also, paleo as it is, is ecologically unsustainable diet. So far the poorer parts of the world are still very starch-based (and not very fat, or acne ridden, mind you), but as wealth and appetite for meat increases in places like China and India, we&amp;#39;re coming to a breaking point of already terrible and ecologically damaging animal welfare system in an age of climate change. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paleo", "name": "t1_dgeuiod", "score_hidden": false, "stickied": false, "created": 1492529705.0, "created_utc": 1492500905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzzs", "removal_reason": null, "link_id": "t3_660hxx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzzs", "removal_reason": null, "link_id": "t3_660hxx", "likes": null, "replies": "", "user_reports": [], "id": "dgf0nan", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "asmodeuskraemer", "parent_id": "t1_dgezl4g", "subreddit_name_prefixed": "r/Paleo", "controversiality": 0, "body": "\"If it worked, they wouldn't make money\" ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;If it worked, they wouldn&amp;#39;t make money&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paleo", "name": "t1_dgf0nan", "score_hidden": false, "stickied": false, "created": 1492546409.0, "created_utc": 1492517609.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgezl4g", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Vincere31", "parent_id": "t3_660hxx", "subreddit_name_prefixed": "r/Paleo", "controversiality": 0, "body": "I have stopped caring, I do what I want. If someone needs advice they will have to ask me. Now when co-workers tell me they doing nutri-system or weight watchers, I just smile and nod and move on. If they talk shit about paleo, I just say ok. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have stopped caring, I do what I want. If someone needs advice they will have to ask me. Now when co-workers tell me they doing nutri-system or weight watchers, I just smile and nod and move on. If they talk shit about paleo, I just say ok. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paleo", "name": "t1_dgezl4g", "score_hidden": false, "stickied": false, "created": 1492544283.0, "created_utc": 1492515483.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzzs", "removal_reason": null, "link_id": "t3_660hxx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzzs", "removal_reason": null, "link_id": "t3_660hxx", "likes": null, "replies": "", "user_reports": [], "id": "dgf1y7z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ramblemn", "parent_id": "t1_dgezmhj", "subreddit_name_prefixed": "r/Paleo", "controversiality": 0, "body": "all they gotta do is put doubt in your mind:  you're at the store and see that box of nuts and honey and organic shit and bammo,  Keebler is back on the menu.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;all they gotta do is put doubt in your mind:  you&amp;#39;re at the store and see that box of nuts and honey and organic shit and bammo,  Keebler is back on the menu.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paleo", "name": "t1_dgf1y7z", "score_hidden": false, "stickied": false, "created": 1492548657.0, "created_utc": 1492519857.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgezmhj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "vgdiv", "parent_id": "t3_660hxx", "subreddit_name_prefixed": "r/Paleo", "controversiality": 0, "body": "Follow the money- in this case it's the food companies that are trying he old game of discrediting something that is quickly eroding their margins. \n\nWhether you do Paleo or not(high chance you do if you're on this sub), just continue scrutinising such reports with your critical thinking and respect for evidence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Follow the money- in this case it&amp;#39;s the food companies that are trying he old game of discrediting something that is quickly eroding their margins. &lt;/p&gt;\n\n&lt;p&gt;Whether you do Paleo or not(high chance you do if you&amp;#39;re on this sub), just continue scrutinising such reports with your critical thinking and respect for evidence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paleo", "name": "t1_dgezmhj", "score_hidden": false, "stickied": false, "created": 1492544363.0, "created_utc": 1492515563.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzzs", "removal_reason": null, "link_id": "t3_660hxx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qzzs", "removal_reason": null, "link_id": "t3_660hxx", "likes": null, "replies": "", "user_reports": [], "id": "dgesckg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chiefy81", "parent_id": "t1_dgepq3r", "subreddit_name_prefixed": "r/Paleo", "controversiality": 0, "body": "First they ignore you. Then they laugh...now fight?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First they ignore you. Then they laugh...now fight?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paleo", "name": "t1_dgesckg", "score_hidden": false, "stickied": false, "created": 1492524150.0, "created_utc": 1492495350.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzzs", "removal_reason": null, "link_id": "t3_660hxx", "likes": null, "replies": "", "user_reports": [], "id": "dgf0muh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "asmodeuskraemer", "parent_id": "t1_dgepq3r", "subreddit_name_prefixed": "r/Paleo", "controversiality": 0, "body": "I always tell people on traditional diets \"if it worked, they wouldn't make money\". \n\nIt's totally a Diet Industry/Big Food thing. They're in cahoots! (What even is a cahoot?) I'm still super overweight and don't eat like I should, but I also know that the fat free diets and stuff of the 80s and 90s are bullshit. It's hard to find a balance. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always tell people on traditional diets &amp;quot;if it worked, they wouldn&amp;#39;t make money&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s totally a Diet Industry/Big Food thing. They&amp;#39;re in cahoots! (What even is a cahoot?) I&amp;#39;m still super overweight and don&amp;#39;t eat like I should, but I also know that the fat free diets and stuff of the 80s and 90s are bullshit. It&amp;#39;s hard to find a balance. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paleo", "name": "t1_dgf0muh", "score_hidden": false, "stickied": false, "created": 1492546384.0, "created_utc": 1492517584.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgepq3r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "StillARedditor", "parent_id": "t3_660hxx", "subreddit_name_prefixed": "r/Paleo", "controversiality": 0, "body": "It's not recent. The ad crap I get served everywhere has been hardcore nasty about it for years - but other people in my life never see it. The articles you are seeing may be partially targeted based on your interests. \n\nI see it wax and wane - more straw man articles out for a while gaining popularity, quiet for a bit, then attacking all the clueless stupid gluten free idiot morons, then quiet, then mocking the paleo fools, quiet, then angry threats about child abuse if you don't feed your kids enough bread you stupid paleo anti vaxer (wtf, those don't go together ... but say it enough times and people think it's true!). \n\nI've been served a constant barrage of these since 2014. They are really disheartening. I felt so alone, foolish, embarrassed, and drifted back toward grains. Not much wheat, but some here and there. My health was getting worse. Doc said do a gluten challenge, test for celiac. I lasted 13 days on bread every day - the tremendous knee and other body pain, constant unbearable headache, hours of pain in the bathroom, acne breakouts, etc put a stop to bread-every-day. Blood results are negative, but f that noise, I could hardly move. Bread is bad bad bad news for me. Yay, I know for sure. \n\nAnd that very day everybody on Facebook likes \"you stupid liberal whole foods ignorant leftie shopping gluten free, you're as bad as stupid ignorant racist trump supporter assholes\"  'article' encouraging people to root out the stupidity in liberals and eliminate the gluten free and paleo fool cancer once and for all.  (Sorry political, that's just what it was about, literally.)\n\nWhen all friends and family like and cheer that on, while I'm recovering from two weeks of bread feeling like I got hit by a truck, knowing I fell for this once and won't again, but it's going to always be alone, mocked, scorned, fought, hated? So fucking depressing. \n\nI honesty think it's Big Food paying for this stuff to keep churning. Keep people from changing their habits, keep everyone who does it isolated and shamed. I hate to be conspiracy about it, but tracking exactly th ads I get vs friends and family, the kinds of \"articles\" served, etc - it's driven by money. It's deliberate and intends to crush the soul of anyone who tries to stop paying them. \n\nSo, any new crush of articles reaching public critical mass would be driven just the same way as any other bullshit \"fake news\" gets spread by evildoers. Seed them, spread them, pay for them to go wide, promote deliberately, forget ethics, spread your lies far and wide. \n\nYour rant is my rant too. It's so sad, so disgusting, so reprehensible. :-(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not recent. The ad crap I get served everywhere has been hardcore nasty about it for years - but other people in my life never see it. The articles you are seeing may be partially targeted based on your interests. &lt;/p&gt;\n\n&lt;p&gt;I see it wax and wane - more straw man articles out for a while gaining popularity, quiet for a bit, then attacking all the clueless stupid gluten free idiot morons, then quiet, then mocking the paleo fools, quiet, then angry threats about child abuse if you don&amp;#39;t feed your kids enough bread you stupid paleo anti vaxer (wtf, those don&amp;#39;t go together ... but say it enough times and people think it&amp;#39;s true!). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been served a constant barrage of these since 2014. They are really disheartening. I felt so alone, foolish, embarrassed, and drifted back toward grains. Not much wheat, but some here and there. My health was getting worse. Doc said do a gluten challenge, test for celiac. I lasted 13 days on bread every day - the tremendous knee and other body pain, constant unbearable headache, hours of pain in the bathroom, acne breakouts, etc put a stop to bread-every-day. Blood results are negative, but f that noise, I could hardly move. Bread is bad bad bad news for me. Yay, I know for sure. &lt;/p&gt;\n\n&lt;p&gt;And that very day everybody on Facebook likes &amp;quot;you stupid liberal whole foods ignorant leftie shopping gluten free, you&amp;#39;re as bad as stupid ignorant racist trump supporter assholes&amp;quot;  &amp;#39;article&amp;#39; encouraging people to root out the stupidity in liberals and eliminate the gluten free and paleo fool cancer once and for all.  (Sorry political, that&amp;#39;s just what it was about, literally.)&lt;/p&gt;\n\n&lt;p&gt;When all friends and family like and cheer that on, while I&amp;#39;m recovering from two weeks of bread feeling like I got hit by a truck, knowing I fell for this once and won&amp;#39;t again, but it&amp;#39;s going to always be alone, mocked, scorned, fought, hated? So fucking depressing. &lt;/p&gt;\n\n&lt;p&gt;I honesty think it&amp;#39;s Big Food paying for this stuff to keep churning. Keep people from changing their habits, keep everyone who does it isolated and shamed. I hate to be conspiracy about it, but tracking exactly th ads I get vs friends and family, the kinds of &amp;quot;articles&amp;quot; served, etc - it&amp;#39;s driven by money. It&amp;#39;s deliberate and intends to crush the soul of anyone who tries to stop paying them. &lt;/p&gt;\n\n&lt;p&gt;So, any new crush of articles reaching public critical mass would be driven just the same way as any other bullshit &amp;quot;fake news&amp;quot; gets spread by evildoers. Seed them, spread them, pay for them to go wide, promote deliberately, forget ethics, spread your lies far and wide. &lt;/p&gt;\n\n&lt;p&gt;Your rant is my rant too. It&amp;#39;s so sad, so disgusting, so reprehensible. :-(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paleo", "name": "t1_dgepq3r", "score_hidden": false, "stickied": false, "created": 1492519341.0, "created_utc": 1492490541.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qzzs", "removal_reason": null, "link_id": "t3_660hxx", "likes": null, "replies": "", "user_reports": [], "id": "dgesahp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chiefy81", "parent_id": "t3_660hxx", "subreddit_name_prefixed": "r/Paleo", "controversiality": 1, "body": "People either have not tried paleo or they love it and see results. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People either have not tried paleo or they love it and see results. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Paleo", "name": "t1_dgesahp", "score_hidden": false, "stickied": false, "created": 1492524023.0, "created_utc": 1492495223.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]