[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "whowouldwin", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This was an actual discussion I had with my roommates and we need closure.&lt;/p&gt;\n\n&lt;p&gt;Imagine all the humans on earth vs dinosaurs from different eras in a fight to the death. 7.5 billion people are on earth and are given a 1 month notice that they will be transferred to another world and the only way for the human race to continue is to kill all of their opponents...dinosaurs. Can the humans succeed and save their species!!?&lt;/p&gt;\n\n&lt;p&gt;Rules:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;All humans are at peak physical condition (no sick, elderly, babies)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The humans are of a sound state of mind, in a way that they are not going to run away or be immobilized by fear. They will actively try to work together.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The humans are given 1 month of prep time in present earth to prepare for this encounter. They can research and study for the battle, but can not bring anything from earth with them other than typical clothes. They can craft anything they can manage in the battle arena (spears, rock knifes, etc)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There is no thirst or hunger or disease, only death by dino&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There are a number of dinos equal to the amount present on any given day in any of the dinosaur eras (anywhere from 100 million to 1 billion). The dinos will be randomly selected from the Triassic, Jurassic, and Cretaceous Eras and will only contain decent dinosaurs, so no tiny insects or pure water types. Even herbavores will be wanting to fight. If the amount of dinos is too little or small, you can change the number to what you see fit as long as you can justify it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The battle takes place on an infinite plain with dinos and humans separated by 5 miles. The arena contains different biomes such as desserts, forests, jungles, etc&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;(Edit) 7. Humans have a hind mind that applies to any allies (round 3)&lt;/p&gt;\n\n&lt;p&gt;Rounds:&lt;/p&gt;\n\n&lt;p&gt;Round 1: No special rules, just humans vs dinos&lt;/p&gt;\n\n&lt;p&gt;Round 2: Each human receives 1 butter knife to use in the battle&lt;/p&gt;\n\n&lt;p&gt;Round 3: Humans now have all present day birds, reptiles, and mammals to help them (You can use whales, if you think they help), animals will actively help humans and are decent in battle, so no small birds or lizards&lt;/p&gt;\n\n&lt;p&gt;Round 4: Same as Round 3, but same number of dinos are added to match the amount of animals that humans received&lt;/p&gt;\n\n&lt;p&gt;Round 5: Humans can bring 1 item of their choosing to battle (each person can choose their own item), no unlimited ammo for guns, nukes are off limits&lt;/p&gt;\n\n&lt;p&gt;Round 6: If humans stand no chance at winning, how many humans to dinos are needed to secure a 6/10 at least?&lt;/p&gt;\n\n&lt;p&gt;(Edit) Round 7: Humans have 3 months of prep in the arena before the dinos arrive. They can&amp;#39;t interfere with the spawn point of the dinos.&lt;/p&gt;\n\n&lt;p&gt;Bonus Round: Humans vs all non insect present day animals&lt;/p&gt;\n\n&lt;p&gt;I hope you guys enjoy! If any rules are unclear let me know or just assume whatever you want, just have fun.&lt;/p&gt;\n\n&lt;p&gt;Edit: &lt;/p&gt;\n\n&lt;p&gt;the humans are pretty outmatched it seems, so I am adding a round and a rule. New rule is that humans can be assumed to have a hind mind that also applies to their present day animal allies. New round is humans are given 3 months of prep in the arena before the dinos arrive.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This was an actual discussion I had with my roommates and we need closure.\n\nImagine all the humans on earth vs dinosaurs from different eras in a fight to the death. 7.5 billion people are on earth and are given a 1 month notice that they will be transferred to another world and the only way for the human race to continue is to kill all of their opponents...dinosaurs. Can the humans succeed and save their species!!?\n\nRules:\n\n1. All humans are at peak physical condition (no sick, elderly, babies)\n\n2. The humans are of a sound state of mind, in a way that they are not going to run away or be immobilized by fear. They will actively try to work together.\n\n3. The humans are given 1 month of prep time in present earth to prepare for this encounter. They can research and study for the battle, but can not bring anything from earth with them other than typical clothes. They can craft anything they can manage in the battle arena (spears, rock knifes, etc)\n\n4. There is no thirst or hunger or disease, only death by dino\n\n5. There are a number of dinos equal to the amount present on any given day in any of the dinosaur eras (anywhere from 100 million to 1 billion). The dinos will be randomly selected from the Triassic, Jurassic, and Cretaceous Eras and will only contain decent dinosaurs, so no tiny insects or pure water types. Even herbavores will be wanting to fight. If the amount of dinos is too little or small, you can change the number to what you see fit as long as you can justify it.\n\n6. The battle takes place on an infinite plain with dinos and humans separated by 5 miles. The arena contains different biomes such as desserts, forests, jungles, etc\n\n(Edit) 7. Humans have a hind mind that applies to any allies (round 3)\n\nRounds:\n\nRound 1: No special rules, just humans vs dinos\n\nRound 2: Each human receives 1 butter knife to use in the battle\n\nRound 3: Humans now have all present day birds, reptiles, and mammals to help them (You can use whales, if you think they help), animals will actively help humans and are decent in battle, so no small birds or lizards\n\nRound 4: Same as Round 3, but same number of dinos are added to match the amount of animals that humans received\n\nRound 5: Humans can bring 1 item of their choosing to battle (each person can choose their own item), no unlimited ammo for guns, nukes are off limits\n\nRound 6: If humans stand no chance at winning, how many humans to dinos are needed to secure a 6/10 at least?\n\n(Edit) Round 7: Humans have 3 months of prep in the arena before the dinos arrive. They can't interfere with the spawn point of the dinos.\n\nBonus Round: Humans vs all non insect present day animals\n\n\nI hope you guys enjoy! If any rules are unclear let me know or just assume whatever you want, just have fun.\n\nEdit: \n\nthe humans are pretty outmatched it seems, so I am adding a round and a rule. New rule is that humans can be assumed to have a hind mind that also applies to their present day animal allies. New round is humans are given 3 months of prep in the arena before the dinos arrive.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Casual", "id": "65b9pv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 108, "report_reasons": null, "author": "Papa-Pasta", "saved": false, "mod_reports": [], "name": "t3_65b9pv", "subreddit_name_prefixed": "r/whowouldwin", "approved_by": null, "over_18": false, "domain": "self.whowouldwin", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2s599", "edited": 1492191260.0, "link_flair_css_class": "Casual", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/whowouldwin/comments/65b9pv/humans_vs_dinosaurs/", "num_reports": null, "locked": false, "stickied": false, "created": 1492184719.0, "url": "https://www.reddit.com/r/whowouldwin/comments/65b9pv/humans_vs_dinosaurs/", "author_flair_text": null, "quarantine": false, "title": "Humans Vs Dinosaurs", "created_utc": 1492155919.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 44, "visited": false, "subreddit_type": "public", "ups": 108}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg9cb3z", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Papa-Pasta", "parent_id": "t1_dg8xzot", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "To clarify a little, no reproducing, dinosaurs will not fight over eachother, for the # of dinos I am just estimating how many dinos were on earth at any one day, for simplicity just assume 100 million dinos. Decent dinos just means no really small insects or water living types. \n\nI love the response!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To clarify a little, no reproducing, dinosaurs will not fight over eachother, for the # of dinos I am just estimating how many dinos were on earth at any one day, for simplicity just assume 100 million dinos. Decent dinos just means no really small insects or water living types. &lt;/p&gt;\n\n&lt;p&gt;I love the response!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9cb3z", "score_hidden": false, "stickied": false, "created": 1492215284.0, "created_utc": 1492186484.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8xzot", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "TheBirthing", "parent_id": "t3_65b9pv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Even with all the information you've given, this scenario is way too vague to imagine a concrete outcome. Dinos are randomly selected and only 'decent' dinos are chosen? What constitutes decent? Do the dinosaurs need to eat or fight among themselves? Can the humans or dinos reproduce? And the random number of dinos is derived from how many dinos were present on a single day over a span of hundreds of millions of years? Wha...?\n\nAre the dinos bloodlusted? You said even herbivores are willing to fight. A single Argentinosaurus would have a field day with 7.5 billion unarmed humans to stomp on, and there is literally nothing the humans can do to retaliate until they build some decent weapons - how are they doing to do that while being stalked by the likes of Saurophaganax and Charcharodontosaurus - some of largest macro-predators in earth's history? There isn't really a feasible defensive plan against animals like that for an unarmed human being.\n\nOf course, assuming the dinosaurs have their maximum army size of one billion, and not ALL of them are specialized predators, humanity's most viable strategy is just a long and bloody war of attrition in which they make whatever basic weaponry they can from sticks and stones and then advance as an unstoppable wall of flesh. All the smaller dinosaurs and middle-of-the-road herbivores would die pretty quickly, leaving the bigger ones to be dragged down to the ground by a seething mass of human bodies and stabbed/stomped to death.\n\nBut obviously that's a best-case scenario in which mankind functions with some kind of hive-mind-fueled efficiency to cooperatively pin down beasts weighing literally a hundred tons. I think 95/100 times this goes pretty badly for the humans even though they have the clear numbers advantage. Butter knives wont do much to help them, but giving them every animal on earth tips the scales a little in their favor. Things like rhinos, elephants and hippos would make decent linebreakers but there simply isn't enough of them to make a big difference in the long run.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even with all the information you&amp;#39;ve given, this scenario is way too vague to imagine a concrete outcome. Dinos are randomly selected and only &amp;#39;decent&amp;#39; dinos are chosen? What constitutes decent? Do the dinosaurs need to eat or fight among themselves? Can the humans or dinos reproduce? And the random number of dinos is derived from how many dinos were present on a single day over a span of hundreds of millions of years? Wha...?&lt;/p&gt;\n\n&lt;p&gt;Are the dinos bloodlusted? You said even herbivores are willing to fight. A single Argentinosaurus would have a field day with 7.5 billion unarmed humans to stomp on, and there is literally nothing the humans can do to retaliate until they build some decent weapons - how are they doing to do that while being stalked by the likes of Saurophaganax and Charcharodontosaurus - some of largest macro-predators in earth&amp;#39;s history? There isn&amp;#39;t really a feasible defensive plan against animals like that for an unarmed human being.&lt;/p&gt;\n\n&lt;p&gt;Of course, assuming the dinosaurs have their maximum army size of one billion, and not ALL of them are specialized predators, humanity&amp;#39;s most viable strategy is just a long and bloody war of attrition in which they make whatever basic weaponry they can from sticks and stones and then advance as an unstoppable wall of flesh. All the smaller dinosaurs and middle-of-the-road herbivores would die pretty quickly, leaving the bigger ones to be dragged down to the ground by a seething mass of human bodies and stabbed/stomped to death.&lt;/p&gt;\n\n&lt;p&gt;But obviously that&amp;#39;s a best-case scenario in which mankind functions with some kind of hive-mind-fueled efficiency to cooperatively pin down beasts weighing literally a hundred tons. I think 95/100 times this goes pretty badly for the humans even though they have the clear numbers advantage. Butter knives wont do much to help them, but giving them every animal on earth tips the scales a little in their favor. Things like rhinos, elephants and hippos would make decent linebreakers but there simply isn&amp;#39;t enough of them to make a big difference in the long run.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg8xzot", "score_hidden": false, "stickied": false, "created": 1492189120.0, "created_utc": 1492160320.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 45}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg9mxnr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Cynical_Assault", "parent_id": "t1_dg9l748", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "&gt; Think of the towers of zombies in the World War Z movie, now multiply that by thousands, now add proper human intelligence, planning, and cooperation.\n\nThink of the plethora of charging sauropods plodding through our ranks and colliding with these towers as they're being \"built\". What would happen if two Giganotosauruses came at either sides of the tower? What if one of them takes a bite with it's 6.5 ft long skull and crushed a few people that were holding others up? What would happen if a line of Triceratops collided with the base of the tower? Our proper human intelligence would allow us to see that that's a horrible idea. \n\nAlso, the size of a human tower required to be able to do any good would be so big and heavy that it would crush whoever's at the bottom. WWZ was entirely fantasy. \n\n&gt; We would be able to form Cirque du Soleil style trapeze acts to toss each other up onto the tallest dinosaurs, then claw out their eyes, then either kill them by a thousand stone knife cuts, or else cram a couple of volunteers down their throat until they choke to death. \n\nNot sure if that's a joke, but if it isn't, no. \n\nFirst of all, how do you go about cramming anything inside the mouth of the theropod ranked having the strongest bite force of any terrestrial creature? I get the shoving your hand down a bear's throat, I've read that before. But to make that relevant here, you'd have to scale the human doing the choking the size of a T.rex, and disregard all other dinosaurs present. The mistake a lot of people on this sub keep making is that their suggestions for bringing down big dinos is that they're basing that on 1, 10, 100, 1000, or more humans vs. one dinosaur, and that that one dinosaur is going to do exactly what they want it to do. There's not just one dinosaur. There's millions. More than likely there will be several attacking you or around you, and they won't be sitting still. \n\n\n&gt; But 7.5 billion is an absolute shit-ton of people, all in peak condition, all of whom are a part of a species that every single other vaguely intelligent species on Earth has evolved to have a healthy fear of.\n\nBe that as it may, why is it that we're usually out-classed in nearly all confrontations in the wild then? All other apes of comparable size have much more strength than we do. In terms of fights to the death, how many bears, wolves, lions, tigers, mountain lions, jaguars, orangutans, or gorillas have lost to unarmed humans (or at least without guns)? \n\n&gt; We're at the top of the food chain for a very good reason.\n\nAbsolutely, because there aren't any dinosaurs around.\n\nI'm not downplaying man's intelligence being a factor because I think we're the most amazing animals ever to exist (next to dinosaurs of course). But given the OP's rules, we'd be severely limited in what we could do based on our equipment. Our vastly superior intelligence would be wasted in this scenario. We rule this planet because we can harness practically anything we want because people have come before us and made it possible to do so. We can go to the deepest trench in the ocean, climb the highest mountain, kill the largest animal, even go to the damn moon because of our intelligence. \n\nWhere does that get us when reduced to stone-age technology and facing millions of giant creatures that are perfectly designed for their sole purpose - killing? \n\nEDIT: Spelling", "edited": 1492200506.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Think of the towers of zombies in the World War Z movie, now multiply that by thousands, now add proper human intelligence, planning, and cooperation.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Think of the plethora of charging sauropods plodding through our ranks and colliding with these towers as they&amp;#39;re being &amp;quot;built&amp;quot;. What would happen if two Giganotosauruses came at either sides of the tower? What if one of them takes a bite with it&amp;#39;s 6.5 ft long skull and crushed a few people that were holding others up? What would happen if a line of Triceratops collided with the base of the tower? Our proper human intelligence would allow us to see that that&amp;#39;s a horrible idea. &lt;/p&gt;\n\n&lt;p&gt;Also, the size of a human tower required to be able to do any good would be so big and heavy that it would crush whoever&amp;#39;s at the bottom. WWZ was entirely fantasy. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We would be able to form Cirque du Soleil style trapeze acts to toss each other up onto the tallest dinosaurs, then claw out their eyes, then either kill them by a thousand stone knife cuts, or else cram a couple of volunteers down their throat until they choke to death. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not sure if that&amp;#39;s a joke, but if it isn&amp;#39;t, no. &lt;/p&gt;\n\n&lt;p&gt;First of all, how do you go about cramming anything inside the mouth of the theropod ranked having the strongest bite force of any terrestrial creature? I get the shoving your hand down a bear&amp;#39;s throat, I&amp;#39;ve read that before. But to make that relevant here, you&amp;#39;d have to scale the human doing the choking the size of a T.rex, and disregard all other dinosaurs present. The mistake a lot of people on this sub keep making is that their suggestions for bringing down big dinos is that they&amp;#39;re basing that on 1, 10, 100, 1000, or more humans vs. one dinosaur, and that that one dinosaur is going to do exactly what they want it to do. There&amp;#39;s not just one dinosaur. There&amp;#39;s millions. More than likely there will be several attacking you or around you, and they won&amp;#39;t be sitting still. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But 7.5 billion is an absolute shit-ton of people, all in peak condition, all of whom are a part of a species that every single other vaguely intelligent species on Earth has evolved to have a healthy fear of.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Be that as it may, why is it that we&amp;#39;re usually out-classed in nearly all confrontations in the wild then? All other apes of comparable size have much more strength than we do. In terms of fights to the death, how many bears, wolves, lions, tigers, mountain lions, jaguars, orangutans, or gorillas have lost to unarmed humans (or at least without guns)? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We&amp;#39;re at the top of the food chain for a very good reason.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Absolutely, because there aren&amp;#39;t any dinosaurs around.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not downplaying man&amp;#39;s intelligence being a factor because I think we&amp;#39;re the most amazing animals ever to exist (next to dinosaurs of course). But given the OP&amp;#39;s rules, we&amp;#39;d be severely limited in what we could do based on our equipment. Our vastly superior intelligence would be wasted in this scenario. We rule this planet because we can harness practically anything we want because people have come before us and made it possible to do so. We can go to the deepest trench in the ocean, climb the highest mountain, kill the largest animal, even go to the damn moon because of our intelligence. &lt;/p&gt;\n\n&lt;p&gt;Where does that get us when reduced to stone-age technology and facing millions of giant creatures that are perfectly designed for their sole purpose - killing? &lt;/p&gt;\n\n&lt;p&gt;EDIT: Spelling&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9mxnr", "score_hidden": false, "stickied": false, "created": 1492227694.0, "created_utc": 1492198894.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9l748", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Granite-M", "parent_id": "t1_dg979wu", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Though I agree that any individual dinosaur is going to kill a lot of people, I feel as though you may have miscalculated the difference between a thousand and a billion. With 7.5 billion peak physical condition humans all working together, we could literally choke large dinosaurs to death on the corpses of our dead and still come out fairly far ahead. Think of the towers of zombies in the World War Z movie, now multiply that by thousands, now add proper human intelligence, planning, and cooperation. We would be able to form Cirque du Soleil style trapeze acts to toss each other up onto the tallest dinosaurs, then claw out their eyes, then either kill them by a thousand stone knife cuts, or else cram a couple of volunteers down their throat until they choke to death. That's not an exaggeration of a viable tactic: there's a historical account of a guy who killed a goddamn grizzly bear with his bare hands by stuffing the bloody stump of his own wrist down its throat until it died, *and that guy survived*. \n\nWould humans take a lot of losses? Absolutely. But 7.5 billion is an absolute shit-ton of people, all in peak condition, all of whom are a part of a species that every single other vaguely intelligent species on Earth has evolved to have a healthy fear of. That's not a coincidence. We're at the top of the food chain for a very good reason. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Though I agree that any individual dinosaur is going to kill a lot of people, I feel as though you may have miscalculated the difference between a thousand and a billion. With 7.5 billion peak physical condition humans all working together, we could literally choke large dinosaurs to death on the corpses of our dead and still come out fairly far ahead. Think of the towers of zombies in the World War Z movie, now multiply that by thousands, now add proper human intelligence, planning, and cooperation. We would be able to form Cirque du Soleil style trapeze acts to toss each other up onto the tallest dinosaurs, then claw out their eyes, then either kill them by a thousand stone knife cuts, or else cram a couple of volunteers down their throat until they choke to death. That&amp;#39;s not an exaggeration of a viable tactic: there&amp;#39;s a historical account of a guy who killed a goddamn grizzly bear with his bare hands by stuffing the bloody stump of his own wrist down its throat until it died, &lt;em&gt;and that guy survived&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;Would humans take a lot of losses? Absolutely. But 7.5 billion is an absolute shit-ton of people, all in peak condition, all of whom are a part of a species that every single other vaguely intelligent species on Earth has evolved to have a healthy fear of. That&amp;#39;s not a coincidence. We&amp;#39;re at the top of the food chain for a very good reason. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9l748", "score_hidden": false, "stickied": false, "created": 1492225600.0, "created_utc": 1492196800.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg9o4wi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cynical_Assault", "parent_id": "t1_dg9gr9n", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Realistically... no. lol. \n\nI think a better large scale animal-vs-human war would be all species of apes vesus humans. We'd have much better odds there, but it'd be interesting how the war would pan out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Realistically... no. lol. &lt;/p&gt;\n\n&lt;p&gt;I think a better large scale animal-vs-human war would be all species of apes vesus humans. We&amp;#39;d have much better odds there, but it&amp;#39;d be interesting how the war would pan out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9o4wi", "score_hidden": false, "stickied": false, "created": 1492229139.0, "created_utc": 1492200339.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9gr9n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Papa-Pasta", "parent_id": "t1_dg9gb3y", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "So you're saying there's a chance!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you&amp;#39;re saying there&amp;#39;s a chance!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9gr9n", "score_hidden": false, "stickied": false, "created": 1492220328.0, "created_utc": 1492191528.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9gb3y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cynical_Assault", "parent_id": "t1_dg9g0kl", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Possibly, but all the butter knives we had smelted down into liquid metal wouldn't be enough to make much armor. Maybe enough to make several thousand short swords. That might help against the smaller carnivores, but wouldn't do much against the bigger dinos. Primitive armor and traps still probably wouldn't help much, but I'm willing to say that it does. Our odds go from -5000/10 to .005/10.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Possibly, but all the butter knives we had smelted down into liquid metal wouldn&amp;#39;t be enough to make much armor. Maybe enough to make several thousand short swords. That might help against the smaller carnivores, but wouldn&amp;#39;t do much against the bigger dinos. Primitive armor and traps still probably wouldn&amp;#39;t help much, but I&amp;#39;m willing to say that it does. Our odds go from -5000/10 to .005/10.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9gb3y", "score_hidden": false, "stickied": false, "created": 1492219805.0, "created_utc": 1492191005.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9g0kl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Papa-Pasta", "parent_id": "t1_dg9eunp", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "If the humans were given 3 months in the arena to prep before the Dinosaurs arrived, would this give the humans a fighting chance? This way they could make primitive armor, traps, and maybe even metal weapons if they could develop a smelter in that amount of tme. They could melt down the butter knifes even!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the humans were given 3 months in the arena to prep before the Dinosaurs arrived, would this give the humans a fighting chance? This way they could make primitive armor, traps, and maybe even metal weapons if they could develop a smelter in that amount of tme. They could melt down the butter knifes even!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9g0kl", "score_hidden": false, "stickied": false, "created": 1492219462.0, "created_utc": 1492190662.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9eunp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cynical_Assault", "parent_id": "t1_dg9e7ms", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "&gt;With a bunch of falcons swooping in on the Dino's faces and monkeys crawling all over them humans could get enough time for a tactical retreat to set up traps and defenses to combat the dinos.\n\nI doubt a rex would care if a monkey was crawling on him and a falcon was divebombing his head while he was gorging himself on delicious humans. They wouldn't be able to hurt him at all. \n\nDo the humans have a hive mind? Do the animals? Organizing a retreat of 7.5 billion people alone would be insanely difficult, and exponentially difficult for the billions of animals on our side. The animals that could make some sort of difference aren't very numerous as it is. How many white rhinos or elephants are there on Earth right now? Nowhere near the amount of Brachiosaurs that are parading through our pitiful lines of defense. \n\nPlus I don't see how we'd have time to make traps. The dinos are in a constant charge. Even at five miles out, we'd only have enough time to chisel out some roughly made rock knives. Once the fighting starts, I doubt we'd be able to do much. The large carnivores would be able to push deep into our ranks just by walking through us, the same for the large hadrosaurs and sauropods. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;With a bunch of falcons swooping in on the Dino&amp;#39;s faces and monkeys crawling all over them humans could get enough time for a tactical retreat to set up traps and defenses to combat the dinos.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I doubt a rex would care if a monkey was crawling on him and a falcon was divebombing his head while he was gorging himself on delicious humans. They wouldn&amp;#39;t be able to hurt him at all. &lt;/p&gt;\n\n&lt;p&gt;Do the humans have a hive mind? Do the animals? Organizing a retreat of 7.5 billion people alone would be insanely difficult, and exponentially difficult for the billions of animals on our side. The animals that could make some sort of difference aren&amp;#39;t very numerous as it is. How many white rhinos or elephants are there on Earth right now? Nowhere near the amount of Brachiosaurs that are parading through our pitiful lines of defense. &lt;/p&gt;\n\n&lt;p&gt;Plus I don&amp;#39;t see how we&amp;#39;d have time to make traps. The dinos are in a constant charge. Even at five miles out, we&amp;#39;d only have enough time to chisel out some roughly made rock knives. Once the fighting starts, I doubt we&amp;#39;d be able to do much. The large carnivores would be able to push deep into our ranks just by walking through us, the same for the large hadrosaurs and sauropods. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9eunp", "score_hidden": false, "stickied": false, "created": 1492218125.0, "created_utc": 1492189325.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9e7ms", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Papa-Pasta", "parent_id": "t1_dg9d075", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "You make a fair point. I feel the animals do make a big difference for humanity in general. With a bunch of falcons swooping in on the Dino's faces and monkeys crawling all over them humans could get enough time for a tactical retreat to set up traps and defenses to combat the dinos.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You make a fair point. I feel the animals do make a big difference for humanity in general. With a bunch of falcons swooping in on the Dino&amp;#39;s faces and monkeys crawling all over them humans could get enough time for a tactical retreat to set up traps and defenses to combat the dinos.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9e7ms", "score_hidden": false, "stickied": false, "created": 1492217407.0, "created_utc": 1492188607.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg9v9kb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mattsoup", "parent_id": "t1_dg9d075", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Think about wolves pack hunting though. 70 million years of added agility, brain size, and social development leads to a hell of a bones for the human side", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Think about wolves pack hunting though. 70 million years of added agility, brain size, and social development leads to a hell of a bones for the human side&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9v9kb", "score_hidden": false, "stickied": false, "created": 1492238142.0, "created_utc": 1492209342.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9d075", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cynical_Assault", "parent_id": "t1_dg9cpys", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "&gt;Ten humans(with crude weapons) and a rhino against a trex I think could mob it enough to take it down. Rhino charges the leg and humans throw rocks and Spears at the face, the trex might be overwhelmed.\n\nIf the fight were isolated, sure. However, you'd have to account for the hundreds of other carnivorous titans stomping about and the giant sauropods stampeding. \n\nAlso, you're assuming the rex stands still and lets the rhino charge it. The rex can lift its leg and literally step over the rhino. He's got the height advantage there and can attack from above, not to mention just stomp the rhino or headbutt it from the side as it charges. ", "edited": 1492187829.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Ten humans(with crude weapons) and a rhino against a trex I think could mob it enough to take it down. Rhino charges the leg and humans throw rocks and Spears at the face, the trex might be overwhelmed.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If the fight were isolated, sure. However, you&amp;#39;d have to account for the hundreds of other carnivorous titans stomping about and the giant sauropods stampeding. &lt;/p&gt;\n\n&lt;p&gt;Also, you&amp;#39;re assuming the rex stands still and lets the rhino charge it. The rex can lift its leg and literally step over the rhino. He&amp;#39;s got the height advantage there and can attack from above, not to mention just stomp the rhino or headbutt it from the side as it charges. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9d075", "score_hidden": false, "stickied": false, "created": 1492216046.0, "created_utc": 1492187246.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cpys", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Papa-Pasta", "parent_id": "t1_dg979wu", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "I think I severely over estimated the human race. \n\nJust to clarify though, there are biome on this infinite \"plain\" so there are forests, jungles, mountains, etc that humans can use for crafting or defensive uses. \n\nI feel like humans with animals have a fighting chance. Ten humans(with crude weapons) and a rhino against a trex I think could mob it enough to take it down. Rhino charges the leg and humans throw rocks and Spears at the face, the trex might be overwhelmed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I severely over estimated the human race. &lt;/p&gt;\n\n&lt;p&gt;Just to clarify though, there are biome on this infinite &amp;quot;plain&amp;quot; so there are forests, jungles, mountains, etc that humans can use for crafting or defensive uses. &lt;/p&gt;\n\n&lt;p&gt;I feel like humans with animals have a fighting chance. Ten humans(with crude weapons) and a rhino against a trex I think could mob it enough to take it down. Rhino charges the leg and humans throw rocks and Spears at the face, the trex might be overwhelmed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9cpys", "score_hidden": false, "stickied": false, "created": 1492215734.0, "created_utc": 1492186934.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dgaliwr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lord2FatToSitAHorse", "parent_id": "t1_dg979wu", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "By your math, 1 deonychus would kill 40,000 peak human beings each.\n\nBullshit", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;By your math, 1 deonychus would kill 40,000 peak human beings each.&lt;/p&gt;\n\n&lt;p&gt;Bullshit&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgaliwr", "score_hidden": false, "stickied": false, "created": 1492288528.0, "created_utc": 1492259728.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg979wu", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "Cynical_Assault", "parent_id": "t3_65b9pv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Interesting prompt. I'm a huge dino nerd, so the topic tickles my fancy. However, I don't think it was structured very well. \n\nInstead of throwing a slew of random dinosaur species at humanity, let's first start with just one species and go from there. You'll see why.\n\nStarting small, let's say the entirety of the Deinonychus species on any given day (not all that ever existed) is pitted against the whole of humanity without modern technology. So that's 7.5 billion people versus possibly fifty thousand dinos comparable in size to large leopards. Going off of rule 6, we'd all be lined up facing each other like militia, except we'd be five miles apart marching toward the middle. If the dinos are also marching towards the center, it stands to reason that they wouldn't be following instinct, so natural behavior isn't an issue. Realistically, a lot of us would be killed. Like, *a lot*. Our sheer numbers would be enough to smother them and eventually pull out the win, but our population would probably be reduced by a fourth. Deinonychus was built for speed and killing efficiency, and without the need to eat, sleep, or reproduce, they'd just kill. One would jump on someone, bite their neck, jump on another person, eviscerate them with their toe claws, someone would try to grab them but they'd get their jugular sliced open by the dino's handclaws - rinse and repeat. Deinonychus were bigger and far more dangerous than most people give them credit for. [These guys](https://en.wikipedia.org/wiki/Deinonychus#/media/File:Deinonychus-scale.png) were over ten feet long and weighed as much as a healthy 6ft+ tall adult male (220 lb high estimate). If one had a running start and jumped on you, it'd feel like getting hit by a small car. They wouldn't go down easy, especially if all we had were our fists and rock knives.\n\n------------\n\nNext, we'll move up the food chain to another carnivore, Allosaurus. Disregarding the possible size of [Epanterias](https://en.wikipedia.org/wiki/Epanterias), Allosaurus averaged 30 ft long, seven or eight feet at the shoulders, and around one and a half tons. These guys completely out-classed us in the size department. I'm not entirely sure how many of them there would've been at any given time, so I'll give an estimate of thirty thousand. I'd imagine taking one down would require dozens of men using their combined weight to hold the creature down, but that's assuming it doesn't fight back. Given the power an adult Allosaurus would've had, it could easily plow through a wall of humans and use its sheer size to cripple and kill with each step. Again, it would boil down to a numbers game. With peak human strength and primitive rock knives we'd secure a win in the long run, but not without severe loss. I'd say near half of our population would lay crushed and broken on the battlefield when it's all over. \n\n--------------\n\nThe motherfucker known as T.rex. This guy doesn't give a shit. At 40 feet long, twelve feet tall at the hips, and anywhere from *eight to eighteen fucking tons*, this behemoth would do insane damage. Even just one would be enough to slaughter hundreds if not thousands before succumbing to the stab wounds we'd inflict with our shitty rock blades. Assuming that being an apex predator meant having low numbers, I'd think there may have been only twenty thousand of these cunts scaring the shit out of everything on any given day. A single rex would be hard to put down, but when you have a ***wall of several thousand fucking goliaths hellbent on raping you***, there would be little hope. In the end, our numbers *might* squeak out a win for us, but it's a slim chance. Our only hope would be to scatter them and single them out so they couldn't cooperate. I'd say 1.5/10, we win. T.rex don't give a shit. \n\n---------------\n\nCombine all three of those species and we'd be facing a hundred thousand prehistoric rapists hellbent on making us dead. We'd have literally have no chance of surviving. A single [Puertasaurus](https://en.wikipedia.org/wiki/Puertasaurus) would be nigh unstoppable against even fifty thousand humans. The rest of their species could wipe us out by themselves. Bring in the rest of the dinosaur spectrum and suddenly we're like defenseless plankton getting inhaled by a blue whale. \n\nRound 1 - We're fucked, even if we had spears.\n\nRound 2 - We're still fucked, but it'd be funny because we all look like we were about to spread some butter on some toast when the dinos arrived. \n\nRound 3 - This would be tougher for the dinos, but still a complete win for them. Whales can't do shit on land. If the fight was in the water, we'd have a chance (not accounting for prehistoric reptiles and creatures because they aren't dinosaurs) only because they'd all drown. \n\nRound 4 - Even more rape. \n\nRound 5 - If we would bring tanks, we'd stomp. Assuming a tank would require four people to operate, we'd have 1,875,000,000 tanks at our disposal. Complete and utter win for us 1000/10.\n\nRound 6 - Combining all the dinosaur species taken from snapshots from each period, I'll give a lowball estimate of a billion total. We'd have to number in the several hundred trillions to pull out a win.\n\nBonus Round - We'd be fucked again. No modern tech means we'd be fighting fist/rock knife against tooth, claw, and horn. \n\nEDIT: Grammar. ", "edited": 1492188722.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting prompt. I&amp;#39;m a huge dino nerd, so the topic tickles my fancy. However, I don&amp;#39;t think it was structured very well. &lt;/p&gt;\n\n&lt;p&gt;Instead of throwing a slew of random dinosaur species at humanity, let&amp;#39;s first start with just one species and go from there. You&amp;#39;ll see why.&lt;/p&gt;\n\n&lt;p&gt;Starting small, let&amp;#39;s say the entirety of the Deinonychus species on any given day (not all that ever existed) is pitted against the whole of humanity without modern technology. So that&amp;#39;s 7.5 billion people versus possibly fifty thousand dinos comparable in size to large leopards. Going off of rule 6, we&amp;#39;d all be lined up facing each other like militia, except we&amp;#39;d be five miles apart marching toward the middle. If the dinos are also marching towards the center, it stands to reason that they wouldn&amp;#39;t be following instinct, so natural behavior isn&amp;#39;t an issue. Realistically, a lot of us would be killed. Like, &lt;em&gt;a lot&lt;/em&gt;. Our sheer numbers would be enough to smother them and eventually pull out the win, but our population would probably be reduced by a fourth. Deinonychus was built for speed and killing efficiency, and without the need to eat, sleep, or reproduce, they&amp;#39;d just kill. One would jump on someone, bite their neck, jump on another person, eviscerate them with their toe claws, someone would try to grab them but they&amp;#39;d get their jugular sliced open by the dino&amp;#39;s handclaws - rinse and repeat. Deinonychus were bigger and far more dangerous than most people give them credit for. &lt;a href=\"https://en.wikipedia.org/wiki/Deinonychus#/media/File:Deinonychus-scale.png\"&gt;These guys&lt;/a&gt; were over ten feet long and weighed as much as a healthy 6ft+ tall adult male (220 lb high estimate). If one had a running start and jumped on you, it&amp;#39;d feel like getting hit by a small car. They wouldn&amp;#39;t go down easy, especially if all we had were our fists and rock knives.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Next, we&amp;#39;ll move up the food chain to another carnivore, Allosaurus. Disregarding the possible size of &lt;a href=\"https://en.wikipedia.org/wiki/Epanterias\"&gt;Epanterias&lt;/a&gt;, Allosaurus averaged 30 ft long, seven or eight feet at the shoulders, and around one and a half tons. These guys completely out-classed us in the size department. I&amp;#39;m not entirely sure how many of them there would&amp;#39;ve been at any given time, so I&amp;#39;ll give an estimate of thirty thousand. I&amp;#39;d imagine taking one down would require dozens of men using their combined weight to hold the creature down, but that&amp;#39;s assuming it doesn&amp;#39;t fight back. Given the power an adult Allosaurus would&amp;#39;ve had, it could easily plow through a wall of humans and use its sheer size to cripple and kill with each step. Again, it would boil down to a numbers game. With peak human strength and primitive rock knives we&amp;#39;d secure a win in the long run, but not without severe loss. I&amp;#39;d say near half of our population would lay crushed and broken on the battlefield when it&amp;#39;s all over. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The motherfucker known as T.rex. This guy doesn&amp;#39;t give a shit. At 40 feet long, twelve feet tall at the hips, and anywhere from &lt;em&gt;eight to eighteen fucking tons&lt;/em&gt;, this behemoth would do insane damage. Even just one would be enough to slaughter hundreds if not thousands before succumbing to the stab wounds we&amp;#39;d inflict with our shitty rock blades. Assuming that being an apex predator meant having low numbers, I&amp;#39;d think there may have been only twenty thousand of these cunts scaring the shit out of everything on any given day. A single rex would be hard to put down, but when you have a &lt;strong&gt;&lt;em&gt;wall of several thousand fucking goliaths hellbent on raping you&lt;/em&gt;&lt;/strong&gt;, there would be little hope. In the end, our numbers &lt;em&gt;might&lt;/em&gt; squeak out a win for us, but it&amp;#39;s a slim chance. Our only hope would be to scatter them and single them out so they couldn&amp;#39;t cooperate. I&amp;#39;d say 1.5/10, we win. T.rex don&amp;#39;t give a shit. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Combine all three of those species and we&amp;#39;d be facing a hundred thousand prehistoric rapists hellbent on making us dead. We&amp;#39;d have literally have no chance of surviving. A single &lt;a href=\"https://en.wikipedia.org/wiki/Puertasaurus\"&gt;Puertasaurus&lt;/a&gt; would be nigh unstoppable against even fifty thousand humans. The rest of their species could wipe us out by themselves. Bring in the rest of the dinosaur spectrum and suddenly we&amp;#39;re like defenseless plankton getting inhaled by a blue whale. &lt;/p&gt;\n\n&lt;p&gt;Round 1 - We&amp;#39;re fucked, even if we had spears.&lt;/p&gt;\n\n&lt;p&gt;Round 2 - We&amp;#39;re still fucked, but it&amp;#39;d be funny because we all look like we were about to spread some butter on some toast when the dinos arrived. &lt;/p&gt;\n\n&lt;p&gt;Round 3 - This would be tougher for the dinos, but still a complete win for them. Whales can&amp;#39;t do shit on land. If the fight was in the water, we&amp;#39;d have a chance (not accounting for prehistoric reptiles and creatures because they aren&amp;#39;t dinosaurs) only because they&amp;#39;d all drown. &lt;/p&gt;\n\n&lt;p&gt;Round 4 - Even more rape. &lt;/p&gt;\n\n&lt;p&gt;Round 5 - If we would bring tanks, we&amp;#39;d stomp. Assuming a tank would require four people to operate, we&amp;#39;d have 1,875,000,000 tanks at our disposal. Complete and utter win for us 1000/10.&lt;/p&gt;\n\n&lt;p&gt;Round 6 - Combining all the dinosaur species taken from snapshots from each period, I&amp;#39;ll give a lowball estimate of a billion total. We&amp;#39;d have to number in the several hundred trillions to pull out a win.&lt;/p&gt;\n\n&lt;p&gt;Bonus Round - We&amp;#39;d be fucked again. No modern tech means we&amp;#39;d be fighting fist/rock knife against tooth, claw, and horn. &lt;/p&gt;\n\n&lt;p&gt;EDIT: Grammar. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg979wu", "score_hidden": false, "stickied": false, "created": 1492209261.0, "created_utc": 1492180461.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg9m986", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MinkOWar", "parent_id": "t1_dg9agtv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Ok. You're right of course, that makes sense.\n\nI come to a different thought now spawning from that.  Obviously, the infinite plane must be consistent and 'perfect' throighout so there is no denser portion causing it to collapse on itself into planets and black holes, Etc.\n\n\nSo, now I wonder, how quickly does our seven billion combatants imbalance this situation...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok. You&amp;#39;re right of course, that makes sense.&lt;/p&gt;\n\n&lt;p&gt;I come to a different thought now spawning from that.  Obviously, the infinite plane must be consistent and &amp;#39;perfect&amp;#39; throighout so there is no denser portion causing it to collapse on itself into planets and black holes, Etc.&lt;/p&gt;\n\n&lt;p&gt;So, now I wonder, how quickly does our seven billion combatants imbalance this situation...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9m986", "score_hidden": false, "stickied": false, "created": 1492226883.0, "created_utc": 1492198083.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9agtv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Blastifex", "parent_id": "t1_dg996rz", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Most of the mass is still infinitely far away. Here, in the [Feynman Lectures:](http://www.feynmanlectures.caltech.edu/I_13.html) 13-4 is a section entirely about gravity of an infinite plane.\n\nedit: In fact, [someone already did the math.](http://jadenvanadium.tumblr.com/tagged/Infinite-Plane) At Earth density, you'd look at about 4k km of sheet thickness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most of the mass is still infinitely far away. Here, in the &lt;a href=\"http://www.feynmanlectures.caltech.edu/I_13.html\"&gt;Feynman Lectures:&lt;/a&gt; 13-4 is a section entirely about gravity of an infinite plane.&lt;/p&gt;\n\n&lt;p&gt;edit: In fact, &lt;a href=\"http://jadenvanadium.tumblr.com/tagged/Infinite-Plane\"&gt;someone already did the math.&lt;/a&gt; At Earth density, you&amp;#39;d look at about 4k km of sheet thickness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9agtv", "score_hidden": false, "stickied": false, "created": 1492213199.0, "created_utc": 1492184399.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg996rz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MinkOWar", "parent_id": "t1_dg98905", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Gravity falloff is when it radiates from a centre of mass, because it is a spherical field of influence it gets weaker further from the 'point'.  The force of gravity is raiating outward, imagine two lines pointing off a sphere, they get further apart the further away from the centre they are because they are at different angles, yes?\n\nAn infinite plane doesn't have a centre of mass.  All the gravity pulls in straight, parallel lines.  There's no divergence of those 'lines' of gravity's pull.\n\nThat's my sort of ham fisted attempt to explain...  It's a rather colloquial way to describe it. \n\nI suppose we could define the plane as a specific mass infinite plane that gives us 1g of gravity (which will never fall off, it will be 1g to the limits of the universe) but then... What is it made of?  An infinite plane of limited mass would have infinite space between its molecules.  If it has a finite density, it must have infinite mass.  If it has infinitesimal density, what are they standing on and breathing?  If we somehow allow the finite mass infinite plane to hold our combatants up... Is the air and ground only locally provided on this infinite plane, and thus quickly causing the air to spread out across the plane until our combatants asphyxiate?  Or is the air now infinite(same infinite mass problem again).\n\nMostly I just made the comment as a bit of a physics joke, but it's interesting to realise the problems with infinite things :D", "edited": 1492183762.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gravity falloff is when it radiates from a centre of mass, because it is a spherical field of influence it gets weaker further from the &amp;#39;point&amp;#39;.  The force of gravity is raiating outward, imagine two lines pointing off a sphere, they get further apart the further away from the centre they are because they are at different angles, yes?&lt;/p&gt;\n\n&lt;p&gt;An infinite plane doesn&amp;#39;t have a centre of mass.  All the gravity pulls in straight, parallel lines.  There&amp;#39;s no divergence of those &amp;#39;lines&amp;#39; of gravity&amp;#39;s pull.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s my sort of ham fisted attempt to explain...  It&amp;#39;s a rather colloquial way to describe it. &lt;/p&gt;\n\n&lt;p&gt;I suppose we could define the plane as a specific mass infinite plane that gives us 1g of gravity (which will never fall off, it will be 1g to the limits of the universe) but then... What is it made of?  An infinite plane of limited mass would have infinite space between its molecules.  If it has a finite density, it must have infinite mass.  If it has infinitesimal density, what are they standing on and breathing?  If we somehow allow the finite mass infinite plane to hold our combatants up... Is the air and ground only locally provided on this infinite plane, and thus quickly causing the air to spread out across the plane until our combatants asphyxiate?  Or is the air now infinite(same infinite mass problem again).&lt;/p&gt;\n\n&lt;p&gt;Mostly I just made the comment as a bit of a physics joke, but it&amp;#39;s interesting to realise the problems with infinite things :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg996rz", "score_hidden": false, "stickied": false, "created": 1492211676.0, "created_utc": 1492182876.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98905", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Blastifex", "parent_id": "t1_dg971cp", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "If the plane is infinite, but flat and relatively thin, then the gravity will be fairly weak at all points. Gravity falls off quickly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the plane is infinite, but flat and relatively thin, then the gravity will be fairly weak at all points. Gravity falls off quickly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg98905", "score_hidden": false, "stickied": false, "created": 1492210516.0, "created_utc": 1492181716.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg971cp", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "jay_of_walker", "parent_id": "t1_dg96aos", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "I believe he's referring to the infinite plain mentioned in the scenario.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe he&amp;#39;s referring to the infinite plain mentioned in the scenario.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg971cp", "score_hidden": false, "stickied": false, "created": 1492208949.0, "created_utc": 1492180149.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg978ey", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MinkOWar", "parent_id": "t1_dg96aos", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "The mass is infinite because the plain they are battling on is an infinite plane. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The mass is infinite because the plain they are battling on is an infinite plane. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg978ey", "score_hidden": false, "stickied": false, "created": 1492209206.0, "created_utc": 1492180406.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg96aos", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "last657", "parent_id": "t1_dg94vwc", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "I'm not sure where you get the impression that there is anywhere near enough mass for something like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure where you get the impression that there is anywhere near enough mass for something like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg96aos", "score_hidden": false, "stickied": false, "created": 1492207956.0, "created_utc": 1492179156.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg9ctwl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Papa-Pasta", "parent_id": "t1_dg94vwc", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Imagine that the sick divine entity in charge of this whole event created the arena to have earth's gravity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Imagine that the sick divine entity in charge of this whole event created the arena to have earth&amp;#39;s gravity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9ctwl", "score_hidden": false, "stickied": false, "created": 1492215852.0, "created_utc": 1492187052.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg94vwc", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MinkOWar", "parent_id": "t3_65b9pv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Won't this jusy end in a draw as all participants are crushed by the infinite gravity?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Won&amp;#39;t this jusy end in a draw as all participants are crushed by the infinite gravity?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg94vwc", "score_hidden": false, "stickied": false, "created": 1492205922.0, "created_utc": 1492177122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg9efvh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Mace55555", "parent_id": "t3_65b9pv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "I... don't really understand how this is fair fight. The prompt makes it seem like the Dinosaurs are aware that the humans are coming. In this instance how would the humans craft or prepare anything to help them? Youre pitting humans, whom have no natural defences nor offences, againt several million dinosaurs, many of which are ten times as large, and thousands of times more deadly. You might as well just make the prompt \"can humans beat all dinosaurs? They start in front of all carnivorous species, in the fetal position.\"\n\nFor this to be any kind of challenge for the Dinosaurs, you need to either start them farther apart, give them prep on the plane, or make the Dinosaurs unaware of the humans' arrival. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I... don&amp;#39;t really understand how this is fair fight. The prompt makes it seem like the Dinosaurs are aware that the humans are coming. In this instance how would the humans craft or prepare anything to help them? Youre pitting humans, whom have no natural defences nor offences, againt several million dinosaurs, many of which are ten times as large, and thousands of times more deadly. You might as well just make the prompt &amp;quot;can humans beat all dinosaurs? They start in front of all carnivorous species, in the fetal position.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;For this to be any kind of challenge for the Dinosaurs, you need to either start them farther apart, give them prep on the plane, or make the Dinosaurs unaware of the humans&amp;#39; arrival. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9efvh", "score_hidden": false, "stickied": false, "created": 1492217665.0, "created_utc": 1492188865.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg9xnjq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jake_eric", "parent_id": "t1_dg97can", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Wooden spears aren't gonna do much against the larger species. A Tyranosaur is going straight through the human wall without flinching. An Argentinosaurus wouldn't even notice unless he feels something in his foot.\n\nAnd the smaller species like raptors aren't just gonna let themselves be stabbed. Humans are slow and weak compared to a good-size raptor, they'd be ripping us in two. A lack of a good shield would mean it's not a very strong wall.\n\nAlso, you think the dinosaurs are gonna wait until we have sufficient weapons? The time it takes packs of thousands upon thousands of raptors to travel five miles is not enough time to make weapons.\n\nHumans aren't going to be the ones marching over carcasses.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wooden spears aren&amp;#39;t gonna do much against the larger species. A Tyranosaur is going straight through the human wall without flinching. An Argentinosaurus wouldn&amp;#39;t even notice unless he feels something in his foot.&lt;/p&gt;\n\n&lt;p&gt;And the smaller species like raptors aren&amp;#39;t just gonna let themselves be stabbed. Humans are slow and weak compared to a good-size raptor, they&amp;#39;d be ripping us in two. A lack of a good shield would mean it&amp;#39;s not a very strong wall.&lt;/p&gt;\n\n&lt;p&gt;Also, you think the dinosaurs are gonna wait until we have sufficient weapons? The time it takes packs of thousands upon thousands of raptors to travel five miles is not enough time to make weapons.&lt;/p&gt;\n\n&lt;p&gt;Humans aren&amp;#39;t going to be the ones marching over carcasses.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9xnjq", "score_hidden": false, "stickied": false, "created": 1492241337.0, "created_utc": 1492212537.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dgadisx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Iamnotburgerking", "parent_id": "t1_dg97can", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Good luck preventing gigantic animals from just running over your plan.\n\nHow would a wall of spears hold back a big sauropod? \n\nYou'd need a tank, minimum, to kill just one, let alone a few million of them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck preventing gigantic animals from just running over your plan.&lt;/p&gt;\n\n&lt;p&gt;How would a wall of spears hold back a big sauropod? &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;d need a tank, minimum, to kill just one, let alone a few million of them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgadisx", "score_hidden": false, "stickied": false, "created": 1492265954.0, "created_utc": 1492237154.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97can", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DracoLunaris", "parent_id": "t3_65b9pv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "humanity uses the one month of prep to teach everyone how to make spears out of anything they find in their environment as well as where to stab dinos. upon arrival 5 miles from their opponents humanity deforests their entire starting area and forms a 7.5 billion person strong [Phalanx](https://scottthong.files.wordpress.com/2007/05/800px-phalanx.jpg). the wall of spears advances slowly and methodically stabbing the dinosaurs, as they match over the carcass the back line harvests the bones and teeth to make more, better, spears. whether they win or not depends on the population number of big dinosaurs that will damage the spear wall before succumbing to puncture wounds. Its a battle of attrition to see if those breaches add up to enough losses to destroy the cohesion of the wall before the last big dinosaur dies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;humanity uses the one month of prep to teach everyone how to make spears out of anything they find in their environment as well as where to stab dinos. upon arrival 5 miles from their opponents humanity deforests their entire starting area and forms a 7.5 billion person strong &lt;a href=\"https://scottthong.files.wordpress.com/2007/05/800px-phalanx.jpg\"&gt;Phalanx&lt;/a&gt;. the wall of spears advances slowly and methodically stabbing the dinosaurs, as they match over the carcass the back line harvests the bones and teeth to make more, better, spears. whether they win or not depends on the population number of big dinosaurs that will damage the spear wall before succumbing to puncture wounds. Its a battle of attrition to see if those breaches add up to enough losses to destroy the cohesion of the wall before the last big dinosaur dies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg97can", "score_hidden": false, "stickied": false, "created": 1492209348.0, "created_utc": 1492180548.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dgadi72", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Iamnotburgerking", "parent_id": "t1_dg90g5u", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Pre-Bronze Age humans still killed off a lot of species", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pre-Bronze Age humans still killed off a lot of species&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgadi72", "score_hidden": false, "stickied": false, "created": 1492265917.0, "created_utc": 1492237117.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90g5u", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "hiphopapotamus1", "parent_id": "t3_65b9pv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Humans are adapted to wider range of environmental stressors.\n\nIf its vs nature, humans win. \n\nIf its vs eachother, dinosaurs win many battles 1v1\n\nIf its humanity as we know it vs all dinosaurs, humanity wins.\n\nPre bronze age humans are fucked.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Humans are adapted to wider range of environmental stressors.&lt;/p&gt;\n\n&lt;p&gt;If its vs nature, humans win. &lt;/p&gt;\n\n&lt;p&gt;If its vs eachother, dinosaurs win many battles 1v1&lt;/p&gt;\n\n&lt;p&gt;If its humanity as we know it vs all dinosaurs, humanity wins.&lt;/p&gt;\n\n&lt;p&gt;Pre bronze age humans are fucked.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg90g5u", "score_hidden": false, "stickied": false, "created": 1492196961.0, "created_utc": 1492168161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg9g5k1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Papa-Pasta", "parent_id": "t1_dg9eo7u", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "I think I will add that as another round. That option never came up last night when discussing it with my roomates, and it would definetly help in evening out the odds", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I will add that as another round. That option never came up last night when discussing it with my roomates, and it would definetly help in evening out the odds&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9g5k1", "score_hidden": false, "stickied": false, "created": 1492219625.0, "created_utc": 1492190825.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9eo7u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Macaronimonster", "parent_id": "t3_65b9pv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "I think giving humans prep time to build defences/weapons as well as tools to do it with would be fair. We literally stand no chance with fist vs tooth/claw.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think giving humans prep time to build defences/weapons as well as tools to do it with would be fair. We literally stand no chance with fist vs tooth/claw.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9eo7u", "score_hidden": false, "stickied": false, "created": 1492217923.0, "created_utc": 1492189123.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dgahrq2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Duckroller2", "parent_id": "t1_dg9kwr5", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Make traps, hang ropes to trip Dino's. Make trees fall to crush them. Make pitfalls to kill them. This is literally the best environment humans could ask for.\n\nHell it's easy, throwing spears like crazy and bows by the 1000s. Make defensive walls with wood. With a month of prep humans can't lose this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make traps, hang ropes to trip Dino&amp;#39;s. Make trees fall to crush them. Make pitfalls to kill them. This is literally the best environment humans could ask for.&lt;/p&gt;\n\n&lt;p&gt;Hell it&amp;#39;s easy, throwing spears like crazy and bows by the 1000s. Make defensive walls with wood. With a month of prep humans can&amp;#39;t lose this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgahrq2", "score_hidden": false, "stickied": false, "created": 1492277778.0, "created_utc": 1492248978.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9kwr5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pakratt0013", "parent_id": "t3_65b9pv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Humans vs. killing machines has no chance.  Give them some time prep on the battle ground, and there's a bit more of a chance.  Even then, in a forest/mountain biome, what could modern humanity come up with in a month to combat THAT?!?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Humans vs. killing machines has no chance.  Give them some time prep on the battle ground, and there&amp;#39;s a bit more of a chance.  Even then, in a forest/mountain biome, what could modern humanity come up with in a month to combat THAT?!?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9kwr5", "score_hidden": false, "stickied": false, "created": 1492225253.0, "created_utc": 1492196453.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dgahsmx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Duckroller2", "parent_id": "t1_dg9mkpa", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Humans stomp. Cannons and repeating rifles are insanely powerful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Humans stomp. Cannons and repeating rifles are insanely powerful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgahsmx", "score_hidden": false, "stickied": false, "created": 1492277860.0, "created_utc": 1492249060.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9mkpa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "toadfan64", "parent_id": "t3_65b9pv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Without modern weapons we'd lose. What would be interesting though, is if everyone was give pre WWI weapons. Like guns and cannons from the Civil War and back. Not including ships since we could just shoot from a distance, I think this would be a pretty interesting battle, depending on the amount of ammo humans get.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Without modern weapons we&amp;#39;d lose. What would be interesting though, is if everyone was give pre WWI weapons. Like guns and cannons from the Civil War and back. Not including ships since we could just shoot from a distance, I think this would be a pretty interesting battle, depending on the amount of ammo humans get.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9mkpa", "score_hidden": false, "stickied": false, "created": 1492227264.0, "created_utc": 1492198464.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg92k3m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hiphopapotamus1", "parent_id": "t1_dg91gjv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "\"The\" still leaves it ambiguous though. It doesnt clarify. The Asianic races. The Asians. Includes russians etc. Maybe he really was going for numbers instead of throwing the people with a specific facial shape to the wolves err. Dinosaurs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;The&amp;quot; still leaves it ambiguous though. It doesnt clarify. The Asianic races. The Asians. Includes russians etc. Maybe he really was going for numbers instead of throwing the people with a specific facial shape to the wolves err. Dinosaurs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg92k3m", "score_hidden": false, "stickied": false, "created": 1492201921.0, "created_utc": 1492173121.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg9452u", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Cynical_Assault", "parent_id": "t1_dg91gjv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "&gt; Well, he said *the* Asians\n\nDid you just assume their gender?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Well, he said &lt;em&gt;the&lt;/em&gt; Asians&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Did you just assume their gender?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9452u", "score_hidden": false, "stickied": false, "created": 1492204762.0, "created_utc": 1492175962.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg91gjv", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "EpLiSoN", "parent_id": "t1_dg90imi", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Well, he said *the* Asians, meaning that he's probably talking about everyone living in Asia.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, he said &lt;em&gt;the&lt;/em&gt; Asians, meaning that he&amp;#39;s probably talking about everyone living in Asia.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg91gjv", "score_hidden": false, "stickied": false, "created": 1492199550.0, "created_utc": 1492170750.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90imi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hiphopapotamus1", "parent_id": "t1_dg908cj", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "To be fair its unknown whether or not he actually meant all of the Asianic countries or just Asians as in Chinese, Japanese, etc", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be fair its unknown whether or not he actually meant all of the Asianic countries or just Asians as in Chinese, Japanese, etc&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg90imi", "score_hidden": false, "stickied": false, "created": 1492197149.0, "created_utc": 1492168349.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg908cj", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "EpLiSoN", "parent_id": "t1_dg8x1tj", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Mmhmmm, yup, thinking that throwing away more than 50% of Humanity is a good strategy, and not only that, but *also* specifying them to be *Asian* is a *sure* sign of you being a *sound* and *logical* person.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mmhmmm, yup, thinking that throwing away more than 50% of Humanity is a good strategy, and not only that, but &lt;em&gt;also&lt;/em&gt; specifying them to be &lt;em&gt;Asian&lt;/em&gt; is a &lt;em&gt;sure&lt;/em&gt; sign of you being a &lt;em&gt;sound&lt;/em&gt; and &lt;em&gt;logical&lt;/em&gt; person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg908cj", "score_hidden": false, "stickied": false, "created": 1492196321.0, "created_utc": 1492167521.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65b9pv", "likes": null, "replies": "", "user_reports": [], "id": "dg9e0ny", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mace55555", "parent_id": "t1_dg8x7gk", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "If it's ALL Asians it'd be closer to 50% ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it&amp;#39;s ALL Asians it&amp;#39;d be closer to 50% &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg9e0ny", "score_hidden": false, "stickied": false, "created": 1492217191.0, "created_utc": 1492188391.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8x7gk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Papa-Pasta", "parent_id": "t1_dg8x1tj", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Interesting tactic. I'm assuming you mean to send in a large population as a meat shield to provide time for the other humans to craft weapons? Is it worth losing almost 20% of the population for sharp sticks though?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting tactic. I&amp;#39;m assuming you mean to send in a large population as a meat shield to provide time for the other humans to craft weapons? Is it worth losing almost 20% of the population for sharp sticks though?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg8x7gk", "score_hidden": false, "stickied": false, "created": 1492186576.0, "created_utc": 1492157776.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8x1tj", "gilded": 0, "archived": false, "score": -12, "report_reasons": null, "author": "yann3", "parent_id": "t3_65b9pv", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "I think humans would win IF!\nwe send in the Asians first while the others sharpen sticks \n\nall it takes is one good sharp stick in the right place\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think humans would win IF!\nwe send in the Asians first while the others sharpen sticks &lt;/p&gt;\n\n&lt;p&gt;all it takes is one good sharp stick in the right place&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dg8x1tj", "score_hidden": false, "stickied": false, "created": 1492186104.0, "created_utc": 1492157304.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -12}}], "after": null, "before": null}}]