[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "whowouldwin", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After escaping prison with his new associates, Fisk is desperate to become stronger. His run-ins with Daredevil and the prevalence of other vigilantes like Jessica Jones, Luke Cage, Iron Fist and Spiderman make Fisk rather nervous about his chances of setting up shop in NYC so soon. So with the help of The Hand, Fisk learns that he can find the power he seeks in a remote land. As his private jet flies towards Mt Ebott, it suffers technical faults and begins to crash. Fisk awakens on a flower bed beneath Mt Ebott, met by Flowey. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Round One:&lt;/strong&gt; Wilson Frisk has to make it to the end of Undertale through any means necessary. Death is permanent. How far can he make it, or can he clear it? &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Round Two:&lt;/strong&gt; Wilson Frisk has to complete a genocide run. Stronger monsters of the Underground (like Flowey, Undyne, Sans, etc) can telepathically exploit Wilson to learn about his childhood trauma, his recent failings against Daredevil, and his insane devotion to Vanessa (and then choose to use those details against him). Game mechanics apply in that Wilson Frisk can return to checkpoints when killed (remembering getting killed), gains EXP and LV when killing creatures, and becomes darker as his genocide run continues. Can he best the Genocide Run of Undertale? If not, who stops him?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Round Three:&lt;/strong&gt; Wilson Frisk has to make it to the end of an Undertale Pacifist run. He has to retain his composure throughout the run, abiding by pacifist guidelines and avoiding killing enemies when possible. Again, boss monsters and key characters can exploit his fears and concerns as before. Game mechanics as before when it comes to checkpoints (still possible to go insane from dying over and over), EXP and LV (although I guess if he gains either then he loses). Can he finish a pacifist run, and if not, who manages to break him?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Bonus&lt;/strong&gt;: Wilson Frisk emerges from the Underground after countless deaths and attempts to clear Undertale, coming up triumphant. He&amp;#39;s passed through the barrier, having collected the souls of all the monsters in the Underground &lt;em&gt;and&lt;/em&gt; the stored human souls. Having experienced thousands of years of reattempting the same fights over and over again (sort of like a more gruelling Groundhog Day or Edge of Tomorrow), Wilson Frisk is on the warpath. Can any of the MCU heroes or villains stop Wilson Frisk (more like Wilson Chara) now?&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;TL;DR&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;R1: Kingpin vs Undertale (any ending counts as a win, but no checkpoint reloading on death).&lt;/p&gt;\n\n&lt;p&gt;R2: Kingpin vs Undertale Genocide run (must abide by Genocide rules, Fisk gains EXP and LV with kills and becomes darker, boss enemies can exploit his concern for Vanessa and hate of Daredevil, and checkpoints enabled but death can cause psychological trauma that stacks).&lt;/p&gt;\n\n&lt;p&gt;R3: Kingpin vs Undertale Pacifist (must follow Pacifist guidelines, no killing, no gain of EXP or LV, checkpoints enabled but dying does have psychological trauma that stacks). &lt;/p&gt;\n\n&lt;p&gt;B: Kingpin with all monster &amp;amp; lost human souls/with the power of Asriel Dreemur vs the MCU. Can anyone stop him?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "After escaping prison with his new associates, Fisk is desperate to become stronger. His run-ins with Daredevil and the prevalence of other vigilantes like Jessica Jones, Luke Cage, Iron Fist and Spiderman make Fisk rather nervous about his chances of setting up shop in NYC so soon. So with the help of The Hand, Fisk learns that he can find the power he seeks in a remote land. As his private jet flies towards Mt Ebott, it suffers technical faults and begins to crash. Fisk awakens on a flower bed beneath Mt Ebott, met by Flowey. \n\n**Round One:** Wilson Frisk has to make it to the end of Undertale through any means necessary. Death is permanent. How far can he make it, or can he clear it? \n\n**Round Two:** Wilson Frisk has to complete a genocide run. Stronger monsters of the Underground (like Flowey, Undyne, Sans, etc) can telepathically exploit Wilson to learn about his childhood trauma, his recent failings against Daredevil, and his insane devotion to Vanessa (and then choose to use those details against him). Game mechanics apply in that Wilson Frisk can return to checkpoints when killed (remembering getting killed), gains EXP and LV when killing creatures, and becomes darker as his genocide run continues. Can he best the Genocide Run of Undertale? If not, who stops him?\n\n**Round Three:** Wilson Frisk has to make it to the end of an Undertale Pacifist run. He has to retain his composure throughout the run, abiding by pacifist guidelines and avoiding killing enemies when possible. Again, boss monsters and key characters can exploit his fears and concerns as before. Game mechanics as before when it comes to checkpoints (still possible to go insane from dying over and over), EXP and LV (although I guess if he gains either then he loses). Can he finish a pacifist run, and if not, who manages to break him?\n\n**Bonus**: Wilson Frisk emerges from the Underground after countless deaths and attempts to clear Undertale, coming up triumphant. He's passed through the barrier, having collected the souls of all the monsters in the Underground *and* the stored human souls. Having experienced thousands of years of reattempting the same fights over and over again (sort of like a more gruelling Groundhog Day or Edge of Tomorrow), Wilson Frisk is on the warpath. Can any of the MCU heroes or villains stop Wilson Frisk (more like Wilson Chara) now?\n\n*TL;DR*\n\nR1: Kingpin vs Undertale (any ending counts as a win, but no checkpoint reloading on death).\n\nR2: Kingpin vs Undertale Genocide run (must abide by Genocide rules, Fisk gains EXP and LV with kills and becomes darker, boss enemies can exploit his concern for Vanessa and hate of Daredevil, and checkpoints enabled but death can cause psychological trauma that stacks).\n\nR3: Kingpin vs Undertale Pacifist (must follow Pacifist guidelines, no killing, no gain of EXP or LV, checkpoints enabled but dying does have psychological trauma that stacks). \n\nB: Kingpin with all monster &amp; lost human souls/with the power of Asriel Dreemur vs the MCU. Can anyone stop him?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Casual", "id": "65m37b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 33, "report_reasons": null, "author": "lordolxinator", "saved": false, "mod_reports": [], "name": "t3_65m37b", "subreddit_name_prefixed": "r/whowouldwin", "approved_by": null, "over_18": false, "domain": "self.whowouldwin", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2s599", "edited": false, "link_flair_css_class": "Casual", "author_flair_css_class": "0585", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/whowouldwin/comments/65m37b/the_kingpin_mcu_awakens_in_the_underground_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492327111.0, "url": "https://www.reddit.com/r/whowouldwin/comments/65m37b/the_kingpin_mcu_awakens_in_the_underground_and/", "author_flair_text": null, "quarantine": false, "title": "The Kingpin (MCU) awakens in the Underground, and must best the trials of Undertale. He is Wilson Frisk, and how does he do?", "created_utc": 1492298311.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 33}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65m37b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65m37b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65m37b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65m37b", "likes": null, "replies": "", "user_reports": [], "id": "dgciki8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lordolxinator", "parent_id": "t1_dgc2to6", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Likely yes, as I believe fireworks were seen as decorations in part of Undertale (either in Snowdin or the Dump), and Mettaton's prolific use of bombs against Frisk. I think it's less about the bullets, and more about the guns themselves (what with the firing mechanisms and gun maintenance). If Alphys was working on making the guns operable or creating new guns, I'm sure the Underground would have a bunch. But why bother now when the Underground is a *mostly* peaceful place and the Humans are separated by the barrier? Given how Asgore is a generally peaceful guy, he wouldn't tell Alphys to work on guns, certainly not over her DETERMINATION experiments to break the barrier. Well, that's besides the point I suppose. \n\nI think it depends how he hears about her I suppose. Heresay and exaggeration? Going to underestimate her. Manages to catch a glimpse of her in action? Might be a bit more cautious about how he goes against her. Maybe he finds out about Alphys and uses her against Undyne?\n\nGood thoughts there, I agree!\n\nAh of course, I mistook what you thought there. Wholeheartedly agree with that assumption.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Likely yes, as I believe fireworks were seen as decorations in part of Undertale (either in Snowdin or the Dump), and Mettaton&amp;#39;s prolific use of bombs against Frisk. I think it&amp;#39;s less about the bullets, and more about the guns themselves (what with the firing mechanisms and gun maintenance). If Alphys was working on making the guns operable or creating new guns, I&amp;#39;m sure the Underground would have a bunch. But why bother now when the Underground is a &lt;em&gt;mostly&lt;/em&gt; peaceful place and the Humans are separated by the barrier? Given how Asgore is a generally peaceful guy, he wouldn&amp;#39;t tell Alphys to work on guns, certainly not over her DETERMINATION experiments to break the barrier. Well, that&amp;#39;s besides the point I suppose. &lt;/p&gt;\n\n&lt;p&gt;I think it depends how he hears about her I suppose. Heresay and exaggeration? Going to underestimate her. Manages to catch a glimpse of her in action? Might be a bit more cautious about how he goes against her. Maybe he finds out about Alphys and uses her against Undyne?&lt;/p&gt;\n\n&lt;p&gt;Good thoughts there, I agree!&lt;/p&gt;\n\n&lt;p&gt;Ah of course, I mistook what you thought there. Wholeheartedly agree with that assumption.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgciki8", "score_hidden": false, "stickied": false, "created": 1492402748.0, "created_utc": 1492373948.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc2to6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MunitionsFrenzy", "parent_id": "t1_dgbx5mf", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "&gt; blowing up her house with her inside\n\nDoes gunpowder even exist in the Underground? I don't recall. They can't figure out how to get discarded firearms from the human world to work, so at least we know they can't make bullets.\n\nOther than that, though, yeah, I agree that he could *potentially* figure out some other way to get past Undyne. The problem is that I don't think he'll realize that he **should**. Sure, the monsters all treat Undyne as some unstoppable force of nature, but all the monsters he's seen up to that point are complete pushovers, so I doubt he'd actually be worried. He'd probably underestimate her massively, assuming she's just slightly stronger than every other monster, and get trounced. As long as he doesn't think he's in severe danger, Fisk likes getting his hands dirty in direct fights.\n\n&gt; I'd go with Sans trying his best to keep his promise\n\nI think Fisk has a pretty damn good chance, in that case. Again, the longer Fisk fights through the Underground, the more his DETERMINATION grows. By the end, he should be willing to try an assload of times against Sans until he manages to land a hit that Sans doesn't dodge, right at the start of the fight.\n\n&gt; Where do you think Fisk is unable to adhere to pacifism, and just attacks out of rage?\n\nIt's not exactly that I think he'd give up on doing a pacifist run. I just think that he eventually fails to load his SAVE because he runs out of DETERMINATION. Fisk's DETERMINATION normally manifests through his drive to achieve his goals *by any means necessary*, and a pacifist run stops him from using any means necessary. So I think he eventually runs out of DETERMINATION, and that's a problem against Asriel because he's guaranteed to die in that fight no matter how good his dodging is (due to Asriel's final attack).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;blowing up her house with her inside&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Does gunpowder even exist in the Underground? I don&amp;#39;t recall. They can&amp;#39;t figure out how to get discarded firearms from the human world to work, so at least we know they can&amp;#39;t make bullets.&lt;/p&gt;\n\n&lt;p&gt;Other than that, though, yeah, I agree that he could &lt;em&gt;potentially&lt;/em&gt; figure out some other way to get past Undyne. The problem is that I don&amp;#39;t think he&amp;#39;ll realize that he &lt;strong&gt;should&lt;/strong&gt;. Sure, the monsters all treat Undyne as some unstoppable force of nature, but all the monsters he&amp;#39;s seen up to that point are complete pushovers, so I doubt he&amp;#39;d actually be worried. He&amp;#39;d probably underestimate her massively, assuming she&amp;#39;s just slightly stronger than every other monster, and get trounced. As long as he doesn&amp;#39;t think he&amp;#39;s in severe danger, Fisk likes getting his hands dirty in direct fights.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;d go with Sans trying his best to keep his promise&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think Fisk has a pretty damn good chance, in that case. Again, the longer Fisk fights through the Underground, the more his DETERMINATION grows. By the end, he should be willing to try an assload of times against Sans until he manages to land a hit that Sans doesn&amp;#39;t dodge, right at the start of the fight.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Where do you think Fisk is unable to adhere to pacifism, and just attacks out of rage?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s not exactly that I think he&amp;#39;d give up on doing a pacifist run. I just think that he eventually fails to load his SAVE because he runs out of DETERMINATION. Fisk&amp;#39;s DETERMINATION normally manifests through his drive to achieve his goals &lt;em&gt;by any means necessary&lt;/em&gt;, and a pacifist run stops him from using any means necessary. So I think he eventually runs out of DETERMINATION, and that&amp;#39;s a problem against Asriel because he&amp;#39;s guaranteed to die in that fight no matter how good his dodging is (due to Asriel&amp;#39;s final attack).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgc2to6", "score_hidden": false, "stickied": false, "created": 1492381490.0, "created_utc": 1492352690.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbx5mf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lordolxinator", "parent_id": "t1_dgbrrec", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Good analysis! I agree that he wouldn't get past Undyne. Well, not following the story anyway. If he was smart (like he *tends* to be in Daredevil), he'd gauge what Undyne was like from the people of Snowdin, and realise that as a human (and not a small innocent one) he'd be toast if she caught him. So if he deviated from the storyline, he could get past Undyne by blowing up her house with her inside, or by disguising himself as a monster to progress into Hotland where she can't follow. Of course Fisk likely can't proceed much further anyway due to Mettaton's antics and boss battle (maybe even the the Spider boss battle would defeat him), but if he *could* deviate, I think he could beat Undyne. Only way though, as she wrecks him otherwise. Well, maybe if he was on a Genocide run the gained EXP, LV and DETERMINATION would amp Fisk's physicals to be able to beat Undyne, but that's kind of hard to tell.\n\nOh I'd agree there. I *was* thinking that Fisk would be the perfect (man)child to Toriel, helping out around the house and eating Butterscotch Pie all the time. Then Toriel (during one of her Knock Knock meetings) would ask Sans to promise to look after Fisk if he ever came out into the Underground, as although he has a bit of a temper at times she feels he's a \"good boy underneath\". Of course Fisk wouldn't leave for a while, but probably would after realising Vanessa is at the mercy of types like Daredevil. Toriel would attempt to stop him from leaving, and Fisk would kill her in a rage. Maybe then Sans would still kill him ASAP, but for the sake of not instantly losing, I'd go with Sans trying his best to keep his promise, only confronting Fisk in the Halls of Judgement at the end of the game. Of course there Fisk would likely still lose (unless all the accumulated EXP, LV and DETERMINATION amped his skills to beyond Sans's skills), but how do you think things go now?\n\nExcellent point there, Where do you think Fisk is unable to adhere to pacifism, and just attacks out of rage?\n\nThat's what I thought, what with the savestate manipulation and whatnot. His abilities seem *somewhat* like those of the Infinity Gauntlet... Shame Infinity War hasn't happened yet, or we could have some feats for Infinity Gauntlet Thanos vs Undertale God Fisk.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good analysis! I agree that he wouldn&amp;#39;t get past Undyne. Well, not following the story anyway. If he was smart (like he &lt;em&gt;tends&lt;/em&gt; to be in Daredevil), he&amp;#39;d gauge what Undyne was like from the people of Snowdin, and realise that as a human (and not a small innocent one) he&amp;#39;d be toast if she caught him. So if he deviated from the storyline, he could get past Undyne by blowing up her house with her inside, or by disguising himself as a monster to progress into Hotland where she can&amp;#39;t follow. Of course Fisk likely can&amp;#39;t proceed much further anyway due to Mettaton&amp;#39;s antics and boss battle (maybe even the the Spider boss battle would defeat him), but if he &lt;em&gt;could&lt;/em&gt; deviate, I think he could beat Undyne. Only way though, as she wrecks him otherwise. Well, maybe if he was on a Genocide run the gained EXP, LV and DETERMINATION would amp Fisk&amp;#39;s physicals to be able to beat Undyne, but that&amp;#39;s kind of hard to tell.&lt;/p&gt;\n\n&lt;p&gt;Oh I&amp;#39;d agree there. I &lt;em&gt;was&lt;/em&gt; thinking that Fisk would be the perfect (man)child to Toriel, helping out around the house and eating Butterscotch Pie all the time. Then Toriel (during one of her Knock Knock meetings) would ask Sans to promise to look after Fisk if he ever came out into the Underground, as although he has a bit of a temper at times she feels he&amp;#39;s a &amp;quot;good boy underneath&amp;quot;. Of course Fisk wouldn&amp;#39;t leave for a while, but probably would after realising Vanessa is at the mercy of types like Daredevil. Toriel would attempt to stop him from leaving, and Fisk would kill her in a rage. Maybe then Sans would still kill him ASAP, but for the sake of not instantly losing, I&amp;#39;d go with Sans trying his best to keep his promise, only confronting Fisk in the Halls of Judgement at the end of the game. Of course there Fisk would likely still lose (unless all the accumulated EXP, LV and DETERMINATION amped his skills to beyond Sans&amp;#39;s skills), but how do you think things go now?&lt;/p&gt;\n\n&lt;p&gt;Excellent point there, Where do you think Fisk is unable to adhere to pacifism, and just attacks out of rage?&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what I thought, what with the savestate manipulation and whatnot. His abilities seem &lt;em&gt;somewhat&lt;/em&gt; like those of the Infinity Gauntlet... Shame Infinity War hasn&amp;#39;t happened yet, or we could have some feats for Infinity Gauntlet Thanos vs Undertale God Fisk.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgbx5mf", "score_hidden": false, "stickied": false, "created": 1492368636.0, "created_utc": 1492339836.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrrec", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MunitionsFrenzy", "parent_id": "t3_65m37b", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "**R1** : Permadeath means he probably gets wrecked by Undyne regardless of what path he chooses, so no. She significantly out-stats him, even if she's not in Undyne the Undying mode. (Which she shouldn't be. Fisk will totally hurt people to get what he wants, but he doesn't go around randomly murdering everyone. He won't be doing a Genocide run.)\n\n**R2** : Oh, I guess he *will* be doing a Genocide run. Well, his DETERMINATION is probably sufficient to give him respawns. Still, he's in trouble: Sans is probably going to try to murder him right at the beginning, since he doesn't look like a harmless child as Frisk did. Sans let Genocide!Frisk run for a while hoping that Frisk would eventually turn nice, but Fisk does not look like he will suddenly have a change of heart. A serious Sans and Papyrus double-team on Fisk before he has the LV to stand up to them will end up killing him a **lot** of times. On the ~~bright~~ horrifying side, Fisk tends to become *more* determined after setbacks rather than just giving up, so he might still manage to kill them both before despair finally sets in and his DETERMINATION fails. If he does win this part, Sans' XP will make the rest of the run a lot easier, including letting him take down Undyne the Undying without a huge amount of fuss.\n\nHonestly, what might be even tougher than beating Sans + Papyrus while low on LV would be actually bringing himself to kill Toriel. Fisk's not gonna be thrilled about being forced to murder a mother-figure like GoatMom.\n\n**R3** : Fisk doesn't have the DETERMINATION to survive a Pacifist run. His DETERMINATION comes from his will to do whatever he needs to do in order to accomplish his goals, so intentionally restricting himself by not hurting people will kill his own willpower. And unfortunately he *requires* a huge amount of DETERMINATION to do a Pacifist run, because Asriel's final attack (the one that brings Frisk to 0.000001 health) will kill him otherwise.\n\n**BONUS** : MCU's fucked against Wilson Frisk's timeline fuckery since Strange doesn't have the Eye anymore, and even then it wouldn't be a guaranteed win for Strange.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;R1&lt;/strong&gt; : Permadeath means he probably gets wrecked by Undyne regardless of what path he chooses, so no. She significantly out-stats him, even if she&amp;#39;s not in Undyne the Undying mode. (Which she shouldn&amp;#39;t be. Fisk will totally hurt people to get what he wants, but he doesn&amp;#39;t go around randomly murdering everyone. He won&amp;#39;t be doing a Genocide run.)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;R2&lt;/strong&gt; : Oh, I guess he &lt;em&gt;will&lt;/em&gt; be doing a Genocide run. Well, his DETERMINATION is probably sufficient to give him respawns. Still, he&amp;#39;s in trouble: Sans is probably going to try to murder him right at the beginning, since he doesn&amp;#39;t look like a harmless child as Frisk did. Sans let Genocide!Frisk run for a while hoping that Frisk would eventually turn nice, but Fisk does not look like he will suddenly have a change of heart. A serious Sans and Papyrus double-team on Fisk before he has the LV to stand up to them will end up killing him a &lt;strong&gt;lot&lt;/strong&gt; of times. On the &lt;del&gt;bright&lt;/del&gt; horrifying side, Fisk tends to become &lt;em&gt;more&lt;/em&gt; determined after setbacks rather than just giving up, so he might still manage to kill them both before despair finally sets in and his DETERMINATION fails. If he does win this part, Sans&amp;#39; XP will make the rest of the run a lot easier, including letting him take down Undyne the Undying without a huge amount of fuss.&lt;/p&gt;\n\n&lt;p&gt;Honestly, what might be even tougher than beating Sans + Papyrus while low on LV would be actually bringing himself to kill Toriel. Fisk&amp;#39;s not gonna be thrilled about being forced to murder a mother-figure like GoatMom.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;R3&lt;/strong&gt; : Fisk doesn&amp;#39;t have the DETERMINATION to survive a Pacifist run. His DETERMINATION comes from his will to do whatever he needs to do in order to accomplish his goals, so intentionally restricting himself by not hurting people will kill his own willpower. And unfortunately he &lt;em&gt;requires&lt;/em&gt; a huge amount of DETERMINATION to do a Pacifist run, because Asriel&amp;#39;s final attack (the one that brings Frisk to 0.000001 health) will kill him otherwise.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;BONUS&lt;/strong&gt; : MCU&amp;#39;s fucked against Wilson Frisk&amp;#39;s timeline fuckery since Strange doesn&amp;#39;t have the Eye anymore, and even then it wouldn&amp;#39;t be a guaranteed win for Strange.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgbrrec", "score_hidden": false, "stickied": false, "created": 1492352145.0, "created_utc": 1492323345.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65m37b", "likes": null, "replies": "", "user_reports": [], "id": "dgbngep", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sixbones", "parent_id": "t3_65m37b", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "I'll explain it fully tomorrow as it's Midnight but Undertale stomps all rounds", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll explain it fully tomorrow as it&amp;#39;s Midnight but Undertale stomps all rounds&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgbngep", "score_hidden": false, "stickied": false, "created": 1492343955.0, "created_utc": 1492315155.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]