[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "whowouldwin", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Imagine if the troll at the battle of Moria would have stabbed Frodo in the face where his mithril-shirt couldn&amp;#39;t have saved his life. How would the story progress? Who would take on the burden of the ring? Could they still make it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Imagine if the troll at the battle of Moria would have stabbed Frodo in the face where his mithril-shirt couldn't have saved his life. How would the story progress? Who would take on the burden of the ring? Could they still make it?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "WritingPrompt", "id": "65ogma", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 59, "report_reasons": null, "author": "masterfroo24", "saved": false, "mod_reports": [], "name": "t3_65ogma", "subreddit_name_prefixed": "r/whowouldwin", "approved_by": null, "over_18": false, "domain": "self.whowouldwin", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2s599", "edited": false, "link_flair_css_class": "WritingPrompt", "author_flair_css_class": "0333", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/whowouldwin/comments/65ogma/the_fellowship_of_the_ring_minus_frodo_vs_their/", "num_reports": null, "locked": false, "stickied": false, "created": 1492366432.0, "url": "https://www.reddit.com/r/whowouldwin/comments/65ogma/the_fellowship_of_the_ring_minus_frodo_vs_their/", "author_flair_text": "", "quarantine": false, "title": "The fellowship of the ring minus Frodo vs. their mission", "created_utc": 1492337632.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 59}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65ogma", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65ogma", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65ogma", "likes": null, "replies": "", "user_reports": [], "id": "dgcdbxq", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Willie9", "parent_id": "t1_dgc6lag", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "The reason I say Aragorn hides his royal identity is because he really doesnt want to stir things in Minas Tirith. In the books when he first enters the city to heal Eowyn, Faramir, and Merry, he doesn't declare himself king, rather chieftain of the rangers, because he hadn't yet been accepted as King by the Steward. In my hypothetical, he doesn't have the kings banner yet, and with the Ring in the city he would be even more cautious about incensing Denethor. Although Denethor may well already known that Aragorn was to claim the throne; he is far-sighted, and possesses a Palantir.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The reason I say Aragorn hides his royal identity is because he really doesnt want to stir things in Minas Tirith. In the books when he first enters the city to heal Eowyn, Faramir, and Merry, he doesn&amp;#39;t declare himself king, rather chieftain of the rangers, because he hadn&amp;#39;t yet been accepted as King by the Steward. In my hypothetical, he doesn&amp;#39;t have the kings banner yet, and with the Ring in the city he would be even more cautious about incensing Denethor. Although Denethor may well already known that Aragorn was to claim the throne; he is far-sighted, and possesses a Palantir.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgcdbxq", "score_hidden": false, "stickied": false, "created": 1492395850.0, "created_utc": 1492367050.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6lag", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "nthan333", "parent_id": "t1_dgc03s2", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Hmm the biggest qualm I find with this is that Aragorn in the books did not really want to hide his royal identity iirc. He had Anduril like right off the bat and even told the Hobbits his ultimate goal was to use it and claim his Throne. Boromir was also behind this idea once it was revealed to him who Aragorn was at the council of Elrond, and said so at his death. The bigger problem I see is Aragorn meeting Denethor, but with Boromir to vouch for him I'm fairly certain he could take control of Gondor and use one of the seeing stones like he did to have a better plan than to storm the gates head on. \n\nThis is all not accounting for how the Ring corrupts Boromir of course!  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm the biggest qualm I find with this is that Aragorn in the books did not really want to hide his royal identity iirc. He had Anduril like right off the bat and even told the Hobbits his ultimate goal was to use it and claim his Throne. Boromir was also behind this idea once it was revealed to him who Aragorn was at the council of Elrond, and said so at his death. The bigger problem I see is Aragorn meeting Denethor, but with Boromir to vouch for him I&amp;#39;m fairly certain he could take control of Gondor and use one of the seeing stones like he did to have a better plan than to storm the gates head on. &lt;/p&gt;\n\n&lt;p&gt;This is all not accounting for how the Ring corrupts Boromir of course!  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgc6lag", "score_hidden": false, "stickied": false, "created": 1492386941.0, "created_utc": 1492358141.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65ogma", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65ogma", "likes": null, "replies": "", "user_reports": [], "id": "dgcd54h", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Willie9", "parent_id": "t1_dgcatj2", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "I'm assuming Gandalf still falls in Moria. For simplicity's sake I've assumed that he doesn't catch up to the Fellowship in time after the battle of the peak and his resurrection. Even if Gandalf was involved I don't think the mission could have succeeded without Frodo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m assuming Gandalf still falls in Moria. For simplicity&amp;#39;s sake I&amp;#39;ve assumed that he doesn&amp;#39;t catch up to the Fellowship in time after the battle of the peak and his resurrection. Even if Gandalf was involved I don&amp;#39;t think the mission could have succeeded without Frodo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgcd54h", "score_hidden": false, "stickied": false, "created": 1492395599.0, "created_utc": 1492366799.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcatj2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "footwith4toes", "parent_id": "t1_dgc03s2", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Wouldn't Gandalf play a bigger role?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wouldn&amp;#39;t Gandalf play a bigger role?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgcatj2", "score_hidden": false, "stickied": false, "created": 1492392521.0, "created_utc": 1492363721.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc03s2", "gilded": 0, "archived": false, "score": 63, "report_reasons": null, "author": "Willie9", "parent_id": "t3_65ogma", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "(Im going to work off of the books rather than the movies) \n\nNo doubt Sam would bear the ring in Frodo's place. Afterwards, the story would progress mostly the same through Lorien and the journey down the Great River, although Boromir quietly voices his concerns that hobbits are not fit to bear the Ring. Sam, meanwhile, is scared as all hell and really has no idea what he is going to do. When the Fellowship reaches Parth Galen above Rauros, they have a debate on where the Ring should be taken; East, across the river, directly to Mordor, or West, to Minas Tirith, before heading across the River to Mordor.\n\nAs in the original story, most of the Fellowship wants to take the West road, to Minas Tirith. Sam knows that the east road is the better choice, but he lacks the bravery to go out on his own. Instead he stays silent and the decision is made to go to the White City.\n\nHaving made their decision more quickly than in the original story, the Fellowship continues down the North Stair, down the falls of Rauros. On their way down they hear an orc-horn, and above they see the orcs beginning to make their way down the stair. The Fellowship flees down the stair and decides to brave the marshes at the mouths of the entwash, in order to lose the orcs. The Fellowship successfully passes the marshes due to Aragorn's ranger skills, and they come upon the North gate of the Rammas Echor, the large encircling out-wall of mines tirith\n\nThere Boromir, son of the Steward, is welcomed by guards with open arms, and he leads the Fellowship into the Pelennor, and then further into the City itself. Aragorn hides his royal identity. Boromir takes them to the hall of Denethor, and has a warm reunion with his father. He then says \"I've brought a gift\" and bids Sam to show Denethor the Ring. Sam refuses, and Aragorn agrees, saying it should not be revealed. At the word \"gift\" Aragorn shoots Boromir a deadly glare.\n\nThat night, Boromir enters Sam's quarters and, after a discussion, he tries to take the Ring from Sam. Aragorn, however, is waiting in the shadows and defends Sam, drawing Anduril. Boromir flees, and soon soldiers of Gondor enter to apprehend Sam. Aragorn is subdued (he is not going for lethal blows) and Boromir takes the Ring from Sam.\n\nSam, who has been somewhat corrupted by the Ring, attacks Boromir, who viciously throws him aside, perhaps breaking a limb. The Fellowship is imprisoned, and Boromir goes to give the Ring to Denethor, but he finds that he cannot, and instead claims it for his own. He takes control of Minas Tirith and Gondor's armies. He marches on Mordor with a great force, and there he his utterly defeated and betrayed by the ring. Sauron takes the Ring, and with his newfound power conquers all of Middle-Earth. The Elves, when hearing that Sauron has recovered the Ring, mournfully depart Middle-Earth. Arwen departs with many tears, as Aragorn is hewn by orcs in the dungeons of Minas Tirith.\n\nTL;DR without Frodo they're fucked", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(Im going to work off of the books rather than the movies) &lt;/p&gt;\n\n&lt;p&gt;No doubt Sam would bear the ring in Frodo&amp;#39;s place. Afterwards, the story would progress mostly the same through Lorien and the journey down the Great River, although Boromir quietly voices his concerns that hobbits are not fit to bear the Ring. Sam, meanwhile, is scared as all hell and really has no idea what he is going to do. When the Fellowship reaches Parth Galen above Rauros, they have a debate on where the Ring should be taken; East, across the river, directly to Mordor, or West, to Minas Tirith, before heading across the River to Mordor.&lt;/p&gt;\n\n&lt;p&gt;As in the original story, most of the Fellowship wants to take the West road, to Minas Tirith. Sam knows that the east road is the better choice, but he lacks the bravery to go out on his own. Instead he stays silent and the decision is made to go to the White City.&lt;/p&gt;\n\n&lt;p&gt;Having made their decision more quickly than in the original story, the Fellowship continues down the North Stair, down the falls of Rauros. On their way down they hear an orc-horn, and above they see the orcs beginning to make their way down the stair. The Fellowship flees down the stair and decides to brave the marshes at the mouths of the entwash, in order to lose the orcs. The Fellowship successfully passes the marshes due to Aragorn&amp;#39;s ranger skills, and they come upon the North gate of the Rammas Echor, the large encircling out-wall of mines tirith&lt;/p&gt;\n\n&lt;p&gt;There Boromir, son of the Steward, is welcomed by guards with open arms, and he leads the Fellowship into the Pelennor, and then further into the City itself. Aragorn hides his royal identity. Boromir takes them to the hall of Denethor, and has a warm reunion with his father. He then says &amp;quot;I&amp;#39;ve brought a gift&amp;quot; and bids Sam to show Denethor the Ring. Sam refuses, and Aragorn agrees, saying it should not be revealed. At the word &amp;quot;gift&amp;quot; Aragorn shoots Boromir a deadly glare.&lt;/p&gt;\n\n&lt;p&gt;That night, Boromir enters Sam&amp;#39;s quarters and, after a discussion, he tries to take the Ring from Sam. Aragorn, however, is waiting in the shadows and defends Sam, drawing Anduril. Boromir flees, and soon soldiers of Gondor enter to apprehend Sam. Aragorn is subdued (he is not going for lethal blows) and Boromir takes the Ring from Sam.&lt;/p&gt;\n\n&lt;p&gt;Sam, who has been somewhat corrupted by the Ring, attacks Boromir, who viciously throws him aside, perhaps breaking a limb. The Fellowship is imprisoned, and Boromir goes to give the Ring to Denethor, but he finds that he cannot, and instead claims it for his own. He takes control of Minas Tirith and Gondor&amp;#39;s armies. He marches on Mordor with a great force, and there he his utterly defeated and betrayed by the ring. Sauron takes the Ring, and with his newfound power conquers all of Middle-Earth. The Elves, when hearing that Sauron has recovered the Ring, mournfully depart Middle-Earth. Arwen departs with many tears, as Aragorn is hewn by orcs in the dungeons of Minas Tirith.&lt;/p&gt;\n\n&lt;p&gt;TL;DR without Frodo they&amp;#39;re fucked&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgc03s2", "score_hidden": false, "stickied": false, "created": 1492376588.0, "created_utc": 1492347788.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 63}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65ogma", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65ogma", "likes": null, "replies": "", "user_reports": [], "id": "dgc1nk1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pwnz3rfaust", "parent_id": "t1_dgbwyp6", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "What would they do when the ring remained unscathed?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What would they do when the ring remained unscathed?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgc1nk1", "score_hidden": false, "stickied": false, "created": 1492379552.0, "created_utc": 1492350752.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbwyp6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65ogma", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgbwyp6", "score_hidden": false, "stickied": false, "created": 1492367993.0, "created_utc": 1492339193.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65ogma", "likes": null, "replies": "", "user_reports": [], "id": "dgcorwd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Chezni19", "parent_id": "t3_65ogma", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "The party starts off as normal, but takes a *slightly* different path and somehow runs into Fatty Lumpkin.\n\nSam, who is *very* good with plants and animals, quickly makes friends with the already friendly pony and rides around for a while, but the pony then takes Sam back to Tom.\n\nTom asks Sam what hobbits like to do, and he says they sometimes play hide-and-seek.  So Tom hides the ring, except Sam can never find it, nor can anyone really.\n\nSauron cannot reform himself to his true potential without the ring, no one gets the ring.  I don't know if that is a tie or not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The party starts off as normal, but takes a &lt;em&gt;slightly&lt;/em&gt; different path and somehow runs into Fatty Lumpkin.&lt;/p&gt;\n\n&lt;p&gt;Sam, who is &lt;em&gt;very&lt;/em&gt; good with plants and animals, quickly makes friends with the already friendly pony and rides around for a while, but the pony then takes Sam back to Tom.&lt;/p&gt;\n\n&lt;p&gt;Tom asks Sam what hobbits like to do, and he says they sometimes play hide-and-seek.  So Tom hides the ring, except Sam can never find it, nor can anyone really.&lt;/p&gt;\n\n&lt;p&gt;Sauron cannot reform himself to his true potential without the ring, no one gets the ring.  I don&amp;#39;t know if that is a tie or not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgcorwd", "score_hidden": false, "stickied": false, "created": 1492410916.0, "created_utc": 1492382116.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]