[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "whowouldwin", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;&lt;a href=\"http://imgur.com/xfGMPSd\"&gt;XJ-9&lt;/a&gt;&lt;/strong&gt; - &lt;a href=\"https://www.reddit.com/r/respectthreads/comments/4y98qa/respect_jenny_wakeman_my_life_as_a_teenage_robot/\"&gt;Full Respect Thread&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;a href=\"http://imgur.com/a/hkFci\"&gt;Captain Planet&lt;/a&gt;&lt;/strong&gt; - &lt;a href=\"https://www.reddit.com/r/respectthreads/comments/651jw6/respect_captain_planet_captain_planet_and_the/\"&gt;Full Respect Thread&lt;/a&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Notes&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Both fighters are in character&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Victory at death or incap of the opponent&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Fight takes place on a copy of Earth devoid of people&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Round 1:&lt;/strong&gt; Neither fighter knows anything about the other at the start of the match&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Round 2:&lt;/strong&gt; Both fighters are aware of the other&amp;#39;s weaknesses&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**[XJ-9](http://imgur.com/xfGMPSd)** - [Full Respect Thread](https://www.reddit.com/r/respectthreads/comments/4y98qa/respect_jenny_wakeman_my_life_as_a_teenage_robot/)\n\n**[Captain Planet](http://imgur.com/a/hkFci)** - [Full Respect Thread](https://www.reddit.com/r/respectthreads/comments/651jw6/respect_captain_planet_captain_planet_and_the/)\n\n***\n\n**Notes**\n\n* Both fighters are in character\n\n* Victory at death or incap of the opponent\n\n* Fight takes place on a copy of Earth devoid of people\n\n***\n\n**Round 1:** Neither fighter knows anything about the other at the start of the match\n\n**Round 2:** Both fighters are aware of the other's weaknesses", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Serious", "id": "65q13t", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 91, "report_reasons": null, "author": "doctorgecko", "saved": false, "mod_reports": [], "name": "t3_65q13t", "subreddit_name_prefixed": "r/whowouldwin", "approved_by": null, "over_18": false, "domain": "self.whowouldwin", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/l9-ISDDT9mDJMy51Zk_ONLCMdrs5JptAlq9fTrjC0Pg.jpg?s=f9817ea4004bcced070f3f15679b3e44", "width": 900, "height": 775}, "resolutions": [{"url": "https://i.redditmedia.com/l9-ISDDT9mDJMy51Zk_ONLCMdrs5JptAlq9fTrjC0Pg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=8d59c672baf21a9794d3270ac18d4ca6", "width": 108, "height": 93}, {"url": "https://i.redditmedia.com/l9-ISDDT9mDJMy51Zk_ONLCMdrs5JptAlq9fTrjC0Pg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=134b7cebbcd8b6ea4ae410efc2849b23", "width": 216, "height": 186}, {"url": "https://i.redditmedia.com/l9-ISDDT9mDJMy51Zk_ONLCMdrs5JptAlq9fTrjC0Pg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=a70b7f4134c5733f75e012b2abff2623", "width": 320, "height": 275}, {"url": "https://i.redditmedia.com/l9-ISDDT9mDJMy51Zk_ONLCMdrs5JptAlq9fTrjC0Pg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=734dea0e1db9ab522a76b83751090a70", "width": 640, "height": 551}], "variants": {}, "id": "gita-nnUUoHZB7IMukPLOXYzb1B0GTTyd-dEpk88Yfo"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2s599", "edited": false, "link_flair_css_class": "Serious", "author_flair_css_class": "gecko", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/whowouldwin/comments/65q13t/xj9_my_life_as_a_teenage_robot_vs_captain_planet/", "num_reports": null, "locked": false, "stickied": false, "created": 1492389856.0, "url": "https://www.reddit.com/r/whowouldwin/comments/65q13t/xj9_my_life_as_a_teenage_robot_vs_captain_planet/", "author_flair_text": null, "quarantine": false, "title": "XJ-9 (My Life as a Teenage Robot) vs Captain Planet (Captain Planet)", "created_utc": 1492361056.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 91}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65q13t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65q13t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65q13t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65q13t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s599", "removal_reason": null, "link_id": "t3_65q13t", "likes": null, "replies": "", "user_reports": [], "id": "dgcrcfo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rangernumberx", "parent_id": "t1_dgcr6b1", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "There's only one feat he's done like that, but that was through specifically reprogramming nanomachines to make a hook (and later other metal things) being used against him rusty. I don't believe Jenny has nanobots covering her, and she herself is so much more complex than a simple nanomachines that it can't be said for certain that Captain Planet can just reprogram her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s only one feat he&amp;#39;s done like that, but that was through specifically reprogramming nanomachines to make a hook (and later other metal things) being used against him rusty. I don&amp;#39;t believe Jenny has nanobots covering her, and she herself is so much more complex than a simple nanomachines that it can&amp;#39;t be said for certain that Captain Planet can just reprogram her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgcrcfo", "score_hidden": false, "stickied": false, "created": 1492414459.0, "created_utc": 1492385659.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcr6b1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iforgotagain42", "parent_id": "t1_dgcib7c", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "He doesn't need to kill her.  IIRC he has feats of simply rusting a piece of machinery that was being used against him until it couldn't move.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He doesn&amp;#39;t need to kill her.  IIRC he has feats of simply rusting a piece of machinery that was being used against him until it couldn&amp;#39;t move.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgcr6b1", "score_hidden": false, "stickied": false, "created": 1492414230.0, "created_utc": 1492385430.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcib7c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rangernumberx", "parent_id": "t1_dgcgx5p", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "The reason my scores were what they were is because of them both being in character, and after learning a bit about how Jenny thinks just makes me more firm in my choice. Captain Planet would not go in for the kill at any point, and would just try to incapacitate her by either punching more, lifting something to try and trap her inside it, or something similar. Meanwhile, Jenny has demonstrated at points an ability to adapt when certain methods of attack fail. She will, given time that Captain Planet will most often give her, eventually try rockets, which Captain Planet will most often get hit by, and his following lack of durability will lead to Jenny conceivably winning.\n\nRound two, Captain Planet knows she's weak to water and electricity, but it doesn't mean that he knows she won't die if exposed (which he'd want to avoid). Sure, it's still difficult for Jenny to use his weakness against him, and I'm not sure if her morals would allow her to possibly kill Planet in the same situation, but it's still conceivable that she could win.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The reason my scores were what they were is because of them both being in character, and after learning a bit about how Jenny thinks just makes me more firm in my choice. Captain Planet would not go in for the kill at any point, and would just try to incapacitate her by either punching more, lifting something to try and trap her inside it, or something similar. Meanwhile, Jenny has demonstrated at points an ability to adapt when certain methods of attack fail. She will, given time that Captain Planet will most often give her, eventually try rockets, which Captain Planet will most often get hit by, and his following lack of durability will lead to Jenny conceivably winning.&lt;/p&gt;\n\n&lt;p&gt;Round two, Captain Planet knows she&amp;#39;s weak to water and electricity, but it doesn&amp;#39;t mean that he knows she won&amp;#39;t die if exposed (which he&amp;#39;d want to avoid). Sure, it&amp;#39;s still difficult for Jenny to use his weakness against him, and I&amp;#39;m not sure if her morals would allow her to possibly kill Planet in the same situation, but it&amp;#39;s still conceivable that she could win.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgcib7c", "score_hidden": false, "stickied": false, "created": 1492402420.0, "created_utc": 1492373620.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcgx5p", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "iforgotagain42", "parent_id": "t1_dgcd2mk", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "I'd say first round 9/10, Jenny could only win with a blitz.  As soon as he determines that she's a robot and is a threat, Planet has full control over metal and doesn't even need to hit her with water to rust her, he can do that himself just by touching her.  \n  \nSecond round I don't see any way for Jenny to win.  His ability to control metal makes him far too good against her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say first round 9/10, Jenny could only win with a blitz.  As soon as he determines that she&amp;#39;s a robot and is a threat, Planet has full control over metal and doesn&amp;#39;t even need to hit her with water to rust her, he can do that himself just by touching her.  &lt;/p&gt;\n\n&lt;p&gt;Second round I don&amp;#39;t see any way for Jenny to win.  His ability to control metal makes him far too good against her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgcgx5p", "score_hidden": false, "stickied": false, "created": 1492400625.0, "created_utc": 1492371825.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcd2mk", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "rangernumberx", "parent_id": "t3_65q13t", "subreddit_name_prefixed": "r/whowouldwin", "controversiality": 0, "body": "Captain Planet takes both rounds. To start, strength. His throwing of the nuclear power plant far exceeds anything she has done, with the most similar feat being her liftinging a giant pyramid into space, but that took a considerable amount of effort and started off slowly, while Planet did it with complete ease, and didn't even need to get near the edge of the atmosphere to throw it into the sun, which means he boasts an absurd amount of strength, even by Jenny's standards. While none of his striking feats are explicitly on par with his opponent's, it's still obvious he has a significant advantage. Speed is also a clean sweep for Planet. Sure, Jenny can fly halfway around the world in a couple of seconds, [but when carrying numerous large domes (made larger in the scene to make it clearer what he was doing), Planet has been able to circle the entire world in under a second.](https://gfycat.com/PlushImmenseFirefly) \n\nDurability I am less certain about. While Captain Planet should be able to take any of her melee weaponry (buzzsaw, medieval weapons, etc) without too much problem, and through comparison with some of Duke Nukem's blasts he should be able to take any of her energy weapons (lasers of various kinds, her head-mounted one taking so much time to prepare it's negligible in a fight), many explosives he can take but is largely worn out by. While he does have the capability to avoid/deal with them before they hit, given they're in character (although, admittedly, I don't know how XJ-9 behaves so I can't comment on her in this regard) he's likely going to be showboating, letting off whatever one-liners he can think of, meaning he's almost inevitably going to be hit. At that point, he usually returns to the earth, but if he continues to see Jenny as a threat (and with there being no Planeteers to try and stop her while he's gone) he's likely going to continue fighting. Still, doesn't bode as well as he does in other categories. Additionally, while his fights against Captain Pollution and a superpowered Dr. Blight could suggest he can take hits from someone his own strength, they never showed themselves capable of his high end feats. On Jenny's side, she has tanked incredible physical hits, meaning that unless Planet was dead set on destroying her, it's unlikely he'll use enough force to properly deal with her.\n\nBut to talk about Planet's powers requires talking about weaknesses. Jenny is particularly susceptible to water and electricity, the latter of which Captain Planet can create at any time, the former he can control any of, as long as it's not heavily polluted. And he has an entire abandoned planet of water to use. That being said, he didn't use his powers offensively very much. Mostly, it's to defend the Planeteers, get himself out of a tough scrape, or (at the end of whatever fight he gets in) to effectively capture and contain or restrain an eco-villain until the police arrive. In character, it's unlikely he'll use electricity, but without knowledge of her weakness it's possible for him to use water in an attempt to restrain her if he's near a prominent water source. On the other hand, Jenny doesn't have any major forms of pollution on her, and with concentrated pollution being needed she's not going to just happen upon it. This is only going to affect her in round two, where if she wants to end the fight she'll bring him to a nuclear power plant, or a vat of raw sewage, and try and dunk him in that. This would leave him open for her to finish him off, but again, this situation is a lot more difficult to obtain than it is for Captain Planet to take advantage of her weaknesses. \n\nOverall, round one goes to Captain Planet 7/10. He's stronger and faster, and can actually accidentally utilise her weakness. However, his knack for getting hit by things (mainly missiles) he could easily avoid (even ignoring the strict demands of the plot for it to happen every episode), his comparative lack of durability when hit by such things, and how seriously he'd need to take the fight to end it purely physically stop him from getting any higher. Round two gives Captain Planet it 9/10. It practically allows him to end the fight when he wants it, including when he sees Jenny trying to use his weakness, but still, trying to end it physically and being completely depowered should he be hit by pollution stops him from sweeping.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Captain Planet takes both rounds. To start, strength. His throwing of the nuclear power plant far exceeds anything she has done, with the most similar feat being her liftinging a giant pyramid into space, but that took a considerable amount of effort and started off slowly, while Planet did it with complete ease, and didn&amp;#39;t even need to get near the edge of the atmosphere to throw it into the sun, which means he boasts an absurd amount of strength, even by Jenny&amp;#39;s standards. While none of his striking feats are explicitly on par with his opponent&amp;#39;s, it&amp;#39;s still obvious he has a significant advantage. Speed is also a clean sweep for Planet. Sure, Jenny can fly halfway around the world in a couple of seconds, &lt;a href=\"https://gfycat.com/PlushImmenseFirefly\"&gt;but when carrying numerous large domes (made larger in the scene to make it clearer what he was doing), Planet has been able to circle the entire world in under a second.&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;Durability I am less certain about. While Captain Planet should be able to take any of her melee weaponry (buzzsaw, medieval weapons, etc) without too much problem, and through comparison with some of Duke Nukem&amp;#39;s blasts he should be able to take any of her energy weapons (lasers of various kinds, her head-mounted one taking so much time to prepare it&amp;#39;s negligible in a fight), many explosives he can take but is largely worn out by. While he does have the capability to avoid/deal with them before they hit, given they&amp;#39;re in character (although, admittedly, I don&amp;#39;t know how XJ-9 behaves so I can&amp;#39;t comment on her in this regard) he&amp;#39;s likely going to be showboating, letting off whatever one-liners he can think of, meaning he&amp;#39;s almost inevitably going to be hit. At that point, he usually returns to the earth, but if he continues to see Jenny as a threat (and with there being no Planeteers to try and stop her while he&amp;#39;s gone) he&amp;#39;s likely going to continue fighting. Still, doesn&amp;#39;t bode as well as he does in other categories. Additionally, while his fights against Captain Pollution and a superpowered Dr. Blight could suggest he can take hits from someone his own strength, they never showed themselves capable of his high end feats. On Jenny&amp;#39;s side, she has tanked incredible physical hits, meaning that unless Planet was dead set on destroying her, it&amp;#39;s unlikely he&amp;#39;ll use enough force to properly deal with her.&lt;/p&gt;\n\n&lt;p&gt;But to talk about Planet&amp;#39;s powers requires talking about weaknesses. Jenny is particularly susceptible to water and electricity, the latter of which Captain Planet can create at any time, the former he can control any of, as long as it&amp;#39;s not heavily polluted. And he has an entire abandoned planet of water to use. That being said, he didn&amp;#39;t use his powers offensively very much. Mostly, it&amp;#39;s to defend the Planeteers, get himself out of a tough scrape, or (at the end of whatever fight he gets in) to effectively capture and contain or restrain an eco-villain until the police arrive. In character, it&amp;#39;s unlikely he&amp;#39;ll use electricity, but without knowledge of her weakness it&amp;#39;s possible for him to use water in an attempt to restrain her if he&amp;#39;s near a prominent water source. On the other hand, Jenny doesn&amp;#39;t have any major forms of pollution on her, and with concentrated pollution being needed she&amp;#39;s not going to just happen upon it. This is only going to affect her in round two, where if she wants to end the fight she&amp;#39;ll bring him to a nuclear power plant, or a vat of raw sewage, and try and dunk him in that. This would leave him open for her to finish him off, but again, this situation is a lot more difficult to obtain than it is for Captain Planet to take advantage of her weaknesses. &lt;/p&gt;\n\n&lt;p&gt;Overall, round one goes to Captain Planet 7/10. He&amp;#39;s stronger and faster, and can actually accidentally utilise her weakness. However, his knack for getting hit by things (mainly missiles) he could easily avoid (even ignoring the strict demands of the plot for it to happen every episode), his comparative lack of durability when hit by such things, and how seriously he&amp;#39;d need to take the fight to end it purely physically stop him from getting any higher. Round two gives Captain Planet it 9/10. It practically allows him to end the fight when he wants it, including when he sees Jenny trying to use his weakness, but still, trying to end it physically and being completely depowered should he be hit by pollution stops him from sweeping.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "whowouldwin", "name": "t1_dgcd2mk", "score_hidden": false, "stickied": false, "created": 1492395501.0, "created_utc": 1492366701.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}]