[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "ExpectationVsReality", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yesterday my wife did something amazing, nevermind that she saved a life this week. I spent the early evening trying to sneakily order flowers for her, that didn&amp;#39;t work out and I forgot about it. Something reminded me later last night and I tried again even though she was on the couch behind me.&lt;/p&gt;\n\n&lt;p&gt;It took ages and I finally found a company that could get flowers to her today. I know it was the middle of the night and I know it&amp;#39;s Easter weekend. I know that expectations never equal reality. I know I was paying a premium by shopping online and expecting Saturday delivery. Knowing all those things I also know I love my wife and wanted to show her in some small way.&lt;/p&gt;\n\n&lt;p&gt;The flowers arrived at a decent time, thankfully she&amp;#39;s not home to see them. They&amp;#39;re dreadful. They&amp;#39;re embarrassing. I wouldn&amp;#39;t give these to someone I didn&amp;#39;t particularly care for, let alone use them to express profundity of my love.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t do flowers. In the 20+ years we&amp;#39;ve been married I can&amp;#39;t remember ever sending her flowers. I&amp;#39;m an idiot, I know this. So this was my big chance... I wish I&amp;#39;d spent some time reading reddit last night while I was trying to sneak around.&lt;/p&gt;\n\n&lt;p&gt;So I got mad, wrote an angry email to teleflora and called them. I had to deal with an automated voice system which didn&amp;#39;t help, but I tried to stay calm. Wait times were excessive and the system offered to call me back when a slot with a live person became available. &lt;/p&gt;\n\n&lt;p&gt;The rep who called me had the thickest Indian accent I&amp;#39;ve ever heard and I was constantly two words behind what he was saying as I attempted to translate and wow was I annoyed. I know the first words out my mouth were unkind, that was wrong. He greeted me and I said &amp;quot;we&amp;#39;re not even on the same continent are we?&amp;quot; He didn&amp;#39;t understand so I repeated myself, several times until it wasn&amp;#39;t even funny to me anymore. I expressed my dissatisfaction and he put me on hold a couple of times to do something. Eventually it seems he called the local florist, well that&amp;#39;s when things went from bad to worse.&lt;/p&gt;\n\n&lt;p&gt;If I ever find out who the local florist is I may picket them. Even as he relayed information I knew they were being pissy. I was asked to count flowers... in an $80 arrangement I was asked to count individual carnations! I don&amp;#39;t care about the stupid carnations! I care about the fact that this thing just looks sad. It&amp;#39;s not quantity (although that&amp;#39;s off too) it&amp;#39;s QUALITY! You may look at the image (which may or may not be here) and think, &amp;quot;yeah, that&amp;#39;s worth $80&amp;quot;. I&amp;#39;m looking at it and thinking &amp;quot;who would order this in the first place?! It&amp;#39;s not worth having!&amp;quot; Actually I&amp;#39;m beyond thinking it, I&amp;#39;m yelling it.&lt;/p&gt;\n\n&lt;p&gt;I wasn&amp;#39;t trying to be cheap when I ordered, I found an arrangement that looked very nice, I wanted red roses and white lilies. Roses because I love her and lilies because it&amp;#39;s Easter, I&amp;#39;m not very creative when it comes to flowers. I picked out what I wanted then upgraded it to the best they had... &amp;quot;premium&amp;quot;... hah. This thing doesn&amp;#39;t look as good as the &amp;quot;standard&amp;quot; picture, it&amp;#39;s nowhere &lt;strong&gt;near&lt;/strong&gt; as nice as what they&amp;#39;re passing off as &amp;quot;premium&amp;quot;. I would have spent more money, that wasn&amp;#39;t the issue, I was in a hurry because she was napping on the couch behind me and might wake up at any moment.&lt;/p&gt;\n\n&lt;p&gt;I think my last words to the poor guy on the phone as I angrily hung up were &amp;quot;This is stupid and you can&amp;#39;t speak English!&amp;quot; I normally go out of my way to be gentle to the poor people doing customer service, not this time.&lt;/p&gt;\n\n&lt;p&gt;I just received a followup email from teleflora offering me 40% off my next purchase. I think I&amp;#39;m safe in saying that in 20 years when it next occurs to me to send my wife flowers I won&amp;#39;t be using teleflora. Oh and the salt in the wound? Every page I surf to is just covered in teleflora ads... thanks google.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want free flowers... I don&amp;#39;t ever want flowers again! I don&amp;#39;t want something for nothing, I don&amp;#39;t think I&amp;#39;m acting like a moron with entitlement issues. I just want something resembling what I thought I was ordering. I&amp;#39;ve ranted far too long about this, I&amp;#39;ve ruined Easter, it&amp;#39;s my fault.&lt;/p&gt;\n\n&lt;p&gt;How have I ruined Easter you ask? Because, when my wife sees these flowers... if she sees them, I still haven&amp;#39;t decided if I&amp;#39;m going to leave them on the table for her to find or hide them in the back yard. When she sees them they&amp;#39;re going to represent my love for her... and frankly it looks rather pathetic. I wanted to blow her mind, I thought what I ordered WOULD blow her mind. Instead she&amp;#39;s going to look at this mess and wonder exactly how many corners I cut, how cheap I was, if I put any thought into this at all... ugh.&lt;/p&gt;\n\n&lt;p&gt;In twenty years this was my first attempt at really doing something different and I blew it. fml.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Yesterday my wife did something amazing, nevermind that she saved a life this week. I spent the early evening trying to sneakily order flowers for her, that didn't work out and I forgot about it. Something reminded me later last night and I tried again even though she was on the couch behind me.\n\nIt took ages and I finally found a company that could get flowers to her today. I know it was the middle of the night and I know it's Easter weekend. I know that expectations never equal reality. I know I was paying a premium by shopping online and expecting Saturday delivery. Knowing all those things I also know I love my wife and wanted to show her in some small way.\n\nThe flowers arrived at a decent time, thankfully she's not home to see them. They're dreadful. They're embarrassing. I wouldn't give these to someone I didn't particularly care for, let alone use them to express profundity of my love.\n\nI don't do flowers. In the 20+ years we've been married I can't remember ever sending her flowers. I'm an idiot, I know this. So this was my big chance... I wish I'd spent some time reading reddit last night while I was trying to sneak around.\n\nSo I got mad, wrote an angry email to teleflora and called them. I had to deal with an automated voice system which didn't help, but I tried to stay calm. Wait times were excessive and the system offered to call me back when a slot with a live person became available. \n\nThe rep who called me had the thickest Indian accent I've ever heard and I was constantly two words behind what he was saying as I attempted to translate and wow was I annoyed. I know the first words out my mouth were unkind, that was wrong. He greeted me and I said \"we're not even on the same continent are we?\" He didn't understand so I repeated myself, several times until it wasn't even funny to me anymore. I expressed my dissatisfaction and he put me on hold a couple of times to do something. Eventually it seems he called the local florist, well that's when things went from bad to worse.\n\nIf I ever find out who the local florist is I may picket them. Even as he relayed information I knew they were being pissy. I was asked to count flowers... in an $80 arrangement I was asked to count individual carnations! I don't care about the stupid carnations! I care about the fact that this thing just looks sad. It's not quantity (although that's off too) it's QUALITY! You may look at the image (which may or may not be here) and think, \"yeah, that's worth $80\". I'm looking at it and thinking \"who would order this in the first place?! It's not worth having!\" Actually I'm beyond thinking it, I'm yelling it.\n\nI wasn't trying to be cheap when I ordered, I found an arrangement that looked very nice, I wanted red roses and white lilies. Roses because I love her and lilies because it's Easter, I'm not very creative when it comes to flowers. I picked out what I wanted then upgraded it to the best they had... \"premium\"... hah. This thing doesn't look as good as the \"standard\" picture, it's nowhere **near** as nice as what they're passing off as \"premium\". I would have spent more money, that wasn't the issue, I was in a hurry because she was napping on the couch behind me and might wake up at any moment.\n\nI think my last words to the poor guy on the phone as I angrily hung up were \"This is stupid and you can't speak English!\" I normally go out of my way to be gentle to the poor people doing customer service, not this time.\n\nI just received a followup email from teleflora offering me 40% off my next purchase. I think I'm safe in saying that in 20 years when it next occurs to me to send my wife flowers I won't be using teleflora. Oh and the salt in the wound? Every page I surf to is just covered in teleflora ads... thanks google.\n\nI don't want free flowers... I don't ever want flowers again! I don't want something for nothing, I don't think I'm acting like a moron with entitlement issues. I just want something resembling what I thought I was ordering. I've ranted far too long about this, I've ruined Easter, it's my fault.\n\nHow have I ruined Easter you ask? Because, when my wife sees these flowers... if she sees them, I still haven't decided if I'm going to leave them on the table for her to find or hide them in the back yard. When she sees them they're going to represent my love for her... and frankly it looks rather pathetic. I wanted to blow her mind, I thought what I ordered WOULD blow her mind. Instead she's going to look at this mess and wonder exactly how many corners I cut, how cheap I was, if I put any thought into this at all... ugh.\n\nIn twenty years this was my first attempt at really doing something different and I blew it. fml.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65kc0p", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "boredoftheworld", "saved": false, "mod_reports": [], "name": "t3_65kc0p", "subreddit_name_prefixed": "r/ExpectationVsReality", "approved_by": null, "over_18": false, "domain": "self.ExpectationVsReality", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t6xs", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/ExpectationVsReality/comments/65kc0p/teleflora_can_drop_dead/", "num_reports": null, "locked": false, "stickied": false, "created": 1492306761.0, "url": "https://www.reddit.com/r/ExpectationVsReality/comments/65kc0p/teleflora_can_drop_dead/", "author_flair_text": null, "quarantine": false, "title": "Teleflora can drop dead", "created_utc": 1492277961.0, "distinguished": null, "media": null, "upvote_ratio": 0.42, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t6xs", "removal_reason": null, "link_id": "t3_65kc0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t6xs", "removal_reason": null, "link_id": "t3_65kc0p", "likes": null, "replies": "", "user_reports": [], "id": "dgayhb2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "boredoftheworld", "parent_id": "t1_dgay541", "subreddit_name_prefixed": "r/ExpectationVsReality", "controversiality": 0, "body": "Well I know about brokers now, I should have done my research last night and made an attempt at getting to a florist early this morning. I'm sort of home bound right now so the online thing seemed smart at the time.\n\nShe's happy with it, my mother-in-law is freaking out. I made major points all around even though it really looks hideous to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I know about brokers now, I should have done my research last night and made an attempt at getting to a florist early this morning. I&amp;#39;m sort of home bound right now so the online thing seemed smart at the time.&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s happy with it, my mother-in-law is freaking out. I made major points all around even though it really looks hideous to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ExpectationVsReality", "name": "t1_dgayhb2", "score_hidden": false, "stickied": false, "created": 1492308498.0, "created_utc": 1492279698.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgay541", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "HeyHon", "parent_id": "t3_65kc0p", "subreddit_name_prefixed": "r/ExpectationVsReality", "controversiality": 0, "body": "Sorry that happened to you. :( Flower brokers ar eknown for being shady and selling their orders to the lowest bidder.\n\nYou can still make this right, though! Go to your local florist, they will have a refrigerator case full of arrangements that you can choose from. They will likely be well-stocked for the Easter rush.  Even a larger grocery store should have a floral display. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry that happened to you. :( Flower brokers ar eknown for being shady and selling their orders to the lowest bidder.&lt;/p&gt;\n\n&lt;p&gt;You can still make this right, though! Go to your local florist, they will have a refrigerator case full of arrangements that you can choose from. They will likely be well-stocked for the Easter rush.  Even a larger grocery store should have a floral display. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ExpectationVsReality", "name": "t1_dgay541", "score_hidden": false, "stickied": false, "created": 1492308049.0, "created_utc": 1492279249.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t6xs", "removal_reason": null, "link_id": "t3_65kc0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t6xs", "removal_reason": null, "link_id": "t3_65kc0p", "likes": null, "replies": "", "user_reports": [], "id": "dgbacuq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "boredoftheworld", "parent_id": "t1_dgb9qs9", "subreddit_name_prefixed": "r/ExpectationVsReality", "controversiality": 0, "body": "That's the arrangement. I think you may be incorrect about the 360 thing though. The ad says \"Orientation: One-Sided\" and that's what it is, there's nothing on the back. \n\nBut yes, I'm done with ordering flowers online.\n\nWe're both a bit odd on normal couple stuff. Neither of us is too sure on our anniversary date or how long exactly we've been married... we do our own thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the arrangement. I think you may be incorrect about the 360 thing though. The ad says &amp;quot;Orientation: One-Sided&amp;quot; and that&amp;#39;s what it is, there&amp;#39;s nothing on the back. &lt;/p&gt;\n\n&lt;p&gt;But yes, I&amp;#39;m done with ordering flowers online.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re both a bit odd on normal couple stuff. Neither of us is too sure on our anniversary date or how long exactly we&amp;#39;ve been married... we do our own thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ExpectationVsReality", "name": "t1_dgbacuq", "score_hidden": false, "stickied": false, "created": 1492324823.0, "created_utc": 1492296023.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb9qs9", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "apoleary", "parent_id": "t3_65kc0p", "subreddit_name_prefixed": "r/ExpectationVsReality", "controversiality": 0, "body": "I think this is what you ordered: http://www.teleflora.com/bouquet/be-my-love-bouquet-with-red-roses?prodID=P_T128-2a&amp;skuId=T128-2A\n\nHonestly, what you got looks pretty good to me. They make the picture with all the flowers in view, when in reality, they're spread out 360 degrees.\n\nNext time, you could just call a local florist (look at Yelp reviews), and they'll hook you up.\n\nAnd I'm saying this as a wife, but you should get her flowers more than once every 20 years. :)  Surprise flowers (like what you did and not for a birthday or Valentines, etc) are the best!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is what you ordered: &lt;a href=\"http://www.teleflora.com/bouquet/be-my-love-bouquet-with-red-roses?prodID=P_T128-2a&amp;amp;skuId=T128-2A\"&gt;http://www.teleflora.com/bouquet/be-my-love-bouquet-with-red-roses?prodID=P_T128-2a&amp;amp;skuId=T128-2A&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Honestly, what you got looks pretty good to me. They make the picture with all the flowers in view, when in reality, they&amp;#39;re spread out 360 degrees.&lt;/p&gt;\n\n&lt;p&gt;Next time, you could just call a local florist (look at Yelp reviews), and they&amp;#39;ll hook you up.&lt;/p&gt;\n\n&lt;p&gt;And I&amp;#39;m saying this as a wife, but you should get her flowers more than once every 20 years. :)  Surprise flowers (like what you did and not for a birthday or Valentines, etc) are the best!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ExpectationVsReality", "name": "t1_dgb9qs9", "score_hidden": false, "stickied": false, "created": 1492323922.0, "created_utc": 1492295122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t6xs", "removal_reason": null, "link_id": "t3_65kc0p", "likes": null, "replies": "", "user_reports": [], "id": "dgay4el", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "boredoftheworld", "parent_id": "t3_65kc0p", "subreddit_name_prefixed": "r/ExpectationVsReality", "controversiality": 0, "body": "http://imgur.com/a/hTNMg\n\nThere's the picture... it doesn't look as bad as it did when it arrived. I suppose it's okay. I still don't think it's worth anywhere near what I paid, and it doesn't really look like what I ordered.\n\nMy wife came home. \n\nShe's pleased, she's not bowled over. My daughters are stunned so I've got that going for me which is nice.\n\nI expressed my disappointment with my purchase and she reminded me of the Christmas tree I ordered from amazon which was hideously expensive and even more disappointing than the flowers. So, while this purchase ranks up there as extremely dissatisfying it's not the worst I've ever made.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://imgur.com/a/hTNMg\"&gt;http://imgur.com/a/hTNMg&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s the picture... it doesn&amp;#39;t look as bad as it did when it arrived. I suppose it&amp;#39;s okay. I still don&amp;#39;t think it&amp;#39;s worth anywhere near what I paid, and it doesn&amp;#39;t really look like what I ordered.&lt;/p&gt;\n\n&lt;p&gt;My wife came home. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s pleased, she&amp;#39;s not bowled over. My daughters are stunned so I&amp;#39;ve got that going for me which is nice.&lt;/p&gt;\n\n&lt;p&gt;I expressed my disappointment with my purchase and she reminded me of the Christmas tree I ordered from amazon which was hideously expensive and even more disappointing than the flowers. So, while this purchase ranks up there as extremely dissatisfying it&amp;#39;s not the worst I&amp;#39;ve ever made.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ExpectationVsReality", "name": "t1_dgay4el", "score_hidden": false, "stickied": false, "created": 1492308024.0, "created_utc": 1492279224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t6xs", "removal_reason": null, "link_id": "t3_65kc0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t6xs", "removal_reason": null, "link_id": "t3_65kc0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t6xs", "removal_reason": null, "link_id": "t3_65kc0p", "likes": null, "replies": "", "user_reports": [], "id": "dgb0fab", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "J_Andrew89", "parent_id": "t1_dgb039c", "subreddit_name_prefixed": "r/ExpectationVsReality", "controversiality": 0, "body": "Actually, my man, it may!\n\nI had a similar issue two mothers days ago when I sent a very expensive arrangement to my mother because I was going to be away for the holiday. I certainly didn't expect the end result to look identical to the photo online, but I expect a $100 arrangement to wow just about anyone. \n\nIt was horrible. I contacted customer service several times and they made several different promises about how they were going to make it right and never follow through on any. I disputed the charge with American Express. I sent them the picture of what I ordered and the picture of what I got. My charge was refunded within two weeks. \n\nOf course, every credit card company is going to handle something like this differently. But it's worth a shot. \n\nSince then, I have only used fromyouflowers.com. \n\nThen again, it comes down to the florist they use but so far it seems like this website brokers with more reliable people. At least in my area. \n\nI'm sorry you're so frustrated about what happened. I've been there myself, I totally get it. \n\nOne last piece of advice if you ever use one of these websites again… Cashback sites like Ebates often have a pretty high percentage on one or more of them. At the very least, even if the arrangements don't turn out great great, at least you save a little bit of money and pay closer to what it's worth. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually, my man, it may!&lt;/p&gt;\n\n&lt;p&gt;I had a similar issue two mothers days ago when I sent a very expensive arrangement to my mother because I was going to be away for the holiday. I certainly didn&amp;#39;t expect the end result to look identical to the photo online, but I expect a $100 arrangement to wow just about anyone. &lt;/p&gt;\n\n&lt;p&gt;It was horrible. I contacted customer service several times and they made several different promises about how they were going to make it right and never follow through on any. I disputed the charge with American Express. I sent them the picture of what I ordered and the picture of what I got. My charge was refunded within two weeks. &lt;/p&gt;\n\n&lt;p&gt;Of course, every credit card company is going to handle something like this differently. But it&amp;#39;s worth a shot. &lt;/p&gt;\n\n&lt;p&gt;Since then, I have only used fromyouflowers.com. &lt;/p&gt;\n\n&lt;p&gt;Then again, it comes down to the florist they use but so far it seems like this website brokers with more reliable people. At least in my area. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry you&amp;#39;re so frustrated about what happened. I&amp;#39;ve been there myself, I totally get it. &lt;/p&gt;\n\n&lt;p&gt;One last piece of advice if you ever use one of these websites again… Cashback sites like Ebates often have a pretty high percentage on one or more of them. At the very least, even if the arrangements don&amp;#39;t turn out great great, at least you save a little bit of money and pay closer to what it&amp;#39;s worth. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ExpectationVsReality", "name": "t1_dgb0fab", "score_hidden": false, "stickied": false, "created": 1492311177.0, "created_utc": 1492282377.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb039c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "boredoftheworld", "parent_id": "t1_dgazpxs", "subreddit_name_prefixed": "r/ExpectationVsReality", "controversiality": 0, "body": "It should, I doubt it does.\n\nI showed this thread to my wife. It didn't occur to me but she deals with weapons grade flower orders every week (told you I was an idiot). She was surprised to find out how much the arrangement cost, she was thinking $50 with delivery on a Saturday. If I'd been in possession of half a brain I would have contacted one of the florists who she does business with and organized something, probably would have received an insane discount. \n\nWith every passing moment my wife likes it more and I like it less. It ended up doing what I wanted it to, I don't know why I'm not satisfied with that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It should, I doubt it does.&lt;/p&gt;\n\n&lt;p&gt;I showed this thread to my wife. It didn&amp;#39;t occur to me but she deals with weapons grade flower orders every week (told you I was an idiot). She was surprised to find out how much the arrangement cost, she was thinking $50 with delivery on a Saturday. If I&amp;#39;d been in possession of half a brain I would have contacted one of the florists who she does business with and organized something, probably would have received an insane discount. &lt;/p&gt;\n\n&lt;p&gt;With every passing moment my wife likes it more and I like it less. It ended up doing what I wanted it to, I don&amp;#39;t know why I&amp;#39;m not satisfied with that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ExpectationVsReality", "name": "t1_dgb039c", "score_hidden": false, "stickied": false, "created": 1492310727.0, "created_utc": 1492281927.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgazpxs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lady_Deadpool", "parent_id": "t3_65kc0p", "subreddit_name_prefixed": "r/ExpectationVsReality", "controversiality": 0, "body": "Would something like this qualify for a charge back on your credit card? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would something like this qualify for a charge back on your credit card? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ExpectationVsReality", "name": "t1_dgazpxs", "score_hidden": false, "stickied": false, "created": 1492310214.0, "created_utc": 1492281414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t6xs", "removal_reason": null, "link_id": "t3_65kc0p", "likes": null, "replies": "", "user_reports": [], "id": "dgbq5pq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EatSleepCryDie", "parent_id": "t3_65kc0p", "subreddit_name_prefixed": "r/ExpectationVsReality", "controversiality": 0, "body": "Funnily enough right after this post there was an ad for teleflora. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Funnily enough right after this post there was an ad for teleflora. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ExpectationVsReality", "name": "t1_dgbq5pq", "score_hidden": false, "stickied": false, "created": 1492348723.0, "created_utc": 1492319923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]