[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey. I&amp;#39;m not exactly an extrovert, but I&amp;#39;ve never been short of good friends. But in recent years I&amp;#39;ve been having more problems meeting people.&lt;/p&gt;\n\n&lt;p&gt;It takes me a stupidly long time to get comfortable enough around people to let my relaxed and humorus side come out,  (I&amp;#39;m talking weeks to months) and until that point I just have an horrible fear that everyone thinks I&amp;#39;m rude, annoying and antisocial.&lt;/p&gt;\n\n&lt;p&gt;I find it hard to break into conversations because I panic and feel like I&amp;#39;m butting in, and any joke or comment I do make I instantly analyze and regret.&lt;/p&gt;\n\n&lt;p&gt;Recently I confided that I was feeling this about a society I attend to a close friend, who went and told people from that society. Now they&amp;#39;re clearly going out of the way to reassure me and I appreciate the gesture, but now it feels like they see me  as a bit irrational and needy (Which would be fair I suppose!)&lt;/p&gt;\n\n&lt;p&gt;If anyone has experienced this could you let me know how to shake it? I know it&amp;#39;s irrational, and I&amp;#39;d quite like to have the old &amp;quot;can talk to new people without wanting to run away&amp;quot; me back!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey. I'm not exactly an extrovert, but I've never been short of good friends. But in recent years I've been having more problems meeting people.\n\nIt takes me a stupidly long time to get comfortable enough around people to let my relaxed and humorus side come out,  (I'm talking weeks to months) and until that point I just have an horrible fear that everyone thinks I'm rude, annoying and antisocial.\n\nI find it hard to break into conversations because I panic and feel like I'm butting in, and any joke or comment I do make I instantly analyze and regret.\n\nRecently I confided that I was feeling this about a society I attend to a close friend, who went and told people from that society. Now they're clearly going out of the way to reassure me and I appreciate the gesture, but now it feels like they see me  as a bit irrational and needy (Which would be fair I suppose!)\n\nIf anyone has experienced this could you let me know how to shake it? I know it's irrational, and I'd quite like to have the old \"can talk to new people without wanting to run away\" me back!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64pte3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 29, "report_reasons": null, "author": "CouncilOfEvil", "saved": false, "mod_reports": [], "name": "t3_64pte3", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/64pte3/cant_shake_the_feeling_that_new_people_hate_me/", "num_reports": null, "locked": false, "stickied": false, "created": 1491931951.0, "url": "https://www.reddit.com/r/socialskills/comments/64pte3/cant_shake_the_feeling_that_new_people_hate_me/", "author_flair_text": null, "quarantine": false, "title": "Can't shake the feeling that new people hate me.", "created_utc": 1491903151.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_64pte3", "likes": null, "replies": "", "user_reports": [], "id": "dg4h5j3", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Blue-Nite", "parent_id": "t3_64pte3", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I'm pretty much in the same boat as you man. It takes a while for people to get to know the real me, but very few actually understand that.\n\nOne thing I do, especially when when anxiety creeps in and I start analyzing everything, is to think about these things logically. Like when I start thinking that everyone hates me because they think I'm anti-social or something, I immediately think to myself, \"No. First, no-one will actively hate you if you haven't done anything harmful. Second, they don't have a definite reason to think you're anti-social. And even if a few people do hate you, they're the ones who have a problem.\"\n\nI'm no psychologist, but what I've learned from all the crippling anxiety I've had is that anxiety is mostly based on these unfounded thoughts that go through your head. So when you digest these thoughts logically, it really clears up your mind and you begin to separate everything that's true from what's not.\n\nHope this will help you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty much in the same boat as you man. It takes a while for people to get to know the real me, but very few actually understand that.&lt;/p&gt;\n\n&lt;p&gt;One thing I do, especially when when anxiety creeps in and I start analyzing everything, is to think about these things logically. Like when I start thinking that everyone hates me because they think I&amp;#39;m anti-social or something, I immediately think to myself, &amp;quot;No. First, no-one will actively hate you if you haven&amp;#39;t done anything harmful. Second, they don&amp;#39;t have a definite reason to think you&amp;#39;re anti-social. And even if a few people do hate you, they&amp;#39;re the ones who have a problem.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m no psychologist, but what I&amp;#39;ve learned from all the crippling anxiety I&amp;#39;ve had is that anxiety is mostly based on these unfounded thoughts that go through your head. So when you digest these thoughts logically, it really clears up your mind and you begin to separate everything that&amp;#39;s true from what&amp;#39;s not.&lt;/p&gt;\n\n&lt;p&gt;Hope this will help you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg4h5j3", "score_hidden": false, "stickied": false, "created": 1491955911.0, "created_utc": 1491927111.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_64pte3", "likes": null, "replies": "", "user_reports": [], "id": "dg4a5dl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustPuckIt", "parent_id": "t3_64pte3", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Hey, yeah, I know that feeling and it sucks. For me to be honest I had to treat it a bunch of different ways - medically b/c my social anxiety was so severe my face would flush severely, psychologically - with medication for social anxiety, socially - by practicing over and over &amp; research-wise - just reading everything I could about social interactions, relationships, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, yeah, I know that feeling and it sucks. For me to be honest I had to treat it a bunch of different ways - medically b/c my social anxiety was so severe my face would flush severely, psychologically - with medication for social anxiety, socially - by practicing over and over &amp;amp; research-wise - just reading everything I could about social interactions, relationships, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg4a5dl", "score_hidden": false, "stickied": false, "created": 1491947808.0, "created_utc": 1491919008.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]