[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi Reddit friends :) \nSo I was raised in a medium-level assertive family, in a pretty sheltered environment. It has been years since I&amp;#39;ve grown up and made my own life. However, assertiveness is something I occasionally struggle with if it concerns difficult topics/difficult people. I can be assertive easily with things such as: telling waitress I don&amp;#39;t like the item I ordered; saying no to plans; telling my husband/friends my feelings; being assertive with coworkers and clients; disagreeing with others&amp;#39; politics (respectfully of course). Things I am not so good with: handling pushy people who violate boundaries, handling passive aggressive/dismissive behavior or overly argumentative types.. IDK if it&amp;#39;s because I genuinely lack a lot of experience with these types of people (their behavior shocks me, leaving me tongue tied), or because I&amp;#39;m pretty optimistic of people&amp;#39;s intentions and if they act icky I usually don&amp;#39;t address it since I don&amp;#39;t want to have a close friendship with them after. \nNow.....my husband&amp;#39;s mother has &lt;strong&gt;all&lt;/strong&gt; of the above areas I mentioned. She is very proud, dismissive and bossy. She&amp;#39;s skilled with covert put downs (something that&amp;#39;s taken me years to realize). I actually have been direct and told her not overstep regarding our children etc. But it still ends up reoccurring at a later time. My DH has tried talking to her, but she blows him off and blames his issues as the reason for him being upset with her. Now, there is no escaping this relationship but it needs to change soon because I&amp;#39;m tired of being disrespected by her -and it&amp;#39;s been years of it, so she&amp;#39;s accustomed to me not getting too mad. What are some good ways I can respond to her if she doesn&amp;#39;t receive next-level assertiveness well? For example, if she throws in my face that we live in her house? Acts like I&amp;#39;m imagining the issue? (crazymaking?) \nThe last time I was angry at her, she acted like she&amp;#39;d done nothing wrong and basically said she couldn&amp;#39;t see my side even if the shoe were on the other foot. Again, when people get &amp;#39;covertly&amp;#39; manipulative or passive aggressive I don&amp;#39;t know how to respond assertively. I worry I&amp;#39;ll either shut down or get rude, neither of which is real assertiveness so I really need some good things to say! Thanks &amp;lt;3&lt;/p&gt;\n\n&lt;p&gt;*** Edit: Thanks guys! You all gave excellent advice. Good to know I am not alone, too @teedeehehe &amp;lt;3. Yeah it&amp;#39;s difficult. What&amp;#39;s weird is that I don&amp;#39;t really consider myself very passive, but normal/easygoing in the spectrum. I think just the fact that I&amp;#39;m someone who plans when important/ and goes with the flow otherwise (and I mind my own business quite well) VS her personality which is *extremely* regimented/planned/take control/**meddling** makes her *perceive* me as passive. So maybe I&amp;#39;m actually normal and the average person would feel at a loss just as I do LOL. Because really, when considering it, I **have** asserted myself to her- her pseudo &amp;quot;polite&amp;quot; P/A personality is really just so arrogant and controlling that she wants her way &amp;gt; highway. I don&amp;#39;t know why I&amp;#39;m just realizing this now...light bulb! :P&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi Reddit friends :) \nSo I was raised in a medium-level assertive family, in a pretty sheltered environment. It has been years since I've grown up and made my own life. However, assertiveness is something I occasionally struggle with if it concerns difficult topics/difficult people. I can be assertive easily with things such as: telling waitress I don't like the item I ordered; saying no to plans; telling my husband/friends my feelings; being assertive with coworkers and clients; disagreeing with others' politics (respectfully of course). Things I am not so good with: handling pushy people who violate boundaries, handling passive aggressive/dismissive behavior or overly argumentative types.. IDK if it's because I genuinely lack a lot of experience with these types of people (their behavior shocks me, leaving me tongue tied), or because I'm pretty optimistic of people's intentions and if they act icky I usually don't address it since I don't want to have a close friendship with them after. \nNow.....my husband's mother has **all** of the above areas I mentioned. She is very proud, dismissive and bossy. She's skilled with covert put downs (something that's taken me years to realize). I actually have been direct and told her not overstep regarding our children etc. But it still ends up reoccurring at a later time. My DH has tried talking to her, but she blows him off and blames his issues as the reason for him being upset with her. Now, there is no escaping this relationship but it needs to change soon because I'm tired of being disrespected by her -and it's been years of it, so she's accustomed to me not getting too mad. What are some good ways I can respond to her if she doesn't receive next-level assertiveness well? For example, if she throws in my face that we live in her house? Acts like I'm imagining the issue? (crazymaking?) \nThe last time I was angry at her, she acted like she'd done nothing wrong and basically said she couldn't see my side even if the shoe were on the other foot. Again, when people get 'covertly' manipulative or passive aggressive I don't know how to respond assertively. I worry I'll either shut down or get rude, neither of which is real assertiveness so I really need some good things to say! Thanks &lt;3\n\n\n*** Edit: Thanks guys! You all gave excellent advice. Good to know I am not alone, too @teedeehehe &lt;3. Yeah it's difficult. What's weird is that I don't really consider myself very passive, but normal/easygoing in the spectrum. I think just the fact that I'm someone who plans when important/ and goes with the flow otherwise (and I mind my own business quite well) VS her personality which is *extremely* regimented/planned/take control/**meddling** makes her *perceive* me as passive. So maybe I'm actually normal and the average person would feel at a loss just as I do LOL. Because really, when considering it, I **have** asserted myself to her- her pseudo \"polite\" P/A personality is really just so arrogant and controlling that she wants her way &gt; highway. I don't know why I'm just realizing this now...light bulb! :P", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64welj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "_Leia_", "saved": false, "mod_reports": [], "name": "t3_64welj", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": 1492027160.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/64welj/becoming_more_assertivehow_to_handle_the_people/", "num_reports": null, "locked": false, "stickied": false, "created": 1492005426.0, "url": "https://www.reddit.com/r/socialskills/comments/64welj/becoming_more_assertivehow_to_handle_the_people/", "author_flair_text": null, "quarantine": false, "title": "Becoming more assertive...how to handle the people who aren't accustomed to me be being that way- namely an in-law who is a control freak?", "created_utc": 1491976626.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_64welj", "likes": null, "replies": "", "user_reports": [], "id": "dg66cov", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "king_england", "parent_id": "t3_64welj", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "&gt;IDK if it's because I genuinely lack a lot of experience with these types of people (their behavior shocks me, leaving me tongue tied), or because I'm pretty optimistic of people's intentions and if they act icky I usually don't address it since I don't want to have a close friendship with them after.\n\nIt's likely all of those combined into a complex mesh, so it makes it harder to work out and navigate. \n\n&gt;For example, if she throws in my face that we live in her house?\n\nThis is tricky, and a blowout may lead to you no longer being welcome if she's as difficult as you say. But I would stick with assuring her you appreciate letting you live there, but that the dynamic of the relationship is a separate issue and that's what needs work.\n\n&gt;Acts like I'm imagining the issue?\n\nThis is an attempt at gaslighting, which is awfully manipulative behavior. What helps here (as I've learned in therapy dealing with manipulation), is to remember you are not wrongly perceiving the issue, and that your feelings are valid and have equal weight. Build your assertion there, and expressing it will become much easier. \n\nWhat I would suggest is just simply saying something like, \"I have some things on my mind that I'd like to talk with you about. Do you think we can sit down later today and discuss them?\" This is effective because it asserts there's a problem, but you are providing time for her to not feel attacked or cornered. Set a neutral tone and express your concerns calmly, but firmly. And also be sure to actively listen so that you can build an attempt to find common ground. \n\nHope this helps and that things work out!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;IDK if it&amp;#39;s because I genuinely lack a lot of experience with these types of people (their behavior shocks me, leaving me tongue tied), or because I&amp;#39;m pretty optimistic of people&amp;#39;s intentions and if they act icky I usually don&amp;#39;t address it since I don&amp;#39;t want to have a close friendship with them after.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s likely all of those combined into a complex mesh, so it makes it harder to work out and navigate. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;For example, if she throws in my face that we live in her house?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is tricky, and a blowout may lead to you no longer being welcome if she&amp;#39;s as difficult as you say. But I would stick with assuring her you appreciate letting you live there, but that the dynamic of the relationship is a separate issue and that&amp;#39;s what needs work.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Acts like I&amp;#39;m imagining the issue?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is an attempt at gaslighting, which is awfully manipulative behavior. What helps here (as I&amp;#39;ve learned in therapy dealing with manipulation), is to remember you are not wrongly perceiving the issue, and that your feelings are valid and have equal weight. Build your assertion there, and expressing it will become much easier. &lt;/p&gt;\n\n&lt;p&gt;What I would suggest is just simply saying something like, &amp;quot;I have some things on my mind that I&amp;#39;d like to talk with you about. Do you think we can sit down later today and discuss them?&amp;quot; This is effective because it asserts there&amp;#39;s a problem, but you are providing time for her to not feel attacked or cornered. Set a neutral tone and express your concerns calmly, but firmly. And also be sure to actively listen so that you can build an attempt to find common ground. &lt;/p&gt;\n\n&lt;p&gt;Hope this helps and that things work out!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg66cov", "score_hidden": false, "stickied": false, "created": 1492045660.0, "created_utc": 1492016860.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_64welj", "likes": null, "replies": "", "user_reports": [], "id": "dg6a4nx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SigmaTheDJ", "parent_id": "t3_64welj", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "It's a tough one, given that you're living in her house. However, just because you're living in her house gives her absolutely no right to disrespect you.\n\nWhat kind of things does she do that make you feel disrespected and angry? \n\nI would arrange a time with her to sit down and chat with you and your husband. Lay out your grievances calmly, but firmly. Explain why her behaviour is not acceptable and why it needs to change. Tell her that you'd really like to have a better relationship with her, but that's only possible if she changes her attitude towards you as when she disrespects you, that makes you feel anger towards her, and that doesn't help either of you. I think putting a positive spin on it like that is important. Also, I think it's important to have your husband backing you up on this, as sometimes there's strength in numbers.\n\nBest of luck, however you decide to approach it! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a tough one, given that you&amp;#39;re living in her house. However, just because you&amp;#39;re living in her house gives her absolutely no right to disrespect you.&lt;/p&gt;\n\n&lt;p&gt;What kind of things does she do that make you feel disrespected and angry? &lt;/p&gt;\n\n&lt;p&gt;I would arrange a time with her to sit down and chat with you and your husband. Lay out your grievances calmly, but firmly. Explain why her behaviour is not acceptable and why it needs to change. Tell her that you&amp;#39;d really like to have a better relationship with her, but that&amp;#39;s only possible if she changes her attitude towards you as when she disrespects you, that makes you feel anger towards her, and that doesn&amp;#39;t help either of you. I think putting a positive spin on it like that is important. Also, I think it&amp;#39;s important to have your husband backing you up on this, as sometimes there&amp;#39;s strength in numbers.&lt;/p&gt;\n\n&lt;p&gt;Best of luck, however you decide to approach it! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg6a4nx", "score_hidden": false, "stickied": false, "created": 1492049478.0, "created_utc": 1492020678.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_64welj", "likes": null, "replies": "", "user_reports": [], "id": "dg5mh54", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "teedeehehe", "parent_id": "t3_64welj", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I wish I could help, but this is way outside my skill zone too :(\n\nI certainly can sympathize and relate to you though! I similarly set-up expectations with my MIL that I am not assertive/don't get mad. It started out with a general 'respect for your elders' type attitude in the initial meetings phase, and evolved into a 'I don't want to deal with your crazy' type reaction as the years went by. But yeah now it's been years and I've ended setting this precedent that I'm passive, not assertive, and put up with her antics. So basically I feel yah. It's hard to come back from. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I could help, but this is way outside my skill zone too :(&lt;/p&gt;\n\n&lt;p&gt;I certainly can sympathize and relate to you though! I similarly set-up expectations with my MIL that I am not assertive/don&amp;#39;t get mad. It started out with a general &amp;#39;respect for your elders&amp;#39; type attitude in the initial meetings phase, and evolved into a &amp;#39;I don&amp;#39;t want to deal with your crazy&amp;#39; type reaction as the years went by. But yeah now it&amp;#39;s been years and I&amp;#39;ve ended setting this precedent that I&amp;#39;m passive, not assertive, and put up with her antics. So basically I feel yah. It&amp;#39;s hard to come back from. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg5mh54", "score_hidden": false, "stickied": false, "created": 1492012817.0, "created_utc": 1491984017.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]