[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Little background: \nI&amp;#39;m a freshman at a small college that met a friend last semester. We met at class and started to do homework together, go out to eat at the dining hall, and then just hangout on the weekends. We even hung out during winter break. Everything was going good for like 5-6 months until all the sudden he just stopped texting/snapchatting me back this week.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve sent 6 texts within the past week and four snapchats and he&amp;#39;s read/opened them all, but just hasn&amp;#39;t responded. I even asked if he wanted to do homework together and grab dinner, but no response. I&amp;#39;ve seen him around campus walking by himself so it&amp;#39;s not like he found a new group of friends. I don&amp;#39;t know what&amp;#39;s up. &lt;/p&gt;\n\n&lt;p&gt;Should I address why&amp;#39;s he ignoring me in a text or what?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Little background: \nI'm a freshman at a small college that met a friend last semester. We met at class and started to do homework together, go out to eat at the dining hall, and then just hangout on the weekends. We even hung out during winter break. Everything was going good for like 5-6 months until all the sudden he just stopped texting/snapchatting me back this week.\n\nI've sent 6 texts within the past week and four snapchats and he's read/opened them all, but just hasn't responded. I even asked if he wanted to do homework together and grab dinner, but no response. I've seen him around campus walking by himself so it's not like he found a new group of friends. I don't know what's up. \n\nShould I address why's he ignoring me in a text or what?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "650t0d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "TextingProbz", "saved": false, "mod_reports": [], "name": "t3_650t0d", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/650t0d/my_friend_has_been_ignoring_my_texts_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492057988.0, "url": "https://www.reddit.com/r/socialskills/comments/650t0d/my_friend_has_been_ignoring_my_texts_and/", "author_flair_text": null, "quarantine": false, "title": "My friend has been ignoring my texts and snapchats for a week now. What should I do?", "created_utc": 1492029188.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_650t0d", "likes": null, "replies": "", "user_reports": [], "id": "dg6lipq", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "king_england", "parent_id": "t3_650t0d", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Chances are none of his behavior has anything to do with you or anything you've done. He may be going through a tough time. I'd say wait another day, then send him a text explaining how you've noticed he's been distant and you're wondering if everything's okay. It's always valid to let someone know you're aware of their actions and behavior.\n\nLet him know you're around if he feels like talking, and leave it at that and step back. The ball will be in his court entirely for if/when he responds. If he does and explains the situation, feel free to say you feel lousy about him flaking, if that's the case. Because it sucks when a friend falls off the face of the earth, and you deserve respect in your relationships. Just keep in mind it's very likely that none of his behavior is aimed at you.\n\nHope everything works out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Chances are none of his behavior has anything to do with you or anything you&amp;#39;ve done. He may be going through a tough time. I&amp;#39;d say wait another day, then send him a text explaining how you&amp;#39;ve noticed he&amp;#39;s been distant and you&amp;#39;re wondering if everything&amp;#39;s okay. It&amp;#39;s always valid to let someone know you&amp;#39;re aware of their actions and behavior.&lt;/p&gt;\n\n&lt;p&gt;Let him know you&amp;#39;re around if he feels like talking, and leave it at that and step back. The ball will be in his court entirely for if/when he responds. If he does and explains the situation, feel free to say you feel lousy about him flaking, if that&amp;#39;s the case. Because it sucks when a friend falls off the face of the earth, and you deserve respect in your relationships. Just keep in mind it&amp;#39;s very likely that none of his behavior is aimed at you.&lt;/p&gt;\n\n&lt;p&gt;Hope everything works out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg6lipq", "score_hidden": false, "stickied": false, "created": 1492061442.0, "created_utc": 1492032642.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_650t0d", "likes": null, "replies": "", "user_reports": [], "id": "dg6lray", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gedr", "parent_id": "t3_650t0d", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "He's probably depressed, or at a really low point right now. I would just walk up to him and hug him, but that's just me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s probably depressed, or at a really low point right now. I would just walk up to him and hug him, but that&amp;#39;s just me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg6lray", "score_hidden": false, "stickied": false, "created": 1492061724.0, "created_utc": 1492032924.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_650t0d", "likes": null, "replies": "", "user_reports": [], "id": "dg6se7o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_prettymotherfucker", "parent_id": "t3_650t0d", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Yeah, this is basically what I'm doing to all my mates right now because I'm going through a rough patch, so I'd suggest that you just try to talk to him in real life rather than online, and just bring up the fact that he's been ignoring you for a while, but in like a concerned way. Also just offer him your support and friendship and just reassure him you'll be there for him, and actually make sure you're there for him otherwise that will hurt his feelings more. If he doesn't wanna talk about why he's been ignoring your messages and such, don't keep asking because that'll make him less inclined to share let alone be with you. Basically when you're hanging out with him or anything, just try not to talk about the fact that he's been ignoring your messages and more about like joyful stuff, or music, or anything that you know he's interested in. Sorry if this is too long but yeah, I hope I can help", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, this is basically what I&amp;#39;m doing to all my mates right now because I&amp;#39;m going through a rough patch, so I&amp;#39;d suggest that you just try to talk to him in real life rather than online, and just bring up the fact that he&amp;#39;s been ignoring you for a while, but in like a concerned way. Also just offer him your support and friendship and just reassure him you&amp;#39;ll be there for him, and actually make sure you&amp;#39;re there for him otherwise that will hurt his feelings more. If he doesn&amp;#39;t wanna talk about why he&amp;#39;s been ignoring your messages and such, don&amp;#39;t keep asking because that&amp;#39;ll make him less inclined to share let alone be with you. Basically when you&amp;#39;re hanging out with him or anything, just try not to talk about the fact that he&amp;#39;s been ignoring your messages and more about like joyful stuff, or music, or anything that you know he&amp;#39;s interested in. Sorry if this is too long but yeah, I hope I can help&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg6se7o", "score_hidden": false, "stickied": false, "created": 1492069898.0, "created_utc": 1492041098.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]