[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m currently at large university. It&amp;#39;s really difficult for me to meet anyone, especially girls. When walking around campus, I sometimes see a really attractive girl that I want to talk to. The problem is that I&amp;#39;m not sure if it is socially acceptable to start a conversation by saying, &amp;quot;Hi I&amp;#39;m Tway9966, I think your really pretty/cute and thought I&amp;#39;d try to get to know you&amp;quot;. I&amp;#39;m not sure if this would be viewed as creepy or as flattering considering there would be no common ground to build off of. The same thing goes when asking for a number. Is it socially acceptable to walk up to someone and be like, &amp;quot;Hey I&amp;#39;m Tway9966. I think you&amp;#39;re really cute so I thought I&amp;#39;d introduce myself. I have to run, can I get your number so we can talk sometime&amp;quot;? Again, I&amp;#39;m pretty socially illiterate so I don&amp;#39;t know if many people see this as normal or creepy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm currently at large university. It's really difficult for me to meet anyone, especially girls. When walking around campus, I sometimes see a really attractive girl that I want to talk to. The problem is that I'm not sure if it is socially acceptable to start a conversation by saying, \"Hi I'm Tway9966, I think your really pretty/cute and thought I'd try to get to know you\". I'm not sure if this would be viewed as creepy or as flattering considering there would be no common ground to build off of. The same thing goes when asking for a number. Is it socially acceptable to walk up to someone and be like, \"Hey I'm Tway9966. I think you're really cute so I thought I'd introduce myself. I have to run, can I get your number so we can talk sometime\"? Again, I'm pretty socially illiterate so I don't know if many people see this as normal or creepy.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6575mo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "Tway9966", "saved": false, "mod_reports": [], "name": "t3_6575mo", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/6575mo/asking_for_a_girls_number/", "num_reports": null, "locked": false, "stickied": false, "created": 1492135343.0, "url": "https://www.reddit.com/r/socialskills/comments/6575mo/asking_for_a_girls_number/", "author_flair_text": null, "quarantine": false, "title": "Asking for a girl's number", "created_utc": 1492106543.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_6575mo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_6575mo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_6575mo", "likes": null, "replies": "", "user_reports": [], "id": "dg80liz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "stemm", "parent_id": "t1_dg809cy", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "\"I know the only way to get better is by actually making an attempt to talk to people\"\n\nMan that single piece of advice goes so far in this sub.... love it. \n\nAnyway, to your questions, yes - this is a case where the best solution is \"fake it until you make it\". What you're doing now is working to build up a track record in your mind of these conversations going well. Once you have that, you'll be more at ease/less nervous about talking to girls and the conversations will get easier, your results will improve, and a virtuous circle develops. However until then, there really is no substitute for the school of hard knocks. You just have to get out there and do it.\n\nTo your last question: Yes, do not simply walk up and ask for a number. Walk up, start a conversation (if she's walking, walk along with her for a bit), THEN ask for her number.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I know the only way to get better is by actually making an attempt to talk to people&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Man that single piece of advice goes so far in this sub.... love it. &lt;/p&gt;\n\n&lt;p&gt;Anyway, to your questions, yes - this is a case where the best solution is &amp;quot;fake it until you make it&amp;quot;. What you&amp;#39;re doing now is working to build up a track record in your mind of these conversations going well. Once you have that, you&amp;#39;ll be more at ease/less nervous about talking to girls and the conversations will get easier, your results will improve, and a virtuous circle develops. However until then, there really is no substitute for the school of hard knocks. You just have to get out there and do it.&lt;/p&gt;\n\n&lt;p&gt;To your last question: Yes, do not simply walk up and ask for a number. Walk up, start a conversation (if she&amp;#39;s walking, walk along with her for a bit), THEN ask for her number.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg80liz", "score_hidden": false, "stickied": false, "created": 1492138013.0, "created_utc": 1492109213.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg809cy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Tway9966", "parent_id": "t1_dg7yyii", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "So essentially fake being confident because I am not confident at all in my abilities to start a conversation on my own. \n\nI've just gotten to the point where I'm so tired of isolating myself because I lack social skills. I know the only way to get better is by actually making an attempt to talk to people and I guess this idea was the best that I could come up with. There's also the fact that I have never been in a relationship or even kissed a girl. That being said, I feel like some outcast of society at this large school.\n\nAnyway, the scenario I described for getting a girls number should come after some small talk? Don't just walk up and ask for it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So essentially fake being confident because I am not confident at all in my abilities to start a conversation on my own. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve just gotten to the point where I&amp;#39;m so tired of isolating myself because I lack social skills. I know the only way to get better is by actually making an attempt to talk to people and I guess this idea was the best that I could come up with. There&amp;#39;s also the fact that I have never been in a relationship or even kissed a girl. That being said, I feel like some outcast of society at this large school.&lt;/p&gt;\n\n&lt;p&gt;Anyway, the scenario I described for getting a girls number should come after some small talk? Don&amp;#39;t just walk up and ask for it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg809cy", "score_hidden": false, "stickied": false, "created": 1492137649.0, "created_utc": 1492108849.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7yyii", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "stemm", "parent_id": "t3_6575mo", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Striking up conversation with a girl you find attractive is a great habit to get into. There's a bit of a double standard in that if you do this well, girls will be flattered and if you do it poorly, you come across as creepy. \n\nSo, the answer to your question about whether it's socially acceptable to start a conversation this way is: yes, IF you do it right. \n\nThe difference in whether you do this well or come across as creepy is entirely in how well you OWN what you're doing. At a basic level, creepiness comes from when people detect a mismatch between what you verbally say and what your body language/subcommunications say. \n\nGuys come across as creepy when they walk up and are nervous or unsure of themselves, not because there's anything wrong with being nervous, but because when you walk up and say \"Hi, Um... I'm uhh Tway9966 and like I just saw you uhh..\" the girl is thinking \"What's going on here? Why is he so nervous? Is there something else going on?\" \n\nTHAT is creepy. Walking up and saying \"Hey, this is random and I don't usually do this, but I saw you from over there and thought you're cute so I wanted to come say hi. I'm Tway 9966\" and OWNING it, without hesitation and without apology, is the type of shit that sweeps a girl off her feet. \n\nDon't get me wrong - not every girl will react positively no matter how confident you are. Some are inherently made uncomfortable by this, some are in a hurry, some have a boyfriend - whatever. The difference for the girls that still say \"no thanks\" is that they'll leave and respect what you did instead of being creeped out.\n\nOne additional thing to note based on your post: if you're going to ask for a girl's number, saying what you wrote above is fine but it's important to talk to the girl for 5-10 minutes beforehand. Otherwise she won't believe the notion that you're genuinely interested in her, she'll wonder why you're asking for her number, and she'll be creeped out. \n\nI respect the hell out of the fact that you want to make this a habit. Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Striking up conversation with a girl you find attractive is a great habit to get into. There&amp;#39;s a bit of a double standard in that if you do this well, girls will be flattered and if you do it poorly, you come across as creepy. &lt;/p&gt;\n\n&lt;p&gt;So, the answer to your question about whether it&amp;#39;s socially acceptable to start a conversation this way is: yes, IF you do it right. &lt;/p&gt;\n\n&lt;p&gt;The difference in whether you do this well or come across as creepy is entirely in how well you OWN what you&amp;#39;re doing. At a basic level, creepiness comes from when people detect a mismatch between what you verbally say and what your body language/subcommunications say. &lt;/p&gt;\n\n&lt;p&gt;Guys come across as creepy when they walk up and are nervous or unsure of themselves, not because there&amp;#39;s anything wrong with being nervous, but because when you walk up and say &amp;quot;Hi, Um... I&amp;#39;m uhh Tway9966 and like I just saw you uhh..&amp;quot; the girl is thinking &amp;quot;What&amp;#39;s going on here? Why is he so nervous? Is there something else going on?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;THAT is creepy. Walking up and saying &amp;quot;Hey, this is random and I don&amp;#39;t usually do this, but I saw you from over there and thought you&amp;#39;re cute so I wanted to come say hi. I&amp;#39;m Tway 9966&amp;quot; and OWNING it, without hesitation and without apology, is the type of shit that sweeps a girl off her feet. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t get me wrong - not every girl will react positively no matter how confident you are. Some are inherently made uncomfortable by this, some are in a hurry, some have a boyfriend - whatever. The difference for the girls that still say &amp;quot;no thanks&amp;quot; is that they&amp;#39;ll leave and respect what you did instead of being creeped out.&lt;/p&gt;\n\n&lt;p&gt;One additional thing to note based on your post: if you&amp;#39;re going to ask for a girl&amp;#39;s number, saying what you wrote above is fine but it&amp;#39;s important to talk to the girl for 5-10 minutes beforehand. Otherwise she won&amp;#39;t believe the notion that you&amp;#39;re genuinely interested in her, she&amp;#39;ll wonder why you&amp;#39;re asking for her number, and she&amp;#39;ll be creeped out. &lt;/p&gt;\n\n&lt;p&gt;I respect the hell out of the fact that you want to make this a habit. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg7yyii", "score_hidden": false, "stickied": false, "created": 1492136263.0, "created_utc": 1492107463.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_6575mo", "likes": null, "replies": "", "user_reports": [], "id": "dg83l5w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_valtiel_", "parent_id": "t3_6575mo", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "i think you get the number eventually. \n\nif a girl wants to have her contact info she'll find some way to give it to you which is what I've realized.\n\nI asked this girl once for an email, she asked for my phone and she gave her number instead. turns out this one liked me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i think you get the number eventually. &lt;/p&gt;\n\n&lt;p&gt;if a girl wants to have her contact info she&amp;#39;ll find some way to give it to you which is what I&amp;#39;ve realized.&lt;/p&gt;\n\n&lt;p&gt;I asked this girl once for an email, she asked for my phone and she gave her number instead. turns out this one liked me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg83l5w", "score_hidden": false, "stickied": false, "created": 1492141257.0, "created_utc": 1492112457.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_6575mo", "likes": null, "replies": "", "user_reports": [], "id": "dg867m4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chaldeanrefuge", "parent_id": "t3_6575mo", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "It's socially acceptable. It's 2017. \n\nFew tips:\n1) Practice your openers in advance. For example, a major sports team doesn't just go on the field and hope things will go right. They drill over and over again. Say your open to yourself several times so you know what it feels like to say it and so that you can edit it so that it sounds best when you do; \"Hi, I'm Tway9966. I thought you were cute and had to meet you.\" SMILE  (let's her know you're friendly).\n\nOr if you're walking by her; \"Psychology major?\" She'll say \"What?\" You; \"I'm guessing your major.\" She'll then correct you and then you can ask her how she likes it and segway into other topics. \n\nOr if you're walking side by side each other; \"Want to race?\" I did this with a girl outside the university's gym and she laughed and said; \"All my friends say I walk really fast.\" We started talking and she gave me her number. \n\nTry different things. And for now don't even worry about getting the number. Just look at it as you're developing your social skills; \"Hi, I'm Tway9966. I'm looking to meet some cool people on campus.\" ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s socially acceptable. It&amp;#39;s 2017. &lt;/p&gt;\n\n&lt;p&gt;Few tips:\n1) Practice your openers in advance. For example, a major sports team doesn&amp;#39;t just go on the field and hope things will go right. They drill over and over again. Say your open to yourself several times so you know what it feels like to say it and so that you can edit it so that it sounds best when you do; &amp;quot;Hi, I&amp;#39;m Tway9966. I thought you were cute and had to meet you.&amp;quot; SMILE  (let&amp;#39;s her know you&amp;#39;re friendly).&lt;/p&gt;\n\n&lt;p&gt;Or if you&amp;#39;re walking by her; &amp;quot;Psychology major?&amp;quot; She&amp;#39;ll say &amp;quot;What?&amp;quot; You; &amp;quot;I&amp;#39;m guessing your major.&amp;quot; She&amp;#39;ll then correct you and then you can ask her how she likes it and segway into other topics. &lt;/p&gt;\n\n&lt;p&gt;Or if you&amp;#39;re walking side by side each other; &amp;quot;Want to race?&amp;quot; I did this with a girl outside the university&amp;#39;s gym and she laughed and said; &amp;quot;All my friends say I walk really fast.&amp;quot; We started talking and she gave me her number. &lt;/p&gt;\n\n&lt;p&gt;Try different things. And for now don&amp;#39;t even worry about getting the number. Just look at it as you&amp;#39;re developing your social skills; &amp;quot;Hi, I&amp;#39;m Tway9966. I&amp;#39;m looking to meet some cool people on campus.&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg867m4", "score_hidden": false, "stickied": false, "created": 1492144133.0, "created_utc": 1492115333.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]