[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I admit. I do like to come off that way only in the context of a joke or parodying actual douches or confident people and I find it funny. &lt;/p&gt;\n\n&lt;p&gt;Most people find it funny. But this one girl, I&amp;#39;m not sure what her problem is but I think its low self-esteem, her voice is soft and I usually don&amp;#39;t have time or patience to tailor my personality and humour to her so as a result whenever I look at her she thinks i&amp;#39;m making fun of her. &lt;/p&gt;\n\n&lt;p&gt;Haha that&amp;#39;s so ridiculous, so I laugh. Even when I don&amp;#39;t look at her she thinks I&amp;#39;m judging her. I thought she liked me so I invited her out just once, blew me off so I carried on as normal. Unfortunately in a group study I was asking some guy questions, she says I&amp;#39;m judging him but these were just questions. The guy said he doesn&amp;#39;t eat in the morning, I asked why, it&amp;#39;s his thing. I give a canned response that breakfast is the most important meal, bro. I asked him if I was judging him, he said no.&lt;/p&gt;\n\n&lt;p&gt;So when she said that I kinda got fed up (because if I pretty much breathe in her presence, I&amp;#39;m making fun of her. It was just weird. I feel as if she is judging ME sometimes). and said &amp;quot;To you maybe.&amp;quot; (I singled her out, a no no). then she proceeds to tell her friend next to me all this other &amp;quot;mean&amp;quot; thing I&amp;#39;ve said.  To which she recoiled in horror, she doesn&amp;#39;t seem to want to let go of that. Here&amp;#39;s what &amp;quot;that&amp;quot; is: I was bored so I asked if she&amp;#39;s been in a schoolyard fight, I&amp;#39;ve asked another chick that and she went in detail about it and didn&amp;#39;t mind talking about it at all.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have many friends. Even growing up I was by myself. My older brother is the same, probably genetic. He&amp;#39;s pretty much my best friend. Personally I think about stuff like this a lot, maybe its not a big deal but it&amp;#39;s exhausting to think about. Which makes me wanna go &amp;quot;Ok this time I ACTUALLY tried and it sucked.&amp;quot; But I did learn a great deal about my attempt to change.&lt;/p&gt;\n\n&lt;p&gt;I did pledge this year to change, I read Dale Carnegie and all the good stuff but I think most people are just retarded and its a lost cause, or I just can&amp;#39;t seem to relate, or I&amp;#39;m impatient with others. In this class, the other guys I hung out with are in another section. I didn&amp;#39;t know anybody this winter. But I did make three friends at least.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I admit. I do like to come off that way only in the context of a joke or parodying actual douches or confident people and I find it funny. \n\nMost people find it funny. But this one girl, I'm not sure what her problem is but I think its low self-esteem, her voice is soft and I usually don't have time or patience to tailor my personality and humour to her so as a result whenever I look at her she thinks i'm making fun of her. \n\nHaha that's so ridiculous, so I laugh. Even when I don't look at her she thinks I'm judging her. I thought she liked me so I invited her out just once, blew me off so I carried on as normal. Unfortunately in a group study I was asking some guy questions, she says I'm judging him but these were just questions. The guy said he doesn't eat in the morning, I asked why, it's his thing. I give a canned response that breakfast is the most important meal, bro. I asked him if I was judging him, he said no.\n\nSo when she said that I kinda got fed up (because if I pretty much breathe in her presence, I'm making fun of her. It was just weird. I feel as if she is judging ME sometimes). and said \"To you maybe.\" (I singled her out, a no no). then she proceeds to tell her friend next to me all this other \"mean\" thing I've said.  To which she recoiled in horror, she doesn't seem to want to let go of that. Here's what \"that\" is: I was bored so I asked if she's been in a schoolyard fight, I've asked another chick that and she went in detail about it and didn't mind talking about it at all.\n\nI don't have many friends. Even growing up I was by myself. My older brother is the same, probably genetic. He's pretty much my best friend. Personally I think about stuff like this a lot, maybe its not a big deal but it's exhausting to think about. Which makes me wanna go \"Ok this time I ACTUALLY tried and it sucked.\" But I did learn a great deal about my attempt to change.\n\nI did pledge this year to change, I read Dale Carnegie and all the good stuff but I think most people are just retarded and its a lost cause, or I just can't seem to relate, or I'm impatient with others. In this class, the other guys I hung out with are in another section. I didn't know anybody this winter. But I did make three friends at least.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657hwh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "_valtiel_", "saved": false, "mod_reports": [], "name": "t3_657hwh", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": 1492109953.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/657hwh/i_come_off_as_an_asshole/", "num_reports": null, "locked": false, "stickied": false, "created": 1492138554.0, "url": "https://www.reddit.com/r/socialskills/comments/657hwh/i_come_off_as_an_asshole/", "author_flair_text": null, "quarantine": false, "title": "I come off as an asshole?", "created_utc": 1492109754.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_657hwh", "likes": null, "replies": "", "user_reports": [], "id": "dg81k3i", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "melrom", "parent_id": "t3_657hwh", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Are you looking for some feedback or just sharing your story?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you looking for some feedback or just sharing your story?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg81k3i", "score_hidden": false, "stickied": false, "created": 1492139048.0, "created_utc": 1492110248.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_657hwh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_657hwh", "likes": null, "replies": "", "user_reports": [], "id": "dg84kww", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_valtiel_", "parent_id": "t1_dg83kf6", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "this is college.\n\nBecause she is seemingly upset about that one question that I asked her I don't think she'll change. I struggle to get along with insecure people because I am recovering from insecurities myself. She doesn't seem like my IDGAF aura, I'm also super confident about exams. I talk about how I'm gonna crush these exams and other obstacles in life because that's the way I feel, and that's what keeps me going. Maybe there's just to much I's in my displays of confidence and not enough \"We's\". \n\nBut for so long I've only had to think about myself because there were times I didn't have friends. \n\nThanks for replying. It's gonna be hard to change, but I have more insight thanks to you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this is college.&lt;/p&gt;\n\n&lt;p&gt;Because she is seemingly upset about that one question that I asked her I don&amp;#39;t think she&amp;#39;ll change. I struggle to get along with insecure people because I am recovering from insecurities myself. She doesn&amp;#39;t seem like my IDGAF aura, I&amp;#39;m also super confident about exams. I talk about how I&amp;#39;m gonna crush these exams and other obstacles in life because that&amp;#39;s the way I feel, and that&amp;#39;s what keeps me going. Maybe there&amp;#39;s just to much I&amp;#39;s in my displays of confidence and not enough &amp;quot;We&amp;#39;s&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;But for so long I&amp;#39;ve only had to think about myself because there were times I didn&amp;#39;t have friends. &lt;/p&gt;\n\n&lt;p&gt;Thanks for replying. It&amp;#39;s gonna be hard to change, but I have more insight thanks to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg84kww", "score_hidden": false, "stickied": false, "created": 1492142329.0, "created_utc": 1492113529.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83kf6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "melrom", "parent_id": "t3_657hwh", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Okay. Are you in high school by any chance? \n\nFrom what you said, I see two different issues:\n\n1. You are thinking about how your behavior affects others and whether there are positive changes you can make to change it.\n2. You are trying to have some control over how another individual will perceive you.\n\nThe truth is that there will always be some people in life who like you and others who detest you right off the bat. It happens to everyone and sometimes you will never know the reason. Because we just don't know the experiences others have had in life. It can be something as simple as some people might have had bad experiences with people named Dave and you might be named Dave. You are only in control of your own emotions. \n\nOkay, so for the girl in your story, it sounds like she takes issue with you but the way she is acting is on her, not you. It's frankly quite immature. If you are really interested in bridging the gap or genuinely curious about why you come off the wrong way to her, I think you should be very genuine and give her a platform to speak her mind. Approach her one day while she is in the hallway or study hall and say, \"hey listen, I know we have really gotten off on a bad foot and I'd like to hear you out on what i do that upsets you because I'd like for us to be friends. Do you want to grab a coffee after class?\" (Or grab lunch, spend free period together, etc)\n\nIf she says yes, when she speaks her mind, try not to get defensive about the things she says she doesn't like or takes issue with about you. Think of it more like you're just trying to find out how your actions make her feel. Remember that something that seems like a benign comment to you might actually really hurt her feelings. So you can make an effort, if you care to be her friend, to not make those types of comments to her. If you don't care to be her friend, then you can think about whether the feedback she gives you is something you think you want to change in yourself.\n\nIf she says no to your invitation to talk, then I would just say: \"Okay, well I'm here if you would like to talk sometimes.\" Then, you just have to let it go. You gave her the opportunity to share her feelings and opinions and she declined. But at least you took the high road and extended an olive branch, so to speak.\n\nNow, outside of the context of this girl, it's always good to evaluate what we say, why we say it, and how it might affect or be perceived by others once in awhile. Start by noticing what comments you make that seem to be not very well-received. Very often we make comments that seem mean or standoffish when we are actually just covering up our own insecurities. Taking a mental inventory or checking in with yourself and how you are feeling is important.  Also, thinking about how you treat others and what qualities about yourself that you would like to project into the world.\n\nBut at the end of the day, if you want to enact changes for yourself or understand your behaviors better, go for it! But if you want to change so everyone likes you, you'll drive yourself crazy and never achieve your goal. You don't need everyone's acceptance in life to be a good person or to be successful. You just need to accept yourself and that won't be okay with everyone but that's totally okay.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay. Are you in high school by any chance? &lt;/p&gt;\n\n&lt;p&gt;From what you said, I see two different issues:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;You are thinking about how your behavior affects others and whether there are positive changes you can make to change it.&lt;/li&gt;\n&lt;li&gt;You are trying to have some control over how another individual will perceive you.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The truth is that there will always be some people in life who like you and others who detest you right off the bat. It happens to everyone and sometimes you will never know the reason. Because we just don&amp;#39;t know the experiences others have had in life. It can be something as simple as some people might have had bad experiences with people named Dave and you might be named Dave. You are only in control of your own emotions. &lt;/p&gt;\n\n&lt;p&gt;Okay, so for the girl in your story, it sounds like she takes issue with you but the way she is acting is on her, not you. It&amp;#39;s frankly quite immature. If you are really interested in bridging the gap or genuinely curious about why you come off the wrong way to her, I think you should be very genuine and give her a platform to speak her mind. Approach her one day while she is in the hallway or study hall and say, &amp;quot;hey listen, I know we have really gotten off on a bad foot and I&amp;#39;d like to hear you out on what i do that upsets you because I&amp;#39;d like for us to be friends. Do you want to grab a coffee after class?&amp;quot; (Or grab lunch, spend free period together, etc)&lt;/p&gt;\n\n&lt;p&gt;If she says yes, when she speaks her mind, try not to get defensive about the things she says she doesn&amp;#39;t like or takes issue with about you. Think of it more like you&amp;#39;re just trying to find out how your actions make her feel. Remember that something that seems like a benign comment to you might actually really hurt her feelings. So you can make an effort, if you care to be her friend, to not make those types of comments to her. If you don&amp;#39;t care to be her friend, then you can think about whether the feedback she gives you is something you think you want to change in yourself.&lt;/p&gt;\n\n&lt;p&gt;If she says no to your invitation to talk, then I would just say: &amp;quot;Okay, well I&amp;#39;m here if you would like to talk sometimes.&amp;quot; Then, you just have to let it go. You gave her the opportunity to share her feelings and opinions and she declined. But at least you took the high road and extended an olive branch, so to speak.&lt;/p&gt;\n\n&lt;p&gt;Now, outside of the context of this girl, it&amp;#39;s always good to evaluate what we say, why we say it, and how it might affect or be perceived by others once in awhile. Start by noticing what comments you make that seem to be not very well-received. Very often we make comments that seem mean or standoffish when we are actually just covering up our own insecurities. Taking a mental inventory or checking in with yourself and how you are feeling is important.  Also, thinking about how you treat others and what qualities about yourself that you would like to project into the world.&lt;/p&gt;\n\n&lt;p&gt;But at the end of the day, if you want to enact changes for yourself or understand your behaviors better, go for it! But if you want to change so everyone likes you, you&amp;#39;ll drive yourself crazy and never achieve your goal. You don&amp;#39;t need everyone&amp;#39;s acceptance in life to be a good person or to be successful. You just need to accept yourself and that won&amp;#39;t be okay with everyone but that&amp;#39;s totally okay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg83kf6", "score_hidden": false, "stickied": false, "created": 1492141234.0, "created_utc": 1492112434.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]