[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So for background I&amp;#39;m a 20 year old dude, in my second year of college. A few months ago my girlfriend and I broke up. It&amp;#39;s been a pretty hard time lately but it&amp;#39;s starting to get a little better slowly one day at a time.&lt;/p&gt;\n\n&lt;p&gt;One thing that has made it a little harder is I&amp;#39;m feeling a little isolated from my friends. Some of my friends have moved away from college and I&amp;#39;ve never exactly been the friend that everyone is dying to hang out with. It&amp;#39;s cool to them if I&amp;#39;m there, but I&amp;#39;m not exactly missed that much if I&amp;#39;m not.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how to change this. How to change my role and the way my friends look at me. I hate it, I hate knowing my friends are hanging out drinking but they don&amp;#39;t hit me up. Then when I bring it up to them they say they just forgot. If they don&amp;#39;t like me or have a problem with me I wish they would just tell me so I could fix it.&lt;/p&gt;\n\n&lt;p&gt;It also hurts my confidence and is a reason I think I have struggled to make new friends in college. I need to get the rest of the way over this break up, and I think not being so lonely all the time would help, I just need to know how to make people want to be around me.&lt;/p&gt;\n\n&lt;p&gt;Tl;dr : girlfriend and I recently broke up and I&amp;#39;ve been pretty lonely. I&amp;#39;m struggling to get if the friends I already have like me and I can&amp;#39;t make new ones easily. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So for background I'm a 20 year old dude, in my second year of college. A few months ago my girlfriend and I broke up. It's been a pretty hard time lately but it's starting to get a little better slowly one day at a time.\n\nOne thing that has made it a little harder is I'm feeling a little isolated from my friends. Some of my friends have moved away from college and I've never exactly been the friend that everyone is dying to hang out with. It's cool to them if I'm there, but I'm not exactly missed that much if I'm not.\n\nI don't know how to change this. How to change my role and the way my friends look at me. I hate it, I hate knowing my friends are hanging out drinking but they don't hit me up. Then when I bring it up to them they say they just forgot. If they don't like me or have a problem with me I wish they would just tell me so I could fix it.\n\nIt also hurts my confidence and is a reason I think I have struggled to make new friends in college. I need to get the rest of the way over this break up, and I think not being so lonely all the time would help, I just need to know how to make people want to be around me.\n\nTl;dr : girlfriend and I recently broke up and I've been pretty lonely. I'm struggling to get if the friends I already have like me and I can't make new ones easily. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65c6iz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 17, "report_reasons": null, "author": "halfwayto40", "saved": false, "mod_reports": [], "name": "t3_65c6iz", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65c6iz/im_struggling_with_making_new_friends_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492201043.0, "url": "https://www.reddit.com/r/socialskills/comments/65c6iz/im_struggling_with_making_new_friends_and/", "author_flair_text": null, "quarantine": false, "title": "I'm struggling with making new friends and reconnecting with old ones that I have.", "created_utc": 1492172243.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65c6iz", "likes": null, "replies": "", "user_reports": [], "id": "dg93ofv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "glogloglo", "parent_id": "t3_65c6iz", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Hey dude! Thanks for posting. I'm new to this subreddit, however, I hope my words help.\n\nI'm sorry about your breakup. You must be going through a hard time right now. Long ago, when humans needed to be in groups for raw survival, ostracism (breakups) usually meant death for those being cast out of the tribe. Nowadays, breakups are rarely fatal, however, good luck getting our brains to believe that! What you're feeling is likely intense social isolation.\n\nI can tell you with 100% confidence things are going to get better. At 20 years old, your physical and mental resilience haven't even hit their full throttle yet! These experiences you're having now are extremely important!! They're giving you the option to learn to heal correctly!\n\nA few notes... if you had a girlfriend, it seems clear that someone out there was definitely in to you. It might not be the case in this moment, but who you are attracted someone to you. And you should feel great for that! Write down your best traits and your passions, remind yourself of why you're great, and, when you're ready, take one little step to building a new bond with someone, however big or small. Good luck ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey dude! Thanks for posting. I&amp;#39;m new to this subreddit, however, I hope my words help.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry about your breakup. You must be going through a hard time right now. Long ago, when humans needed to be in groups for raw survival, ostracism (breakups) usually meant death for those being cast out of the tribe. Nowadays, breakups are rarely fatal, however, good luck getting our brains to believe that! What you&amp;#39;re feeling is likely intense social isolation.&lt;/p&gt;\n\n&lt;p&gt;I can tell you with 100% confidence things are going to get better. At 20 years old, your physical and mental resilience haven&amp;#39;t even hit their full throttle yet! These experiences you&amp;#39;re having now are extremely important!! They&amp;#39;re giving you the option to learn to heal correctly!&lt;/p&gt;\n\n&lt;p&gt;A few notes... if you had a girlfriend, it seems clear that someone out there was definitely in to you. It might not be the case in this moment, but who you are attracted someone to you. And you should feel great for that! Write down your best traits and your passions, remind yourself of why you&amp;#39;re great, and, when you&amp;#39;re ready, take one little step to building a new bond with someone, however big or small. Good luck &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg93ofv", "score_hidden": false, "stickied": false, "created": 1492203989.0, "created_utc": 1492175189.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65c6iz", "likes": null, "replies": "", "user_reports": [], "id": "dg9g6rt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ineedtodancebaby", "parent_id": "t3_65c6iz", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Sorry to hear you're going through some pain, buddy. I feel for you and it sucks. After reading your post, I wanted to share a few things that came to my mind. Maybe I'm totally off base on some of them and maybe not. Feel free to pick out what you like. My intent isn't to solve your issues but give you a different perspective and reassure you that you will be OK and things will work out for you in the long run. \n\nTake some time for yourself and let the grieving process take place. It can feel very lonely, especially if you and your ex were together for a long time. Sometimes you'll feel angry, other times extremely sad, or that life is just mundane. These are all various forms of pain and they need to take place so that you can fully understand yourself and learn from your experience. If you push your emotions aside and only seek to escape them, you may find that you repeat the same circumstance later on. Pain can be a great teacher in this situation.\n\nFocus on yourself, activities you enjoy, and exploring. You're 20 years in and in college with tons of room to grow as an adult. If it's a big university, then you have tons of room to explore people, events, movements etc. You don't need to force any of these things, but look inside yourself and ask questions about what you might enjoy and see if the campus supports any activities around that.\n\nAs for friends, it may be worthwhile to be open and honest with them about the situation and how you feel. If they truly are reliable and valuable friendships, they will hear where you're coming from. If they blow you off, and have no patience to discuss why they have been distancing themselves then these may be old friendships that aren't growing in the same manner that you are. It's easy to resort to activities/friendships in time of pain. \n\nI also want to share a butchered version of something I read recently... You are exactly where you are supposed to be, in this moment, and you aren't supposed to be anywhere else. You are meant to have this experience, here and now. We can know this, because we are in fact not anywhere else but here. It can give you some reassurance that what you are experiencing here and now, is exactly what needs to happen for you. How is this the case? Because you are here in this moment experiencing it and not in the future or the past. In other words, embrace this moment, the pain, the suffering and find value within it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry to hear you&amp;#39;re going through some pain, buddy. I feel for you and it sucks. After reading your post, I wanted to share a few things that came to my mind. Maybe I&amp;#39;m totally off base on some of them and maybe not. Feel free to pick out what you like. My intent isn&amp;#39;t to solve your issues but give you a different perspective and reassure you that you will be OK and things will work out for you in the long run. &lt;/p&gt;\n\n&lt;p&gt;Take some time for yourself and let the grieving process take place. It can feel very lonely, especially if you and your ex were together for a long time. Sometimes you&amp;#39;ll feel angry, other times extremely sad, or that life is just mundane. These are all various forms of pain and they need to take place so that you can fully understand yourself and learn from your experience. If you push your emotions aside and only seek to escape them, you may find that you repeat the same circumstance later on. Pain can be a great teacher in this situation.&lt;/p&gt;\n\n&lt;p&gt;Focus on yourself, activities you enjoy, and exploring. You&amp;#39;re 20 years in and in college with tons of room to grow as an adult. If it&amp;#39;s a big university, then you have tons of room to explore people, events, movements etc. You don&amp;#39;t need to force any of these things, but look inside yourself and ask questions about what you might enjoy and see if the campus supports any activities around that.&lt;/p&gt;\n\n&lt;p&gt;As for friends, it may be worthwhile to be open and honest with them about the situation and how you feel. If they truly are reliable and valuable friendships, they will hear where you&amp;#39;re coming from. If they blow you off, and have no patience to discuss why they have been distancing themselves then these may be old friendships that aren&amp;#39;t growing in the same manner that you are. It&amp;#39;s easy to resort to activities/friendships in time of pain. &lt;/p&gt;\n\n&lt;p&gt;I also want to share a butchered version of something I read recently... You are exactly where you are supposed to be, in this moment, and you aren&amp;#39;t supposed to be anywhere else. You are meant to have this experience, here and now. We can know this, because we are in fact not anywhere else but here. It can give you some reassurance that what you are experiencing here and now, is exactly what needs to happen for you. How is this the case? Because you are here in this moment experiencing it and not in the future or the past. In other words, embrace this moment, the pain, the suffering and find value within it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg9g6rt", "score_hidden": false, "stickied": false, "created": 1492219664.0, "created_utc": 1492190864.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]