[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I spent my years in college going through counseling to become a more sociable person. I improved dramatically from my pre-college years but never became a social butterfly. &lt;/p&gt;\n\n&lt;p&gt;Fast forward to some time after college. I&amp;#39;ve had a lot of time to reflect and found that I&amp;#39;m so much happier staying true to my introverted, asocial self. I can make pleasant small talk at work and get along with coworkers. But after work, that&amp;#39;s it. I want to be left alone. Socializing drains me so quickly and I need to have personal time to recharge. &lt;/p&gt;\n\n&lt;p&gt;My passion is video games. Playing them. My friends and I formed a group to develop games, but secretly I would much rather play than create. Video games have always been a huge part of my life. I don&amp;#39;t play excessively. 6 hours a day, tops. But I&amp;#39;m always super excited for new releases, keep up with news, hunt for deals, talk to friends about them. It&amp;#39;s the thought of games I love. &lt;/p&gt;\n\n&lt;p&gt;This is me in a nutshell. I love me some alone time and don&amp;#39;t have many interests outside of video games. I&amp;#39;ve become so much happier since accepting myself for this. Only problem is, most people would find this sad. I can&amp;#39;t imagine it being acceptable to be a man in my 40s, being an unsociable person after work and when people ask what I did over the weekend replying that I&amp;#39;ve had a blast playing games. &lt;/p&gt;\n\n&lt;p&gt;And then I think about what my parents and brother might think of me at that point in the future. My brother lives a similar lifestyle as me but it wouldn&amp;#39;t surprise me if he gets a girl someday (I&amp;#39;m not interested in pursuing a relationship by the way). Even if he stayed the way he is now, chances are extremely high he&amp;#39;ll live a more exciting lifestyle than me just from being a family man. At that point I&amp;#39;d be the guy everyone in the family feels sorry for, &amp;quot;uninteresting&amp;quot; and a loner. &lt;/p&gt;\n\n&lt;p&gt;I like myself for who I am and wouldn&amp;#39;t change a thing. But this worry of what others will think of me, now and far into the future, stops me from fully feeling comfortable. I wonder if anyone here can relate. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I spent my years in college going through counseling to become a more sociable person. I improved dramatically from my pre-college years but never became a social butterfly. \n\nFast forward to some time after college. I've had a lot of time to reflect and found that I'm so much happier staying true to my introverted, asocial self. I can make pleasant small talk at work and get along with coworkers. But after work, that's it. I want to be left alone. Socializing drains me so quickly and I need to have personal time to recharge. \n\nMy passion is video games. Playing them. My friends and I formed a group to develop games, but secretly I would much rather play than create. Video games have always been a huge part of my life. I don't play excessively. 6 hours a day, tops. But I'm always super excited for new releases, keep up with news, hunt for deals, talk to friends about them. It's the thought of games I love. \n\nThis is me in a nutshell. I love me some alone time and don't have many interests outside of video games. I've become so much happier since accepting myself for this. Only problem is, most people would find this sad. I can't imagine it being acceptable to be a man in my 40s, being an unsociable person after work and when people ask what I did over the weekend replying that I've had a blast playing games. \n\nAnd then I think about what my parents and brother might think of me at that point in the future. My brother lives a similar lifestyle as me but it wouldn't surprise me if he gets a girl someday (I'm not interested in pursuing a relationship by the way). Even if he stayed the way he is now, chances are extremely high he'll live a more exciting lifestyle than me just from being a family man. At that point I'd be the guy everyone in the family feels sorry for, \"uninteresting\" and a loner. \n\nI like myself for who I am and wouldn't change a thing. But this worry of what others will think of me, now and far into the future, stops me from fully feeling comfortable. I wonder if anyone here can relate. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65c824", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "cuz78910", "saved": false, "mod_reports": [], "name": "t3_65c824", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65c824/im_asocial_and_have_no_ambition_i_wouldnt_change/", "num_reports": null, "locked": false, "stickied": false, "created": 1492201632.0, "url": "https://www.reddit.com/r/socialskills/comments/65c824/im_asocial_and_have_no_ambition_i_wouldnt_change/", "author_flair_text": null, "quarantine": false, "title": "I'm asocial and have no ambition. I wouldn't change a thing, except society makes things hard for someone like me", "created_utc": 1492172832.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65c824", "likes": null, "replies": "", "user_reports": [], "id": "dg93dzy", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "glogloglo", "parent_id": "t3_65c824", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Hi, you sound really cool! Let me compliment you on a few things:\n\n1. I like that you know what you like\n\n2. I like that you're being honest with yourself about how you feel\n\n3. It's cool that you're passionate about what you love!\n\nLet me point something out though.. it seems you are concerned with how you're looking through other people's eyes. Everyone does this! It's very important to know that at the end of the day, most people are fretting about themselves in their own style, just like you're doing with yours. \n\nYou're a lot better off than you think! Stick with your passions, chase what you're loving in life already, and I am certain it's only a matter of time before you find a little tribe who will think you're awesome for being how you are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi, you sound really cool! Let me compliment you on a few things:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;I like that you know what you like&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I like that you&amp;#39;re being honest with yourself about how you feel&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It&amp;#39;s cool that you&amp;#39;re passionate about what you love!&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Let me point something out though.. it seems you are concerned with how you&amp;#39;re looking through other people&amp;#39;s eyes. Everyone does this! It&amp;#39;s very important to know that at the end of the day, most people are fretting about themselves in their own style, just like you&amp;#39;re doing with yours. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re a lot better off than you think! Stick with your passions, chase what you&amp;#39;re loving in life already, and I am certain it&amp;#39;s only a matter of time before you find a little tribe who will think you&amp;#39;re awesome for being how you are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg93dzy", "score_hidden": false, "stickied": false, "created": 1492203473.0, "created_utc": 1492174673.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65c824", "likes": null, "replies": "", "user_reports": [], "id": "dg96jf5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kahriqsalil", "parent_id": "t3_65c824", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "If you were happy with the life that you live, great! Screw what anyone else thinks. You do seem somewhat concerned about what your family thinks (or will think) and how they view you. That might just be paranoia, which is natural, and they may not even see anything wrong at all. I can relate on that level", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you were happy with the life that you live, great! Screw what anyone else thinks. You do seem somewhat concerned about what your family thinks (or will think) and how they view you. That might just be paranoia, which is natural, and they may not even see anything wrong at all. I can relate on that level&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg96jf5", "score_hidden": false, "stickied": false, "created": 1492208286.0, "created_utc": 1492179486.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65c824", "likes": null, "replies": "", "user_reports": [], "id": "dg9tmjx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "biggmeech", "parent_id": "t3_65c824", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "you sound like the ideal mate, because you're just like me. but thats just because my ideal mate IS me. i worry if it is just some peoples destiny to be alone, and only then will I find happiness? all the women in my family end up divorced and alone. is it genetic? im longtime married to my total opposite and after 15yrs still feel like a wierdo, and make him miserable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you sound like the ideal mate, because you&amp;#39;re just like me. but thats just because my ideal mate IS me. i worry if it is just some peoples destiny to be alone, and only then will I find happiness? all the women in my family end up divorced and alone. is it genetic? im longtime married to my total opposite and after 15yrs still feel like a wierdo, and make him miserable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg9tmjx", "score_hidden": false, "stickied": false, "created": 1492235966.0, "created_utc": 1492207166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]