[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It was on Monday. I was in the gym with a group of friends and girls watching us. I was having a good time with them. My confidence is great and I really don&amp;#39;t have social anxiety. I can say whatever I want. But there is a problem that just change my brain. I see a bike machine and I get on it. I was so happy and my energy is high that I go really really fast on the bike machine. I couldn&amp;#39;t control the bike speed so I hold down the red button. I rested for a little bit, breathing fast, catching my breath, then go fast again. After I finished the bike machine, I feel very tired. my legs want to fall asleep. But I also feel lightheaded and dizziness. When I try to talk to my friends and girls, I think deeply before I speak. I be thinking that &amp;quot;I will say something that is wrong and stupid and will make fun of me&amp;quot;. I don&amp;#39;t know how to defend myself when they talk trash about me. I also afraid to touch the girl as if she will totally get angry or reject me. It&amp;#39;s making my head sweat as nervousness; It&amp;#39;s like I don&amp;#39;t have self-confidence or confidence to myself. I still have this anxiety and Nervous today. I be damn scared to say something. Is there a way to cure this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It was on Monday. I was in the gym with a group of friends and girls watching us. I was having a good time with them. My confidence is great and I really don't have social anxiety. I can say whatever I want. But there is a problem that just change my brain. I see a bike machine and I get on it. I was so happy and my energy is high that I go really really fast on the bike machine. I couldn't control the bike speed so I hold down the red button. I rested for a little bit, breathing fast, catching my breath, then go fast again. After I finished the bike machine, I feel very tired. my legs want to fall asleep. But I also feel lightheaded and dizziness. When I try to talk to my friends and girls, I think deeply before I speak. I be thinking that \"I will say something that is wrong and stupid and will make fun of me\". I don't know how to defend myself when they talk trash about me. I also afraid to touch the girl as if she will totally get angry or reject me. It's making my head sweat as nervousness; It's like I don't have self-confidence or confidence to myself. I still have this anxiety and Nervous today. I be damn scared to say something. Is there a way to cure this.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65e5nt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "David77999", "saved": false, "mod_reports": [], "name": "t3_65e5nt", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65e5nt/anxiety_and_nervousness_increased_after_exercise/", "num_reports": null, "locked": false, "stickied": false, "created": 1492222148.0, "url": "https://www.reddit.com/r/socialskills/comments/65e5nt/anxiety_and_nervousness_increased_after_exercise/", "author_flair_text": null, "quarantine": false, "title": "Anxiety And Nervousness Increased After Exercise", "created_utc": 1492193348.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65e5nt", "likes": null, "replies": "", "user_reports": [], "id": "dg9jkxs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "biggmeech", "parent_id": "t3_65e5nt", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "the more I exercise the more I am prone to bad depression. It sucks because I've been overweight all my life and really need to exercise and I actually like it.  So i can stay fat but be happier, or be fit and mentally unstable. I notice this doesn't happen if I keep my workouts under 1 hour, and not daily. The more I push myself , the worse depression gets. Maybe same for you, don't push yourself to the point of exhaustion, maybe your symptoms will improve. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the more I exercise the more I am prone to bad depression. It sucks because I&amp;#39;ve been overweight all my life and really need to exercise and I actually like it.  So i can stay fat but be happier, or be fit and mentally unstable. I notice this doesn&amp;#39;t happen if I keep my workouts under 1 hour, and not daily. The more I push myself , the worse depression gets. Maybe same for you, don&amp;#39;t push yourself to the point of exhaustion, maybe your symptoms will improve. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg9jkxs", "score_hidden": false, "stickied": false, "created": 1492223659.0, "created_utc": 1492194859.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]