[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really know if this fits in here but I don&amp;#39;t know where else to post it, and I really need some help and need to get this off my chest.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so insecure I find it hard to interact with people. It happens with men and women, but it&amp;#39;s much worse when talking to women.&lt;/p&gt;\n\n&lt;p&gt;I have recently been having a go at online dating, and i&amp;#39;ve actually met a couple of girls who&amp;#39;ve shown some interest in me. However, I don&amp;#39;t know how I&amp;#39;d ever be able to take it further than an online conversation because I&amp;#39;m so damn insecure. I worry that i&amp;#39;m simply not good enough for them (looks and personality wise).&lt;/p&gt;\n\n&lt;p&gt;I exchanged numbers with one girl, but i&amp;#39;m already becoming jealous about the idea of her talking to other guys, and the fact that she probably doesn;t see me the same way i see her. &lt;/p&gt;\n\n&lt;p&gt;If i had a girlfriend, I would constantly be worried that other guys would see us and think they could &amp;#39;steal&amp;#39; her away from me. I would be in constant worry about when she&amp;#39;s with her friends or at work and other guys flirting with her.&lt;/p&gt;\n\n&lt;p&gt;I literally think 99% of other guys are more desirable than I am, and I realise how this mind set/lack of confidence makes me even less attractive...&lt;/p&gt;\n\n&lt;p&gt;What can i do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't really know if this fits in here but I don't know where else to post it, and I really need some help and need to get this off my chest.\n\nI'm so insecure I find it hard to interact with people. It happens with men and women, but it's much worse when talking to women.\n\nI have recently been having a go at online dating, and i've actually met a couple of girls who've shown some interest in me. However, I don't know how I'd ever be able to take it further than an online conversation because I'm so damn insecure. I worry that i'm simply not good enough for them (looks and personality wise).\n\nI exchanged numbers with one girl, but i'm already becoming jealous about the idea of her talking to other guys, and the fact that she probably doesn;t see me the same way i see her. \n\nIf i had a girlfriend, I would constantly be worried that other guys would see us and think they could 'steal' her away from me. I would be in constant worry about when she's with her friends or at work and other guys flirting with her.\n\nI literally think 99% of other guys are more desirable than I am, and I realise how this mind set/lack of confidence makes me even less attractive...\n\nWhat can i do?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ece8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "tru3teller", "saved": false, "mod_reports": [], "name": "t3_65ece8", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65ece8/i_am_so_incredibly_insecure/", "num_reports": null, "locked": false, "stickied": false, "created": 1492223948.0, "url": "https://www.reddit.com/r/socialskills/comments/65ece8/i_am_so_incredibly_insecure/", "author_flair_text": null, "quarantine": false, "title": "I am so incredibly insecure", "created_utc": 1492195148.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ece8", "likes": null, "replies": "", "user_reports": [], "id": "dg9t4oz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lithiumcow", "parent_id": "t3_65ece8", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I consider myself to be pretty well toned today, and I still meet astonishingly attractive girls who find me unattractive because they prefer someone who simply is the opposite. We like different things and we'll never be able to appear attractive to everyone. And this is a good thing.\n\nYou need to start your life long journey of loving yourself, by doing things for yourself independent of how others may react. You'll develop confidence in yourself and realise that even if the world around you crumbles, you still have yourself and that's really enough. What happens then is that you stop putting up with the bullshit of other people, create healthy boundaries both genders will respect. I suggest you head over to Mark Mansons blog and read the top articles:\nhttps://markmanson.net/best-articles\n\nI also recommend his most recent book; I think it's pretty much spot on what you need to hear right now. It's not a bandage fix. It takes time, and you have to dig deep into that emotional wound you've tried to cover up so far. It'll be painful, cries will happen, but you'll come out a better man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I consider myself to be pretty well toned today, and I still meet astonishingly attractive girls who find me unattractive because they prefer someone who simply is the opposite. We like different things and we&amp;#39;ll never be able to appear attractive to everyone. And this is a good thing.&lt;/p&gt;\n\n&lt;p&gt;You need to start your life long journey of loving yourself, by doing things for yourself independent of how others may react. You&amp;#39;ll develop confidence in yourself and realise that even if the world around you crumbles, you still have yourself and that&amp;#39;s really enough. What happens then is that you stop putting up with the bullshit of other people, create healthy boundaries both genders will respect. I suggest you head over to Mark Mansons blog and read the top articles:\n&lt;a href=\"https://markmanson.net/best-articles\"&gt;https://markmanson.net/best-articles&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I also recommend his most recent book; I think it&amp;#39;s pretty much spot on what you need to hear right now. It&amp;#39;s not a bandage fix. It takes time, and you have to dig deep into that emotional wound you&amp;#39;ve tried to cover up so far. It&amp;#39;ll be painful, cries will happen, but you&amp;#39;ll come out a better man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg9t4oz", "score_hidden": false, "stickied": false, "created": 1492235325.0, "created_utc": 1492206525.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ece8", "likes": null, "replies": "", "user_reports": [], "id": "dga789b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "smplgmr", "parent_id": "t3_65ece8", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "&gt; I exchanged numbers with one girl, but i'm already becoming jealous about the idea of her talking to other guys\n\nThat, my friend, is causing serious problems for you. Insecurity is one thing, but jealousy, is a beast that will rip you apart from the inside out. I'm not judging you, where you are now, I once was and it took some time for me to be comfortable with who I am.\n\nYou asked \"what can I do\" so I'm going to tell you.\n\n1. Understand that EVERYONE has insecurities. The good news is this... no one knows but you. You are the only person that knows about your insecurities and you don't have to tell anyone, including girls that you want to talk to. Everyone you speak with, has insecurities, but you will rarely see them because they talk about the things in their life that they want you to see, not the things they don't want you to see. They have to deal with their own insecurities just like anyone else. The key is not to dwell on them.\n\n2. Realize that you are not competing with ANYONE, including other men talking to girls that you like. There is only one person you should compete with, yourself. This means working hard to improve yourself. This is investing in yourself and is the single greatest investment you can make. And there is good news here too, because you are already doing this, at least to some degree. If you had no interest in improving yourself, you would not be here looking for advice. You are on the right path.\n\n3. You can kill your dark passenger (insecurity) through positive activity, like working to improve yourself. I'll address this further down.\n\nLet me tell you something about jealousy. Jealousy is present with people that have few choices. What does this mean? It means that if you only have one cupcake, you will guard it with your might, because you only have one. If someone looks at your cupcake, you freak out because it's the only one you have and you plan to eat it later. On the other hand, if you have a box full of cupcakes, all is well, you have an abundance and no need to fear losing one, in fact you will willing SHARE them. The same is true for girls. If you only have one girl that you are interested in, and there are ZERO additional prospects on the table, then you will start to obsess over her and then jealousy takes over. You know what comes next of course, she bails because you are being too clingy. Jealousy is a self defeating proposition, it's the parasite that takes and gives you nothing in return, then leaves you rotting inside.\n\nTo cure this you need to build self confidence. Your end goal is to have lots of prospects, lots of numbers to girls that you like. Here are two very simple things that you can do to boost confidence. But I don't want you to think that this is ALL you have to do, this is only the beginning.\n\n4. For the next 7 days, make eye contact with EVERYONE, men and women, and even pets. You're not trying to meet girls here, and you're not trying to get friends, you're just doing a little exercise for the next week... When you are in public, and you see people, make it a point to look them in the eyes. When they look back, acknowledge them in someway. It can be a head nod and slight smile, or you could just say \"Hi\". Don't try to say to \"hi\" to everyone, esp if you are with a crowd. But do make eye contact. Throughout the week, escalate the encounters. For example, on day one, you look, and give a head nod... on  day two, you look, smile, and say \"hi\"... by day 7 you look, smile, approach, and then compliment someone. Decide in advance how you want to escalate throughout the weeks. Don't make any goals for making friends or getting numbers, just be nice and interact with people, but mostly with eye contact.\n\n5. Listen to \"pump\" music every morning. Make it part of your morning routine. Pump music is music that gets you pumped up, makes you want to move. Pump music is POSITIVE music. Not depressing stuff, not sad stuff, not \"I feel so defeated\" stuff. You might think that music wont help. It will, some of the BEST athletes in the world have their own pump play list that they listen to before a game. Do not underestimate the power of a good positive song to influence you. Just hop on youtube and search for \"pump playlist\", there are thousands to choose from. By the end of the week your goal is to build your own personal pump playlist that is perfect for you. Here is one that I like and is tailored for men: https://www.youtube.com/playlist?list=PLIVcbW7DpjwmaGCSnIbtRzR5D-khOlrKi\n\nThere is more, MUCH more. But start there. And notice that the focus isn't on being insecure? The focus is on BUILDING, building confidence. I can't tell you how this will end for you, but I can tell you that if you start there, above with those two simple things, then it will begin very well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I exchanged numbers with one girl, but i&amp;#39;m already becoming jealous about the idea of her talking to other guys&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That, my friend, is causing serious problems for you. Insecurity is one thing, but jealousy, is a beast that will rip you apart from the inside out. I&amp;#39;m not judging you, where you are now, I once was and it took some time for me to be comfortable with who I am.&lt;/p&gt;\n\n&lt;p&gt;You asked &amp;quot;what can I do&amp;quot; so I&amp;#39;m going to tell you.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Understand that EVERYONE has insecurities. The good news is this... no one knows but you. You are the only person that knows about your insecurities and you don&amp;#39;t have to tell anyone, including girls that you want to talk to. Everyone you speak with, has insecurities, but you will rarely see them because they talk about the things in their life that they want you to see, not the things they don&amp;#39;t want you to see. They have to deal with their own insecurities just like anyone else. The key is not to dwell on them.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Realize that you are not competing with ANYONE, including other men talking to girls that you like. There is only one person you should compete with, yourself. This means working hard to improve yourself. This is investing in yourself and is the single greatest investment you can make. And there is good news here too, because you are already doing this, at least to some degree. If you had no interest in improving yourself, you would not be here looking for advice. You are on the right path.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You can kill your dark passenger (insecurity) through positive activity, like working to improve yourself. I&amp;#39;ll address this further down.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Let me tell you something about jealousy. Jealousy is present with people that have few choices. What does this mean? It means that if you only have one cupcake, you will guard it with your might, because you only have one. If someone looks at your cupcake, you freak out because it&amp;#39;s the only one you have and you plan to eat it later. On the other hand, if you have a box full of cupcakes, all is well, you have an abundance and no need to fear losing one, in fact you will willing SHARE them. The same is true for girls. If you only have one girl that you are interested in, and there are ZERO additional prospects on the table, then you will start to obsess over her and then jealousy takes over. You know what comes next of course, she bails because you are being too clingy. Jealousy is a self defeating proposition, it&amp;#39;s the parasite that takes and gives you nothing in return, then leaves you rotting inside.&lt;/p&gt;\n\n&lt;p&gt;To cure this you need to build self confidence. Your end goal is to have lots of prospects, lots of numbers to girls that you like. Here are two very simple things that you can do to boost confidence. But I don&amp;#39;t want you to think that this is ALL you have to do, this is only the beginning.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;For the next 7 days, make eye contact with EVERYONE, men and women, and even pets. You&amp;#39;re not trying to meet girls here, and you&amp;#39;re not trying to get friends, you&amp;#39;re just doing a little exercise for the next week... When you are in public, and you see people, make it a point to look them in the eyes. When they look back, acknowledge them in someway. It can be a head nod and slight smile, or you could just say &amp;quot;Hi&amp;quot;. Don&amp;#39;t try to say to &amp;quot;hi&amp;quot; to everyone, esp if you are with a crowd. But do make eye contact. Throughout the week, escalate the encounters. For example, on day one, you look, and give a head nod... on  day two, you look, smile, and say &amp;quot;hi&amp;quot;... by day 7 you look, smile, approach, and then compliment someone. Decide in advance how you want to escalate throughout the weeks. Don&amp;#39;t make any goals for making friends or getting numbers, just be nice and interact with people, but mostly with eye contact.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Listen to &amp;quot;pump&amp;quot; music every morning. Make it part of your morning routine. Pump music is music that gets you pumped up, makes you want to move. Pump music is POSITIVE music. Not depressing stuff, not sad stuff, not &amp;quot;I feel so defeated&amp;quot; stuff. You might think that music wont help. It will, some of the BEST athletes in the world have their own pump play list that they listen to before a game. Do not underestimate the power of a good positive song to influence you. Just hop on youtube and search for &amp;quot;pump playlist&amp;quot;, there are thousands to choose from. By the end of the week your goal is to build your own personal pump playlist that is perfect for you. Here is one that I like and is tailored for men: &lt;a href=\"https://www.youtube.com/playlist?list=PLIVcbW7DpjwmaGCSnIbtRzR5D-khOlrKi\"&gt;https://www.youtube.com/playlist?list=PLIVcbW7DpjwmaGCSnIbtRzR5D-khOlrKi&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;There is more, MUCH more. But start there. And notice that the focus isn&amp;#39;t on being insecure? The focus is on BUILDING, building confidence. I can&amp;#39;t tell you how this will end for you, but I can tell you that if you start there, above with those two simple things, then it will begin very well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dga789b", "score_hidden": false, "stickied": false, "created": 1492254548.0, "created_utc": 1492225748.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ece8", "likes": null, "replies": "", "user_reports": [], "id": "dga7uf4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chaldeanrefuge", "parent_id": "t3_65ece8", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Here is what I want you to do:\n\n1) List all of the successes you can think of that you've had in life. This is to show yourself that you have far greater value then you realize.\n\n2) I want you to keep a journal of all the successes you have every day; no matter how big or small. Fill this journal out every night. You will see that you have more successes then you think and your confidence will grow.\n\n3) I want you to write out; \"What is it costing me to be so insecure?\" And for 3-5 minutes write out all of the pain you are feeling from insecurity. Then write out; \"What is the pleasure I'll experience from being confident?\" Then write out all the pleasure you'll feel from being confident. This will link massive amounts of pain to your old behavior and massive amounts of pleasure to your new behavior so your subconscious will choose being confident over being insecure.\n\n4) Challenge yourself to try new things.\n\n5) Affirm to yourself daily that you're good enough, you're worthy, you are awesome. Put yourself into a positive state every day. Recondition yourself to feel good about being you.\n\n6) Meditate and let your mind relax.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here is what I want you to do:&lt;/p&gt;\n\n&lt;p&gt;1) List all of the successes you can think of that you&amp;#39;ve had in life. This is to show yourself that you have far greater value then you realize.&lt;/p&gt;\n\n&lt;p&gt;2) I want you to keep a journal of all the successes you have every day; no matter how big or small. Fill this journal out every night. You will see that you have more successes then you think and your confidence will grow.&lt;/p&gt;\n\n&lt;p&gt;3) I want you to write out; &amp;quot;What is it costing me to be so insecure?&amp;quot; And for 3-5 minutes write out all of the pain you are feeling from insecurity. Then write out; &amp;quot;What is the pleasure I&amp;#39;ll experience from being confident?&amp;quot; Then write out all the pleasure you&amp;#39;ll feel from being confident. This will link massive amounts of pain to your old behavior and massive amounts of pleasure to your new behavior so your subconscious will choose being confident over being insecure.&lt;/p&gt;\n\n&lt;p&gt;4) Challenge yourself to try new things.&lt;/p&gt;\n\n&lt;p&gt;5) Affirm to yourself daily that you&amp;#39;re good enough, you&amp;#39;re worthy, you are awesome. Put yourself into a positive state every day. Recondition yourself to feel good about being you.&lt;/p&gt;\n\n&lt;p&gt;6) Meditate and let your mind relax.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dga7uf4", "score_hidden": false, "stickied": false, "created": 1492255511.0, "created_utc": 1492226711.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ece8", "likes": null, "replies": "", "user_reports": [], "id": "dgaxixq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bluesilver1234", "parent_id": "t3_65ece8", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Well what are you insecure about ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well what are you insecure about &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgaxixq", "score_hidden": false, "stickied": false, "created": 1492307211.0, "created_utc": 1492278411.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]