[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really bland. Whenver people talk to me, the conversation can never last for more than 30 seconds. Its just me saying hi and the other person saying hi back. I just don&amp;#39;t know what to talk about. I don&amp;#39;t watch sports. I don&amp;#39;t listen to popular music or keep with popculture. Since my social life is a blackhole, I don&amp;#39;t have an interesting experiences to share. All I do in my time is play videogames (not the popular kind) and watch anime (again, not the popular kind). Most people who enjoy the same stuff I do, are typically really socially deprived too and I never see them, because they stay at home most of the time. Im nearing the end of my sophomore year of college, and I never had a close group of friends or a girlfriend. I am really depressed, because after college, the social scene is only going to get exponentially harder. It&amp;#39;s my fault for wasting the majority of my 20 years as a hermit.  Its so hard for me to talk to people and I really want to fix it, because I am miserable. I am partly suicidal, but I love my family too much to do it, so my next best option is to fix myself. I don&amp;#39;t really know how to start. Can anyone here give me specific advice on what to do. I&amp;#39;m planning to watch sports, start listening to rap, watch popular tv shows and movies, and work out (im obese) over the summer to enrichen my self a bit. But I&amp;#39;m still scared that I won&amp;#39;t be able to convey myself properly to others. My brainpower goes down by 90% in social situations. My voice gets high while at low volume at the same time, I stutter immensely, I skips words whenever I say sentences, and my brain just freezes sometimes and I just nod and smile creepily. So yeah, any advice? I would really appreciate it and take it to heart. Sorry for the grammar, spelling, and negative attitude in this long rant. But thanks for reading!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm really bland. Whenver people talk to me, the conversation can never last for more than 30 seconds. Its just me saying hi and the other person saying hi back. I just don't know what to talk about. I don't watch sports. I don't listen to popular music or keep with popculture. Since my social life is a blackhole, I don't have an interesting experiences to share. All I do in my time is play videogames (not the popular kind) and watch anime (again, not the popular kind). Most people who enjoy the same stuff I do, are typically really socially deprived too and I never see them, because they stay at home most of the time. Im nearing the end of my sophomore year of college, and I never had a close group of friends or a girlfriend. I am really depressed, because after college, the social scene is only going to get exponentially harder. It's my fault for wasting the majority of my 20 years as a hermit.  Its so hard for me to talk to people and I really want to fix it, because I am miserable. I am partly suicidal, but I love my family too much to do it, so my next best option is to fix myself. I don't really know how to start. Can anyone here give me specific advice on what to do. I'm planning to watch sports, start listening to rap, watch popular tv shows and movies, and work out (im obese) over the summer to enrichen my self a bit. But I'm still scared that I won't be able to convey myself properly to others. My brainpower goes down by 90% in social situations. My voice gets high while at low volume at the same time, I stutter immensely, I skips words whenever I say sentences, and my brain just freezes sometimes and I just nod and smile creepily. So yeah, any advice? I would really appreciate it and take it to heart. Sorry for the grammar, spelling, and negative attitude in this long rant. But thanks for reading!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65f5gd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "I_gotta_fix_my_life", "saved": false, "mod_reports": [], "name": "t3_65f5gd", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65f5gd/any_specific_advice_to_a_20_year_old_hermit_who/", "num_reports": null, "locked": false, "stickied": false, "created": 1492232000.0, "url": "https://www.reddit.com/r/socialskills/comments/65f5gd/any_specific_advice_to_a_20_year_old_hermit_who/", "author_flair_text": null, "quarantine": false, "title": "Any specific advice to a 20 year old hermit who wants to fix him self?", "created_utc": 1492203200.0, "distinguished": null, "media": null, "upvote_ratio": 0.76, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65f5gd", "likes": null, "replies": "", "user_reports": [], "id": "dg9tb93", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "random_numbers285", "parent_id": "t3_65f5gd", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "practice. If you want to learn how to engage in social chatting, find a couple of things early every day that seem of general interest and read a couple of minutes about each one so you can have something to talk about given the opportunity. What happened in town the night before (local news) or interesting science/world/political news. Don't go indepth, you just want enough to last 30 seconds or ask someone's opinion.\n\nThen go practice. Buy a coffee and say something to the clerk beyond just your order. Say something to another student, someone you're working out next to, etc. Much like playing a video game, each interaction, successful or not gets you experience points. Learn from what you failed at, build off what was successful. Keep a log if it helps, but if you don't try, you won't change.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;practice. If you want to learn how to engage in social chatting, find a couple of things early every day that seem of general interest and read a couple of minutes about each one so you can have something to talk about given the opportunity. What happened in town the night before (local news) or interesting science/world/political news. Don&amp;#39;t go indepth, you just want enough to last 30 seconds or ask someone&amp;#39;s opinion.&lt;/p&gt;\n\n&lt;p&gt;Then go practice. Buy a coffee and say something to the clerk beyond just your order. Say something to another student, someone you&amp;#39;re working out next to, etc. Much like playing a video game, each interaction, successful or not gets you experience points. Learn from what you failed at, build off what was successful. Keep a log if it helps, but if you don&amp;#39;t try, you won&amp;#39;t change.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg9tb93", "score_hidden": false, "stickied": false, "created": 1492235560.0, "created_utc": 1492206760.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65f5gd", "likes": null, "replies": "", "user_reports": [], "id": "dg9xk07", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ricktaitorship", "parent_id": "t3_65f5gd", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Develope a routine that gives you opportunities to be social. As a general rule start small take in your environment, look around make eye contact with people and nod in acknowledgement, say hi. Give strangers random compliments or briefly comment on the weather. Keep in mind some people will be closed off but don't let it discourage you, familiarity will come with time. Ditch the ear buds if that's your thing because it will make you seem unapproachable. Stay off your phone carry a book or magazine with you if you plan to sit for a while. \n\nMake a point to always subtly acknowledge people that you recognize and look for the right opportunity to introduce yourself. \"Hey I see you here a lot, I'm..\"\n\nIf you go to the same place ie library, gas station, coffee shop, bar, plaza.. once (or more) a week at the same time you're bound to run into people that are on the same schedule as you or at a minimum you'll be recognized as a regular and gain repoire with the staff. Walk there or take metro transit if you can (more opportunity to have casual encounters with people). Practice your small talk on service staff, weather, weekends, Mondays. \n\nFind a local band or DJ  that's easy to follow. Go to a show. Talk to a couple people (smokers are often chatty if you can tolerate the second hand) if you have fun make a point to go to the next show you might see some familiar faces.\n\nGo to a EDM show at a medium sized venue with general admission. Lose yourself in the music and get your rave on. Have fun!! Dance your ass off, the weirder you dance the cooler you become. Keys N Krates are a personal fav. Skip the undue stress of driving for maximum excellence.\n\nDo some yoga or group fitness classes. No excuses just do it. Yoga is great because you can do it at your own speed and there are so many benefits. I love vinyasa yoga.\n\nTake advantage of college organized events and meetups.\n\nDon't get discouraged when somethings a bust some outings will result in new contacts and some will be boring. Just stay positive and keep putting yourself out there.\n\nI hope this helps! Good Luck.\n\n\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Develope a routine that gives you opportunities to be social. As a general rule start small take in your environment, look around make eye contact with people and nod in acknowledgement, say hi. Give strangers random compliments or briefly comment on the weather. Keep in mind some people will be closed off but don&amp;#39;t let it discourage you, familiarity will come with time. Ditch the ear buds if that&amp;#39;s your thing because it will make you seem unapproachable. Stay off your phone carry a book or magazine with you if you plan to sit for a while. &lt;/p&gt;\n\n&lt;p&gt;Make a point to always subtly acknowledge people that you recognize and look for the right opportunity to introduce yourself. &amp;quot;Hey I see you here a lot, I&amp;#39;m..&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If you go to the same place ie library, gas station, coffee shop, bar, plaza.. once (or more) a week at the same time you&amp;#39;re bound to run into people that are on the same schedule as you or at a minimum you&amp;#39;ll be recognized as a regular and gain repoire with the staff. Walk there or take metro transit if you can (more opportunity to have casual encounters with people). Practice your small talk on service staff, weather, weekends, Mondays. &lt;/p&gt;\n\n&lt;p&gt;Find a local band or DJ  that&amp;#39;s easy to follow. Go to a show. Talk to a couple people (smokers are often chatty if you can tolerate the second hand) if you have fun make a point to go to the next show you might see some familiar faces.&lt;/p&gt;\n\n&lt;p&gt;Go to a EDM show at a medium sized venue with general admission. Lose yourself in the music and get your rave on. Have fun!! Dance your ass off, the weirder you dance the cooler you become. Keys N Krates are a personal fav. Skip the undue stress of driving for maximum excellence.&lt;/p&gt;\n\n&lt;p&gt;Do some yoga or group fitness classes. No excuses just do it. Yoga is great because you can do it at your own speed and there are so many benefits. I love vinyasa yoga.&lt;/p&gt;\n\n&lt;p&gt;Take advantage of college organized events and meetups.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t get discouraged when somethings a bust some outings will result in new contacts and some will be boring. Just stay positive and keep putting yourself out there.&lt;/p&gt;\n\n&lt;p&gt;I hope this helps! Good Luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dg9xk07", "score_hidden": false, "stickied": false, "created": 1492241207.0, "created_utc": 1492212407.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65f5gd", "likes": null, "replies": "", "user_reports": [], "id": "dga7wka", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OzProud92", "parent_id": "t3_65f5gd", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I would join some sort of social club or sports team where you are routinely forced to meet with a group of people on a weekly basis. This is an easy and indirect way to meet people and interact with others. \n:)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would join some sort of social club or sports team where you are routinely forced to meet with a group of people on a weekly basis. This is an easy and indirect way to meet people and interact with others. \n:)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dga7wka", "score_hidden": false, "stickied": false, "created": 1492255606.0, "created_utc": 1492226806.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65f5gd", "likes": null, "replies": "", "user_reports": [], "id": "dga9aun", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chaldeanrefuge", "parent_id": "t3_65f5gd", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "First, you're not really bland. You just haven't developed your social skills enough yet to work with the information people are giving you. Also, you have things that people might find interesting however you might be talking about those things to the wrong people. For instance, I love anime but I only talk about it with my friends who are into that.\n\nHere are some things that could help you and have helped me:\n\n1) Improv comedy classes - Half of my class was there because they had anxiety and wanted to get over it while making new friends.\n\n2) Public speaking classes - This will polish your speaking skills and give you greater confidence.\n\n3) Muay Thai or boxing - You literally have to interact with several people every day and most everyone is friendly. You'll also get into shape.\n\n4) Practicing improv. This is different from the comedy classes. \nAs I would drive around I would pick a random subject and talk about it animatedly for a minute (I could stay on the subject or branch off onto other subjects). After a short time of practicing this, someone could say virtually any topic and I could talk about it.\n\n5) Get around people with similar interests.  If you're not into anything, choose something new and get started.\n\n6) Get on a program of self-development. You can go to Barnes and Nobles today and find a ton of books on social skills, pick up and dating, self-improvement and much more.\n\nLastly, you're REALLY young. You're only 20. By the time you're 21 your whole life can have changed. Some of the guys I know who were really successful with women didn't bloom until later in life. It's not where you start, it's where you finish.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First, you&amp;#39;re not really bland. You just haven&amp;#39;t developed your social skills enough yet to work with the information people are giving you. Also, you have things that people might find interesting however you might be talking about those things to the wrong people. For instance, I love anime but I only talk about it with my friends who are into that.&lt;/p&gt;\n\n&lt;p&gt;Here are some things that could help you and have helped me:&lt;/p&gt;\n\n&lt;p&gt;1) Improv comedy classes - Half of my class was there because they had anxiety and wanted to get over it while making new friends.&lt;/p&gt;\n\n&lt;p&gt;2) Public speaking classes - This will polish your speaking skills and give you greater confidence.&lt;/p&gt;\n\n&lt;p&gt;3) Muay Thai or boxing - You literally have to interact with several people every day and most everyone is friendly. You&amp;#39;ll also get into shape.&lt;/p&gt;\n\n&lt;p&gt;4) Practicing improv. This is different from the comedy classes. \nAs I would drive around I would pick a random subject and talk about it animatedly for a minute (I could stay on the subject or branch off onto other subjects). After a short time of practicing this, someone could say virtually any topic and I could talk about it.&lt;/p&gt;\n\n&lt;p&gt;5) Get around people with similar interests.  If you&amp;#39;re not into anything, choose something new and get started.&lt;/p&gt;\n\n&lt;p&gt;6) Get on a program of self-development. You can go to Barnes and Nobles today and find a ton of books on social skills, pick up and dating, self-improvement and much more.&lt;/p&gt;\n\n&lt;p&gt;Lastly, you&amp;#39;re REALLY young. You&amp;#39;re only 20. By the time you&amp;#39;re 21 your whole life can have changed. Some of the guys I know who were really successful with women didn&amp;#39;t bloom until later in life. It&amp;#39;s not where you start, it&amp;#39;s where you finish.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dga9aun", "score_hidden": false, "stickied": false, "created": 1492257862.0, "created_utc": 1492229062.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]