[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Im a junior in high school, but I always feel awkward when I try to start conversations. I never know what to really talk about, but sometimes when I do it just seems weird since the topic is out of nowhere. What are some good things to talk about and good ways to respond in conversations to make me a person people will like to be around more.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Im a junior in high school, but I always feel awkward when I try to start conversations. I never know what to really talk about, but sometimes when I do it just seems weird since the topic is out of nowhere. What are some good things to talk about and good ways to respond in conversations to make me a person people will like to be around more.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65hb2b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "LaserTurret617", "saved": false, "mod_reports": [], "name": "t3_65hb2b", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65hb2b/conversations/", "num_reports": null, "locked": false, "stickied": false, "created": 1492258959.0, "url": "https://www.reddit.com/r/socialskills/comments/65hb2b/conversations/", "author_flair_text": null, "quarantine": false, "title": "Conversations", "created_utc": 1492230159.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65hb2b", "likes": null, "replies": "", "user_reports": [], "id": "dgah6ne", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RandomGoatLover", "parent_id": "t3_65hb2b", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "If you have trouble starting a conversation why don't you try to join one ? \n\nIt may be easier (and maybe awkward at first) but in the end you will not have to worry about finding something. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you have trouble starting a conversation why don&amp;#39;t you try to join one ? &lt;/p&gt;\n\n&lt;p&gt;It may be easier (and maybe awkward at first) but in the end you will not have to worry about finding something. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgah6ne", "score_hidden": false, "stickied": false, "created": 1492275917.0, "created_utc": 1492247117.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65hb2b", "likes": null, "replies": "", "user_reports": [], "id": "dgdikat", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "doublyfrank", "parent_id": "t3_65hb2b", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I actually wrote an article specifically on this topic. I'll post it right here for you. ***Please let me know if you have any more questions- I always reply to people genuinely looking for help!***\n\n&gt;When does conversation begin? Its introduction? Several minutes later… you know, while debating something \"relevant\" like whether humans really landed on the moon? \n\n&gt;Actually, it starts before your mouth even opens- with small talk. \n\n&gt;Small talk is often downplayed as being superfluous. The thing is- it serves a vital purpose. Through it the groundwork is laid for the entirety of the conversation. You discover a person's interests, begin to understand their personality and connect with them. But it goes further. \n\n&gt;Consciously or subconsciously, we all make judgements of people’s character within seconds of meeting them.\n\n&gt;How healthy do they look?\nDo they maintain proper hygiene?\nWhat are they wearing?\n\n&gt;The conclusions we reach are called first impressions and it’s important they’re positive. Instead of being overwhelmed with all the details, though, focus on the few elements that have the biggest effect. \n\n&gt;Being one of the first things that people notice, posture is a good place to start. Everything comes together here: your clothing, grooming- all of it. If you put forth consistent effort, good posture will soon become natural and will contribute to your perceived confidence.\n\n&gt;How do you want to come across?\n\n&gt;The details differ depending on the situation, but the core mind-set remains the same: a balanced -not cocky- display of self-confidence along with a positive attitude. And keep in mind you'll need to adjust the proportions of those qualities for different occasions. Business settings generally demand a more serious tone. At parties liveliness is the norm.  The atmosphere of a charity gala is a bit of a balance between those two situations. \n\n&gt;Of course, understanding how to adapt doesn’t happen overnight. This will take practice- but it steadily becomes easier.\n\n&gt;Alright, so posture and mannerisms are what people first notice. Along those lines, the next step is to establish and maintain sincere eye contact. Sincerity is what you’re looking for here- so be sure that it is deep, but not too deep. Otherwise, you can make people feel uncomfortable. If this balance seems difficult to understand, you can get a detailed explanation by reading through our free ebook (Making Eye Contact- Without Feeling Weird) here.\n\n&gt;Shortly after establishing eye contact, follow with an introductory gesture. In western countries, it’s generally the handshake. In eastern countries, the bow is most prominent. This should be performed with the same attitude and manner conveyed during your initial approach. Ie: if you’re at a party, the handshake should be just as relaxed as your posture. It’s all connected.\n\n&gt;But why is all this minutiae important?\n\n&gt;For one, a positive first impression buys you time and goodwill if you slip up in your conversation. Even more importantly, it sets the right tone for what follows.\n\n&gt;There is no standardized \"one-size-fits-all\" script for breaking the ice, but there is a pseudo-framework that you can build conversations around. \n\n&gt;The salutation is logically at the foundation of this framework. “Hello” is sufficient, but you should tailor your greeting to the setting if possible. It’s as simple as replacing “hello” with “good morning” when the day has just begun or “good evening” later on.\n\n&gt;After the customary greeting, ask their name. Once you do, focus on listening. \n\n&gt;If their name is foreign to you, ask them to spell it out (rather than repeat it) and it will make a stronger mental connection. With good reason, Dale Carnegie said that \"a person’s name is to that person the sweetest and most important sound in any language.” By remembering that name, you show true interest and respect- and this will yield massive returns later in your conversation. After they’ve given their name, reciprocate.\n\n&gt;But after you’ve introducing yourself, what do you talk about?\n\n&gt;It is at this point that most feel they have the hardest time. With a lack of subject matter, awkward pauses can put more holes in your conversation than swiss cheese (and I’d much rather treat myself to a gruyere). How do you avoid this?\n\n&gt;For the most natural flow, you’ll need to formulate several questions ahead of time. The best occasion at which to do this would be as you’re approaching them -before any words are exchanged- and while you are exchanging greetings. Doing so at other points will distract you and give the impression that you're disinterested. \n\n&gt;Keep in mind that you’re listening, not to look for opportunities to respond, but so you can learn more about the other person. Listen to what they say and observe what you can of the setting and their expressions. Nonverbal communication will teach you much about a person and their values.\n\n&gt;All that said, let's put what we’ve just learned into practice.\n\n&gt;Don’t overthink things.\n\n&gt;Transition straight from salutations to gradually drawing the other person out with the aforementioned questions. During this exchange, try to discern when either of you are running out of things to say or the other person is losing interest. \n\n&gt;Just before the line of dialogue is about to become stale, swing to a different (yet related) subject. Just as you were earlier prospecting for questions to open them up, now you are prospecting for deeper shared interests, experiences or opinions. The conversation becomes more relaxed as you build a rapport and can soon progress into deeper subjects.\n\n&gt;Notice the progression?\n\n&gt;It could be compared to driving a car. First you have to warm the engine by presenting yourself in a way so that others are comfortable with you. After the engine is warmed, you drive the car through some side-roads, asking probing questions so you can understand subjects that are of interest to your newfound acquaintance. One you've discerned those, you can merge onto the thoroughfare and get into some meaningful conversation. \n\n&gt;Following the above advice will calibrate your GPS so you can get to the highway by the fastest and simplest route- no u-turns required!\n\nI look forward to hearing from you :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually wrote an article specifically on this topic. I&amp;#39;ll post it right here for you. &lt;strong&gt;&lt;em&gt;Please let me know if you have any more questions- I always reply to people genuinely looking for help!&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When does conversation begin? Its introduction? Several minutes later… you know, while debating something &amp;quot;relevant&amp;quot; like whether humans really landed on the moon? &lt;/p&gt;\n\n&lt;p&gt;Actually, it starts before your mouth even opens- with small talk. &lt;/p&gt;\n\n&lt;p&gt;Small talk is often downplayed as being superfluous. The thing is- it serves a vital purpose. Through it the groundwork is laid for the entirety of the conversation. You discover a person&amp;#39;s interests, begin to understand their personality and connect with them. But it goes further. &lt;/p&gt;\n\n&lt;p&gt;Consciously or subconsciously, we all make judgements of people’s character within seconds of meeting them.&lt;/p&gt;\n\n&lt;p&gt;How healthy do they look?\nDo they maintain proper hygiene?\nWhat are they wearing?&lt;/p&gt;\n\n&lt;p&gt;The conclusions we reach are called first impressions and it’s important they’re positive. Instead of being overwhelmed with all the details, though, focus on the few elements that have the biggest effect. &lt;/p&gt;\n\n&lt;p&gt;Being one of the first things that people notice, posture is a good place to start. Everything comes together here: your clothing, grooming- all of it. If you put forth consistent effort, good posture will soon become natural and will contribute to your perceived confidence.&lt;/p&gt;\n\n&lt;p&gt;How do you want to come across?&lt;/p&gt;\n\n&lt;p&gt;The details differ depending on the situation, but the core mind-set remains the same: a balanced -not cocky- display of self-confidence along with a positive attitude. And keep in mind you&amp;#39;ll need to adjust the proportions of those qualities for different occasions. Business settings generally demand a more serious tone. At parties liveliness is the norm.  The atmosphere of a charity gala is a bit of a balance between those two situations. &lt;/p&gt;\n\n&lt;p&gt;Of course, understanding how to adapt doesn’t happen overnight. This will take practice- but it steadily becomes easier.&lt;/p&gt;\n\n&lt;p&gt;Alright, so posture and mannerisms are what people first notice. Along those lines, the next step is to establish and maintain sincere eye contact. Sincerity is what you’re looking for here- so be sure that it is deep, but not too deep. Otherwise, you can make people feel uncomfortable. If this balance seems difficult to understand, you can get a detailed explanation by reading through our free ebook (Making Eye Contact- Without Feeling Weird) here.&lt;/p&gt;\n\n&lt;p&gt;Shortly after establishing eye contact, follow with an introductory gesture. In western countries, it’s generally the handshake. In eastern countries, the bow is most prominent. This should be performed with the same attitude and manner conveyed during your initial approach. Ie: if you’re at a party, the handshake should be just as relaxed as your posture. It’s all connected.&lt;/p&gt;\n\n&lt;p&gt;But why is all this minutiae important?&lt;/p&gt;\n\n&lt;p&gt;For one, a positive first impression buys you time and goodwill if you slip up in your conversation. Even more importantly, it sets the right tone for what follows.&lt;/p&gt;\n\n&lt;p&gt;There is no standardized &amp;quot;one-size-fits-all&amp;quot; script for breaking the ice, but there is a pseudo-framework that you can build conversations around. &lt;/p&gt;\n\n&lt;p&gt;The salutation is logically at the foundation of this framework. “Hello” is sufficient, but you should tailor your greeting to the setting if possible. It’s as simple as replacing “hello” with “good morning” when the day has just begun or “good evening” later on.&lt;/p&gt;\n\n&lt;p&gt;After the customary greeting, ask their name. Once you do, focus on listening. &lt;/p&gt;\n\n&lt;p&gt;If their name is foreign to you, ask them to spell it out (rather than repeat it) and it will make a stronger mental connection. With good reason, Dale Carnegie said that &amp;quot;a person’s name is to that person the sweetest and most important sound in any language.” By remembering that name, you show true interest and respect- and this will yield massive returns later in your conversation. After they’ve given their name, reciprocate.&lt;/p&gt;\n\n&lt;p&gt;But after you’ve introducing yourself, what do you talk about?&lt;/p&gt;\n\n&lt;p&gt;It is at this point that most feel they have the hardest time. With a lack of subject matter, awkward pauses can put more holes in your conversation than swiss cheese (and I’d much rather treat myself to a gruyere). How do you avoid this?&lt;/p&gt;\n\n&lt;p&gt;For the most natural flow, you’ll need to formulate several questions ahead of time. The best occasion at which to do this would be as you’re approaching them -before any words are exchanged- and while you are exchanging greetings. Doing so at other points will distract you and give the impression that you&amp;#39;re disinterested. &lt;/p&gt;\n\n&lt;p&gt;Keep in mind that you’re listening, not to look for opportunities to respond, but so you can learn more about the other person. Listen to what they say and observe what you can of the setting and their expressions. Nonverbal communication will teach you much about a person and their values.&lt;/p&gt;\n\n&lt;p&gt;All that said, let&amp;#39;s put what we’ve just learned into practice.&lt;/p&gt;\n\n&lt;p&gt;Don’t overthink things.&lt;/p&gt;\n\n&lt;p&gt;Transition straight from salutations to gradually drawing the other person out with the aforementioned questions. During this exchange, try to discern when either of you are running out of things to say or the other person is losing interest. &lt;/p&gt;\n\n&lt;p&gt;Just before the line of dialogue is about to become stale, swing to a different (yet related) subject. Just as you were earlier prospecting for questions to open them up, now you are prospecting for deeper shared interests, experiences or opinions. The conversation becomes more relaxed as you build a rapport and can soon progress into deeper subjects.&lt;/p&gt;\n\n&lt;p&gt;Notice the progression?&lt;/p&gt;\n\n&lt;p&gt;It could be compared to driving a car. First you have to warm the engine by presenting yourself in a way so that others are comfortable with you. After the engine is warmed, you drive the car through some side-roads, asking probing questions so you can understand subjects that are of interest to your newfound acquaintance. One you&amp;#39;ve discerned those, you can merge onto the thoroughfare and get into some meaningful conversation. &lt;/p&gt;\n\n&lt;p&gt;Following the above advice will calibrate your GPS so you can get to the highway by the fastest and simplest route- no u-turns required!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I look forward to hearing from you :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgdikat", "score_hidden": false, "stickied": false, "created": 1492466776.0, "created_utc": 1492437976.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]