[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My step sister is very opinionated and is not afraid to let anyone know. She asks very uncomfortable questions and wants to know every small detail in personal affairs. She does this even in public places and will say these things loud enough that anyone in a restaurant can hear. She&amp;#39;s very rude and frankly very uncomfortable to be around. It&amp;#39;s very embarrassing for my dad, real brother, and I to be around. We enjoy personal  and casual conversations but do so at personal level and situational volume level, not out in the open at a volume where absolutely anyone can hear in public. Of course she&amp;#39;s my step sister so seeing her is unavoidable at family gatherings and events. And I don&amp;#39;t want to be rude myself, that&amp;#39;s just not in my nature. How would I go about handling these situations?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My step sister is very opinionated and is not afraid to let anyone know. She asks very uncomfortable questions and wants to know every small detail in personal affairs. She does this even in public places and will say these things loud enough that anyone in a restaurant can hear. She's very rude and frankly very uncomfortable to be around. It's very embarrassing for my dad, real brother, and I to be around. We enjoy personal  and casual conversations but do so at personal level and situational volume level, not out in the open at a volume where absolutely anyone can hear in public. Of course she's my step sister so seeing her is unavoidable at family gatherings and events. And I don't want to be rude myself, that's just not in my nature. How would I go about handling these situations?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65k0dt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "Thesexedteacher", "saved": false, "mod_reports": [], "name": "t3_65k0dt", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65k0dt/how_to_handle_an_overbearing_no_filter_type_of/", "num_reports": null, "locked": false, "stickied": false, "created": 1492303218.0, "url": "https://www.reddit.com/r/socialskills/comments/65k0dt/how_to_handle_an_overbearing_no_filter_type_of/", "author_flair_text": null, "quarantine": false, "title": "How to handle an overbearing, no filter type of person in conversation?", "created_utc": 1492274418.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65k0dt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65k0dt", "likes": null, "replies": "", "user_reports": [], "id": "dgb76jz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thesexedteacher", "parent_id": "t1_dgavl6l", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "This is good advice, and while normally that would work, I actually was around her last night in a little restaurant in town and I did this very thing. She brought up something kinda secretive I guess you could call it, and I told her \"not right now, I'll tell ya all about it later\" she continued to press the issue and finally after my parents kind of told her the same as I had said she backed off and went into some other argumentative topic. She just really has no boundaries of her own now that I think of it. That's a better way to put her personality.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is good advice, and while normally that would work, I actually was around her last night in a little restaurant in town and I did this very thing. She brought up something kinda secretive I guess you could call it, and I told her &amp;quot;not right now, I&amp;#39;ll tell ya all about it later&amp;quot; she continued to press the issue and finally after my parents kind of told her the same as I had said she backed off and went into some other argumentative topic. She just really has no boundaries of her own now that I think of it. That&amp;#39;s a better way to put her personality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgb76jz", "score_hidden": false, "stickied": false, "created": 1492320360.0, "created_utc": 1492291560.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgavl6l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "noahtmusic", "parent_id": "t3_65k0dt", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I've found that when people push your comfort boundaries, it's helpful to let them know. If she asks something you're not comfortable with answering, very literally say \"I'm not comfortable answering that in this setting\" and if it's something you would answer in a different setting, then let her know what setting would be comfortable to you. Everyone's boundaries are different, and the best thing you can do for your own sake is define your boundaries well for others.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve found that when people push your comfort boundaries, it&amp;#39;s helpful to let them know. If she asks something you&amp;#39;re not comfortable with answering, very literally say &amp;quot;I&amp;#39;m not comfortable answering that in this setting&amp;quot; and if it&amp;#39;s something you would answer in a different setting, then let her know what setting would be comfortable to you. Everyone&amp;#39;s boundaries are different, and the best thing you can do for your own sake is define your boundaries well for others.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgavl6l", "score_hidden": false, "stickied": false, "created": 1492304582.0, "created_utc": 1492275782.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65k0dt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65k0dt", "likes": null, "replies": "", "user_reports": [], "id": "dgb7a8t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thesexedteacher", "parent_id": "t1_dgavech", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I try to do so but she really doesn't care I guess. She needs attention desperately and will not suffice with having her topics or questions unanswered. But I'll try again tonight, we are having Easter dinner, so we'll see what happens lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I try to do so but she really doesn&amp;#39;t care I guess. She needs attention desperately and will not suffice with having her topics or questions unanswered. But I&amp;#39;ll try again tonight, we are having Easter dinner, so we&amp;#39;ll see what happens lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgb7a8t", "score_hidden": false, "stickied": false, "created": 1492320500.0, "created_utc": 1492291700.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgavech", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SoquidSnake", "parent_id": "t3_65k0dt", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Don't indulge her. If she asks you a question you think is rude, change the subject. Bonus points if you can make it as obvious as possible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t indulge her. If she asks you a question you think is rude, change the subject. Bonus points if you can make it as obvious as possible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgavech", "score_hidden": false, "stickied": false, "created": 1492304320.0, "created_utc": 1492275520.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65k0dt", "likes": null, "replies": "", "user_reports": [], "id": "dgbpuf6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ortofon88", "parent_id": "t3_65k0dt", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Instead of trying to deal with it in public, why not talk to her in private and let her know that you often feel uncomfortable with the questions she asks you in public and ask her if she realizes how uncomfortable it makes you. (don't bring up anyone else). If she isn't aware then maybe she will be more aware in the future. If she is aware and likes to create tension then call her out on that every time. 'Good question,  you would make a good talkshow host. You have a knack for pressuring people and putting them on the spot. Bravo.' and just keep repeating how she's good at pressuring people and putting people on the spot for her amusement. Making unaffected/unemotional/slightly amused comments on how others are behaving badly/rudely is very effective. It shows you know exactly what's going on and they have zero ability to get you to do something that you don't want to do. It sometimes works pretty good, just don't lose your cool. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Instead of trying to deal with it in public, why not talk to her in private and let her know that you often feel uncomfortable with the questions she asks you in public and ask her if she realizes how uncomfortable it makes you. (don&amp;#39;t bring up anyone else). If she isn&amp;#39;t aware then maybe she will be more aware in the future. If she is aware and likes to create tension then call her out on that every time. &amp;#39;Good question,  you would make a good talkshow host. You have a knack for pressuring people and putting them on the spot. Bravo.&amp;#39; and just keep repeating how she&amp;#39;s good at pressuring people and putting people on the spot for her amusement. Making unaffected/unemotional/slightly amused comments on how others are behaving badly/rudely is very effective. It shows you know exactly what&amp;#39;s going on and they have zero ability to get you to do something that you don&amp;#39;t want to do. It sometimes works pretty good, just don&amp;#39;t lose your cool. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgbpuf6", "score_hidden": false, "stickied": false, "created": 1492348162.0, "created_utc": 1492319362.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]