[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Its over 5 years that I had a failed relationship. I went into depression and had to drop from college and went into nursing center. The depression pills are on. The girl started relationship with another boy soon after our break up. I had determined myself to get a girlfriend from sept 2016. I had tried out with 3-4 girls, all of them failed. I feel low on esteem. I hate myself. I think I am not worthy of anyone. I never felt that I have poor communication skills. I am straight forward to everyone. I don&amp;#39;t know why I am failing to make any good relationship. I am tired of failure. I feel low.&lt;/p&gt;\n\n&lt;p&gt;I am already doing meditation daily. I go for running every alternate or so days. I had joined gym for month but i dropped now, but will soon join from may. Till then I am doing running as a physical exercise. &lt;/p&gt;\n\n&lt;p&gt;I will complete my 25th year this april 17. I never had a kiss. I don&amp;#39;t know why fate has been so hard on me. (I had to take year drop 2 times because of depression) I had to take 7 years to clear this 5 year dual degree course. The city I live in seem very hard to survive for me. I will be leaving the college soon and joining job in another city from July. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think that I am alone who struggle in life. I have seen many people struggling in their life. Life is hard. I see pain everywhere. People don&amp;#39;t speak of their pain. They generally hide it within themselves. I spend time with street dogs since they are down to earth beings. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what I should do to myself so that I will start feeling worthy. I don&amp;#39;t know how I will get that feeling when a girl says I love you to you. It makes you so strong about yourself. Bitterly, its seems 6 years I have felt that feeling. I wish I can get a girl that can make me feel worthy enough. Or else I can continue existing in pain.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Its over 5 years that I had a failed relationship. I went into depression and had to drop from college and went into nursing center. The depression pills are on. The girl started relationship with another boy soon after our break up. I had determined myself to get a girlfriend from sept 2016. I had tried out with 3-4 girls, all of them failed. I feel low on esteem. I hate myself. I think I am not worthy of anyone. I never felt that I have poor communication skills. I am straight forward to everyone. I don't know why I am failing to make any good relationship. I am tired of failure. I feel low.\n\nI am already doing meditation daily. I go for running every alternate or so days. I had joined gym for month but i dropped now, but will soon join from may. Till then I am doing running as a physical exercise. \n\nI will complete my 25th year this april 17. I never had a kiss. I don't know why fate has been so hard on me. (I had to take year drop 2 times because of depression) I had to take 7 years to clear this 5 year dual degree course. The city I live in seem very hard to survive for me. I will be leaving the college soon and joining job in another city from July. \n\nI don't think that I am alone who struggle in life. I have seen many people struggling in their life. Life is hard. I see pain everywhere. People don't speak of their pain. They generally hide it within themselves. I spend time with street dogs since they are down to earth beings. \n\nI don't know what I should do to myself so that I will start feeling worthy. I don't know how I will get that feeling when a girl says I love you to you. It makes you so strong about yourself. Bitterly, its seems 6 years I have felt that feeling. I wish I can get a girl that can make me feel worthy enough. Or else I can continue existing in pain.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65kilv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "prakharjain17", "saved": false, "mod_reports": [], "name": "t3_65kilv", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65kilv/i_feel_rejected/", "num_reports": null, "locked": false, "stickied": false, "created": 1492308730.0, "url": "https://www.reddit.com/r/socialskills/comments/65kilv/i_feel_rejected/", "author_flair_text": null, "quarantine": false, "title": "I feel rejected.", "created_utc": 1492279930.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65kilv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65kilv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65kilv", "likes": null, "replies": "", "user_reports": [], "id": "dgbq9x5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Wanna_Be_The_Guy", "parent_id": "t1_dgb4bav", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Look most people who are this depressed have a reason and until you address it you will never recover. I personally have a foot fetish and that haunted me daily but it doesn't anymore. Hopefully you can conquer your issue no one deserves unhappiness for no reason.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look most people who are this depressed have a reason and until you address it you will never recover. I personally have a foot fetish and that haunted me daily but it doesn&amp;#39;t anymore. Hopefully you can conquer your issue no one deserves unhappiness for no reason.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgbq9x5", "score_hidden": false, "stickied": false, "created": 1492348945.0, "created_utc": 1492320145.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4bav", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "prakharjain17", "parent_id": "t1_dgb1lva", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I am already on 3 weeks on nofap. I have been on nofap from last year. Last streak of 20 days got broken due to this same reason. Sometimes I feel so fucked up that I think lets masturbate ffs. \n\nI appreciate your reply. I want to know how much these things have helped you. I am also doing these things. Its right we all are struggling. But god I wish I had that euphoria again which I had in 2 months of serious relationship with this girl. I was on top of the world. I wish there are few more exciting things coming up in my life. Because I am tired of this struggling life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am already on 3 weeks on nofap. I have been on nofap from last year. Last streak of 20 days got broken due to this same reason. Sometimes I feel so fucked up that I think lets masturbate ffs. &lt;/p&gt;\n\n&lt;p&gt;I appreciate your reply. I want to know how much these things have helped you. I am also doing these things. Its right we all are struggling. But god I wish I had that euphoria again which I had in 2 months of serious relationship with this girl. I was on top of the world. I wish there are few more exciting things coming up in my life. Because I am tired of this struggling life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgb4bav", "score_hidden": false, "stickied": false, "created": 1492316408.0, "created_utc": 1492287608.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1lva", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "felixmaria", "parent_id": "t3_65kilv", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "what helped me, though my problems werent as bad as yours sound, is:\n\n-stop masturbating, check out nofap\n\n-check rsd (real social dynamics), just sit down for an evening and consume their youtube stuff (and comparable material)\n\n-also check out rsdnation.com (the forum), there are thousands of people in your situation and even more that got out of it successfull!\n\n-stick to running!!! and rock the gym! awesome!\n\n-do something creative, something not logical. drawing, music, fotography, singing, writing or the best in my opinion: improvisation theater (helped me so much)!!!\n\n-sleep a lot\n\n-meditate daily, 1min or 60min, doesnt matter, but do it daily! start with short sessions!\n\nalso: it seems your relationship to rejection is very toxic. its normal to not like rejection, but its part of life! what helped me soooo much (probably the most after nofap) was the subreddit 100daysofrejection, i wasnt strong enough to do the 100 days, i did maybe 30, and i felt the change so much. but as you see, we are all struggling, some more, some less, sometimes more, sometimes less. \nim 100% sure one day you will look back at the time right now (and maybe the last 5 years) and appreciate it. keep going.\n\nedit: just realised my post contains lots of \"start doing\" and \"do\". dont do it all at once. start with one habit and start it with very tiny steps. or brain doesnt like change. \nthe habits that do you good will stick with you. some wont. take it easy, dont be too hard with yourself. again, youll do it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what helped me, though my problems werent as bad as yours sound, is:&lt;/p&gt;\n\n&lt;p&gt;-stop masturbating, check out nofap&lt;/p&gt;\n\n&lt;p&gt;-check rsd (real social dynamics), just sit down for an evening and consume their youtube stuff (and comparable material)&lt;/p&gt;\n\n&lt;p&gt;-also check out rsdnation.com (the forum), there are thousands of people in your situation and even more that got out of it successfull!&lt;/p&gt;\n\n&lt;p&gt;-stick to running!!! and rock the gym! awesome!&lt;/p&gt;\n\n&lt;p&gt;-do something creative, something not logical. drawing, music, fotography, singing, writing or the best in my opinion: improvisation theater (helped me so much)!!!&lt;/p&gt;\n\n&lt;p&gt;-sleep a lot&lt;/p&gt;\n\n&lt;p&gt;-meditate daily, 1min or 60min, doesnt matter, but do it daily! start with short sessions!&lt;/p&gt;\n\n&lt;p&gt;also: it seems your relationship to rejection is very toxic. its normal to not like rejection, but its part of life! what helped me soooo much (probably the most after nofap) was the subreddit 100daysofrejection, i wasnt strong enough to do the 100 days, i did maybe 30, and i felt the change so much. but as you see, we are all struggling, some more, some less, sometimes more, sometimes less. \nim 100% sure one day you will look back at the time right now (and maybe the last 5 years) and appreciate it. keep going.&lt;/p&gt;\n\n&lt;p&gt;edit: just realised my post contains lots of &amp;quot;start doing&amp;quot; and &amp;quot;do&amp;quot;. dont do it all at once. start with one habit and start it with very tiny steps. or brain doesnt like change. \nthe habits that do you good will stick with you. some wont. take it easy, dont be too hard with yourself. again, youll do it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgb1lva", "score_hidden": false, "stickied": false, "created": 1492312739.0, "created_utc": 1492283939.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65kilv", "likes": null, "replies": "", "user_reports": [], "id": "dgc6wba", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jococaboca", "parent_id": "t3_65kilv", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "You said a lot and I can certainly relate. Because you're a straight-forward person hopefully you'll appreciate my takeaways from your post. Your relationship with yourself isn't very good. You are attuned to the suffering of the world and this is part of the mechanism that keeps you stuck. You also stated that you're looking for someone to make you feel worthy enough.\n\nYou also mentioned that people hide their pain within themselves. What worked for me was a process of examining my pain, resentments and fear and gaining a better and more compassionate understanding of myself. When I stopped viewing myself as \"less than\" other people I found that I wasn't relating to the world and people on a basis of pain. When I felt better about myself I stretched out and tried new things and met new people.\n\nIt's a process and it requires being patient with yourself but from  my experience and the experience of countless people I've known or observed I can say with some certainty that finding the right person who will make you feel worthy doesn't work. When I was miserable I just made people around me miserable and when people treated me with love and kindness I found ways to sabotage those relationships because I didn't feel like I was worthy of love.\n\ntl;dr: Become more understanding and compassionate with yourself. Try new shit that makes you and your life more interesting/vital. Don't put the cart before the horse and think that a relationship can fix you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You said a lot and I can certainly relate. Because you&amp;#39;re a straight-forward person hopefully you&amp;#39;ll appreciate my takeaways from your post. Your relationship with yourself isn&amp;#39;t very good. You are attuned to the suffering of the world and this is part of the mechanism that keeps you stuck. You also stated that you&amp;#39;re looking for someone to make you feel worthy enough.&lt;/p&gt;\n\n&lt;p&gt;You also mentioned that people hide their pain within themselves. What worked for me was a process of examining my pain, resentments and fear and gaining a better and more compassionate understanding of myself. When I stopped viewing myself as &amp;quot;less than&amp;quot; other people I found that I wasn&amp;#39;t relating to the world and people on a basis of pain. When I felt better about myself I stretched out and tried new things and met new people.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a process and it requires being patient with yourself but from  my experience and the experience of countless people I&amp;#39;ve known or observed I can say with some certainty that finding the right person who will make you feel worthy doesn&amp;#39;t work. When I was miserable I just made people around me miserable and when people treated me with love and kindness I found ways to sabotage those relationships because I didn&amp;#39;t feel like I was worthy of love.&lt;/p&gt;\n\n&lt;p&gt;tl;dr: Become more understanding and compassionate with yourself. Try new shit that makes you and your life more interesting/vital. Don&amp;#39;t put the cart before the horse and think that a relationship can fix you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgc6wba", "score_hidden": false, "stickied": false, "created": 1492387358.0, "created_utc": 1492358558.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]