[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let me start first by just saying I used to have a great personality. Sociable, people liked me, had some interest from women, I was with the &amp;quot;cool kids&amp;quot; at school. 10 years down the line I&amp;#39;ve lost myself and dont feel like I have a positive vibe in social situations any more. I haven&amp;#39;t managed to make any friends since school and my only friends are those from school who I don&amp;#39;t see so much of. I have made the odd friend but the ones I came closest to just ditched me. I really don&amp;#39;t know why. I have pretty low self esteem and its kind of a fact I&amp;#39;m not as good at being social as before. I&amp;#39;m not that funny any more, I try to make jokes and they often full flat. If I try to be too funny there&amp;#39;s sometimes an awkward silence. I dont understand why. I guess what I&amp;#39;m trying to say is I feel kind of devastated I&amp;#39;m not as sociable any more. Im failing at life. I dont have a job and can&amp;#39;t hold them down when I do get them. I will more than likely never get a girlfriend because I&amp;#39;m not very interesting, wed probably just sit around in silent a lot. I plummeted down the social hierarchy. Doctors say I have mental health issues. I have gone bat shut crazy for no reason before. But I think that&amp;#39;s because I have a lot of anger I keep in. I dont really think I have bipolar like they said I have. No one really tells me I&amp;#39;ve changed but I just know it. Im lucky my old friends are still there but as soon as they&amp;#39;re not there I struggle. I cant even be friends with girls let alone be a love interest. My life is seriously fucked. I know it could be worse but the fact I had &amp;quot;it&amp;quot; and just suddenly changed like over night really gets me down. &lt;/p&gt;\n\n&lt;p&gt;I had a couple of instances that I got truly upset over. Not that they were huge events in hindsight but at the time I was devastated. Basically this sounds crazy but I got ripped off by some friends of friends. I got so angry and upset I shutdown and didn&amp;#39;t even talk for a while. I dont know if this caused me to be depressed but it was so random. How can something small like that be so devastating? I also had a girl that I was seeing and because I was so destroyed I became a bit aggressive and spoke a lot of gibberish. I still get these episodes of talking gibberish sometimes. It freaks people out. Anyway sorry for the long post just needed to get it off my chest and maybe you guys have some insight?&lt;/p&gt;\n\n&lt;p&gt;Tl:Dr lost my decent personality ( now im weaker mentality, less sociable, more introverted) over being ripped off (something so small). I get blanked out of conversations a lot and no one really wants to hang. My jokes aren&amp;#39;t funny any more.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Let me start first by just saying I used to have a great personality. Sociable, people liked me, had some interest from women, I was with the \"cool kids\" at school. 10 years down the line I've lost myself and dont feel like I have a positive vibe in social situations any more. I haven't managed to make any friends since school and my only friends are those from school who I don't see so much of. I have made the odd friend but the ones I came closest to just ditched me. I really don't know why. I have pretty low self esteem and its kind of a fact I'm not as good at being social as before. I'm not that funny any more, I try to make jokes and they often full flat. If I try to be too funny there's sometimes an awkward silence. I dont understand why. I guess what I'm trying to say is I feel kind of devastated I'm not as sociable any more. Im failing at life. I dont have a job and can't hold them down when I do get them. I will more than likely never get a girlfriend because I'm not very interesting, wed probably just sit around in silent a lot. I plummeted down the social hierarchy. Doctors say I have mental health issues. I have gone bat shut crazy for no reason before. But I think that's because I have a lot of anger I keep in. I dont really think I have bipolar like they said I have. No one really tells me I've changed but I just know it. Im lucky my old friends are still there but as soon as they're not there I struggle. I cant even be friends with girls let alone be a love interest. My life is seriously fucked. I know it could be worse but the fact I had \"it\" and just suddenly changed like over night really gets me down. \n\nI had a couple of instances that I got truly upset over. Not that they were huge events in hindsight but at the time I was devastated. Basically this sounds crazy but I got ripped off by some friends of friends. I got so angry and upset I shutdown and didn't even talk for a while. I dont know if this caused me to be depressed but it was so random. How can something small like that be so devastating? I also had a girl that I was seeing and because I was so destroyed I became a bit aggressive and spoke a lot of gibberish. I still get these episodes of talking gibberish sometimes. It freaks people out. Anyway sorry for the long post just needed to get it off my chest and maybe you guys have some insight?\n\nTl:Dr lost my decent personality ( now im weaker mentality, less sociable, more introverted) over being ripped off (something so small). I get blanked out of conversations a lot and no one really wants to hang. My jokes aren't funny any more.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65kvmc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "flozza89", "saved": false, "mod_reports": [], "name": "t3_65kvmc", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": 1492284157.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65kvmc/lost_my_personality_depression_over_stupid_thing/", "num_reports": null, "locked": false, "stickied": false, "created": 1492312709.0, "url": "https://www.reddit.com/r/socialskills/comments/65kvmc/lost_my_personality_depression_over_stupid_thing/", "author_flair_text": null, "quarantine": false, "title": "lost my personality (depression?) over stupid thing", "created_utc": 1492283909.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65kvmc", "likes": null, "replies": "", "user_reports": [], "id": "dgbkr27", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rainwolf343", "parent_id": "t3_65kvmc", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Something I've learned over time is that no matter how small or how stupid something seems, if it affects you negatively or positively than it isn't nothing. Learn to be okay with who you are, not who you think you used to be, because chances are you still are that person, you have just closed off the idea that you can be a funny, sociable person because you've failed a few times. Don't be afraid of failure - instead use it as an opportunity to learn, grow, and become stronger. If you allow yourself to focus on those failures then you'll only become more depressed and more anxious about yourself. Remember that the most important thing is primarily what you are feeling, then what others are feeling. You can't have empathy and create connections if you aren't in tune with yourself first. \n\nI say this out of experience. I used to have similar issues as yours, and now I am doing better, but it doesn't happen overnight. Healing, especially when you feel like you've lost yourself, takes a long time to complete. Learn to be patient with yourself, and most importantly learn to love yourself for who you are. Not who you think you used to be, or who you think you should be, but as who you are now and always have been. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something I&amp;#39;ve learned over time is that no matter how small or how stupid something seems, if it affects you negatively or positively than it isn&amp;#39;t nothing. Learn to be okay with who you are, not who you think you used to be, because chances are you still are that person, you have just closed off the idea that you can be a funny, sociable person because you&amp;#39;ve failed a few times. Don&amp;#39;t be afraid of failure - instead use it as an opportunity to learn, grow, and become stronger. If you allow yourself to focus on those failures then you&amp;#39;ll only become more depressed and more anxious about yourself. Remember that the most important thing is primarily what you are feeling, then what others are feeling. You can&amp;#39;t have empathy and create connections if you aren&amp;#39;t in tune with yourself first. &lt;/p&gt;\n\n&lt;p&gt;I say this out of experience. I used to have similar issues as yours, and now I am doing better, but it doesn&amp;#39;t happen overnight. Healing, especially when you feel like you&amp;#39;ve lost yourself, takes a long time to complete. Learn to be patient with yourself, and most importantly learn to love yourself for who you are. Not who you think you used to be, or who you think you should be, but as who you are now and always have been. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgbkr27", "score_hidden": false, "stickied": false, "created": 1492339816.0, "created_utc": 1492311016.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65kvmc", "likes": null, "replies": "", "user_reports": [], "id": "dgbor41", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "smplgmr", "parent_id": "t3_65kvmc", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "&gt; I will more than likely never get a girlfriend *because I'm not very interesting*...\n\nThat's not it at all. First of all, we all have various interests. I know a girl that loves to watch Masterpiece Theater. She is the only one in my circle of friends, and in fact the only person I've ever known, that has this interest. It's not about what you like and how interesting it is, it is about how much *you* love that thing. Have you ever watched a TedTalk on youtube about a topic you never even knew about, and then after watching thought \"Wow, that's amazing!\" Or have you ever taken a class on a subject that you really like, but was disappointed because the teacher had no passion for it? This is because, it's not about what you love, it's about how much you love it. If *you* think that the things you love are uninteresting, then others will to because when we talk about things we love, we light up like a spot light, and when we talk about things that we don't care about, everyone can see how uninterested we are. Love what you like, THEN you become interesting whenever you talk about it. Some people devote their entire lives to one single thing, and become famous for it due to the passion that they have for that one thing.\n\n\nAnd don't forget to listen to others when they talk about what they love, showing an interest in others when they talk about what they love, is an attractive trait.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I will more than likely never get a girlfriend &lt;em&gt;because I&amp;#39;m not very interesting&lt;/em&gt;...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not it at all. First of all, we all have various interests. I know a girl that loves to watch Masterpiece Theater. She is the only one in my circle of friends, and in fact the only person I&amp;#39;ve ever known, that has this interest. It&amp;#39;s not about what you like and how interesting it is, it is about how much &lt;em&gt;you&lt;/em&gt; love that thing. Have you ever watched a TedTalk on youtube about a topic you never even knew about, and then after watching thought &amp;quot;Wow, that&amp;#39;s amazing!&amp;quot; Or have you ever taken a class on a subject that you really like, but was disappointed because the teacher had no passion for it? This is because, it&amp;#39;s not about what you love, it&amp;#39;s about how much you love it. If &lt;em&gt;you&lt;/em&gt; think that the things you love are uninteresting, then others will to because when we talk about things we love, we light up like a spot light, and when we talk about things that we don&amp;#39;t care about, everyone can see how uninterested we are. Love what you like, THEN you become interesting whenever you talk about it. Some people devote their entire lives to one single thing, and become famous for it due to the passion that they have for that one thing.&lt;/p&gt;\n\n&lt;p&gt;And don&amp;#39;t forget to listen to others when they talk about what they love, showing an interest in others when they talk about what they love, is an attractive trait.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgbor41", "score_hidden": false, "stickied": false, "created": 1492346165.0, "created_utc": 1492317365.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]