[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As for some background on myself, I have never had relationship with a girl in high school or in my first year of college. I am a kissless virgin and I am not to sure about my confidence whenever I approach someone I take interest in.  This lack of experience has probably been the main detriment in all my attempts to try and make more of my friendships with girls I have come to know. I recently came really close to making something more with someone I have talked to for a few months, however like always things happen for a reason. &lt;/p&gt;\n\n&lt;p&gt;Now with that out of the way I can cut to the chase. So I have a two and a half hour class once a week on Tuesday. The class is Sociology of Murder, so there is definitely a lot to talk about regarding the class itself which could make for easy conversation whether it is about lecture or homework. Now in this class of roughly fifty to sixty people, there is this one girl I have seen all semester but I have not heard a word come from her mouth once. Mind you the seats are all full in this class and nobody moves from where they originally chose to sit. I want advice on how I can approach this girl and potentially develop a foundation to become friends and get to know her to see if I am truly interested. I need this advice because I am on a time crunch with this task. There are only two class periods left in the semester with that last one being an exam and that&amp;#39;s it. I would like to know how I can approach this girl without coming off as a creep because of how late it is in the semester. As for a little bit more information, I live on campus and she is a commuter so it makes things a tad bit more complicated I would assume. Any advice would be appreciated, I have asked a lot of my friends on campus, but I want to see if anything  different comes along on here.&lt;/p&gt;\n\n&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As for some background on myself, I have never had relationship with a girl in high school or in my first year of college. I am a kissless virgin and I am not to sure about my confidence whenever I approach someone I take interest in.  This lack of experience has probably been the main detriment in all my attempts to try and make more of my friendships with girls I have come to know. I recently came really close to making something more with someone I have talked to for a few months, however like always things happen for a reason. \n\nNow with that out of the way I can cut to the chase. So I have a two and a half hour class once a week on Tuesday. The class is Sociology of Murder, so there is definitely a lot to talk about regarding the class itself which could make for easy conversation whether it is about lecture or homework. Now in this class of roughly fifty to sixty people, there is this one girl I have seen all semester but I have not heard a word come from her mouth once. Mind you the seats are all full in this class and nobody moves from where they originally chose to sit. I want advice on how I can approach this girl and potentially develop a foundation to become friends and get to know her to see if I am truly interested. I need this advice because I am on a time crunch with this task. There are only two class periods left in the semester with that last one being an exam and that's it. I would like to know how I can approach this girl without coming off as a creep because of how late it is in the semester. As for a little bit more information, I live on campus and she is a commuter so it makes things a tad bit more complicated I would assume. Any advice would be appreciated, I have asked a lot of my friends on campus, but I want to see if anything  different comes along on here.\n\nThanks!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65kwvk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "throwaway246462", "saved": false, "mod_reports": [], "name": "t3_65kwvk", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65kwvk/my_first_year_of_college_is_ending_and_i_am/", "num_reports": null, "locked": false, "stickied": false, "created": 1492313111.0, "url": "https://www.reddit.com/r/socialskills/comments/65kwvk/my_first_year_of_college_is_ending_and_i_am/", "author_flair_text": null, "quarantine": false, "title": "My first year of college is ending and I am giving one last go at approaching a girl", "created_utc": 1492284311.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65kwvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65kwvk", "likes": null, "replies": "", "user_reports": [], "id": "dgb4cd9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throwaway246462", "parent_id": "t1_dgb43hq", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I like how blunt this post is, its good to be realistic yeah?\n\nThanks for the input!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like how blunt this post is, its good to be realistic yeah?&lt;/p&gt;\n\n&lt;p&gt;Thanks for the input!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgb4cd9", "score_hidden": false, "stickied": false, "created": 1492316448.0, "created_utc": 1492287648.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb43hq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ilgnome", "parent_id": "t3_65kwvk", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "&gt; I am a kissless virgin \n\nI remember my time as a 'kissless virgin'. Then I got my dick sucked during Silence of the Lambs.\n\n&gt; This lack of experience\n\nNo one is born with experience. Anyone that says otherwise is trying to sell you something. You get experience by trying and failing. The more you fail the better you'll get because you'll find out what doesn't work which is more important than what does work.\n\n&gt;  however like always things happen for a reason.\n\nNo, they don't. If shit happens for a reason than you're meant to be alone. If shit happens by chance than you can take all the chances you want because shit is random.\n\n&gt; Now with that out of the way I can cut to the chase\n\nIf you had just done that (ask her out already) instead of posting here, you'd have your answer already.\n\n&gt; I want advice on how I can approach this girl\n\nWalk up to her and ask her to coffee on Saturday. Not \"sometime\" but pick a date that works for you, if she says that she's busy that day ask her if another day works, if she's busy that day, give her you're number and say to call you if she's interested. At this point you've asked 3 times and if you don't hear back from her consider it a no.\n\n\n&gt; without coming off as a creep\n\nToo late. You're asking her out during a sociology of a murder class. Just own that shit and ask her after class.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I am a kissless virgin &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I remember my time as a &amp;#39;kissless virgin&amp;#39;. Then I got my dick sucked during Silence of the Lambs.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This lack of experience&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No one is born with experience. Anyone that says otherwise is trying to sell you something. You get experience by trying and failing. The more you fail the better you&amp;#39;ll get because you&amp;#39;ll find out what doesn&amp;#39;t work which is more important than what does work.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;however like always things happen for a reason.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, they don&amp;#39;t. If shit happens for a reason than you&amp;#39;re meant to be alone. If shit happens by chance than you can take all the chances you want because shit is random.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Now with that out of the way I can cut to the chase&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you had just done that (ask her out already) instead of posting here, you&amp;#39;d have your answer already.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I want advice on how I can approach this girl&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Walk up to her and ask her to coffee on Saturday. Not &amp;quot;sometime&amp;quot; but pick a date that works for you, if she says that she&amp;#39;s busy that day ask her if another day works, if she&amp;#39;s busy that day, give her you&amp;#39;re number and say to call you if she&amp;#39;s interested. At this point you&amp;#39;ve asked 3 times and if you don&amp;#39;t hear back from her consider it a no.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;without coming off as a creep&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Too late. You&amp;#39;re asking her out during a sociology of a murder class. Just own that shit and ask her after class.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgb43hq", "score_hidden": false, "stickied": false, "created": 1492316116.0, "created_utc": 1492287316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]