[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m turning 21 in September and haven&amp;#39;t been in a relationship since high school and even then those only ever lasted a few months. I have dated plenty of girls since then but none of them have ever gone anywhere.&lt;/p&gt;\n\n&lt;p&gt;I feel like I&amp;#39;m falling far behind. I was always extremely shy and insecure in HS and have made great strides since graduating to be a more confident person. And I feel like I&amp;#39;ve achieved that. I&amp;#39;m much more social and have a lot of friends that I hang out with, but I still feel so lonely. Most of the girls I&amp;#39;ve dated have been off tinder.&lt;/p&gt;\n\n&lt;p&gt;I think I&amp;#39;m a good looking guy too, although I have a total baby face and I think that&amp;#39;s what keeps me from talking to a lot of girls because I assume they think I&amp;#39;m still in high school. It also doesn&amp;#39;t help that I&amp;#39;m just an average height (only 5&amp;#39;7) but I&amp;#39;m an interesting person, I play guitar, drums, write, love to cook and workout. &lt;/p&gt;\n\n&lt;p&gt;One of my friends even joked that if I didn&amp;#39;t ask for a girls number next time I saw someone I think was cute he&amp;#39;d do it for me lol.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also not in school but work plenty.&lt;/p&gt;\n\n&lt;p&gt;Tl;dr: I go out a lot with friends, but I still feel lonely for something more and don&amp;#39;t know how to go about it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm turning 21 in September and haven't been in a relationship since high school and even then those only ever lasted a few months. I have dated plenty of girls since then but none of them have ever gone anywhere.\n\nI feel like I'm falling far behind. I was always extremely shy and insecure in HS and have made great strides since graduating to be a more confident person. And I feel like I've achieved that. I'm much more social and have a lot of friends that I hang out with, but I still feel so lonely. Most of the girls I've dated have been off tinder.\n\nI think I'm a good looking guy too, although I have a total baby face and I think that's what keeps me from talking to a lot of girls because I assume they think I'm still in high school. It also doesn't help that I'm just an average height (only 5'7) but I'm an interesting person, I play guitar, drums, write, love to cook and workout. \n\nOne of my friends even joked that if I didn't ask for a girls number next time I saw someone I think was cute he'd do it for me lol.\n\nI'm also not in school but work plenty.\n\nTl;dr: I go out a lot with friends, but I still feel lonely for something more and don't know how to go about it.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65m3wx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "guitar_dude233", "saved": false, "mod_reports": [], "name": "t3_65m3wx", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65m3wx/how_do_i_attract_people_into_my_life/", "num_reports": null, "locked": false, "stickied": false, "created": 1492327354.0, "url": "https://www.reddit.com/r/socialskills/comments/65m3wx/how_do_i_attract_people_into_my_life/", "author_flair_text": null, "quarantine": false, "title": "How do I attract people into my life?", "created_utc": 1492298554.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65m3wx", "likes": null, "replies": "", "user_reports": [], "id": "dgbdqms", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "spitz81", "parent_id": "t3_65m3wx", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Loneliness always starts with yourself. It's something you need to conquer before moving on. Once you don't feel the need for any person to fill a void, it all gets so much easier. But trying to force a quick fix is like a sour old bastard throwing money at his problems. It provides a sort of hollow comfort, but doesn't address the problem. An expensive mansion can be incredibly lonely if you drift through it like a ghost. And a broken down shack can be a home if you make it one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Loneliness always starts with yourself. It&amp;#39;s something you need to conquer before moving on. Once you don&amp;#39;t feel the need for any person to fill a void, it all gets so much easier. But trying to force a quick fix is like a sour old bastard throwing money at his problems. It provides a sort of hollow comfort, but doesn&amp;#39;t address the problem. An expensive mansion can be incredibly lonely if you drift through it like a ghost. And a broken down shack can be a home if you make it one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgbdqms", "score_hidden": false, "stickied": false, "created": 1492329655.0, "created_utc": 1492300855.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65m3wx", "likes": null, "replies": "", "user_reports": [], "id": "dgbfava", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NeonEagle", "parent_id": "t3_65m3wx", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "It sounds like you need to focus on yourself.  I don't mean stop dating or getting on Tinder; what I mean is stop dating with the expectation of it turning into something more.  Keep yourself busy before a date, don't dwell on it.  The funny, impossible-to-make-up things that happen during every-day life are great material to talk about as well!\n\nGenerally, my rule is that if I'm feeling desperate for a partner, then I should stay single.  Depending on someone else to be happy is big-time unhealthy. Being single gives you time to figure your shit out, become a better person so that when you do meet the one they are attracted into your life even more, and perhaps most importantly - when you don't act available is when you are most wanted.\n\nSet your romantic goals aside and become the biggest badass you can.  You won't have this issue any more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you need to focus on yourself.  I don&amp;#39;t mean stop dating or getting on Tinder; what I mean is stop dating with the expectation of it turning into something more.  Keep yourself busy before a date, don&amp;#39;t dwell on it.  The funny, impossible-to-make-up things that happen during every-day life are great material to talk about as well!&lt;/p&gt;\n\n&lt;p&gt;Generally, my rule is that if I&amp;#39;m feeling desperate for a partner, then I should stay single.  Depending on someone else to be happy is big-time unhealthy. Being single gives you time to figure your shit out, become a better person so that when you do meet the one they are attracted into your life even more, and perhaps most importantly - when you don&amp;#39;t act available is when you are most wanted.&lt;/p&gt;\n\n&lt;p&gt;Set your romantic goals aside and become the biggest badass you can.  You won&amp;#39;t have this issue any more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgbfava", "score_hidden": false, "stickied": false, "created": 1492331909.0, "created_utc": 1492303109.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65m3wx", "likes": null, "replies": "", "user_reports": [], "id": "dgccx9q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NerdyAsthete", "parent_id": "t3_65m3wx", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "You could try other dating sites, like Okcupid or Bumble just for more diversity.\n\nI'm not going to parrot the advice about being happy with yourself before wanting a relationship, because while it's not incorrect, it seems it's a bit of a shoo! shoo! type of a response to a somewhat tricky issue, and one I've dealt with myself.\n\nWhat I would suggest (besides trying other dating sites) is to try clubs, especially ones that you know are co-ed ahead of time like some teams sports. Of course, this won't guarantee success because you won't know of girls' relationship statuses up front, but it'll at least give you more exposure to girls (hopefully in your age range) while also doing activities you (may) end up enjoying.\n\nAs for baby face...if you feel it's a deterrent, can you grow a beard, or at least some stubble? That could solve that problem since facial hair tends to add perceived age to a face.", "edited": 1492366719.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could try other dating sites, like Okcupid or Bumble just for more diversity.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to parrot the advice about being happy with yourself before wanting a relationship, because while it&amp;#39;s not incorrect, it seems it&amp;#39;s a bit of a shoo! shoo! type of a response to a somewhat tricky issue, and one I&amp;#39;ve dealt with myself.&lt;/p&gt;\n\n&lt;p&gt;What I would suggest (besides trying other dating sites) is to try clubs, especially ones that you know are co-ed ahead of time like some teams sports. Of course, this won&amp;#39;t guarantee success because you won&amp;#39;t know of girls&amp;#39; relationship statuses up front, but it&amp;#39;ll at least give you more exposure to girls (hopefully in your age range) while also doing activities you (may) end up enjoying.&lt;/p&gt;\n\n&lt;p&gt;As for baby face...if you feel it&amp;#39;s a deterrent, can you grow a beard, or at least some stubble? That could solve that problem since facial hair tends to add perceived age to a face.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgccx9q", "score_hidden": false, "stickied": false, "created": 1492395303.0, "created_utc": 1492366503.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65m3wx", "likes": null, "replies": "", "user_reports": [], "id": "dgboznf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ortofon88", "parent_id": "t3_65m3wx", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Step out of your comfort zone every day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Step out of your comfort zone every day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgboznf", "score_hidden": false, "stickied": false, "created": 1492346585.0, "created_utc": 1492317785.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]