[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;ll just say that I&amp;#39;ve always been pretty weird. Never liked what the other kids liked, missed every social cue, etc. I know that, as a kid, I wasn&amp;#39;t the easiest guy to get on with, since it took a lot of energy to want to do what everyone else was doing (like when we stayed at a cottage and everyone else went swimming in the morning, it would take me until the afternoon to work up the motivation to swim). &lt;/p&gt;\n\n&lt;p&gt;Fast forward to now and my relatives and family friends are all telling me that they hated me as a kid and never dreamed that they would actually like talking to me as an adult. I guess this is a positive thing but it really hit me hard. I always knew they didn&amp;#39;t like me when I was younger but when I think back to my childhood, such a large part of it was me trying so hard to fit in and be more likeable and it stings to think of how little my efforts actually mattered.&lt;/p&gt;\n\n&lt;p&gt;Now I feel like I&amp;#39;m back where my childhood self was, and everything I do is rejected. I have a group of friends at my uni and a lot of their actions support the theory that they actually like me, but I can&amp;#39;t help feeling bad that I&amp;#39;m the weird one out of all of us. They&amp;#39;ll joke that if our life were a movie, I&amp;#39;d be the hapless comedic-relief sidekick or that one animal character that&amp;#39;s intended to be cute but just ends up being annoying. I know I&amp;#39;m weird, but if a lifetime of mimicking normal people hasn&amp;#39;t done anything to change that, I don&amp;#39;t know what will. I just get this sense that there&amp;#39;s this big secret to being normal hidden in plain view and everyone but me was clued in. Kicker is, I can tell immediately when someone else makes a faux pas or when they&amp;#39;re just weird like me, but that doesn&amp;#39;t stop me from making the same mistakes they do.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s nice that I have friends and my family seems to like me enough now, but I hate that I&amp;#39;m always relegated to the kooky black sheep. It&amp;#39;s painful to live a life knowing you&amp;#39;re doing things wrong and can&amp;#39;t seem to fix it. Just looking for some advice or affirmation, please.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I'll just say that I've always been pretty weird. Never liked what the other kids liked, missed every social cue, etc. I know that, as a kid, I wasn't the easiest guy to get on with, since it took a lot of energy to want to do what everyone else was doing (like when we stayed at a cottage and everyone else went swimming in the morning, it would take me until the afternoon to work up the motivation to swim). \n\nFast forward to now and my relatives and family friends are all telling me that they hated me as a kid and never dreamed that they would actually like talking to me as an adult. I guess this is a positive thing but it really hit me hard. I always knew they didn't like me when I was younger but when I think back to my childhood, such a large part of it was me trying so hard to fit in and be more likeable and it stings to think of how little my efforts actually mattered.\n\nNow I feel like I'm back where my childhood self was, and everything I do is rejected. I have a group of friends at my uni and a lot of their actions support the theory that they actually like me, but I can't help feeling bad that I'm the weird one out of all of us. They'll joke that if our life were a movie, I'd be the hapless comedic-relief sidekick or that one animal character that's intended to be cute but just ends up being annoying. I know I'm weird, but if a lifetime of mimicking normal people hasn't done anything to change that, I don't know what will. I just get this sense that there's this big secret to being normal hidden in plain view and everyone but me was clued in. Kicker is, I can tell immediately when someone else makes a faux pas or when they're just weird like me, but that doesn't stop me from making the same mistakes they do.\n\nIt's nice that I have friends and my family seems to like me enough now, but I hate that I'm always relegated to the kooky black sheep. It's painful to live a life knowing you're doing things wrong and can't seem to fix it. Just looking for some advice or affirmation, please.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65mdfj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "kittenwarriorarmy", "saved": false, "mod_reports": [], "name": "t3_65mdfj", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65mdfj/all_i_know_is_whatever_im_doing_isnt_working_for/", "num_reports": null, "locked": false, "stickied": false, "created": 1492330695.0, "url": "https://www.reddit.com/r/socialskills/comments/65mdfj/all_i_know_is_whatever_im_doing_isnt_working_for/", "author_flair_text": null, "quarantine": false, "title": "All I know is whatever I'm doing isn't working for me and I can't deal with it anymore.", "created_utc": 1492301895.0, "distinguished": null, "media": null, "upvote_ratio": 0.76, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65mdfj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65mdfj", "likes": null, "replies": "", "user_reports": [], "id": "dgc4jg3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "linkdwsn33", "parent_id": "t1_dgbey1p", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "This. Embrace your passions and hobbies and find people who are similar to you, instead of trying to fit in with normies. I can relate this to my own life in a away like how i love music. Mostly metal tho, im a big metal head and most people assume things about me and its hard talking to new friends or girls about it because they all assume tje same things and always like other things like country and rap. Eventually i have made some more friends who are great to have around with and share the same interestests. Point im trying to make is domt be what others want you to be. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. Embrace your passions and hobbies and find people who are similar to you, instead of trying to fit in with normies. I can relate this to my own life in a away like how i love music. Mostly metal tho, im a big metal head and most people assume things about me and its hard talking to new friends or girls about it because they all assume tje same things and always like other things like country and rap. Eventually i have made some more friends who are great to have around with and share the same interestests. Point im trying to make is domt be what others want you to be. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgc4jg3", "score_hidden": false, "stickied": false, "created": 1492384112.0, "created_utc": 1492355312.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbey1p", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "spitz81", "parent_id": "t3_65mdfj", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "It sounds like you're stuck inside your own head. You can identify faux pas from others, but not your own. It sounds to me like a matter of perspective. \n\nTo an extent you have to accept that we're all different, and to an extent this notion of \"normal\" is pretty meaningless. It usually means compliance to a particular thing. Everyone's \"a bit weird\", I guarantee it. \n\nBut if your weirdness is getting in your way, it's probably time to make some changes. That and maybe you're trying to fit into a crowd you're not meant to fit in to. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you&amp;#39;re stuck inside your own head. You can identify faux pas from others, but not your own. It sounds to me like a matter of perspective. &lt;/p&gt;\n\n&lt;p&gt;To an extent you have to accept that we&amp;#39;re all different, and to an extent this notion of &amp;quot;normal&amp;quot; is pretty meaningless. It usually means compliance to a particular thing. Everyone&amp;#39;s &amp;quot;a bit weird&amp;quot;, I guarantee it. &lt;/p&gt;\n\n&lt;p&gt;But if your weirdness is getting in your way, it&amp;#39;s probably time to make some changes. That and maybe you&amp;#39;re trying to fit into a crowd you&amp;#39;re not meant to fit in to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgbey1p", "score_hidden": false, "stickied": false, "created": 1492331393.0, "created_utc": 1492302593.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]