[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, on Thursday after getting out of class I found myself cringing at my eye contacts skills. I used to have trouble making eye contact when I was a kid ,but now I&amp;#39;m OK.If it&amp;#39;s a family member or friend etc I&amp;#39;m ok. But on rare occasions someone will make me nervous. In those situations instead of holding eye contact, will hold and glance away for a micro second and look back until the conversation is done or something.It&amp;#39;s super quick, but I do the micro glance away thing throughout the conversation.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, on Thursday after getting out of class I found myself cringing at my eye contacts skills. I used to have trouble making eye contact when I was a kid ,but now I'm OK.If it's a family member or friend etc I'm ok. But on rare occasions someone will make me nervous. In those situations instead of holding eye contact, will hold and glance away for a micro second and look back until the conversation is done or something.It's super quick, but I do the micro glance away thing throughout the conversation.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ne56", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "orehoe", "saved": false, "mod_reports": [], "name": "t3_65ne56", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65ne56/im_i_making_bad_eye_contact/", "num_reports": null, "locked": false, "stickied": false, "created": 1492345035.0, "url": "https://www.reddit.com/r/socialskills/comments/65ne56/im_i_making_bad_eye_contact/", "author_flair_text": null, "quarantine": false, "title": "I'm I making bad eye contact?", "created_utc": 1492316235.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ne56", "likes": null, "replies": "", "user_reports": [], "id": "dgboglt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ortofon88", "parent_id": "t3_65ne56", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "If you are glancing away out of nervousness then it shows. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you are glancing away out of nervousness then it shows. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgboglt", "score_hidden": false, "stickied": false, "created": 1492345665.0, "created_utc": 1492316865.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ne56", "likes": null, "replies": "", "user_reports": [], "id": "dgbr0wo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "smplgmr", "parent_id": "t3_65ne56", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "In some cases, other people *do* make us feel nervous. This isn't necessarily an issue with your gaze, as much as it is an issue with the other person. In this case, your hesitation to look, is natural. The way to identify... when it's a rare occasion. However, if you are attracted to that person, that could be the reason for it too. You're talking with your eyes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In some cases, other people &lt;em&gt;do&lt;/em&gt; make us feel nervous. This isn&amp;#39;t necessarily an issue with your gaze, as much as it is an issue with the other person. In this case, your hesitation to look, is natural. The way to identify... when it&amp;#39;s a rare occasion. However, if you are attracted to that person, that could be the reason for it too. You&amp;#39;re talking with your eyes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgbr0wo", "score_hidden": false, "stickied": false, "created": 1492350476.0, "created_utc": 1492321676.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ne56", "likes": null, "replies": "", "user_reports": [], "id": "dgdez9z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "doublyfrank", "parent_id": "t3_65ne56", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I actually wrote a brief article specifically on eye contact. I'll just post it in this reply (let me know what you think):\n\n---\n\n    Human interaction is very nuanced, and this can make it difficult to become adept at (even moreso if you consider yourself introverted). First, you have to say and do the right things the right way at the right time. Not only that- you then have to pay attention and react appropriately to whomever you’re conversing with. The problem is compounded with the glut of articles on some “magic pill” to help us better connect or- even worse- the cliche advice to “just do it.” Trying to process all this information and implement all these tips at once ends up being more of a negative thing than something beneficial (multitasking is ineffective).\n\n     What is most beneficial?\n\n     There is no “one” key element to improved social encounters- there are many. What you have to do is determine the few elements that have the biggest effect on the interaction (see Pareto’s principle). The process doesn’t happen overnight. Though by focusing on one thing at a time, you’ll feel more accomplished and confident, and that progress gives you something to build off.\n\n     This article is not a magic pill.\n\n     This article is a roadmap to beginning work on one of those key elements.\n\n    \n     Before we get into the meat of the importance of eye contact (and how to improve it), see if you can pick up on how lack of eye contact negatively impacted the following situation.\n\n---\n\n    It was a tough week at work- but Pat survived! And, especially with the gloomy weather outside, he felt that he owed it to himself to take Saturday to unwind. He starts the day off working on his passion project and heads to the local cafe.\n\n     Pat recites his normal order but doesn’t notice the barista’s gaze is focused instead on the impending storm outside. She asks him to repeat and, caught off guard, he stutters a little- though manages to blurt it all out. He timidly hands her his credit card, and she counters with a request for ID to confirm his identity. After fumbling through his wallet for a couple seconds, he finds it and successfully pays for his order. He finally gets his beverage and makes his way over to an open chair. Taking his seat, he notices a cute girl at the table opposite him.\n\n     “Hopefully the weather holds out so I can clean up my yard!” she remarks.\n\n     Still a bit flustered, Pat smiles, briefly glances at her and responds “Yeah that’d be nice” as he looks at his computer.\n\n     After slogging through his project for a couple hours, he gives up, heads home and ends up binge-watching Netflix for the rest of the day.\n\n...\n\n     Does that sound a little too real? I’ve been in similar predicaments on multiple occasions; it’s demotivating and embarrassing. Though you don’t have to be in those situations… Is anybody really forcing you? No, and change is possible.\n\n     But it’s not easy- that’s obvious. Maybe you can sympathize with how these people felt about their struggle with eye contact:\n\n\n          It seems so unnatural. I can't even look my family members in the eye.\n\n\n          Even with the people I'm closest to, I have a hard time making eye contact with them for longer than a few seconds at a time.\n\n\n     But does eye contact really have that much of an impact on conversation and social situations? The short answer is yes. And when you take a systematic approach, overcoming the challenge becomes far less daunting than you’d have imagined.\n\n\n\nWhat’s the big deal?\n\n     How important is eye contact? An important reason to focus on it is that it allows you to better read others’ body language and facial expressions.\n\n     Viewing the face of the person you're speaking with allows you to notice the things they say without speaking. You pick up on changes in body position, facial expressions and their eye contact; in turn, you can be more conversationally dynamic. If you read between the lines and decipher better what they mean by “listening\" not just to their spoken thoughts but also to their unspoken ones, you can really connect with them and get much more out of the conversation.\n\n     This is huge. You can be far more mindful of the current situation than you would have had you not been visually focused. That dynamism makes the conversation feel more natural. When it feels natural, you'll feel comfortable- and what does comfort lead to?\n\n     Confidence.\n\n     Even if you don’t “feel” confident, there’s no doubt that you will give off that impression. \n\n\n     \"But I’m not really confident. People will definitely pick up on that.\"\n\n\n     At least that’s what I used to think. You’ve probably heard people toss around the stale saying “fake it till you make it.” \n\n\n     I freaking hate that saying.\n\n\n     It’s ridiculously overused and doesn’t make sense at face value. But… it’s true. It makes more sense when paired with this thought:\n\n\n     You are not you. You are who you are perceived to be.\n\n\n     You can illustrate this by thinking of your different sets of close associates. The main ones that likely come to mind are your immediate family, good friends and coworkers. Do they all treat and converse with you the same way?\n\n     No, because they all have a different perception of who you are.\n\n     Your coworkers at a job you disliked might think of you as “that lazy guy.” Though once you found a job you enjoyed, your new colleagues thought you were a real \"go-getter.” Your parents will always have the perception of you as their baby in the back of their mind, while your friends know you as the buddy that always gives good advice. \n\n     Even “perceived\" confidence leads to a number of positive results. Others will give much more credence to your words when they sense how confident you seem when speaking. People have higher trust in someone that seems confident in what they’re saying than someone who gives off an air of uncertainty.\n\n     Would you trust a salesman if he looked down the entire time he was talking to you? Probably not. \n\n     Now, improving your eye contact is not going to happen overnight. It’s like when when I step into a swimming pool the first time of the year: it generally takes what seems like eternity. Oh, I could jump in- as literally everyone yells at me- but instead it’s one toe at a time.\n\n     Then a foot.\n\n     Then up to the knees.\n\n     Once I’ve been waist-deep for a couple minutes, I’m so invested I’ll generally plunge the rest of my pale white body into the water.\n\n     Improving your eye contact will be the same way. Now, there are many superficial articles on the benefits of good eye contact. And granted, there is some good information; but what’s the point of good information if you don’t use it?! Along that line of reasoning, I created a practical and effective exercise that will ensure significant improvement in your eye contact. \n\n     Again, this takes time. The absolute minimum amount of time this process should take is two weeks. After all, it’s better to take a few small steps forward and hold your ground than to take a giant leap and fall backwards. What this process will do is gradually help you feel more comfortable with holding eye contact until you really start enjoying the benefits and it becomes habit.\n\n---\n\nI fear that the full article is too long to post as a reply. If you found the above interesting and would like to read the rest, PM me and I'll send you the full article. I also created a very clean \"e-book\" version that you can read on the go. Let me know if you'd like that and I can send it your way free of charge ;) I just have to dig up the file from my computer!", "edited": 1492432325.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually wrote a brief article specifically on eye contact. I&amp;#39;ll just post it in this reply (let me know what you think):&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;pre&gt;&lt;code&gt;Human interaction is very nuanced, and this can make it difficult to become adept at (even moreso if you consider yourself introverted). First, you have to say and do the right things the right way at the right time. Not only that- you then have to pay attention and react appropriately to whomever you’re conversing with. The problem is compounded with the glut of articles on some “magic pill” to help us better connect or- even worse- the cliche advice to “just do it.” Trying to process all this information and implement all these tips at once ends up being more of a negative thing than something beneficial (multitasking is ineffective).\n\n What is most beneficial?\n\n There is no “one” key element to improved social encounters- there are many. What you have to do is determine the few elements that have the biggest effect on the interaction (see Pareto’s principle). The process doesn’t happen overnight. Though by focusing on one thing at a time, you’ll feel more accomplished and confident, and that progress gives you something to build off.\n\n This article is not a magic pill.\n\n This article is a roadmap to beginning work on one of those key elements.\n\n\n Before we get into the meat of the importance of eye contact (and how to improve it), see if you can pick up on how lack of eye contact negatively impacted the following situation.\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;hr/&gt;\n\n&lt;pre&gt;&lt;code&gt;It was a tough week at work- but Pat survived! And, especially with the gloomy weather outside, he felt that he owed it to himself to take Saturday to unwind. He starts the day off working on his passion project and heads to the local cafe.\n\n Pat recites his normal order but doesn’t notice the barista’s gaze is focused instead on the impending storm outside. She asks him to repeat and, caught off guard, he stutters a little- though manages to blurt it all out. He timidly hands her his credit card, and she counters with a request for ID to confirm his identity. After fumbling through his wallet for a couple seconds, he finds it and successfully pays for his order. He finally gets his beverage and makes his way over to an open chair. Taking his seat, he notices a cute girl at the table opposite him.\n\n “Hopefully the weather holds out so I can clean up my yard!” she remarks.\n\n Still a bit flustered, Pat smiles, briefly glances at her and responds “Yeah that’d be nice” as he looks at his computer.\n\n After slogging through his project for a couple hours, he gives up, heads home and ends up binge-watching Netflix for the rest of the day.\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;...&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt; Does that sound a little too real? I’ve been in similar predicaments on multiple occasions; it’s demotivating and embarrassing. Though you don’t have to be in those situations… Is anybody really forcing you? No, and change is possible.\n\n But it’s not easy- that’s obvious. Maybe you can sympathize with how these people felt about their struggle with eye contact:\n\n\n      It seems so unnatural. I can&amp;#39;t even look my family members in the eye.\n\n\n      Even with the people I&amp;#39;m closest to, I have a hard time making eye contact with them for longer than a few seconds at a time.\n\n\n But does eye contact really have that much of an impact on conversation and social situations? The short answer is yes. And when you take a systematic approach, overcoming the challenge becomes far less daunting than you’d have imagined.\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;What’s the big deal?&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt; How important is eye contact? An important reason to focus on it is that it allows you to better read others’ body language and facial expressions.\n\n Viewing the face of the person you&amp;#39;re speaking with allows you to notice the things they say without speaking. You pick up on changes in body position, facial expressions and their eye contact; in turn, you can be more conversationally dynamic. If you read between the lines and decipher better what they mean by “listening&amp;quot; not just to their spoken thoughts but also to their unspoken ones, you can really connect with them and get much more out of the conversation.\n\n This is huge. You can be far more mindful of the current situation than you would have had you not been visually focused. That dynamism makes the conversation feel more natural. When it feels natural, you&amp;#39;ll feel comfortable- and what does comfort lead to?\n\n Confidence.\n\n Even if you don’t “feel” confident, there’s no doubt that you will give off that impression. \n\n\n &amp;quot;But I’m not really confident. People will definitely pick up on that.&amp;quot;\n\n\n At least that’s what I used to think. You’ve probably heard people toss around the stale saying “fake it till you make it.” \n\n\n I freaking hate that saying.\n\n\n It’s ridiculously overused and doesn’t make sense at face value. But… it’s true. It makes more sense when paired with this thought:\n\n\n You are not you. You are who you are perceived to be.\n\n\n You can illustrate this by thinking of your different sets of close associates. The main ones that likely come to mind are your immediate family, good friends and coworkers. Do they all treat and converse with you the same way?\n\n No, because they all have a different perception of who you are.\n\n Your coworkers at a job you disliked might think of you as “that lazy guy.” Though once you found a job you enjoyed, your new colleagues thought you were a real &amp;quot;go-getter.” Your parents will always have the perception of you as their baby in the back of their mind, while your friends know you as the buddy that always gives good advice. \n\n Even “perceived&amp;quot; confidence leads to a number of positive results. Others will give much more credence to your words when they sense how confident you seem when speaking. People have higher trust in someone that seems confident in what they’re saying than someone who gives off an air of uncertainty.\n\n Would you trust a salesman if he looked down the entire time he was talking to you? Probably not. \n\n Now, improving your eye contact is not going to happen overnight. It’s like when when I step into a swimming pool the first time of the year: it generally takes what seems like eternity. Oh, I could jump in- as literally everyone yells at me- but instead it’s one toe at a time.\n\n Then a foot.\n\n Then up to the knees.\n\n Once I’ve been waist-deep for a couple minutes, I’m so invested I’ll generally plunge the rest of my pale white body into the water.\n\n Improving your eye contact will be the same way. Now, there are many superficial articles on the benefits of good eye contact. And granted, there is some good information; but what’s the point of good information if you don’t use it?! Along that line of reasoning, I created a practical and effective exercise that will ensure significant improvement in your eye contact. \n\n Again, this takes time. The absolute minimum amount of time this process should take is two weeks. After all, it’s better to take a few small steps forward and hold your ground than to take a giant leap and fall backwards. What this process will do is gradually help you feel more comfortable with holding eye contact until you really start enjoying the benefits and it becomes habit.\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I fear that the full article is too long to post as a reply. If you found the above interesting and would like to read the rest, PM me and I&amp;#39;ll send you the full article. I also created a very clean &amp;quot;e-book&amp;quot; version that you can read on the go. Let me know if you&amp;#39;d like that and I can send it your way free of charge ;) I just have to dig up the file from my computer!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgdez9z", "score_hidden": false, "stickied": false, "created": 1492460768.0, "created_utc": 1492431968.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]