[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see a lot of incredibly negative comments posted to this sub. For example this one that I copied from another post:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I will more than likely never get a girlfriend because I&amp;#39;m not very interesting.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;ve heard this before, that your thoughts hold sway over your life, and in every regard. But until you &lt;em&gt;really&lt;/em&gt; give this idea the careful attention and consideration it deserves, it just sounds like some cliched comment that has no impact in your life. It usually looks like this &amp;quot;Think negative thoughts and you will have a negative life, think positive thoughts and you will have a positive life.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;But I like the way it was quoted by Ralph Waldo Emerson: &amp;quot;A man is what he thinks about all day long.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;This cannot be over emphasized enough. For example, 1 in 100 truly make an impact on their lives as a result of their efforts. Why is that? It isn&amp;#39;t because 99/100 lack skills or desire, it is because 99/100 have already, within their mind, decided that they can&amp;#39;t achieve at the level they want to. The result then is obvious, they don&amp;#39;t even try. If you are defeated in your mind, then you are defeated in life.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;On the other hand, those 1 out of 100 could lack knowledge, know-how, skills, and resources, but over time they build momentum from the effort they put into it so that one day, the machine they call &amp;quot;life&amp;quot; is in auto-drive.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;The following is a true story to illustrate the power of positive thinking. A man that I know that happens to be a radio personality, is very good at his job and because of this, he is financially successful. His radio show used to run between 8pm and midnight and every night after work, he would do his usual routine which was stop by 7-11, get ice cream, hand the homeless couple a few dollars, then head home and watch TV alone. He was very, very alone. He was great at his job, but he had no social skills. He was all work, and no play. And he suffered a lot because of this.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;One day he told me about the &amp;quot;amazing homeless couple&amp;quot; at 7-11. He said that everyone loved them. They were always sitting outside 7-11, they never begged, but people could see that they were homeless and so they got a lot of help in the form of cash. They talked to everyone, really talked, and really listened. Everyone that frequented that 7-11 regarded them as their friends and knew them by name, and the homeless couple knew everyone there by name too and would always greet them. The woman was always happy to tell the story of how they met, they both met as homeless individuals. I won&amp;#39;t tell you the story but suffice it to say, that the homeless man, despite having no job, no car, no income, and having a financial wreck of a life, was still extremely positive about the outlook in life. He was genuinely happy and this homeless girl took notice, and they became a &amp;quot;cute homeless couple&amp;quot; that everyone loves.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;My friend the Radio personality was depressed about this for a while. And then he was pissed... &amp;quot;how the hell is it possible for this homeless guy to get himself an attractive girl friend?&amp;quot; he would ask me when he himself, being very successful, could not find a gf.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;The answer is simple:  &amp;quot;A man is what he thinks about all day long.&amp;quot; My friend thought about the fact that he did not have a gf all day and focused on his lack of social skills, and the homeless man thought about how he was going to get a gf all day long. They both literally controlled the outcome of their lives with nothing more than a thought. It&amp;#39;s possible to excel in one aspect, and do very poorly in other aspects. In some cases, people do poorly in all aspects. One thing is certain though, if you change your social outlook, no matter what else is going on in your life, you can still have a good social life.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;You are going to think about things all day, this will happen no matter what. So if it&amp;#39;s going to happen no matter what, you might as well make those thoughts positive.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I see a lot of incredibly negative comments posted to this sub. For example this one that I copied from another post:\n\n&gt; I will more than likely never get a girlfriend because I'm not very interesting.\n\nYou've heard this before, that your thoughts hold sway over your life, and in every regard. But until you *really* give this idea the careful attention and consideration it deserves, it just sounds like some cliched comment that has no impact in your life. It usually looks like this \"Think negative thoughts and you will have a negative life, think positive thoughts and you will have a positive life.\"\n\n&amp;nbsp;\n\nBut I like the way it was quoted by Ralph Waldo Emerson: \"A man is what he thinks about all day long.\"\n\n&amp;nbsp;\n\nThis cannot be over emphasized enough. For example, 1 in 100 truly make an impact on their lives as a result of their efforts. Why is that? It isn't because 99/100 lack skills or desire, it is because 99/100 have already, within their mind, decided that they can't achieve at the level they want to. The result then is obvious, they don't even try. If you are defeated in your mind, then you are defeated in life.\n\n&amp;nbsp;\n\nOn the other hand, those 1 out of 100 could lack knowledge, know-how, skills, and resources, but over time they build momentum from the effort they put into it so that one day, the machine they call \"life\" is in auto-drive.\n\n&amp;nbsp;\n\nThe following is a true story to illustrate the power of positive thinking. A man that I know that happens to be a radio personality, is very good at his job and because of this, he is financially successful. His radio show used to run between 8pm and midnight and every night after work, he would do his usual routine which was stop by 7-11, get ice cream, hand the homeless couple a few dollars, then head home and watch TV alone. He was very, very alone. He was great at his job, but he had no social skills. He was all work, and no play. And he suffered a lot because of this.\n\n&amp;nbsp;\n\nOne day he told me about the \"amazing homeless couple\" at 7-11. He said that everyone loved them. They were always sitting outside 7-11, they never begged, but people could see that they were homeless and so they got a lot of help in the form of cash. They talked to everyone, really talked, and really listened. Everyone that frequented that 7-11 regarded them as their friends and knew them by name, and the homeless couple knew everyone there by name too and would always greet them. The woman was always happy to tell the story of how they met, they both met as homeless individuals. I won't tell you the story but suffice it to say, that the homeless man, despite having no job, no car, no income, and having a financial wreck of a life, was still extremely positive about the outlook in life. He was genuinely happy and this homeless girl took notice, and they became a \"cute homeless couple\" that everyone loves.\n\n&amp;nbsp;\n\nMy friend the Radio personality was depressed about this for a while. And then he was pissed... \"how the hell is it possible for this homeless guy to get himself an attractive girl friend?\" he would ask me when he himself, being very successful, could not find a gf.\n\n&amp;nbsp;\n\nThe answer is simple:  \"A man is what he thinks about all day long.\" My friend thought about the fact that he did not have a gf all day and focused on his lack of social skills, and the homeless man thought about how he was going to get a gf all day long. They both literally controlled the outcome of their lives with nothing more than a thought. It's possible to excel in one aspect, and do very poorly in other aspects. In some cases, people do poorly in all aspects. One thing is certain though, if you change your social outlook, no matter what else is going on in your life, you can still have a good social life.\n\n&amp;nbsp;\n\nYou are going to think about things all day, this will happen no matter what. So if it's going to happen no matter what, you might as well make those thoughts positive.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65nkn9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 135, "report_reasons": null, "author": "smplgmr", "saved": false, "mod_reports": [], "name": "t3_65nkn9", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": 1492319642.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65nkn9/the_single_best_mind_hack_you_can_do_to_change/", "num_reports": null, "locked": false, "stickied": false, "created": 1492347916.0, "url": "https://www.reddit.com/r/socialskills/comments/65nkn9/the_single_best_mind_hack_you_can_do_to_change/", "author_flair_text": null, "quarantine": false, "title": "The single best mind hack you can do to change your life. And it's easy.", "created_utc": 1492319116.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 135}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": "", "user_reports": [], "id": "dgc4pi7", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "MrGeckoTheSalamander", "parent_id": "t3_65nkn9", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I actually saw a study once that showed that, if you want to be someone's friend, thinking you will succeed at becoming their friend already makes you more likeable because you're not stressing over it.\n\nThinking like that is the easy part. The hard part is actually continuing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually saw a study once that showed that, if you want to be someone&amp;#39;s friend, thinking you will succeed at becoming their friend already makes you more likeable because you&amp;#39;re not stressing over it.&lt;/p&gt;\n\n&lt;p&gt;Thinking like that is the easy part. The hard part is actually continuing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgc4pi7", "score_hidden": false, "stickied": false, "created": 1492384353.0, "created_utc": 1492355553.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": "", "user_reports": [], "id": "dgcszce", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "snowbunnie678", "parent_id": "t1_dgcdzck", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I really like #3 forgive others. I hate it when people take their bad day out on me but I try to remind myself not to take it personally. It's not about me at all, they just collected garbage throughout the day and need somewhere to dump the garbage. (Though there is a line between occasional garbage dumps and being someone's punching bag) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really like #3 forgive others. I hate it when people take their bad day out on me but I try to remind myself not to take it personally. It&amp;#39;s not about me at all, they just collected garbage throughout the day and need somewhere to dump the garbage. (Though there is a line between occasional garbage dumps and being someone&amp;#39;s punching bag) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgcszce", "score_hidden": false, "stickied": false, "created": 1492416680.0, "created_utc": 1492387880.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": "", "user_reports": [], "id": "dgdrjzw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "smplgmr", "parent_id": "t1_dgd8589", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "&gt; maybe you know why I think about myself like this?\n\nThat's different. I've never heard anyone say that until this morning. I wish I knew. All that I can do is toss out a maybe and you've probably already thought of this.\n\n&amp;nbsp;\n\nWhatever it is, it's probably something quite deep, given the fact that you're not even sure yourself. This seems like a complete reversal of the feelings that are typical of being positive, it's as if you have negative association with being positive. But this is only the surface, what lies beneath only you know.\n\n&amp;nbsp;\n\nGoing with your phrase \"immoral\". The first thought that comes to my mind, is that maybe you see being positive, when you're not, as a form of dishonesty. For example, it has been proven that if someone is sad, and they force themselves to smile, that it can make them feel better. This is because we have an association with smiling with being happy. But it is true, that a forced smile is not an honest smile. However, it can become a real smile, once forced. I'm not recommending this BTW as I've never been a fan of it, it's better to start internally and work out, imo.\n\n&amp;nbsp;\n\nBut the truth is, I only have that one vague idea as to why you think this way. Do you always think this way? What if you are genuinely positive for a moment, does it still feel immoral, not as an exercise to combat negativity, but just naturally positive?\n\n", "edited": 1492449507.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;maybe you know why I think about myself like this?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s different. I&amp;#39;ve never heard anyone say that until this morning. I wish I knew. All that I can do is toss out a maybe and you&amp;#39;ve probably already thought of this.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Whatever it is, it&amp;#39;s probably something quite deep, given the fact that you&amp;#39;re not even sure yourself. This seems like a complete reversal of the feelings that are typical of being positive, it&amp;#39;s as if you have negative association with being positive. But this is only the surface, what lies beneath only you know.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Going with your phrase &amp;quot;immoral&amp;quot;. The first thought that comes to my mind, is that maybe you see being positive, when you&amp;#39;re not, as a form of dishonesty. For example, it has been proven that if someone is sad, and they force themselves to smile, that it can make them feel better. This is because we have an association with smiling with being happy. But it is true, that a forced smile is not an honest smile. However, it can become a real smile, once forced. I&amp;#39;m not recommending this BTW as I&amp;#39;ve never been a fan of it, it&amp;#39;s better to start internally and work out, imo.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;But the truth is, I only have that one vague idea as to why you think this way. Do you always think this way? What if you are genuinely positive for a moment, does it still feel immoral, not as an exercise to combat negativity, but just naturally positive?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgdrjzw", "score_hidden": false, "stickied": false, "created": 1492477516.0, "created_utc": 1492448716.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8589", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Amadran", "parent_id": "t1_dgcdzck", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "What if doing such things makes you feel disgusting, like you're not allowed to be positive? It even feels *immoral* - that might be a better word. This is essentially how I feel, and it causes me to not even try *any* advice of this type because just the thought of doing it makes me cringe. I'm at a point where I very, very firmly believe that I can't do anything about my mindset, but I don't know... maybe you know why I think about myself like this?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if doing such things makes you feel disgusting, like you&amp;#39;re not allowed to be positive? It even feels &lt;em&gt;immoral&lt;/em&gt; - that might be a better word. This is essentially how I feel, and it causes me to not even try &lt;em&gt;any&lt;/em&gt; advice of this type because just the thought of doing it makes me cringe. I&amp;#39;m at a point where I very, very firmly believe that I can&amp;#39;t do anything about my mindset, but I don&amp;#39;t know... maybe you know why I think about myself like this?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgd8589", "score_hidden": false, "stickied": false, "created": 1492440883.0, "created_utc": 1492412083.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdzck", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "smplgmr", "parent_id": "t1_dgc5hte", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "&gt; So how do you change your thought process to positive? I've been trying for almost a decade with the help of professionals and medication, I still can't think positive.\n\nFirst, understand a few things. Negative things have longer lasting impressions with us than positive things. It takes very little effort to stay *stuck* in the negative zone, or what I like to call \"the pit\". On the other hand it takes more effort to stay positive and the deeper the pit, the more effort it takes. You can experience something good while in the pit, feel a boost in mood, and then 5 minutes later, still be deep in the pit. This is because you are so deep, that an occasional mood improvement is not enough to get you *out* of the pit. It isn't lack of effort here, because we are all able to be positive, it is lack in *consistency* which leads to staying positive long enough to get out of the pit.\n\n&amp;nbsp;\n\nBeing in the pit for nearly a decade isn't a factor in your ability to get out, it isn't time, it is depth. The deeper you are, the harder it is to climb out. The good news is this, if you're at the bottom, then it can't get any worse. This is important because when have reached a low point, it's easier to see what is called a \"gain frame\". For example, a cup half full is focusing on the gain while the same cup seen as half empty is focusing on a \"loss frame\". The difference isn't really so much about how you view the glass, as much as it is about how you view the future of the glass. So if you are at the bottom, congratulations, it's impossible for things to get worse and the only frame left, is a gain frame. This won't get you out of the pit, but at the very least, it gets you looking up at the top of the pit. The fact that you are here, asking your question above means that you see a \"gain frame\" and that is a VERY GOOD sign.\n\n&amp;nbsp;\n\nYou have to *work* to see the upside. Just like you have to work every day to stay afloat financially, you have to work everyday to climb out of the pit. Have you been debt? It's hard to get out of debt right? And once you finally do, it's MUCH easier to stay out of debt. The same is true for this pit, it's hard to get out, but the good news is once you are out, it's much easier to stay out.\n\n&amp;nbsp;\n\nThis is how you train your mind to be more positive.\n\n1. A study at UC Davis proves that writing (or typing) for just a few minutes each day for things that are you grateful for will not only boost your happiness and well being, but even your health too. Do this once a day, just write out one thing each day that you are grateful for. Spend no more than a few minutes. But do it *once every day*.\n2. Rehearse good news. We often like to talk about the crap in our lives. How horrible our boss is, how that one guy cut us off on the freeway, how you somehow lost $20 that you were sure was in your pocket. About our jerk neighbor, and we DWELL on those things and replay them in our minds over and over again. Instead, rehearse the good things that happened, replay THOSE things in your mind. When you do this daily, you will begin to see that oftentimes your days were better than you realized.\n3. Forgive people. Bad days are contagious and when someone else is having a bad day and they snap at us then our knee jerk reaction is to snap back and then we're in a bad mood for the rest of the day too. Break that pattern, if not for others, then for yourself.\n4. Listen to \"pump\" music everyday. This is positive music. Music is a GREAT internal trigger. You can be in a great mood and listen to a sad song and then experience a mood change. The same is true if you are down and listen to positive music. Search youtube for the phrase \"pump playlist\". Find GOOD positive songs and build your own playlist. Listen to your playlist *every day*. The best time is in the morning before you start your day. Some of my favorites are: Jamie Foxx - Winner (ft. Justin Timberlake &amp; T.I.), Shawn Mendes - Life Of The Party (It starts mellow then BUILDS), Eminem - Phenomenal (The official Lyric Video is great and if you have not seen it, watch it at least once). Music is a powerful mood enhancer, top performing athletes have pump playlists that they listen to before games. Avoid down music, it's not helping you, it's keeping you in the pit.\n5. Make eye contact with people, friends and strangers alike. Hold that eye contact for at least a couple of seconds and don't overthink the way people react to it. Many will look away. And when they don't, acknowledge them with a smile and a head nod or simply by saying \"hi\". Do this EVERY DAY.\n6. Improve something in your life. Anything. It doesn't have to be major. Buying a new shirt to replace some old thing for example is an investment in your appearance. Make it a point to learn new things, this is an improvement in your knowledge base. We're all students, Ted Talks on youtube are great and you can learn so much. We all have limits, be the best *you* that you can be. You will start to feel better about yourself. But this too takes time. Take small steps. As they say, a journey of a 1000 miles begins with a single step.\n\n&amp;nbsp;\n\nDo all of the things above daily. Don't expect miracles. Even if you listen to pump music for an hour for example, 10 min later you can be down again. It takes time, the most important thing here is consistency. Do these things daily. When you feel like you're doing well with the items above, then continue *working*; search youtube with the phrase \"how to be positive\" and \"how to be positive tedtalk\". There are a lot of great and very informative videos out there.", "edited": 1492368627.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So how do you change your thought process to positive? I&amp;#39;ve been trying for almost a decade with the help of professionals and medication, I still can&amp;#39;t think positive.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;First, understand a few things. Negative things have longer lasting impressions with us than positive things. It takes very little effort to stay &lt;em&gt;stuck&lt;/em&gt; in the negative zone, or what I like to call &amp;quot;the pit&amp;quot;. On the other hand it takes more effort to stay positive and the deeper the pit, the more effort it takes. You can experience something good while in the pit, feel a boost in mood, and then 5 minutes later, still be deep in the pit. This is because you are so deep, that an occasional mood improvement is not enough to get you &lt;em&gt;out&lt;/em&gt; of the pit. It isn&amp;#39;t lack of effort here, because we are all able to be positive, it is lack in &lt;em&gt;consistency&lt;/em&gt; which leads to staying positive long enough to get out of the pit.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Being in the pit for nearly a decade isn&amp;#39;t a factor in your ability to get out, it isn&amp;#39;t time, it is depth. The deeper you are, the harder it is to climb out. The good news is this, if you&amp;#39;re at the bottom, then it can&amp;#39;t get any worse. This is important because when have reached a low point, it&amp;#39;s easier to see what is called a &amp;quot;gain frame&amp;quot;. For example, a cup half full is focusing on the gain while the same cup seen as half empty is focusing on a &amp;quot;loss frame&amp;quot;. The difference isn&amp;#39;t really so much about how you view the glass, as much as it is about how you view the future of the glass. So if you are at the bottom, congratulations, it&amp;#39;s impossible for things to get worse and the only frame left, is a gain frame. This won&amp;#39;t get you out of the pit, but at the very least, it gets you looking up at the top of the pit. The fact that you are here, asking your question above means that you see a &amp;quot;gain frame&amp;quot; and that is a VERY GOOD sign.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;You have to &lt;em&gt;work&lt;/em&gt; to see the upside. Just like you have to work every day to stay afloat financially, you have to work everyday to climb out of the pit. Have you been debt? It&amp;#39;s hard to get out of debt right? And once you finally do, it&amp;#39;s MUCH easier to stay out of debt. The same is true for this pit, it&amp;#39;s hard to get out, but the good news is once you are out, it&amp;#39;s much easier to stay out.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;This is how you train your mind to be more positive.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;A study at UC Davis proves that writing (or typing) for just a few minutes each day for things that are you grateful for will not only boost your happiness and well being, but even your health too. Do this once a day, just write out one thing each day that you are grateful for. Spend no more than a few minutes. But do it &lt;em&gt;once every day&lt;/em&gt;.&lt;/li&gt;\n&lt;li&gt;Rehearse good news. We often like to talk about the crap in our lives. How horrible our boss is, how that one guy cut us off on the freeway, how you somehow lost $20 that you were sure was in your pocket. About our jerk neighbor, and we DWELL on those things and replay them in our minds over and over again. Instead, rehearse the good things that happened, replay THOSE things in your mind. When you do this daily, you will begin to see that oftentimes your days were better than you realized.&lt;/li&gt;\n&lt;li&gt;Forgive people. Bad days are contagious and when someone else is having a bad day and they snap at us then our knee jerk reaction is to snap back and then we&amp;#39;re in a bad mood for the rest of the day too. Break that pattern, if not for others, then for yourself.&lt;/li&gt;\n&lt;li&gt;Listen to &amp;quot;pump&amp;quot; music everyday. This is positive music. Music is a GREAT internal trigger. You can be in a great mood and listen to a sad song and then experience a mood change. The same is true if you are down and listen to positive music. Search youtube for the phrase &amp;quot;pump playlist&amp;quot;. Find GOOD positive songs and build your own playlist. Listen to your playlist &lt;em&gt;every day&lt;/em&gt;. The best time is in the morning before you start your day. Some of my favorites are: Jamie Foxx - Winner (ft. Justin Timberlake &amp;amp; T.I.), Shawn Mendes - Life Of The Party (It starts mellow then BUILDS), Eminem - Phenomenal (The official Lyric Video is great and if you have not seen it, watch it at least once). Music is a powerful mood enhancer, top performing athletes have pump playlists that they listen to before games. Avoid down music, it&amp;#39;s not helping you, it&amp;#39;s keeping you in the pit.&lt;/li&gt;\n&lt;li&gt;Make eye contact with people, friends and strangers alike. Hold that eye contact for at least a couple of seconds and don&amp;#39;t overthink the way people react to it. Many will look away. And when they don&amp;#39;t, acknowledge them with a smile and a head nod or simply by saying &amp;quot;hi&amp;quot;. Do this EVERY DAY.&lt;/li&gt;\n&lt;li&gt;Improve something in your life. Anything. It doesn&amp;#39;t have to be major. Buying a new shirt to replace some old thing for example is an investment in your appearance. Make it a point to learn new things, this is an improvement in your knowledge base. We&amp;#39;re all students, Ted Talks on youtube are great and you can learn so much. We all have limits, be the best &lt;em&gt;you&lt;/em&gt; that you can be. You will start to feel better about yourself. But this too takes time. Take small steps. As they say, a journey of a 1000 miles begins with a single step.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Do all of the things above daily. Don&amp;#39;t expect miracles. Even if you listen to pump music for an hour for example, 10 min later you can be down again. It takes time, the most important thing here is consistency. Do these things daily. When you feel like you&amp;#39;re doing well with the items above, then continue &lt;em&gt;working&lt;/em&gt;; search youtube with the phrase &amp;quot;how to be positive&amp;quot; and &amp;quot;how to be positive tedtalk&amp;quot;. There are a lot of great and very informative videos out there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgcdzck", "score_hidden": false, "stickied": false, "created": 1492396731.0, "created_utc": 1492367931.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": "", "user_reports": [], "id": "dgcb0gg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "cavanc3", "parent_id": "t1_dgc5hte", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "It's a slow processs. I think if you attempt to continually dedicate some time out of your day to thinking positively, over time it will be habitual. Best of luck! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a slow processs. I think if you attempt to continually dedicate some time out of your day to thinking positively, over time it will be habitual. Best of luck! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgcb0gg", "score_hidden": false, "stickied": false, "created": 1492392779.0, "created_utc": 1492363979.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": "", "user_reports": [], "id": "dgcdu82", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "biscuitfiends", "parent_id": "t1_dgc5hte", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Professionals and medication are no substitute for reading, IMO", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Professionals and medication are no substitute for reading, IMO&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgcdu82", "score_hidden": false, "stickied": false, "created": 1492396534.0, "created_utc": 1492367734.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc5hte", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "cheecheyed", "parent_id": "t3_65nkn9", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "So how do you change your thought process to positive? I've been trying for almost a decade with the help of professionals and medication, I still can't think positive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So how do you change your thought process to positive? I&amp;#39;ve been trying for almost a decade with the help of professionals and medication, I still can&amp;#39;t think positive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgc5hte", "score_hidden": false, "stickied": false, "created": 1492385448.0, "created_utc": 1492356648.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": "", "user_reports": [], "id": "dgbvi6f", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "thesamy2", "parent_id": "t3_65nkn9", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I did this without knowing the out come.\nI'm kinda bad at talking to people, and this is what stopping me to be happier..\n\nSo I toke the frostration and the obssesion and made it a mission to improve.\nIn every situstion, I try to talk more.\nI see a slow progress, but I feel much better and comfrtuble saying stuff that I didnt had the guts to say to stranger, and friends.\n\nI'm getting heppier becuas of it.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did this without knowing the out come.\nI&amp;#39;m kinda bad at talking to people, and this is what stopping me to be happier..&lt;/p&gt;\n\n&lt;p&gt;So I toke the frostration and the obssesion and made it a mission to improve.\nIn every situstion, I try to talk more.\nI see a slow progress, but I feel much better and comfrtuble saying stuff that I didnt had the guts to say to stranger, and friends.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m getting heppier becuas of it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgbvi6f", "score_hidden": false, "stickied": false, "created": 1492362933.0, "created_utc": 1492334133.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": "", "user_reports": [], "id": "dgcd9tc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jigermoo", "parent_id": "t3_65nkn9", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Keep in mind though that some people, like those with depression, might find it difficult to start thinking positively. To those people I would recommend to first set the bar lower, and instead try to just stop thinking negatively. Eventually once you stop putting a negative spin on life, and start seeing life the way it is, it will become much easier to think positively later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Keep in mind though that some people, like those with depression, might find it difficult to start thinking positively. To those people I would recommend to first set the bar lower, and instead try to just stop thinking negatively. Eventually once you stop putting a negative spin on life, and start seeing life the way it is, it will become much easier to think positively later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgcd9tc", "score_hidden": false, "stickied": false, "created": 1492395771.0, "created_utc": 1492366971.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": "", "user_reports": [], "id": "dge736x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wonderlandgirl111", "parent_id": "t3_65nkn9", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Just become \"like\" all the people that have succeeded at what you want", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just become &amp;quot;like&amp;quot; all the people that have succeeded at what you want&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dge736x", "score_hidden": false, "stickied": false, "created": 1492495203.0, "created_utc": 1492466403.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": "", "user_reports": [], "id": "dgcx8le", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "smplgmr", "parent_id": "t1_dgcwtm8", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "What makes you think it took long to type? And there is no correlation between the time it took to type it vs how much effort it takes to achieve it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What makes you think it took long to type? And there is no correlation between the time it took to type it vs how much effort it takes to achieve it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgcx8le", "score_hidden": false, "stickied": false, "created": 1492422301.0, "created_utc": 1492393501.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65nkn9", "likes": null, "replies": "", "user_reports": [], "id": "dgd7g1t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sociallyinept-", "parent_id": "t1_dgcwtm8", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "There's literally a whole book written called \"the power of now\" with hundreds of pages that talk about the simple concept of staying in the moment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s literally a whole book written called &amp;quot;the power of now&amp;quot; with hundreds of pages that talk about the simple concept of staying in the moment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgd7g1t", "score_hidden": false, "stickied": false, "created": 1492439232.0, "created_utc": 1492410432.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwtm8", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "icegun784", "parent_id": "t3_65nkn9", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "If it's so easy why does it take so long to write?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it&amp;#39;s so easy why does it take so long to write?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgcwtm8", "score_hidden": false, "stickied": false, "created": 1492421737.0, "created_utc": 1492392937.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]