[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am 20 years old, and my whole life I have felt like I dont have enough friends, I dont have very strong relationships to any other males at this moment and feel like I am not going out enough, dont have own &amp;quot;friend group&amp;quot;. I feel depressed about these things alot, daily.&lt;/p&gt;\n\n&lt;p&gt;I dont know why, but I get very jealous and sad every weekend when I watch my old friends snapchat mystories I used to hang out with years ago, going to party/club and drinking and see how they have nice friend groups and people to hang out with, belong somewhere, but I just play videogames all weekend or go to the gym..&lt;/p&gt;\n\n&lt;p&gt;I feel everyday I am wasting my life everyday and wake up sad. I do fun things now and then, go to laser tag or swimming with my girlfriend, but that does not help the feeling... I am in my 20s, should be best time of my life???&lt;/p&gt;\n\n&lt;p&gt;If I dont see mystories and people just be chilling at home without partying with their own friends, I feel good. What the hell is wrong with me? I get extremely jealous everytime anyone does anything! Is there word for someone like me? I dont want to be this way.&lt;/p&gt;\n\n&lt;p&gt;All my &amp;quot;old&amp;quot; friends who I used to hang out with now have own friend groups from schools and workplaces, and I dont have so much in common with these friends anymore. I have like these seperate friends, who all has own friend groups and I see them now and then but most of the time they hang out with their friend groups. &lt;/p&gt;\n\n&lt;p&gt;I belonged to some kind of friend group like an year ago, and we got together alot, but my girlfriend and other girl in the group had some serious problems with each other, and we kinda seperated then with my girlfriend from this friend group... I took my girlfriends side, the other girl was not doing right to my girlfriend. Other friends of that group stayed with those girls, and they still hang out, they kinda took the other side and me and my girlfriend got left out. I dont like them alot either, some of them smoked weed and took ecstasy and stuff, and that is not my thing. I dont like it, and dont want to be their friend anymore.&lt;/p&gt;\n\n&lt;p&gt;Couple friends of this group is still my friends too, we text to each other, but dont see each other, cuz I dont want to hang out with that group anymore. Also I feel like all of these friends is trying to compete with me some kind of way, all of our conversations is about what they have achieved and how much fun they had in a party. I cant win that competition since I dont have life, so they just make me feel bad.&lt;/p&gt;\n\n&lt;p&gt;I have these seperate friendships from schools who I see once in a while and am not very close to, but I would like to have friend or friends who is allways down with me, and is loyal and want to do stuff with me every weekend. I have girlfriend who I hang out with alot, but I need male friends desperately and some kind of group to belong to. I have to think about my relationship with this girl too, we have alot of problems, but that is another long story to tell... &lt;/p&gt;\n\n&lt;p&gt;Idk why I tell this but I am very handsome and good looking (I have hottest girlfriend ever XD), I  am stylish, dress up like most of people, and I workout alot so I have nice body. But I think this is my biggest problem with making friends, I am very shallow, and I know its not right, and all people are the same. If I have to speak some kind of nerd looking guy, who seem like dont have alot of friends, I am comfortable and can easily talk without anxiety and get to know them, or for example older people like my mothers age. But if I am speaking with some good looking guys or girls I have alot of anxiety and trouble speaking and start to shake or some weird shit. I am too self conscious, I cant focus and sometimes I just freeze in conversations, and I analyze everything I say to see if its weird or something. Last time I met new person, I noticed my hand was shaking alot when I drank water in front of him, and this stupid little thing got me thinking &amp;quot;he must think I am weird and social awkward creep now&amp;quot; or something, and I just told I have to go to bathroom and left. &lt;/p&gt;\n\n&lt;p&gt;I have to get rid of this shallow thing, its horrible I think good looking people are better and cooler than others... I also feel I dont want to be friends with weird not so good looking people I know that it shouldnt be this way. I also feel like I am the weird person on earth atleast when I first time meet the new people.&lt;/p&gt;\n\n&lt;p&gt;I have pretty low self confidence, suck at all sports, I was bullied at ages of 10-13, then move to another place. I go to gym, play videogames or chill with my girlfriend 24/7, and I dont feel happy this way, idk, I need something to belong to I think.&lt;/p&gt;\n\n&lt;p&gt;Worst is the weekends, when everyone is getting together with their friends and going out. I want to hang out too and get drunk and party all night or something.&lt;/p&gt;\n\n&lt;p&gt;I also think I am very funny to the people I am comfortable with. I think I would be very good friend to people, people can talk to me about their problems, I am very loyal.&lt;/p&gt;\n\n&lt;p&gt;I am not working anywhere now, I graduated from school in december, and after that I have felt like this. I have been doing nothing for 5 months now. I am starting working in new place week from now, in amusement park as a ticket seller where is alot of people my age. But most of them are girls, and I will be working with girls most of the time. Worst is talking to good looking girls, those situations I cant be myself, I transform to this weird guy and cant think anything to say.&lt;/p&gt;\n\n&lt;p&gt;I know I can get friends to hang out with, because I have had them before. But I just feel so awkward talking to new people... I would like to just skip to the part where I have good friend and we do fun stuff... =( &lt;/p&gt;\n\n&lt;p&gt;Sorry for long text, this is only place I can talk about this... I dont know why but I would feel ashamed to talk about this to my family or someone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am 20 years old, and my whole life I have felt like I dont have enough friends, I dont have very strong relationships to any other males at this moment and feel like I am not going out enough, dont have own \"friend group\". I feel depressed about these things alot, daily.\n\nI dont know why, but I get very jealous and sad every weekend when I watch my old friends snapchat mystories I used to hang out with years ago, going to party/club and drinking and see how they have nice friend groups and people to hang out with, belong somewhere, but I just play videogames all weekend or go to the gym..\n\nI feel everyday I am wasting my life everyday and wake up sad. I do fun things now and then, go to laser tag or swimming with my girlfriend, but that does not help the feeling... I am in my 20s, should be best time of my life???\n\nIf I dont see mystories and people just be chilling at home without partying with their own friends, I feel good. What the hell is wrong with me? I get extremely jealous everytime anyone does anything! Is there word for someone like me? I dont want to be this way.\n\nAll my \"old\" friends who I used to hang out with now have own friend groups from schools and workplaces, and I dont have so much in common with these friends anymore. I have like these seperate friends, who all has own friend groups and I see them now and then but most of the time they hang out with their friend groups. \n\nI belonged to some kind of friend group like an year ago, and we got together alot, but my girlfriend and other girl in the group had some serious problems with each other, and we kinda seperated then with my girlfriend from this friend group... I took my girlfriends side, the other girl was not doing right to my girlfriend. Other friends of that group stayed with those girls, and they still hang out, they kinda took the other side and me and my girlfriend got left out. I dont like them alot either, some of them smoked weed and took ecstasy and stuff, and that is not my thing. I dont like it, and dont want to be their friend anymore.\n\nCouple friends of this group is still my friends too, we text to each other, but dont see each other, cuz I dont want to hang out with that group anymore. Also I feel like all of these friends is trying to compete with me some kind of way, all of our conversations is about what they have achieved and how much fun they had in a party. I cant win that competition since I dont have life, so they just make me feel bad.\n\nI have these seperate friendships from schools who I see once in a while and am not very close to, but I would like to have friend or friends who is allways down with me, and is loyal and want to do stuff with me every weekend. I have girlfriend who I hang out with alot, but I need male friends desperately and some kind of group to belong to. I have to think about my relationship with this girl too, we have alot of problems, but that is another long story to tell... \n\nIdk why I tell this but I am very handsome and good looking (I have hottest girlfriend ever XD), I  am stylish, dress up like most of people, and I workout alot so I have nice body. But I think this is my biggest problem with making friends, I am very shallow, and I know its not right, and all people are the same. If I have to speak some kind of nerd looking guy, who seem like dont have alot of friends, I am comfortable and can easily talk without anxiety and get to know them, or for example older people like my mothers age. But if I am speaking with some good looking guys or girls I have alot of anxiety and trouble speaking and start to shake or some weird shit. I am too self conscious, I cant focus and sometimes I just freeze in conversations, and I analyze everything I say to see if its weird or something. Last time I met new person, I noticed my hand was shaking alot when I drank water in front of him, and this stupid little thing got me thinking \"he must think I am weird and social awkward creep now\" or something, and I just told I have to go to bathroom and left. \n\nI have to get rid of this shallow thing, its horrible I think good looking people are better and cooler than others... I also feel I dont want to be friends with weird not so good looking people I know that it shouldnt be this way. I also feel like I am the weird person on earth atleast when I first time meet the new people.\n\nI have pretty low self confidence, suck at all sports, I was bullied at ages of 10-13, then move to another place. I go to gym, play videogames or chill with my girlfriend 24/7, and I dont feel happy this way, idk, I need something to belong to I think.\n\nWorst is the weekends, when everyone is getting together with their friends and going out. I want to hang out too and get drunk and party all night or something.\n\nI also think I am very funny to the people I am comfortable with. I think I would be very good friend to people, people can talk to me about their problems, I am very loyal.\n\nI am not working anywhere now, I graduated from school in december, and after that I have felt like this. I have been doing nothing for 5 months now. I am starting working in new place week from now, in amusement park as a ticket seller where is alot of people my age. But most of them are girls, and I will be working with girls most of the time. Worst is talking to good looking girls, those situations I cant be myself, I transform to this weird guy and cant think anything to say.\n\nI know I can get friends to hang out with, because I have had them before. But I just feel so awkward talking to new people... I would like to just skip to the part where I have good friend and we do fun stuff... =( \n\nSorry for long text, this is only place I can talk about this... I dont know why but I would feel ashamed to talk about this to my family or someone.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65qyg7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 57, "report_reasons": null, "author": "99ohSnap", "saved": false, "mod_reports": [], "name": "t3_65qyg7", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65qyg7/i_need_new_friends_to_go_out_and_hang_out_with_how/", "num_reports": null, "locked": false, "stickied": false, "created": 1492400345.0, "url": "https://www.reddit.com/r/socialskills/comments/65qyg7/i_need_new_friends_to_go_out_and_hang_out_with_how/", "author_flair_text": null, "quarantine": false, "title": "I need new friends to go out and hang out with, how?", "created_utc": 1492371545.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 57}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65qyg7", "likes": null, "replies": "", "user_reports": [], "id": "dgd1kz6", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "menotyoutoo", "parent_id": "t3_65qyg7", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "There's no magic Bullet to not feeling awkward or anxious around people. You just have to keep doing it and it slowly gets easier and less stressful. \n\nHobbies can be a great way to meet new people. Doesn't matter what it is as long as it's something you enjoy and it's something that works better with multiple people. If you play an instrument join a band, like flying quadcopters then find a local flying club, like Sports then join a local team etc. I find Hobbies work great because you already have a shared interest with those other people and have something you all enjoy discussing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s no magic Bullet to not feeling awkward or anxious around people. You just have to keep doing it and it slowly gets easier and less stressful. &lt;/p&gt;\n\n&lt;p&gt;Hobbies can be a great way to meet new people. Doesn&amp;#39;t matter what it is as long as it&amp;#39;s something you enjoy and it&amp;#39;s something that works better with multiple people. If you play an instrument join a band, like flying quadcopters then find a local flying club, like Sports then join a local team etc. I find Hobbies work great because you already have a shared interest with those other people and have something you all enjoy discussing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgd1kz6", "score_hidden": false, "stickied": false, "created": 1492428420.0, "created_utc": 1492399620.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65qyg7", "likes": null, "replies": "", "user_reports": [], "id": "dgd2qbw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lucid_Crow", "parent_id": "t3_65qyg7", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "You want a friend with similar interests that you are comfortable with and can hang out with. However your method of doing that sounds like putting yourself out there for random strangers to accept or reject you.  That sounds absolutely exhausting.  Really it sounds like dating lol.  That is not how to go about it.  It's no wonder you get nervous, you are going on the equivalent of job interviews and first dates to make friends.  Everyone gets nervous in those situations, that doesn't make you weird lol.\n\n\nMost of the friends I've had were the result of both of us going to same places often and meeting each other.  My best friend in high school was just the kid that lived near me and therefore had the same bus stop.  College my best friends were just people that happened to be in the same dorm or class.  After college, roommates and coworkers.  I also make a lot of friends just by attending the same concert venues a lot (live music is kind of my hobby).  You're comfortable in those environments, so you don't get as nervous, and you automatically have something in common.  So just introduce yourself and be friendly with the people that you naturally see most often.\n\nAlso ask yourself what you really like.  Do you really like the bar and club scene, and the people that frequent those places?  Maybe you'd rather meet people at church, at a casual sports league, or a concert.  Or, become a regular at a couple places where you like the crowd, so you run into the same people more often.  I go to the same two local music venues here in DC and pretty quickly met the other regulars.  Friendships tend to evolve more naturally from everyday activities.  Don't treat it like dating.", "edited": 1492426301.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You want a friend with similar interests that you are comfortable with and can hang out with. However your method of doing that sounds like putting yourself out there for random strangers to accept or reject you.  That sounds absolutely exhausting.  Really it sounds like dating lol.  That is not how to go about it.  It&amp;#39;s no wonder you get nervous, you are going on the equivalent of job interviews and first dates to make friends.  Everyone gets nervous in those situations, that doesn&amp;#39;t make you weird lol.&lt;/p&gt;\n\n&lt;p&gt;Most of the friends I&amp;#39;ve had were the result of both of us going to same places often and meeting each other.  My best friend in high school was just the kid that lived near me and therefore had the same bus stop.  College my best friends were just people that happened to be in the same dorm or class.  After college, roommates and coworkers.  I also make a lot of friends just by attending the same concert venues a lot (live music is kind of my hobby).  You&amp;#39;re comfortable in those environments, so you don&amp;#39;t get as nervous, and you automatically have something in common.  So just introduce yourself and be friendly with the people that you naturally see most often.&lt;/p&gt;\n\n&lt;p&gt;Also ask yourself what you really like.  Do you really like the bar and club scene, and the people that frequent those places?  Maybe you&amp;#39;d rather meet people at church, at a casual sports league, or a concert.  Or, become a regular at a couple places where you like the crowd, so you run into the same people more often.  I go to the same two local music venues here in DC and pretty quickly met the other regulars.  Friendships tend to evolve more naturally from everyday activities.  Don&amp;#39;t treat it like dating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgd2qbw", "score_hidden": false, "stickied": false, "created": 1492430168.0, "created_utc": 1492401368.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65qyg7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65qyg7", "likes": null, "replies": "", "user_reports": [], "id": "dgd2197", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "DellaAbel", "parent_id": "t1_dgd1wc6", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Or you can stop comparing yourself to other people's highlight reels. They're probably sitting at home doing jack shit most of the time too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or you can stop comparing yourself to other people&amp;#39;s highlight reels. They&amp;#39;re probably sitting at home doing jack shit most of the time too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgd2197", "score_hidden": false, "stickied": false, "created": 1492429086.0, "created_utc": 1492400286.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd1wc6", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Your_Gym_Crush", "parent_id": "t3_65qyg7", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Delete Snapchat/SocialMedia.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Delete Snapchat/SocialMedia.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgd1wc6", "score_hidden": false, "stickied": false, "created": 1492428884.0, "created_utc": 1492400084.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65qyg7", "likes": null, "replies": "", "user_reports": [], "id": "dgd60bi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "namelock12", "parent_id": "t3_65qyg7", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I can really relate to this. Hang in there pal!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can really relate to this. Hang in there pal!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgd60bi", "score_hidden": false, "stickied": false, "created": 1492436148.0, "created_utc": 1492407348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65qyg7", "likes": null, "replies": "", "user_reports": [], "id": "dgd2wi5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "trauma_kmart", "parent_id": "t3_65qyg7", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Find something you're passionate about and find others who share the same passions. It's the easiest way to find friends that you actually really enjoy being around since you can talk on and on about your shared passion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Find something you&amp;#39;re passionate about and find others who share the same passions. It&amp;#39;s the easiest way to find friends that you actually really enjoy being around since you can talk on and on about your shared passion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgd2wi5", "score_hidden": false, "stickied": false, "created": 1492430449.0, "created_utc": 1492401649.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65qyg7", "likes": null, "replies": "", "user_reports": [], "id": "dgd4xy7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theshiznut", "parent_id": "t3_65qyg7", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "You're good looking and you know it, get over that hump and humble yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re good looking and you know it, get over that hump and humble yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgd4xy7", "score_hidden": false, "stickied": false, "created": 1492434013.0, "created_utc": 1492405213.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65qyg7", "likes": null, "replies": "", "user_reports": [], "id": "dge71m2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wonderlandgirl111", "parent_id": "t3_65qyg7", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Just keep trying.  Some people you'll feel like OMG they are the PERFECT friend we have EVERYTHING in common!!!  But then they ghost you.  People are weird.  Its mostly a numbers game", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just keep trying.  Some people you&amp;#39;ll feel like OMG they are the PERFECT friend we have EVERYTHING in common!!!  But then they ghost you.  People are weird.  Its mostly a numbers game&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dge71m2", "score_hidden": false, "stickied": false, "created": 1492495148.0, "created_utc": 1492466348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]