[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this summer I&amp;#39;m moving to a new school yet again and therefore will be left without friends. I&amp;#39;ve made friends three times before from moving but that was when I was much younger, and now I&amp;#39;ve completely forgotten how I actually did it. As well, after getting out of the first real relationship I had been in I grew bitter and cut a lot of people off, and have generally been rude to those who I didn&amp;#39;t. Wasn&amp;#39;t the best for keeping friends in hindsight. But due to that I&amp;#39;ve lost a lot of social skills and can barely hold a conversation, answering very quickly and shortly then staying silent. However, when I&amp;#39;m alone I can go on for hours talking to myself about a single subject or branch off into others, but when I&amp;#39;m around people I just lock up. I know that I have no chance at this school, I&amp;#39;ve already messed that up long ago, but I&amp;#39;m a rather co-dependent person and would very much like to have those friends again. I&amp;#39;ve tried googling it but a lot of stuff doesn&amp;#39;t fit my situation and is more focused on outgoing people. Really just any advice in how to talk to and build relationships with people while having no idea how to would be appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So this summer I'm moving to a new school yet again and therefore will be left without friends. I've made friends three times before from moving but that was when I was much younger, and now I've completely forgotten how I actually did it. As well, after getting out of the first real relationship I had been in I grew bitter and cut a lot of people off, and have generally been rude to those who I didn't. Wasn't the best for keeping friends in hindsight. But due to that I've lost a lot of social skills and can barely hold a conversation, answering very quickly and shortly then staying silent. However, when I'm alone I can go on for hours talking to myself about a single subject or branch off into others, but when I'm around people I just lock up. I know that I have no chance at this school, I've already messed that up long ago, but I'm a rather co-dependent person and would very much like to have those friends again. I've tried googling it but a lot of stuff doesn't fit my situation and is more focused on outgoing people. Really just any advice in how to talk to and build relationships with people while having no idea how to would be appreciated.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65y49j", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "Universe13", "saved": false, "mod_reports": [], "name": "t3_65y49j", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65y49j/how_to_make_friends_with_little_to_no_social/", "num_reports": null, "locked": false, "stickied": false, "created": 1492489612.0, "url": "https://www.reddit.com/r/socialskills/comments/65y49j/how_to_make_friends_with_little_to_no_social/", "author_flair_text": null, "quarantine": false, "title": "How to make friends with little to no social skills?", "created_utc": 1492460812.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65y49j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65y49j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65y49j", "likes": null, "replies": "", "user_reports": [], "id": "dge2yow", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "skiptomylou1231", "parent_id": "t1_dge2or9", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Yeah easier said than done of course, but just try to really view the new school as a clean slate.  Don't project prior relationships and friends on the new people you meet.  Nothing good in life comes easy/free so really make an effort to meet people.  Always keep a positive attitude, take the initiative (especially as the new kid), join clubs or sports teams that you're interested in, and just force yourself out of your comfort zone.\n\nIt's all easier said than done and I know but typically, confidence comes from experience.  It's a catch-22 because if you don't have any experience, you have less confidence and if you have less confidence, things are harder for you naturally.  Just don't fret on awkward encounters or if you said anything awkward or corny.  You're not going to get along with everybody and there are always going to be assholes (especially in middle school/high school) but you can only worry about what you can control right?\n\nA lot of this is probably advice you heard already but most of it is just effort.  Most people with poor social skills on this subreddit don't necessarily don't know how to talk to people.  They just tend to be very passive and don't make any effort to actually engage other people.  You just can't wait for other people to approach you sometimes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah easier said than done of course, but just try to really view the new school as a clean slate.  Don&amp;#39;t project prior relationships and friends on the new people you meet.  Nothing good in life comes easy/free so really make an effort to meet people.  Always keep a positive attitude, take the initiative (especially as the new kid), join clubs or sports teams that you&amp;#39;re interested in, and just force yourself out of your comfort zone.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s all easier said than done and I know but typically, confidence comes from experience.  It&amp;#39;s a catch-22 because if you don&amp;#39;t have any experience, you have less confidence and if you have less confidence, things are harder for you naturally.  Just don&amp;#39;t fret on awkward encounters or if you said anything awkward or corny.  You&amp;#39;re not going to get along with everybody and there are always going to be assholes (especially in middle school/high school) but you can only worry about what you can control right?&lt;/p&gt;\n\n&lt;p&gt;A lot of this is probably advice you heard already but most of it is just effort.  Most people with poor social skills on this subreddit don&amp;#39;t necessarily don&amp;#39;t know how to talk to people.  They just tend to be very passive and don&amp;#39;t make any effort to actually engage other people.  You just can&amp;#39;t wait for other people to approach you sometimes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dge2yow", "score_hidden": false, "stickied": false, "created": 1492490298.0, "created_utc": 1492461498.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge2or9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Universe13", "parent_id": "t1_dge2hvw", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Sorry, I messed up that wording a bit. What I meant to say was that I know I have no chance at my current school at making friends, as I've already made too many mistakes here. But yeah, I do think a fresh start would be beneficial. The unfortunate thing is that bitterness and rudeness has come through in my regular mood and talking to people, so I'll have to get that worked out first thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, I messed up that wording a bit. What I meant to say was that I know I have no chance at my current school at making friends, as I&amp;#39;ve already made too many mistakes here. But yeah, I do think a fresh start would be beneficial. The unfortunate thing is that bitterness and rudeness has come through in my regular mood and talking to people, so I&amp;#39;ll have to get that worked out first thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dge2or9", "score_hidden": false, "stickied": false, "created": 1492489987.0, "created_utc": 1492461187.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge2hvw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "skiptomylou1231", "parent_id": "t3_65y49j", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "I'm confused reading this.  You're moving to a new school right?  So why do you think you have no chance already or are you referring to your current school?  In any case, maybe a fresh start will be good for you especially if it lets you let go of some of your bad prior experiences.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m confused reading this.  You&amp;#39;re moving to a new school right?  So why do you think you have no chance already or are you referring to your current school?  In any case, maybe a fresh start will be good for you especially if it lets you let go of some of your bad prior experiences.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dge2hvw", "score_hidden": false, "stickied": false, "created": 1492489772.0, "created_utc": 1492460972.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65y49j", "likes": null, "replies": "", "user_reports": [], "id": "dge9mq1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Anen-o-me", "parent_id": "t3_65y49j", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Get a dog.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get a dog.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dge9mq1", "score_hidden": false, "stickied": false, "created": 1492498474.0, "created_utc": 1492469674.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]