[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, here&amp;#39;s my problem, or what I think might be my problem. &lt;/p&gt;\n\n&lt;p&gt;Let me describe my social skills first. In any company, I&amp;#39;m usually the one cracking the witty, sarcastic jokes, sometimes at my own or at others&amp;#39; expense. I&amp;#39;m not socially awkward, but I&amp;#39;m introverted, and I generally appear pretty nonchalant and sometimes even bored. I just kind of watch whatever&amp;#39;s happening around me, and if I speak, it&amp;#39;s probably some sarcastic joke said in a monotone voice. &lt;/p&gt;\n\n&lt;p&gt;People often find me the funniest in the group, but somehow I still feel a bit... left out. Everyone&amp;#39;s laughing freely and they all have a favorite person in the room, either an SO or best friend, and I&amp;#39;m nobody&amp;#39;s favorite person because of how distant and unapproachable I always seem. They all like me, but somehow, I feel less important than anyone else there. It&amp;#39;s a bit like I&amp;#39;m not even there, even though I often dominate conversations and stuff. &lt;/p&gt;\n\n&lt;p&gt;I feel like what I have is not something that people are looking for in the longterm. They like my company and my &amp;quot;edgy&amp;quot; sense of humour and my laid-back smirks, as long as they don&amp;#39;t have to look at it for the rest of their life. For a best friend or date, they want someone that is friendly and, I don&amp;#39;t know, someone that seems happier, maybe. I&amp;#39;m happy, I swear. I&amp;#39;m just an introvert and it doesn&amp;#39;t show.&lt;/p&gt;\n\n&lt;p&gt;Basically, I don&amp;#39;t like being at the center of attention, so I&amp;#39;m never at the center of attention. But nowadays this flower wants to get off the wall, you know? I don&amp;#39;t know, thinking about this made me really sad. It feels lonely.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, here's my problem, or what I think might be my problem. \n\nLet me describe my social skills first. In any company, I'm usually the one cracking the witty, sarcastic jokes, sometimes at my own or at others' expense. I'm not socially awkward, but I'm introverted, and I generally appear pretty nonchalant and sometimes even bored. I just kind of watch whatever's happening around me, and if I speak, it's probably some sarcastic joke said in a monotone voice. \n\nPeople often find me the funniest in the group, but somehow I still feel a bit... left out. Everyone's laughing freely and they all have a favorite person in the room, either an SO or best friend, and I'm nobody's favorite person because of how distant and unapproachable I always seem. They all like me, but somehow, I feel less important than anyone else there. It's a bit like I'm not even there, even though I often dominate conversations and stuff. \n\nI feel like what I have is not something that people are looking for in the longterm. They like my company and my \"edgy\" sense of humour and my laid-back smirks, as long as they don't have to look at it for the rest of their life. For a best friend or date, they want someone that is friendly and, I don't know, someone that seems happier, maybe. I'm happy, I swear. I'm just an introvert and it doesn't show.\n\nBasically, I don't like being at the center of attention, so I'm never at the center of attention. But nowadays this flower wants to get off the wall, you know? I don't know, thinking about this made me really sad. It feels lonely.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ynpq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 17, "report_reasons": null, "author": "FalseDetective77", "saved": false, "mod_reports": [], "name": "t3_65ynpq", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65ynpq/how_do_i_improve/", "num_reports": null, "locked": false, "stickied": false, "created": 1492494907.0, "url": "https://www.reddit.com/r/socialskills/comments/65ynpq/how_do_i_improve/", "author_flair_text": null, "quarantine": false, "title": "How do I improve?", "created_utc": 1492466107.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ynpq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ynpq", "likes": null, "replies": "", "user_reports": [], "id": "dgedwat", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "xfreebirdrts", "parent_id": "t1_dgea230", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Like, I always do that, too, though. That's where I'm still finding issues. This post identified me, but I'm a Pediatric Psych major and I always tell strangers, family, friends, etc., the positive things like that. But everything-including the social outcome-still applies. It is lonely. 😒", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like, I always do that, too, though. That&amp;#39;s where I&amp;#39;m still finding issues. This post identified me, but I&amp;#39;m a Pediatric Psych major and I always tell strangers, family, friends, etc., the positive things like that. But everything-including the social outcome-still applies. It is lonely. 😒&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgedwat", "score_hidden": false, "stickied": false, "created": 1492503978.0, "created_utc": 1492475178.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgea230", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "TheAlHassan", "parent_id": "t3_65ynpq", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Oh man. You just pretty much described me. I used to be exactly like you, until the general consensus at my school was that I was an asshole. That devastated me, because I knew I was a good guy, but I just couldn't show it. Just like you, I also wanted close friends, wanted to be wanted. I decided to take some time resisting making my jokes, I just stayed quiet for a week or two, a month even. People thought I was depressed, but I just was resisting making the jokes. What the silence allowed me to do was focus in on the good in my interactions rather than the bad. Basically what happened was, since you need to find negatives to make sarcastic jokes, by stopping the jokes, looking at the negatives is useless. Try to see more of the positive things in everyone. Even if you don't like them. Tell people what you think. I remember feeling ridiculous as I told a dude who I made self-conscious about his laugh \"Your laugh is amazing. Don't ever change it.\" This was completely out of the blue, wasn't me flirting, nothing, just a friendly observation. The look he gave me (I saw it out of the corner of my eye, I looked away as to make it a genuine remark rather than seeming like I wanted some compliment in return) was the most genuine look of appreciation I've ever seen. Something pulled out of a cheesy movie. Little things like that. Telling a girl her smile is cute (in a platonic way), telling a guy or girl that you like their sense of style; their shoes, shirt, hat, etc. REALLY dig into the nice things you see in every person. And like you had a bunch of ammo for sarcastic jokes when you looked for the negative, you will have a bunch of ammo for compliments and genuinely nice things to say when you look for the positive. Of course, don't lose your personality, still make some sarcastic jokes, the people you get close to will learn to love them. Just maybe combine it with a complement about the same thing you made fun of to say \"Hey, I was just messing. It was just a joke. We're cool.\" They'll appreciate it. Good luck out there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man. You just pretty much described me. I used to be exactly like you, until the general consensus at my school was that I was an asshole. That devastated me, because I knew I was a good guy, but I just couldn&amp;#39;t show it. Just like you, I also wanted close friends, wanted to be wanted. I decided to take some time resisting making my jokes, I just stayed quiet for a week or two, a month even. People thought I was depressed, but I just was resisting making the jokes. What the silence allowed me to do was focus in on the good in my interactions rather than the bad. Basically what happened was, since you need to find negatives to make sarcastic jokes, by stopping the jokes, looking at the negatives is useless. Try to see more of the positive things in everyone. Even if you don&amp;#39;t like them. Tell people what you think. I remember feeling ridiculous as I told a dude who I made self-conscious about his laugh &amp;quot;Your laugh is amazing. Don&amp;#39;t ever change it.&amp;quot; This was completely out of the blue, wasn&amp;#39;t me flirting, nothing, just a friendly observation. The look he gave me (I saw it out of the corner of my eye, I looked away as to make it a genuine remark rather than seeming like I wanted some compliment in return) was the most genuine look of appreciation I&amp;#39;ve ever seen. Something pulled out of a cheesy movie. Little things like that. Telling a girl her smile is cute (in a platonic way), telling a guy or girl that you like their sense of style; their shoes, shirt, hat, etc. REALLY dig into the nice things you see in every person. And like you had a bunch of ammo for sarcastic jokes when you looked for the negative, you will have a bunch of ammo for compliments and genuinely nice things to say when you look for the positive. Of course, don&amp;#39;t lose your personality, still make some sarcastic jokes, the people you get close to will learn to love them. Just maybe combine it with a complement about the same thing you made fun of to say &amp;quot;Hey, I was just messing. It was just a joke. We&amp;#39;re cool.&amp;quot; They&amp;#39;ll appreciate it. Good luck out there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgea230", "score_hidden": false, "stickied": false, "created": 1492499029.0, "created_utc": 1492470229.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ynpq", "likes": null, "replies": "", "user_reports": [], "id": "dgedpp3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xfreebirdrts", "parent_id": "t3_65ynpq", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Literally me! I want help (and friends), too!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Literally me! I want help (and friends), too!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgedpp3", "score_hidden": false, "stickied": false, "created": 1492503742.0, "created_utc": 1492474942.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ynpq", "likes": null, "replies": "", "user_reports": [], "id": "dgees8x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "myepicdemise", "parent_id": "t3_65ynpq", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "Wow that used to be me. It's not because you shouldn't be trying to make people laugh. The problem is if your point of attraction is solely because you make people laugh, then you can only build shallow and one-dimensional relationships. There should be multiple sides of you that you show people, with the appropriateness depending on the time and place, rather than just being a clown all the time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow that used to be me. It&amp;#39;s not because you shouldn&amp;#39;t be trying to make people laugh. The problem is if your point of attraction is solely because you make people laugh, then you can only build shallow and one-dimensional relationships. There should be multiple sides of you that you show people, with the appropriateness depending on the time and place, rather than just being a clown all the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgees8x", "score_hidden": false, "stickied": false, "created": 1492505082.0, "created_utc": 1492476282.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r275", "removal_reason": null, "link_id": "t3_65ynpq", "likes": null, "replies": "", "user_reports": [], "id": "dgeihpm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ojrsh", "parent_id": "t3_65ynpq", "subreddit_name_prefixed": "r/socialskills", "controversiality": 0, "body": "INTP spotted.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;INTP spotted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "socialskills", "name": "t1_dgeihpm", "score_hidden": false, "stickied": false, "created": 1492509640.0, "created_utc": 1492480840.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]