[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "socialskills", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I was at lunch the other day with my friends and another one of their friends I had never met before came over and sat with us. Now, I&amp;#39;ll be honest, I was kind of freaking out in my mind because not only do I have like crippling social anxiety but, she decided to sit next to me which didn&amp;#39;t help. We talked for a while and had some individual small talk and occasionally added a thing or two to the overall conversation. I&amp;#39;d consider this a win because my friends said I didn&amp;#39;t show any signs of awkwardness or social ineptness (if that&amp;#39;s even a word).&lt;/p&gt;\n\n&lt;p&gt;Looking back at the whole situation, there are definitely times think I could&amp;#39;ve directed the conversation towards getting her number but I though it would be too awkward. After all, this is the first time meeting this girl and I&amp;#39;m surrounded by all my friends which adds extra pressure.&lt;/p&gt;\n\n&lt;p&gt;Nonetheless, unsurprisingly, I didn&amp;#39;t ask and she went on about her day. At first I tried talking to my one friend who has been trying to help me through my anxiety about how I handled things (He&amp;#39;s also the one who said I didn&amp;#39;t seem awkward). He said that it was probably a good thing I didn&amp;#39;t ask for her number because it actually would have made the situation awkward. I&amp;#39;m not sure if that&amp;#39;s true, maybe someone who has more social experience can show some light on his viewpoint. &lt;/p&gt;\n\n&lt;p&gt;The thing is, I though she was really cute and had a great, funny personality. She is in a major very similar to mine and I just found out today that she is in one of my classes... of 300+ people. The semester ends the last Friday in April and the next two classes will be spent taking an exam which means there are only 3 opportunities to actually talk to her again/ ask for her number. I&amp;#39;m not sure if that is even possible in my case.&lt;/p&gt;\n\n&lt;p&gt;At first, I hinted to my friend that he should try to have her come to lunch more often so I could talk to her more and maybe get the opportunity to ask for her number. However, his response wasn&amp;#39;t as optimistic as I was hoping for. He said that she shows up very sporadically and he doubts she&amp;#39;ll come to lunch before the end of the semester. Me being rather reclusive with my emotions, I didn&amp;#39;t really want to tell anyone I thought about her but I figured that if I&amp;#39;m trying to combat my social anxiety, I have to face it head on. So I told my friend what I thought about her and how I&amp;#39;d like to talk to her more and he was of little help saying that there isn&amp;#39;t really much I can do at this point.&lt;/p&gt;\n\n&lt;p&gt;So what do I do I do now? Should I cut my loses or figure out a way to talk to her?&lt;/p&gt;\n\n&lt;p&gt;TL:DR: Met a girl and didn&amp;#39;t get her number when I thought I should have. Probably won&amp;#39;t see her the rest of the semester but I actually really want to talk to her and get to know her.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I was at lunch the other day with my friends and another one of their friends I had never met before came over and sat with us. Now, I'll be honest, I was kind of freaking out in my mind because not only do I have like crippling social anxiety but, she decided to sit next to me which didn't help. We talked for a while and had some individual small talk and occasionally added a thing or two to the overall conversation. I'd consider this a win because my friends said I didn't show any signs of awkwardness or social ineptness (if that's even a word).\n\nLooking back at the whole situation, there are definitely times think I could've directed the conversation towards getting her number but I though it would be too awkward. After all, this is the first time meeting this girl and I'm surrounded by all my friends which adds extra pressure.\n\nNonetheless, unsurprisingly, I didn't ask and she went on about her day. At first I tried talking to my one friend who has been trying to help me through my anxiety about how I handled things (He's also the one who said I didn't seem awkward). He said that it was probably a good thing I didn't ask for her number because it actually would have made the situation awkward. I'm not sure if that's true, maybe someone who has more social experience can show some light on his viewpoint. \n\nThe thing is, I though she was really cute and had a great, funny personality. She is in a major very similar to mine and I just found out today that she is in one of my classes... of 300+ people. The semester ends the last Friday in April and the next two classes will be spent taking an exam which means there are only 3 opportunities to actually talk to her again/ ask for her number. I'm not sure if that is even possible in my case.\n\nAt first, I hinted to my friend that he should try to have her come to lunch more often so I could talk to her more and maybe get the opportunity to ask for her number. However, his response wasn't as optimistic as I was hoping for. He said that she shows up very sporadically and he doubts she'll come to lunch before the end of the semester. Me being rather reclusive with my emotions, I didn't really want to tell anyone I thought about her but I figured that if I'm trying to combat my social anxiety, I have to face it head on. So I told my friend what I thought about her and how I'd like to talk to her more and he was of little help saying that there isn't really much I can do at this point.\n\nSo what do I do I do now? Should I cut my loses or figure out a way to talk to her?\n\nTL:DR: Met a girl and didn't get her number when I thought I should have. Probably won't see her the rest of the semester but I actually really want to talk to her and get to know her.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zajb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "Tway9966", "saved": false, "mod_reports": [], "name": "t3_65zajb", "subreddit_name_prefixed": "r/socialskills", "approved_by": null, "over_18": false, "domain": "self.socialskills", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r275", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/socialskills/comments/65zajb/i_met_a_new_person_and_im_at_a_loss/", "num_reports": null, "locked": false, "stickied": false, "created": 1492501629.0, "url": "https://www.reddit.com/r/socialskills/comments/65zajb/i_met_a_new_person_and_im_at_a_loss/", "author_flair_text": null, "quarantine": false, "title": "I met a new person and I'm at a loss", "created_utc": 1492472829.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]