[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "lgbt", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yesterday I had a 14-year-old student casually tell me that he&amp;#39;s trans. I know life at that age is difficult for a cis kid, so I expect it&amp;#39;s doubly stressful for a trans person. I want to do everything I can to ease things for him during his transition period. He came in to class early today, just him and a friend, so I was able to ask him his preferred pronouns (he, him, etc.) and start using them. The reason I&amp;#39;m making this post, however, is I just had another teacher come into my room asking about one of his assignments. She was deadnaming him and using female pronouns. I don&amp;#39;t know how many teachers he&amp;#39;s told so far, so I don&amp;#39;t know if she just didn&amp;#39;t know or if she&amp;#39;s doing it for other reasons.&lt;/p&gt;\n\n&lt;p&gt;The hangup is this. First, I&amp;#39;ve only been at this school since January, and this is a temporary position because I have another job lined up for next year in a different city. Second, I live in an extremely religious conservative area, and I&amp;#39;m going to guess that most of my coworkers don&amp;#39;t think being transgender is a real thing or something else along those lines. Downside is I&amp;#39;m seen mostly as an outsider (don&amp;#39;t wanna talk about it, those problems aren&amp;#39;t really relevant). The upshot may be that it&amp;#39;s not going to affect me &lt;em&gt;too&lt;/em&gt; much to step on a couple toes. What can I do to help my student out?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Yesterday I had a 14-year-old student casually tell me that he's trans. I know life at that age is difficult for a cis kid, so I expect it's doubly stressful for a trans person. I want to do everything I can to ease things for him during his transition period. He came in to class early today, just him and a friend, so I was able to ask him his preferred pronouns (he, him, etc.) and start using them. The reason I'm making this post, however, is I just had another teacher come into my room asking about one of his assignments. She was deadnaming him and using female pronouns. I don't know how many teachers he's told so far, so I don't know if she just didn't know or if she's doing it for other reasons.\n\nThe hangup is this. First, I've only been at this school since January, and this is a temporary position because I have another job lined up for next year in a different city. Second, I live in an extremely religious conservative area, and I'm going to guess that most of my coworkers don't think being transgender is a real thing or something else along those lines. Downside is I'm seen mostly as an outsider (don't wanna talk about it, those problems aren't really relevant). The upshot may be that it's not going to affect me *too* much to step on a couple toes. What can I do to help my student out?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6512ja", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 110, "report_reasons": null, "author": "soullessredhead", "saved": false, "mod_reports": [], "name": "t3_6512ja", "subreddit_name_prefixed": "r/lgbt", "approved_by": null, "over_18": false, "domain": "self.lgbt", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhh7", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "ally", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/lgbt/comments/6512ja/i_have_a_trans_student_what_can_i_do_to_make/", "num_reports": null, "locked": false, "stickied": false, "created": 1492060509.0, "url": "https://www.reddit.com/r/lgbt/comments/6512ja/i_have_a_trans_student_what_can_i_do_to_make/", "author_flair_text": "", "quarantine": false, "title": "I have a trans student, what can I do to make things easier on him?", "created_utc": 1492031709.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 110}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_6512ja", "likes": null, "replies": "", "user_reports": [], "id": "dg6lhgt", "gilded": 0, "archived": false, "score": 63, "report_reasons": null, "author": "SAneeraQadri", "parent_id": "t3_6512ja", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "You wanna know the best thing to do to help him out? I'm guessing you're not sure, and I'm not either. The best thing to do would be to ask him what he wants. He was comfortable enough to come out to you, that's a good sign. \n\nI would say to just ask him how he wants you to help, but before that, tell him what you're willing to do. Don't say anything like *I can't talk to anyone for you* if you can't,  just emphasize the things that you can do. If you're willing to help convince other teachers and help him look for more resources, then tell him that. \n\nAlso,  make sure you ask him how he wants you to talk about him in front of other people. I was really awkward when asked this but it made things so much easier. He might not want you to call him his real name when talking to his parents as they might not know and he might not be ready to tell them.\n\n Also, I really really hope that you do this for all your students, but make it clear that if it's absolutely necessary for him to take a little extra time on a project or if there's a day or two where he doesn't feel well and doesn't want to do work then it's okay. Circumstances can come up in any students life that make work difficult. Most of the time, it's easy to get documentation for these circumstances. Sometimes there are things like dysphoria, getting into fights with family members, shame,  and other things that just make it a lot harder to do anything and are more difficult to be excused from.\n\nThank you so much for trying to support him.  \n\nEdit: formatting ", "edited": 1492035447.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You wanna know the best thing to do to help him out? I&amp;#39;m guessing you&amp;#39;re not sure, and I&amp;#39;m not either. The best thing to do would be to ask him what he wants. He was comfortable enough to come out to you, that&amp;#39;s a good sign. &lt;/p&gt;\n\n&lt;p&gt;I would say to just ask him how he wants you to help, but before that, tell him what you&amp;#39;re willing to do. Don&amp;#39;t say anything like &lt;em&gt;I can&amp;#39;t talk to anyone for you&lt;/em&gt; if you can&amp;#39;t,  just emphasize the things that you can do. If you&amp;#39;re willing to help convince other teachers and help him look for more resources, then tell him that. &lt;/p&gt;\n\n&lt;p&gt;Also,  make sure you ask him how he wants you to talk about him in front of other people. I was really awkward when asked this but it made things so much easier. He might not want you to call him his real name when talking to his parents as they might not know and he might not be ready to tell them.&lt;/p&gt;\n\n&lt;p&gt;Also, I really really hope that you do this for all your students, but make it clear that if it&amp;#39;s absolutely necessary for him to take a little extra time on a project or if there&amp;#39;s a day or two where he doesn&amp;#39;t feel well and doesn&amp;#39;t want to do work then it&amp;#39;s okay. Circumstances can come up in any students life that make work difficult. Most of the time, it&amp;#39;s easy to get documentation for these circumstances. Sometimes there are things like dysphoria, getting into fights with family members, shame,  and other things that just make it a lot harder to do anything and are more difficult to be excused from.&lt;/p&gt;\n\n&lt;p&gt;Thank you so much for trying to support him.  &lt;/p&gt;\n\n&lt;p&gt;Edit: formatting &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg6lhgt", "score_hidden": false, "stickied": false, "created": 1492061402.0, "created_utc": 1492032602.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 63}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_6512ja", "likes": null, "replies": "", "user_reports": [], "id": "dg6wksx", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "BeauteousMaximus", "parent_id": "t3_6512ja", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Yes, ask him, and especially ask if he wants you to refer to him as \"he\" and by his chosen name in front of his parents and other teachers. \n\nIf you can check in on him periodically and ask how he's doing, you can establish yourself as a safe person for him. I think being able to talk to you openly may mean as much as anything you could do or say to others on his behalf. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, ask him, and especially ask if he wants you to refer to him as &amp;quot;he&amp;quot; and by his chosen name in front of his parents and other teachers. &lt;/p&gt;\n\n&lt;p&gt;If you can check in on him periodically and ask how he&amp;#39;s doing, you can establish yourself as a safe person for him. I think being able to talk to you openly may mean as much as anything you could do or say to others on his behalf. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg6wksx", "score_hidden": false, "stickied": false, "created": 1492074988.0, "created_utc": 1492046188.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_6512ja", "likes": null, "replies": "", "user_reports": [], "id": "dg70osi", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "DragonGirlxo", "parent_id": "t3_6512ja", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Using his preferred pronouns, calling him by his name, and being supportive are all great. He obviously feels comfortable and safe in your class. You sound like a great teacher. \n\nAsk what he wants to do. Does he want to be out to all of his teachers and to his parents? He might not be ready for that. If he is, it might just be the case that it's better for him to talk to his teachers on his own. Just let him know that you're always there for moral support. And if there's any LGBT groups in the school or community he can join, connecting with others is always a good thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Using his preferred pronouns, calling him by his name, and being supportive are all great. He obviously feels comfortable and safe in your class. You sound like a great teacher. &lt;/p&gt;\n\n&lt;p&gt;Ask what he wants to do. Does he want to be out to all of his teachers and to his parents? He might not be ready for that. If he is, it might just be the case that it&amp;#39;s better for him to talk to his teachers on his own. Just let him know that you&amp;#39;re always there for moral support. And if there&amp;#39;s any LGBT groups in the school or community he can join, connecting with others is always a good thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg70osi", "score_hidden": false, "stickied": false, "created": 1492080115.0, "created_utc": 1492051315.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_6512ja", "likes": null, "replies": "", "user_reports": [], "id": "dg6y5iq", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "funderbolt", "parent_id": "t3_6512ja", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Try to connect him with others.  GSAs are a big force to stopping bullying in high schools.  There may be community LGBTQ organizations.  I am a part of an organization that runs youth and parent support groups.  Suggest any ideas to him.  Also, just let him know that you are available to listen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try to connect him with others.  GSAs are a big force to stopping bullying in high schools.  There may be community LGBTQ organizations.  I am a part of an organization that runs youth and parent support groups.  Suggest any ideas to him.  Also, just let him know that you are available to listen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg6y5iq", "score_hidden": false, "stickied": false, "created": 1492076935.0, "created_utc": 1492048135.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_6512ja", "likes": null, "replies": "", "user_reports": [], "id": "dg7a155", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "J-McK", "parent_id": "t3_6512ja", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "In the early days he'll be wary of who he tells, so him telling you among the first is a hell of a thing.  Sit down with him, get out pen and paper and draft a list of who can know and who can't. \n\nHe'll need resources: social groups like an LGBT youth club (cities have them, towns not so much), support structures, the number of the local LGBT helpline (there will be one in your state).  These are things you can track down and print without worrying about browser history.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the early days he&amp;#39;ll be wary of who he tells, so him telling you among the first is a hell of a thing.  Sit down with him, get out pen and paper and draft a list of who can know and who can&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;ll need resources: social groups like an LGBT youth club (cities have them, towns not so much), support structures, the number of the local LGBT helpline (there will be one in your state).  These are things you can track down and print without worrying about browser history.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg7a155", "score_hidden": false, "stickied": false, "created": 1492096921.0, "created_utc": 1492068121.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_6512ja", "likes": null, "replies": "", "user_reports": [], "id": "dg89avw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PM_ME_UR_PERIDOT", "parent_id": "t3_6512ja", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Definitely ask him what he would be comfortable with! He must trust you a lot to tell you, especially in a very conservative area like you said. \n\nAlso - if you've got any questions, any at all, head on over to places like r/asktransgender, r/ftm and r/asktransmen. We'll gladly field any and all questions you've got. Thank you for being supportive!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely ask him what he would be comfortable with! He must trust you a lot to tell you, especially in a very conservative area like you said. &lt;/p&gt;\n\n&lt;p&gt;Also - if you&amp;#39;ve got any questions, any at all, head on over to places like &lt;a href=\"/r/asktransgender\"&gt;r/asktransgender&lt;/a&gt;, &lt;a href=\"/r/ftm\"&gt;r/ftm&lt;/a&gt; and &lt;a href=\"/r/asktransmen\"&gt;r/asktransmen&lt;/a&gt;. We&amp;#39;ll gladly field any and all questions you&amp;#39;ve got. Thank you for being supportive!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg89avw", "score_hidden": false, "stickied": false, "created": 1492147734.0, "created_utc": 1492118934.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]