[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "lgbt", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just kinda feel like that. I don&amp;#39;t know why I asked that. Because I have a feeling about that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just kinda feel like that. I don't know why I asked that. Because I have a feeling about that.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65cbft", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "rawrjordan", "saved": false, "mod_reports": [], "name": "t3_65cbft", "subreddit_name_prefixed": "r/lgbt", "approved_by": null, "over_18": false, "domain": "self.lgbt", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhh7", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/lgbt/comments/65cbft/is_it_just_that_the_most_republicans_are/", "num_reports": null, "locked": false, "stickied": false, "created": 1492202901.0, "url": "https://www.reddit.com/r/lgbt/comments/65cbft/is_it_just_that_the_most_republicans_are/", "author_flair_text": null, "quarantine": false, "title": "Is it just that the most Republicans are homophobic and the Democrats are supportive?", "created_utc": 1492174101.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": "", "user_reports": [], "id": "dg9n0ks", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "k_dragon", "parent_id": "t1_dg9cwh2", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "This kind of thing in every party is why I consider myself independent", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This kind of thing in every party is why I consider myself independent&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg9n0ks", "score_hidden": false, "stickied": false, "created": 1492227793.0, "created_utc": 1492198993.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": "", "user_reports": [], "id": "dg9i180", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nonowh0", "parent_id": "t1_dg9cwh2", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Voting republican and being a republican are two different things. My point is that you shouldn't think bad of a person simply because of their (non-lgbt) politics. \n\nAs for rationalizing voting for someone that doesn't support lgbt rights, you could reasonably argue that that person would not have the authority, or the public support to harm the lgbt community. I'm personally not a fan of this line of reasoning, but I can certainly see how it can be tempting, especially if you feel strongly about the other aspects of their policy\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Voting republican and being a republican are two different things. My point is that you shouldn&amp;#39;t think bad of a person simply because of their (non-lgbt) politics. &lt;/p&gt;\n\n&lt;p&gt;As for rationalizing voting for someone that doesn&amp;#39;t support lgbt rights, you could reasonably argue that that person would not have the authority, or the public support to harm the lgbt community. I&amp;#39;m personally not a fan of this line of reasoning, but I can certainly see how it can be tempting, especially if you feel strongly about the other aspects of their policy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg9i180", "score_hidden": false, "stickied": false, "created": 1492221810.0, "created_utc": 1492193010.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cwh2", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Melody-Prisca", "parent_id": "t1_dg93eu5", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "&gt;It's perfectly possible to be an ally to the LGBT community and also think that we should cut government spending. \n\nIs it possible to vote Republican and not empower more bigotry though? It doesn't seem to me that it is. It's a fault of the way the system is. We have one big platform that is conservative, and it supports Homophobia. If you want to vote conservative, you're options are almost always limited to someone who will in some way be in favor of anti-LGBT policies, or a person who won't win regardless of your vote. Like, if you voted for Trump, you empowered his bigotry regardless of why you voted for him. \n\nSome people I'm sure, would justify their voting Republican by saying they voted for the person despite their bigotry, not because of it. That other issues matter more. To them, I'm sorry, but all I hear is that you think my rights have a price. A price which has apparently been meet. That is just something I cannot agree with.", "edited": 1492190569.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s perfectly possible to be an ally to the LGBT community and also think that we should cut government spending. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is it possible to vote Republican and not empower more bigotry though? It doesn&amp;#39;t seem to me that it is. It&amp;#39;s a fault of the way the system is. We have one big platform that is conservative, and it supports Homophobia. If you want to vote conservative, you&amp;#39;re options are almost always limited to someone who will in some way be in favor of anti-LGBT policies, or a person who won&amp;#39;t win regardless of your vote. Like, if you voted for Trump, you empowered his bigotry regardless of why you voted for him. &lt;/p&gt;\n\n&lt;p&gt;Some people I&amp;#39;m sure, would justify their voting Republican by saying they voted for the person despite their bigotry, not because of it. That other issues matter more. To them, I&amp;#39;m sorry, but all I hear is that you think my rights have a price. A price which has apparently been meet. That is just something I cannot agree with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg9cwh2", "score_hidden": false, "stickied": false, "created": 1492215930.0, "created_utc": 1492187130.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93eu5", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "nonowh0", "parent_id": "t3_65cbft", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Can't really tell if you are kidding or not, but I'll give a serious answer:\n\nRepublicans (actually conservatives) are mostly about keeping things the way they are. They are more resistant to change, and adhere to more \"traditional\" values. They are also generally more religious, which doesn't help on the queer front. \n\nDemocrats are the opposite - eager for change and willing to discard social/political norms if they think they are stupid/wrong (imo it is possible for this to go too far). This is why most LGBT folk are democrats.\n\nIt's worth noting that this does not mean that republicans are homophobic - just that a larger percentage of them are compared to democrats. Being a republican means so much more than \"conservative on social issues.\" It's perfectly possible to be an ally to the LGBT community and also think that we should cut government spending. Republicans are not evil. Some are, but it's unfair to put them in a box like that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can&amp;#39;t really tell if you are kidding or not, but I&amp;#39;ll give a serious answer:&lt;/p&gt;\n\n&lt;p&gt;Republicans (actually conservatives) are mostly about keeping things the way they are. They are more resistant to change, and adhere to more &amp;quot;traditional&amp;quot; values. They are also generally more religious, which doesn&amp;#39;t help on the queer front. &lt;/p&gt;\n\n&lt;p&gt;Democrats are the opposite - eager for change and willing to discard social/political norms if they think they are stupid/wrong (imo it is possible for this to go too far). This is why most LGBT folk are democrats.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s worth noting that this does not mean that republicans are homophobic - just that a larger percentage of them are compared to democrats. Being a republican means so much more than &amp;quot;conservative on social issues.&amp;quot; It&amp;#39;s perfectly possible to be an ally to the LGBT community and also think that we should cut government spending. Republicans are not evil. Some are, but it&amp;#39;s unfair to put them in a box like that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg93eu5", "score_hidden": false, "stickied": false, "created": 1492203516.0, "created_utc": 1492174716.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": "", "user_reports": [], "id": "dg93me4", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "SAneeraQadri", "parent_id": "t3_65cbft", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Open the 2016 Republican Party Platform and compare it to the 1980 Democrat one.\n\nBoth parties have vastly different views toward LGBT+ people. \n\nOf course there are those moderate Republicans but there are very few of them and are completely overshadowed by the ones who follow the national platform.", "edited": 1492175450.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Open the 2016 Republican Party Platform and compare it to the 1980 Democrat one.&lt;/p&gt;\n\n&lt;p&gt;Both parties have vastly different views toward LGBT+ people. &lt;/p&gt;\n\n&lt;p&gt;Of course there are those moderate Republicans but there are very few of them and are completely overshadowed by the ones who follow the national platform.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg93me4", "score_hidden": false, "stickied": false, "created": 1492203889.0, "created_utc": 1492175089.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": "", "user_reports": [], "id": "dg93v5s", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "A40", "parent_id": "t3_65cbft", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Republican *voters* voted for Republican candidates who supported homophobic policies - which were part of the Republican Party platform(s).\n\nHomophobia is as homophobia does.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Republican &lt;em&gt;voters&lt;/em&gt; voted for Republican candidates who supported homophobic policies - which were part of the Republican Party platform(s).&lt;/p&gt;\n\n&lt;p&gt;Homophobia is as homophobia does.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg93v5s", "score_hidden": false, "stickied": false, "created": 1492204307.0, "created_utc": 1492175507.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": "", "user_reports": [], "id": "dgb1wdw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JRHemmen", "parent_id": "t1_dgb1q3b", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "This seems like Hella comment for me agreeing with you, lol. I didn't mean helping the impoverished was a temporary fix, I meant the way we are doing it. Our country is in need of some big changes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This seems like Hella comment for me agreeing with you, lol. I didn&amp;#39;t mean helping the impoverished was a temporary fix, I meant the way we are doing it. Our country is in need of some big changes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgb1wdw", "score_hidden": false, "stickied": false, "created": 1492313120.0, "created_utc": 1492284320.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1q3b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "star621", "parent_id": "t1_dgazgvz", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "That is fatuous, childishly naive, and reductive. We know what the root of things are, but there doesn't exist the political will to commit financial resources to get on the road to fixing it. Massive investments in schools, healthcare (85% of bankruptcies are due to an inability to pay healthcare bills), a guaranteed wage to avoid generational poverty, adequate financial support for seniors (caring for them can drive their children into financial instability or bankruptcy), government support for families with children who have disabilities that keep a parent from working, ending barriers to reproductive health,  massive infrastructure investment, among other things, can start to address our social problems. You can trace most of our social ills to that. \n\nThe country has gone on and on without addressing these issues and now it's time to pay the money to address them. It's akin to avoiding treating a cancerous tumor. If you let it grow and metastasize, the treatment for it must be much more radical and aggressive than it would have been had you done something about it earlier. The underlying malignancy will eat up other parts of the body. Cutting spending and shrinking the government has not worked, nor have the bandaids we have put on them.\n\n The \"small government\" states are the ones that consistently rank at the bottom in terms of education, health, infant mortality, addiction, teen pregnancy, poverty, violence, suicide, and crime. The red states run by people who slash government size and state budgets have citizens who live shorter and unpleasant lives. Historically deprived and oppressed people feel it the most. They are also far behind when it comes to social harmony and equality. Blue states are far from perfect, but we aren't having fights over abortion, hate crime legislation, bathrooms, gay rights (just this month a federal judge had to force the state of Florida to list dead people in a same-sex marriage as married rather than single), putting guns in bars, putting guns in schools, or banning federal employees from using the term climate change. \n\nBut, being doctrinaire is often more important to people than discarding their \"solutions\" which have made things worse. Just look at the spectacular failure of the drug war. It has cost us trillions of dollars, millions of deaths, displacement, deforestation, funds terrorism, and spreads violence across the globe, but we keep it going. That's the same thing the trickle down, low taxes, fiscally conservative, small budget philosophy has given us. As if that's not enough, it creates a whole class of criminals and racial minorities wind up in prison for it. You can't earn in prison, you can't get a job after prison, you can't save money, you can't buy a home ,and you leave a better criminal, not a better person. All of this ruination for weed or coke. But! There's money to be made off of mass incarceration and racist policing keeps the money tap flowing. It only makes things worse and it further injures people who were its first casualties. \n\nRead Jonathan Baptist's book \"The Half Has Never Been Told\" and you'll see what I mean. It explains how slavery and nearly unpaid labor by racial minorities is what made America the economic behemoth that it is today. I'm a capitalist. I want us to invest money to fix our broken system. A healthier, better educated, diverse, and financially citizenry can do even more. People and institutions don't grow or thrive without investment. That has not and will not change.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is fatuous, childishly naive, and reductive. We know what the root of things are, but there doesn&amp;#39;t exist the political will to commit financial resources to get on the road to fixing it. Massive investments in schools, healthcare (85% of bankruptcies are due to an inability to pay healthcare bills), a guaranteed wage to avoid generational poverty, adequate financial support for seniors (caring for them can drive their children into financial instability or bankruptcy), government support for families with children who have disabilities that keep a parent from working, ending barriers to reproductive health,  massive infrastructure investment, among other things, can start to address our social problems. You can trace most of our social ills to that. &lt;/p&gt;\n\n&lt;p&gt;The country has gone on and on without addressing these issues and now it&amp;#39;s time to pay the money to address them. It&amp;#39;s akin to avoiding treating a cancerous tumor. If you let it grow and metastasize, the treatment for it must be much more radical and aggressive than it would have been had you done something about it earlier. The underlying malignancy will eat up other parts of the body. Cutting spending and shrinking the government has not worked, nor have the bandaids we have put on them.&lt;/p&gt;\n\n&lt;p&gt;The &amp;quot;small government&amp;quot; states are the ones that consistently rank at the bottom in terms of education, health, infant mortality, addiction, teen pregnancy, poverty, violence, suicide, and crime. The red states run by people who slash government size and state budgets have citizens who live shorter and unpleasant lives. Historically deprived and oppressed people feel it the most. They are also far behind when it comes to social harmony and equality. Blue states are far from perfect, but we aren&amp;#39;t having fights over abortion, hate crime legislation, bathrooms, gay rights (just this month a federal judge had to force the state of Florida to list dead people in a same-sex marriage as married rather than single), putting guns in bars, putting guns in schools, or banning federal employees from using the term climate change. &lt;/p&gt;\n\n&lt;p&gt;But, being doctrinaire is often more important to people than discarding their &amp;quot;solutions&amp;quot; which have made things worse. Just look at the spectacular failure of the drug war. It has cost us trillions of dollars, millions of deaths, displacement, deforestation, funds terrorism, and spreads violence across the globe, but we keep it going. That&amp;#39;s the same thing the trickle down, low taxes, fiscally conservative, small budget philosophy has given us. As if that&amp;#39;s not enough, it creates a whole class of criminals and racial minorities wind up in prison for it. You can&amp;#39;t earn in prison, you can&amp;#39;t get a job after prison, you can&amp;#39;t save money, you can&amp;#39;t buy a home ,and you leave a better criminal, not a better person. All of this ruination for weed or coke. But! There&amp;#39;s money to be made off of mass incarceration and racist policing keeps the money tap flowing. It only makes things worse and it further injures people who were its first casualties. &lt;/p&gt;\n\n&lt;p&gt;Read Jonathan Baptist&amp;#39;s book &amp;quot;The Half Has Never Been Told&amp;quot; and you&amp;#39;ll see what I mean. It explains how slavery and nearly unpaid labor by racial minorities is what made America the economic behemoth that it is today. I&amp;#39;m a capitalist. I want us to invest money to fix our broken system. A healthier, better educated, diverse, and financially citizenry can do even more. People and institutions don&amp;#39;t grow or thrive without investment. That has not and will not change.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgb1q3b", "score_hidden": false, "stickied": false, "created": 1492312890.0, "created_utc": 1492284090.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgazgvz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JRHemmen", "parent_id": "t1_dgaz55r", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "I do agree with you on the glass ceilings and especially the notion that we cannot count on individuals to make a change. I always try to explain to my mom that the church doesn't have enough power to do what she thinks it should do in our country and that we need the government's help. However, I think that our current system of helping the less privileged is a temporary fix that won't be sustainable. We need to get to the root of the problem if we truly want to make things better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do agree with you on the glass ceilings and especially the notion that we cannot count on individuals to make a change. I always try to explain to my mom that the church doesn&amp;#39;t have enough power to do what she thinks it should do in our country and that we need the government&amp;#39;s help. However, I think that our current system of helping the less privileged is a temporary fix that won&amp;#39;t be sustainable. We need to get to the root of the problem if we truly want to make things better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgazgvz", "score_hidden": false, "stickied": false, "created": 1492309866.0, "created_utc": 1492281066.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": "", "user_reports": [], "id": "dgbwtwc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LawBot2016", "parent_id": "t1_dgaz55r", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "The parent mentioned [**Social Safety Net**](http://legaliq.com/Definition/Social_Safety_Net). Many people, including non-native speakers, may be unfamiliar with this word. **Here is the definition:**^\\(In ^beta, ^be ^kind)\r\n****\r\nThe social safety net is a collection of services provided by the state or other institutions such as friendly societies, including welfare, unemployment benefit, universal healthcare, homeless shelters, and sometimes subsidized services such as public transport, which prevent individuals from falling into poverty beyond a certain level.\nA practical example of how the safety net works would be a single mother with several children, unable to work. By receiving money from the government to support her children, along with universal health care ... [[View More](http://legaliq.com/Definition/Social_Safety_Net)]\r\n****\r\n^(**See also:**) [^Southern ^Strategy](http://legaliq.com/Definition/Southern_Strategy) ^| [^Universal ^Health ^Care](http://legaliq.com/Definition/Universal_Health_Care) ^| [^Friendly ^Societies](http://legaliq.com/Definition/Friendly_Societies) ^| [^Perverse ^Incentive](http://legaliq.com/Definition/Perverse_Incentive)\r\n\r\n^(**Note**: The parent poster ) ^\\(star621 ^or ^rawrjordan) ^can [^delete ^this ^post](/message/compose?to=LawBot2016&amp;subject=Deletion+Request&amp;message=cmd%3A+delete+reply+t1_dgaz55r) ^| [^**FAQ**](http://legaliq.com/reddit)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The parent mentioned &lt;a href=\"http://legaliq.com/Definition/Social_Safety_Net\"&gt;&lt;strong&gt;Social Safety Net&lt;/strong&gt;&lt;/a&gt;. Many people, including non-native speakers, may be unfamiliar with this word. &lt;strong&gt;Here is the definition:&lt;/strong&gt;&lt;sup&gt;(In&lt;/sup&gt; &lt;sup&gt;beta,&lt;/sup&gt; &lt;sup&gt;be&lt;/sup&gt; &lt;sup&gt;kind)&lt;/sup&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The social safety net is a collection of services provided by the state or other institutions such as friendly societies, including welfare, unemployment benefit, universal healthcare, homeless shelters, and sometimes subsidized services such as public transport, which prevent individuals from falling into poverty beyond a certain level.\nA practical example of how the safety net works would be a single mother with several children, unable to work. By receiving money from the government to support her children, along with universal health care ... [&lt;a href=\"http://legaliq.com/Definition/Social_Safety_Net\"&gt;View More&lt;/a&gt;]&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;strong&gt;See also:&lt;/strong&gt;&lt;/sup&gt; &lt;a href=\"http://legaliq.com/Definition/Southern_Strategy\"&gt;&lt;sup&gt;Southern&lt;/sup&gt; &lt;sup&gt;Strategy&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;a href=\"http://legaliq.com/Definition/Universal_Health_Care\"&gt;&lt;sup&gt;Universal&lt;/sup&gt; &lt;sup&gt;Health&lt;/sup&gt; &lt;sup&gt;Care&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;a href=\"http://legaliq.com/Definition/Friendly_Societies\"&gt;&lt;sup&gt;Friendly&lt;/sup&gt; &lt;sup&gt;Societies&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;a href=\"http://legaliq.com/Definition/Perverse_Incentive\"&gt;&lt;sup&gt;Perverse&lt;/sup&gt; &lt;sup&gt;Incentive&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;strong&gt;Note&lt;/strong&gt;: The parent poster &lt;/sup&gt; &lt;sup&gt;(star621&lt;/sup&gt; &lt;sup&gt;or&lt;/sup&gt; &lt;sup&gt;rawrjordan)&lt;/sup&gt; &lt;sup&gt;can&lt;/sup&gt; &lt;a href=\"/message/compose?to=LawBot2016&amp;amp;subject=Deletion+Request&amp;amp;message=cmd%3A+delete+reply+t1_dgaz55r\"&gt;&lt;sup&gt;delete&lt;/sup&gt; &lt;sup&gt;this&lt;/sup&gt; &lt;sup&gt;post&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;a href=\"http://legaliq.com/reddit\"&gt;&lt;sup&gt;&lt;strong&gt;FAQ&lt;/strong&gt;&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbwtwc", "score_hidden": false, "stickied": false, "created": 1492367546.0, "created_utc": 1492338746.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaz55r", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "star621", "parent_id": "t1_dgafzij", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "How you feel about the size of government and fiscal policy cannot be decoupled from your social views. If we left it up to the small government crowd, segregated lunch counters and legally segregated schools would still be on the books. People who aren't white, straight, men, without disabilities, or natural born citizens need more resources and the government often has to intervene on their behalf. You cannot count on individuals to make institutional changes. Your race will dictate how much you earn and which means there needs to be a social safety net to help those who've had an artificial ceiling placed on their ability to earn which, in turn, impacts the ability to save money, own a home, go to college,  and have healthcare. It's already been exposed that the Southern Strategy is to express bigotry and pro-oppression sentiments by arguing for small government and a small budget. That has been the Republican playbook since Nixon. \n\nYou don't have to be a bigot to vote Republican, but if you are a bigot and you have to choose between any of our political parties, the GOP is the one where you'll find policies more in line with your values. Trump didn't win because he promised small government and fiscal discipline. Indeed, he promised just the opposite. He won the party with the misogynists, homophobes, xenophobes, racists, and religious bigots. The Republican platform as published by the party lays out those tenets. There are people who vote for Democrats who hold some of those views, but they are voting in spite of the party's platform. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How you feel about the size of government and fiscal policy cannot be decoupled from your social views. If we left it up to the small government crowd, segregated lunch counters and legally segregated schools would still be on the books. People who aren&amp;#39;t white, straight, men, without disabilities, or natural born citizens need more resources and the government often has to intervene on their behalf. You cannot count on individuals to make institutional changes. Your race will dictate how much you earn and which means there needs to be a social safety net to help those who&amp;#39;ve had an artificial ceiling placed on their ability to earn which, in turn, impacts the ability to save money, own a home, go to college,  and have healthcare. It&amp;#39;s already been exposed that the Southern Strategy is to express bigotry and pro-oppression sentiments by arguing for small government and a small budget. That has been the Republican playbook since Nixon. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to be a bigot to vote Republican, but if you are a bigot and you have to choose between any of our political parties, the GOP is the one where you&amp;#39;ll find policies more in line with your values. Trump didn&amp;#39;t win because he promised small government and fiscal discipline. Indeed, he promised just the opposite. He won the party with the misogynists, homophobes, xenophobes, racists, and religious bigots. The Republican platform as published by the party lays out those tenets. There are people who vote for Democrats who hold some of those views, but they are voting in spite of the party&amp;#39;s platform. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgaz55r", "score_hidden": false, "stickied": false, "created": 1492309410.0, "created_utc": 1492280610.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgafzij", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JRHemmen", "parent_id": "t3_65cbft", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "I've known democrats who are extremely racist/sexist/homophobic/etc. I generally lean towards conservatism (besides issues like feminism, race relations, etc.) How you feel about fiscal policy and the size of government has nothing to do with your social views. I feel like the Democratic party is trying to recruit people by acting like they're so supportive of these groups, even though people like Hillary Clinton have publically denounced same sex marriage in the past. Donald trump has also said that he does not believe in bathroom bills. On the flip side, Republicans want to recruit the older generations by promising to \"preserve their traditional values\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve known democrats who are extremely racist/sexist/homophobic/etc. I generally lean towards conservatism (besides issues like feminism, race relations, etc.) How you feel about fiscal policy and the size of government has nothing to do with your social views. I feel like the Democratic party is trying to recruit people by acting like they&amp;#39;re so supportive of these groups, even though people like Hillary Clinton have publically denounced same sex marriage in the past. Donald trump has also said that he does not believe in bathroom bills. On the flip side, Republicans want to recruit the older generations by promising to &amp;quot;preserve their traditional values&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgafzij", "score_hidden": false, "stickied": false, "created": 1492272243.0, "created_utc": 1492243443.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": "", "user_reports": [], "id": "dgapgpr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Savet", "parent_id": "t1_dgamf0t", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "That's true.  I should have clarified that I meant most fundraiser Christians are Republican whereas a larger percentage of Christians who take a less literal interpretation of the bible are probably Democrat.  I would also guess it likely that most missions and atheists would identify as Dem unless they just really like voting against their own interests.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s true.  I should have clarified that I meant most fundraiser Christians are Republican whereas a larger percentage of Christians who take a less literal interpretation of the bible are probably Democrat.  I would also guess it likely that most missions and atheists would identify as Dem unless they just really like voting against their own interests.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgapgpr", "score_hidden": false, "stickied": false, "created": 1492295854.0, "created_utc": 1492267054.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgamf0t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "alegxab", "parent_id": "t1_dga9ulu", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Most Democrats are also Christians", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most Democrats are also Christians&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgamf0t", "score_hidden": false, "stickied": false, "created": 1492290440.0, "created_utc": 1492261640.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga9ulu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Savet", "parent_id": "t3_65cbft", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Most Republicans are Christian, and their religion tells them that homosexuality is wrong.  But most people have bisexual attractions even if they don't act on them.  As a liberal, is easier to accept that what other people do has no effect on your own behavior so most LGBT allies tend to be liberal.  As a conservative, they will be vilified as a sinner by their base so they go into denial overdrive.  They publicly denounce gay behavior even though they are meeting gay prostitutes through Craigslist.  I've just started assuming that whenever I see somebody vehemently opposing something from a position of moral superiority they are just overcompensating for their own closeted desires.  I am rarely proven wrong in my assumptions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most Republicans are Christian, and their religion tells them that homosexuality is wrong.  But most people have bisexual attractions even if they don&amp;#39;t act on them.  As a liberal, is easier to accept that what other people do has no effect on your own behavior so most LGBT allies tend to be liberal.  As a conservative, they will be vilified as a sinner by their base so they go into denial overdrive.  They publicly denounce gay behavior even though they are meeting gay prostitutes through Craigslist.  I&amp;#39;ve just started assuming that whenever I see somebody vehemently opposing something from a position of moral superiority they are just overcompensating for their own closeted desires.  I am rarely proven wrong in my assumptions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dga9ulu", "score_hidden": false, "stickied": false, "created": 1492258800.0, "created_utc": 1492230000.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": "", "user_reports": [], "id": "dga9zii", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CucumbersInBrine", "parent_id": "t3_65cbft", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "There's also the complicated situation of being bisexual, identifying considerably left on nearly every issue of the US Democratic party, and living in a hard red state where the only influence you can assert is during the Republican primaries. Which are closed. So you have to register as GOP so you can vote for the least horrific GOP candidate in the primaries, then vote  for the least horrific candidate in the general.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s also the complicated situation of being bisexual, identifying considerably left on nearly every issue of the US Democratic party, and living in a hard red state where the only influence you can assert is during the Republican primaries. Which are closed. So you have to register as GOP so you can vote for the least horrific GOP candidate in the primaries, then vote  for the least horrific candidate in the general.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dga9zii", "score_hidden": false, "stickied": false, "created": 1492259043.0, "created_utc": 1492230243.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": "", "user_reports": [], "id": "dgb7ib4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VorticalOatmeal", "parent_id": "t3_65cbft", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "As a gay, Christian, Republican (for the most part). Yes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a gay, Christian, Republican (for the most part). Yes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgb7ib4", "score_hidden": false, "stickied": false, "created": 1492320806.0, "created_utc": 1492292006.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": "", "user_reports": [], "id": "dgandls", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "goodluckcat57", "parent_id": "t1_dga7s76", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Why did Obama praise Saudi Arabia's king when the country has the death penalty for being gay then?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why did Obama praise Saudi Arabia&amp;#39;s king when the country has the death penalty for being gay then?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgandls", "score_hidden": false, "stickied": false, "created": 1492292291.0, "created_utc": 1492263491.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga7s76", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Matthew37", "parent_id": "t1_dg9844s", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "&gt; I think they're the same lol\n\nAnd I think you're not actually paying attention. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think they&amp;#39;re the same lol&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And I think you&amp;#39;re not actually paying attention. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dga7s76", "score_hidden": false, "stickied": false, "created": 1492255411.0, "created_utc": 1492226611.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65cbft", "likes": null, "replies": "", "user_reports": [], "id": "dga91my", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mynameisnotbecky1", "parent_id": "t1_dg9844s", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dga91my", "score_hidden": false, "stickied": false, "created": 1492257444.0, "created_utc": 1492228644.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9844s", "gilded": 0, "archived": false, "score": -11, "report_reasons": null, "author": "goodluckcat57", "parent_id": "t3_65cbft", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "I think they're the same lol. Straight democrats just hide it better and are more subtle. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think they&amp;#39;re the same lol. Straight democrats just hide it better and are more subtle. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dg9844s", "score_hidden": false, "stickied": false, "created": 1492210344.0, "created_utc": 1492181544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -11}}], "after": null, "before": null}}]