[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "lgbt", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Some background info: My dad is a pastor. I am a closeted 20-something living with him while I get a degree.  &lt;/p&gt;\n\n&lt;p&gt;We have some old friends in town this weekend. One of their younger kids, about 4 years younger than I am, just came out as LGBT. They came out to my parents, who used to be youth leaders at the church we all attended years ago. They spent a good two hours telling them they need to turn to Christ and it is just a phase. This poor kid is scared to die and go to hell. After the conversation they came out to me, told me they came out to my parents. They said what my parents had said, about it &amp;quot;being a phase&amp;quot; and all. I have to be careful what i say, since I am out to none of these people. I just told them to &amp;quot;stay strong&amp;quot; and gave a thumbs up, trying to show as much disapproval of my parents ideals as I could in my little gesture. They rolled their eyes and said how they know its not the only bible verses they&amp;#39;ll have to listen to. Telling me they have a few more important people to come out to.  &lt;/p&gt;\n\n&lt;p&gt;God I wish I could tell them I am here for them. I can be an ear, a friendly gay ear to help them when they need it.  I know the path ahead of them isn&amp;#39;t easy, and every ally counts. I hope I conveyed enough, I hope I gave enough hints. I hope they know they got someone in their corner.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d be more open and tell them but they are young, and honestly I don&amp;#39;t want the passion and blunders of teenage brain outing me. I feel like a coward, I wish I could tell them there is nothing wrong with them. That I know exactly what they are going through.   &lt;/p&gt;\n\n&lt;p&gt;I hope they were as unaffected by the long religious rant as they appeared to be. I&amp;#39;m okay with my parents poisoning me in my youth, I will not tolerate them hurting others though.  &lt;/p&gt;\n\n&lt;p&gt;I wish I could afford to be braver. I can&amp;#39;t wait til I move out and I can &lt;em&gt;be&lt;/em&gt; out. This kid is so much braver than I ever was, I am glad they were able to have such a strong sense of identity. I wish I could help more than a vague phrase and thumbs up.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Some background info: My dad is a pastor. I am a closeted 20-something living with him while I get a degree.  \n  \nWe have some old friends in town this weekend. One of their younger kids, about 4 years younger than I am, just came out as LGBT. They came out to my parents, who used to be youth leaders at the church we all attended years ago. They spent a good two hours telling them they need to turn to Christ and it is just a phase. This poor kid is scared to die and go to hell. After the conversation they came out to me, told me they came out to my parents. They said what my parents had said, about it \"being a phase\" and all. I have to be careful what i say, since I am out to none of these people. I just told them to \"stay strong\" and gave a thumbs up, trying to show as much disapproval of my parents ideals as I could in my little gesture. They rolled their eyes and said how they know its not the only bible verses they'll have to listen to. Telling me they have a few more important people to come out to.  \n  \nGod I wish I could tell them I am here for them. I can be an ear, a friendly gay ear to help them when they need it.  I know the path ahead of them isn't easy, and every ally counts. I hope I conveyed enough, I hope I gave enough hints. I hope they know they got someone in their corner.  \n  \nI'd be more open and tell them but they are young, and honestly I don't want the passion and blunders of teenage brain outing me. I feel like a coward, I wish I could tell them there is nothing wrong with them. That I know exactly what they are going through.   \n  \nI hope they were as unaffected by the long religious rant as they appeared to be. I'm okay with my parents poisoning me in my youth, I will not tolerate them hurting others though.  \n  \nI wish I could afford to be braver. I can't wait til I move out and I can *be* out. This kid is so much braver than I ever was, I am glad they were able to have such a strong sense of identity. I wish I could help more than a vague phrase and thumbs up.  \n  \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65hdva", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "AaronBurrSer", "saved": false, "mod_reports": [], "name": "t3_65hdva", "subreddit_name_prefixed": "r/lgbt", "approved_by": null, "over_18": false, "domain": "self.lgbt", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhh7", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/lgbt/comments/65hdva/i_felt_so_neutered/", "num_reports": null, "locked": false, "stickied": false, "created": 1492260157.0, "url": "https://www.reddit.com/r/lgbt/comments/65hdva/i_felt_so_neutered/", "author_flair_text": null, "quarantine": false, "title": "I felt so neutered....", "created_utc": 1492231357.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65hdva", "likes": null, "replies": "", "user_reports": [], "id": "dgaehm5", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "starlouisetge", "parent_id": "t3_65hdva", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "I understand not being out, but I also think that maybe you should stand up for this kid. You don't have to tell them your sexuality but you can support them and tell them how strong they are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand not being out, but I also think that maybe you should stand up for this kid. You don&amp;#39;t have to tell them your sexuality but you can support them and tell them how strong they are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgaehm5", "score_hidden": false, "stickied": false, "created": 1492268250.0, "created_utc": 1492239450.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65hdva", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65hdva", "likes": null, "replies": "", "user_reports": [], "id": "dgbdw4x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AaronBurrSer", "parent_id": "t1_dgai7j0", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Thank you. I still got another year stuck where I am. After that the forecast is rainbows, alcohol, and happiness haha. I am going to try to see if I can talk with their sister and let them know about resources that can be helpful to them. Her sister is cool with LGBT stuff and even defended her sister a bit after the fact. I don't think she is aware of things like PFLAG for her mother or resources for her sister.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I still got another year stuck where I am. After that the forecast is rainbows, alcohol, and happiness haha. I am going to try to see if I can talk with their sister and let them know about resources that can be helpful to them. Her sister is cool with LGBT stuff and even defended her sister a bit after the fact. I don&amp;#39;t think she is aware of things like PFLAG for her mother or resources for her sister.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbdw4x", "score_hidden": false, "stickied": false, "created": 1492329854.0, "created_utc": 1492301054.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgai7j0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "kgtz", "parent_id": "t3_65hdva", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "i'm sorry you're in that situation. it seems like such a challenging place to be between two worlds. i think (or maybe i just hope?) that people can see the intent of your words, even if they don't feel like the \"perfect\" words. i'm hope they felt your support. and there's always facebook where you could send a supportive message to them if you want to be sure.\n\nbest of luck, and here's looking to the future when you get to come out. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i&amp;#39;m sorry you&amp;#39;re in that situation. it seems like such a challenging place to be between two worlds. i think (or maybe i just hope?) that people can see the intent of your words, even if they don&amp;#39;t feel like the &amp;quot;perfect&amp;quot; words. i&amp;#39;m hope they felt your support. and there&amp;#39;s always facebook where you could send a supportive message to them if you want to be sure.&lt;/p&gt;\n\n&lt;p&gt;best of luck, and here&amp;#39;s looking to the future when you get to come out. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgai7j0", "score_hidden": false, "stickied": false, "created": 1492279214.0, "created_utc": 1492250414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]