[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "lgbt", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every single time a tragic event happens in another country people post pictures of LGBT activists from the west and try to mock them as &amp;quot;whiny sjws&amp;quot; telling us that because its illegal to be gay in one country we should just shut up about any other lesser discrimination that goes on in the west.. how does that make any sense? I&amp;#39;m not even american and I dont have as many rights as americans do (i.e marriage) and people still tell me to shut up about because &amp;quot;it could be worse&amp;quot;.. And the thing that bothers me the most is that most people who say that don&amp;#39;t even care about the gay people from said countries where being LGBT is a crime and don&amp;#39;t try to do anything to help them.. they just use them to shut us up and mock us and make us feel bad for fighting against opression because we arent &amp;quot;opressed enough&amp;quot;. Kinda the same way they do with women but I won&amp;#39;t get into that.. It&amp;#39;s just really tiring being opressed while also being told you arent..&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Every single time a tragic event happens in another country people post pictures of LGBT activists from the west and try to mock them as \"whiny sjws\" telling us that because its illegal to be gay in one country we should just shut up about any other lesser discrimination that goes on in the west.. how does that make any sense? I'm not even american and I dont have as many rights as americans do (i.e marriage) and people still tell me to shut up about because \"it could be worse\".. And the thing that bothers me the most is that most people who say that don't even care about the gay people from said countries where being LGBT is a crime and don't try to do anything to help them.. they just use them to shut us up and mock us and make us feel bad for fighting against opression because we arent \"opressed enough\". Kinda the same way they do with women but I won't get into that.. It's just really tiring being opressed while also being told you arent..", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65jq7e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 97, "report_reasons": null, "author": "glintter", "saved": false, "mod_reports": [], "name": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "approved_by": null, "over_18": false, "domain": "self.lgbt", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhh7", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "ainbow", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/lgbt/comments/65jq7e/kinda_getting_tired_of_people_telling_us_others/", "num_reports": null, "locked": false, "stickied": false, "created": 1492300058.0, "url": "https://www.reddit.com/r/lgbt/comments/65jq7e/kinda_getting_tired_of_people_telling_us_others/", "author_flair_text": "", "quarantine": false, "title": "Kinda getting tired of people telling us \"others have it worse\"", "created_utc": 1492271258.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 97}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgb4cay", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "mynameisnotbecky1", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Like how when Maroon 5 did not perform in NC because of their anti-transgender bathroom law. And instead of people to be applauding them and appreciating they have an ally here, on this very sub-reddit, they just fucking complain on how he should go and protest in other countries more homophobic than NC and US overall.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like how when Maroon 5 did not perform in NC because of their anti-transgender bathroom law. And instead of people to be applauding them and appreciating they have an ally here, on this very sub-reddit, they just fucking complain on how he should go and protest in other countries more homophobic than NC and US overall.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgb4cay", "score_hidden": false, "stickied": false, "created": 1492316445.0, "created_utc": 1492287645.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgb1uo3", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "positiveParadox", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "It's the \"starving children in Africa\" fallacy at work. Other people suffering worse than you is horrible, but it does nothing to reduce your own suffering. \n\nIn the scope of LGBT rights, it's good to campaign against barbaric anti-gay laws, but it's also good to reach for the ideal of what a LGBT positive should look like.\n\nI suppose the middle way is at work here: campaign for your own issues, but also advocate for and keep in mind the damned who live in horrific places. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s the &amp;quot;starving children in Africa&amp;quot; fallacy at work. Other people suffering worse than you is horrible, but it does nothing to reduce your own suffering. &lt;/p&gt;\n\n&lt;p&gt;In the scope of LGBT rights, it&amp;#39;s good to campaign against barbaric anti-gay laws, but it&amp;#39;s also good to reach for the ideal of what a LGBT positive should look like.&lt;/p&gt;\n\n&lt;p&gt;I suppose the middle way is at work here: campaign for your own issues, but also advocate for and keep in mind the damned who live in horrific places. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgb1uo3", "score_hidden": false, "stickied": false, "created": 1492313059.0, "created_utc": 1492284259.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgat5g9", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "SAneeraQadri", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Don't listen to those assholes. If we did, then there would be no point to fighting for anything, as most people still have someone that's worse off than them. It's best to just ignore them. Anything less than full equality is oppression. Someone's struggles being worse than someone else's doesn't negate the fact that those struggles still exist. \n\nIt happens with everything and it's really pathetic. Don't complain about cold symptoms because there are people with cancer. Don't complain about being overworked and not making enough to pay the bills because there are still people in slavery. Don't complain about sexual harassment in the workplace because people in other countries can't even world. \n\nIf we listened to all these people then the world would be much worse than it is today. Just because people say that there are other people worse off than us doesn't mean that we aren't also in a bad place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t listen to those assholes. If we did, then there would be no point to fighting for anything, as most people still have someone that&amp;#39;s worse off than them. It&amp;#39;s best to just ignore them. Anything less than full equality is oppression. Someone&amp;#39;s struggles being worse than someone else&amp;#39;s doesn&amp;#39;t negate the fact that those struggles still exist. &lt;/p&gt;\n\n&lt;p&gt;It happens with everything and it&amp;#39;s really pathetic. Don&amp;#39;t complain about cold symptoms because there are people with cancer. Don&amp;#39;t complain about being overworked and not making enough to pay the bills because there are still people in slavery. Don&amp;#39;t complain about sexual harassment in the workplace because people in other countries can&amp;#39;t even world. &lt;/p&gt;\n\n&lt;p&gt;If we listened to all these people then the world would be much worse than it is today. Just because people say that there are other people worse off than us doesn&amp;#39;t mean that we aren&amp;#39;t also in a bad place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgat5g9", "score_hidden": false, "stickied": false, "created": 1492301169.0, "created_utc": 1492272369.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgc1eo2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mynameisnotbecky1", "parent_id": "t1_dgavraf", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "\"Tell them to go find a time machine to be their safe space because real life is moving forward whether they like it or not\".\n\n\"I bet if their mom died and you said, \"Shut up, at least you had a mom. There are people whose mom died during childbirth or who abandoned them. Be grateful you even had a mom and focus on those people,\" they would tell you \nand everyone they know how horrible you are as a person\".\n\nPreaching, very good way to explain it. I have always had trouble trying to defending myself against people who use the \"Others have it worse\" phrase, I will definitely use this enlightening one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Tell them to go find a time machine to be their safe space because real life is moving forward whether they like it or not&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I bet if their mom died and you said, &amp;quot;Shut up, at least you had a mom. There are people whose mom died during childbirth or who abandoned them. Be grateful you even had a mom and focus on those people,&amp;quot; they would tell you \nand everyone they know how horrible you are as a person&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Preaching, very good way to explain it. I have always had trouble trying to defending myself against people who use the &amp;quot;Others have it worse&amp;quot; phrase, I will definitely use this enlightening one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgc1eo2", "score_hidden": false, "stickied": false, "created": 1492379107.0, "created_utc": 1492350307.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgavraf", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "star621", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "It's a silencing tactic. I can bet you anything these people don't demand stoicism of themselves. I bet if their mom died and you said, \"Shut up, at least you had a mom. There are people whose mom died during childbirth or who abandoned them. Be grateful you even had a mom and focus on those people,\" they would tell you and everyone they know how horrible you are as a person. \n\nNever apologize for wanting full equality and fairness. Never let someone tell you that Saudi Arabia is the benchmark we're setting for the rights of women, gays, secularists, atheists, or Shia Muslims. Tell those people that if they are in favor of injustice in one country simply because it is worse than others, they are free to be craven and immoral but you will not be a spectator to your own oppression or that of others. These people want to keep oppression and injustice in place. They are the special snowflakes because a progressing society leaves them behind and they are using every tactic to make certain the world doesn't stop prioritizing them or their feelings. Tell them to go find a time machine to be their safe space because real life is moving forward whether they like it or not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a silencing tactic. I can bet you anything these people don&amp;#39;t demand stoicism of themselves. I bet if their mom died and you said, &amp;quot;Shut up, at least you had a mom. There are people whose mom died during childbirth or who abandoned them. Be grateful you even had a mom and focus on those people,&amp;quot; they would tell you and everyone they know how horrible you are as a person. &lt;/p&gt;\n\n&lt;p&gt;Never apologize for wanting full equality and fairness. Never let someone tell you that Saudi Arabia is the benchmark we&amp;#39;re setting for the rights of women, gays, secularists, atheists, or Shia Muslims. Tell those people that if they are in favor of injustice in one country simply because it is worse than others, they are free to be craven and immoral but you will not be a spectator to your own oppression or that of others. These people want to keep oppression and injustice in place. They are the special snowflakes because a progressing society leaves them behind and they are using every tactic to make certain the world doesn&amp;#39;t stop prioritizing them or their feelings. Tell them to go find a time machine to be their safe space because real life is moving forward whether they like it or not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgavraf", "score_hidden": false, "stickied": false, "created": 1492304817.0, "created_utc": 1492276017.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgbcjbq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "demcmd", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "My grandpa, during an argument on Facebook, said something along the lines of LGBT people having it worse in the Middle East.\n\nSo yeah, another country has it worse than America and that's still terrible. But how about we set an example for those countries and be progressive in this debate? There's still terrible discrimination in our country whether it be over race, religion, sexual orientation, or gender identity. Make it so someone who is LGBT will not be treated as a lesser person than someone who is simply straight and cis.\n\nThere's so much evidence to back this up. The Pulse shooting was the most fatal shooting since Virginia Tech, bills that encourage discrimination in the name of \"religious freedom\" are brought up in many states and signed into law in some, poverty for someone in the LGBT community is much more likely than the base average, and yet people say that apparently we've done enough or that we should be putting these issues on hold. If they don't believe in these talking points, they don't care. They're bigoted and close-minded if they actually think that America is 100% innocent to us.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My grandpa, during an argument on Facebook, said something along the lines of LGBT people having it worse in the Middle East.&lt;/p&gt;\n\n&lt;p&gt;So yeah, another country has it worse than America and that&amp;#39;s still terrible. But how about we set an example for those countries and be progressive in this debate? There&amp;#39;s still terrible discrimination in our country whether it be over race, religion, sexual orientation, or gender identity. Make it so someone who is LGBT will not be treated as a lesser person than someone who is simply straight and cis.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s so much evidence to back this up. The Pulse shooting was the most fatal shooting since Virginia Tech, bills that encourage discrimination in the name of &amp;quot;religious freedom&amp;quot; are brought up in many states and signed into law in some, poverty for someone in the LGBT community is much more likely than the base average, and yet people say that apparently we&amp;#39;ve done enough or that we should be putting these issues on hold. If they don&amp;#39;t believe in these talking points, they don&amp;#39;t care. They&amp;#39;re bigoted and close-minded if they actually think that America is 100% innocent to us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbcjbq", "score_hidden": false, "stickied": false, "created": 1492328001.0, "created_utc": 1492299201.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgb0klw", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Needle59", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "And then they turn around and cry about the brutal subjugation of white Christian men in America.", "edited": 1492293436.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And then they turn around and cry about the brutal subjugation of white Christian men in America.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgb0klw", "score_hidden": false, "stickied": false, "created": 1492311374.0, "created_utc": 1492282574.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgbbfsa", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "nonewwavenofun", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "As others have mentioned, nothing would get done, since there's always someone worse off than you. You've rightly noticed that it's pretty much a silencing tactic.\n\nThere also seems to be this line of thinking that you can only fight for one cause (e.g. LGBT+ rights) at a time, which is of course nonsense. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As others have mentioned, nothing would get done, since there&amp;#39;s always someone worse off than you. You&amp;#39;ve rightly noticed that it&amp;#39;s pretty much a silencing tactic.&lt;/p&gt;\n\n&lt;p&gt;There also seems to be this line of thinking that you can only fight for one cause (e.g. LGBT+ rights) at a time, which is of course nonsense. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbbfsa", "score_hidden": false, "stickied": false, "created": 1492326416.0, "created_utc": 1492297616.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgbdj13", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Scootakip", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "By that logic, those people can't complain about literally anything, because I guarantee that life could be worse for them, as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;By that logic, those people can&amp;#39;t complain about literally anything, because I guarantee that life could be worse for them, as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbdj13", "score_hidden": false, "stickied": false, "created": 1492329374.0, "created_utc": 1492300574.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgau7o7", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Rgrockr", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "It's just something people say because they want to look like they care while simultaneously not caring about you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s just something people say because they want to look like they care while simultaneously not caring about you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgau7o7", "score_hidden": false, "stickied": false, "created": 1492302652.0, "created_utc": 1492273852.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgaw7tm", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bighairybelly", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Don't let people minimize what you fight for just because it is small in their eyes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t let people minimize what you fight for just because it is small in their eyes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgaw7tm", "score_hidden": false, "stickied": false, "created": 1492305437.0, "created_utc": 1492276637.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgbetf4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throwawaycoh", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Well there are two ways to assess a situation - compare it to how bad it could be and to how good it could be. \n\nThere are benefits and drawbacks to both. When you're comparing a situation to how good it could be, you're increasing your own motivation to make things better. On the other hand, you might never be happy because you're always delaying satisfaction to some distant 'better' future that might never come. You might also not have a proper appreciation of what you have right now, how hard it was to achieve, and the extent to which you can still loose it - in which case you might be too willing to make risky gambles that could end up setting you back. \n\nOn the other hand, when you're comparing a situation to how bad it could be, you might never fight to improve things, and if we all had that mentality, we would still be in the stone age. \n\nIt's probably a good idea to have a bit of both - try to appreciate how far the LGBT community still has to go to achieve full equality and also be aware that things could be much, much worse, and everything we've achieved so far can still be taken away. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well there are two ways to assess a situation - compare it to how bad it could be and to how good it could be. &lt;/p&gt;\n\n&lt;p&gt;There are benefits and drawbacks to both. When you&amp;#39;re comparing a situation to how good it could be, you&amp;#39;re increasing your own motivation to make things better. On the other hand, you might never be happy because you&amp;#39;re always delaying satisfaction to some distant &amp;#39;better&amp;#39; future that might never come. You might also not have a proper appreciation of what you have right now, how hard it was to achieve, and the extent to which you can still loose it - in which case you might be too willing to make risky gambles that could end up setting you back. &lt;/p&gt;\n\n&lt;p&gt;On the other hand, when you&amp;#39;re comparing a situation to how bad it could be, you might never fight to improve things, and if we all had that mentality, we would still be in the stone age. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s probably a good idea to have a bit of both - try to appreciate how far the LGBT community still has to go to achieve full equality and also be aware that things could be much, much worse, and everything we&amp;#39;ve achieved so far can still be taken away. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbetf4", "score_hidden": false, "stickied": false, "created": 1492331197.0, "created_utc": 1492302397.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgdfi06", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lyndis_Caelin", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Others have it worse? Sure. We all know what's going on in Russia, and there's apparently an organization dedicated to supporting Russian LGBT stuff.\n\nRussia throwing gay people in concentration camps does NOT stop Americans from beating up gay people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Others have it worse? Sure. We all know what&amp;#39;s going on in Russia, and there&amp;#39;s apparently an organization dedicated to supporting Russian LGBT stuff.&lt;/p&gt;\n\n&lt;p&gt;Russia throwing gay people in concentration camps does NOT stop Americans from beating up gay people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgdfi06", "score_hidden": false, "stickied": false, "created": 1492461780.0, "created_utc": 1492432980.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgcmihr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "geekrafael", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "I always saw that as a way of put us and our fight down, seems like a pretty convenient way of saying \"be quiet, it could be worse\", really sad", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always saw that as a way of put us and our fight down, seems like a pretty convenient way of saying &amp;quot;be quiet, it could be worse&amp;quot;, really sad&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgcmihr", "score_hidden": false, "stickied": false, "created": 1492407884.0, "created_utc": 1492379084.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65jq7e", "likes": null, "replies": "", "user_reports": [], "id": "dgcpxzp", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Clarnico", "parent_id": "t3_65jq7e", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Yeah...Someone else having it worse doesn't make it any easier...\n\nDoes someone else having cancer magically make another's illness cured? Nope. Does a starving child in Africa make a homeless person on the other side of the world feel less hungry? Probably not. \n\nJust because someone else is going through hell doesn't make it any easier, if anything, the reminder that shit happens everywhere is even more depressing. \n\nThat said, I think sometimes when comparative \"non issues\" are having massive campaigns against, that doesn't mean they should \"shut up\" but sometimes I wish other issues could be raised to a similar profile (eg, I've heard far more about a poorly worded drink aware campaign with the slogan \"will you still be thinking straight at the end of the night?\" (as in, doing something reckless like drunk driving (not in a straight line) whilst wasted, not in the sexuality context at all being too homophobic) than I've heard about the actual death camps and torture going on right now), or even the \"progressive\" countries still without gay marriage.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah...Someone else having it worse doesn&amp;#39;t make it any easier...&lt;/p&gt;\n\n&lt;p&gt;Does someone else having cancer magically make another&amp;#39;s illness cured? Nope. Does a starving child in Africa make a homeless person on the other side of the world feel less hungry? Probably not. &lt;/p&gt;\n\n&lt;p&gt;Just because someone else is going through hell doesn&amp;#39;t make it any easier, if anything, the reminder that shit happens everywhere is even more depressing. &lt;/p&gt;\n\n&lt;p&gt;That said, I think sometimes when comparative &amp;quot;non issues&amp;quot; are having massive campaigns against, that doesn&amp;#39;t mean they should &amp;quot;shut up&amp;quot; but sometimes I wish other issues could be raised to a similar profile (eg, I&amp;#39;ve heard far more about a poorly worded drink aware campaign with the slogan &amp;quot;will you still be thinking straight at the end of the night?&amp;quot; (as in, doing something reckless like drunk driving (not in a straight line) whilst wasted, not in the sexuality context at all being too homophobic) than I&amp;#39;ve heard about the actual death camps and torture going on right now), or even the &amp;quot;progressive&amp;quot; countries still without gay marriage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgcpxzp", "score_hidden": false, "stickied": false, "created": 1492412526.0, "created_utc": 1492383726.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]