[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "lgbt", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know where else to go with this. I&amp;#39;m a 19 year old girl, I&amp;#39;ve never really given a lot of thought to relationships or sexuality. I&amp;#39;ve always been indifferent towards having a boyfriend. I think certain male celebrities are attractive but I&amp;#39;ve never really thought of them in a sexual manner, more of just a &amp;quot;His eyes are cute&amp;quot; or &amp;quot;he has a nice face&amp;quot; kind of way.&lt;/p&gt;\n\n&lt;p&gt;Recently I met a person at my friend&amp;#39;s birthday party. She&amp;#39;s 26. Long story short: We started talking at the party, and we just connected on a level I&amp;#39;ve never felt before. By the end of the night, I felt like she was my best friend.\nFast forward a week later, I&amp;#39;m hanging out at her apartment, it&amp;#39;s like 3 am and we&amp;#39;re both tired. We went to her bed to lay down. We talked in the dark for about an hour and suddenly she said something like &amp;quot;I&amp;#39;ve been dying to kiss you all night, can I?&amp;quot; I was instantly hit with a lot of &amp;quot;butterfly&amp;quot; feelings in my stomach, but without thinking, I said yes and we started kissing.&lt;/p&gt;\n\n&lt;p&gt;Another long story short: We had sex. And it was probably the best experience of my life. I was really nervous throughout all of it since I was so inexperienced, she was obviously more experienced than me. But despite my nerves, it was the deepest connection I&amp;#39;ve ever felt with another person at both an emotional and physical level.\nThis happened about 3 days ago and she&amp;#39;s been busy so we haven&amp;#39;t had the chance to talk much about it but we&amp;#39;re seeing each other tomorrow. I can&amp;#39;t stop thinking about her.&lt;/p&gt;\n\n&lt;p&gt;I feel like this all moved so fast. The reason I&amp;#39;m still skeptical about being a lesbian is because I have never, ever had any feelings like this towards another girl. I&amp;#39;ve never been attracted to another girl. I&amp;#39;ve never had sexual feelings about another girl. The fact that this happened and I enjoyed it so much has me really confused.\nLike I said, I have no idea where else to go with this. I sure as hell can&amp;#39;t tell my Christian dad and I&amp;#39;d feel weird telling my best friend as of right now. So I&amp;#39;m just posting here.&lt;/p&gt;\n\n&lt;p&gt;Thank you if you read this, and any advice would be appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know where else to go with this. I'm a 19 year old girl, I've never really given a lot of thought to relationships or sexuality. I've always been indifferent towards having a boyfriend. I think certain male celebrities are attractive but I've never really thought of them in a sexual manner, more of just a \"His eyes are cute\" or \"he has a nice face\" kind of way.\n\nRecently I met a person at my friend's birthday party. She's 26. Long story short: We started talking at the party, and we just connected on a level I've never felt before. By the end of the night, I felt like she was my best friend.\nFast forward a week later, I'm hanging out at her apartment, it's like 3 am and we're both tired. We went to her bed to lay down. We talked in the dark for about an hour and suddenly she said something like \"I've been dying to kiss you all night, can I?\" I was instantly hit with a lot of \"butterfly\" feelings in my stomach, but without thinking, I said yes and we started kissing.\n\nAnother long story short: We had sex. And it was probably the best experience of my life. I was really nervous throughout all of it since I was so inexperienced, she was obviously more experienced than me. But despite my nerves, it was the deepest connection I've ever felt with another person at both an emotional and physical level.\nThis happened about 3 days ago and she's been busy so we haven't had the chance to talk much about it but we're seeing each other tomorrow. I can't stop thinking about her.\n\n\nI feel like this all moved so fast. The reason I'm still skeptical about being a lesbian is because I have never, ever had any feelings like this towards another girl. I've never been attracted to another girl. I've never had sexual feelings about another girl. The fact that this happened and I enjoyed it so much has me really confused.\nLike I said, I have no idea where else to go with this. I sure as hell can't tell my Christian dad and I'd feel weird telling my best friend as of right now. So I'm just posting here.\n\nThank you if you read this, and any advice would be appreciated.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65m8xd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 49, "report_reasons": null, "author": "HayleyKJ", "saved": false, "mod_reports": [], "name": "t3_65m8xd", "subreddit_name_prefixed": "r/lgbt", "approved_by": null, "over_18": false, "domain": "self.lgbt", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhh7", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/lgbt/comments/65m8xd/i_had_a_sexual_experience_that_has_me_thinking_im/", "num_reports": null, "locked": false, "stickied": false, "created": 1492329124.0, "url": "https://www.reddit.com/r/lgbt/comments/65m8xd/i_had_a_sexual_experience_that_has_me_thinking_im/", "author_flair_text": null, "quarantine": false, "title": "I had a sexual experience that has me thinking I'm a lesbian, don't know who to talk to about it", "created_utc": 1492300324.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 49}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": "", "user_reports": [], "id": "dgcacyl", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MissSnuffles117", "parent_id": "t1_dgbgmzk", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "A good resource for safe sex and sex positivity, if you're interested.  Sexplanations on Youtube. https://youtu.be/Ot31Ravybo0", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A good resource for safe sex and sex positivity, if you&amp;#39;re interested.  Sexplanations on Youtube. &lt;a href=\"https://youtu.be/Ot31Ravybo0\"&gt;https://youtu.be/Ot31Ravybo0&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgcacyl", "score_hidden": false, "stickied": false, "created": 1492391916.0, "created_utc": 1492363116.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": "", "user_reports": [], "id": "dgc5wtx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Zerujin", "parent_id": "t1_dgbgmzk", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Get tested then and research safe sex if you haven't already. It's not about trusting her but your health and safety. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get tested then and research safe sex if you haven&amp;#39;t already. It&amp;#39;s not about trusting her but your health and safety. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgc5wtx", "score_hidden": false, "stickied": false, "created": 1492386017.0, "created_utc": 1492357217.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbgmzk", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "HayleyKJ", "parent_id": "t1_dgbeub4", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "&gt;Remember though, no matter the gender of your partner, safe sex always\n\noops", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Remember though, no matter the gender of your partner, safe sex always&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;oops&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbgmzk", "score_hidden": false, "stickied": false, "created": 1492333783.0, "created_utc": 1492304983.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbeub4", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "Mythology", "parent_id": "t3_65m8xd", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Having sex with someone of the same gender does not automatically put you in column Gay. (I know, terrible joke). College age is when most people start to experiment with their sexuality. Now are you probably at least a little bit gay, yes. You can at least consider yourself bi. If you weren't at least slightly interested, you would have probably been uncomfortable during the act. One of those sort of \"this isn't quite working right\" feelings.\nSexual identity isn't something that falls into simple black or white, there's a huge gray area between. Ultimately it's what you decide for yourself that makes you happy. What a lot of people do understand is that there is your sexual identity and then there is biological preference and these do not go hand in hand. Do not let yourself get bogged down in the concepts and labels. Go with what feels right for you and makes you happiest.\nRemember though, no matter the gender of your partner, safe sex always\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having sex with someone of the same gender does not automatically put you in column Gay. (I know, terrible joke). College age is when most people start to experiment with their sexuality. Now are you probably at least a little bit gay, yes. You can at least consider yourself bi. If you weren&amp;#39;t at least slightly interested, you would have probably been uncomfortable during the act. One of those sort of &amp;quot;this isn&amp;#39;t quite working right&amp;quot; feelings.\nSexual identity isn&amp;#39;t something that falls into simple black or white, there&amp;#39;s a huge gray area between. Ultimately it&amp;#39;s what you decide for yourself that makes you happy. What a lot of people do understand is that there is your sexual identity and then there is biological preference and these do not go hand in hand. Do not let yourself get bogged down in the concepts and labels. Go with what feels right for you and makes you happiest.\nRemember though, no matter the gender of your partner, safe sex always&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbeub4", "score_hidden": false, "stickied": false, "created": 1492331234.0, "created_utc": 1492302434.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": "", "user_reports": [], "id": "dgbmhaw", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "MatchaDoAboutNothing", "parent_id": "t3_65m8xd", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "You're young; you're still figuring out who you are. That's okay. It's not super important to put a label on yourself right now. If you want to pursue things with this girl go for it. But be honest with her about where you are in life, and that you aren't sure of your orientation.\n\nFor a lot of people there is a bit of grey area involved in orientations. You may well end up considering yourself straight, and it's just this one girl. Or a girl every once in a while. There's nothing wrong with that. You can act on those feelings, you can not. It's entirely up to you.\n\nI consider myself to be a lesbian, but I'd be lying if I said I'd never been attracted to any man. It's a very rare occasion, but it's happened. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re young; you&amp;#39;re still figuring out who you are. That&amp;#39;s okay. It&amp;#39;s not super important to put a label on yourself right now. If you want to pursue things with this girl go for it. But be honest with her about where you are in life, and that you aren&amp;#39;t sure of your orientation.&lt;/p&gt;\n\n&lt;p&gt;For a lot of people there is a bit of grey area involved in orientations. You may well end up considering yourself straight, and it&amp;#39;s just this one girl. Or a girl every once in a while. There&amp;#39;s nothing wrong with that. You can act on those feelings, you can not. It&amp;#39;s entirely up to you.&lt;/p&gt;\n\n&lt;p&gt;I consider myself to be a lesbian, but I&amp;#39;d be lying if I said I&amp;#39;d never been attracted to any man. It&amp;#39;s a very rare occasion, but it&amp;#39;s happened. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbmhaw", "score_hidden": false, "stickied": false, "created": 1492342431.0, "created_utc": 1492313631.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": "", "user_reports": [], "id": "dgbmotr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bewundernswert", "parent_id": "t3_65m8xd", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Try to stop thinking so hard about it. Give yourself the liberty of time to explore your sexuality. Sex doesn't have to be so deliberate, where you follow a set of norms based on what those around you think or what society seems to say. It's okay to keep things to yourself while you figure out who you are and what you like, or confide in someone open and whom you trust. But more importantly than identifying or labeling your sexual identity is just living it. Do what you like! That's the joy of adulthood. Sometimes attraction goes in waves and it plays on taboos because they're exciting. So maybe right now you're into girls. Maybe it's this particular girl. And maybe next week a hot guy will catch your interest. Just look after your sexual health and worry later about what it all \"means\". The more comfortable you become with your desires, the more you may realize it doesn't mean anything at all. It's just human nature. You're human. It's no more complicated than that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try to stop thinking so hard about it. Give yourself the liberty of time to explore your sexuality. Sex doesn&amp;#39;t have to be so deliberate, where you follow a set of norms based on what those around you think or what society seems to say. It&amp;#39;s okay to keep things to yourself while you figure out who you are and what you like, or confide in someone open and whom you trust. But more importantly than identifying or labeling your sexual identity is just living it. Do what you like! That&amp;#39;s the joy of adulthood. Sometimes attraction goes in waves and it plays on taboos because they&amp;#39;re exciting. So maybe right now you&amp;#39;re into girls. Maybe it&amp;#39;s this particular girl. And maybe next week a hot guy will catch your interest. Just look after your sexual health and worry later about what it all &amp;quot;means&amp;quot;. The more comfortable you become with your desires, the more you may realize it doesn&amp;#39;t mean anything at all. It&amp;#39;s just human nature. You&amp;#39;re human. It&amp;#39;s no more complicated than that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbmotr", "score_hidden": false, "stickied": false, "created": 1492342737.0, "created_utc": 1492313937.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": "", "user_reports": [], "id": "dgbrbc3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "motivationascending", "parent_id": "t3_65m8xd", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "This sounds a lot like me. In my mid thirties now, and with an awesome women, but still consider myself pansexual. Everyone else in my life consider me a lesbian which annoys me a little. But don't worry about a label, just do what you feel like doing. As a side note, I'm glad you are having fun! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds a lot like me. In my mid thirties now, and with an awesome women, but still consider myself pansexual. Everyone else in my life consider me a lesbian which annoys me a little. But don&amp;#39;t worry about a label, just do what you feel like doing. As a side note, I&amp;#39;m glad you are having fun! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbrbc3", "score_hidden": false, "stickied": false, "created": 1492351118.0, "created_utc": 1492322318.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": "", "user_reports": [], "id": "dgbyvoc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SarahHalloween84", "parent_id": "t3_65m8xd", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "&gt;  I was instantly hit with a lot of \"butterfly\" feelings in my stomach, but without thinking, I said yes and we started kissing.\n\nAdvice - try not to overthink things. If it feels good, keep doing it. I understand your Dad might have an issue. My advice would be to keep doing what makes you happy. &lt;3 ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I was instantly hit with a lot of &amp;quot;butterfly&amp;quot; feelings in my stomach, but without thinking, I said yes and we started kissing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Advice - try not to overthink things. If it feels good, keep doing it. I understand your Dad might have an issue. My advice would be to keep doing what makes you happy. &amp;lt;3 &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbyvoc", "score_hidden": false, "stickied": false, "created": 1492373726.0, "created_utc": 1492344926.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": "", "user_reports": [], "id": "dgc3oua", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "blinkinthesink", "parent_id": "t3_65m8xd", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "You don't have to label yourself anything yet.  Explore your sexuality, see what you like and then maybe later you'll want to put a label on it.  But it's not necessary to put yourself in a box, just do what feels right and see what happens.  If you really enjoyed the sex then that's all that matters, and if you want to pursue a relationship with this girl, go for it.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t have to label yourself anything yet.  Explore your sexuality, see what you like and then maybe later you&amp;#39;ll want to put a label on it.  But it&amp;#39;s not necessary to put yourself in a box, just do what feels right and see what happens.  If you really enjoyed the sex then that&amp;#39;s all that matters, and if you want to pursue a relationship with this girl, go for it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgc3oua", "score_hidden": false, "stickied": false, "created": 1492382830.0, "created_utc": 1492354030.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": "", "user_reports": [], "id": "dgchwtp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rationaliser", "parent_id": "t3_65m8xd", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "You fancy her and enjoy sex with her. Call yourself what you like, labels are irrelevant.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You fancy her and enjoy sex with her. Call yourself what you like, labels are irrelevant.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgchwtp", "score_hidden": false, "stickied": false, "created": 1492401907.0, "created_utc": 1492373107.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": "", "user_reports": [], "id": "dgbrt1g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "notuniqueusernamer", "parent_id": "t3_65m8xd", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Try not to think about labeling yourself, that's not the important part. Just do what feels right and comfortable. Maybe you are gay, maybe it was just once in a lifetime experience, but you have a pot of time to figure it all out. Enjoy yourself, don't torture your mind by overthinking too much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try not to think about labeling yourself, that&amp;#39;s not the important part. Just do what feels right and comfortable. Maybe you are gay, maybe it was just once in a lifetime experience, but you have a pot of time to figure it all out. Enjoy yourself, don&amp;#39;t torture your mind by overthinking too much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgbrt1g", "score_hidden": false, "stickied": false, "created": 1492352257.0, "created_utc": 1492323457.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": "", "user_reports": [], "id": "dgcvjje", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "joleenmae", "parent_id": "t3_65m8xd", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Like others have said having sex with someone of the same gender doesn't necessarily make you gay. You can be gay, bisexual, polysexual, pansexual, or one of many other identities. Only you can figure out what your orientation is and is not. Heck, you can decide that you aren't comfortable labeling yourself at all and that's fine as well. Take your time to figure yourself out. From what you wrote it sounds​ like you may be demisexual. This is when someone is only sexually attracted to someone the ty have a emotional connection with. I hope things work out for you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like others have said having sex with someone of the same gender doesn&amp;#39;t necessarily make you gay. You can be gay, bisexual, polysexual, pansexual, or one of many other identities. Only you can figure out what your orientation is and is not. Heck, you can decide that you aren&amp;#39;t comfortable labeling yourself at all and that&amp;#39;s fine as well. Take your time to figure yourself out. From what you wrote it sounds​ like you may be demisexual. This is when someone is only sexually attracted to someone the ty have a emotional connection with. I hope things work out for you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgcvjje", "score_hidden": false, "stickied": false, "created": 1492420095.0, "created_utc": 1492391295.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65m8xd", "likes": null, "replies": "", "user_reports": [], "id": "dgdrq4z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FunctioningCog", "parent_id": "t3_65m8xd", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Consider the facts that you know right now. You've never had strong feelings for boys, you've never considered girls, and a physical experience you had with a girl was wonderful. We know you're not straight (Congratulations!!), but we await more self reflection to solidify what you are. That's okay. Some people have always known these things and others figure it out way later. For reference, when I was 19 and in the middle of a straight relationship, I recognized my feelings towards my new close friend as *intensely* romantic, in a way that made me rethink everything I'd ever deemed romantic towards boys. Queue many months of confusion and soul-searching before reaching a conclusion.\n\nResearch 'compulsory heterosexuality' 'heteronormaticity' and 'internalized homophobia'. See if those terms resonate with you at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Consider the facts that you know right now. You&amp;#39;ve never had strong feelings for boys, you&amp;#39;ve never considered girls, and a physical experience you had with a girl was wonderful. We know you&amp;#39;re not straight (Congratulations!!), but we await more self reflection to solidify what you are. That&amp;#39;s okay. Some people have always known these things and others figure it out way later. For reference, when I was 19 and in the middle of a straight relationship, I recognized my feelings towards my new close friend as &lt;em&gt;intensely&lt;/em&gt; romantic, in a way that made me rethink everything I&amp;#39;d ever deemed romantic towards boys. Queue many months of confusion and soul-searching before reaching a conclusion.&lt;/p&gt;\n\n&lt;p&gt;Research &amp;#39;compulsory heterosexuality&amp;#39; &amp;#39;heteronormaticity&amp;#39; and &amp;#39;internalized homophobia&amp;#39;. See if those terms resonate with you at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgdrq4z", "score_hidden": false, "stickied": false, "created": 1492477708.0, "created_utc": 1492448908.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]