[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "lgbt", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65qubd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 139, "report_reasons": null, "author": "TragicDonut", "saved": false, "mod_reports": [], "name": "t3_65qubd", "subreddit_name_prefixed": "r/lgbt", "approved_by": null, "over_18": false, "domain": "nydailynews.com", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/2zT_ZwGUaBBAdXAWqoJ9ndyYf91fNXK78B-b8T-3OUM.jpg?s=c74c31315863f050bbf71a8e33d778a6", "width": 1200, "height": 630}, "resolutions": [{"url": "https://i.redditmedia.com/2zT_ZwGUaBBAdXAWqoJ9ndyYf91fNXK78B-b8T-3OUM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=f98b005e5b8b556cce2199be2e3e005c", "width": 108, "height": 56}, {"url": "https://i.redditmedia.com/2zT_ZwGUaBBAdXAWqoJ9ndyYf91fNXK78B-b8T-3OUM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=dbd7144809527e8a15e8dffca89af084", "width": 216, "height": 113}, {"url": "https://i.redditmedia.com/2zT_ZwGUaBBAdXAWqoJ9ndyYf91fNXK78B-b8T-3OUM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=6e3348188ad7aba146c52d7919b5a82c", "width": 320, "height": 168}, {"url": "https://i.redditmedia.com/2zT_ZwGUaBBAdXAWqoJ9ndyYf91fNXK78B-b8T-3OUM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=6e25864003830d554168fae70c509ca1", "width": 640, "height": 336}, {"url": "https://i.redditmedia.com/2zT_ZwGUaBBAdXAWqoJ9ndyYf91fNXK78B-b8T-3OUM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=aa6e8cb1bc0a4191bc35ea29b0f12054", "width": 960, "height": 504}, {"url": "https://i.redditmedia.com/2zT_ZwGUaBBAdXAWqoJ9ndyYf91fNXK78B-b8T-3OUM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=3f401cabba5ef0eeed20e5cb5db81ec9", "width": 1080, "height": 567}], "variants": {}, "id": "22FtKVWqoDK_28kQTKziEQu1406A48HY-nDmNgNSCHg"}], "enabled": false}, "thumbnail": "https://b.thumbs.redditmedia.com/jjXPKtso3t6USeYFEBVLfKtqo2zbaxmoutRcG4Zoauc.jpg", "subreddit_id": "t5_2qhh7", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "link", "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/lgbt/comments/65qubd/ricky_martin_says_he_waited_to_come_out_over_fear/", "num_reports": null, "locked": false, "stickied": false, "created": 1492398987.0, "url": "http://www.nydailynews.com/entertainment/ricky-martin-waited-fear-rejection-article-1.3062104", "author_flair_text": null, "quarantine": false, "title": "Ricky Martin says he waited to come out over fear of rejection", "created_utc": 1492370187.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 139}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65qubd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhh7", "removal_reason": null, "link_id": "t3_65qubd", "likes": null, "replies": "", "user_reports": [], "id": "dgdv1fe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dgcitvf", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "Speaking as someone whose mother had a \"big thing\" for Ricky Martin (and gay singer Clay Aiken) back in the day: pretty much this.\n\nEven on \"LGBTQA-friendly\" sites like Tumblr, where there is an insane concentration of straight women who are \"fans\" of something or another, I see this crap happen time and again. It's also a big problem in yaoi circles, or \"men love men\" fiction and other circles: it's women fetishizing gay men. They make things all about looks / sex.\n\nAs an asexual woman, I've seen this happen all my life, or women fetishizing men who have effeminate qualities, or seem \"gay\". They might not necessarily realize it, but they see society at large doing it, and so they adopt the same behavior. They don't see it as \"wrong\", because they justify it as \"everyone else is doing it, so it must be right\".\n\nIn my case, when I didn't show sexual interest or attraction to guys like my female peers did around the time of puberty (7th-8th grade), I was ostracized and deemed \"strange, odd\", because I wasn't doing \"what's popular to do\". My friends (even my mom and her adult peers) were bragging about their love of boy bands, which often are ascribed heavy gay undertones by women, and Ricky Martin, and I...just really didn't get it.\n\nEven in yaoi / \"men love men\" situations, however, these are usually heavily female dominated (and exploited) for one reason: for straight women and girls to \"explore their sexuality\", to imagine that they \"have a chance\" with hot, male singers, and other gay or effeminate singers and icons.\n\nFor example, take a recent article on the Twitter responses about Jude Law being cast as young Dumbledore (a gay character). Many, *many* of those Tweets were from women saying, \"Jude Law having hot, gay sex with Johnny Depp (Grindelwald)? Sign me up!\" or, \"Jude Law is so hot / fit / attractive, why would he go for Johnny Depp's character? [Why not go for me?]\"\n\nEven then, straight women are parroting harmful stereotypes, and fetishising gay men by making it all about their looks / appearance / ideas about them having sex. It's one thing to be and feel attracted to someone physically; it's entirely another to be openly vocal about it, popularize the behavior, and then \"see nothing wrong with it\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Speaking as someone whose mother had a &amp;quot;big thing&amp;quot; for Ricky Martin (and gay singer Clay Aiken) back in the day: pretty much this.&lt;/p&gt;\n\n&lt;p&gt;Even on &amp;quot;LGBTQA-friendly&amp;quot; sites like Tumblr, where there is an insane concentration of straight women who are &amp;quot;fans&amp;quot; of something or another, I see this crap happen time and again. It&amp;#39;s also a big problem in yaoi circles, or &amp;quot;men love men&amp;quot; fiction and other circles: it&amp;#39;s women fetishizing gay men. They make things all about looks / sex.&lt;/p&gt;\n\n&lt;p&gt;As an asexual woman, I&amp;#39;ve seen this happen all my life, or women fetishizing men who have effeminate qualities, or seem &amp;quot;gay&amp;quot;. They might not necessarily realize it, but they see society at large doing it, and so they adopt the same behavior. They don&amp;#39;t see it as &amp;quot;wrong&amp;quot;, because they justify it as &amp;quot;everyone else is doing it, so it must be right&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;In my case, when I didn&amp;#39;t show sexual interest or attraction to guys like my female peers did around the time of puberty (7th-8th grade), I was ostracized and deemed &amp;quot;strange, odd&amp;quot;, because I wasn&amp;#39;t doing &amp;quot;what&amp;#39;s popular to do&amp;quot;. My friends (even my mom and her adult peers) were bragging about their love of boy bands, which often are ascribed heavy gay undertones by women, and Ricky Martin, and I...just really didn&amp;#39;t get it.&lt;/p&gt;\n\n&lt;p&gt;Even in yaoi / &amp;quot;men love men&amp;quot; situations, however, these are usually heavily female dominated (and exploited) for one reason: for straight women and girls to &amp;quot;explore their sexuality&amp;quot;, to imagine that they &amp;quot;have a chance&amp;quot; with hot, male singers, and other gay or effeminate singers and icons.&lt;/p&gt;\n\n&lt;p&gt;For example, take a recent article on the Twitter responses about Jude Law being cast as young Dumbledore (a gay character). Many, &lt;em&gt;many&lt;/em&gt; of those Tweets were from women saying, &amp;quot;Jude Law having hot, gay sex with Johnny Depp (Grindelwald)? Sign me up!&amp;quot; or, &amp;quot;Jude Law is so hot / fit / attractive, why would he go for Johnny Depp&amp;#39;s character? [Why not go for me?]&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Even then, straight women are parroting harmful stereotypes, and fetishising gay men by making it all about their looks / appearance / ideas about them having sex. It&amp;#39;s one thing to be and feel attracted to someone physically; it&amp;#39;s entirely another to be openly vocal about it, popularize the behavior, and then &amp;quot;see nothing wrong with it&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgdv1fe", "score_hidden": false, "stickied": false, "created": 1492481370.0, "created_utc": 1492452570.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcitvf", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "YorjYefferson", "parent_id": "t3_65qubd", "subreddit_name_prefixed": "r/lgbt", "controversiality": 0, "body": "All the things he is quoted as saying are true, and every LGBT person knows this. But that's the \"correct\" answer to give these days that isn't 100% truthful. It's like if you're watching a Miss America pageant and they give an answer that they think other people want to hear, like the judges or fans.\n\nThe main reason he didn't come out until relatively recently is the same reason Barry Manilow waited until this year to finally address the rumours about his sexuality... because as much as we wish this weren't the case, pop music (like TV shows, movies and most entertainment outside the theatre community) has an expectation assigned to gay men: hide it, conceal it, date women publicly, don't do or say anything \"too gay\" because a lot of straight women are the ones who have the purchasing power and wind up dictating what becomes a hit; and these women want to convince themselves they have a chance with you. So bury it, the entertainment world says, at least until you're established enough in your career (or far enough away from whatever was popular about you to begin with, time-wise) that it doesn't affect album or ticket sales, or Nielsen ratings. I think this expectation applies to more of the gay community than just gay men, and maybe it's because I'm a gay man I've always noticed it most vividly in our subset. But there are countless examples of guys who avoided the subject or actively tried to separate their true identities from their public personas for this reason, and the effects of it can last for years even when other (usually younger) performers are out and proud, at least the past 10 years or so give or take. Hopefully this won't be so pronounced in the years to come.\n\nI understand it but it still makes me sad, like watching a George Michael video where he's supposedly singing to or about a woman, when he clearly would have substituted her for a guy if it had been up to him. I still like Ricky as a performer (not his tattoos, they look fugly to me but they aren't on my body so whatever) but I admit there was a bit of disappointment in watching his career take off in the late 90s *so long as he pretended to be straight* that it felt a bit like a betrayal. Because I know a lot of us could tell, I could and it wasn't just wishful thinking. Had he come out sooner, no doubt he would have had a welcoming committee in the gay community but I don't think it would have led to anywhere near as many hit songs or albums, or concert tours, anywhere in the world.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All the things he is quoted as saying are true, and every LGBT person knows this. But that&amp;#39;s the &amp;quot;correct&amp;quot; answer to give these days that isn&amp;#39;t 100% truthful. It&amp;#39;s like if you&amp;#39;re watching a Miss America pageant and they give an answer that they think other people want to hear, like the judges or fans.&lt;/p&gt;\n\n&lt;p&gt;The main reason he didn&amp;#39;t come out until relatively recently is the same reason Barry Manilow waited until this year to finally address the rumours about his sexuality... because as much as we wish this weren&amp;#39;t the case, pop music (like TV shows, movies and most entertainment outside the theatre community) has an expectation assigned to gay men: hide it, conceal it, date women publicly, don&amp;#39;t do or say anything &amp;quot;too gay&amp;quot; because a lot of straight women are the ones who have the purchasing power and wind up dictating what becomes a hit; and these women want to convince themselves they have a chance with you. So bury it, the entertainment world says, at least until you&amp;#39;re established enough in your career (or far enough away from whatever was popular about you to begin with, time-wise) that it doesn&amp;#39;t affect album or ticket sales, or Nielsen ratings. I think this expectation applies to more of the gay community than just gay men, and maybe it&amp;#39;s because I&amp;#39;m a gay man I&amp;#39;ve always noticed it most vividly in our subset. But there are countless examples of guys who avoided the subject or actively tried to separate their true identities from their public personas for this reason, and the effects of it can last for years even when other (usually younger) performers are out and proud, at least the past 10 years or so give or take. Hopefully this won&amp;#39;t be so pronounced in the years to come.&lt;/p&gt;\n\n&lt;p&gt;I understand it but it still makes me sad, like watching a George Michael video where he&amp;#39;s supposedly singing to or about a woman, when he clearly would have substituted her for a guy if it had been up to him. I still like Ricky as a performer (not his tattoos, they look fugly to me but they aren&amp;#39;t on my body so whatever) but I admit there was a bit of disappointment in watching his career take off in the late 90s &lt;em&gt;so long as he pretended to be straight&lt;/em&gt; that it felt a bit like a betrayal. Because I know a lot of us could tell, I could and it wasn&amp;#39;t just wishful thinking. Had he come out sooner, no doubt he would have had a welcoming committee in the gay community but I don&amp;#39;t think it would have led to anywhere near as many hit songs or albums, or concert tours, anywhere in the world.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "lgbt", "name": "t1_dgcitvf", "score_hidden": false, "stickied": false, "created": 1492403079.0, "created_utc": 1492374279.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}]