[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskMen", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I&amp;#39;m worried about whether my upbringing has influenced my dating habits. \nI&amp;#39;m a young woman and my father moved away when I was young and my mother had about 5 or 6 major relationships as I was growing up. All men moved into my home, acted as a father to me and then either cheated or they would break up and leave. It left me feeling very confused about relationships....\nAnyway..\nBecause I&amp;#39;m eager to please (in all aspects with men and women alike) I don&amp;#39;t feel like I allow people close enough to get to know me or give them a chance. And instead of getting to know them properly I&amp;#39;m jumping to my own conclusions or expectations of them. I don&amp;#39;t even want to bring up my relationship issues I have because I fear being pigeon holed into &amp;quot;damaged goods&amp;quot; or just too much maintenance. &lt;/p&gt;\n\n&lt;p&gt;please help.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey, I'm worried about whether my upbringing has influenced my dating habits. \nI'm a young woman and my father moved away when I was young and my mother had about 5 or 6 major relationships as I was growing up. All men moved into my home, acted as a father to me and then either cheated or they would break up and leave. It left me feeling very confused about relationships....\nAnyway..\nBecause I'm eager to please (in all aspects with men and women alike) I don't feel like I allow people close enough to get to know me or give them a chance. And instead of getting to know them properly I'm jumping to my own conclusions or expectations of them. I don't even want to bring up my relationship issues I have because I fear being pigeon holed into \"damaged goods\" or just too much maintenance. \n\nplease help.\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64y49t", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 29, "report_reasons": null, "author": "squillicent", "saved": false, "mod_reports": [], "name": "t3_64y49t", "subreddit_name_prefixed": "r/AskMen", "approved_by": null, "over_18": false, "domain": "self.AskMen", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s30g", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskMen/comments/64y49t/have_you_had_a_girlfriend_that_has_discussed/", "num_reports": null, "locked": false, "stickied": false, "created": 1492032339.0, "url": "https://www.reddit.com/r/AskMen/comments/64y49t/have_you_had_a_girlfriend_that_has_discussed/", "author_flair_text": null, "quarantine": false, "title": "have you had a girlfriend that has discussed \"daddy issues\" with you? and how it effected her with you?", "created_utc": 1492003539.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": "", "user_reports": [], "id": "dg8xlg3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "squillicent", "parent_id": "t1_dg7g1uw", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "That was really nice to read. Sounds like a really nice balance", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was really nice to read. Sounds like a really nice balance&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg8xlg3", "score_hidden": false, "stickied": false, "created": 1492187822.0, "created_utc": 1492159022.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7g1uw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rapiertwit", "parent_id": "t1_dg6o7g4", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Fortunately she is a smart woman with a high emotional intelligence and self-awareness, which enabled her to emerge from that environment without an abuse-seeking tendency.  What she is, is very low-maintenance.  I treat her with respect and show her lots of affection (which I was raised to see as normal, just *what you do*) and I praise her accomolishments.  Nothing overboard, I just treat her like a healthy person treats the person they love.  But to her, I think, she feels very lucky to have that.  She is incapable if taking it for granted the way some of us can.  It still lights up her face when I tell her she's awesome. \n\nSexually IS where I think it comes out, in a fairly strong submissive/masochistic streak.  Which I think is healthy and good - as a friend of mine once said, kink is where we store our neuroses for safekeeping.  It's safe because we only share that side of oursleves with someone we love and trust (hopefully).  For us, bed is like Vegas - what happens there, stays there.  Outside of bed, I am nurturing to the extent that some men would think is on the side of subservience (to me, there's a difference - subservience is being bossed around, what I do is savor the joys of unrestrained generosity).  But the caveman side of me gets let off the chain in the sack.  Likewise, she gets to express the part of herself that may have been created by her dad's unhealthy inhibitions.  But it stays in \"Vegas\" - outside of bed, in the other aspects of our relationship, she feels properly entitled to my kindness, respect and tenderness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fortunately she is a smart woman with a high emotional intelligence and self-awareness, which enabled her to emerge from that environment without an abuse-seeking tendency.  What she is, is very low-maintenance.  I treat her with respect and show her lots of affection (which I was raised to see as normal, just &lt;em&gt;what you do&lt;/em&gt;) and I praise her accomolishments.  Nothing overboard, I just treat her like a healthy person treats the person they love.  But to her, I think, she feels very lucky to have that.  She is incapable if taking it for granted the way some of us can.  It still lights up her face when I tell her she&amp;#39;s awesome. &lt;/p&gt;\n\n&lt;p&gt;Sexually IS where I think it comes out, in a fairly strong submissive/masochistic streak.  Which I think is healthy and good - as a friend of mine once said, kink is where we store our neuroses for safekeeping.  It&amp;#39;s safe because we only share that side of oursleves with someone we love and trust (hopefully).  For us, bed is like Vegas - what happens there, stays there.  Outside of bed, I am nurturing to the extent that some men would think is on the side of subservience (to me, there&amp;#39;s a difference - subservience is being bossed around, what I do is savor the joys of unrestrained generosity).  But the caveman side of me gets let off the chain in the sack.  Likewise, she gets to express the part of herself that may have been created by her dad&amp;#39;s unhealthy inhibitions.  But it stays in &amp;quot;Vegas&amp;quot; - outside of bed, in the other aspects of our relationship, she feels properly entitled to my kindness, respect and tenderness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg7g1uw", "score_hidden": false, "stickied": false, "created": 1492113611.0, "created_utc": 1492084811.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6o7g4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "squillicent", "parent_id": "t1_dg5vqo3", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "That's a really good point. I'm pretty open about other aspects of myself like mental illness and stuff, I guess I just feel weird bringing the dad stuff up. Did it ever effect your sex life? (sorry if thats too personal and feel free not to answer) \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a really good point. I&amp;#39;m pretty open about other aspects of myself like mental illness and stuff, I guess I just feel weird bringing the dad stuff up. Did it ever effect your sex life? (sorry if thats too personal and feel free not to answer) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg6o7g4", "score_hidden": false, "stickied": false, "created": 1492064727.0, "created_utc": 1492035927.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vqo3", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "rapiertwit", "parent_id": "t3_64y49t", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "My wife's dad was pretty much an absentee, and when he was around he expressed affection primarily through criticism and made it pretty clear through his actions that he was disappointed she wasn't a boy.  While she didn't exactly lead with this information on our first date or anything, she has never been shy about talking about it.  I think the main thing that's appealing is that she has a sense of humor about it.  She's like, \"here's how *I'm* fucked up, and here's why.\"  She is at peace with it and she's not ruled by her unsatisfied childhood needs.\n\nBasically, if you can laugh about it, that shows you're at least somewhat mastering it, not being mastered by it.  And there's something reassuring about someone who knows how they're fucked up and can tell you.  It's like buying a used car off Craigslist and the seller points out all the dings and scratches and tells you the left turn signal doesn't work.  That makes me think that's probably the worst of it, that you're not hiding something truly awful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My wife&amp;#39;s dad was pretty much an absentee, and when he was around he expressed affection primarily through criticism and made it pretty clear through his actions that he was disappointed she wasn&amp;#39;t a boy.  While she didn&amp;#39;t exactly lead with this information on our first date or anything, she has never been shy about talking about it.  I think the main thing that&amp;#39;s appealing is that she has a sense of humor about it.  She&amp;#39;s like, &amp;quot;here&amp;#39;s how &lt;em&gt;I&amp;#39;m&lt;/em&gt; fucked up, and here&amp;#39;s why.&amp;quot;  She is at peace with it and she&amp;#39;s not ruled by her unsatisfied childhood needs.&lt;/p&gt;\n\n&lt;p&gt;Basically, if you can laugh about it, that shows you&amp;#39;re at least somewhat mastering it, not being mastered by it.  And there&amp;#39;s something reassuring about someone who knows how they&amp;#39;re fucked up and can tell you.  It&amp;#39;s like buying a used car off Craigslist and the seller points out all the dings and scratches and tells you the left turn signal doesn&amp;#39;t work.  That makes me think that&amp;#39;s probably the worst of it, that you&amp;#39;re not hiding something truly awful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg5vqo3", "score_hidden": false, "stickied": false, "created": 1492033845.0, "created_utc": 1492005045.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": "", "user_reports": [], "id": "dg6oah5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "squillicent", "parent_id": "t1_dg5wt4w", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Haha, when I wrote this I was lacking in sleep and it nearly went in so many different directions. Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha, when I wrote this I was lacking in sleep and it nearly went in so many different directions. Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg6oah5", "score_hidden": false, "stickied": false, "created": 1492064833.0, "created_utc": 1492036033.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wt4w", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "PurplePlurple", "parent_id": "t3_64y49t", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "My wife's parents separated at a young age - but she started taking therapy immediately. Honestly, I encourage you to give it a shot. 'Damaged goods,' IMHO, is on par with 'human who has psychology,' - not everyone is going to have patience with or care to understand what you struggle with, and that's if they even have the empathy to work with you in that area of a relationship too.\n\nMy wife didn't have daddy issue,  but I think almost everyone brings *something* to the table that has to eventually be worked out when it comes to a relationship. Therapy can help you gain traction on this independently, and equip you to handle it - communicate about and coop - when in a relationship. \n\nThe things I loved most about mynwife from the start were that she had a strong focus on communication, could do it well, had a strong emotional intelligence and intuition, and didn't tolerate bullshit. If you make those things your focus and can find a partner who agrees on those priorities... I mean, I'm probably biased because it's worked for me, and I used it to overcome my own shit that affected me (and eventually others). I haven't gotten a lot of sleep and my thoughts are going in like ten different directions, so I'm gonna stop abruptly with this digression. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My wife&amp;#39;s parents separated at a young age - but she started taking therapy immediately. Honestly, I encourage you to give it a shot. &amp;#39;Damaged goods,&amp;#39; IMHO, is on par with &amp;#39;human who has psychology,&amp;#39; - not everyone is going to have patience with or care to understand what you struggle with, and that&amp;#39;s if they even have the empathy to work with you in that area of a relationship too.&lt;/p&gt;\n\n&lt;p&gt;My wife didn&amp;#39;t have daddy issue,  but I think almost everyone brings &lt;em&gt;something&lt;/em&gt; to the table that has to eventually be worked out when it comes to a relationship. Therapy can help you gain traction on this independently, and equip you to handle it - communicate about and coop - when in a relationship. &lt;/p&gt;\n\n&lt;p&gt;The things I loved most about mynwife from the start were that she had a strong focus on communication, could do it well, had a strong emotional intelligence and intuition, and didn&amp;#39;t tolerate bullshit. If you make those things your focus and can find a partner who agrees on those priorities... I mean, I&amp;#39;m probably biased because it&amp;#39;s worked for me, and I used it to overcome my own shit that affected me (and eventually others). I haven&amp;#39;t gotten a lot of sleep and my thoughts are going in like ten different directions, so I&amp;#39;m gonna stop abruptly with this digression. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg5wt4w", "score_hidden": false, "stickied": false, "created": 1492035209.0, "created_utc": 1492006409.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": "", "user_reports": [], "id": "dg5vuls", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "chennnnnn", "parent_id": "t3_64y49t", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Yep my ex of about 6 years had some daddies issues and we talked about them. I loved her so it didnt really change how I felt or thought about her. I was more than willing to support her and continue loving her. My only regret was not helping her seek professional help both individually or as a couple. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep my ex of about 6 years had some daddies issues and we talked about them. I loved her so it didnt really change how I felt or thought about her. I was more than willing to support her and continue loving her. My only regret was not helping her seek professional help both individually or as a couple. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg5vuls", "score_hidden": false, "stickied": false, "created": 1492033987.0, "created_utc": 1492005187.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": "", "user_reports": [], "id": "dg739no", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PurplePlurple", "parent_id": "t1_dg6p1sh", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "That's the past though, you know? There's no point if you don't even give something a chance. I can understand the excitement of a fresh relationship and someone new. When I started dating my wife, we ended up down to our underwear on her second date... and she said, actually, I'd like to wait because you're special, and I want this to mean something. You have to work on distinguishing between a lot of different positives and emotions, and it's easy to just eat the whole bag of candy on the spot when you've had a small taste. You miss out on the fine details when you rush though, and you're bound to trip when you hurry yourself. I dunno. Depending on what you deal with, I might consider some counseling or therapy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the past though, you know? There&amp;#39;s no point if you don&amp;#39;t even give something a chance. I can understand the excitement of a fresh relationship and someone new. When I started dating my wife, we ended up down to our underwear on her second date... and she said, actually, I&amp;#39;d like to wait because you&amp;#39;re special, and I want this to mean something. You have to work on distinguishing between a lot of different positives and emotions, and it&amp;#39;s easy to just eat the whole bag of candy on the spot when you&amp;#39;ve had a small taste. You miss out on the fine details when you rush though, and you&amp;#39;re bound to trip when you hurry yourself. I dunno. Depending on what you deal with, I might consider some counseling or therapy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg739no", "score_hidden": false, "stickied": false, "created": 1492083649.0, "created_utc": 1492054849.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6p1sh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "squillicent", "parent_id": "t1_dg5x33f", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Yeah sorry.\nEvery person I date (I'd say its a few a year, with the in between time me focusing on myself and doing well) I try to go into it with a new mind set. The guy I'm (sort of) dating right now and I decided we wouldn't have sex and we would just start getting to know each other. Then we both dropped the ball and did it on our third date. Now we haven't spoken. I usually have sex with someone pretty quickly (which I know isn't always a good thing) and then find it difficult to communicate with them. I guess I haven't gotten close enough with a guy (apart from male friends) to be that honest with them. It never gets that far. \nI have repeated the same mistakes, with such different kinds of guys. I just go inward. I don't really give them a chance because I just don't see the point after watching so many relationships end in complete fucking heartbreak. Watching your mother cry and weep and fall apart as a child, repeatedly, just doesn't make it seem so appealing. Then on the other hand I do long to be loved and to love (naturally) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah sorry.\nEvery person I date (I&amp;#39;d say its a few a year, with the in between time me focusing on myself and doing well) I try to go into it with a new mind set. The guy I&amp;#39;m (sort of) dating right now and I decided we wouldn&amp;#39;t have sex and we would just start getting to know each other. Then we both dropped the ball and did it on our third date. Now we haven&amp;#39;t spoken. I usually have sex with someone pretty quickly (which I know isn&amp;#39;t always a good thing) and then find it difficult to communicate with them. I guess I haven&amp;#39;t gotten close enough with a guy (apart from male friends) to be that honest with them. It never gets that far. \nI have repeated the same mistakes, with such different kinds of guys. I just go inward. I don&amp;#39;t really give them a chance because I just don&amp;#39;t see the point after watching so many relationships end in complete fucking heartbreak. Watching your mother cry and weep and fall apart as a child, repeatedly, just doesn&amp;#39;t make it seem so appealing. Then on the other hand I do long to be loved and to love (naturally) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg6p1sh", "score_hidden": false, "stickied": false, "created": 1492065766.0, "created_utc": 1492036966.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5x33f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PurplePlurple", "parent_id": "t3_64y49t", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "You deleted a comment that I was going to reply to... so I'm just going to post it in general....\n\n\n-------\n\nHave you ever tried talking to someone about your behavior? Or tried holding off on swx a little, to allow an emotional bond to develop? How soon do you have sex and what do you determine for the right time to start? Or perhaps it is emotional bonds in itself that area complicated? Would you say you sabotage the relationship through cynical expectations or do you close off on developing past a certain point because you're afraid of making a large investment? \n\nHave you ever talked to someone, when you feel close enough and trust them enough to bring it up - about what you struggle with and have you tried doing anything different as the relationship progresses? Dp you challenge yourself to experiment outside of your habits or would you say you mostly repeat the same mistakes?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You deleted a comment that I was going to reply to... so I&amp;#39;m just going to post it in general....&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Have you ever tried talking to someone about your behavior? Or tried holding off on swx a little, to allow an emotional bond to develop? How soon do you have sex and what do you determine for the right time to start? Or perhaps it is emotional bonds in itself that area complicated? Would you say you sabotage the relationship through cynical expectations or do you close off on developing past a certain point because you&amp;#39;re afraid of making a large investment? &lt;/p&gt;\n\n&lt;p&gt;Have you ever talked to someone, when you feel close enough and trust them enough to bring it up - about what you struggle with and have you tried doing anything different as the relationship progresses? Dp you challenge yourself to experiment outside of your habits or would you say you mostly repeat the same mistakes?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg5x33f", "score_hidden": false, "stickied": false, "created": 1492035545.0, "created_utc": 1492006745.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": "", "user_reports": [], "id": "dg6pamw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "squillicent", "parent_id": "t1_dg6b4s4", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Hey, thank you. I have started going to therapy, after years of trying it and not allowing it to work. It feels better this time around because it's my decision to go and I realise I need help. \nI guess I don't want a guy to fix all of my problems, but rather be healthy to enter into something where we are both stable in the first place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, thank you. I have started going to therapy, after years of trying it and not allowing it to work. It feels better this time around because it&amp;#39;s my decision to go and I realise I need help. \nI guess I don&amp;#39;t want a guy to fix all of my problems, but rather be healthy to enter into something where we are both stable in the first place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg6pamw", "score_hidden": false, "stickied": false, "created": 1492066064.0, "created_utc": 1492037264.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6b4s4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Crims0n5", "parent_id": "t3_64y49t", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Recognizing that there is a problem is often the first step to solving the problem. It's ok to ask for help. Have you considered therapy or counseling to help work through some of these issues you are facing? You don't have to accept that you're \"damaged goods\" or that you're high maintenance. You can take steps to deal and work through these feelings if you so choose. \n\nYou may be able to find local low-cost or free services that may help you immensely. Your work may even have free resources for you as well. The company I work for has an Employee Assistance Program that provided free counseling that helped me out. \n\nMy ex-gf, who I'm still amicable with, confided her feelings of depression and had issues similar to what you describe. I encouraged her to get help. As much as I love her, as much as I wanted to fix all of her problems, I wasn't the right guy for that particular job. She needed someone with a particular set of skills that I didn't have. It was a little rough finding the right person, but she's in a good place now and her quality of life greatly improved.\n\nGood luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Recognizing that there is a problem is often the first step to solving the problem. It&amp;#39;s ok to ask for help. Have you considered therapy or counseling to help work through some of these issues you are facing? You don&amp;#39;t have to accept that you&amp;#39;re &amp;quot;damaged goods&amp;quot; or that you&amp;#39;re high maintenance. You can take steps to deal and work through these feelings if you so choose. &lt;/p&gt;\n\n&lt;p&gt;You may be able to find local low-cost or free services that may help you immensely. Your work may even have free resources for you as well. The company I work for has an Employee Assistance Program that provided free counseling that helped me out. &lt;/p&gt;\n\n&lt;p&gt;My ex-gf, who I&amp;#39;m still amicable with, confided her feelings of depression and had issues similar to what you describe. I encouraged her to get help. As much as I love her, as much as I wanted to fix all of her problems, I wasn&amp;#39;t the right guy for that particular job. She needed someone with a particular set of skills that I didn&amp;#39;t have. It was a little rough finding the right person, but she&amp;#39;s in a good place now and her quality of life greatly improved.&lt;/p&gt;\n\n&lt;p&gt;Good luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg6b4s4", "score_hidden": false, "stickied": false, "created": 1492050505.0, "created_utc": 1492021705.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": "", "user_reports": [], "id": "dg6qgz3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EngineerinLA", "parent_id": "t1_dg6ol6t", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "I wasn't insinuating you're an idiot, let alone a complete one. I was just trying to make a metaphor to remind you that things that matter take time. Relationships are one of those things. Too many movies and TV shows make it sound like there's this one moment where you just know he's Neo. He's \"The One.\" That's bullshit. You might not know 6 months in, and you might know a year in. It won't be an \"aha!\" moment. It's a slow burn.\n\nAnd it's ok to analyze. Just take your time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wasn&amp;#39;t insinuating you&amp;#39;re an idiot, let alone a complete one. I was just trying to make a metaphor to remind you that things that matter take time. Relationships are one of those things. Too many movies and TV shows make it sound like there&amp;#39;s this one moment where you just know he&amp;#39;s Neo. He&amp;#39;s &amp;quot;The One.&amp;quot; That&amp;#39;s bullshit. You might not know 6 months in, and you might know a year in. It won&amp;#39;t be an &amp;quot;aha!&amp;quot; moment. It&amp;#39;s a slow burn.&lt;/p&gt;\n\n&lt;p&gt;And it&amp;#39;s ok to analyze. Just take your time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg6qgz3", "score_hidden": false, "stickied": false, "created": 1492067538.0, "created_utc": 1492038738.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ol6t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "squillicent", "parent_id": "t1_dg60015", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Despite my grammar mistakes I'm not a complete idiot, and am very aware \"life isn't an iPhone game.\" Thanks for the response though.\nI'm not a doormat generally, nor when I date someone. I just overanalyse the whole situation to a point that I don't see any positive reason to continue seeing them.", "edited": 1492036718.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Despite my grammar mistakes I&amp;#39;m not a complete idiot, and am very aware &amp;quot;life isn&amp;#39;t an iPhone game.&amp;quot; Thanks for the response though.\nI&amp;#39;m not a doormat generally, nor when I date someone. I just overanalyse the whole situation to a point that I don&amp;#39;t see any positive reason to continue seeing them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg6ol6t", "score_hidden": false, "stickied": false, "created": 1492065203.0, "created_utc": 1492036403.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60015", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EngineerinLA", "parent_id": "t3_64y49t", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "You're a young woman. You need experience and possibly some therapy. Don't all in love with a guy who treats you like a doormat. And work on not being a doormat. Being a \"people pleaser\" doesn't mean you should be a doormat. You are a person, and you deserve respect. If you are disrespected repeatedly by the same person, you should exit stage left.\n\nRelationships are confusing. It takes time to learn. Life isn't an iPhone game, you need more than a week to get it right. Start dating and stop falling in love with every guy you date.\n\nThat being said, you're going to date a dozen or more shitheads until you find a good guy. That's just the way it is.\n\nSecondly, I'd teach her what the difference between \"effect\" and \"affect.\" It's more effective for us both if she knows how her daddy issues could affect our relationship. /EnglishLesson", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re a young woman. You need experience and possibly some therapy. Don&amp;#39;t all in love with a guy who treats you like a doormat. And work on not being a doormat. Being a &amp;quot;people pleaser&amp;quot; doesn&amp;#39;t mean you should be a doormat. You are a person, and you deserve respect. If you are disrespected repeatedly by the same person, you should exit stage left.&lt;/p&gt;\n\n&lt;p&gt;Relationships are confusing. It takes time to learn. Life isn&amp;#39;t an iPhone game, you need more than a week to get it right. Start dating and stop falling in love with every guy you date.&lt;/p&gt;\n\n&lt;p&gt;That being said, you&amp;#39;re going to date a dozen or more shitheads until you find a good guy. That&amp;#39;s just the way it is.&lt;/p&gt;\n\n&lt;p&gt;Secondly, I&amp;#39;d teach her what the difference between &amp;quot;effect&amp;quot; and &amp;quot;affect.&amp;quot; It&amp;#39;s more effective for us both if she knows how her daddy issues could affect our relationship. /EnglishLesson&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg60015", "score_hidden": false, "stickied": false, "created": 1492038893.0, "created_utc": 1492010093.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": "", "user_reports": [], "id": "dg5uy2f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PanzerBear88", "parent_id": "t3_64y49t", "subreddit_name_prefixed": "r/AskMen", "controversiality": 1, "body": "My first girlfriend, when I was a Freshman and Sophomore in College, had daddy issues. Partially because she was supposedly molested by him when she was really young. She had a lot of insecurities and was very controlling of me. So that was problematic. She ended up cheating on me and dumping me. Go figure.  So she was damaged goods.\n\nOn the other hand, my wife had hermits for parents, and an almost neglectful father who just didn't do anything or show affection. This has lead to some issues, especially early on the relationship, but I worked them out and we are great now - most of the time.\n\nEveryone has their own issues and varying degrees of damaged goods, whether it be from family or past relationships or weird expectations. Don't sweat it! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My first girlfriend, when I was a Freshman and Sophomore in College, had daddy issues. Partially because she was supposedly molested by him when she was really young. She had a lot of insecurities and was very controlling of me. So that was problematic. She ended up cheating on me and dumping me. Go figure.  So she was damaged goods.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, my wife had hermits for parents, and an almost neglectful father who just didn&amp;#39;t do anything or show affection. This has lead to some issues, especially early on the relationship, but I worked them out and we are great now - most of the time.&lt;/p&gt;\n\n&lt;p&gt;Everyone has their own issues and varying degrees of damaged goods, whether it be from family or past relationships or weird expectations. Don&amp;#39;t sweat it! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg5uy2f", "score_hidden": false, "stickied": false, "created": 1492032768.0, "created_utc": 1492003968.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": "", "user_reports": [], "id": "dg6rw89", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fragilestories", "parent_id": "t1_dg6pbgd", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "For what its worth, my father in law is great and we both have a good relationship with him. I wouldn't say she has daddy issues in the least.  \n\nBut that having been said she *loves* daddy play in the bedroom. It gets her off hard to be a good girl for daddy. \n\nEveryone has baggage. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For what its worth, my father in law is great and we both have a good relationship with him. I wouldn&amp;#39;t say she has daddy issues in the least.  &lt;/p&gt;\n\n&lt;p&gt;But that having been said she &lt;em&gt;loves&lt;/em&gt; daddy play in the bedroom. It gets her off hard to be a good girl for daddy. &lt;/p&gt;\n\n&lt;p&gt;Everyone has baggage. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg6rw89", "score_hidden": false, "stickied": false, "created": 1492069283.0, "created_utc": 1492040483.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pbgd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "squillicent", "parent_id": "t1_dg6a3jo", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "good point!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;good point!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg6pbgd", "score_hidden": false, "stickied": false, "created": 1492066093.0, "created_utc": 1492037293.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6a3jo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fragilestories", "parent_id": "t3_64y49t", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Everyone has baggage. The trick is finding someone whose baggage matches yours. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone has baggage. The trick is finding someone whose baggage matches yours. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg6a3jo", "score_hidden": false, "stickied": false, "created": 1492049446.0, "created_utc": 1492020646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": "", "user_reports": [], "id": "dg73kir", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "truthenragesyou", "parent_id": "t3_64y49t", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "One of the reasons my wife is with me is because of her daddy issues.  The age difference is 21 years with her the younger.  I'm fine with it, even if authoritarian control freaks are not okay with two adults in a consenting relationship.  I'm sure they'll weigh in with their ignorant bigotry below:", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of the reasons my wife is with me is because of her daddy issues.  The age difference is 21 years with her the younger.  I&amp;#39;m fine with it, even if authoritarian control freaks are not okay with two adults in a consenting relationship.  I&amp;#39;m sure they&amp;#39;ll weigh in with their ignorant bigotry below:&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg73kir", "score_hidden": false, "stickied": false, "created": 1492084098.0, "created_utc": 1492055298.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_64y49t", "likes": null, "replies": "", "user_reports": [], "id": "dg6cf1g", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Paratrooper_19D", "parent_id": "t3_64y49t", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "She calls me daddy now", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She calls me daddy now&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dg6cf1g", "score_hidden": false, "stickied": false, "created": 1492051816.0, "created_utc": 1492023016.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]