[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskMen", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have heard a lot recently about how prime working age men are falling out of the workforce like crazy. I&amp;#39;m interested in this because I&amp;#39;m going through it too... I&amp;#39;ve only had part time work in the past 2 years and it makes me feel like subhuman trash. I would love to hear from people who managed to re-enter productive society&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have heard a lot recently about how prime working age men are falling out of the workforce like crazy. I'm interested in this because I'm going through it too... I've only had part time work in the past 2 years and it makes me feel like subhuman trash. I would love to hear from people who managed to re-enter productive society", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65o0rk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 41, "report_reasons": null, "author": "Pill_Bug", "saved": false, "mod_reports": [], "name": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "approved_by": null, "over_18": false, "domain": "self.AskMen", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s30g", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskMen/comments/65o0rk/men_who_have_gone_through_long_periods_of/", "num_reports": null, "locked": false, "stickied": false, "created": 1492356547.0, "url": "https://www.reddit.com/r/AskMen/comments/65o0rk/men_who_have_gone_through_long_periods_of/", "author_flair_text": null, "quarantine": false, "title": "Men who have gone through long periods of unemployment, what is your story? Did you get out of it? If not how do you survive?", "created_utc": 1492327747.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 41}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgc0b70", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Dubstomp", "parent_id": "t1_dgbzk79", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "I'm glad to hear that man, good for you! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad to hear that man, good for you! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgc0b70", "score_hidden": false, "stickied": false, "created": 1492377013.0, "created_utc": 1492348213.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbzk79", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "rapiertwit", "parent_id": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Quit my job to stay at home with the baby.  When we decided that I should go back to work and he should go to preschool, it took me over a year to find a job.  That was tough, because we had to add the expense of preschool to our already lean budget in order to give me the time and freedom to do a job search.  You can't lug a toddler into job interviews, dig?  Also, I couldn't just take *any* job until the right one came along, because we were saving money by doing part-time daycare, giving me some time for job searching and interviews but not paying the full rate.  If I had taken a schlep job just to make some money, we would have had to pay more to daycare and I would have much less time to look for a \"real\" job - a bad bargain.  But I felt extra useless during that period.  We took on some debt because of the long job search period.  My wife was never anything but supportive the whole time - we made the decision for me to stay at home, we accepted the risk, together, and that's how she always looked at it, even when she felt stressed by the sole-breadwinner burden.\n\nThe silver lining is, if I had found a job immediately in my previous field, I wouldn't have bungled into a completely new field that is actually a much better fit for me, and which I'm currently kicking ass at.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Quit my job to stay at home with the baby.  When we decided that I should go back to work and he should go to preschool, it took me over a year to find a job.  That was tough, because we had to add the expense of preschool to our already lean budget in order to give me the time and freedom to do a job search.  You can&amp;#39;t lug a toddler into job interviews, dig?  Also, I couldn&amp;#39;t just take &lt;em&gt;any&lt;/em&gt; job until the right one came along, because we were saving money by doing part-time daycare, giving me some time for job searching and interviews but not paying the full rate.  If I had taken a schlep job just to make some money, we would have had to pay more to daycare and I would have much less time to look for a &amp;quot;real&amp;quot; job - a bad bargain.  But I felt extra useless during that period.  We took on some debt because of the long job search period.  My wife was never anything but supportive the whole time - we made the decision for me to stay at home, we accepted the risk, together, and that&amp;#39;s how she always looked at it, even when she felt stressed by the sole-breadwinner burden.&lt;/p&gt;\n\n&lt;p&gt;The silver lining is, if I had found a job immediately in my previous field, I wouldn&amp;#39;t have bungled into a completely new field that is actually a much better fit for me, and which I&amp;#39;m currently kicking ass at.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgbzk79", "score_hidden": false, "stickied": false, "created": 1492375393.0, "created_utc": 1492346593.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgc61e1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "pylon567", "parent_id": "t1_dgc1ie6", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "I'm happy he has you in his life! It is incredibly fortunate for both of you to work through the adversity together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m happy he has you in his life! It is incredibly fortunate for both of you to work through the adversity together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgc61e1", "score_hidden": false, "stickied": false, "created": 1492386194.0, "created_utc": 1492357394.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgc64mx", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "tfresca", "parent_id": "t1_dgc1ie6", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "It's great you are supporting him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s great you are supporting him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgc64mx", "score_hidden": false, "stickied": false, "created": 1492386320.0, "created_utc": 1492357520.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1ie6", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "rjlupin86", "parent_id": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "My fiance is going through this now. We've been together just over 3 years and he's had on and off employment throughout. At the moment he's been unemployed for 9 months now. He was working as a digital artist, but was made redundant when the whole studio closed down. That got him really depressed because that was the first non pub/customer service job he had and he enjoyed it.\n\n\nAt the moment he is volunteering as a park ranger. He's always loved the outdoors/bushcraft, so he's trying to get into that field now. Thankfully my job pays enough that I can support us both. He's free to pursue his dreams and not worry about needing to make money right away. I want him to have a career doing something he loves and gives him purpose, so I'm doing everything I can to make sure that happens.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My fiance is going through this now. We&amp;#39;ve been together just over 3 years and he&amp;#39;s had on and off employment throughout. At the moment he&amp;#39;s been unemployed for 9 months now. He was working as a digital artist, but was made redundant when the whole studio closed down. That got him really depressed because that was the first non pub/customer service job he had and he enjoyed it.&lt;/p&gt;\n\n&lt;p&gt;At the moment he is volunteering as a park ranger. He&amp;#39;s always loved the outdoors/bushcraft, so he&amp;#39;s trying to get into that field now. Thankfully my job pays enough that I can support us both. He&amp;#39;s free to pursue his dreams and not worry about needing to make money right away. I want him to have a career doing something he loves and gives him purpose, so I&amp;#39;m doing everything I can to make sure that happens.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgc1ie6", "score_hidden": false, "stickied": false, "created": 1492379293.0, "created_utc": 1492350493.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgbzxss", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "NYExplore", "parent_id": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Sometimes you have to reinvent yourself to get back on track. I was a journalist for the first 9 years of my career and changed to public relations, mostly for the money.\n\nThe industry didn't fit me and it took some time to figure out my new path. In the meantime, I started doing some long-term consulting projects and got good names on my resume. \n\nAside from one seven month period, I kept projects going but I turned my goal to a full time job. Interviewing when you've got a gig is always easier, both because you go in more confident and you're seen as more in demand.\n\nAlmost two years ago while I was consulting for a well-known company , I interviewed at a top-tier law firm for a role that was a good fit and had attractive salary and benefits. I interviewed with 3 people, but it all came down to the fact that the department head and I had a good rapport and I got the job.\n\nI'm making twice what I was on one of those consulting gigs, but that overall experience was invaluable.\n\nI found just looking at jobs to see what's out there was helpful. I didn't even know my specific role existed anywhere 'till I started looking.\n\nGood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes you have to reinvent yourself to get back on track. I was a journalist for the first 9 years of my career and changed to public relations, mostly for the money.&lt;/p&gt;\n\n&lt;p&gt;The industry didn&amp;#39;t fit me and it took some time to figure out my new path. In the meantime, I started doing some long-term consulting projects and got good names on my resume. &lt;/p&gt;\n\n&lt;p&gt;Aside from one seven month period, I kept projects going but I turned my goal to a full time job. Interviewing when you&amp;#39;ve got a gig is always easier, both because you go in more confident and you&amp;#39;re seen as more in demand.&lt;/p&gt;\n\n&lt;p&gt;Almost two years ago while I was consulting for a well-known company , I interviewed at a top-tier law firm for a role that was a good fit and had attractive salary and benefits. I interviewed with 3 people, but it all came down to the fact that the department head and I had a good rapport and I got the job.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m making twice what I was on one of those consulting gigs, but that overall experience was invaluable.&lt;/p&gt;\n\n&lt;p&gt;I found just looking at jobs to see what&amp;#39;s out there was helpful. I didn&amp;#39;t even know my specific role existed anywhere &amp;#39;till I started looking.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgbzxss", "score_hidden": false, "stickied": false, "created": 1492376223.0, "created_utc": 1492347423.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgc1cwd", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "EDMWizard123", "parent_id": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "I'll share my dad's story. Don't want to give out too many details, but long story short:\n\n* graduated college in the mid 80s, got a great engineering job.\n\n* dad worked 8-6 at least five days a week. Sometimes he'd do work on weekends if he had to. Went to board meetings, job sites, etc. Did it all. He was pretty high up there in his company, did it for over 25 years. \n\n* 2011, he comes home to us and says the company was \"reorganizing\" and he was bought out. Got a years worth of pay and after that went on unemployment for a couple years. \n\nShit was... incredibly rough, and disheartening. It was tragic. There's really no other way to put it. Here is a man whose had such a huge part of his life that escaped him. You feel like you want to help, you want to say something, but what can you say to your father? What can you say to comfort the man who's taught you everything you know? \n\nI was at a loss for years. I had the stereotypical \"white middle class life\" growing up where everything was fine and I never really faced actual struggle. This thing hit me like a freight train because I never knew how to deal with adversity. To this day I can't comprehend how much this changed our lives, how much would be different if he never lost his job. I spend more time than I should thinking about this. \n\nMy father is working again, has been for a few years but it's not in engineering. He's not getting paid what he used to, but he's happier. It's not as stressful or demanding as his old job was. He'll be of retirement age within 10 years, so he'll just ride it out here. \n\nI'd say the biggest advantage you have at a younger age is being better with technology than older folks. Theoretically it should be easier for you to get back into it than it was for someone like my dad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll share my dad&amp;#39;s story. Don&amp;#39;t want to give out too many details, but long story short:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;graduated college in the mid 80s, got a great engineering job.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;dad worked 8-6 at least five days a week. Sometimes he&amp;#39;d do work on weekends if he had to. Went to board meetings, job sites, etc. Did it all. He was pretty high up there in his company, did it for over 25 years. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;2011, he comes home to us and says the company was &amp;quot;reorganizing&amp;quot; and he was bought out. Got a years worth of pay and after that went on unemployment for a couple years. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Shit was... incredibly rough, and disheartening. It was tragic. There&amp;#39;s really no other way to put it. Here is a man whose had such a huge part of his life that escaped him. You feel like you want to help, you want to say something, but what can you say to your father? What can you say to comfort the man who&amp;#39;s taught you everything you know? &lt;/p&gt;\n\n&lt;p&gt;I was at a loss for years. I had the stereotypical &amp;quot;white middle class life&amp;quot; growing up where everything was fine and I never really faced actual struggle. This thing hit me like a freight train because I never knew how to deal with adversity. To this day I can&amp;#39;t comprehend how much this changed our lives, how much would be different if he never lost his job. I spend more time than I should thinking about this. &lt;/p&gt;\n\n&lt;p&gt;My father is working again, has been for a few years but it&amp;#39;s not in engineering. He&amp;#39;s not getting paid what he used to, but he&amp;#39;s happier. It&amp;#39;s not as stressful or demanding as his old job was. He&amp;#39;ll be of retirement age within 10 years, so he&amp;#39;ll just ride it out here. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d say the biggest advantage you have at a younger age is being better with technology than older folks. Theoretically it should be easier for you to get back into it than it was for someone like my dad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgc1cwd", "score_hidden": false, "stickied": false, "created": 1492379018.0, "created_utc": 1492350218.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgc22cp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Hstrauma", "parent_id": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Honestly, I felt like trash most of the time. It was a period of about 4 years. \n\nWhat helped me through:\n\n1) waking up each day and checking the job boards.\n2) \"refreshing\" my resume and cover letter as much as possible, to gear it towards the job(s) I wanted.\n3)Working out during downtime.\n4) Alcohol (not excessive amounts, but there were some days I was too \"in my head\" about it...so drinking helped).\n5)accepting some job(s) that I didn't really want to do, but knew would get me where I wanted to be.\n\nAnd number 5 is very important, because eventually...it worked! While I'm not working my *dream* job right now (mainly because I don't know what that is)...I am doing exactly what I have had my eyes set on for several years now. :)\n\nHang in there, man! If you have any questions...let me know. I was unemployed for four months, and working a pretty crappy part time job for 3 1/2 years. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, I felt like trash most of the time. It was a period of about 4 years. &lt;/p&gt;\n\n&lt;p&gt;What helped me through:&lt;/p&gt;\n\n&lt;p&gt;1) waking up each day and checking the job boards.\n2) &amp;quot;refreshing&amp;quot; my resume and cover letter as much as possible, to gear it towards the job(s) I wanted.\n3)Working out during downtime.\n4) Alcohol (not excessive amounts, but there were some days I was too &amp;quot;in my head&amp;quot; about it...so drinking helped).\n5)accepting some job(s) that I didn&amp;#39;t really want to do, but knew would get me where I wanted to be.&lt;/p&gt;\n\n&lt;p&gt;And number 5 is very important, because eventually...it worked! While I&amp;#39;m not working my &lt;em&gt;dream&lt;/em&gt; job right now (mainly because I don&amp;#39;t know what that is)...I am doing exactly what I have had my eyes set on for several years now. :)&lt;/p&gt;\n\n&lt;p&gt;Hang in there, man! If you have any questions...let me know. I was unemployed for four months, and working a pretty crappy part time job for 3 1/2 years. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgc22cp", "score_hidden": false, "stickied": false, "created": 1492380267.0, "created_utc": 1492351467.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgc3qss", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "smokecheck1976", "parent_id": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Sheer tenacity.  A lot of hungry nights.  A computer and books at a local rural library.\n\nI owned my own business.  When my ex decided to take me down, she did so completely.  I wound up banned from my own business and my own accounts and was told that I could not set up a directly competing business for the duration of the divorce, because doing so would create legal issues with the business I owned but no longer ran.\n\nI went from in pretty good shape, nice house, spending time with my kids, new enough cars, money for vacations to $20 in my pocket, the clothes on my back, a half charged sell phone, and 1000 miles from help in less time than it takes you to bake a pizza.  Such is the nature of restraining orders in the United States, and no, I didn't do anything to deserve it, a lie will serve just as well as the truth.  It would be more than a year before I was 'allowed' to see my kids.  Just how fucked up is a system that 'allows' men to see their own children?\n\nAnyway, there I was.  Basically my entire life reduced to an ash cloud by a woman that supposedly loved me.  An old Army buddy wired me cash to come to his place, but he couldn't let me stay in the house.  So I stayed in a trailer that had neither electricity or running water, in the middle of a poor county in a town with a population just over 600.  Those first few weeks, I struggled with suicidal levels of depression.   then I guess I got hungry, I lost forty pounds in less than five weeks.\n\nMy friend was letting me do odd jobs around his farm, but there wasn't really enough, so I started literally walking house to house and farmette to farmette asking for work.  I can do just about any work you can think of on a house, and I grew up on a farm.  One of the guys that hired me for some work was a church deacon who asked me to come to church, which I did.  That led to me having steady work at about four of the older church members houses and farms and chicken dinner on Sundays.  One of them paid me with an old Ford Ranger that wasn't working and let me use his shop to work on it.  I got that old truck running like a top.  I got even more work through the church and word of mouth, I started changing a lot of oil in cars for a little cash.  I was eeking by, I moved from the trailer to a barn loft with electricity and indoor plumbing.  I can't tell you what it was like to experience that after a couple of months spent completely without.  \n\nThen I realized I had moved near a public library.  I identified a field if work that I thought looked promising, but knew I needed some certifications to work in.  So, I checked out books on the subject and started using the computers to prepare myself for the exams.  I passed the certification exams and got picked up through word or mouth at a local company, for less than half of what I used to earn, but more than I had been earning.\n\nI leveraged myself in the field pretty hard.  I took more certifications more rapidly than many said I could.  I switched companies 3 times in the next year and a half.  Found out my ex was abusing my kids and finally got to court.  I then found out, through the court, that my business had failed, she was living with her mom, and the guy she burnt me for had got her knocked up and skipped town when the business failed.  It was a hard fight, but I got my kids back.  Now, my life is better than it was in most ways.  I still deal with the scars that it left.\n\nI still have that old truck.\n\nTL;DR  Made it back thanks to friends, church, a local library, and unbending will.", "edited": 1492354815.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sheer tenacity.  A lot of hungry nights.  A computer and books at a local rural library.&lt;/p&gt;\n\n&lt;p&gt;I owned my own business.  When my ex decided to take me down, she did so completely.  I wound up banned from my own business and my own accounts and was told that I could not set up a directly competing business for the duration of the divorce, because doing so would create legal issues with the business I owned but no longer ran.&lt;/p&gt;\n\n&lt;p&gt;I went from in pretty good shape, nice house, spending time with my kids, new enough cars, money for vacations to $20 in my pocket, the clothes on my back, a half charged sell phone, and 1000 miles from help in less time than it takes you to bake a pizza.  Such is the nature of restraining orders in the United States, and no, I didn&amp;#39;t do anything to deserve it, a lie will serve just as well as the truth.  It would be more than a year before I was &amp;#39;allowed&amp;#39; to see my kids.  Just how fucked up is a system that &amp;#39;allows&amp;#39; men to see their own children?&lt;/p&gt;\n\n&lt;p&gt;Anyway, there I was.  Basically my entire life reduced to an ash cloud by a woman that supposedly loved me.  An old Army buddy wired me cash to come to his place, but he couldn&amp;#39;t let me stay in the house.  So I stayed in a trailer that had neither electricity or running water, in the middle of a poor county in a town with a population just over 600.  Those first few weeks, I struggled with suicidal levels of depression.   then I guess I got hungry, I lost forty pounds in less than five weeks.&lt;/p&gt;\n\n&lt;p&gt;My friend was letting me do odd jobs around his farm, but there wasn&amp;#39;t really enough, so I started literally walking house to house and farmette to farmette asking for work.  I can do just about any work you can think of on a house, and I grew up on a farm.  One of the guys that hired me for some work was a church deacon who asked me to come to church, which I did.  That led to me having steady work at about four of the older church members houses and farms and chicken dinner on Sundays.  One of them paid me with an old Ford Ranger that wasn&amp;#39;t working and let me use his shop to work on it.  I got that old truck running like a top.  I got even more work through the church and word of mouth, I started changing a lot of oil in cars for a little cash.  I was eeking by, I moved from the trailer to a barn loft with electricity and indoor plumbing.  I can&amp;#39;t tell you what it was like to experience that after a couple of months spent completely without.  &lt;/p&gt;\n\n&lt;p&gt;Then I realized I had moved near a public library.  I identified a field if work that I thought looked promising, but knew I needed some certifications to work in.  So, I checked out books on the subject and started using the computers to prepare myself for the exams.  I passed the certification exams and got picked up through word or mouth at a local company, for less than half of what I used to earn, but more than I had been earning.&lt;/p&gt;\n\n&lt;p&gt;I leveraged myself in the field pretty hard.  I took more certifications more rapidly than many said I could.  I switched companies 3 times in the next year and a half.  Found out my ex was abusing my kids and finally got to court.  I then found out, through the court, that my business had failed, she was living with her mom, and the guy she burnt me for had got her knocked up and skipped town when the business failed.  It was a hard fight, but I got my kids back.  Now, my life is better than it was in most ways.  I still deal with the scars that it left.&lt;/p&gt;\n\n&lt;p&gt;I still have that old truck.&lt;/p&gt;\n\n&lt;p&gt;TL;DR  Made it back thanks to friends, church, a local library, and unbending will.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgc3qss", "score_hidden": false, "stickied": false, "created": 1492382916.0, "created_utc": 1492354116.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgc45el", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Artgor", "parent_id": "t1_dgc3mwz", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgc45el", "score_hidden": false, "stickied": false, "created": 1492383527.0, "created_utc": 1492354727.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3mwz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "little_green_lamb", "parent_id": "t1_dgc2klg", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "Congrats!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congrats!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgc3mwz", "score_hidden": false, "stickied": false, "created": 1492382747.0, "created_utc": 1492353947.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc2klg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Artgor", "parent_id": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "My story. I'm Russian, graduated from university and worked for ~4 years as IT-consultant/analyst in ERP-systems implementation. It wasn't easy, which is common in consulting. For example, I didn't have any vacation in these 4 years. Also stressful. \n\nSo I decided to change things. Spent some time looking for alternatives and decided to try becoming data scientist - good money and seemed to be interesting. So I left the job and started self-education. I hoped that several months would be enough, but was really wrong... Everyone wants experienced workers. So I continued studying and looking for a job. It took me ~8 months and at last tomorrow I have my first working day! Had good enough savings from the previous jobs, they were enough to survive this period.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My story. I&amp;#39;m Russian, graduated from university and worked for ~4 years as IT-consultant/analyst in ERP-systems implementation. It wasn&amp;#39;t easy, which is common in consulting. For example, I didn&amp;#39;t have any vacation in these 4 years. Also stressful. &lt;/p&gt;\n\n&lt;p&gt;So I decided to change things. Spent some time looking for alternatives and decided to try becoming data scientist - good money and seemed to be interesting. So I left the job and started self-education. I hoped that several months would be enough, but was really wrong... Everyone wants experienced workers. So I continued studying and looking for a job. It took me ~8 months and at last tomorrow I have my first working day! Had good enough savings from the previous jobs, they were enough to survive this period.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgc2klg", "score_hidden": false, "stickied": false, "created": 1492381098.0, "created_utc": 1492352298.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgc2b71", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SmarkyMcFly", "parent_id": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "I've gone through a few stretches of being unemployed for about a year.  Once in 2012, and again in 2015-2016.  It's usually I find myself in a terrible job but I need the money and I don't bail when I need to bail.  I go about a week without sending out resume's, just getting used to not having to do the grind and all that.  Then I start sending our resume's like no ones business and I just wait.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve gone through a few stretches of being unemployed for about a year.  Once in 2012, and again in 2015-2016.  It&amp;#39;s usually I find myself in a terrible job but I need the money and I don&amp;#39;t bail when I need to bail.  I go about a week without sending out resume&amp;#39;s, just getting used to not having to do the grind and all that.  Then I start sending our resume&amp;#39;s like no ones business and I just wait.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgc2b71", "score_hidden": false, "stickied": false, "created": 1492380680.0, "created_utc": 1492351880.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgcujdc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CARBYHYDRATES_B_EVIL", "parent_id": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "I've apparently become unemployable. Was tired of working through employment agencies, and decided that I'd never do it again. Went through most of the recession jobless, and towards the end of it couldn't even get a call back. I think I got contacted once for a dishwasher job. Eventually went back to an employment agency because I was at the end of my credit, and got a job I really didn't like. They wound up hiring me, (first time I've ever been hired when working in an employment agency temp job) and proceeded to treat me like they really didn't want me there. It was a job that employed a lot of tougher luck cases, such as minorities, immigrants, and ex-cons. I don't consider myself to be in that group, (as I am a privileged white man) but maybe I'm overestimating my situation. Anyway, there were better jobs at the company, and all you had to do was pass a proficiency test to get them. My plan was to work there a year or so, and then try to find something I liked better. I didn't go for the jobs on the board, because I felt like I'd be \"taking\" them from people that might not have other options.\n\nI had to work on a line with a lot of other personalities. I tried to be as inconspicuous as possible, which actually might have made things worse for me. Eventually got tired of being rubbed the wrong way, and put in for a custodian job to have a little autonomy. I figure no one really wanted the job, so I wasn't \"taking\" it from anybody. Got into the job, and the company wouldn't buy me supplies. Wound up having to go to a janitorial supply store, and then go to accounting to get reimbursed. I was shocked they hired me, and it really didn't seem like they wanted me to stay there. I'm not sure why that was. Maybe there were some people that wanted me there, while most didn't.\n\nI eventually got fed up trying to do the custodial job without any support, and asked if I could go back to the floor. I was granted the request, and the custodian they replaced with got stocked up with supplies right away. I mean, I don't know how you could make it more obvious that you were trying to antagonize me than by fully supporting the person you're replacing me with. Anyway, I was trying to finish out my year, and found out about some programs that will help you buy a house. So, I thought I'd stick out there until I could get a home loan. That's when things went from bad to worse, and I started getting treated more and more poorly. I was put on the worst lines where I was lugging the heaviest stuff. I know that they wanted to get rid of me, but I really wanted to stick it out and get my house. They eventually fired me for \"clashing with their workplace culture,\" which I'd probably agree with. Funny thing, though, they didn't fire me until I told them I wanted to stick around a while longer and buy a house. I guess that's what I get for being honest with them. Haven't worked since, and I'm hesitant to get back into the workforce. I'm afraid the same thing is going to happen again.\n\nBTW, this may sound like a negative account from a negative person, but I didn't start out this way. I really wanted to make this work, because I hadn't been regularly employed in so long. They really seemed to want to be rid of me, though. I'm not sure what you do when the company you're working for doesn't want you working for them.\n\nAnyway, I need to find some way to get by. The economy is a little better now, so it might be easier to make enough for food and rent. Regular employment doesn't seem to be an option for me, though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve apparently become unemployable. Was tired of working through employment agencies, and decided that I&amp;#39;d never do it again. Went through most of the recession jobless, and towards the end of it couldn&amp;#39;t even get a call back. I think I got contacted once for a dishwasher job. Eventually went back to an employment agency because I was at the end of my credit, and got a job I really didn&amp;#39;t like. They wound up hiring me, (first time I&amp;#39;ve ever been hired when working in an employment agency temp job) and proceeded to treat me like they really didn&amp;#39;t want me there. It was a job that employed a lot of tougher luck cases, such as minorities, immigrants, and ex-cons. I don&amp;#39;t consider myself to be in that group, (as I am a privileged white man) but maybe I&amp;#39;m overestimating my situation. Anyway, there were better jobs at the company, and all you had to do was pass a proficiency test to get them. My plan was to work there a year or so, and then try to find something I liked better. I didn&amp;#39;t go for the jobs on the board, because I felt like I&amp;#39;d be &amp;quot;taking&amp;quot; them from people that might not have other options.&lt;/p&gt;\n\n&lt;p&gt;I had to work on a line with a lot of other personalities. I tried to be as inconspicuous as possible, which actually might have made things worse for me. Eventually got tired of being rubbed the wrong way, and put in for a custodian job to have a little autonomy. I figure no one really wanted the job, so I wasn&amp;#39;t &amp;quot;taking&amp;quot; it from anybody. Got into the job, and the company wouldn&amp;#39;t buy me supplies. Wound up having to go to a janitorial supply store, and then go to accounting to get reimbursed. I was shocked they hired me, and it really didn&amp;#39;t seem like they wanted me to stay there. I&amp;#39;m not sure why that was. Maybe there were some people that wanted me there, while most didn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;I eventually got fed up trying to do the custodial job without any support, and asked if I could go back to the floor. I was granted the request, and the custodian they replaced with got stocked up with supplies right away. I mean, I don&amp;#39;t know how you could make it more obvious that you were trying to antagonize me than by fully supporting the person you&amp;#39;re replacing me with. Anyway, I was trying to finish out my year, and found out about some programs that will help you buy a house. So, I thought I&amp;#39;d stick out there until I could get a home loan. That&amp;#39;s when things went from bad to worse, and I started getting treated more and more poorly. I was put on the worst lines where I was lugging the heaviest stuff. I know that they wanted to get rid of me, but I really wanted to stick it out and get my house. They eventually fired me for &amp;quot;clashing with their workplace culture,&amp;quot; which I&amp;#39;d probably agree with. Funny thing, though, they didn&amp;#39;t fire me until I told them I wanted to stick around a while longer and buy a house. I guess that&amp;#39;s what I get for being honest with them. Haven&amp;#39;t worked since, and I&amp;#39;m hesitant to get back into the workforce. I&amp;#39;m afraid the same thing is going to happen again.&lt;/p&gt;\n\n&lt;p&gt;BTW, this may sound like a negative account from a negative person, but I didn&amp;#39;t start out this way. I really wanted to make this work, because I hadn&amp;#39;t been regularly employed in so long. They really seemed to want to be rid of me, though. I&amp;#39;m not sure what you do when the company you&amp;#39;re working for doesn&amp;#39;t want you working for them.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I need to find some way to get by. The economy is a little better now, so it might be easier to make enough for food and rent. Regular employment doesn&amp;#39;t seem to be an option for me, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgcujdc", "score_hidden": false, "stickied": false, "created": 1492418769.0, "created_utc": 1492389969.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgbv026", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GingerJack76", "parent_id": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "controversiality": 1, "body": "I've never had a problem finding a job, maybe it's just because I've gotten a lot of work experience and I'm willing to do just about anything to get the job. There was a time where I had be laid off from a welding factory jobs due to the factory having problems and I was the youngest there, but within a week I got a job at a bakery and kept working.\n\nIf you're looking for better work, don't be afraid to bluff yourself into a job, I've done it several times and come to find that not only was I more than capable to do the job, I was actually really god at it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never had a problem finding a job, maybe it&amp;#39;s just because I&amp;#39;ve gotten a lot of work experience and I&amp;#39;m willing to do just about anything to get the job. There was a time where I had be laid off from a welding factory jobs due to the factory having problems and I was the youngest there, but within a week I got a job at a bakery and kept working.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re looking for better work, don&amp;#39;t be afraid to bluff yourself into a job, I&amp;#39;ve done it several times and come to find that not only was I more than capable to do the job, I was actually really god at it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgbv026", "score_hidden": false, "stickied": false, "created": 1492361248.0, "created_utc": 1492332448.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s30g", "removal_reason": null, "link_id": "t3_65o0rk", "likes": null, "replies": "", "user_reports": [], "id": "dgcfnj2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TerminalOrbit", "parent_id": "t3_65o0rk", "subreddit_name_prefixed": "r/AskMen", "controversiality": 0, "body": "I became my wife's house-husband. The kids are almost self-sufficient, now, and I'm looking for more lucrative employment, again...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I became my wife&amp;#39;s house-husband. The kids are almost self-sufficient, now, and I&amp;#39;m looking for more lucrative employment, again...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskMen", "name": "t1_dgcfnj2", "score_hidden": false, "stickied": false, "created": 1492398959.0, "created_utc": 1492370159.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]