[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "NoFap", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello fellow Fapstronauts,&lt;/p&gt;\n\n&lt;p&gt;This is gonna be a pretty long read so grab a healthy snack on your way ;), otherwise TL;DR is below if you need...&lt;/p&gt;\n\n&lt;p&gt;_&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been with the NoFap for about a year or so and I&amp;#39;ve definitely seen it&amp;#39;s improvements in my life, only posted once or twice, nothing very beneficial to others in the community. &lt;/p&gt;\n\n&lt;p&gt;.&lt;/p&gt;\n\n&lt;p&gt;Today I come with a warning to you all, since I have made this grave mistake and I wish this won&amp;#39;t happen to you.\nSo to start off, in the new year I was at day 0 again and decided to have a fresh start and go no porn and no masturbation for the entire 2017... previously I&amp;#39;ve had about a 40 - 70 day streaks, but never made it to the 90 day milestone. &lt;/p&gt;\n\n&lt;p&gt;About 3 months later I was on day 80 I felt super depressed for some reason and MO&amp;#39;d once...\nI felt super horrible the next entire morning, but quickly recovered in the afternoon. Funny thing about relapses on long streaks, you recover a lot faster and regain the NoFap &amp;quot;superpowers&amp;quot; back very quickly... but that&amp;#39;s what slipped me up later on...&lt;/p&gt;\n\n&lt;p&gt;I basically hit my 90 day milestone 10 days later... On the 12th day, I thought it wouldn&amp;#39;t hurt to watch Porn once in a while if I could control it and it was also to celebrate my &amp;quot;basically 90 day milestone&amp;quot;. So I PMO&amp;#39;d that day and Funny thing was, the next day I felt completely fine after my relapse, I still felt normal and I didn&amp;#39;t feel any significant difference from when I was on my streak. &lt;/p&gt;\n\n&lt;p&gt;5 days of no PMO later Spring Break had arrived, I began to question NoFap because I still did not think a relapse &amp;quot;once in a while&amp;quot; would hurt. I also managed to rationalize watching porn again by thinking that I would recover from the effects when school came back. I binged for 3 days in a row with the only bad effect of being slightly tired and a little unproductive. But however the 4th day, a very busy day where I didn&amp;#39;t find the time to PMO, I was super cranky and reacted pretty angrily to small things that slightly pissed me off. I also responded pretty rudely to my parents because I was so caught up in the work I was rushing to finish that day. But, I never really thought of that as an effect of the relapse, considered it to more of just a terrible day of my week.&lt;/p&gt;\n\n&lt;p&gt;After 3 short days of no PMO vacation, I came back craving for PMO bc of the Chaser Effect. I was doubting NoFap more because I still felt pretty normal and the full effects of a relapse hadn&amp;#39;t hit me fully yet... keyword - YET! I tried to rationalize fapping by trying to search for a small piece of evidence that NoFap is fake, even though 95% of my results showed it was real and it&amp;#39;s significant benefits. I relapsed that day and again the next day also because at that point the Chaser Effect was already in place. - In summary that was 6 relapses in a span of 2 weeks with little feelings of negative effects -&lt;/p&gt;\n\n&lt;p&gt;.&lt;/p&gt;\n\n&lt;p&gt;The day after when school arrived. That&amp;#39;s when the negative effects of PMO started hitting me at full throttle. I felt absolutely horrible, I was so tired and had no energy at all. I had ZERO motivation for socializing with some close classmates,even though when I was on my long streak, I was always looking to socialize with anyone, including strangers. During my NoFap streak, I&amp;#39;ve had my bad days because that&amp;#39;s part of life, but nothing in comparison to this. There is zero motivation to do anything, even typing up this post right now. I feel a lot more negative in my daily actions, seeing everything half empty instead of half full with lower self-esteem. It&amp;#39;s 2 days without PMO currently and I still have brain fog and I feel dead on the inside wishing I was back to my 90+day streak. I am never gonna rationalize PMO again. NEVER.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR and Conclusion of what I&amp;#39;ve learned: You CANNOT control PMO, there is no such thing as &amp;quot;once in a while.&amp;quot; And If you happen to  relapse on a long streak EVEN THOUGH YOU MIGHT NOT FEEL HORRIBLE AT FIRST, definitely do not binge, not even once, because the horrible feelings will hit you eventually and it will hit you hard. Everyone has bad days, it is part of life, and watching porn or masturbating once will definitely not help you in any way, it only will make you feel worse later on.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m gonna sign off with this last thought...\n &lt;strong&gt;Live everyday like it&amp;#39;s your last, You could die tomorrow for all you know. Don&amp;#39;t waste your time shamefully fapping to mere pixels because you will regret it and regret is one of the worst feelings in the world&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;~Stay strong brothers (and sisters) and Cheers to a better tomorrow and a better life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello fellow Fapstronauts,\n\nThis is gonna be a pretty long read so grab a healthy snack on your way ;), otherwise TL;DR is below if you need...\n\n_\n\nI've been with the NoFap for about a year or so and I've definitely seen it's improvements in my life, only posted once or twice, nothing very beneficial to others in the community. \n\n.\n\n\nToday I come with a warning to you all, since I have made this grave mistake and I wish this won't happen to you.\nSo to start off, in the new year I was at day 0 again and decided to have a fresh start and go no porn and no masturbation for the entire 2017... previously I've had about a 40 - 70 day streaks, but never made it to the 90 day milestone. \n\nAbout 3 months later I was on day 80 I felt super depressed for some reason and MO'd once...\nI felt super horrible the next entire morning, but quickly recovered in the afternoon. Funny thing about relapses on long streaks, you recover a lot faster and regain the NoFap \"superpowers\" back very quickly... but that's what slipped me up later on...\n\nI basically hit my 90 day milestone 10 days later... On the 12th day, I thought it wouldn't hurt to watch Porn once in a while if I could control it and it was also to celebrate my \"basically 90 day milestone\". So I PMO'd that day and Funny thing was, the next day I felt completely fine after my relapse, I still felt normal and I didn't feel any significant difference from when I was on my streak. \n\n5 days of no PMO later Spring Break had arrived, I began to question NoFap because I still did not think a relapse \"once in a while\" would hurt. I also managed to rationalize watching porn again by thinking that I would recover from the effects when school came back. I binged for 3 days in a row with the only bad effect of being slightly tired and a little unproductive. But however the 4th day, a very busy day where I didn't find the time to PMO, I was super cranky and reacted pretty angrily to small things that slightly pissed me off. I also responded pretty rudely to my parents because I was so caught up in the work I was rushing to finish that day. But, I never really thought of that as an effect of the relapse, considered it to more of just a terrible day of my week.\n\n After 3 short days of no PMO vacation, I came back craving for PMO bc of the Chaser Effect. I was doubting NoFap more because I still felt pretty normal and the full effects of a relapse hadn't hit me fully yet... keyword - YET! I tried to rationalize fapping by trying to search for a small piece of evidence that NoFap is fake, even though 95% of my results showed it was real and it's significant benefits. I relapsed that day and again the next day also because at that point the Chaser Effect was already in place. - In summary that was 6 relapses in a span of 2 weeks with little feelings of negative effects -\n\n.\n\nThe day after when school arrived. That's when the negative effects of PMO started hitting me at full throttle. I felt absolutely horrible, I was so tired and had no energy at all. I had ZERO motivation for socializing with some close classmates,even though when I was on my long streak, I was always looking to socialize with anyone, including strangers. During my NoFap streak, I've had my bad days because that's part of life, but nothing in comparison to this. There is zero motivation to do anything, even typing up this post right now. I feel a lot more negative in my daily actions, seeing everything half empty instead of half full with lower self-esteem. It's 2 days without PMO currently and I still have brain fog and I feel dead on the inside wishing I was back to my 90+day streak. I am never gonna rationalize PMO again. NEVER.\n\n**TL;DR and Conclusion of what I've learned: You CANNOT control PMO, there is no such thing as \"once in a while.\" And If you happen to  relapse on a long streak EVEN THOUGH YOU MIGHT NOT FEEL HORRIBLE AT FIRST, definitely do not binge, not even once, because the horrible feelings will hit you eventually and it will hit you hard. Everyone has bad days, it is part of life, and watching porn or masturbating once will definitely not help you in any way, it only will make you feel worse later on.**\n\nI'm gonna sign off with this last thought...\n **Live everyday like it's your last, You could die tomorrow for all you know. Don't waste your time shamefully fapping to mere pixels because you will regret it and regret is one of the worst feelings in the world** \n\n~Stay strong brothers (and sisters) and Cheers to a better tomorrow and a better life.\n  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "652dqi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 119, "report_reasons": null, "author": "StayGoldMan", "saved": false, "mod_reports": [], "name": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "approved_by": null, "over_18": false, "domain": "self.NoFap", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2skrn", "edited": 1492046196.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/NoFap/comments/652dqi/to_those_who_start_doubting_nofap_after_long/", "num_reports": null, "locked": false, "stickied": false, "created": 1492074487.0, "url": "https://www.reddit.com/r/NoFap/comments/652dqi/to_those_who_start_doubting_nofap_after_long/", "author_flair_text": null, "quarantine": false, "title": "To those who start doubting NoFap after long streaks...", "created_utc": 1492045687.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 25, "visited": false, "subreddit_type": "public", "ups": 119}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg7vmxs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yaxir", "parent_id": "t1_dg6z3gt", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "&gt;  I haven't fapped in about two years\n\nfucking legend !\n\ni hope to attain a similar and even greater status one day !\n\ni have fallen weak and have watched porn ... but haven't fapped and i hope to break free of this rut !\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I haven&amp;#39;t fapped in about two years&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;fucking legend !&lt;/p&gt;\n\n&lt;p&gt;i hope to attain a similar and even greater status one day !&lt;/p&gt;\n\n&lt;p&gt;i have fallen weak and have watched porn ... but haven&amp;#39;t fapped and i hope to break free of this rut !&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7vmxs", "score_hidden": false, "stickied": false, "created": 1492132734.0, "created_utc": 1492103934.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6z3gt", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "tempaccount599", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Damn man, thanks for sharing that! That's super vulnerable. You learned a cool lesson though and I'm glad to hear your getting back into it! Sometimes I forget what its like to fap, I haven't fapped in about two years but I get wet dreams every week so sometimes I always wonder how much of the benefits I'm actually still getting from it. Your post was encouraging for me to continue on with my journey, regardless of how I feel at then moment, because it could be a lot worse if I was fapping", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn man, thanks for sharing that! That&amp;#39;s super vulnerable. You learned a cool lesson though and I&amp;#39;m glad to hear your getting back into it! Sometimes I forget what its like to fap, I haven&amp;#39;t fapped in about two years but I get wet dreams every week so sometimes I always wonder how much of the benefits I&amp;#39;m actually still getting from it. Your post was encouraging for me to continue on with my journey, regardless of how I feel at then moment, because it could be a lot worse if I was fapping&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg6z3gt", "score_hidden": false, "stickied": false, "created": 1492078126.0, "created_utc": 1492049326.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg74y80", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "vibranttrip", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "my balls feel good", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;my balls feel good&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg74y80", "score_hidden": false, "stickied": false, "created": 1492086187.0, "created_utc": 1492057387.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg705nw", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DavidS121797", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Thank you for sharing. Good luck brother.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for sharing. Good luck brother.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg705nw", "score_hidden": false, "stickied": false, "created": 1492079436.0, "created_utc": 1492050636.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg8l7ke", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "StayGoldMan", "parent_id": "t1_dg7977g", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Glad I helped a brother out", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad I helped a brother out&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg8l7ke", "score_hidden": false, "stickied": false, "created": 1492163657.0, "created_utc": 1492134857.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7977g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "coolboy010417", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Wow, thanks a lot for sharing this man! Helped get me over a rough patch. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, thanks a lot for sharing this man! Helped get me over a rough patch. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7977g", "score_hidden": false, "stickied": false, "created": 1492094701.0, "created_utc": 1492065901.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg7a5dt", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "VoidDragon-", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Similar experiences. I'm back on the damn horse now. Let's fucking break the cycle.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Similar experiences. I&amp;#39;m back on the damn horse now. Let&amp;#39;s fucking break the cycle.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7a5dt", "score_hidden": false, "stickied": false, "created": 1492097252.0, "created_utc": 1492068452.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg7c20u", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "LKostyra", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I can 100% agree with this. I had a similar situation last year, however after 187 day streak. Now I'm struggling to get back to at least day 30, and today I feel I am closer than ever to achieve this goal.\n\nDon't fall into this trap. Just don't. We don't do streaks to just achieve another milestone and go back to where we were before. We do this to **completely get rid of this addiction**. Remember about this and stay strong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can 100% agree with this. I had a similar situation last year, however after 187 day streak. Now I&amp;#39;m struggling to get back to at least day 30, and today I feel I am closer than ever to achieve this goal.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t fall into this trap. Just don&amp;#39;t. We don&amp;#39;t do streaks to just achieve another milestone and go back to where we were before. We do this to &lt;strong&gt;completely get rid of this addiction&lt;/strong&gt;. Remember about this and stay strong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7c20u", "score_hidden": false, "stickied": false, "created": 1492102872.0, "created_utc": 1492074072.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg7afq7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RossFromBritain", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I can confirm, i did my first 90 days with very little difficulty and decided to go back to PMO 'once a week'.  i think i fapped once on day 90 and then after that was back to the usual 1-3 a day and lots of porn in no time. \nnow, i find no-fap much harder! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can confirm, i did my first 90 days with very little difficulty and decided to go back to PMO &amp;#39;once a week&amp;#39;.  i think i fapped once on day 90 and then after that was back to the usual 1-3 a day and lots of porn in no time. \nnow, i find no-fap much harder! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7afq7", "score_hidden": false, "stickied": false, "created": 1492098054.0, "created_utc": 1492069254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg7dbvd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mrrobot86", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Aweseome post! Thank you for giving me motivation.\nGood luck bro!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aweseome post! Thank you for giving me motivation.\nGood luck bro!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7dbvd", "score_hidden": false, "stickied": false, "created": 1492106769.0, "created_utc": 1492077969.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg8labq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "StayGoldMan", "parent_id": "t1_dg7i5pi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "We are all in this together man, let's beat this addiction once and for all", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We are all in this together man, let&amp;#39;s beat this addiction once and for all&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg8labq", "score_hidden": false, "stickied": false, "created": 1492163764.0, "created_utc": 1492134964.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7i5pi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "arniesays1", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Awesome post man. I agree with you fully. Like you, I learned this the hard way. \n\nEarlier in the year I was on a 50ish day streak and my ex gf came back to me. I was cool, confident, social, charismatic; it was awesome. I decided to masturbate (only to my imagine at this point) justifying it as making myself last longer when we have sex. Like you, I, too, didn't notice negative effects straight away. \n\nOver the following couple of weeks I began masturbating more and started doing it to porn. And because I didn't notice any negatives straight away I figured it would be fine to keep doing it. I began masturbating to porn more and more. Then the girl left me. Over the course of a few weeks I had turned from being cool and confident (as a result of my 50 day streak) to dull, flat, uninterested and unsocial. \n\nI'm back on the bandwagon. Today is day 12. I'm feeling the benefits already. I know with me there will come a point where the feeling of being calm, cool, social etc will become the norm; it will be a default feeling. At that point I may justify fapping again because I will no longer be gaining benefits from nofap. But at that point it's important to realise that one is no longer going after benefits but, instead, staying away from the negatives. And those negatives are aweful. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome post man. I agree with you fully. Like you, I learned this the hard way. &lt;/p&gt;\n\n&lt;p&gt;Earlier in the year I was on a 50ish day streak and my ex gf came back to me. I was cool, confident, social, charismatic; it was awesome. I decided to masturbate (only to my imagine at this point) justifying it as making myself last longer when we have sex. Like you, I, too, didn&amp;#39;t notice negative effects straight away. &lt;/p&gt;\n\n&lt;p&gt;Over the following couple of weeks I began masturbating more and started doing it to porn. And because I didn&amp;#39;t notice any negatives straight away I figured it would be fine to keep doing it. I began masturbating to porn more and more. Then the girl left me. Over the course of a few weeks I had turned from being cool and confident (as a result of my 50 day streak) to dull, flat, uninterested and unsocial. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m back on the bandwagon. Today is day 12. I&amp;#39;m feeling the benefits already. I know with me there will come a point where the feeling of being calm, cool, social etc will become the norm; it will be a default feeling. At that point I may justify fapping again because I will no longer be gaining benefits from nofap. But at that point it&amp;#39;s important to realise that one is no longer going after benefits but, instead, staying away from the negatives. And those negatives are aweful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7i5pi", "score_hidden": false, "stickied": false, "created": 1492117194.0, "created_utc": 1492088394.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg8ld3a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "StayGoldMan", "parent_id": "t1_dg7io7w", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "So glad to hear that man, that was my goal, not to let others make my same mistake! This made my entire time to write this post worth it. Keep going, we can do this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So glad to hear that man, that was my goal, not to let others make my same mistake! This made my entire time to write this post worth it. Keep going, we can do this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg8ld3a", "score_hidden": false, "stickied": false, "created": 1492163871.0, "created_utc": 1492135071.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7io7w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Clint117", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Thanks for your advice man, you just saved me from relapsing. All the best!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your advice man, you just saved me from relapsing. All the best!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7io7w", "score_hidden": false, "stickied": false, "created": 1492117959.0, "created_utc": 1492089159.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg7vkqe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "yaxir", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "&gt;Everyone has bad days, it is part of life, and watching porn or masturbating once will definitely not help you in any way, it only will make you feel worse later on.\n\nthis is golden\n\nalso , emphasis. it can be days or even some time ... some people go through difficult phases. it's not always a few 'days' but a proper time frame for some people to go through their battles and challenges of life.\n\none should persevere nonetheless ! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Everyone has bad days, it is part of life, and watching porn or masturbating once will definitely not help you in any way, it only will make you feel worse later on.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;this is golden&lt;/p&gt;\n\n&lt;p&gt;also , emphasis. it can be days or even some time ... some people go through difficult phases. it&amp;#39;s not always a few &amp;#39;days&amp;#39; but a proper time frame for some people to go through their battles and challenges of life.&lt;/p&gt;\n\n&lt;p&gt;one should persevere nonetheless ! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7vkqe", "score_hidden": false, "stickied": false, "created": 1492132667.0, "created_utc": 1492103867.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg82yic", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "turtledragon27", "parent_id": "t1_dg7vyin", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "That's what I did. Ultimately though it brought me back to porn. It felt ok at first, and I didn't think much of it when I started feeling terrible about myself again. It's like there's this part of me that is too willing to accept meaningless sadness. But now I have to push another streak so that I can get rid of the me that wants nothing but to wallow in the darkness all day. It's not worth it dude. 90 days is a milestone, not the end of the road.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I did. Ultimately though it brought me back to porn. It felt ok at first, and I didn&amp;#39;t think much of it when I started feeling terrible about myself again. It&amp;#39;s like there&amp;#39;s this part of me that is too willing to accept meaningless sadness. But now I have to push another streak so that I can get rid of the me that wants nothing but to wallow in the darkness all day. It&amp;#39;s not worth it dude. 90 days is a milestone, not the end of the road.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg82yic", "score_hidden": false, "stickied": false, "created": 1492140570.0, "created_utc": 1492111770.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg8lglh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "StayGoldMan", "parent_id": "t1_dg7vyin", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "No PMO is the way to go, trust me on this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No PMO is the way to go, trust me on this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg8lglh", "score_hidden": false, "stickied": false, "created": 1492164008.0, "created_utc": 1492135208.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7vyin", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cannotresetpassword", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I planned to do hard mode for 90 days, then start MO again to experience the difference. Now I'll have to reconsider.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I planned to do hard mode for 90 days, then start MO again to experience the difference. Now I&amp;#39;ll have to reconsider.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7vyin", "score_hidden": false, "stickied": false, "created": 1492133073.0, "created_utc": 1492104273.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg7bou9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "willpayforhelp", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I love u for this!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love u for this!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7bou9", "score_hidden": false, "stickied": false, "created": 1492101752.0, "created_utc": 1492072952.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg7brwy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "broccoli49", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Awesome!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7brwy", "score_hidden": false, "stickied": false, "created": 1492102012.0, "created_utc": 1492073212.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg7i8cr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wil1156x", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "\"Live everyday like it's your last, You could die tomorrow for all you know. Don't waste your time shamefully fapping to mere pixels because you will regret it and regret is one of the worst feelings in the world\"\nWell if I was gunna die tomorrow I dont think it matters what I did smh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Live everyday like it&amp;#39;s your last, You could die tomorrow for all you know. Don&amp;#39;t waste your time shamefully fapping to mere pixels because you will regret it and regret is one of the worst feelings in the world&amp;quot;\nWell if I was gunna die tomorrow I dont think it matters what I did smh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7i8cr", "score_hidden": false, "stickied": false, "created": 1492117307.0, "created_utc": 1492088507.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg7kb0j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sanketvaria29", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "what if if i have no reason to do nofap? because i got only 2 benefits one being productive (energy or zero laziness), and second helthy immunity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what if if i have no reason to do nofap? because i got only 2 benefits one being productive (energy or zero laziness), and second helthy immunity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7kb0j", "score_hidden": false, "stickied": false, "created": 1492120178.0, "created_utc": 1492091378.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg7o3w9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ffffffffffdddddsss", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "You know what's fucked up about the porn is? It numbs you, it kills all the motivation for self improvement and when you stay long enough on the strake your emotions return to you. And you can feel that there a lot of work a head. Right now reading your post I feel motivated but before nofap I would have ignored.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know what&amp;#39;s fucked up about the porn is? It numbs you, it kills all the motivation for self improvement and when you stay long enough on the strake your emotions return to you. And you can feel that there a lot of work a head. Right now reading your post I feel motivated but before nofap I would have ignored.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg7o3w9", "score_hidden": false, "stickied": false, "created": 1492124687.0, "created_utc": 1492095887.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_652dqi", "likes": null, "replies": "", "user_reports": [], "id": "dg8hr3k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EliThePinoy", "parent_id": "t3_652dqi", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Dying doesn't sound too bad", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dying doesn&amp;#39;t sound too bad&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg8hr3k", "score_hidden": false, "stickied": false, "created": 1492158913.0, "created_utc": 1492130113.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]