[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "NoFap", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey &lt;a href=\"/r/nofap\"&gt;r/nofap&lt;/a&gt;,&lt;/p&gt;\n\n&lt;p&gt;First off, let me just say that what follows is purely how I see things from my perspective. I don&amp;#39;t mean to speak for everybody in my particular demographic group, but all I want is to just state my observations and make some hopefully accurate generalizations. &lt;/p&gt;\n\n&lt;p&gt;As an Indian guy, the son of Indian immigrant parents growing up in America, I was faced with a lot of confusion and contradictions while being raised in two separate cultures. I won&amp;#39;t waste your time by talking about all the different types of confusion (and man, I could go on about this shit). I want to focus on the confusion revolving around my sexuality, and how a warped combination repressive Indian culture and American pornographic mass media left me all kinds of fucked-up. &lt;/p&gt;\n\n&lt;p&gt;My mother never used to let me talk to other girls, even when I was in elementary school. One time when I just was leaving middle school, she saw me talking to this Asian girl (we were just talking about an algebra test and what we got for our answers, nothing sexual) and she yelled at me about it for weeks, going as far as to check on me during the middle of the day and during my lunch hours to make sure I wasn&amp;#39;t communicating with members of the opposite sex (she got extra mad because it was a different race as well). My father was sick, weak, and irritable with kidney problems, and he didn&amp;#39;t care about being involved in my social life, leaving that mostly to my mother. This was around the same time I was going through puberty, and I was beginning to feel an attraction towards girls. When my mom was away at work and my dad was laying in bed upstairs coughing, I used to sneak downstairs and watch shitty TV shows involving a lot of sex because I was curious, and obviously, it felt good down there. This left me really confused. If girls were so evil like my mom made them out to be, how could they make me feel so good? I began to think about these things more deeply. It was only later after reading stuff online that I came across information on how repressive Indian culture was and how bad some Indian mothers could be with their sons, giving them too much unhealthy attention. I read about Freud and the Oedipus and Jocasta complexes (Western works of psychology). Sooner or later I realized that what my mom was doing to me was unhealthy.&lt;/p&gt;\n\n&lt;p&gt;At the same time, I blame American mass media and TV shows filled with sex for giving me a warped view of what my sexuality should be like as an Indian male. I used to watch the Big Bang Theory and always felt really sorry for Raj, the Indian astrophysicist. In the show, he was always surrounded by that which he wanted but could never have (white or blonde women) and the audience always laughed at him for this. To me this was just really sad. American society makes fun of Indian males in so many other ways (Apu in the Simpsons, the doctor stereotype). It&amp;#39;s like we&amp;#39;re a joke. You hear a lot about feminists complaining how women are oppressed and the alt-right or whatever about how white men are oppressed, but honestly, the Indian male raised in American society has got to be one of the most confused, displaced, and laughed-at demographics out there. Our parents don&amp;#39;t allow us to have relationships with members of the opposite sex and at the same time we&amp;#39;re bombarded with lustful and tempting images from advertising, TV, and of course, porn. It&amp;#39;s like getting someone addicted to drugs and then stopping the supply to watch and laugh while they go through withdrawals. It&amp;#39;s cruel and not right.&lt;/p&gt;\n\n&lt;p&gt;With nofap I&amp;#39;ve began to think about all these things in a lot more detail, and I&amp;#39;ve been trying to find my own way through all this. Nofap has given me the courage to defy my parents more- watching porn and MO&amp;#39;ing twice a day left me complacent and not caring about my situation. But now I feel very socially aware (in two ways, one where I&amp;#39;m actually more social with other people, and the other where I&amp;#39;m more aware of the mechanisms at play in society as a whole). In a way going through nofap has helped me reclaim some of my sexuality from the damage and confusion caused by the extremes of both cultures. I&amp;#39;ve still relapsed a lot but I plan to continue until I make it to 100 days, and maybe if I feel good about it, the rest of my life. &lt;/p&gt;\n\n&lt;p&gt;Thanks for reading, I know this was long. If there&amp;#39;s anybody else from different cultures here I would like to know your perspective as well&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey r/nofap,\n\nFirst off, let me just say that what follows is purely how I see things from my perspective. I don't mean to speak for everybody in my particular demographic group, but all I want is to just state my observations and make some hopefully accurate generalizations. \n\nAs an Indian guy, the son of Indian immigrant parents growing up in America, I was faced with a lot of confusion and contradictions while being raised in two separate cultures. I won't waste your time by talking about all the different types of confusion (and man, I could go on about this shit). I want to focus on the confusion revolving around my sexuality, and how a warped combination repressive Indian culture and American pornographic mass media left me all kinds of fucked-up. \n\nMy mother never used to let me talk to other girls, even when I was in elementary school. One time when I just was leaving middle school, she saw me talking to this Asian girl (we were just talking about an algebra test and what we got for our answers, nothing sexual) and she yelled at me about it for weeks, going as far as to check on me during the middle of the day and during my lunch hours to make sure I wasn't communicating with members of the opposite sex (she got extra mad because it was a different race as well). My father was sick, weak, and irritable with kidney problems, and he didn't care about being involved in my social life, leaving that mostly to my mother. This was around the same time I was going through puberty, and I was beginning to feel an attraction towards girls. When my mom was away at work and my dad was laying in bed upstairs coughing, I used to sneak downstairs and watch shitty TV shows involving a lot of sex because I was curious, and obviously, it felt good down there. This left me really confused. If girls were so evil like my mom made them out to be, how could they make me feel so good? I began to think about these things more deeply. It was only later after reading stuff online that I came across information on how repressive Indian culture was and how bad some Indian mothers could be with their sons, giving them too much unhealthy attention. I read about Freud and the Oedipus and Jocasta complexes (Western works of psychology). Sooner or later I realized that what my mom was doing to me was unhealthy.\n\nAt the same time, I blame American mass media and TV shows filled with sex for giving me a warped view of what my sexuality should be like as an Indian male. I used to watch the Big Bang Theory and always felt really sorry for Raj, the Indian astrophysicist. In the show, he was always surrounded by that which he wanted but could never have (white or blonde women) and the audience always laughed at him for this. To me this was just really sad. American society makes fun of Indian males in so many other ways (Apu in the Simpsons, the doctor stereotype). It's like we're a joke. You hear a lot about feminists complaining how women are oppressed and the alt-right or whatever about how white men are oppressed, but honestly, the Indian male raised in American society has got to be one of the most confused, displaced, and laughed-at demographics out there. Our parents don't allow us to have relationships with members of the opposite sex and at the same time we're bombarded with lustful and tempting images from advertising, TV, and of course, porn. It's like getting someone addicted to drugs and then stopping the supply to watch and laugh while they go through withdrawals. It's cruel and not right.\n\nWith nofap I've began to think about all these things in a lot more detail, and I've been trying to find my own way through all this. Nofap has given me the courage to defy my parents more- watching porn and MO'ing twice a day left me complacent and not caring about my situation. But now I feel very socially aware (in two ways, one where I'm actually more social with other people, and the other where I'm more aware of the mechanisms at play in society as a whole). In a way going through nofap has helped me reclaim some of my sexuality from the damage and confusion caused by the extremes of both cultures. I've still relapsed a lot but I plan to continue until I make it to 100 days, and maybe if I feel good about it, the rest of my life. \n\nThanks for reading, I know this was long. If there's anybody else from different cultures here I would like to know your perspective as well", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65exz6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 103, "report_reasons": null, "author": "anon1qazwsx", "saved": false, "mod_reports": [], "name": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "approved_by": null, "over_18": false, "domain": "self.NoFap", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2skrn", "edited": 1492224784.0, "link_flair_css_class": null, "author_flair_css_class": "under1", "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/NoFap/comments/65exz6/the_struggle_as_an_indian_male/", "num_reports": null, "locked": false, "stickied": false, "created": 1492229867.0, "url": "https://www.reddit.com/r/NoFap/comments/65exz6/the_struggle_as_an_indian_male/", "author_flair_text": "2 Days", "quarantine": false, "title": "The struggle as an Indian male", "created_utc": 1492201067.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 49, "visited": false, "subreddit_type": "public", "ups": 103}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dg9t5a3", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "rcricket1", "parent_id": "t1_dg9s5ul", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I guess we are buddy. It aint gonna be easy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess we are buddy. It aint gonna be easy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9t5a3", "score_hidden": false, "stickied": false, "created": 1492235346.0, "created_utc": 1492206546.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9s5ul", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "anon1qazwsx", "parent_id": "t1_dg9rnlf", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "There's a reason why both you and I are on here man. This is an issue that deserves awareness and attention just like any other social issue. In this regard we're both pioneers, trailblazers. We're treading on unfamiliar territory and we need to find out what's right and what's not", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a reason why both you and I are on here man. This is an issue that deserves awareness and attention just like any other social issue. In this regard we&amp;#39;re both pioneers, trailblazers. We&amp;#39;re treading on unfamiliar territory and we need to find out what&amp;#39;s right and what&amp;#39;s not&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9s5ul", "score_hidden": false, "stickied": false, "created": 1492234079.0, "created_utc": 1492205279.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgaawwq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Immortaldouche", "parent_id": "t1_dg9rnlf", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Its the same with boys in India dude. My mom didnt do as much as this guy's mon but she tuned me by saying that teenage love is wrong when we were watching a romantic movies or read out loud some article abt young people falling love from the newspaper and telling me how wrong it is. I am in my  mid 20s and still cant make a conversation with a girl. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its the same with boys in India dude. My mom didnt do as much as this guy&amp;#39;s mon but she tuned me by saying that teenage love is wrong when we were watching a romantic movies or read out loud some article abt young people falling love from the newspaper and telling me how wrong it is. I am in my  mid 20s and still cant make a conversation with a girl. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaawwq", "score_hidden": false, "stickied": false, "created": 1492260659.0, "created_utc": 1492231859.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rnlf", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "rcricket1", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I feel you man. Im an american born indian dude, Im in my early 20's. I never learned to embrace my sexuality, I dont even know how to be sexual other than jackin off. I really feel so lost and confused when it comes to girls. Its really sad sometimes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel you man. Im an american born indian dude, Im in my early 20&amp;#39;s. I never learned to embrace my sexuality, I dont even know how to be sexual other than jackin off. I really feel so lost and confused when it comes to girls. Its really sad sometimes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9rnlf", "score_hidden": false, "stickied": false, "created": 1492233436.0, "created_utc": 1492204636.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgafcla", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nichwich", "parent_id": "t1_dgaf0cy", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "It depends. \n\nThe negative stereotypes of asian males definitely has harmful effects on our dating lives, statistics have shown that asian males get 30% less responses than males of other races on online dating sites like Tinder. On the flip side, I do see where you're coming from. Being able to defy a stereotype definitely makes you look impressive - and the fact that other males of your race are stereotyped a certain way means that if you buck the stereotype you effectively become a rare commodity on the dating market. Personally, I do pretty well talking to girls because I have an extremely deep voice (which goes against the feminine asian male stereotype) and have a lot of interest in history and politics (which goes against the STEM asian stereotype). So yeah, stereotypes can be spun to your advantage but their effects are still mostly negative.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It depends. &lt;/p&gt;\n\n&lt;p&gt;The negative stereotypes of asian males definitely has harmful effects on our dating lives, statistics have shown that asian males get 30% less responses than males of other races on online dating sites like Tinder. On the flip side, I do see where you&amp;#39;re coming from. Being able to defy a stereotype definitely makes you look impressive - and the fact that other males of your race are stereotyped a certain way means that if you buck the stereotype you effectively become a rare commodity on the dating market. Personally, I do pretty well talking to girls because I have an extremely deep voice (which goes against the feminine asian male stereotype) and have a lot of interest in history and politics (which goes against the STEM asian stereotype). So yeah, stereotypes can be spun to your advantage but their effects are still mostly negative.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgafcla", "score_hidden": false, "stickied": false, "created": 1492270483.0, "created_utc": 1492241683.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaf0cy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sockrattes", "parent_id": "t1_dga4f0i", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "/u/nichwich\n&gt;  There's this stereotype that Asian dudes are completely sexless robots and are really unmasculine.\n\n/u/anon1qazwsx\n&gt;  American society makes fun of Indian males in so many other ways (Apu in the Simpsons, the doctor stereotype). It's like we're a joke.\n\nOnce you have realised this is actually an advantage and not a disadvantage, your game with girls will be unstoppable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/nichwich\"&gt;/u/nichwich&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There&amp;#39;s this stereotype that Asian dudes are completely sexless robots and are really unmasculine.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"/u/anon1qazwsx\"&gt;/u/anon1qazwsx&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;American society makes fun of Indian males in so many other ways (Apu in the Simpsons, the doctor stereotype). It&amp;#39;s like we&amp;#39;re a joke.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Once you have realised this is actually an advantage and not a disadvantage, your game with girls will be unstoppable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaf0cy", "score_hidden": false, "stickied": false, "created": 1492269594.0, "created_utc": 1492240794.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga4f0i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "anon1qazwsx", "parent_id": "t1_dg9u0g0", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "It's good to hear I'm not alone in thinking this way. I was also forced to focus on academics but I've kind of unintentionally turned this around on my parents, haha. They wanted me to be a doctor or engineer and forced me to take a bunch of STEM classes. But instead I found myself attracted to pure physics and mathematics (which pay less and are considered more artsy and \"useless\" within the STEM fields). The social awkwardness isn't as bad these days, I can talk to girls no problem, but still feel kind of awkward about it, and I'm looking to change that. \n\nBut yeah, the main problem is society and its perceptions and expectations and injustices. There's nothing intrinsically wrong with you or me. We just have to keep on doing our thing and say fuck society", "edited": 1492256608.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s good to hear I&amp;#39;m not alone in thinking this way. I was also forced to focus on academics but I&amp;#39;ve kind of unintentionally turned this around on my parents, haha. They wanted me to be a doctor or engineer and forced me to take a bunch of STEM classes. But instead I found myself attracted to pure physics and mathematics (which pay less and are considered more artsy and &amp;quot;useless&amp;quot; within the STEM fields). The social awkwardness isn&amp;#39;t as bad these days, I can talk to girls no problem, but still feel kind of awkward about it, and I&amp;#39;m looking to change that. &lt;/p&gt;\n\n&lt;p&gt;But yeah, the main problem is society and its perceptions and expectations and injustices. There&amp;#39;s nothing intrinsically wrong with you or me. We just have to keep on doing our thing and say fuck society&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga4f0i", "score_hidden": false, "stickied": false, "created": 1492250467.0, "created_utc": 1492221667.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9u0g0", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "nichwich", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Hey man, I'm Chinese American and I feel the same way you do. Asian men in general are portrayed as sexless and dorky in the media, and it doesn't help that Asian parents generally force Asian boys to focus on academics instead of social skills. \n\nPersonally I'm doing fine, I've gotten better at socializing and found myself a beautiful girlfriend just this year, but I can still see that ways both American and Asian society holds us back. People are always surprised to hear that I have a girlfriend. There's this stereotype that Asian dudes are completely sexless robots and are really unmasculine.\n\nI started embarking on my nofap journey just a few days ago as well. I completely agree that porn numbs us to the injustices society forces upon us - shoot me a PM if you ever want to talk about anything.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, I&amp;#39;m Chinese American and I feel the same way you do. Asian men in general are portrayed as sexless and dorky in the media, and it doesn&amp;#39;t help that Asian parents generally force Asian boys to focus on academics instead of social skills. &lt;/p&gt;\n\n&lt;p&gt;Personally I&amp;#39;m doing fine, I&amp;#39;ve gotten better at socializing and found myself a beautiful girlfriend just this year, but I can still see that ways both American and Asian society holds us back. People are always surprised to hear that I have a girlfriend. There&amp;#39;s this stereotype that Asian dudes are completely sexless robots and are really unmasculine.&lt;/p&gt;\n\n&lt;p&gt;I started embarking on my nofap journey just a few days ago as well. I completely agree that porn numbs us to the injustices society forces upon us - shoot me a PM if you ever want to talk about anything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9u0g0", "score_hidden": false, "stickied": false, "created": 1492236475.0, "created_utc": 1492207675.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dga5znt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "anon1qazwsx", "parent_id": "t1_dga02xa", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Thank you so much. I can't say I'm surprised at all the other Asian males who have commented here. Sometimes I feel that my father never talked to me about masculinity or how to be a man- but maybe this is good, maybe he wanted me to find my own way. My mom on the other hand is the repressive one. \n\nI also feel that sometimes I can't relate to those you call \"sexually liberated.\" I've been slowly building my own identity over time, focusing on academic pursuits of my own choosing and going to the gym. But there's still that sense of, like you call it, emotional isolation sometimes. I don't know why I want a romantic relationship so badly- is it because I simply want human affection or is it because I'm a sex-crazed pervert Indian like the media makes me out to be? That's kind of why I'm on nofap, I want to take back my sexuality and focus on it some more, ask the important questions of what I want and what I should do with my life. But for now, I'm just feel like I'm in a state of suspended animation and contemplation. When I eventually come out of it, I think that I will be more powerful in some way. I have a feeling", "edited": 1492224572.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much. I can&amp;#39;t say I&amp;#39;m surprised at all the other Asian males who have commented here. Sometimes I feel that my father never talked to me about masculinity or how to be a man- but maybe this is good, maybe he wanted me to find my own way. My mom on the other hand is the repressive one. &lt;/p&gt;\n\n&lt;p&gt;I also feel that sometimes I can&amp;#39;t relate to those you call &amp;quot;sexually liberated.&amp;quot; I&amp;#39;ve been slowly building my own identity over time, focusing on academic pursuits of my own choosing and going to the gym. But there&amp;#39;s still that sense of, like you call it, emotional isolation sometimes. I don&amp;#39;t know why I want a romantic relationship so badly- is it because I simply want human affection or is it because I&amp;#39;m a sex-crazed pervert Indian like the media makes me out to be? That&amp;#39;s kind of why I&amp;#39;m on nofap, I want to take back my sexuality and focus on it some more, ask the important questions of what I want and what I should do with my life. But for now, I&amp;#39;m just feel like I&amp;#39;m in a state of suspended animation and contemplation. When I eventually come out of it, I think that I will be more powerful in some way. I have a feeling&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga5znt", "score_hidden": false, "stickied": false, "created": 1492252743.0, "created_utc": 1492223943.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga02xa", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "tallvegan", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Hey man. I'm a 24 year old Indian American and I can definitely relate to this. You are not alone in experiencing the pressures of the Sexual Repression pushed by the Indian society/culture and the pressures of the Excessive Sexualization of seemingly everything pushed by the American/Western society/culture. \n\nIn terms of what I've experienced, we share a lot of similarities (surely like our fellow Indian-American male brethren). Growing up, sex or sexuality was not talked about at home. My parents ignored it completely. But it was strongly implied through very indirect comments and behavior that I was not to engage in any silly act and I was to be a “good boy”. Growing up, my mom told me that there are a lot of “bad girls” out there. They never get into the details. When I ask what a “bad girl is”, I am immediately told to stop asking questions, stop focusing on this, and stop wasting my time. It’s like they think they are protecting us by keeping us sexually unaware, but the added sexual repression leads us to being “all kinds of fucked up”, as you put it. Further, my dad never gave me the \"talk\" growing up; however I did receive an extremely watered down version before I got to college. My first exposure to learning about sexuality was when I was in the 7th grade in health class. Looking back, it was good that we learned those things; however, it just is not enough in my honest opinion. We never learned the dynamic sex has in relationships. I think students get screwed here. More specifically, I think Indian males get Especially screwed here. I think this because American public education does not do an extensive enough job of educating students about the normal/practical nature of sex itself and fails talking about it as a regular human activity. Sure, we learn the science of intercourse and what not. But we never get education on relationships and the dynamic sex plays in a relationship (if a couple chooses to engage in such activities). Indian males (I won’t even begin to talk about the Indian female perspective) are especially fucked here because the lack of sex education from school combined with the repressive nature of discussions related to sex, and lack thereof, coupled with, to be frank, the dictatorial nature of forced sexual repression by our parents at home leads to no positive destination. Depression, lack of identity, and confusion over one’s own body all result from this ignorant mindset to repress, repress, repress. Perhaps on a deeper level, feelings of not belonging or being unable to connect with peers (including girls) raised in more sexually liberated households and cultures. This sexual frustration can lead to emotional isolation and psychological distress. It’s really fucking sad. \n\nINTRA POST RANT: Ironically, after years of trying to prevent us from having sex and dating, now OUT THE FUCKING BLUE, our parents want us to get married and knock up our new wife so she can start popping out babies? This sudden change of heart coupled with the arrogant expectation that we will obey their every command when it comes to marriage is so God Damn ridiculous that it’s just fucking hilarious. You want me to get married now? I am just magically at the right age even though I didn’t really change in emotional/sexual maturity levels since last year? What, I’ve just immediately grown into manhood in the blink of an eye and you are now ok with me getting into an intimate relationship with a woman? Fuck off. \n\nSorry about for that.  \n\nIn conclusion, I know sexual repression from our culture can be emotionally frustrating and a huge blow to our self-confidence as men. Just know that you are not alone. You’ve got a community here to support you, and as part of this community, users like myself who hail from the same cultural background who can relate to you. \n\nI wish you the very best in your journey. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man. I&amp;#39;m a 24 year old Indian American and I can definitely relate to this. You are not alone in experiencing the pressures of the Sexual Repression pushed by the Indian society/culture and the pressures of the Excessive Sexualization of seemingly everything pushed by the American/Western society/culture. &lt;/p&gt;\n\n&lt;p&gt;In terms of what I&amp;#39;ve experienced, we share a lot of similarities (surely like our fellow Indian-American male brethren). Growing up, sex or sexuality was not talked about at home. My parents ignored it completely. But it was strongly implied through very indirect comments and behavior that I was not to engage in any silly act and I was to be a “good boy”. Growing up, my mom told me that there are a lot of “bad girls” out there. They never get into the details. When I ask what a “bad girl is”, I am immediately told to stop asking questions, stop focusing on this, and stop wasting my time. It’s like they think they are protecting us by keeping us sexually unaware, but the added sexual repression leads us to being “all kinds of fucked up”, as you put it. Further, my dad never gave me the &amp;quot;talk&amp;quot; growing up; however I did receive an extremely watered down version before I got to college. My first exposure to learning about sexuality was when I was in the 7th grade in health class. Looking back, it was good that we learned those things; however, it just is not enough in my honest opinion. We never learned the dynamic sex has in relationships. I think students get screwed here. More specifically, I think Indian males get Especially screwed here. I think this because American public education does not do an extensive enough job of educating students about the normal/practical nature of sex itself and fails talking about it as a regular human activity. Sure, we learn the science of intercourse and what not. But we never get education on relationships and the dynamic sex plays in a relationship (if a couple chooses to engage in such activities). Indian males (I won’t even begin to talk about the Indian female perspective) are especially fucked here because the lack of sex education from school combined with the repressive nature of discussions related to sex, and lack thereof, coupled with, to be frank, the dictatorial nature of forced sexual repression by our parents at home leads to no positive destination. Depression, lack of identity, and confusion over one’s own body all result from this ignorant mindset to repress, repress, repress. Perhaps on a deeper level, feelings of not belonging or being unable to connect with peers (including girls) raised in more sexually liberated households and cultures. This sexual frustration can lead to emotional isolation and psychological distress. It’s really fucking sad. &lt;/p&gt;\n\n&lt;p&gt;INTRA POST RANT: Ironically, after years of trying to prevent us from having sex and dating, now OUT THE FUCKING BLUE, our parents want us to get married and knock up our new wife so she can start popping out babies? This sudden change of heart coupled with the arrogant expectation that we will obey their every command when it comes to marriage is so God Damn ridiculous that it’s just fucking hilarious. You want me to get married now? I am just magically at the right age even though I didn’t really change in emotional/sexual maturity levels since last year? What, I’ve just immediately grown into manhood in the blink of an eye and you are now ok with me getting into an intimate relationship with a woman? Fuck off. &lt;/p&gt;\n\n&lt;p&gt;Sorry about for that.  &lt;/p&gt;\n\n&lt;p&gt;In conclusion, I know sexual repression from our culture can be emotionally frustrating and a huge blow to our self-confidence as men. Just know that you are not alone. You’ve got a community here to support you, and as part of this community, users like myself who hail from the same cultural background who can relate to you. &lt;/p&gt;\n\n&lt;p&gt;I wish you the very best in your journey. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga02xa", "score_hidden": false, "stickied": false, "created": 1492244555.0, "created_utc": 1492215755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgaj9hn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "peopleR2offended", "parent_id": "t1_dg9z0uz", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I'm none of this and I'm still FA", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m none of this and I&amp;#39;m still FA&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaj9hn", "score_hidden": false, "stickied": false, "created": 1492282559.0, "created_utc": 1492253759.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgame7u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "recovering_man", "parent_id": "t1_dg9z0uz", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "(1) and (4) are stupid. You shouldn't change who you are just to get the approval of a woman. That is itself acting like a pushover\n\nYou can be buff like a bodybuilder/fitness model and still act like a nerdy character. People will find you interesting because you are a walking contradiction \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(1) and (4) are stupid. You shouldn&amp;#39;t change who you are just to get the approval of a woman. That is itself acting like a pushover&lt;/p&gt;\n\n&lt;p&gt;You can be buff like a bodybuilder/fitness model and still act like a nerdy character. People will find you interesting because you are a walking contradiction &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgame7u", "score_hidden": false, "stickied": false, "created": 1492290393.0, "created_utc": 1492261593.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dga58ad", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anon1qazwsx", "parent_id": "t1_dg9z0uz", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Hey, first of all thanks for your response. I'm not sure I agree with all of your above points though. I'm on board with (2) and (3). But with regard to (1), to be honest, being an intellectual / academic type is a big part of who I am. It's not all of it, but it is an undeniable part of me. I'm really into physics / maths / computer science and I could have long interesting convos with anyone (male or female) who's also into these things. I don't try to outwardly portray myself like this but if it comes out that way I don't try hard to stop it either. I'm not sure if it's healthy to deny the stronger and powerful aspects of your personality in the pursuit of pussy.\n\nWith regard to (4) it's the same thing. Girls are in love with European accents like British, Irish, Italian. Every frickin' day on r/AskReddit there's the question \"what accents do you find sexy\" and Indian and Chinese never show up as answers, only the European ones. Why should I play the race game too? I know how to speak English, I know how to write grammatically correct English. I made perfect scores on the reading / writing sections of the SAT. But now, why should I change my accent when I'm more proficient than most native speakers, just because an Indian accent is considered gross and unsexy? Fuck that shit. Indian males everywhere should work hard to overcome stereotypes and collectively *make* our country's accent sexy. Like with (1) my accent is a part of who I am, and I'm not willing to change that in pursuit of pussy.\n\nEven though we disagree on the best way to overcome stereotypes, maybe we can at least agree that we should both do what works for us and say fuck society. We already have enough burdens placed on us by society, why take on more just for women? I don't think that's the point of nofap. I'm going to have to say no thanks man. But I respect your opinion and upvoted you anyway, I hope this sparks further discussion", "edited": 1492226653.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, first of all thanks for your response. I&amp;#39;m not sure I agree with all of your above points though. I&amp;#39;m on board with (2) and (3). But with regard to (1), to be honest, being an intellectual / academic type is a big part of who I am. It&amp;#39;s not all of it, but it is an undeniable part of me. I&amp;#39;m really into physics / maths / computer science and I could have long interesting convos with anyone (male or female) who&amp;#39;s also into these things. I don&amp;#39;t try to outwardly portray myself like this but if it comes out that way I don&amp;#39;t try hard to stop it either. I&amp;#39;m not sure if it&amp;#39;s healthy to deny the stronger and powerful aspects of your personality in the pursuit of pussy.&lt;/p&gt;\n\n&lt;p&gt;With regard to (4) it&amp;#39;s the same thing. Girls are in love with European accents like British, Irish, Italian. Every frickin&amp;#39; day on &lt;a href=\"/r/AskReddit\"&gt;r/AskReddit&lt;/a&gt; there&amp;#39;s the question &amp;quot;what accents do you find sexy&amp;quot; and Indian and Chinese never show up as answers, only the European ones. Why should I play the race game too? I know how to speak English, I know how to write grammatically correct English. I made perfect scores on the reading / writing sections of the SAT. But now, why should I change my accent when I&amp;#39;m more proficient than most native speakers, just because an Indian accent is considered gross and unsexy? Fuck that shit. Indian males everywhere should work hard to overcome stereotypes and collectively &lt;em&gt;make&lt;/em&gt; our country&amp;#39;s accent sexy. Like with (1) my accent is a part of who I am, and I&amp;#39;m not willing to change that in pursuit of pussy.&lt;/p&gt;\n\n&lt;p&gt;Even though we disagree on the best way to overcome stereotypes, maybe we can at least agree that we should both do what works for us and say fuck society. We already have enough burdens placed on us by society, why take on more just for women? I don&amp;#39;t think that&amp;#39;s the point of nofap. I&amp;#39;m going to have to say no thanks man. But I respect your opinion and upvoted you anyway, I hope this sparks further discussion&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga58ad", "score_hidden": false, "stickied": false, "created": 1492251657.0, "created_utc": 1492222857.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgajkkc", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "realn1ggaruinedbyprn", "parent_id": "t1_dg9z0uz", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "lmao this has to be a joke. this whole fucking thread lmaoooooooooo. how do white women validate your masculinity in any way? you guys are pathetic I can't believe the trash im reading in this post, let alone this sub. fucking hell.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lmao this has to be a joke. this whole fucking thread lmaoooooooooo. how do white women validate your masculinity in any way? you guys are pathetic I can&amp;#39;t believe the trash im reading in this post, let alone this sub. fucking hell.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgajkkc", "score_hidden": false, "stickied": false, "created": 1492283490.0, "created_utc": 1492254690.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9z0uz", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "HyakuShichifukujin", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Hey man.  Asian-Canadian here.  I feel you on all of this.  If we want to hook up with white girls (or let's face it, any girls), we have a stereotype to overcome - that we are unmasculine beta asocial/asexual nerds.  The unfortunate reality is that yes, western media does portray as such, but also many of us DO fit that stereotype.  And while it is an uphill battle, it is not one that you can't win.  If you want to overcome this, I suggest a few things you need to do:\n\n(1) If you are one, stop (overtly) being a nerd.  We can't get away with it.  You can have nerdy hobbies or work in nerdy professions, but you don't want to actively portray this as your primary image.\n\n(2) Disconnect from your parents as much as possible and as soon as possible, especially on topics of girls and sexuality.  This means things like MOVE OUT AS FAST AS YOU CAN, and don't listen to them regarding these things; downright ignore them if you have to.  It's YOUR life.\n\n(3) Join a gym, eat right, and get buff.  This will help SO much in countering any nerdy stereotypes.  Get a cool identifiable fashion style and lifestyle.\n\n(4) If you have an accent, get a speech coach and fix it.  Since you grew up in America, I'll assume that's not a problem for you.\n\nYes, it sucks about our upbringing and our repressive parents and all that.  But now that you're (or soon will be) an adult, it's time to take responsibility for your life.  Accept that time that you can't get back, and relentlessly work on yourself to overcome whatever weaknesses you have.  If you're over the age of 18 or 19 or so, there is nothing your parents can or cannot \"let\" you do - at this point it is YOU who is letting them do it to you.  If you adopt the right mindset and want it badly enough to take massive action, you'll make it.\n\nPersonal experience: I didn't get laid until my early 20s, and I was pretty depressed like you during my late teen years for many of the same reasons (though my parents weren't quite as bad as yours).  Now I'm in my late 20s, I've hooked up with 8 girls in my life, all of them white; one of them was a long-term relationship.  I'm not saying this to brag because those numbers are really nothing special, just to show you that if you want to overcome the stereotype, it's possible.  I also have an Indian friend who's had tons of white girlfriends, even while he still lived with his parents.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man.  Asian-Canadian here.  I feel you on all of this.  If we want to hook up with white girls (or let&amp;#39;s face it, any girls), we have a stereotype to overcome - that we are unmasculine beta asocial/asexual nerds.  The unfortunate reality is that yes, western media does portray as such, but also many of us DO fit that stereotype.  And while it is an uphill battle, it is not one that you can&amp;#39;t win.  If you want to overcome this, I suggest a few things you need to do:&lt;/p&gt;\n\n&lt;p&gt;(1) If you are one, stop (overtly) being a nerd.  We can&amp;#39;t get away with it.  You can have nerdy hobbies or work in nerdy professions, but you don&amp;#39;t want to actively portray this as your primary image.&lt;/p&gt;\n\n&lt;p&gt;(2) Disconnect from your parents as much as possible and as soon as possible, especially on topics of girls and sexuality.  This means things like MOVE OUT AS FAST AS YOU CAN, and don&amp;#39;t listen to them regarding these things; downright ignore them if you have to.  It&amp;#39;s YOUR life.&lt;/p&gt;\n\n&lt;p&gt;(3) Join a gym, eat right, and get buff.  This will help SO much in countering any nerdy stereotypes.  Get a cool identifiable fashion style and lifestyle.&lt;/p&gt;\n\n&lt;p&gt;(4) If you have an accent, get a speech coach and fix it.  Since you grew up in America, I&amp;#39;ll assume that&amp;#39;s not a problem for you.&lt;/p&gt;\n\n&lt;p&gt;Yes, it sucks about our upbringing and our repressive parents and all that.  But now that you&amp;#39;re (or soon will be) an adult, it&amp;#39;s time to take responsibility for your life.  Accept that time that you can&amp;#39;t get back, and relentlessly work on yourself to overcome whatever weaknesses you have.  If you&amp;#39;re over the age of 18 or 19 or so, there is nothing your parents can or cannot &amp;quot;let&amp;quot; you do - at this point it is YOU who is letting them do it to you.  If you adopt the right mindset and want it badly enough to take massive action, you&amp;#39;ll make it.&lt;/p&gt;\n\n&lt;p&gt;Personal experience: I didn&amp;#39;t get laid until my early 20s, and I was pretty depressed like you during my late teen years for many of the same reasons (though my parents weren&amp;#39;t quite as bad as yours).  Now I&amp;#39;m in my late 20s, I&amp;#39;ve hooked up with 8 girls in my life, all of them white; one of them was a long-term relationship.  I&amp;#39;m not saying this to brag because those numbers are really nothing special, just to show you that if you want to overcome the stereotype, it&amp;#39;s possible.  I also have an Indian friend who&amp;#39;s had tons of white girlfriends, even while he still lived with his parents.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9z0uz", "score_hidden": false, "stickied": false, "created": 1492243150.0, "created_utc": 1492214350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dga0k3y", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MenOfGondor", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Hit the gym=Destroy your insecurity\n\nTake the hits in life=Makes you grow\n\nI used to discriminate Indians back then but I realized they don't look for problems and aren't full of pride. You are just another brother in my eyes.\n\nKeep going brother, when someone laughs at you for being indian you laugh back. Don't take life to seriously, Learn to defend yourself\nAlways fight back, Never Bully. \n\nMMA=Realistic Superpowers \n\nI used to have a mother like that who cock blocked 85% of Girls until I left my home country to the U.S. Felt relaxed when I could do as I wish. It all starts with one step friend, this is your first step...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hit the gym=Destroy your insecurity&lt;/p&gt;\n\n&lt;p&gt;Take the hits in life=Makes you grow&lt;/p&gt;\n\n&lt;p&gt;I used to discriminate Indians back then but I realized they don&amp;#39;t look for problems and aren&amp;#39;t full of pride. You are just another brother in my eyes.&lt;/p&gt;\n\n&lt;p&gt;Keep going brother, when someone laughs at you for being indian you laugh back. Don&amp;#39;t take life to seriously, Learn to defend yourself\nAlways fight back, Never Bully. &lt;/p&gt;\n\n&lt;p&gt;MMA=Realistic Superpowers &lt;/p&gt;\n\n&lt;p&gt;I used to have a mother like that who cock blocked 85% of Girls until I left my home country to the U.S. Felt relaxed when I could do as I wish. It all starts with one step friend, this is your first step...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga0k3y", "score_hidden": false, "stickied": false, "created": 1492245192.0, "created_utc": 1492216392.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dga9w9x", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ToastedTree", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "As an American born white male, I can't STAND how this country portrays other cultures and ethnicities. To everyone who's not white living in America, PLEASE don't think every American thinks like this. So keep going man. Cross the desert and don't stop your journey. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As an American born white male, I can&amp;#39;t STAND how this country portrays other cultures and ethnicities. To everyone who&amp;#39;s not white living in America, PLEASE don&amp;#39;t think every American thinks like this. So keep going man. Cross the desert and don&amp;#39;t stop your journey. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga9w9x", "score_hidden": false, "stickied": false, "created": 1492258882.0, "created_utc": 1492230082.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dg9qtxi", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "anon1qazwsx", "parent_id": "t1_dg9qg49", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Thanks so much man! I appreciate your response. Your username is boss, by the way", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks so much man! I appreciate your response. Your username is boss, by the way&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9qtxi", "score_hidden": false, "stickied": false, "created": 1492232399.0, "created_utc": 1492203599.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9qg49", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "destinedtobeawarrior", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Im glad you found about NoFap. No matter what the American society throws in your face such as porn and masturbation dont fall for that nonsense. You are taking the right path and I wish you luck on your journey", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im glad you found about NoFap. No matter what the American society throws in your face such as porn and masturbation dont fall for that nonsense. You are taking the right path and I wish you luck on your journey&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9qg49", "score_hidden": false, "stickied": false, "created": 1492231926.0, "created_utc": 1492203126.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgaa9il", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "-TheMiracle", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "South Asian here as well and dude I can totally relate to y'all. Honestly, I am 24 years old but I probably stop developing socially and sexually after 12. I don't know man. Now I look at my life and where I am, I am completely depressed about it. If things weren't bad enough on top of all the bullshit, I am a fucking porn addict. I didn't intend life to be that  way but here we are. To get ahead in life, I have to fly where a normal person just walks and it will probably take huge amount of effort and time and most importantly belief which I lack. \n\nBut I also understand that no one owes me anything, and we cannot keep whining or blaming other people for our shitty lives. Not our parents or the media or whatever else that's holding us back man. Only we have the power to become the change we wish to see. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;South Asian here as well and dude I can totally relate to y&amp;#39;all. Honestly, I am 24 years old but I probably stop developing socially and sexually after 12. I don&amp;#39;t know man. Now I look at my life and where I am, I am completely depressed about it. If things weren&amp;#39;t bad enough on top of all the bullshit, I am a fucking porn addict. I didn&amp;#39;t intend life to be that  way but here we are. To get ahead in life, I have to fly where a normal person just walks and it will probably take huge amount of effort and time and most importantly belief which I lack. &lt;/p&gt;\n\n&lt;p&gt;But I also understand that no one owes me anything, and we cannot keep whining or blaming other people for our shitty lives. Not our parents or the media or whatever else that&amp;#39;s holding us back man. Only we have the power to become the change we wish to see. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaa9il", "score_hidden": false, "stickied": false, "created": 1492259523.0, "created_utc": 1492230723.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgadkcl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sanketvaria29", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I'm an indian from gujarat. I've read all comments below and I'm speechless. my parents had love marriage and they in fact wanted me to find a girl. yeah sorry i am lucky. but i hardly ever developed social skills plus i am a nerd and creative in painting. video games also became my part when we changed the home because there were no kids in neighbourhood. my parents are against pre merital sex but not other stuffs such as dating and all. lol... i am in totall opposite situation than you all. you guys parents do not side with you but mine, you guys want to go against them and be something and have a desire to but i have zero foundation and direction and 0 interest in talking to people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an indian from gujarat. I&amp;#39;ve read all comments below and I&amp;#39;m speechless. my parents had love marriage and they in fact wanted me to find a girl. yeah sorry i am lucky. but i hardly ever developed social skills plus i am a nerd and creative in painting. video games also became my part when we changed the home because there were no kids in neighbourhood. my parents are against pre merital sex but not other stuffs such as dating and all. lol... i am in totall opposite situation than you all. you guys parents do not side with you but mine, you guys want to go against them and be something and have a desire to but i have zero foundation and direction and 0 interest in talking to people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgadkcl", "score_hidden": false, "stickied": false, "created": 1492266047.0, "created_utc": 1492237247.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dga4lxr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anon1qazwsx", "parent_id": "t1_dg9xw0t", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Thanks for your story man. If I could go back in time and be my own parent I'd definitely do that. I keep thinking about what a good parent I'd be to myself and any kids I may have (but first I'd need to find a consenting female, haha). All this popular nonsense- porn, TV, sexy ads, fandoms, it's like they unintentionally brainwash you and turn you into addicts craving more and more. None of it means anything. Keep on focusing on yourself, med school, academics, gym, whatever elevates your mind, body, and spirit", "edited": 1492232174.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your story man. If I could go back in time and be my own parent I&amp;#39;d definitely do that. I keep thinking about what a good parent I&amp;#39;d be to myself and any kids I may have (but first I&amp;#39;d need to find a consenting female, haha). All this popular nonsense- porn, TV, sexy ads, fandoms, it&amp;#39;s like they unintentionally brainwash you and turn you into addicts craving more and more. None of it means anything. Keep on focusing on yourself, med school, academics, gym, whatever elevates your mind, body, and spirit&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga4lxr", "score_hidden": false, "stickied": false, "created": 1492250740.0, "created_utc": 1492221940.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xw0t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "edytimbaland", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I understand, I used to have a friend who came here from Pakistan and he had similar problems, he was constantly stressed and felt his life was shitty as hell. I told him about nofap as back then I'd just discovered it, and anything else I thought could help him but in the end I don't think I'll ever understand that struggle. I'm a lower middle class white male lol like- my only real struggle is not having my trying times taken seriously. But they don't need to be as much, as many things are already set out for us.\nOne thing we have in common is the influence of pornographic western society- I wish that I wasn't so heavily saturated with sexual references in shows from my late childhood till now- if I'd known any better I would have kept the amount of television and movies I watched to a minimum, not cared as much about if I was doing what everyone else was doing, and focused on important things that mattered to me (my studies, getting into medical school, things like that).\nYou can break out of the shell man, it's always possible to change. I've gone from popular kid to academic to outcast (in part thanks to PMO) to semi-popular to stoner to gym junkie and now I'm just doing me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand, I used to have a friend who came here from Pakistan and he had similar problems, he was constantly stressed and felt his life was shitty as hell. I told him about nofap as back then I&amp;#39;d just discovered it, and anything else I thought could help him but in the end I don&amp;#39;t think I&amp;#39;ll ever understand that struggle. I&amp;#39;m a lower middle class white male lol like- my only real struggle is not having my trying times taken seriously. But they don&amp;#39;t need to be as much, as many things are already set out for us.\nOne thing we have in common is the influence of pornographic western society- I wish that I wasn&amp;#39;t so heavily saturated with sexual references in shows from my late childhood till now- if I&amp;#39;d known any better I would have kept the amount of television and movies I watched to a minimum, not cared as much about if I was doing what everyone else was doing, and focused on important things that mattered to me (my studies, getting into medical school, things like that).\nYou can break out of the shell man, it&amp;#39;s always possible to change. I&amp;#39;ve gone from popular kid to academic to outcast (in part thanks to PMO) to semi-popular to stoner to gym junkie and now I&amp;#39;m just doing me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9xw0t", "score_hidden": false, "stickied": false, "created": 1492241645.0, "created_utc": 1492212845.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dga5m3n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "osamabinliftin1000", "parent_id": "t1_dga4nah", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Squats and deadlifts are the hardest movements in the gym, they also give you the best results. Throw in some pull ups, dips, some other barbell work and your gold. The gym really help me get out of the whole Indian nerd funk. Because at the end of the day 200lbs is always 200 lbs!. The movie fight club really helped me move on as well. I know exactly how you feel and trust me I've completely grown out of it. Your a man and you have the right to view life any way you see fit. The book physco cybernetics helped a lot too. Also pass on the encouragement. The more suave Indian guys we have running around banging hot ass girls and balling out the less the stereotype holds! I grew up as the only Brown guy amongst white people. Had a inferiority complex untill last few years. You deserve the best life has to offer as we all do! Internalize and focus on yourself! We come from one of the oldest cultures in Civilization. Our people are crafty and always find a way to succeed. Those who adapt and change thrive and survive", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Squats and deadlifts are the hardest movements in the gym, they also give you the best results. Throw in some pull ups, dips, some other barbell work and your gold. The gym really help me get out of the whole Indian nerd funk. Because at the end of the day 200lbs is always 200 lbs!. The movie fight club really helped me move on as well. I know exactly how you feel and trust me I&amp;#39;ve completely grown out of it. Your a man and you have the right to view life any way you see fit. The book physco cybernetics helped a lot too. Also pass on the encouragement. The more suave Indian guys we have running around banging hot ass girls and balling out the less the stereotype holds! I grew up as the only Brown guy amongst white people. Had a inferiority complex untill last few years. You deserve the best life has to offer as we all do! Internalize and focus on yourself! We come from one of the oldest cultures in Civilization. Our people are crafty and always find a way to succeed. Those who adapt and change thrive and survive&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga5m3n", "score_hidden": false, "stickied": false, "created": 1492252216.0, "created_utc": 1492223416.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga4nah", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "anon1qazwsx", "parent_id": "t1_dg9y5gk", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Definitely! Badass username, that's pretty original. I'm a complete beginner to lifting but have started a couple of weeks ago. I take two days of rest in between- do you think that's too much? I don't have anyone to give me noob lifting advice, maybe I can get some on here", "edited": 1492223231.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely! Badass username, that&amp;#39;s pretty original. I&amp;#39;m a complete beginner to lifting but have started a couple of weeks ago. I take two days of rest in between- do you think that&amp;#39;s too much? I don&amp;#39;t have anyone to give me noob lifting advice, maybe I can get some on here&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga4nah", "score_hidden": false, "stickied": false, "created": 1492250798.0, "created_utc": 1492221998.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9y5gk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "osamabinliftin1000", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "i feel you bro. 1st gen pakistani male here. very strict muslim household. fuck all the bullshit tho! as someone who had a very similar upbringing i can say with confidence that I have outgrown all the nonsense and started to have much success in all aspects of life. dont sweat the little shit. meditate, nofap, cold showers, lift!, and above all always read and challenge your way of thought. keep a open mind. Society is full of shit and the sooner you realize that all the social conditioning faded away and what is left is a motherfucking lion alpha male! \n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i feel you bro. 1st gen pakistani male here. very strict muslim household. fuck all the bullshit tho! as someone who had a very similar upbringing i can say with confidence that I have outgrown all the nonsense and started to have much success in all aspects of life. dont sweat the little shit. meditate, nofap, cold showers, lift!, and above all always read and challenge your way of thought. keep a open mind. Society is full of shit and the sooner you realize that all the social conditioning faded away and what is left is a motherfucking lion alpha male! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9y5gk", "score_hidden": false, "stickied": false, "created": 1492241984.0, "created_utc": 1492213184.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dga5dni", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anon1qazwsx", "parent_id": "t1_dga2qd4", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I agree man. I don't let these things hold me back anymore but sometimes I still feel their influence creeping up on me. I still think it's an injustice. But I want to have better things to do with my time than to fight the cowards perpetrating it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree man. I don&amp;#39;t let these things hold me back anymore but sometimes I still feel their influence creeping up on me. I still think it&amp;#39;s an injustice. But I want to have better things to do with my time than to fight the cowards perpetrating it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga5dni", "score_hidden": false, "stickied": false, "created": 1492251876.0, "created_utc": 1492223076.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga2qd4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GolfWarlock", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Used to think this way too until I realized it doesn't matter whether that was true or not. If I believed it to be true then it was true if I chose not to believe it then it stops holding me back and even if it is true then why would I want to be with people who think like that in the first place? (Talking about the Indian stereotypes). The rest I agree with, a lot of Indian Males and Females have a really hard and confusing time growing up in America. At the end of the day you can blame who ever you want but the sooner you realize you are the only thing holding you back sooner you can start progressing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Used to think this way too until I realized it doesn&amp;#39;t matter whether that was true or not. If I believed it to be true then it was true if I chose not to believe it then it stops holding me back and even if it is true then why would I want to be with people who think like that in the first place? (Talking about the Indian stereotypes). The rest I agree with, a lot of Indian Males and Females have a really hard and confusing time growing up in America. At the end of the day you can blame who ever you want but the sooner you realize you are the only thing holding you back sooner you can start progressing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga2qd4", "score_hidden": false, "stickied": false, "created": 1492248135.0, "created_utc": 1492219335.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgabt2y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "paralosophical", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "This was really well written, and I completely empathize with your situation. What you're saying is true, and Aziz Ansari does a good job bringing up the societal issue of how Indians are portrayed in the media on his show \"Master of None\". I suggest you check it out if you haven't yet. Good luck and stay strong, friend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was really well written, and I completely empathize with your situation. What you&amp;#39;re saying is true, and Aziz Ansari does a good job bringing up the societal issue of how Indians are portrayed in the media on his show &amp;quot;Master of None&amp;quot;. I suggest you check it out if you haven&amp;#39;t yet. Good luck and stay strong, friend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgabt2y", "score_hidden": false, "stickied": false, "created": 1492262312.0, "created_utc": 1492233512.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dg9yimd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NFWonder", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Sex is great; porn is risky...for all cultures: http://www.sash.net/unprecedented-rates-of-sexual-dysfunctions-in-young-men-may-be-related-to-internet-porn-use/ ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sex is great; porn is risky...for all cultures: &lt;a href=\"http://www.sash.net/unprecedented-rates-of-sexual-dysfunctions-in-young-men-may-be-related-to-internet-porn-use/\"&gt;http://www.sash.net/unprecedented-rates-of-sexual-dysfunctions-in-young-men-may-be-related-to-internet-porn-use/&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9yimd", "score_hidden": false, "stickied": false, "created": 1492242469.0, "created_utc": 1492213669.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dga1ovu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ramamodh", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "ABCD ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ABCD &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga1ovu", "score_hidden": false, "stickied": false, "created": 1492246704.0, "created_utc": 1492217904.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dga59cp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DirteeP", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I went through a similar experience. Not Indian, but close. You gotta rise up and realize you're much more than what the media tells you that you are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went through a similar experience. Not Indian, but close. You gotta rise up and realize you&amp;#39;re much more than what the media tells you that you are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga59cp", "score_hidden": false, "stickied": false, "created": 1492251701.0, "created_utc": 1492222901.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dga8ott", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "augustus14159", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I'm an Indian, in India. My parents never really taught me anything about sexuality and neither did my school. I feel you man. \n\nI'd recommend that you read some books on sexuality, male and female - IT HAS HELPED ME A LOT! Nancy Friday's \"Men in love\" and \"Women on top\" are good reads (but be careful, they have sexual fantasies so be cautious and ensure that you're not triggered). \n\nI'm also reading one called \"The Multi-orgasmic man\". Aside from the \"promise of being multi-orgasmic\" - which I don't have any proof works - it is a good book on a man's sexuality and sexual anatomy. \n\nBasically, what worked for me is that instead of running away from my sexuality and trying to beat it out of me, I embraced it more and more. My thoughts on women's sexuality and even women's rights (sexual and otherwise) have also evolved positively through such books.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an Indian, in India. My parents never really taught me anything about sexuality and neither did my school. I feel you man. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d recommend that you read some books on sexuality, male and female - IT HAS HELPED ME A LOT! Nancy Friday&amp;#39;s &amp;quot;Men in love&amp;quot; and &amp;quot;Women on top&amp;quot; are good reads (but be careful, they have sexual fantasies so be cautious and ensure that you&amp;#39;re not triggered). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also reading one called &amp;quot;The Multi-orgasmic man&amp;quot;. Aside from the &amp;quot;promise of being multi-orgasmic&amp;quot; - which I don&amp;#39;t have any proof works - it is a good book on a man&amp;#39;s sexuality and sexual anatomy. &lt;/p&gt;\n\n&lt;p&gt;Basically, what worked for me is that instead of running away from my sexuality and trying to beat it out of me, I embraced it more and more. My thoughts on women&amp;#39;s sexuality and even women&amp;#39;s rights (sexual and otherwise) have also evolved positively through such books.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga8ott", "score_hidden": false, "stickied": false, "created": 1492256864.0, "created_utc": 1492228064.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgaf9p6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "techno_geek41", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "NRI here, well my parents are not like typical Indians 😁, but they fear the society, like most of us; Just don't give shit and keep moving...(Well I'm only 17 so lack experience regarding dating but trust me you'll find her if you are being who you really are!)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;NRI here, well my parents are not like typical Indians 😁, but they fear the society, like most of us; Just don&amp;#39;t give shit and keep moving...(Well I&amp;#39;m only 17 so lack experience regarding dating but trust me you&amp;#39;ll find her if you are being who you really are!)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaf9p6", "score_hidden": false, "stickied": false, "created": 1492270264.0, "created_utc": 1492241464.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgahbh5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thespartanin", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Same bro.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same bro.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgahbh5", "score_hidden": false, "stickied": false, "created": 1492276336.0, "created_utc": 1492247536.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgakmhz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anon1qazwsx", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Just want to say, got a lot of interesting responses here. There seem to be some misunderstandings so let me clear things right the fuck up. \n\n1. The purpose of this post is *not* to whine about a lack of attention from white women. It's to provide a social commentary about how there's so many contradictions a child of Indian immigrants faces when growing up in the West, primarily with regard to sexuality. This isn't even unique to Indian men, but probably to Indian women also. Stop being so self-centered in your discussions and stop assuming other people are just as self-centered as you are. \n\n2. People are suggesting all sorts of different things that primarily seem to be geared towards getting attention from white women (or women in general). That wasn't the point of this. As I remarked in a reply to someone below, I'm not at all willing to change fundamental aspects of who I am (like acting less intelligent or changing my accent) just to game women. Some people are, but that's their business. Everyone must find their own path. \n\n3. I used the example from Big Bang Theory not to complain, but to address what I perceived to be a social injustice, a contradictory mechanism at play in society. There's a difference between moaning and bitching, and actually discussing the topic at hand trying to make sense of it. I was trying to do the latter, but some of you either want to do the former or complain about others doing the former. \n\n4. Let's not forget that this is about nofap. By being free of porn and focusing on my academics, my fitness, my spirituality, I hope to transcend all these negative and contradictory societal influences in my upbringing, both Western and Eastern. Now I am no longer complaining, but merely observing from what is hopefully a better vantage point. I want to completely transcend all this mundane, worldly bullshit and be free of it all. Don't any of you get it?", "edited": 1492257885.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just want to say, got a lot of interesting responses here. There seem to be some misunderstandings so let me clear things right the fuck up. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;The purpose of this post is &lt;em&gt;not&lt;/em&gt; to whine about a lack of attention from white women. It&amp;#39;s to provide a social commentary about how there&amp;#39;s so many contradictions a child of Indian immigrants faces when growing up in the West, primarily with regard to sexuality. This isn&amp;#39;t even unique to Indian men, but probably to Indian women also. Stop being so self-centered in your discussions and stop assuming other people are just as self-centered as you are. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;People are suggesting all sorts of different things that primarily seem to be geared towards getting attention from white women (or women in general). That wasn&amp;#39;t the point of this. As I remarked in a reply to someone below, I&amp;#39;m not at all willing to change fundamental aspects of who I am (like acting less intelligent or changing my accent) just to game women. Some people are, but that&amp;#39;s their business. Everyone must find their own path. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I used the example from Big Bang Theory not to complain, but to address what I perceived to be a social injustice, a contradictory mechanism at play in society. There&amp;#39;s a difference between moaning and bitching, and actually discussing the topic at hand trying to make sense of it. I was trying to do the latter, but some of you either want to do the former or complain about others doing the former. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Let&amp;#39;s not forget that this is about nofap. By being free of porn and focusing on my academics, my fitness, my spirituality, I hope to transcend all these negative and contradictory societal influences in my upbringing, both Western and Eastern. Now I am no longer complaining, but merely observing from what is hopefully a better vantage point. I want to completely transcend all this mundane, worldly bullshit and be free of it all. Don&amp;#39;t any of you get it?&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgakmhz", "score_hidden": false, "stickied": false, "created": 1492286377.0, "created_utc": 1492257577.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgaldl1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "confused_by_default", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "The fucked up thing is that most of us will probably do the same thing to our children. Forbid them from talking to the opposite-gender and force them to marry someone WE choose because that's what happened to us. We need to wake up. Second generation Arab guy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fucked up thing is that most of us will probably do the same thing to our children. Forbid them from talking to the opposite-gender and force them to marry someone WE choose because that&amp;#39;s what happened to us. We need to wake up. Second generation Arab guy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaldl1", "score_hidden": false, "stickied": false, "created": 1492288203.0, "created_utc": 1492259403.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgaljvq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "daYellowKid", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "People can sense if you're ashamed of your race. South Asians do have really different views about everything when compared to the mainstream media aka \"western culture\". Recognise it's different but don't be ashamed of it. People can sense it and no one enjoys uneasiness. I've seen overweight guys with bitch tits pulling girls on some nights. People can be a bit presumptuous about all races, us Indians are not the only one. \n\nAlso to all the people making shots at op, he's trying to vent. Porn addiction is new and even now most people can't believe it can actually happen. Let people vent, not many places where you can talk openly about this. Hope the mods introduce flairs or something. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People can sense if you&amp;#39;re ashamed of your race. South Asians do have really different views about everything when compared to the mainstream media aka &amp;quot;western culture&amp;quot;. Recognise it&amp;#39;s different but don&amp;#39;t be ashamed of it. People can sense it and no one enjoys uneasiness. I&amp;#39;ve seen overweight guys with bitch tits pulling girls on some nights. People can be a bit presumptuous about all races, us Indians are not the only one. &lt;/p&gt;\n\n&lt;p&gt;Also to all the people making shots at op, he&amp;#39;s trying to vent. Porn addiction is new and even now most people can&amp;#39;t believe it can actually happen. Let people vent, not many places where you can talk openly about this. Hope the mods introduce flairs or something. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaljvq", "score_hidden": false, "stickied": false, "created": 1492288587.0, "created_utc": 1492259787.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgap3ge", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Yousuflol", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Dude I'm not Indian but I can relate. In general Muslim culture is almost the same. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude I&amp;#39;m not Indian but I can relate. In general Muslim culture is almost the same. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgap3ge", "score_hidden": false, "stickied": false, "created": 1492295268.0, "created_utc": 1492266468.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgapcnm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EnhancedLobster", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Find some indian role models that are killing it with women and life in general, try to understand what they are doing that's giving them this level of success, and there you go, no more excuses, then it's all up to you. The same goes for asians. Check out a guy called David Tian he has awesome content", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Find some indian role models that are killing it with women and life in general, try to understand what they are doing that&amp;#39;s giving them this level of success, and there you go, no more excuses, then it&amp;#39;s all up to you. The same goes for asians. Check out a guy called David Tian he has awesome content&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgapcnm", "score_hidden": false, "stickied": false, "created": 1492295674.0, "created_utc": 1492266874.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgajik0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "realn1ggaruinedbyprn", "parent_id": "t1_dgaj1jo", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "loool you get me..its pathetic and you can see right through it - you see it every time Asian-Americans (east asian) and some indian-americans (see: some) act like their bothered about institutional racism...nah they just lusting for white women too hard..get some self respect lmao", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;loool you get me..its pathetic and you can see right through it - you see it every time Asian-Americans (east asian) and some indian-americans (see: some) act like their bothered about institutional racism...nah they just lusting for white women too hard..get some self respect lmao&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgajik0", "score_hidden": false, "stickied": false, "created": 1492283328.0, "created_utc": 1492254528.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaj1jo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "osamabinliftin1000", "parent_id": "t1_dgahdz4", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Hahahahaha yes this !!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hahahahaha yes this !!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaj1jo", "score_hidden": false, "stickied": false, "created": 1492281862.0, "created_utc": 1492253062.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgawa95", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "realn1ggaruinedbyprn", "parent_id": "t1_dgak1oz", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Didn't mean to personally attack you bro...I agree that the narrative of Asian males in Western society (not in the UK because south Asians have fought pretty hard for accurate representation) is awful...take Raj from Big Bang for example...a terrible character used just to make majority demographics feel better about  themselves while they get a kick from the awkwardness of the 'chai-waala'....when in reality all the Indian/Pak dudes I've known never had a problem wit women etc (in UK).  However you have to admit, seeking white women for validation is beyond pathetic, it really is so indicative of poor parenting and mothers who both did not love the child and 2. preferred white aesthetics over their own (which is completely unnatural). Thus the child is fucked...but to be so open about it is so embarrassing....and I was just pointing out that for the majority of moaners thats really what its about...white women lmao. And its so so so sad. The media isn't the reason that they feel this way. Having no self-respect is what makes a person feel this way. Having a persons parents not validate them is whats making a person feel this way.  Being conditioned by your parents that a person of colour needs validation from a white male or female is what makes a person feel this way. And on it goes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Didn&amp;#39;t mean to personally attack you bro...I agree that the narrative of Asian males in Western society (not in the UK because south Asians have fought pretty hard for accurate representation) is awful...take Raj from Big Bang for example...a terrible character used just to make majority demographics feel better about  themselves while they get a kick from the awkwardness of the &amp;#39;chai-waala&amp;#39;....when in reality all the Indian/Pak dudes I&amp;#39;ve known never had a problem wit women etc (in UK).  However you have to admit, seeking white women for validation is beyond pathetic, it really is so indicative of poor parenting and mothers who both did not love the child and 2. preferred white aesthetics over their own (which is completely unnatural). Thus the child is fucked...but to be so open about it is so embarrassing....and I was just pointing out that for the majority of moaners thats really what its about...white women lmao. And its so so so sad. The media isn&amp;#39;t the reason that they feel this way. Having no self-respect is what makes a person feel this way. Having a persons parents not validate them is whats making a person feel this way.  Being conditioned by your parents that a person of colour needs validation from a white male or female is what makes a person feel this way. And on it goes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgawa95", "score_hidden": false, "stickied": false, "created": 1492305526.0, "created_utc": 1492276726.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgak1oz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "anon1qazwsx", "parent_id": "t1_dgahdz4", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Never did I personally complain about \"white women not liking me.\" Maybe others have commented that way or suggested it, but not me. I was just using an example from a popular TV show to illustrate that in American society there exist negative and condescending stereotypes of Asian males that affect other people's perception of us. You can't deny that. I also meant to say that we're excessively bombarded with synthetic sexual stimuli through mass media. If anything I actually want to rid myself of these intentions if I have them, because I recognize that this is a flaw, perpetrated upon me by society as a whole. I actually agree with you on this part, so by criticizing me you actually have it backwards. I specifically *don't* want to waste time lusting after women, I *don't* want to have a \"woe is me\" victim complex, even though Asian males *are* victimized by this system. I want greater self-control and I want to focus on myself. Elevation of the mind, body, and spirit, that's all that matters. That's what this post (and r/nofap) is all about. ", "edited": 1492256785.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Never did I personally complain about &amp;quot;white women not liking me.&amp;quot; Maybe others have commented that way or suggested it, but not me. I was just using an example from a popular TV show to illustrate that in American society there exist negative and condescending stereotypes of Asian males that affect other people&amp;#39;s perception of us. You can&amp;#39;t deny that. I also meant to say that we&amp;#39;re excessively bombarded with synthetic sexual stimuli through mass media. If anything I actually want to rid myself of these intentions if I have them, because I recognize that this is a flaw, perpetrated upon me by society as a whole. I actually agree with you on this part, so by criticizing me you actually have it backwards. I specifically &lt;em&gt;don&amp;#39;t&lt;/em&gt; want to waste time lusting after women, I &lt;em&gt;don&amp;#39;t&lt;/em&gt; want to have a &amp;quot;woe is me&amp;quot; victim complex, even though Asian males &lt;em&gt;are&lt;/em&gt; victimized by this system. I want greater self-control and I want to focus on myself. Elevation of the mind, body, and spirit, that&amp;#39;s all that matters. That&amp;#39;s what this post (and &lt;a href=\"/r/nofap\"&gt;r/nofap&lt;/a&gt;) is all about. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgak1oz", "score_hidden": false, "stickied": false, "created": 1492284854.0, "created_utc": 1492256054.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgaj2gl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "osamabinliftin1000", "parent_id": "t1_dgahizk", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "LOL!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LOL!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaj2gl", "score_hidden": false, "stickied": false, "created": 1492281944.0, "created_utc": 1492253144.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgahizk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "realn1ggaruinedbyprn", "parent_id": "t1_dgahdz4", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Just gotta say again...this some straight bullshit lmfao. Probably one of the worst posts I've ever read on here. 'white women don't like me so my life is trash' - OP and the other circle jerk indians and asians on here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just gotta say again...this some straight bullshit lmfao. Probably one of the worst posts I&amp;#39;ve ever read on here. &amp;#39;white women don&amp;#39;t like me so my life is trash&amp;#39; - OP and the other circle jerk indians and asians on here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgahizk", "score_hidden": false, "stickied": false, "created": 1492277001.0, "created_utc": 1492248201.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgahdz4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "realn1ggaruinedbyprn", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "You guys are chatting shit....Indian's [in India] don't suffer from social anxiety or anything like that. Quit lyin. Also this is so 'woe me'. Pathetic. 'People think we are nerds'. Same shit Asian's do....read: \"White women don't like us\" lmao...get a fucking grip.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You guys are chatting shit....Indian&amp;#39;s [in India] don&amp;#39;t suffer from social anxiety or anything like that. Quit lyin. Also this is so &amp;#39;woe me&amp;#39;. Pathetic. &amp;#39;People think we are nerds&amp;#39;. Same shit Asian&amp;#39;s do....read: &amp;quot;White women don&amp;#39;t like us&amp;quot; lmao...get a fucking grip.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgahdz4", "score_hidden": false, "stickied": false, "created": 1492276557.0, "created_utc": 1492247757.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgb4aci", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ar96me3n", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I can relate, although I'm Bengali not Indian(still, same subcontinent right?). The stereotypes about our males being full of effeminate man-children are really sad. You should watch Master of None on Netflix, you might find it very relatable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can relate, although I&amp;#39;m Bengali not Indian(still, same subcontinent right?). The stereotypes about our males being full of effeminate man-children are really sad. You should watch Master of None on Netflix, you might find it very relatable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgb4aci", "score_hidden": false, "stickied": false, "created": 1492316373.0, "created_utc": 1492287573.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65exz6", "likes": null, "replies": "", "user_reports": [], "id": "dgany9d", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Dr_12345", "parent_id": "t3_65exz6", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Bro if your writing that much, put a fckin tl;dr", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bro if your writing that much, put a fckin tl;dr&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgany9d", "score_hidden": false, "stickied": false, "created": 1492293338.0, "created_utc": 1492264538.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]