[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "NoFap", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This was the reason I didn&amp;#39;t have girlfriends during my teens. I got to this stage easily enough, but as soon as the prospect of being intimate with someone arose, my anxiety shot through the roof. I thought that now, at 23, things might be different. Nope.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve gone a good seven years without even so much as talking to a girl, largely due to depression, anxiety and the fact that I was wanking multiple times every day. But now that I&amp;#39;m virtually free of masturbation, I have a newfound inclination for female attention. The only problem is I&amp;#39;m hopeless at it.&lt;/p&gt;\n\n&lt;p&gt;Knowing this is something I have to learn, I&amp;#39;ve been practicing on girls at work. I&amp;#39;m not really intending to &amp;quot;get with&amp;quot; any of them, I&amp;#39;m just using them to pick up a bit of flirting experience. However, there&amp;#39;s this one girl on my shift who I find absolutely stunning. Everyone in the factory wants her, but despite that, I&amp;#39;ve always had the feeling that she was completely within the realms of possibility for myself.&lt;/p&gt;\n\n&lt;p&gt;Over the past two weeks, I&amp;#39;ve been going out of my way to speak with her. Our jobs are closely connected, so there are often things work-related I can approach her with. I&amp;#39;ve been making sure to call her by her name, maintain eye contact and always thank her for her help when we&amp;#39;re done. Although these conversations were strictly professional, I was always dropping subtle nuances which I feel were being received.&lt;/p&gt;\n\n&lt;p&gt;Anyway, this week we&amp;#39;ve been speaking a little bit more, and often times it&amp;#39;s been her who&amp;#39;s approached me. Last night, (night shift) we had a bit of a &amp;quot;moment&amp;quot;. She needed me to do something for her, and when she was explaining this to me, we both sort of paused, locked eyes and gazed at each other for a few seconds. I think I must have been influenced by the combination of the delirium experienced at 04:30 in the morning and the fact that I was stunned by this sexy look she was giving me. It was honestly bizarre.&lt;/p&gt;\n\n&lt;p&gt;Before going for my break, I spent the next half hour contemplating what that was and whether she was aware of it too. I mean, she seemed to instigate it.&lt;/p&gt;\n\n&lt;p&gt;When I got to the canteen for my break, I began chatting to one of the new store men. There was only me and him in the room before she also walked in. She&amp;#39;s Polish, and therefore sat at the Polish table, whilst I and the store man were sat on the English table. As I was chatting away to this bloke, I noticed out of the corner of my eye her staring at me from across the room. I ignored it at first, but I eventually returned a glance and we exchanged smiles. &lt;/p&gt;\n\n&lt;p&gt;This was when I got a bit of a lump in the back of my throat at the thought that she might actually like me.&lt;/p&gt;\n\n&lt;p&gt;She was still staring at me even after we&amp;#39;d smiled at each other. When I returned the glance for a second time, she was giving me the same sexy look as before. I honestly don&amp;#39;t know what came over me, but I fucking winked at her. I&amp;#39;ve never winked at anyone in my life, but for some reason, it felt right on this occasion. I didn&amp;#39;t really pay attention to her reaction, as I was trying to focus on the story this bloke was telling me, but a few seconds after the wink she got up and left the room. &lt;/p&gt;\n\n&lt;p&gt;The store man&amp;#39;s break was over, and so he headed off back to the shop floor, leaving me in the room alone. Five minutes went by, and then this girl, now with her hair down and a little bit of eye makeup applied, re-enters the room, walks toward my table, and then takes a seat opposite me.&lt;/p&gt;\n\n&lt;p&gt;It might not seem like a lot, but it&amp;#39;s a big fucking deal for a Polish person to sit at the English table. I mean, I&amp;#39;ve never seen it done before. &lt;/p&gt;\n\n&lt;p&gt;She sat at the table, looking amazing with her purple hair flowing to her shoulders and her sexy catty eyes, and yelled &amp;quot;Hi&amp;quot; in that exotic accent.&lt;/p&gt;\n\n&lt;p&gt;My heart was racing at this point. I felt like it had been confirmed that she likes me, or that she at least sees me as someone she could potentially go for. I immediately felt like the conversation we were about to have was going to be very influential to our future relationship. The pressure was too much. &lt;/p&gt;\n\n&lt;p&gt;She banged out question after question: &amp;quot;What was I doing over the weekend, what plans do I have for the future, whether or not I&amp;#39;m planning on working overtime next week&amp;quot;. She asked me how old I am, and then fucking replied &amp;quot;nice&amp;quot; when I told her 23.&lt;/p&gt;\n\n&lt;p&gt;All I could do was answer her questions. I couldn&amp;#39;t think of anything to say to make her laugh or smile, or any clever way to break the ice. My body was in pure survival mode.&lt;/p&gt;\n\n&lt;p&gt;To be honest, I held it together in the sense that I remained mostly anxiety-free, but I didn&amp;#39;t contribute a lot or show nearly the same level of enthusiasm as she did. She had a huge grin on her face throughout the whole conversation. She seemed incredibly game, and it sort of just freaked me out. I wish I was able to just let loose like she can, but I&amp;#39;m just not there yet.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I don&amp;#39;t think it&amp;#39;s over. The conversation ended relatively well, and I still plan to talk to her next week. She obviously finds me physically attractive, as I do her. If nothing else happens, that&amp;#39;s endearing in itself. It&amp;#39;s also incredibly cute how she went out of her way to touch herself up for me. It&amp;#39;s just a shame I was too socially retarded to take heed of the situation.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been practicing chatting to a pretty Polish girl. When she showed signs of liking me, I got really freaked out. She then applies makeup and confronts me, all but puts it on the line, and I fail to make any advancements. I&amp;#39;m shit.&lt;/p&gt;\n\n&lt;p&gt;Edit: punctuation&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This was the reason I didn't have girlfriends during my teens. I got to this stage easily enough, but as soon as the prospect of being intimate with someone arose, my anxiety shot through the roof. I thought that now, at 23, things might be different. Nope.\n\nI've gone a good seven years without even so much as talking to a girl, largely due to depression, anxiety and the fact that I was wanking multiple times every day. But now that I'm virtually free of masturbation, I have a newfound inclination for female attention. The only problem is I'm hopeless at it.\n\nKnowing this is something I have to learn, I've been practicing on girls at work. I'm not really intending to \"get with\" any of them, I'm just using them to pick up a bit of flirting experience. However, there's this one girl on my shift who I find absolutely stunning. Everyone in the factory wants her, but despite that, I've always had the feeling that she was completely within the realms of possibility for myself.\n\nOver the past two weeks, I've been going out of my way to speak with her. Our jobs are closely connected, so there are often things work-related I can approach her with. I've been making sure to call her by her name, maintain eye contact and always thank her for her help when we're done. Although these conversations were strictly professional, I was always dropping subtle nuances which I feel were being received.\n\nAnyway, this week we've been speaking a little bit more, and often times it's been her who's approached me. Last night, (night shift) we had a bit of a \"moment\". She needed me to do something for her, and when she was explaining this to me, we both sort of paused, locked eyes and gazed at each other for a few seconds. I think I must have been influenced by the combination of the delirium experienced at 04:30 in the morning and the fact that I was stunned by this sexy look she was giving me. It was honestly bizarre.\n\nBefore going for my break, I spent the next half hour contemplating what that was and whether she was aware of it too. I mean, she seemed to instigate it.\n\nWhen I got to the canteen for my break, I began chatting to one of the new store men. There was only me and him in the room before she also walked in. She's Polish, and therefore sat at the Polish table, whilst I and the store man were sat on the English table. As I was chatting away to this bloke, I noticed out of the corner of my eye her staring at me from across the room. I ignored it at first, but I eventually returned a glance and we exchanged smiles. \n\nThis was when I got a bit of a lump in the back of my throat at the thought that she might actually like me.\n\nShe was still staring at me even after we'd smiled at each other. When I returned the glance for a second time, she was giving me the same sexy look as before. I honestly don't know what came over me, but I fucking winked at her. I've never winked at anyone in my life, but for some reason, it felt right on this occasion. I didn't really pay attention to her reaction, as I was trying to focus on the story this bloke was telling me, but a few seconds after the wink she got up and left the room. \n\nThe store man's break was over, and so he headed off back to the shop floor, leaving me in the room alone. Five minutes went by, and then this girl, now with her hair down and a little bit of eye makeup applied, re-enters the room, walks toward my table, and then takes a seat opposite me.\n\nIt might not seem like a lot, but it's a big fucking deal for a Polish person to sit at the English table. I mean, I've never seen it done before. \n\nShe sat at the table, looking amazing with her purple hair flowing to her shoulders and her sexy catty eyes, and yelled \"Hi\" in that exotic accent.\n\nMy heart was racing at this point. I felt like it had been confirmed that she likes me, or that she at least sees me as someone she could potentially go for. I immediately felt like the conversation we were about to have was going to be very influential to our future relationship. The pressure was too much. \n\nShe banged out question after question: \"What was I doing over the weekend, what plans do I have for the future, whether or not I'm planning on working overtime next week\". She asked me how old I am, and then fucking replied \"nice\" when I told her 23.\n\nAll I could do was answer her questions. I couldn't think of anything to say to make her laugh or smile, or any clever way to break the ice. My body was in pure survival mode.\n\nTo be honest, I held it together in the sense that I remained mostly anxiety-free, but I didn't contribute a lot or show nearly the same level of enthusiasm as she did. She had a huge grin on her face throughout the whole conversation. She seemed incredibly game, and it sort of just freaked me out. I wish I was able to just let loose like she can, but I'm just not there yet.\n\nAnyway, I don't think it's over. The conversation ended relatively well, and I still plan to talk to her next week. She obviously finds me physically attractive, as I do her. If nothing else happens, that's endearing in itself. It's also incredibly cute how she went out of her way to touch herself up for me. It's just a shame I was too socially retarded to take heed of the situation.\n\n**tl;dr**\n\nI've been practicing chatting to a pretty Polish girl. When she showed signs of liking me, I got really freaked out. She then applies makeup and confronts me, all but puts it on the line, and I fail to make any advancements. I'm shit.\n\nEdit: punctuation", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65f1bx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 31, "report_reasons": null, "author": "newfriedn", "saved": false, "mod_reports": [], "name": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "approved_by": null, "over_18": false, "domain": "self.NoFap", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2skrn", "edited": 1492231346.0, "link_flair_css_class": null, "author_flair_css_class": "month1", "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/NoFap/comments/65f1bx/i_got_a_girl_to_like_me_and_now_im_scared_of_her/", "num_reports": null, "locked": false, "stickied": false, "created": 1492230823.0, "url": "https://www.reddit.com/r/NoFap/comments/65f1bx/i_got_a_girl_to_like_me_and_now_im_scared_of_her/", "author_flair_text": "37 Days", "quarantine": false, "title": "I got a girl to like me, and now I'm scared of her?", "created_utc": 1492202023.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 25, "visited": false, "subreddit_type": "public", "ups": 31}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dgam8b1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jrmolly", "parent_id": "t1_dgaiyxb", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "YES! That makes total sense. Lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;YES! That makes total sense. Lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgam8b1", "score_hidden": false, "stickied": false, "created": 1492290054.0, "created_utc": 1492261254.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaiyxb", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Terra_the_terrible", "parent_id": "t1_dga5lgp", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Mate i think you should start painting", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mate i think you should start painting&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaiyxb", "score_hidden": false, "stickied": false, "created": 1492281634.0, "created_utc": 1492252834.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dga5lgp", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "TyrannicalWill", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "That gave me an erection.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That gave me an erection.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga5lgp", "score_hidden": false, "stickied": false, "created": 1492252191.0, "created_utc": 1492223391.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dg9s836", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "fortifier22", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I've also been where you are; I've gone for incredibly long periods of time without ever even talking to a girl because of my PMO addiction.\n\nHowever, if there's anything I've learned about women its that you have to get them quick before they're gone. If you really are interested in this girl and she is interested in you as well (which seems like the case since she clearly has shown signs of interest even after you \"f$*ed up\"), then you have to take the initiative and ask her out. \n\nEven though I don't know you, I can tell you right now that you got this. The only way you can screw this up is if you purposely do something that will get her to hate you. Just continue to be yourself and begin initiating the next steps!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve also been where you are; I&amp;#39;ve gone for incredibly long periods of time without ever even talking to a girl because of my PMO addiction.&lt;/p&gt;\n\n&lt;p&gt;However, if there&amp;#39;s anything I&amp;#39;ve learned about women its that you have to get them quick before they&amp;#39;re gone. If you really are interested in this girl and she is interested in you as well (which seems like the case since she clearly has shown signs of interest even after you &amp;quot;f$*ed up&amp;quot;), then you have to take the initiative and ask her out. &lt;/p&gt;\n\n&lt;p&gt;Even though I don&amp;#39;t know you, I can tell you right now that you got this. The only way you can screw this up is if you purposely do something that will get her to hate you. Just continue to be yourself and begin initiating the next steps!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9s836", "score_hidden": false, "stickied": false, "created": 1492234158.0, "created_utc": 1492205358.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dg9ss5z", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "anonexfapper", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Be a fucking man and set a date. Hang out, have fun and hook up. Rinse and repeat. Don't mention relationships until she brings it up. Read how to be a 3 percent man. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Be a fucking man and set a date. Hang out, have fun and hook up. Rinse and repeat. Don&amp;#39;t mention relationships until she brings it up. Read how to be a 3 percent man. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dg9ss5z", "score_hidden": false, "stickied": false, "created": 1492234880.0, "created_utc": 1492206080.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dga2i3p", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "missiontotransition", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I was grinning through this whole post because I think it's a massive success attracting a girl like that. I'm keeping my fingers crossed for you. Hold it together, ask her out and keep it going from there.\n\nPut it into motion man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was grinning through this whole post because I think it&amp;#39;s a massive success attracting a girl like that. I&amp;#39;m keeping my fingers crossed for you. Hold it together, ask her out and keep it going from there.&lt;/p&gt;\n\n&lt;p&gt;Put it into motion man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga2i3p", "score_hidden": false, "stickied": false, "created": 1492247819.0, "created_utc": 1492219019.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dga4yq8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Saved-M8", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I say go fucking crazy in that pussy, bro! Fuck you waiting for?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I say go fucking crazy in that pussy, bro! Fuck you waiting for?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga4yq8", "score_hidden": false, "stickied": false, "created": 1492251265.0, "created_utc": 1492222465.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dga24k6", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "EvilZeroSc", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "She was interested in you obviously...also, you created the situation subconsciously to let go of those fearful emotions...you created it because your frequency is rising, speeding up..becoming more light and heavier frequencies are purged...but those emotions causes the corresponding events to occur in our lives that represent those emotions suppressed when we are releasing them.\n\nIm proud of you, you faced your fear...and didn't run...or let fear paralyze you to the point where it overwhelmed you...you will face it again and again and again...and finally be able to let go of it...it will get easier and easier each time this fear shows itself in your reality...Basically, people, places, things are nothing more than a training ground to help us become more and more of our true self devoid of fear....\n", "edited": 1492218807.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She was interested in you obviously...also, you created the situation subconsciously to let go of those fearful emotions...you created it because your frequency is rising, speeding up..becoming more light and heavier frequencies are purged...but those emotions causes the corresponding events to occur in our lives that represent those emotions suppressed when we are releasing them.&lt;/p&gt;\n\n&lt;p&gt;Im proud of you, you faced your fear...and didn&amp;#39;t run...or let fear paralyze you to the point where it overwhelmed you...you will face it again and again and again...and finally be able to let go of it...it will get easier and easier each time this fear shows itself in your reality...Basically, people, places, things are nothing more than a training ground to help us become more and more of our true self devoid of fear....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga24k6", "score_hidden": false, "stickied": false, "created": 1492247294.0, "created_utc": 1492218494.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dga53hs", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "KingCobra116", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I've been in this type of situation before and majorly screwed it up. First of all, ask her out ASAP. If you wait too long to make a move she will move on. But the most critical thing in my opinion is that you don't start to put her on a pedestal. This will kill her attraction towards if you come off as needy because it makes you look unconfident. Try looking at it as you are taking her on a date to see if YOU actually like her, not the other way around. Don't get too emotionally attached too quickly. A good rule is that you want her to be more attached to you than you to her because again it makes you less needy and therefore more attractive. Good luck brother and congrats to you for having the balls to pull off the wink that made me smile ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been in this type of situation before and majorly screwed it up. First of all, ask her out ASAP. If you wait too long to make a move she will move on. But the most critical thing in my opinion is that you don&amp;#39;t start to put her on a pedestal. This will kill her attraction towards if you come off as needy because it makes you look unconfident. Try looking at it as you are taking her on a date to see if YOU actually like her, not the other way around. Don&amp;#39;t get too emotionally attached too quickly. A good rule is that you want her to be more attached to you than you to her because again it makes you less needy and therefore more attractive. Good luck brother and congrats to you for having the balls to pull off the wink that made me smile &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga53hs", "score_hidden": false, "stickied": false, "created": 1492251463.0, "created_utc": 1492222663.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dga7nvn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "BaconMeTimbers", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Here's the thing, you have to realize that there is nothing to 'worry' about. No matter the outcome it's really no big deal. Here's what you do:\n\n1) Next time you talk to her, after you guys talk tell her it is good/fun talking to her and say you guys should hangout outside of work sometime\n\n2) She says yes? Awesome now ask for her number so you guys can arrange meeting up. She says no thank you or she has a boyfriend, or whatever? No problem, you'll just go back to the way things were and only flirt at work. No big deal\n\n3) You have her number, now text her when you feel is right. Shoot the shit a little with her and then propose you guys get tacos at a taco truck or whatever you want to do with her. She didn't text you back? No big deal. Women change their mind constantly. You guys can just be friends then\n\n4) You guys went out...and things went great! I mean you guys have great chemistry, why wouldn't it? But you know what, if things fall flat, well least you guys tried! No big deal!\n\nI understand it's scary. I've been there. I still get anxious at times. But just remember: whatever the outcome, it's really no big deal. Now go get her ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s the thing, you have to realize that there is nothing to &amp;#39;worry&amp;#39; about. No matter the outcome it&amp;#39;s really no big deal. Here&amp;#39;s what you do:&lt;/p&gt;\n\n&lt;p&gt;1) Next time you talk to her, after you guys talk tell her it is good/fun talking to her and say you guys should hangout outside of work sometime&lt;/p&gt;\n\n&lt;p&gt;2) She says yes? Awesome now ask for her number so you guys can arrange meeting up. She says no thank you or she has a boyfriend, or whatever? No problem, you&amp;#39;ll just go back to the way things were and only flirt at work. No big deal&lt;/p&gt;\n\n&lt;p&gt;3) You have her number, now text her when you feel is right. Shoot the shit a little with her and then propose you guys get tacos at a taco truck or whatever you want to do with her. She didn&amp;#39;t text you back? No big deal. Women change their mind constantly. You guys can just be friends then&lt;/p&gt;\n\n&lt;p&gt;4) You guys went out...and things went great! I mean you guys have great chemistry, why wouldn&amp;#39;t it? But you know what, if things fall flat, well least you guys tried! No big deal!&lt;/p&gt;\n\n&lt;p&gt;I understand it&amp;#39;s scary. I&amp;#39;ve been there. I still get anxious at times. But just remember: whatever the outcome, it&amp;#39;s really no big deal. Now go get her &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga7nvn", "score_hidden": false, "stickied": false, "created": 1492255219.0, "created_utc": 1492226419.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dga2jfs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Alienbaby12096", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Don't beat yourself up man. Trust me I was in the same situation where I failed to make advancements. But now I am more level headed and you will be too once you get further pass your addiction you will be less nervous and more calm. Keep going!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t beat yourself up man. Trust me I was in the same situation where I failed to make advancements. But now I am more level headed and you will be too once you get further pass your addiction you will be less nervous and more calm. Keep going!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga2jfs", "score_hidden": false, "stickied": false, "created": 1492247869.0, "created_utc": 1492219069.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dga0pd3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MPJFitz", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "You might be unsure as to whether you're really interested in her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might be unsure as to whether you&amp;#39;re really interested in her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga0pd3", "score_hidden": false, "stickied": false, "created": 1492245389.0, "created_utc": 1492216589.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dga6mh5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "durkenstein", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Been here before. Great job man. Whatever you do now, just don't freeze up and cold shoulder her, otherwise she will definitely take that as a bad sign and leave. Return her warmth as best you can and keep doing what you've been doing, eventually you'll work up the guts to take it further!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Been here before. Great job man. Whatever you do now, just don&amp;#39;t freeze up and cold shoulder her, otherwise she will definitely take that as a bad sign and leave. Return her warmth as best you can and keep doing what you&amp;#39;ve been doing, eventually you&amp;#39;ll work up the guts to take it further!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga6mh5", "score_hidden": false, "stickied": false, "created": 1492253654.0, "created_utc": 1492224854.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dgb4m5q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jamesz84", "parent_id": "t1_dgaq1z0", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Well, maybe see if she will go out with you and see how it goes..\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, maybe see if she will go out with you and see how it goes..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgb4m5q", "score_hidden": false, "stickied": false, "created": 1492316823.0, "created_utc": 1492288023.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaq1z0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "newfriedn", "parent_id": "t1_dgagyyz", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "That's a legitimate concern. I wouldn't mind something casual, but a full blown relationship with someone I work with seems like a terrible, terrible idea. Especially considering literally every guy in the place is after her. I see that turning sour fast. \n\nThen again, I'm incredibly inexperienced, and just on a self-improvement level, the potential knowledge and self-esteem I can gain from having a little bit of a fling with her outweighs all the cons. It's not like I'm going to struggle to get another shitty factory job if need be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a legitimate concern. I wouldn&amp;#39;t mind something casual, but a full blown relationship with someone I work with seems like a terrible, terrible idea. Especially considering literally every guy in the place is after her. I see that turning sour fast. &lt;/p&gt;\n\n&lt;p&gt;Then again, I&amp;#39;m incredibly inexperienced, and just on a self-improvement level, the potential knowledge and self-esteem I can gain from having a little bit of a fling with her outweighs all the cons. It&amp;#39;s not like I&amp;#39;m going to struggle to get another shitty factory job if need be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaq1z0", "score_hidden": false, "stickied": false, "created": 1492296754.0, "created_utc": 1492267954.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgagyyz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jamesz84", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "You should maybe decide if you want to take the risk of dating someone in your work or not. I'm not sure I would want to. How often are you going to see the girl? What happens if it doesn't work out? What happens if it does? Maybe she will be down with something casual, but what are her expectations likely to be? If it all goes pear shaped you don't want a pink haired dose of crazy running around work giving you death stares, or telling other employees that you're an asshole. What about the emotional connection? Is this a real prospect for a relationship or is it all just about Mr. Downstairs? Everything is up to you. (It definitely sounds like she is fully up for it, by the way.) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should maybe decide if you want to take the risk of dating someone in your work or not. I&amp;#39;m not sure I would want to. How often are you going to see the girl? What happens if it doesn&amp;#39;t work out? What happens if it does? Maybe she will be down with something casual, but what are her expectations likely to be? If it all goes pear shaped you don&amp;#39;t want a pink haired dose of crazy running around work giving you death stares, or telling other employees that you&amp;#39;re an asshole. What about the emotional connection? Is this a real prospect for a relationship or is it all just about Mr. Downstairs? Everything is up to you. (It definitely sounds like she is fully up for it, by the way.) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgagyyz", "score_hidden": false, "stickied": false, "created": 1492275238.0, "created_utc": 1492246438.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dga7j60", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thighlover3", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "This is normal. Getting up and talking to a girl isn't that hard once you get the hang of it, but it's harder if you know she's interested in you. You might be worried about entering a relationship because you're afraid of messing it up. Anyway, I don't have any real advice for you, but I hope it works out in the end.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is normal. Getting up and talking to a girl isn&amp;#39;t that hard once you get the hang of it, but it&amp;#39;s harder if you know she&amp;#39;s interested in you. You might be worried about entering a relationship because you&amp;#39;re afraid of messing it up. Anyway, I don&amp;#39;t have any real advice for you, but I hope it works out in the end.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga7j60", "score_hidden": false, "stickied": false, "created": 1492255016.0, "created_utc": 1492226216.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dga9b52", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "24December2016", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "It's ok dude. But don't let her pass up. Everyone gets a bit nervous when things start picking up, just go with it and you'll do great. Good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s ok dude. But don&amp;#39;t let her pass up. Everyone gets a bit nervous when things start picking up, just go with it and you&amp;#39;ll do great. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dga9b52", "score_hidden": false, "stickied": false, "created": 1492257875.0, "created_utc": 1492229075.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dgabgfk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kam10", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Literally me rn. I can usually get past the first stage fine. But then I start coasting and start to avoid them, just when it starts getting good. Then of course I miss out and wish I never even bothered. This shit is easier said than done. For me at least. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Literally me rn. I can usually get past the first stage fine. But then I start coasting and start to avoid them, just when it starts getting good. Then of course I miss out and wish I never even bothered. This shit is easier said than done. For me at least. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgabgfk", "score_hidden": false, "stickied": false, "created": 1492261646.0, "created_utc": 1492232846.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dgac6y1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Madgrizzy", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Anything scary is good.The whole point of nofap is to make yourself better and challenge your comfort zone.This is another challenge to your comfort zone, it gets easier over time and it's always scary at first.Theres zero chance for you to lose if you just ask her on a date the worst she could say is sorry I don't see you like that,but than at least you know and you theres no \"should'ves\"\n\n\nBest of luck man", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anything scary is good.The whole point of nofap is to make yourself better and challenge your comfort zone.This is another challenge to your comfort zone, it gets easier over time and it&amp;#39;s always scary at first.Theres zero chance for you to lose if you just ask her on a date the worst she could say is sorry I don&amp;#39;t see you like that,but than at least you know and you theres no &amp;quot;should&amp;#39;ves&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Best of luck man&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgac6y1", "score_hidden": false, "stickied": false, "created": 1492263079.0, "created_utc": 1492234279.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dgagq2r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Shadylifes", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "You gon' have to smash tho! Show her what you're packing matey! Thar might not be any bootay tommorow matey! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You gon&amp;#39; have to smash tho! Show her what you&amp;#39;re packing matey! Thar might not be any bootay tommorow matey! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgagq2r", "score_hidden": false, "stickied": false, "created": 1492274449.0, "created_utc": 1492245649.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dgajfv1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FreezingPT", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Man up dude. Don't waste this opportunity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man up dude. Don&amp;#39;t waste this opportunity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgajfv1", "score_hidden": false, "stickied": false, "created": 1492283099.0, "created_utc": 1492254299.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dgal62u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Burnwood24", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Just like most of us say here. Go for it!\nTalk to her and you'll see what will be coming :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just like most of us say here. Go for it!\nTalk to her and you&amp;#39;ll see what will be coming :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgal62u", "score_hidden": false, "stickied": false, "created": 1492287711.0, "created_utc": 1492258911.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dganig7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Magdrasyl", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "You are having doubts. It's the fear of commitment, it's not as easy as you think.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are having doubts. It&amp;#39;s the fear of commitment, it&amp;#39;s not as easy as you think.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dganig7", "score_hidden": false, "stickied": false, "created": 1492292544.0, "created_utc": 1492263744.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65f1bx", "likes": null, "replies": "", "user_reports": [], "id": "dgb5baz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "speardane", "parent_id": "t3_65f1bx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Stop thinking. Be a man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop thinking. Be a man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgb5baz", "score_hidden": false, "stickied": false, "created": 1492317761.0, "created_utc": 1492288961.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]