[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "NoFap", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;That does it. That was the last time,&lt;/em&gt; you say to yourself. In your mind, you&amp;#39;re preparing for the most extreme test of your willpower, as you once again make that commitment to give up PMO.&lt;/p&gt;\n\n&lt;p&gt;But what&amp;#39;s really going to be different this time? What will set this attempt at giving up your porn addiction apart from the rest of your failed attempts?&lt;/p&gt;\n\n&lt;p&gt;Nothing.&lt;/p&gt;\n\n&lt;p&gt;Nothing will be different. Instead, you&amp;#39;ll be repeating the same cycle you&amp;#39;ve grown to anticipate, and even find yourself comfortable with to some degree, like a bedtime routine. You&amp;#39;ll reset your badge. You might make a post about starting from day one, how you&amp;#39;re really going to make it this time, or some other bullshit along those lines. You&amp;#39;ll spend hours on this forum, looking for some way to distract yourself. Some way to relieve the urge. You&amp;#39;ll watch a few motivational videos, or surf the emergency button. But it won&amp;#39;t do you any good, because as soon as you feel the urge to watch porn and blow your load, you&amp;#39;ll give in. You might hesitate, you might make a post asking someone to help you, or encourage you to stop, as if they had any power at all to do that. But it won&amp;#39;t matter. You&amp;#39;ll do all the same things you did last time, and you&amp;#39;ll relapse.&lt;/p&gt;\n\n&lt;p&gt;Wash, rinse, repeat.&lt;/p&gt;\n\n&lt;p&gt;If this sound like you, then the truth is, &lt;em&gt;you&amp;#39;re not ready for NoFap.&lt;/em&gt; The truth, the cold hard truth, is that you&amp;#39;re not ready to make a change in your life. You love masturbating. You cling to the habit like a security blanket. The thing is, mommy and daddy aren&amp;#39;t going to take that blanket away from you, that&amp;#39;s your responsibility. You can see that people are improving their lives by giving up PMO, and you desire that positive change in your own life. But you want someone to coddle you while you give up the blanket, and there&amp;#39;s no one who&amp;#39;s going to. So you don&amp;#39;t give it up. You keep it hidden, under your bed, so in case you feel momentarily uncomfortable, you know it&amp;#39;s there to provide you consolation. The truth is, you don&amp;#39;t want to give it up. You love that blanket, and despite the fact that it&amp;#39;s holding you back from living a more fulfilling life, you&amp;#39;ll never give it up. You&amp;#39;ll always consider it an option. So long as you consider it a possibility in the back of your mind, PMO will always be an option for you. And so long as it&amp;#39;s an option, you&amp;#39;re going to give in, &lt;em&gt;it&amp;#39;s just a matter of time.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;You control you. Let that sink in for a second. You control all of your actions. You decide which direction you want to take your life in. You decide what you do with your body, and when you do it. So if you really, &lt;em&gt;really&lt;/em&gt; wanted to stop masturbating, you would stop. Who moves your hand? Who downloads the porn you watch? Who, if not you, is responsible for your relapses?&lt;/p&gt;\n\n&lt;p&gt;And it&amp;#39;s not that you can&amp;#39;t stop because your willpower is weak, that&amp;#39;s bullshit you tell yourself to avoid taking responsibility for your own actions. You have willpower. We all have willpower. The reason you can&amp;#39;t stop, is because you don&amp;#39;t want to stop. If your will is to masturbate, you will masturbate. If your will is to stop, you will stop. It&amp;#39;s that simple.&lt;/p&gt;\n\n&lt;p&gt;So before you repeat the cycle, before you make a lengthy post on how ashamed you are for relapsing, and how you&amp;#39;re really committed to quitting PMO this time, be real with yourself. If nothing is different this time than the last time, it&amp;#39;s textbook-definition insanity to expect a different outcome.&lt;/p&gt;\n\n&lt;p&gt;The only way you can stop, is if you want to stop. No one can make you want to quit masturbating. It&amp;#39;s up to you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "*That does it. That was the last time,* you say to yourself. In your mind, you're preparing for the most extreme test of your willpower, as you once again make that commitment to give up PMO.\n\nBut what's really going to be different this time? What will set this attempt at giving up your porn addiction apart from the rest of your failed attempts?\n\nNothing.\n\nNothing will be different. Instead, you'll be repeating the same cycle you've grown to anticipate, and even find yourself comfortable with to some degree, like a bedtime routine. You'll reset your badge. You might make a post about starting from day one, how you're really going to make it this time, or some other bullshit along those lines. You'll spend hours on this forum, looking for some way to distract yourself. Some way to relieve the urge. You'll watch a few motivational videos, or surf the emergency button. But it won't do you any good, because as soon as you feel the urge to watch porn and blow your load, you'll give in. You might hesitate, you might make a post asking someone to help you, or encourage you to stop, as if they had any power at all to do that. But it won't matter. You'll do all the same things you did last time, and you'll relapse.\n\nWash, rinse, repeat.\n\nIf this sound like you, then the truth is, *you're not ready for NoFap.* The truth, the cold hard truth, is that you're not ready to make a change in your life. You love masturbating. You cling to the habit like a security blanket. The thing is, mommy and daddy aren't going to take that blanket away from you, that's your responsibility. You can see that people are improving their lives by giving up PMO, and you desire that positive change in your own life. But you want someone to coddle you while you give up the blanket, and there's no one who's going to. So you don't give it up. You keep it hidden, under your bed, so in case you feel momentarily uncomfortable, you know it's there to provide you consolation. The truth is, you don't want to give it up. You love that blanket, and despite the fact that it's holding you back from living a more fulfilling life, you'll never give it up. You'll always consider it an option. So long as you consider it a possibility in the back of your mind, PMO will always be an option for you. And so long as it's an option, you're going to give in, *it's just a matter of time.*\n\nYou control you. Let that sink in for a second. You control all of your actions. You decide which direction you want to take your life in. You decide what you do with your body, and when you do it. So if you really, *really* wanted to stop masturbating, you would stop. Who moves your hand? Who downloads the porn you watch? Who, if not you, is responsible for your relapses?\n\nAnd it's not that you can't stop because your willpower is weak, that's bullshit you tell yourself to avoid taking responsibility for your own actions. You have willpower. We all have willpower. The reason you can't stop, is because you don't want to stop. If your will is to masturbate, you will masturbate. If your will is to stop, you will stop. It's that simple.\n\nSo before you repeat the cycle, before you make a lengthy post on how ashamed you are for relapsing, and how you're really committed to quitting PMO this time, be real with yourself. If nothing is different this time than the last time, it's textbook-definition insanity to expect a different outcome.\n\nThe only way you can stop, is if you want to stop. No one can make you want to quit masturbating. It's up to you.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65jvq1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 73, "report_reasons": null, "author": "daintyknight", "saved": false, "mod_reports": [], "name": "t3_65jvq1", "subreddit_name_prefixed": "r/NoFap", "approved_by": null, "over_18": false, "domain": "self.NoFap", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2skrn", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/NoFap/comments/65jvq1/why_you_might_not_be_ready_for_nofap/", "num_reports": null, "locked": false, "stickied": false, "created": 1492301784.0, "url": "https://www.reddit.com/r/NoFap/comments/65jvq1/why_you_might_not_be_ready_for_nofap/", "author_flair_text": null, "quarantine": false, "title": "Why you might not be ready for NoFap.", "created_utc": 1492272984.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 23, "visited": false, "subreddit_type": "public", "ups": 73}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgcp1vg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sourc3original", "parent_id": "t1_dgcko4h", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Its better to not fap and relapse from time to time than just fap away until you feel \"ready\", this is bullshit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its better to not fap and relapse from time to time than just fap away until you feel &amp;quot;ready&amp;quot;, this is bullshit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcp1vg", "score_hidden": false, "stickied": false, "created": 1492411298.0, "created_utc": 1492382498.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcko4h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "daintyknight", "parent_id": "t1_dgbgeiq", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Well, in a way, they should. Think about it. If it's something they aren't ready to give up, even though they know they should, they're incredibly likely to relapse. And when they do, all they'll be bringing upon themselves is a self-imposed sense of shame and guilt, which is psychologically unhealthy.\n\nWhen a person wholeheartedly wants to make a positive change in their life, and they know that involves being uncomfortable at times, then they're ready. Until then, there's almost no point in trying. A guy who isn't mature enough to handle being uncomfortable temporarily for the sake of building his character and improving his life, isn't ready for NoFap. He'd be setting himself up to fail if he tried, and I think that's why a lot of guys on here relapse so frequently.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, in a way, they should. Think about it. If it&amp;#39;s something they aren&amp;#39;t ready to give up, even though they know they should, they&amp;#39;re incredibly likely to relapse. And when they do, all they&amp;#39;ll be bringing upon themselves is a self-imposed sense of shame and guilt, which is psychologically unhealthy.&lt;/p&gt;\n\n&lt;p&gt;When a person wholeheartedly wants to make a positive change in their life, and they know that involves being uncomfortable at times, then they&amp;#39;re ready. Until then, there&amp;#39;s almost no point in trying. A guy who isn&amp;#39;t mature enough to handle being uncomfortable temporarily for the sake of building his character and improving his life, isn&amp;#39;t ready for NoFap. He&amp;#39;d be setting himself up to fail if he tried, and I think that&amp;#39;s why a lot of guys on here relapse so frequently.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcko4h", "score_hidden": false, "stickied": false, "created": 1492405488.0, "created_utc": 1492376688.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbgeiq", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "sourc3original", "parent_id": "t1_dgb6e9n", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Also dont tell people they're not \"ready\" for nofap. This might lead to a \"oh i guess i should keep masturbating until i feel ready\" mentality.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also dont tell people they&amp;#39;re not &amp;quot;ready&amp;quot; for nofap. This might lead to a &amp;quot;oh i guess i should keep masturbating until i feel ready&amp;quot; mentality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbgeiq", "score_hidden": false, "stickied": false, "created": 1492333456.0, "created_utc": 1492304656.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgb7y44", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Shukakun", "parent_id": "t1_dgb7u4a", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "It has? Not saying it hasn't but this is the time I hear someone saying that, would love to read about it. It's consistently described as a real thing across several critically acclaimed books so I'm surprised to hear that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It has? Not saying it hasn&amp;#39;t but this is the time I hear someone saying that, would love to read about it. It&amp;#39;s consistently described as a real thing across several critically acclaimed books so I&amp;#39;m surprised to hear that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgb7y44", "score_hidden": false, "stickied": false, "created": 1492321401.0, "created_utc": 1492292601.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgbgcqt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sourc3original", "parent_id": "t1_dgb7u4a", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Source?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Source?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbgcqt", "score_hidden": false, "stickied": false, "created": 1492333391.0, "created_utc": 1492304591.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgbu6dr", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "NotJerrySeinfeld2", "parent_id": "t1_dgb7u4a", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "What I understood is that if you beleive in ego-depletion it will affect you, while if you don't believe in ego-depletion it won't.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What I understood is that if you beleive in ego-depletion it will affect you, while if you don&amp;#39;t believe in ego-depletion it won&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbu6dr", "score_hidden": false, "stickied": false, "created": 1492358585.0, "created_utc": 1492329785.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7u4a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Headrow1", "parent_id": "t1_dgb6e9n", "subreddit_name_prefixed": "r/NoFap", "controversiality": 1, "body": "You're talking about the ego depletion theory which has been debunked. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re talking about the ego depletion theory which has been debunked. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgb7u4a", "score_hidden": false, "stickied": false, "created": 1492321245.0, "created_utc": 1492292445.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgcjzmb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "daintyknight", "parent_id": "t1_dgb6e9n", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "As a recovering opiate addict, I find myself somewhat qualified to discuss willpower. Shall we?\n\n&gt; What you're doing is the equivalent of saying \"You could lift that 200kg barbell if you truly wanted to\". It doesn't work like that.\n\nYou're right, it doesn't work like that. The barbell is a poor analogy. That would be like saying you have to train your willpower-muscles in order to be able to overcome any kind of temptation; when the reality is, all you have to do is make a choice. You can choose to eat a bag of Lays when you get a craving for one, or you can choose not to. You can choose to wake up to your alarm, or you can choose not to. The choice to say \"no\" to an action isn't an unattainable feat like lifting a 200kg barbell, that's ridiculous.\n\nWe all have choices we have to make. All the time. I made the choice to abuse pills because it relieved me of some emotional suffering I was going through. But I had the choice not to. And every time I had the desire to use, I had the choice to say, \"no, that's not the direction I want to take my life in.\" But I made the choice to take my life down a dangerous path. I used because I wanted to use, instead of cleaning up my act and facing my problems like a mature adult.\n\nThe thing about opiate addiction, is you can't merely attempt to reduce the frequency of your doses, unless of course you're tapering off with the goal of saying clean. Opiate abuse tends to spiral out of control very rapidly. If I were to relapse right now, I'd probably be dead by the end of the year. Opiates physically alter various parts of your brain, until your brain is convinced that it needs the substance (and in increasingly greater quantities) in order to survive. When an addict quits cold turkey, their brain acts like it's going to die. This is why addicts will go to any limit to get their fix.\n\nAn opiate addict *can* quit cold turkey, and never pick up another needle or pill again. Despite nearly unbearable withdrawal symptoms, lasting depression, and cravings that may take months or years to fully go away, *it is possible to say no.* I'm living, breathing proof of that. And I'm here to tell you that it's not a matter of willpower, but a matter of will. The power to act out your will is already within you. How did I quit using pills? I sat there, next to the bottle, and asked myself what I wanted. And I knew I wanted to stop relying on narcotics to make it through the day. But I mean, I really wanted to quit. I wanted to quit so bad I was willing to die for the sake of being clean. So I just stopped taking them.\n\nAnd that's an addiction where your brain thinks it's going to die if it doesn't get relief. Masturbation and porn addictions, by comparison, are nowhere near as severe.\n\nThe point is, 'poor willpower' is just excuse people use to blame their mistakes on some part of their mind they don't feel accountable for. When you're sitting their in your chair at 2am, and you've got the browser open and you're thinking about your favorite porn site, you have the option to say *fuck that.* You have the option to not do it. At that point, like any addict, you must ask yourself what you really want to do, and what direction you want to take your life in. Because you're the one who opens the porn tab. You decided to do that. If you didn't want to, you wouldn't have done it, plain and simple.", "edited": 1492376249.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a recovering opiate addict, I find myself somewhat qualified to discuss willpower. Shall we?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What you&amp;#39;re doing is the equivalent of saying &amp;quot;You could lift that 200kg barbell if you truly wanted to&amp;quot;. It doesn&amp;#39;t work like that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re right, it doesn&amp;#39;t work like that. The barbell is a poor analogy. That would be like saying you have to train your willpower-muscles in order to be able to overcome any kind of temptation; when the reality is, all you have to do is make a choice. You can choose to eat a bag of Lays when you get a craving for one, or you can choose not to. You can choose to wake up to your alarm, or you can choose not to. The choice to say &amp;quot;no&amp;quot; to an action isn&amp;#39;t an unattainable feat like lifting a 200kg barbell, that&amp;#39;s ridiculous.&lt;/p&gt;\n\n&lt;p&gt;We all have choices we have to make. All the time. I made the choice to abuse pills because it relieved me of some emotional suffering I was going through. But I had the choice not to. And every time I had the desire to use, I had the choice to say, &amp;quot;no, that&amp;#39;s not the direction I want to take my life in.&amp;quot; But I made the choice to take my life down a dangerous path. I used because I wanted to use, instead of cleaning up my act and facing my problems like a mature adult.&lt;/p&gt;\n\n&lt;p&gt;The thing about opiate addiction, is you can&amp;#39;t merely attempt to reduce the frequency of your doses, unless of course you&amp;#39;re tapering off with the goal of saying clean. Opiate abuse tends to spiral out of control very rapidly. If I were to relapse right now, I&amp;#39;d probably be dead by the end of the year. Opiates physically alter various parts of your brain, until your brain is convinced that it needs the substance (and in increasingly greater quantities) in order to survive. When an addict quits cold turkey, their brain acts like it&amp;#39;s going to die. This is why addicts will go to any limit to get their fix.&lt;/p&gt;\n\n&lt;p&gt;An opiate addict &lt;em&gt;can&lt;/em&gt; quit cold turkey, and never pick up another needle or pill again. Despite nearly unbearable withdrawal symptoms, lasting depression, and cravings that may take months or years to fully go away, &lt;em&gt;it is possible to say no.&lt;/em&gt; I&amp;#39;m living, breathing proof of that. And I&amp;#39;m here to tell you that it&amp;#39;s not a matter of willpower, but a matter of will. The power to act out your will is already within you. How did I quit using pills? I sat there, next to the bottle, and asked myself what I wanted. And I knew I wanted to stop relying on narcotics to make it through the day. But I mean, I really wanted to quit. I wanted to quit so bad I was willing to die for the sake of being clean. So I just stopped taking them.&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s an addiction where your brain thinks it&amp;#39;s going to die if it doesn&amp;#39;t get relief. Masturbation and porn addictions, by comparison, are nowhere near as severe.&lt;/p&gt;\n\n&lt;p&gt;The point is, &amp;#39;poor willpower&amp;#39; is just excuse people use to blame their mistakes on some part of their mind they don&amp;#39;t feel accountable for. When you&amp;#39;re sitting their in your chair at 2am, and you&amp;#39;ve got the browser open and you&amp;#39;re thinking about your favorite porn site, you have the option to say &lt;em&gt;fuck that.&lt;/em&gt; You have the option to not do it. At that point, like any addict, you must ask yourself what you really want to do, and what direction you want to take your life in. Because you&amp;#39;re the one who opens the porn tab. You decided to do that. If you didn&amp;#39;t want to, you wouldn&amp;#39;t have done it, plain and simple.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcjzmb", "score_hidden": false, "stickied": false, "created": 1492404582.0, "created_utc": 1492375782.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb6e9n", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "Shukakun", "parent_id": "t3_65jvq1", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Willpower is not fairy dust. What you're doing is the equivalent of saying \"You could lift that 200kg barbell if you truly wanted to\". It doesn't work like that. Willpower is a lot like your actual physical muscles. Using it exhausts it and when you recover, it'll be better than before. Your glucose levels greatly influence how strong or weak it is from moment to moment. People on this subreddit will fail, and they will do so repeatedly, you're right about that. I say fuck 300 day streaks. If you can go from 10 orgasms a week to 9 orgasms a week, you're doing it right. By most peoples' definition here, someone who started out at 10 times/week and now has gotten to a point where he relapses every 5 or 6 days is an absolute failure, dude can't even reach the one week mark. But streaks don't mean shit. It's about reducing frequency, breaking the habit, exercising your willpower and training your brain to not give in. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Willpower is not fairy dust. What you&amp;#39;re doing is the equivalent of saying &amp;quot;You could lift that 200kg barbell if you truly wanted to&amp;quot;. It doesn&amp;#39;t work like that. Willpower is a lot like your actual physical muscles. Using it exhausts it and when you recover, it&amp;#39;ll be better than before. Your glucose levels greatly influence how strong or weak it is from moment to moment. People on this subreddit will fail, and they will do so repeatedly, you&amp;#39;re right about that. I say fuck 300 day streaks. If you can go from 10 orgasms a week to 9 orgasms a week, you&amp;#39;re doing it right. By most peoples&amp;#39; definition here, someone who started out at 10 times/week and now has gotten to a point where he relapses every 5 or 6 days is an absolute failure, dude can&amp;#39;t even reach the one week mark. But streaks don&amp;#39;t mean shit. It&amp;#39;s about reducing frequency, breaking the habit, exercising your willpower and training your brain to not give in. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgb6e9n", "score_hidden": false, "stickied": false, "created": 1492319261.0, "created_utc": 1492290461.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgbp9cd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MotleyPanther", "parent_id": "t1_dgb8mth", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Preach brutha!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Preach brutha!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbp9cd", "score_hidden": false, "stickied": false, "created": 1492347078.0, "created_utc": 1492318278.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb8mth", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "qazz43", "parent_id": "t3_65jvq1", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "A man chooses a slave obeys", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A man chooses a slave obeys&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgb8mth", "score_hidden": false, "stickied": false, "created": 1492322349.0, "created_utc": 1492293549.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgbq4bv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Chriscotli", "parent_id": "t1_dgbd2wr", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "You mean You agree, right? Argue is the word of different meaning :P", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You mean You agree, right? Argue is the word of different meaning :P&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbq4bv", "score_hidden": false, "stickied": false, "created": 1492348649.0, "created_utc": 1492319849.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbd2wr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "onlywanderlust", "parent_id": "t1_dgaw8x5", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "That's the only way, I arguee. The only way to break any addiction.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the only way, I arguee. The only way to break any addiction.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbd2wr", "score_hidden": false, "stickied": false, "created": 1492328757.0, "created_utc": 1492299957.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaw8x5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Chriscotli", "parent_id": "t3_65jvq1", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Change Your life and You can get rid of masturbation, right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Change Your life and You can get rid of masturbation, right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgaw8x5", "score_hidden": false, "stickied": false, "created": 1492305478.0, "created_utc": 1492276678.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgb3waf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Redbeard616", "parent_id": "t3_65jvq1", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Thank you man for the advice! Is indeed helpful and motivating. I hope we all do our best and destroy this awful habit of PMO that each of us individuals have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you man for the advice! Is indeed helpful and motivating. I hope we all do our best and destroy this awful habit of PMO that each of us individuals have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgb3waf", "score_hidden": false, "stickied": false, "created": 1492315841.0, "created_utc": 1492287041.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgbo4cb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Siloam", "parent_id": "t3_65jvq1", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "This thread reminds me of TheUnderdog's \"My Thoughts On Rebooting,\" has anyone here read that? He states that one needs to gravitate from an abstinence-based approach to a recovery-based one, which implies drastic, sweeping (and gradual incremental) changes to one's entire lifestyle and mindset. It's not enough to fap and just say, \"Ok, well, I just won't do it again.\" Addiction doesn't work that way. You need a full repertoire of techniques and methods to combat PMO, otherwise, yes, you will not be ready or able to stop.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This thread reminds me of TheUnderdog&amp;#39;s &amp;quot;My Thoughts On Rebooting,&amp;quot; has anyone here read that? He states that one needs to gravitate from an abstinence-based approach to a recovery-based one, which implies drastic, sweeping (and gradual incremental) changes to one&amp;#39;s entire lifestyle and mindset. It&amp;#39;s not enough to fap and just say, &amp;quot;Ok, well, I just won&amp;#39;t do it again.&amp;quot; Addiction doesn&amp;#39;t work that way. You need a full repertoire of techniques and methods to combat PMO, otherwise, yes, you will not be ready or able to stop.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbo4cb", "score_hidden": false, "stickied": false, "created": 1492345071.0, "created_utc": 1492316271.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgco6yr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nofaptree", "parent_id": "t1_dgc9opy", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I understand what you are saying in a way. As in, people don't want to quit bad enough. I don't think it is a very good way to preach the message, because it sounds like 'go hard or go home'. \n\nSay you decided it wasn't for you and were like, 'alright I'm just gonna keep on fapping'. Now what? They will probably eventually realise how fucked their life is all, over again. Then they will be back to square one. Or maybe they will think that life isn't so bad with fapping after all and wait a few years before realising what it is doing again. Some people in the other hand may be like 'that guy is nuts, I'll show him who wants to quit\".\n\nAs I said before, I believe it is about a balance of two wills. It is better to fap a little bit than to fap a lot. You can't discount the 'halfway progress'. Even if someone is not progressing at all, the progress that they have made so far shouldn't be thrown away. The message should not be 'go hard or go home'. This is why I disagree with these posts. We should be encouraging people to try harder, never to just give up if they can't get a 90 day streak right now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand what you are saying in a way. As in, people don&amp;#39;t want to quit bad enough. I don&amp;#39;t think it is a very good way to preach the message, because it sounds like &amp;#39;go hard or go home&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;Say you decided it wasn&amp;#39;t for you and were like, &amp;#39;alright I&amp;#39;m just gonna keep on fapping&amp;#39;. Now what? They will probably eventually realise how fucked their life is all, over again. Then they will be back to square one. Or maybe they will think that life isn&amp;#39;t so bad with fapping after all and wait a few years before realising what it is doing again. Some people in the other hand may be like &amp;#39;that guy is nuts, I&amp;#39;ll show him who wants to quit&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;As I said before, I believe it is about a balance of two wills. It is better to fap a little bit than to fap a lot. You can&amp;#39;t discount the &amp;#39;halfway progress&amp;#39;. Even if someone is not progressing at all, the progress that they have made so far shouldn&amp;#39;t be thrown away. The message should not be &amp;#39;go hard or go home&amp;#39;. This is why I disagree with these posts. We should be encouraging people to try harder, never to just give up if they can&amp;#39;t get a 90 day streak right now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgco6yr", "score_hidden": false, "stickied": false, "created": 1492410111.0, "created_utc": 1492381311.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9opy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "daintyknight", "parent_id": "t1_dgbuzk2", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "To answer your first question, it's not easy. Let me make an analogy.\n\nSay news headlines across the country were reporting that running was a great hobby, because people who run experience many psychological and physical health benefits. So you say, *Wow, I want to experience those benefits. I'll try running!* But you quickly realize that you don't enjoy the activity at all. You see other people doing it, and often bragging about their best time, and how good they feel, and you want what they have. But the truth is, it's difficult to make yourself want to do something you really don't want to do. So you might try to run once in a while, but you fail to make it a regular habit because it's really not in you. The same goes for NoFap.\n\nThere's no 'secret to making yourself want to quit.' Anyone who says they know the secret is bullshitting you, you can be sure. It's really quite simple: you either want to quit, or you don't. That's it. So how do you know if you want to quit? If you get an urge to jack off, and you move your hand over the cursor and type in a porn address and do the deed, you didn't want to quit. You wanted to masturbate. You see? You control you. If you get the urge to masturbate, and you don't do it, then you really want to quit. It's that simple. Now, of course, some people lie to themselves, and tell themselves and others that they want to give up porn, when deep down they really don't. This is because they know that it's better for them if they do, and they feel a sense of gratification if they believe they're giving up a bad habit; but when they get the urge, they still give in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To answer your first question, it&amp;#39;s not easy. Let me make an analogy.&lt;/p&gt;\n\n&lt;p&gt;Say news headlines across the country were reporting that running was a great hobby, because people who run experience many psychological and physical health benefits. So you say, &lt;em&gt;Wow, I want to experience those benefits. I&amp;#39;ll try running!&lt;/em&gt; But you quickly realize that you don&amp;#39;t enjoy the activity at all. You see other people doing it, and often bragging about their best time, and how good they feel, and you want what they have. But the truth is, it&amp;#39;s difficult to make yourself want to do something you really don&amp;#39;t want to do. So you might try to run once in a while, but you fail to make it a regular habit because it&amp;#39;s really not in you. The same goes for NoFap.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s no &amp;#39;secret to making yourself want to quit.&amp;#39; Anyone who says they know the secret is bullshitting you, you can be sure. It&amp;#39;s really quite simple: you either want to quit, or you don&amp;#39;t. That&amp;#39;s it. So how do you know if you want to quit? If you get an urge to jack off, and you move your hand over the cursor and type in a porn address and do the deed, you didn&amp;#39;t want to quit. You wanted to masturbate. You see? You control you. If you get the urge to masturbate, and you don&amp;#39;t do it, then you really want to quit. It&amp;#39;s that simple. Now, of course, some people lie to themselves, and tell themselves and others that they want to give up porn, when deep down they really don&amp;#39;t. This is because they know that it&amp;#39;s better for them if they do, and they feel a sense of gratification if they believe they&amp;#39;re giving up a bad habit; but when they get the urge, they still give in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc9opy", "score_hidden": false, "stickied": false, "created": 1492391024.0, "created_utc": 1492362224.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbuzk2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nofaptree", "parent_id": "t3_65jvq1", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "What do you suggest people do to make themselves want to stop? I see a lot of posts saying that the only reason people relapse is because they don't truly want to stop, but that is where the posts end. What is your secret to making yourself want to quit?\n\nAlso, IMO it is actually a balance of two things. Your will to quit and your will to not quit. I think many people are letting their will to not quit overpower their will to quit. If they had no will to quit, then they wouldn't be doing NoFap at all. They would have just given up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do you suggest people do to make themselves want to stop? I see a lot of posts saying that the only reason people relapse is because they don&amp;#39;t truly want to stop, but that is where the posts end. What is your secret to making yourself want to quit?&lt;/p&gt;\n\n&lt;p&gt;Also, IMO it is actually a balance of two things. Your will to quit and your will to not quit. I think many people are letting their will to not quit overpower their will to quit. If they had no will to quit, then they wouldn&amp;#39;t be doing NoFap at all. They would have just given up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbuzk2", "score_hidden": false, "stickied": false, "created": 1492361202.0, "created_utc": 1492332402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgbi3vc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Alienbaby12096", "parent_id": "t3_65jvq1", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "When you said security blanket, Zack and Cody popped into my mind with Cody's security blanket. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you said security blanket, Zack and Cody popped into my mind with Cody&amp;#39;s security blanket. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbi3vc", "score_hidden": false, "stickied": false, "created": 1492335919.0, "created_utc": 1492307119.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgbwc04", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Magdrasyl", "parent_id": "t3_65jvq1", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Thank you, I feel some people really need to hear this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I feel some people really need to hear this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbwc04", "score_hidden": false, "stickied": false, "created": 1492365838.0, "created_utc": 1492337038.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgbv80d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mitsigan", "parent_id": "t3_65jvq1", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "This is actually a great post. I am on NoFap for a year almost. I loved to masturbate before I got here, I still would whisper to myself how great it felt to cum even after I discovered NoFap. I wasn't ment to stop and I see this clearly now that I eventually got sick to the bones because of it and stopped and made me know that I won't ever masturbate again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is actually a great post. I am on NoFap for a year almost. I loved to masturbate before I got here, I still would whisper to myself how great it felt to cum even after I discovered NoFap. I wasn&amp;#39;t ment to stop and I see this clearly now that I eventually got sick to the bones because of it and stopped and made me know that I won&amp;#39;t ever masturbate again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbv80d", "score_hidden": false, "stickied": false, "created": 1492361980.0, "created_utc": 1492333180.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65jvq1", "likes": null, "replies": "", "user_reports": [], "id": "dgbcxbn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rasul09", "parent_id": "t3_65jvq1", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Wise words", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wise words&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgbcxbn", "score_hidden": false, "stickied": false, "created": 1492328542.0, "created_utc": 1492299742.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]