[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "NoFap", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let me try to wrap it up.&lt;/p&gt;\n\n&lt;p&gt;This journey has been a hell of a ride and I&amp;#39;m not even beginning to think about quitting. I haven&amp;#39;t relapsed. Which is nice in a way, because I&amp;#39;m once again proving myself that I&amp;#39;m a very dedicated and disciplined person. Consequently, though, I haven&amp;#39;t had the &amp;quot;Fuck, relapsing is ruining all my progress&amp;quot; experience, which makes it really hard to interpret my emotional states.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve experienced phenomenal life changes over the past 8 months, including most common NoFap benefits such as better skin, better physical performance at the gym, hair growth, &amp;quot;mojo/attraction&amp;quot;, discipline in other aspect of life (eg no more binge eating), and others.&lt;/p&gt;\n\n&lt;p&gt;However, I&amp;#39;ve barely made any progress regarding my social anxiety. I doubt myself. I&amp;#39;m still trying to please the shit out of every person I talk to, including my family. Consequently, in any kind of social setting, I feel like a chameleon. I do and say what I think will make my opponents feel good.&lt;/p&gt;\n\n&lt;p&gt;Now, this wouldn&amp;#39;t even be all that bad. The tricky part, though, is if I&amp;#39;m in a group with more than 2 people involved in the converation/ setting. My brain is going into overdrive. It can&amp;#39;t keep it up with all the stakeholders involved in the conversation. Who am I supposed to talk to? Who am I supposed to please? What is the unversal threshold of being yourself and being loyal to your own virtues, but at the same time adapting to such an extent to be able to carry on a conversation.&lt;/p&gt;\n\n&lt;p&gt;The latter is the hardest part. I will even be able to approach people and strike up conversation, even feel confident while doing so. But the minute the person starts answering and involving in the conversation, I freeze.&lt;/p&gt;\n\n&lt;p&gt;My. Brain. Literally. Freezes. The only thing then I can do is try to not act weird, try to act normal and get out of the situation. It&amp;#39;s frustrating.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve just moved to a new city and started law school. The past week I went to more partys and social gatherings (including lectures) than in the last year combined. I feel like my stress levels are up the minute I wake up in the morning. Over the past days, my only goal was to get through the day and not get people disgusted at me.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know guys. It&amp;#39;s funny. This is kinda random, but I&amp;#39;ve had many people (girls, for the most part) tell me that I&amp;#39;m a 10/10. And yes, I am good looking and have a nice physique. But who fucking cares? We all know that girls prefer a confident, potentially succesful man over somebody who is really good looking yet doesn&amp;#39;t have confidence and no social intelligence. It&amp;#39;s frustrating when I have all these assets (I&amp;#39;ve graduated in business and consider myself an intelligent person, also regarding my future studies) at my diposal but can&amp;#39;t seem to use them.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 24 and I&amp;#39;ve been using PMO pretty bad (both frequency and escalation). So I wasn&amp;#39;t really surprised that I didn&amp;#39;t magically turn my life around once I hit the 90 day mark. Like I said, I&amp;#39;m gonna continue this journey no matter what.&lt;/p&gt;\n\n&lt;p&gt;I guess what I&amp;#39;m looking for is some encouragement from NoFappers who&amp;#39;ve been in similar situations. Experiencing severe social anxiety and worsening of symptoms on long streaks before eventually coming out of the flatline. Which, the flatline doesn&amp;#39;t really make things easier, when you finally have the chance to frequent social gatherings and partys again but feel like an asexual clone trapped in the body of a good looking young man.&lt;/p&gt;\n\n&lt;p&gt;I apologize for the lack of structure in my post. All of your guys&amp;#39; feedback is highly appreciated.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT: To clarify: I used to be a very social, happy kid growing up. Also the initial years after starting PMO on a regular basis, I was happy and engaged in all kinds of social activities.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Let me try to wrap it up.\n\nThis journey has been a hell of a ride and I'm not even beginning to think about quitting. I haven't relapsed. Which is nice in a way, because I'm once again proving myself that I'm a very dedicated and disciplined person. Consequently, though, I haven't had the \"Fuck, relapsing is ruining all my progress\" experience, which makes it really hard to interpret my emotional states.\n\nI've experienced phenomenal life changes over the past 8 months, including most common NoFap benefits such as better skin, better physical performance at the gym, hair growth, \"mojo/attraction\", discipline in other aspect of life (eg no more binge eating), and others.\n\nHowever, I've barely made any progress regarding my social anxiety. I doubt myself. I'm still trying to please the shit out of every person I talk to, including my family. Consequently, in any kind of social setting, I feel like a chameleon. I do and say what I think will make my opponents feel good.\n\nNow, this wouldn't even be all that bad. The tricky part, though, is if I'm in a group with more than 2 people involved in the converation/ setting. My brain is going into overdrive. It can't keep it up with all the stakeholders involved in the conversation. Who am I supposed to talk to? Who am I supposed to please? What is the unversal threshold of being yourself and being loyal to your own virtues, but at the same time adapting to such an extent to be able to carry on a conversation.\n\nThe latter is the hardest part. I will even be able to approach people and strike up conversation, even feel confident while doing so. But the minute the person starts answering and involving in the conversation, I freeze.\n\nMy. Brain. Literally. Freezes. The only thing then I can do is try to not act weird, try to act normal and get out of the situation. It's frustrating.\n\nI've just moved to a new city and started law school. The past week I went to more partys and social gatherings (including lectures) than in the last year combined. I feel like my stress levels are up the minute I wake up in the morning. Over the past days, my only goal was to get through the day and not get people disgusted at me.\n\nI don't know guys. It's funny. This is kinda random, but I've had many people (girls, for the most part) tell me that I'm a 10/10. And yes, I am good looking and have a nice physique. But who fucking cares? We all know that girls prefer a confident, potentially succesful man over somebody who is really good looking yet doesn't have confidence and no social intelligence. It's frustrating when I have all these assets (I've graduated in business and consider myself an intelligent person, also regarding my future studies) at my diposal but can't seem to use them.\n\nI'm 24 and I've been using PMO pretty bad (both frequency and escalation). So I wasn't really surprised that I didn't magically turn my life around once I hit the 90 day mark. Like I said, I'm gonna continue this journey no matter what.\n\nI guess what I'm looking for is some encouragement from NoFappers who've been in similar situations. Experiencing severe social anxiety and worsening of symptoms on long streaks before eventually coming out of the flatline. Which, the flatline doesn't really make things easier, when you finally have the chance to frequent social gatherings and partys again but feel like an asexual clone trapped in the body of a good looking young man.\n\nI apologize for the lack of structure in my post. All of your guys' feedback is highly appreciated.\n\n\n**EDIT: To clarify: I used to be a very social, happy kid growing up. Also the initial years after starting PMO on a regular basis, I was happy and engaged in all kinds of social activities.**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65p449", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "Schimmen", "saved": false, "mod_reports": [], "name": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "approved_by": null, "over_18": false, "domain": "self.NoFap", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2skrn", "edited": 1492361012.0, "link_flair_css_class": null, "author_flair_css_class": "month8", "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/NoFap/comments/65p449/day_251_experiencing_severe_social_anxiety_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492378390.0, "url": "https://www.reddit.com/r/NoFap/comments/65p449/day_251_experiencing_severe_social_anxiety_and/", "author_flair_text": "252 Days", "quarantine": false, "title": "Day 251. Experiencing severe social anxiety and low self esteem. I don't know who I am anymore. Is this still flatline or have I just become an antisocial, awkward person? Insight from people on long streaks appreciated.", "created_utc": 1492349590.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 41, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgcebvp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Donut_Kin", "parent_id": "t1_dgc4dyx", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Word.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Word.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcebvp", "score_hidden": false, "stickied": false, "created": 1492397192.0, "created_utc": 1492368392.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4dyx", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "crystalblacks", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Unfortunately, that's the reality of nofap, it's going to give you a boost of energy, but it won't change who you are. There is two fronts that needs to be addressed to beat this: 1) physical : over masturbating and watching porn 2) mental: why am I over masturbating to begin with, what am I running from.\n\nYou seem to have the first part down, but not the second one. You need to start working on yourself mentally to understand why you feel that way and are that way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately, that&amp;#39;s the reality of nofap, it&amp;#39;s going to give you a boost of energy, but it won&amp;#39;t change who you are. There is two fronts that needs to be addressed to beat this: 1) physical : over masturbating and watching porn 2) mental: why am I over masturbating to begin with, what am I running from.&lt;/p&gt;\n\n&lt;p&gt;You seem to have the first part down, but not the second one. You need to start working on yourself mentally to understand why you feel that way and are that way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc4dyx", "score_hidden": false, "stickied": false, "created": 1492383887.0, "created_utc": 1492355087.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgc8p0r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crazyrj14", "parent_id": "t1_dgc8gx4", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "You better leave that gaht damn porn alone or suffer the consequences of backtracking and regret boi ~&gt;~\n\nJokes aside im naturally introverted, even now. Socializing is generally more enjoyable but i dont pressure myself to say things or do things i dont naturally feel. If nothing comes up, then i go by that. And people are ok with me because im GENUINE in whatever i do! And you might be the same as me!\n\nBut you wont get much progress looking at porn man, LEAVE IT ALONE!", "edited": 1492381599.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You better leave that gaht damn porn alone or suffer the consequences of backtracking and regret boi ~&amp;gt;~&lt;/p&gt;\n\n&lt;p&gt;Jokes aside im naturally introverted, even now. Socializing is generally more enjoyable but i dont pressure myself to say things or do things i dont naturally feel. If nothing comes up, then i go by that. And people are ok with me because im GENUINE in whatever i do! And you might be the same as me!&lt;/p&gt;\n\n&lt;p&gt;But you wont get much progress looking at porn man, LEAVE IT ALONE!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc8p0r", "score_hidden": false, "stickied": false, "created": 1492389756.0, "created_utc": 1492360956.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgd7nx3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "asker89", "parent_id": "t1_dgc8gx4", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I hope you've read my other post in your topic, but I wanted to reply to this post in specific because it really sounds like you're developing a burnout problem and it isn't due to NoFap.\n\nYou said you've gone to more lectures and gatherings in the past week than in the past year combined. These law school lectures, I'm assuming they're quite dense. The social gatherings aren't completely without consequence, as someone with a background in business I'm sure you know how important networking can be. \n\nYou're focused on improving yourself, to work on yourself. But if you work so hard 100% of the time your body and your neurons aren't going to be able to take it. You're going to burn out. It sounds like you've already started to feel the effects of burn out, apathy and anxiety aren't uncommon first signs. \n\nYou have to find a way to make time for yourself so you can relax. This is critical to prevent burning out. Further more you should really get professional help. It's really important that you get this under control ASAP because this sort of problem is relatively common in postgraduate education and can really mess up your work if it gets out of hand. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope you&amp;#39;ve read my other post in your topic, but I wanted to reply to this post in specific because it really sounds like you&amp;#39;re developing a burnout problem and it isn&amp;#39;t due to NoFap.&lt;/p&gt;\n\n&lt;p&gt;You said you&amp;#39;ve gone to more lectures and gatherings in the past week than in the past year combined. These law school lectures, I&amp;#39;m assuming they&amp;#39;re quite dense. The social gatherings aren&amp;#39;t completely without consequence, as someone with a background in business I&amp;#39;m sure you know how important networking can be. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re focused on improving yourself, to work on yourself. But if you work so hard 100% of the time your body and your neurons aren&amp;#39;t going to be able to take it. You&amp;#39;re going to burn out. It sounds like you&amp;#39;ve already started to feel the effects of burn out, apathy and anxiety aren&amp;#39;t uncommon first signs. &lt;/p&gt;\n\n&lt;p&gt;You have to find a way to make time for yourself so you can relax. This is critical to prevent burning out. Further more you should really get professional help. It&amp;#39;s really important that you get this under control ASAP because this sort of problem is relatively common in postgraduate education and can really mess up your work if it gets out of hand. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgd7nx3", "score_hidden": false, "stickied": false, "created": 1492439732.0, "created_utc": 1492410932.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8gx4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Schimmen", "parent_id": "t1_dgc7i54", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I know what I gotta do. I gotta work on myself (especially education, fitness/health and maintaining true friendships). \n\nIt's just so fucking hard to push myself to talk to people when it doesn't feel rewarding (cause at this point, still, the amount of dopamine released socializing is still a joke compared to the ocean of dopamine releases during PMO. My receptors must still be too desensitized. There's no other explanation).  It's just fucking apathy that comes with the Flatline. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know what I gotta do. I gotta work on myself (especially education, fitness/health and maintaining true friendships). &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just so fucking hard to push myself to talk to people when it doesn&amp;#39;t feel rewarding (cause at this point, still, the amount of dopamine released socializing is still a joke compared to the ocean of dopamine releases during PMO. My receptors must still be too desensitized. There&amp;#39;s no other explanation).  It&amp;#39;s just fucking apathy that comes with the Flatline. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc8gx4", "score_hidden": false, "stickied": false, "created": 1492389466.0, "created_utc": 1492360666.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7i54", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "crazyrj14", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "You are at a stage now where you have the energy and mental clarity to see what you need to improve on.\n\nNofap is a BIG PIECE TO THE PUZZLE, but a piece nevertheless. You need to work on yourself. Nofap is to help push you forward in the right direction, but the rest is up to you.\n\nAlso, THROW THAT FUCKING GARBAGE(PORN) AWAY, LEAVE THAT SHIT ALONE, YOU ARE TAKING STEPS BACKWARDS!!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are at a stage now where you have the energy and mental clarity to see what you need to improve on.&lt;/p&gt;\n\n&lt;p&gt;Nofap is a BIG PIECE TO THE PUZZLE, but a piece nevertheless. You need to work on yourself. Nofap is to help push you forward in the right direction, but the rest is up to you.&lt;/p&gt;\n\n&lt;p&gt;Also, THROW THAT FUCKING GARBAGE(PORN) AWAY, LEAVE THAT SHIT ALONE, YOU ARE TAKING STEPS BACKWARDS!!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc7i54", "score_hidden": false, "stickied": false, "created": 1492388178.0, "created_utc": 1492359378.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgco6hq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "drannigan", "parent_id": "t1_dgc7ie7", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "It's not selfish or egocentric to love yourself. It's a genuinely intelligent and healthy way to live.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not selfish or egocentric to love yourself. It&amp;#39;s a genuinely intelligent and healthy way to live.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgco6hq", "score_hidden": false, "stickied": false, "created": 1492410093.0, "created_utc": 1492381293.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7ie7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Schimmen", "parent_id": "t1_dgc55ra", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Yeah, that's an approach I've been trying to pursue lately. What I tell myself is that even if I were to act really selfish and egocentric, it's still gonna be nothing compared to \"real douchebags\" out there. Like, my core personality has too much decency to actually piss ppl off for real. If that makes sense. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, that&amp;#39;s an approach I&amp;#39;ve been trying to pursue lately. What I tell myself is that even if I were to act really selfish and egocentric, it&amp;#39;s still gonna be nothing compared to &amp;quot;real douchebags&amp;quot; out there. Like, my core personality has too much decency to actually piss ppl off for real. If that makes sense. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc7ie7", "score_hidden": false, "stickied": false, "created": 1492388188.0, "created_utc": 1492359388.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc55ra", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nofappinwaydude45", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Bro, the longest streak I've had was 114 days so I can at least be slightly credible.  My best advice for you is yo stop trying to please people.  Stop looking for other people's approval and instead focus on loving yourself", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bro, the longest streak I&amp;#39;ve had was 114 days so I can at least be slightly credible.  My best advice for you is yo stop trying to please people.  Stop looking for other people&amp;#39;s approval and instead focus on loving yourself&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc55ra", "score_hidden": false, "stickied": false, "created": 1492384985.0, "created_utc": 1492356185.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgces4b", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Arzenicx", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Hello there, I have not read it all but I will explain my opinion here because I have this condition, too.\n\nBrother, problem with us is that we try to please others and we believe that our brain is damaged. Day 188 for me and I see just minor improvement in conversations. \n\nI know its hard. We created block that is holding us back. 3 years ago when I still was drinking I noticed that I could converse like a boss, but only when I was drunk. Our brain is fine, but we believe that we cannot converse, and our subconscious, will make it happen. We need to persuade ourselves that we are great conversationalists, but this is not possible in short time. Once you will believe to it your converse skills will be as good as others people if not better. \n\nUnless you will deeply believe it you will be freezing. Personally when I talk I fake it and other feel it. Last week I decided to keep my mouth shut, and only speak when I feel like it. I see different approach of other people to me and to others. When they speak with me they are numb, but when they speak with others they are normal. So there is problem inside me. And I´m fine about it, I won´t fake anything again, I have always spoke little and I don´t care. \n\nOtherwise If you want it change you need to practice, and once you will believe that you are good......\n\nSorry for repetition :-D\n\nEDIT: You mentioned here you were happiest kid ever. What different have you done before?\n\nEDIT 2: http://brainscale.net/dual-n-back \n\nI don´t know if it works, but hopefully yes. Gonna try it myself. It was in one reply to my comment by another kind user. I dont know if it works but it says it has these benefits:\n\neasier to get a hold of a discussion\n\nbetter verbal fluency\n\nfaster reading with better understanding\n\nbetter concentration and focus\n\nbetter dream recall\n\nimprovements in piano playing", "edited": 1492369958.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello there, I have not read it all but I will explain my opinion here because I have this condition, too.&lt;/p&gt;\n\n&lt;p&gt;Brother, problem with us is that we try to please others and we believe that our brain is damaged. Day 188 for me and I see just minor improvement in conversations. &lt;/p&gt;\n\n&lt;p&gt;I know its hard. We created block that is holding us back. 3 years ago when I still was drinking I noticed that I could converse like a boss, but only when I was drunk. Our brain is fine, but we believe that we cannot converse, and our subconscious, will make it happen. We need to persuade ourselves that we are great conversationalists, but this is not possible in short time. Once you will believe to it your converse skills will be as good as others people if not better. &lt;/p&gt;\n\n&lt;p&gt;Unless you will deeply believe it you will be freezing. Personally when I talk I fake it and other feel it. Last week I decided to keep my mouth shut, and only speak when I feel like it. I see different approach of other people to me and to others. When they speak with me they are numb, but when they speak with others they are normal. So there is problem inside me. And I´m fine about it, I won´t fake anything again, I have always spoke little and I don´t care. &lt;/p&gt;\n\n&lt;p&gt;Otherwise If you want it change you need to practice, and once you will believe that you are good......&lt;/p&gt;\n\n&lt;p&gt;Sorry for repetition :-D&lt;/p&gt;\n\n&lt;p&gt;EDIT: You mentioned here you were happiest kid ever. What different have you done before?&lt;/p&gt;\n\n&lt;p&gt;EDIT 2: &lt;a href=\"http://brainscale.net/dual-n-back\"&gt;http://brainscale.net/dual-n-back&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;I don´t know if it works, but hopefully yes. Gonna try it myself. It was in one reply to my comment by another kind user. I dont know if it works but it says it has these benefits:&lt;/p&gt;\n\n&lt;p&gt;easier to get a hold of a discussion&lt;/p&gt;\n\n&lt;p&gt;better verbal fluency&lt;/p&gt;\n\n&lt;p&gt;faster reading with better understanding&lt;/p&gt;\n\n&lt;p&gt;better concentration and focus&lt;/p&gt;\n\n&lt;p&gt;better dream recall&lt;/p&gt;\n\n&lt;p&gt;improvements in piano playing&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgces4b", "score_hidden": false, "stickied": false, "created": 1492397806.0, "created_utc": 1492369006.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgcj51f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Schimmen", "parent_id": "t1_dgca9ku", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Fuck. This is me. So me. \nLike I feel the minute I'm present, it's up to me to make everyone's night. It's almost narcisstic cause I feel like that's my job and everyone's supposed to respect me for that. That's so messed up. Yes, I so wanna make ppl laugh. No, I don't want to feel obliged to be in charge of other ppls happiness. \n\nThank you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck. This is me. So me. \nLike I feel the minute I&amp;#39;m present, it&amp;#39;s up to me to make everyone&amp;#39;s night. It&amp;#39;s almost narcisstic cause I feel like that&amp;#39;s my job and everyone&amp;#39;s supposed to respect me for that. That&amp;#39;s so messed up. Yes, I so wanna make ppl laugh. No, I don&amp;#39;t want to feel obliged to be in charge of other ppls happiness. &lt;/p&gt;\n\n&lt;p&gt;Thank you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcj51f", "score_hidden": false, "stickied": false, "created": 1492403488.0, "created_utc": 1492374688.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgcf3if", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Arzenicx", "parent_id": "t1_dgca9ku", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Exactly mine problem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly mine problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcf3if", "score_hidden": false, "stickied": false, "created": 1492398229.0, "created_utc": 1492369429.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgca9ku", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "taoofmojo", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I think you are judging yourself all the time. If their is a 10 second silent then its your fault. If someone not having fun then its your fault. LET GO OF THE OUTCOME in social situation. Next time you are at a event just start doing meditation this will slow down your thoughts put you back in to the now.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you are judging yourself all the time. If their is a 10 second silent then its your fault. If someone not having fun then its your fault. LET GO OF THE OUTCOME in social situation. Next time you are at a event just start doing meditation this will slow down your thoughts put you back in to the now.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgca9ku", "score_hidden": false, "stickied": false, "created": 1492391793.0, "created_utc": 1492362993.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgcr98v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sixseventen", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Firstly, let me congratulate you on your phenomenal achievements. You sound like a very intelligent person with a lot to give to the world.\n\nIf you'd allow me... let me see if I can suggest a few things that might help you:\n\n1. Start meditating. Start with 10 minutes a day, and build up to 30mins - 1h a day. This is going to lower your stress and anxiety, and allow you for your active, intelligent mind to have less of a grip on your personal wellbeing. Look up how to meditate online. Find a style that suits you. Read Eckhart Tolle - The Power Of Now and listen to lots of Alan Watts.\n\n2. Take steps toward finding your life's purpose. You may not know it yet, and that's OK. The things you're doing now will reveal themselves later to be pieces of the puzzle that led to your ultimate dream. But this is how you know you're on your way... Ask yourself: What things make me feel: Excited, passionate, adventurous, connected, and contributing to others? Write down the things that make you feel the emotions I've listed, and start doing more of them.\n\n3. Start building a loving relationship with yourself. Congratulate yourself on your successes. Give yourself rest when needed. Know that you are loved and you have love to give other people. The more you love and accept yourself, the closer you'll be to attracting someone who loves and accepts themself, a reflection of the new you... which is your ideal life partner, not the people you'll attract now, which will currently be a reflection of your currently insecure and worrying self.\n\n4. If you feel like you don't fit in and don't have many friends that you really feel resonate with your heart, then it may be because you are destined for greatness and don't want to settle for the same mundane emotions and experiences that other people do. This is the burden of a highly intelligent person destined for greatness. They often have to travel a part of the road that is lonely. Use this time to work on your dreams and visions and goals, and doing the things that make you feel alive.\n\n5. Create a list of positive affirmations to read to yourself every morning that resonate with you. \"I am loved\" \"Today is another opportunity to take steps to realise my goals\". Make them ring with gratitude. Write down things every day that you are grateful for.\n\nPeace and love bro", "edited": 1492385918.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Firstly, let me congratulate you on your phenomenal achievements. You sound like a very intelligent person with a lot to give to the world.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;d allow me... let me see if I can suggest a few things that might help you:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Start meditating. Start with 10 minutes a day, and build up to 30mins - 1h a day. This is going to lower your stress and anxiety, and allow you for your active, intelligent mind to have less of a grip on your personal wellbeing. Look up how to meditate online. Find a style that suits you. Read Eckhart Tolle - The Power Of Now and listen to lots of Alan Watts.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Take steps toward finding your life&amp;#39;s purpose. You may not know it yet, and that&amp;#39;s OK. The things you&amp;#39;re doing now will reveal themselves later to be pieces of the puzzle that led to your ultimate dream. But this is how you know you&amp;#39;re on your way... Ask yourself: What things make me feel: Excited, passionate, adventurous, connected, and contributing to others? Write down the things that make you feel the emotions I&amp;#39;ve listed, and start doing more of them.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Start building a loving relationship with yourself. Congratulate yourself on your successes. Give yourself rest when needed. Know that you are loved and you have love to give other people. The more you love and accept yourself, the closer you&amp;#39;ll be to attracting someone who loves and accepts themself, a reflection of the new you... which is your ideal life partner, not the people you&amp;#39;ll attract now, which will currently be a reflection of your currently insecure and worrying self.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If you feel like you don&amp;#39;t fit in and don&amp;#39;t have many friends that you really feel resonate with your heart, then it may be because you are destined for greatness and don&amp;#39;t want to settle for the same mundane emotions and experiences that other people do. This is the burden of a highly intelligent person destined for greatness. They often have to travel a part of the road that is lonely. Use this time to work on your dreams and visions and goals, and doing the things that make you feel alive.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Create a list of positive affirmations to read to yourself every morning that resonate with you. &amp;quot;I am loved&amp;quot; &amp;quot;Today is another opportunity to take steps to realise my goals&amp;quot;. Make them ring with gratitude. Write down things every day that you are grateful for.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Peace and love bro&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcr98v", "score_hidden": false, "stickied": false, "created": 1492414344.0, "created_utc": 1492385544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgc8zsu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ul2017", "parent_id": "t1_dgc86ex", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "one thing that helped me out was just being as honest as possible no matter how brutal. if I see something or something pops in my head i just say it, people always find the truth fascinating and it always sparks great conversation ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;one thing that helped me out was just being as honest as possible no matter how brutal. if I see something or something pops in my head i just say it, people always find the truth fascinating and it always sparks great conversation &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc8zsu", "score_hidden": false, "stickied": false, "created": 1492390153.0, "created_utc": 1492361353.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc86ex", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Schimmen", "parent_id": "t1_dgc6vde", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Thanks, I appreciate it. Actually worked on some of that childhood stuff during therapy last year, even though I didn't have any of those \"typical high profile childhood traumas\".\n\nA great deal for me right now is simply learning to socialize again. It's all in me, I just don't have the routine anymore. If you don't use it, you lose it. Scary how that's true for even the act of speaking. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I appreciate it. Actually worked on some of that childhood stuff during therapy last year, even though I didn&amp;#39;t have any of those &amp;quot;typical high profile childhood traumas&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;A great deal for me right now is simply learning to socialize again. It&amp;#39;s all in me, I just don&amp;#39;t have the routine anymore. If you don&amp;#39;t use it, you lose it. Scary how that&amp;#39;s true for even the act of speaking. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc86ex", "score_hidden": false, "stickied": false, "created": 1492389077.0, "created_utc": 1492360277.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6vde", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ul2017", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "flatlines expose your issues. id explore the emotions that come up when these situations arise. a good one to follow is something called the completion process by a woman named teal swan. look it up, it's very simple yet quite powerful. basically what you have is a mild case of ptsd from a childhood trauma that you haven't resolved yet ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;flatlines expose your issues. id explore the emotions that come up when these situations arise. a good one to follow is something called the completion process by a woman named teal swan. look it up, it&amp;#39;s very simple yet quite powerful. basically what you have is a mild case of ptsd from a childhood trauma that you haven&amp;#39;t resolved yet &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc6vde", "score_hidden": false, "stickied": false, "created": 1492387322.0, "created_utc": 1492358522.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgc8b74", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "zphyer6", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "It sounds like your doing fine.  Your just in a period of your life where social situations are more frequent and there draining you.  If your an introvert it's natural that these social situations will leave you feeling drained.  As you get accustomed to them your social anxiety should improve though.  \n\nAs for your wanting to please people, maybe that's just part of your personality.  You shouldn't be a door mat of course but some people just naturally favor social consensus.  No reason to beat yourself up.  Whatever you do just don't try and self medicate by slipping back into PMO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like your doing fine.  Your just in a period of your life where social situations are more frequent and there draining you.  If your an introvert it&amp;#39;s natural that these social situations will leave you feeling drained.  As you get accustomed to them your social anxiety should improve though.  &lt;/p&gt;\n\n&lt;p&gt;As for your wanting to please people, maybe that&amp;#39;s just part of your personality.  You shouldn&amp;#39;t be a door mat of course but some people just naturally favor social consensus.  No reason to beat yourself up.  Whatever you do just don&amp;#39;t try and self medicate by slipping back into PMO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc8b74", "score_hidden": false, "stickied": false, "created": 1492389258.0, "created_utc": 1492360458.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgcju5q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Schimmen", "parent_id": "t1_dgc9u7v", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I was just commenting on another guys reply, but I think we really gotta put things into perspective. \n\n200 days sounds incredible. But it's nothing. I've been roughly PMOing for 10 years.  The amount of days I've been abstaining now merely makes up 6,8% of the time I had been using. Get the idea? That's nothing. Brains are plastic. But they're not gum. It takes a while. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was just commenting on another guys reply, but I think we really gotta put things into perspective. &lt;/p&gt;\n\n&lt;p&gt;200 days sounds incredible. But it&amp;#39;s nothing. I&amp;#39;ve been roughly PMOing for 10 years.  The amount of days I&amp;#39;ve been abstaining now merely makes up 6,8% of the time I had been using. Get the idea? That&amp;#39;s nothing. Brains are plastic. But they&amp;#39;re not gum. It takes a while. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcju5q", "score_hidden": false, "stickied": false, "created": 1492404388.0, "created_utc": 1492375588.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9u7v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "morthond", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I'm exactly the same way, even down to being extremely outgoing and sociable until I was about 14.  My longest streak was 200 days, but I didn't notice any improvement in my social anxiety either.", "edited": 1492364393.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m exactly the same way, even down to being extremely outgoing and sociable until I was about 14.  My longest streak was 200 days, but I didn&amp;#39;t notice any improvement in my social anxiety either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc9u7v", "score_hidden": false, "stickied": false, "created": 1492391225.0, "created_utc": 1492362425.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgcm35l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nomorefap111", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Honestly, I think if you abstain from PMO or MO that doesn't make you invincible to anxiety or other problems. If PMO is the cause it will be eliminated but if you're free of it and you develop it later you need to pay attention to what's going on in your life :).\nNoFAP is not a cure-all thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, I think if you abstain from PMO or MO that doesn&amp;#39;t make you invincible to anxiety or other problems. If PMO is the cause it will be eliminated but if you&amp;#39;re free of it and you develop it later you need to pay attention to what&amp;#39;s going on in your life :).\nNoFAP is not a cure-all thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcm35l", "score_hidden": false, "stickied": false, "created": 1492407330.0, "created_utc": 1492378530.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgcnr4q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "drannigan", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Make yourself vulnerable. Express the way you feel about yourself, your awkwardness, freezing up etc. It will be painful but just be plain and honest about who you are and what you're feeling. You don't have to do it in a room full of people. Just reveal little bits of truth about yourself here and there to relieve your soul. Also don't unpack all your emotional baggage onto one person all at once, that's unfair on them. The more vulnerability(honesty) you show the better response you will get from people and the interactions will become warmer and smoother.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make yourself vulnerable. Express the way you feel about yourself, your awkwardness, freezing up etc. It will be painful but just be plain and honest about who you are and what you&amp;#39;re feeling. You don&amp;#39;t have to do it in a room full of people. Just reveal little bits of truth about yourself here and there to relieve your soul. Also don&amp;#39;t unpack all your emotional baggage onto one person all at once, that&amp;#39;s unfair on them. The more vulnerability(honesty) you show the better response you will get from people and the interactions will become warmer and smoother.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcnr4q", "score_hidden": false, "stickied": false, "created": 1492409520.0, "created_utc": 1492380720.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgcxvya", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "InRepairman", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Congrats on your success. Nofap is no easy journey. Quitting a sever PMO addiction has been compared to quitting cocaine by Psychologists. Now that i praised you a bit i want to get to the brutal truth about you. I read your entire post. Based on that it seems to me you are in the process of transitioning from a beta male to a much desired alpha male persona. That is difficult but can be achieved over time. You are afraid of rejection from all around you because YOU care/think wayyyy too much about what others think of you or how they interpret what your doing. Anxiety is the bodies way of telling you your some wheres you should not be. Still there ? good. You seem to think to much which can be a problem. You create your reality. So if your thinking all the time about what you should or shouldn't be doing to please others your creating a reality of being of service to please others....and not yourself. Thats why your most likely anxious all the time. The depression most likely comes from your lack of progress with the social desires. You want to improve your social skills ? stop caring and be authentic. Be confident in yourself. Dont let other walk all over you. Read books about personal development and social development if you want. It will help. You need to come to a place with in your self where you value your self to the highest degree. To the point when your in a group and take assertive action. Laugh at jokes when they are funny and not laugh when they arnt. Girls like someone if true to themselves. You want to be an alpha. Your posts says it all. \n\ni love life. We have the power to change ourselves and others. Peace and love brother. Your doing a great job.\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congrats on your success. Nofap is no easy journey. Quitting a sever PMO addiction has been compared to quitting cocaine by Psychologists. Now that i praised you a bit i want to get to the brutal truth about you. I read your entire post. Based on that it seems to me you are in the process of transitioning from a beta male to a much desired alpha male persona. That is difficult but can be achieved over time. You are afraid of rejection from all around you because YOU care/think wayyyy too much about what others think of you or how they interpret what your doing. Anxiety is the bodies way of telling you your some wheres you should not be. Still there ? good. You seem to think to much which can be a problem. You create your reality. So if your thinking all the time about what you should or shouldn&amp;#39;t be doing to please others your creating a reality of being of service to please others....and not yourself. Thats why your most likely anxious all the time. The depression most likely comes from your lack of progress with the social desires. You want to improve your social skills ? stop caring and be authentic. Be confident in yourself. Dont let other walk all over you. Read books about personal development and social development if you want. It will help. You need to come to a place with in your self where you value your self to the highest degree. To the point when your in a group and take assertive action. Laugh at jokes when they are funny and not laugh when they arnt. Girls like someone if true to themselves. You want to be an alpha. Your posts says it all. &lt;/p&gt;\n\n&lt;p&gt;i love life. We have the power to change ourselves and others. Peace and love brother. Your doing a great job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcxvya", "score_hidden": false, "stickied": false, "created": 1492423214.0, "created_utc": 1492394414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgd749u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "asker89", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I hate to be a wet blanket, but after almost 1.5 years in I've come to understand something this subreddit probably doesn't want to hear: it's not that big a deal. A lifestyle change can only go so far. \n\nOP, this has nothing to do with NoFap. It sounds like you're developing anxiety after a major environment change. These things can develop out of the blue even if you didn't have it in childhood. I knew someone who developed severe anxiety in a similar situation. The pressures of law school or any other professional program are intense, as I'm sure you're aware. It sounds like you're very well to do and so I'd guess you set high expectations for yourself. This sort of high-pressure high-stress situation can induce the manifestation of latent anxiety. It could be that there is something happening in the back of your head in response to the new stress of starting law school, just waiting to break through as a panic attack or full-blown problematic anxiety. It's actually not an uncommon story. You should consult with a primary care provider and look into establishing with a therapist. You have to nip this in the bud before it becomes a real problem. ", "edited": 1492409916.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hate to be a wet blanket, but after almost 1.5 years in I&amp;#39;ve come to understand something this subreddit probably doesn&amp;#39;t want to hear: it&amp;#39;s not that big a deal. A lifestyle change can only go so far. &lt;/p&gt;\n\n&lt;p&gt;OP, this has nothing to do with NoFap. It sounds like you&amp;#39;re developing anxiety after a major environment change. These things can develop out of the blue even if you didn&amp;#39;t have it in childhood. I knew someone who developed severe anxiety in a similar situation. The pressures of law school or any other professional program are intense, as I&amp;#39;m sure you&amp;#39;re aware. It sounds like you&amp;#39;re very well to do and so I&amp;#39;d guess you set high expectations for yourself. This sort of high-pressure high-stress situation can induce the manifestation of latent anxiety. It could be that there is something happening in the back of your head in response to the new stress of starting law school, just waiting to break through as a panic attack or full-blown problematic anxiety. It&amp;#39;s actually not an uncommon story. You should consult with a primary care provider and look into establishing with a therapist. You have to nip this in the bud before it becomes a real problem. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgd749u", "score_hidden": false, "stickied": false, "created": 1492438516.0, "created_utc": 1492409716.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgcf5qz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "egzistiranjeuprostor", "parent_id": "t1_dgc7u1b", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "That´s telling me than you will be you old self when your flatline passes. I feel the sam way dude. Been flatlining for almost a month but won´t go back to porn. It´s an evil thing and i´m better without it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That´s telling me than you will be you old self when your flatline passes. I feel the sam way dude. Been flatlining for almost a month but won´t go back to porn. It´s an evil thing and i´m better without it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcf5qz", "score_hidden": false, "stickied": false, "created": 1492398310.0, "created_utc": 1492369510.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgclyjk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pompeufabra", "parent_id": "t1_dgcjirf", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Well it seems a distant past now. But I used to watch porn 2-3 times a day. I had a lot of fetishes and was such a creep. My favourite was incestual scenarios. I played videogames a lot too in my teens until I was 22.\n\nI've made a lot of progress and it's some times difficult to realize it. I'm sure you have made a lot of progress too in the social anxiety department but because you are going trough a low phase right now you don't realize it. Or maybe you have improved but you expected to change from bad to good at once and now you are facing the states in between? I also tend to write my posts in my lowest moments and then after a week I'm like \"and what was the problem?\". \n\nI was pretty much incapable of feeling or showing love. This has radically changed now.\n\nI couldnt speak with a woman without feeling like a creep. Now I've several female friends and I feel natural and playful with them.\n\nAnd my self respect is WAY higher.\n\nBut it is not black and white. I still face some issues. The progress is more subtle than I expected. It is not clear where nofap results start or end, but it's so clear to me that Nofap is crucial. So even if I said that maybe nofap has provided all that it could, I have 0 intentions of going back. \n\nAs you said, we were abusing porn for a really long time, and we didn't go fully awkward and socially inept in one day. It was a progression. Probably things will keep improving for both of us, even if sometimes it seems we haven't moved an inch and we feel we are facing the same issues and that we are doomed to be this way forever; we have to keep it rational and realise that we are not clear headed and having a bad day/week.\n\nBut I think you are expecting a radical change felt in one day (\"reaching the other side\"). I don't think this is likely to happen. It will be more like a slow climb with sporadic rewards, like maybe one day you find yourself telling a joke confidently and make people laugh, or things like that that suprise you.            ", "edited": 1492380383.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well it seems a distant past now. But I used to watch porn 2-3 times a day. I had a lot of fetishes and was such a creep. My favourite was incestual scenarios. I played videogames a lot too in my teens until I was 22.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve made a lot of progress and it&amp;#39;s some times difficult to realize it. I&amp;#39;m sure you have made a lot of progress too in the social anxiety department but because you are going trough a low phase right now you don&amp;#39;t realize it. Or maybe you have improved but you expected to change from bad to good at once and now you are facing the states in between? I also tend to write my posts in my lowest moments and then after a week I&amp;#39;m like &amp;quot;and what was the problem?&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I was pretty much incapable of feeling or showing love. This has radically changed now.&lt;/p&gt;\n\n&lt;p&gt;I couldnt speak with a woman without feeling like a creep. Now I&amp;#39;ve several female friends and I feel natural and playful with them.&lt;/p&gt;\n\n&lt;p&gt;And my self respect is WAY higher.&lt;/p&gt;\n\n&lt;p&gt;But it is not black and white. I still face some issues. The progress is more subtle than I expected. It is not clear where nofap results start or end, but it&amp;#39;s so clear to me that Nofap is crucial. So even if I said that maybe nofap has provided all that it could, I have 0 intentions of going back. &lt;/p&gt;\n\n&lt;p&gt;As you said, we were abusing porn for a really long time, and we didn&amp;#39;t go fully awkward and socially inept in one day. It was a progression. Probably things will keep improving for both of us, even if sometimes it seems we haven&amp;#39;t moved an inch and we feel we are facing the same issues and that we are doomed to be this way forever; we have to keep it rational and realise that we are not clear headed and having a bad day/week.&lt;/p&gt;\n\n&lt;p&gt;But I think you are expecting a radical change felt in one day (&amp;quot;reaching the other side&amp;quot;). I don&amp;#39;t think this is likely to happen. It will be more like a slow climb with sporadic rewards, like maybe one day you find yourself telling a joke confidently and make people laugh, or things like that that suprise you.            &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgclyjk", "score_hidden": false, "stickied": false, "created": 1492407159.0, "created_utc": 1492378359.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjirf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Schimmen", "parent_id": "t1_dgchsqs", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "My T is fine. All my other medical parameters are fine. \n\nMan, sounds like we're in pretty similar situations. Also regarding age. Did you escalate pretty hard? If you consider yourself somewhat of a severe case of PMO addiction, you shouldn't lose hope! I mean, none of us should just be sitting on our asses, waiting for day X to come around and challenged life and personality over night for the better. Even the day you come out of the Flatline and feel tons better, it's still gonna take your will to take advantage of your new self. \n\nI think you might, just like me, be very close to the other side. 236 days seems like a lot. But you've got to put it into perspective to the time you'd been using. For real. That'll give you a whole new perspective.  Don't quit. \n\nFor sure you have to continue on improving yourself every single day, no matter if you're in a Flatline or doing perfectly fine. \nGood luck to you! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My T is fine. All my other medical parameters are fine. &lt;/p&gt;\n\n&lt;p&gt;Man, sounds like we&amp;#39;re in pretty similar situations. Also regarding age. Did you escalate pretty hard? If you consider yourself somewhat of a severe case of PMO addiction, you shouldn&amp;#39;t lose hope! I mean, none of us should just be sitting on our asses, waiting for day X to come around and challenged life and personality over night for the better. Even the day you come out of the Flatline and feel tons better, it&amp;#39;s still gonna take your will to take advantage of your new self. &lt;/p&gt;\n\n&lt;p&gt;I think you might, just like me, be very close to the other side. 236 days seems like a lot. But you&amp;#39;ve got to put it into perspective to the time you&amp;#39;d been using. For real. That&amp;#39;ll give you a whole new perspective.  Don&amp;#39;t quit. &lt;/p&gt;\n\n&lt;p&gt;For sure you have to continue on improving yourself every single day, no matter if you&amp;#39;re in a Flatline or doing perfectly fine. \nGood luck to you! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcjirf", "score_hidden": false, "stickied": false, "created": 1492403982.0, "created_utc": 1492375182.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchsqs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgc7u1b", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "[deleted]", "edited": 1492373322.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgchsqs", "score_hidden": false, "stickied": false, "created": 1492401763.0, "created_utc": 1492372963.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7u1b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Schimmen", "parent_id": "t1_dgc5fgw", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I used to be pretty much the opposite of a socially awkward person. Before puberty I was one of the happiest and most social kids growing up. After hitting puberty at age 11 I was confident, the center of my friends group and kinda the guy that gets along with anybody (not in the chameleon way though), even with ppl with no common ground. \nSo this makes it even harder, cause the longer I abstain and the longer the Flatline persists, the more the start to doubt whether porn has fucked up my extroverted, not-giving-a-fuck-about-people's-approval personality for good. \n\nBut I guess at the same time I should be sure to return to being the \"happy social kid\" I used to be. It's just a matter of time now. \n\n\nTrust me, I won't go back to old habits. Even if you were to tell me right now that I'm never gonna get out of my Flatline and that this is gonna be who I am for the rest of my life, I'd still not go back, simply for the sake of not supporting the porn industry any longer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to be pretty much the opposite of a socially awkward person. Before puberty I was one of the happiest and most social kids growing up. After hitting puberty at age 11 I was confident, the center of my friends group and kinda the guy that gets along with anybody (not in the chameleon way though), even with ppl with no common ground. \nSo this makes it even harder, cause the longer I abstain and the longer the Flatline persists, the more the start to doubt whether porn has fucked up my extroverted, not-giving-a-fuck-about-people&amp;#39;s-approval personality for good. &lt;/p&gt;\n\n&lt;p&gt;But I guess at the same time I should be sure to return to being the &amp;quot;happy social kid&amp;quot; I used to be. It&amp;#39;s just a matter of time now. &lt;/p&gt;\n\n&lt;p&gt;Trust me, I won&amp;#39;t go back to old habits. Even if you were to tell me right now that I&amp;#39;m never gonna get out of my Flatline and that this is gonna be who I am for the rest of my life, I&amp;#39;d still not go back, simply for the sake of not supporting the porn industry any longer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc7u1b", "score_hidden": false, "stickied": false, "created": 1492388623.0, "created_utc": 1492359823.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc5fgw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "egzistiranjeuprostor", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Were you always socially awkward or is this something that comes and goes? I can´t say it it´s the flatline or not but there are cases of people that needed anywhere from 2-24 months to recover completely. It all depends how much you were using pmo and from my experience the reboot process is affected by other addictions you had. \n\nWhats important is that you won´t go back to your old habits which means that you are able to change everything about yourself even social anxiety. I may take much time and practice but it will be worth it in the end. Good luck dude hope you get better soon!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Were you always socially awkward or is this something that comes and goes? I can´t say it it´s the flatline or not but there are cases of people that needed anywhere from 2-24 months to recover completely. It all depends how much you were using pmo and from my experience the reboot process is affected by other addictions you had. &lt;/p&gt;\n\n&lt;p&gt;Whats important is that you won´t go back to your old habits which means that you are able to change everything about yourself even social anxiety. I may take much time and practice but it will be worth it in the end. Good luck dude hope you get better soon!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc5fgw", "score_hidden": false, "stickied": false, "created": 1492385360.0, "created_utc": 1492356560.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgc66og", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Superhiccas", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Has there been a time in your life when you havent been socially akward?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Has there been a time in your life when you havent been socially akward?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc66og", "score_hidden": false, "stickied": false, "created": 1492386397.0, "created_utc": 1492357597.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgckdj4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Schimmen", "parent_id": "t1_dgchy23", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "There's definitely some truth to that. \n\nEven though Jesus and god are not my cup of tea, I've got to find that \"ground\" again. That base. \n\nStand for nothing, fall for anything. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s definitely some truth to that. &lt;/p&gt;\n\n&lt;p&gt;Even though Jesus and god are not my cup of tea, I&amp;#39;ve got to find that &amp;quot;ground&amp;quot; again. That base. &lt;/p&gt;\n\n&lt;p&gt;Stand for nothing, fall for anything. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgckdj4", "score_hidden": false, "stickied": false, "created": 1492405084.0, "created_utc": 1492376284.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchy23", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bodymindsoul", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "The saying goes stand for nothing fall for anything. If you don't have a base you resort back to that trumps all, you're bound to have the desire to conform. It's a simple truth. For me personally my relationship with God comes before all, especially before my ever changing emotion in this ever changing world. You need a base, the world should not define you. \n\nThis is my 2cents. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The saying goes stand for nothing fall for anything. If you don&amp;#39;t have a base you resort back to that trumps all, you&amp;#39;re bound to have the desire to conform. It&amp;#39;s a simple truth. For me personally my relationship with God comes before all, especially before my ever changing emotion in this ever changing world. You need a base, the world should not define you. &lt;/p&gt;\n\n&lt;p&gt;This is my 2cents. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgchy23", "score_hidden": false, "stickied": false, "created": 1492401952.0, "created_utc": 1492373152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgck10o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Schimmen", "parent_id": "t1_dgcje9l", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Thanks for the input. I've actually thought about that myself. What mainly keeps me from doing it is the fact that I hate smoking (in general). But I might just be able to do it for medical reasons. Haha. \nSeriously though, I've been planning on giving that a try.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the input. I&amp;#39;ve actually thought about that myself. What mainly keeps me from doing it is the fact that I hate smoking (in general). But I might just be able to do it for medical reasons. Haha. \nSeriously though, I&amp;#39;ve been planning on giving that a try.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgck10o", "score_hidden": false, "stickied": false, "created": 1492404631.0, "created_utc": 1492375831.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcje9l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Theremedy87", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Your story sounds a bit similar to mine in the sense that I doubt myself all the time and constantly live inside my head when talking to others.\n\n I don't know how you feel about this but pot does help a lot with this. After I smoke a bit i feel completely relaxed and I don't worry about who or what I'm talking to and the conversations just kinda flow. I feel like I can really be myself. \n\nIt's something to think about, but some people are completely opposed to the idea and I understand that. Something to think about ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your story sounds a bit similar to mine in the sense that I doubt myself all the time and constantly live inside my head when talking to others.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how you feel about this but pot does help a lot with this. After I smoke a bit i feel completely relaxed and I don&amp;#39;t worry about who or what I&amp;#39;m talking to and the conversations just kinda flow. I feel like I can really be myself. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s something to think about, but some people are completely opposed to the idea and I understand that. Something to think about &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcje9l", "score_hidden": false, "stickied": false, "created": 1492403820.0, "created_utc": 1492375020.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgcjkc0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pompeufabra", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Ive been doing nofap since july 2015. Maybe ive relapsed 5 times since the start. I once went 236 hardmode and relapsed to MO. Im 24 and I have had the same experience of being an outgoing and socially established kid and then sometime after puberty I went awkward and socially anxious.\n\nI have stopped thinking that Nofap will bring any more to the table by now. It has provided me a lot of freedom and clarity. Im more social and Im much more aware of where I need to work on. But I'm still kind of socially awkward in a lot of situations. And I'm still unconfident in many ways.\n\nThere's always the slight hope that someday something in my brain will click and my character will change consistently (I've days where I feel quite confident and I like who I am, but they come and go). But for the most part I dropped expectations regarding nofap. Now I think any improvement will come from the mental fight against myself. We need to gain confidence by fighting against our demons. Discipline and working on your goals is the way forward.\n\nAlso, last time I checked, testosterone was pretty low, I will check again soon. This might be the issue.\n\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ive been doing nofap since july 2015. Maybe ive relapsed 5 times since the start. I once went 236 hardmode and relapsed to MO. Im 24 and I have had the same experience of being an outgoing and socially established kid and then sometime after puberty I went awkward and socially anxious.&lt;/p&gt;\n\n&lt;p&gt;I have stopped thinking that Nofap will bring any more to the table by now. It has provided me a lot of freedom and clarity. Im more social and Im much more aware of where I need to work on. But I&amp;#39;m still kind of socially awkward in a lot of situations. And I&amp;#39;m still unconfident in many ways.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s always the slight hope that someday something in my brain will click and my character will change consistently (I&amp;#39;ve days where I feel quite confident and I like who I am, but they come and go). But for the most part I dropped expectations regarding nofap. Now I think any improvement will come from the mental fight against myself. We need to gain confidence by fighting against our demons. Discipline and working on your goals is the way forward.&lt;/p&gt;\n\n&lt;p&gt;Also, last time I checked, testosterone was pretty low, I will check again soon. This might be the issue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcjkc0", "score_hidden": false, "stickied": false, "created": 1492404042.0, "created_utc": 1492375242.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgckrei", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Schimmen", "parent_id": "t1_dgcko75", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Lifting is a breeze. \nMeditation is a bitch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lifting is a breeze. \nMeditation is a bitch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgckrei", "score_hidden": false, "stickied": false, "created": 1492405612.0, "created_utc": 1492376812.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcko75", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "leafytoasty", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "start lifting weights and meditating", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;start lifting weights and meditating&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgcko75", "score_hidden": false, "stickied": false, "created": 1492405491.0, "created_utc": 1492376691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgd9t24", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-TheJewsDidThis", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Do neurofeedback", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do neurofeedback&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgd9t24", "score_hidden": false, "stickied": false, "created": 1492445467.0, "created_utc": 1492416667.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2skrn", "removal_reason": null, "link_id": "t3_65p449", "likes": null, "replies": "", "user_reports": [], "id": "dgc8tdw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoFapMat", "parent_id": "t1_dgc81vb", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Sounds like a classic case of hormones out of whack.  Get your testosterone and vitamin d checked", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like a classic case of hormones out of whack.  Get your testosterone and vitamin d checked&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc8tdw", "score_hidden": false, "stickied": false, "created": 1492389918.0, "created_utc": 1492361118.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc81vb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Schimmen", "parent_id": "t1_dgc6h08", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "I should've clarified in my post, but actually I used to be pretty social growing up (also the initial years starting PMO, at the time the damage hadn't be done just yet). \n\nWhen I'm in social situations my head is full of all kinds of amazing things to say and act. It's just that I can't communicate cause I feel so dull, lethargic and apathetic. \n\nKinda like going out with your friends when you're sick or feeling down. You night not talk much that night, but you're still having a good time cause your friends are entertaining. Plus, they know you're just not feeling quite right that day. \n\nOnly thing is, when I meet new people now and talk to them, they don't know my funny/outgoing/talkative/eloquent side yet. So all they get is this dull expression. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I should&amp;#39;ve clarified in my post, but actually I used to be pretty social growing up (also the initial years starting PMO, at the time the damage hadn&amp;#39;t be done just yet). &lt;/p&gt;\n\n&lt;p&gt;When I&amp;#39;m in social situations my head is full of all kinds of amazing things to say and act. It&amp;#39;s just that I can&amp;#39;t communicate cause I feel so dull, lethargic and apathetic. &lt;/p&gt;\n\n&lt;p&gt;Kinda like going out with your friends when you&amp;#39;re sick or feeling down. You night not talk much that night, but you&amp;#39;re still having a good time cause your friends are entertaining. Plus, they know you&amp;#39;re just not feeling quite right that day. &lt;/p&gt;\n\n&lt;p&gt;Only thing is, when I meet new people now and talk to them, they don&amp;#39;t know my funny/outgoing/talkative/eloquent side yet. So all they get is this dull expression. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc81vb", "score_hidden": false, "stickied": false, "created": 1492388913.0, "created_utc": 1492360113.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6h08", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "NoFapMat", "parent_id": "t3_65p449", "subreddit_name_prefixed": "r/NoFap", "controversiality": 0, "body": "Your issue is that you're a socially awkward fuck who can't talk at all.  Nofap won't fix this aspect.\n\nMy recommendation? Find an activity in which you're forced to interact.  My suggestion? Something like acting classes/drama club.  Fake it until your brain understands the patterns of socialization, then it becomes natural ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your issue is that you&amp;#39;re a socially awkward fuck who can&amp;#39;t talk at all.  Nofap won&amp;#39;t fix this aspect.&lt;/p&gt;\n\n&lt;p&gt;My recommendation? Find an activity in which you&amp;#39;re forced to interact.  My suggestion? Something like acting classes/drama club.  Fake it until your brain understands the patterns of socialization, then it becomes natural &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NoFap", "name": "t1_dgc6h08", "score_hidden": false, "stickied": false, "created": 1492386783.0, "created_utc": 1492357983.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]