[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "rpg", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi! I need some help. I&amp;#39;m a first time Storyteller for the WoD game and I&amp;#39;m trying to figure out everything I might need to put on a fantastic One-shot campaign for my friends. I&amp;#39;ve got 5 people interested and a relatively decent plot (I think) and now I&amp;#39;m just trying to figure out logistics. Thing is, I&amp;#39;ve never played WoD before. And some of the people who have played haven&amp;#39;t played in years or haven&amp;#39;t played either. So this is an experience for all of us and I&amp;#39;m looking for some guidance and advice. Anything you got, I&amp;#39;d love. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi! I need some help. I'm a first time Storyteller for the WoD game and I'm trying to figure out everything I might need to put on a fantastic One-shot campaign for my friends. I've got 5 people interested and a relatively decent plot (I think) and now I'm just trying to figure out logistics. Thing is, I've never played WoD before. And some of the people who have played haven't played in years or haven't played either. So this is an experience for all of us and I'm looking for some guidance and advice. Anything you got, I'd love. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64rdh5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "STEAMPUNKEDGAL", "saved": false, "mod_reports": [], "name": "t3_64rdh5", "subreddit_name_prefixed": "r/rpg", "approved_by": null, "over_18": false, "domain": "self.rpg", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2s", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/rpg/comments/64rdh5/first_time_storytellervampire_the_masquerade/", "num_reports": null, "locked": false, "stickied": false, "created": 1491951931.0, "url": "https://www.reddit.com/r/rpg/comments/64rdh5/first_time_storytellervampire_the_masquerade/", "author_flair_text": "SteampunkedGal", "quarantine": false, "title": "First time Storyteller--Vampire the Masquerade", "created_utc": 1491923131.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": "", "user_reports": [], "id": "dg4ghoo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "STEAMPUNKEDGAL", "parent_id": "t1_dg4fowp", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Thank you!! I'll go check them out now!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!! I&amp;#39;ll go check them out now!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4ghoo", "score_hidden": false, "stickied": false, "created": 1491955176.0, "created_utc": 1491926376.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4fowp", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "elstren", "parent_id": "t3_64rdh5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Okay, so first advice: don't try to railroad your players, it's not that kind of game. Throw them in a precise situation, give them (maybe) an incentive (the usual \"the Prince says go sort out this mess\" for example), and then let them figure out the rest themselves. \n\nApparently not all of your group are familiar with the game... so start low. Give them new vampires, without a lot of power/influence, and explain things in-universe to them (because their characters are new at this too), this way they won't be drowned in the setting. \n\nDon't bother making a lot of detailled NPCs stats (except for the major ones).\n\nAnd finally **be ready to improvise.** \n\n\nAlso check the [White Wolf subreddit](https://www.reddit.com/r/WhiteWolfRPG), you will probably find more experienced players there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, so first advice: don&amp;#39;t try to railroad your players, it&amp;#39;s not that kind of game. Throw them in a precise situation, give them (maybe) an incentive (the usual &amp;quot;the Prince says go sort out this mess&amp;quot; for example), and then let them figure out the rest themselves. &lt;/p&gt;\n\n&lt;p&gt;Apparently not all of your group are familiar with the game... so start low. Give them new vampires, without a lot of power/influence, and explain things in-universe to them (because their characters are new at this too), this way they won&amp;#39;t be drowned in the setting. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t bother making a lot of detailled NPCs stats (except for the major ones).&lt;/p&gt;\n\n&lt;p&gt;And finally &lt;strong&gt;be ready to improvise.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;Also check the &lt;a href=\"https://www.reddit.com/r/WhiteWolfRPG\"&gt;White Wolf subreddit&lt;/a&gt;, you will probably find more experienced players there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4fowp", "score_hidden": false, "stickied": false, "created": 1491954300.0, "created_utc": 1491925500.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": "", "user_reports": [], "id": "dg4lx0b", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SwiftOneSpeaks", "parent_id": "t3_64rdh5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "The other advice here is good, but I'll add my own as well:\n\nWOD is all about a dark, cynical view of the modern world.  Govt is corrupt, inept, or both.  People put themselves first, and are quick to turn their back on problems.  Rules can be used against you but are waved away when they would defend you.  (That latter is a big one - most people, and gamers in particular, tend to act as if no one will break the rules and get away with it.)  The problem you as an ST have is how to portray this without ruining the fun.\n\nI've seen many ST and players, eager to show how cutthroat the world is, that will kill a vampire for most any infraction.  The problem is that such a system quickly devolves into eye-for-an-eye and gang warfare.  You want people (in particular PCs) to feel threatened but not desperate.  So be sure to have a variety of punishments ready that you can assign to PCs if (when) they screw up - punishments that are harsh, but don't keep the PC from being playable.  Having the PCs witness such a punishment given to an NPC is a good way to set the tone without red shirting a PC.\n\nNext up:  Players tend to defer to authority.  New players moreso, and players that learn of harsh punishment (doh!) moreso again.  So if you have a problem, why isn't the Sheriff handling it?  Why would some neonate PCs be dealing with these issues?  Have a reason.  My go-to is that the Prince can't be seen to be worrying about this issue for political reasons, and so the Prince (or his/her people) turn to those that are easy to manipulate, not well connected politically, and easy to call liars if things go bad: the PCs.   There are other ways to do this, just make sure you have a reason that the PCs can't call on their Mentors, Sires, Primogen, or court officers to take care of or guide the PCs too much.\n\nOut of character Logistics:  \n\nFirst, are you making pre-gens, or are the players making characters?  Either way, you need to make sure the characters are compatible.  I.e. they have a reason to stick together and support each other and not walk away the first moment they decide someone in the group is an idiot.  I recommend making pregens rather than having players make characters if you're doing a one-shot.  That gives you more opportunities to...\n\nSecond, you need to make sure the players have sufficient info.  I recommend that along with each pregen, you give them a 1 page summary that is custom to the character:\n\n* How the character was taught the Traditions are.  This _will_ vary.  Ventrue and Brujah will emphasize Hospitality (in different ways), but their views on Progeny tend to be pretty different.  This should get the players on the ideas that rules are more guidelines.\n* How the character feeds.  Vampire is supposed to have a horror aspect, so don't skip over the part where they have to hurt innocent people to live.  Showing a sliding scale here is a good way to show the corrosive effect of the Beast:  \"You normally feed as a 'Sandman' - you sneak into homes using your powers of Obfuscate and feed from the sleeping.  You originally targeted anyone on the Sex Offenders list, but you ended up thinking some of those people were mostly harmless and a lot of other people just haven't gotten caught, so you now feed on anyone you don't like the look of, and in a pinch you know that no one is TRULY innocent\"\n* How the character relates to their Beast.   Is it a source of strength that has to be used in moderation?  Is it a terrible hunger that can only be kept in check but never removed?  Is it a destructive force that the PC is afraid of?  Have they ever killed while in Frenzy?  (Hint: say yes, be it anger, hunger, or fear)  The Beast should be a big deal, so make it explicit, and by providing different viewpoints of the characters on their Beast, you emphasize the \"personal\" part of \"personal horror\"\n* How does the character feel about being a vampire.  Are they sorry for the people they hurt, but are just trying to get by?   Are they embracing the macho feelings of power?  Do they want to shove it in the face of those that mocked them in their mortal days?\n* How does the character feel about their Clan?   Remember that most of their knowledge of their condition and vampiric politics will come from their Clan, mostly their Sire, so everyone will have some bias.  Think of it as a mixer for members of various cults.\n\nThird - have goals for the Clans.  yes, yes, everyone wants to be safe and prosperous, and most Clans would be thrilled to have one of their own take Praxis, but what is the day-to-day like?  If Clan Toreador is unlikely to take the throne, what do they do to gain power and influence?  Do they have any Court positions?  How can they support the Clan?  In your one-shot these goals may not come up directly, but odds are SOME of them will.  Hard to interact with any vampire or mortal institution without running afoul of someone's political goals.\n\nFourth - avoid the urge to make any PC a terribly old vampire.  In fact, I recommend against having many old vampires at all, including NPCs.  The urge is to have a collection of Ancients that have ridiculous powers, but that actually weakens the impact.  Vampires aren't terrible because of their powers, vampires are terrible because they have been cutthroat for DECADES.   If EVER seeing the sun was a threat to your life, if there were hunters that would be thrilled to kill you while you slept, if you had political rivals that would be happy to arrange an \"accident\" for you if they could get away with it, if you need an ID and a bank account and money to do much in life but can't go to the DMV or the bank or keep most jobs, you'd get pretty sophisticated at it pretty quickly.  In real life, if you needed to assault someone and get away with it, it'd be hard, and if you're at all smart you'd do some planning to make sure you get away with it.  As a vampire, you have to do that every couple of days AT A MINIMUM, so, yeah, you've got plans within plans.    Ancient Vampires, however, become harder to relate to.  A vampire embraced in the 1920s?  I've got books and movies that let me feel that time period, and I know people that are 80+ years old, so if I imagine their experience with undiminished vitality and a hard existence, it's at the edge of what I can imagine, but I can picture it.   A vampire since Roman times?  Well, we have books and movies, but aside from sticking \"-us\" on everyone's name, I'm pretty sure these don't really give me a feel for the time period.  And while I know people that are 80 years old, I don't know anyone 200 years old, much less 2000 years old or more, so I can't even begin to conceive of how someone of that experience would act.    You can have scary, powerful, ancient vampires, but make them the clear exception.  Scary, older-than-a-normal-person vampires are more terrifying because we can FEEL how they are beyond us, as opposed to being incomprehensible.\n\nHere's a post I've made before on RPing a WOD Vampire, it may or may not be of interest to you:  https://www.reddit.com/r/WhiteWolfRPG/comments/5006yw/advice_on_roleplaying_a_vampire/d71l6ac/\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The other advice here is good, but I&amp;#39;ll add my own as well:&lt;/p&gt;\n\n&lt;p&gt;WOD is all about a dark, cynical view of the modern world.  Govt is corrupt, inept, or both.  People put themselves first, and are quick to turn their back on problems.  Rules can be used against you but are waved away when they would defend you.  (That latter is a big one - most people, and gamers in particular, tend to act as if no one will break the rules and get away with it.)  The problem you as an ST have is how to portray this without ruining the fun.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen many ST and players, eager to show how cutthroat the world is, that will kill a vampire for most any infraction.  The problem is that such a system quickly devolves into eye-for-an-eye and gang warfare.  You want people (in particular PCs) to feel threatened but not desperate.  So be sure to have a variety of punishments ready that you can assign to PCs if (when) they screw up - punishments that are harsh, but don&amp;#39;t keep the PC from being playable.  Having the PCs witness such a punishment given to an NPC is a good way to set the tone without red shirting a PC.&lt;/p&gt;\n\n&lt;p&gt;Next up:  Players tend to defer to authority.  New players moreso, and players that learn of harsh punishment (doh!) moreso again.  So if you have a problem, why isn&amp;#39;t the Sheriff handling it?  Why would some neonate PCs be dealing with these issues?  Have a reason.  My go-to is that the Prince can&amp;#39;t be seen to be worrying about this issue for political reasons, and so the Prince (or his/her people) turn to those that are easy to manipulate, not well connected politically, and easy to call liars if things go bad: the PCs.   There are other ways to do this, just make sure you have a reason that the PCs can&amp;#39;t call on their Mentors, Sires, Primogen, or court officers to take care of or guide the PCs too much.&lt;/p&gt;\n\n&lt;p&gt;Out of character Logistics:  &lt;/p&gt;\n\n&lt;p&gt;First, are you making pre-gens, or are the players making characters?  Either way, you need to make sure the characters are compatible.  I.e. they have a reason to stick together and support each other and not walk away the first moment they decide someone in the group is an idiot.  I recommend making pregens rather than having players make characters if you&amp;#39;re doing a one-shot.  That gives you more opportunities to...&lt;/p&gt;\n\n&lt;p&gt;Second, you need to make sure the players have sufficient info.  I recommend that along with each pregen, you give them a 1 page summary that is custom to the character:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;How the character was taught the Traditions are.  This &lt;em&gt;will&lt;/em&gt; vary.  Ventrue and Brujah will emphasize Hospitality (in different ways), but their views on Progeny tend to be pretty different.  This should get the players on the ideas that rules are more guidelines.&lt;/li&gt;\n&lt;li&gt;How the character feeds.  Vampire is supposed to have a horror aspect, so don&amp;#39;t skip over the part where they have to hurt innocent people to live.  Showing a sliding scale here is a good way to show the corrosive effect of the Beast:  &amp;quot;You normally feed as a &amp;#39;Sandman&amp;#39; - you sneak into homes using your powers of Obfuscate and feed from the sleeping.  You originally targeted anyone on the Sex Offenders list, but you ended up thinking some of those people were mostly harmless and a lot of other people just haven&amp;#39;t gotten caught, so you now feed on anyone you don&amp;#39;t like the look of, and in a pinch you know that no one is TRULY innocent&amp;quot;&lt;/li&gt;\n&lt;li&gt;How the character relates to their Beast.   Is it a source of strength that has to be used in moderation?  Is it a terrible hunger that can only be kept in check but never removed?  Is it a destructive force that the PC is afraid of?  Have they ever killed while in Frenzy?  (Hint: say yes, be it anger, hunger, or fear)  The Beast should be a big deal, so make it explicit, and by providing different viewpoints of the characters on their Beast, you emphasize the &amp;quot;personal&amp;quot; part of &amp;quot;personal horror&amp;quot;&lt;/li&gt;\n&lt;li&gt;How does the character feel about being a vampire.  Are they sorry for the people they hurt, but are just trying to get by?   Are they embracing the macho feelings of power?  Do they want to shove it in the face of those that mocked them in their mortal days?&lt;/li&gt;\n&lt;li&gt;How does the character feel about their Clan?   Remember that most of their knowledge of their condition and vampiric politics will come from their Clan, mostly their Sire, so everyone will have some bias.  Think of it as a mixer for members of various cults.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Third - have goals for the Clans.  yes, yes, everyone wants to be safe and prosperous, and most Clans would be thrilled to have one of their own take Praxis, but what is the day-to-day like?  If Clan Toreador is unlikely to take the throne, what do they do to gain power and influence?  Do they have any Court positions?  How can they support the Clan?  In your one-shot these goals may not come up directly, but odds are SOME of them will.  Hard to interact with any vampire or mortal institution without running afoul of someone&amp;#39;s political goals.&lt;/p&gt;\n\n&lt;p&gt;Fourth - avoid the urge to make any PC a terribly old vampire.  In fact, I recommend against having many old vampires at all, including NPCs.  The urge is to have a collection of Ancients that have ridiculous powers, but that actually weakens the impact.  Vampires aren&amp;#39;t terrible because of their powers, vampires are terrible because they have been cutthroat for DECADES.   If EVER seeing the sun was a threat to your life, if there were hunters that would be thrilled to kill you while you slept, if you had political rivals that would be happy to arrange an &amp;quot;accident&amp;quot; for you if they could get away with it, if you need an ID and a bank account and money to do much in life but can&amp;#39;t go to the DMV or the bank or keep most jobs, you&amp;#39;d get pretty sophisticated at it pretty quickly.  In real life, if you needed to assault someone and get away with it, it&amp;#39;d be hard, and if you&amp;#39;re at all smart you&amp;#39;d do some planning to make sure you get away with it.  As a vampire, you have to do that every couple of days AT A MINIMUM, so, yeah, you&amp;#39;ve got plans within plans.    Ancient Vampires, however, become harder to relate to.  A vampire embraced in the 1920s?  I&amp;#39;ve got books and movies that let me feel that time period, and I know people that are 80+ years old, so if I imagine their experience with undiminished vitality and a hard existence, it&amp;#39;s at the edge of what I can imagine, but I can picture it.   A vampire since Roman times?  Well, we have books and movies, but aside from sticking &amp;quot;-us&amp;quot; on everyone&amp;#39;s name, I&amp;#39;m pretty sure these don&amp;#39;t really give me a feel for the time period.  And while I know people that are 80 years old, I don&amp;#39;t know anyone 200 years old, much less 2000 years old or more, so I can&amp;#39;t even begin to conceive of how someone of that experience would act.    You can have scary, powerful, ancient vampires, but make them the clear exception.  Scary, older-than-a-normal-person vampires are more terrifying because we can FEEL how they are beyond us, as opposed to being incomprehensible.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a post I&amp;#39;ve made before on RPing a WOD Vampire, it may or may not be of interest to you:  &lt;a href=\"https://www.reddit.com/r/WhiteWolfRPG/comments/5006yw/advice_on_roleplaying_a_vampire/d71l6ac/\"&gt;https://www.reddit.com/r/WhiteWolfRPG/comments/5006yw/advice_on_roleplaying_a_vampire/d71l6ac/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4lx0b", "score_hidden": false, "stickied": false, "created": 1491961105.0, "created_utc": 1491932305.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": "", "user_reports": [], "id": "dg5uh01", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "STEAMPUNKEDGAL", "parent_id": "t1_dg52luf", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "That'd be awesome, thank you! I'm thinking it might be a bad idea to do a one-shot, though, based on all the advice I'm being given. But now I need to rework the idea a little. And at least still go with the idea that everyone has at least written their own Embrace and go with they just got turned. And maybe do their Embrace with them via email or something to give them a little bit of a taste of something before the game starts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;d be awesome, thank you! I&amp;#39;m thinking it might be a bad idea to do a one-shot, though, based on all the advice I&amp;#39;m being given. But now I need to rework the idea a little. And at least still go with the idea that everyone has at least written their own Embrace and go with they just got turned. And maybe do their Embrace with them via email or something to give them a little bit of a taste of something before the game starts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg5uh01", "score_hidden": false, "stickied": false, "created": 1492032095.0, "created_utc": 1492003295.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52luf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cyzyk", "parent_id": "t3_64rdh5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "If it's a one shot, don't overdo setting or character complexity. Run the tropes for characters (the artsy Toreador, the bookish Tremere, the arrogant Ventrue) so your players can spend less time getting into character and more just playing the character.\n\nIf you've never played World of Darkness before, and you want a sample, I could run a little one shot for you online to give you a sense of how it can go. There are many styles, and I'm sure yours would be different than mine, but I know it's handy to have more than zero experience with a game before running it.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it&amp;#39;s a one shot, don&amp;#39;t overdo setting or character complexity. Run the tropes for characters (the artsy Toreador, the bookish Tremere, the arrogant Ventrue) so your players can spend less time getting into character and more just playing the character.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;ve never played World of Darkness before, and you want a sample, I could run a little one shot for you online to give you a sense of how it can go. There are many styles, and I&amp;#39;m sure yours would be different than mine, but I know it&amp;#39;s handy to have more than zero experience with a game before running it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg52luf", "score_hidden": false, "stickied": false, "created": 1491980181.0, "created_utc": 1491951381.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": "", "user_reports": [], "id": "dg58zp3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FireP0ny", "parent_id": "t1_dg4epbh", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Okay, I think if your players don't already know WoD, instead of starting them as powerful ancilla with complex political relationships and numerous powers, consider starting them as mortals. This way they can discover the WoD in character, rather than by reading a bunch of source books or in a long pregame lecture. Maybe the PCs are graduate students on their way to some conference when their van is pushed off the road, after which they fight a brief hopeless combat with a pack of Sabbat. This ends with with them being \"killed\"/embraced. They awake in some warehouse where they are slowly introduced to the terrifying reality of their new situation- and told a twisted version of the mythology about where vampires come from before they are set loose in the city with instructions to assassinate a vampire who- unbeknownst to them- is a defector to the Camarilla. This task is easier and more horrific than they ever could have imagined- they murder this mild mannered looking accountant with all the clumsy horror of first time killers- but when they return to their pack with the severed head, it turns out to be one of their target's ghouls vicissituded to look like him. The PCs are given 'one last chance' to succeed, but in the process are given the chance to defect to the Camarilla themselves. What ultimately happens is up to them. \n\nVampire is often at its best when it combines personal horror with the revelation that whatever you are endeavoring to do is probably part of some larger, more complex web of ancient politics- wheels within wheels. The PCs  are pawns trying to be players in a world that is darkly fantastical, but still just close enough to the real world to make the horror elements unsettling. I think you want your first game to combine horror and realism with at least one really cool wheels-within-wheels reveal. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, I think if your players don&amp;#39;t already know WoD, instead of starting them as powerful ancilla with complex political relationships and numerous powers, consider starting them as mortals. This way they can discover the WoD in character, rather than by reading a bunch of source books or in a long pregame lecture. Maybe the PCs are graduate students on their way to some conference when their van is pushed off the road, after which they fight a brief hopeless combat with a pack of Sabbat. This ends with with them being &amp;quot;killed&amp;quot;/embraced. They awake in some warehouse where they are slowly introduced to the terrifying reality of their new situation- and told a twisted version of the mythology about where vampires come from before they are set loose in the city with instructions to assassinate a vampire who- unbeknownst to them- is a defector to the Camarilla. This task is easier and more horrific than they ever could have imagined- they murder this mild mannered looking accountant with all the clumsy horror of first time killers- but when they return to their pack with the severed head, it turns out to be one of their target&amp;#39;s ghouls vicissituded to look like him. The PCs are given &amp;#39;one last chance&amp;#39; to succeed, but in the process are given the chance to defect to the Camarilla themselves. What ultimately happens is up to them. &lt;/p&gt;\n\n&lt;p&gt;Vampire is often at its best when it combines personal horror with the revelation that whatever you are endeavoring to do is probably part of some larger, more complex web of ancient politics- wheels within wheels. The PCs  are pawns trying to be players in a world that is darkly fantastical, but still just close enough to the real world to make the horror elements unsettling. I think you want your first game to combine horror and realism with at least one really cool wheels-within-wheels reveal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg58zp3", "score_hidden": false, "stickied": false, "created": 1491988679.0, "created_utc": 1491959879.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4epbh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "STEAMPUNKEDGAL", "parent_id": "t1_dg4edmo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I have been considering that it might be a multiple -shot, but I'm really kind of organizing this for people who want to get together one Saturday and blitz from 10a-10p(ish). And if it keeps going then it keeps going, and yay! But I wanted to keep this low key for the people who really aren't able to commit to something steady every week or month. \n\nI'm planning on trying to set up the sheets to about medium level so that way they're not ickle babies. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have been considering that it might be a multiple -shot, but I&amp;#39;m really kind of organizing this for people who want to get together one Saturday and blitz from 10a-10p(ish). And if it keeps going then it keeps going, and yay! But I wanted to keep this low key for the people who really aren&amp;#39;t able to commit to something steady every week or month. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m planning on trying to set up the sheets to about medium level so that way they&amp;#39;re not ickle babies. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4epbh", "score_hidden": false, "stickied": false, "created": 1491953198.0, "created_utc": 1491924398.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4edmo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FireP0ny", "parent_id": "t3_64rdh5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Hi! I would LOVE to help with this. Have you considered opening up the possibility that this will not be a one-off, but the beginning of a campaign? If so, I have al sorts of suggestions. If not, what you do will depend entirely on how much your players can be expected to already know about WoD.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! I would LOVE to help with this. Have you considered opening up the possibility that this will not be a one-off, but the beginning of a campaign? If so, I have al sorts of suggestions. If not, what you do will depend entirely on how much your players can be expected to already know about WoD.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4edmo", "score_hidden": false, "stickied": false, "created": 1491952844.0, "created_utc": 1491924044.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": "", "user_reports": [], "id": "dg4l25h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "STEAMPUNKEDGAL", "parent_id": "t1_dg4j971", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Wow. That's mind blowing. 15 years is dedication! I have a copy of the original book, a pdf of the 20th, and a few other things I've been able to dig up. I was just going over the PDF because it's a little more discrete at work and I can say for sure it has a lot more information packed in!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. That&amp;#39;s mind blowing. 15 years is dedication! I have a copy of the original book, a pdf of the 20th, and a few other things I&amp;#39;ve been able to dig up. I was just going over the PDF because it&amp;#39;s a little more discrete at work and I can say for sure it has a lot more information packed in!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4l25h", "score_hidden": false, "stickied": false, "created": 1491960172.0, "created_utc": 1491931372.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": "", "user_reports": [], "id": "dg4lafe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "johnny_applegoth", "parent_id": "t1_dg4j971", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "The WoD20 book is very comprehensive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The WoD20 book is very comprehensive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4lafe", "score_hidden": false, "stickied": false, "created": 1491960425.0, "created_utc": 1491931625.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4j971", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "johnny_applegoth", "parent_id": "t3_64rdh5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Try not to get caught up in a too realitic setting when you run it.  The world has had vampires and all sorts of other supernatural creatures around to shape it to their whims, for a millennia.  Google maps is fantastic for city references.  I've been playing/running an ongoing campaign for around 15 years, now.  We have become so familiar with the setting and system that we mix all the different genres.  My group prefers the WoD20 incarnation of the system the most.  Don't think that you need to roll the dice all the time, we've run entire sessions without rolling a single die.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try not to get caught up in a too realitic setting when you run it.  The world has had vampires and all sorts of other supernatural creatures around to shape it to their whims, for a millennia.  Google maps is fantastic for city references.  I&amp;#39;ve been playing/running an ongoing campaign for around 15 years, now.  We have become so familiar with the setting and system that we mix all the different genres.  My group prefers the WoD20 incarnation of the system the most.  Don&amp;#39;t think that you need to roll the dice all the time, we&amp;#39;ve run entire sessions without rolling a single die.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4j971", "score_hidden": false, "stickied": false, "created": 1491958200.0, "created_utc": 1491929400.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": "", "user_reports": [], "id": "dg4onuk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tentacle_eyes", "parent_id": "t3_64rdh5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Here are a few thing i always try to incorporate in my games, hopefully they will help you (ive been storytelling WoD since 1st ed. Vampire). \nMake sure your PCs have good flaws, make them roleplay them, use them as hooks. \nEach PC should have an arc which allows them to add to their personal story as the game goes on.  I wouldn't worry too much in a one shot, but in a long campaign for sure. It will help your players to invest in their characters. The more they care about their fictious avatars, the easier they are to manipulate. \nEncourage the group to backstab each other. WoD is a political game of alliances at its heart. Having your players begin to seperate into factions which begin to actively work against each other, can add a lot of depth to the game. I encourage this by sowing misinformation to the players through NPCs as soon as they split into groups to try to deal with a situation. Remember you are a storyteller, not a truth teller. Every single choice you make should be one to tell a better story. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here are a few thing i always try to incorporate in my games, hopefully they will help you (ive been storytelling WoD since 1st ed. Vampire). \nMake sure your PCs have good flaws, make them roleplay them, use them as hooks. \nEach PC should have an arc which allows them to add to their personal story as the game goes on.  I wouldn&amp;#39;t worry too much in a one shot, but in a long campaign for sure. It will help your players to invest in their characters. The more they care about their fictious avatars, the easier they are to manipulate. \nEncourage the group to backstab each other. WoD is a political game of alliances at its heart. Having your players begin to seperate into factions which begin to actively work against each other, can add a lot of depth to the game. I encourage this by sowing misinformation to the players through NPCs as soon as they split into groups to try to deal with a situation. Remember you are a storyteller, not a truth teller. Every single choice you make should be one to tell a better story. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4onuk", "score_hidden": false, "stickied": false, "created": 1491964127.0, "created_utc": 1491935327.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": "", "user_reports": [], "id": "dg4ot6g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IryokuHikari", "parent_id": "t3_64rdh5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I don't really have any experience or advice for WoD, but, I do recommend Happy Jack's RPG podcast's actual play of VtM: \"The Mote of Sin.\" Only one of the players was familiar with WoD, but it's a super entertaining listen. The mechanics don't often come into play, but the GM is great and the players are excellent at complicating the character's lives. It's exactly how I'd want to play a vampire game, and a good example of a lighter, but still engaging, game. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really have any experience or advice for WoD, but, I do recommend Happy Jack&amp;#39;s RPG podcast&amp;#39;s actual play of VtM: &amp;quot;The Mote of Sin.&amp;quot; Only one of the players was familiar with WoD, but it&amp;#39;s a super entertaining listen. The mechanics don&amp;#39;t often come into play, but the GM is great and the players are excellent at complicating the character&amp;#39;s lives. It&amp;#39;s exactly how I&amp;#39;d want to play a vampire game, and a good example of a lighter, but still engaging, game. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4ot6g", "score_hidden": false, "stickied": false, "created": 1491964285.0, "created_utc": 1491935485.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": "", "user_reports": [], "id": "dg5udzy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "STEAMPUNKEDGAL", "parent_id": "t1_dg4qp1o", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Thanks! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg5udzy", "score_hidden": false, "stickied": false, "created": 1492031976.0, "created_utc": 1492003176.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qp1o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hazard_Gaming", "parent_id": "t3_64rdh5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "NPCs.\n\nIn WoD it's all about the things the NPCs want intersecting with the things the players want.\n\nHave something of value in mind, a power vacuum, a new threat, or a valuable item (least good).\n\nThen start by making a stable of NPCs and you'll probably find that if you flesh out their backstories and how they relate to \"the thing\" the plot for the PCs will suddenly become clear.\n\nIt'll also make the story seem richer whenever you meet one of them but even if they never do, this work you put into them will benefit the story in ways you won't appreciate until you are playing.\n\nGood luck. I hope it goes well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;NPCs.&lt;/p&gt;\n\n&lt;p&gt;In WoD it&amp;#39;s all about the things the NPCs want intersecting with the things the players want.&lt;/p&gt;\n\n&lt;p&gt;Have something of value in mind, a power vacuum, a new threat, or a valuable item (least good).&lt;/p&gt;\n\n&lt;p&gt;Then start by making a stable of NPCs and you&amp;#39;ll probably find that if you flesh out their backstories and how they relate to &amp;quot;the thing&amp;quot; the plot for the PCs will suddenly become clear.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;ll also make the story seem richer whenever you meet one of them but even if they never do, this work you put into them will benefit the story in ways you won&amp;#39;t appreciate until you are playing.&lt;/p&gt;\n\n&lt;p&gt;Good luck. I hope it goes well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4qp1o", "score_hidden": false, "stickied": false, "created": 1491966298.0, "created_utc": 1491937498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_64rdh5", "likes": null, "replies": "", "user_reports": [], "id": "dg5va7w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cra2reddit", "parent_id": "t1_dg5ucoa", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Ok, just different terminology than I've seen used before.\n\nA \"one shot\" usually means what you just said - a story played out in a single session (however many hours your sessions are).\n\nA \"campaign\" usually means a string of adventures spread out over multiple sessions.  Each story within having its own plot arc that could last a single session or multiple sessions.\n\nSo when you combined \"one shot\" with \"campaign\" (calling it a \"one shot campaign\") I didn't know what you were trying to describe - a one shot (one session) or a campaign (multiple sessions).  \n\nSorry for the confusion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok, just different terminology than I&amp;#39;ve seen used before.&lt;/p&gt;\n\n&lt;p&gt;A &amp;quot;one shot&amp;quot; usually means what you just said - a story played out in a single session (however many hours your sessions are).&lt;/p&gt;\n\n&lt;p&gt;A &amp;quot;campaign&amp;quot; usually means a string of adventures spread out over multiple sessions.  Each story within having its own plot arc that could last a single session or multiple sessions.&lt;/p&gt;\n\n&lt;p&gt;So when you combined &amp;quot;one shot&amp;quot; with &amp;quot;campaign&amp;quot; (calling it a &amp;quot;one shot campaign&amp;quot;) I didn&amp;#39;t know what you were trying to describe - a one shot (one session) or a campaign (multiple sessions).  &lt;/p&gt;\n\n&lt;p&gt;Sorry for the confusion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg5va7w", "score_hidden": false, "stickied": false, "created": 1492033233.0, "created_utc": 1492004433.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ucoa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "STEAMPUNKEDGAL", "parent_id": "t1_dg4umwh", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "A one-and-done type story. You do it once that day and then you're done. :) I'm thinking that I'm out of my mind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A one-and-done type story. You do it once that day and then you&amp;#39;re done. :) I&amp;#39;m thinking that I&amp;#39;m out of my mind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg5ucoa", "score_hidden": false, "stickied": false, "created": 1492031919.0, "created_utc": 1492003119.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4umwh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cra2reddit", "parent_id": "t3_64rdh5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "What is a one-shot campaign?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is a one-shot campaign?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg4umwh", "score_hidden": false, "stickied": false, "created": 1491970561.0, "created_utc": 1491941761.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]