[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "rpg", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TL;DR: I realized my players and I have certain habits that many modern games apparently don&amp;#39;t expect us to have.  Are my groups off, or is this common?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve recently been reading Urban Shadows (a PbtA game built around the drama of different supernatural types interacting within a city).  I&amp;#39;ve had problems &amp;quot;getting&amp;quot; PbtA in the recent past, and my efforts at Fate are great in one-shots and terrible at anything longer term, so I am trying to carefully read the book cover-to-cover to make sure I don&amp;#39;t assume anything that is incorrect.&lt;/p&gt;\n\n&lt;p&gt;I notice that the examples in the book (which are quite nice), assume players don&amp;#39;t try to flesh out every detail, and assumes that players accept a loss.  &lt;/p&gt;\n\n&lt;p&gt;In contrast, in any of my groups, if someone is trying to do something, they will inevitably add a fair amount of detail.   If there is a check they fail that doesn&amp;#39;t result in immediate disaster, they&amp;#39;ll try to find a way to re-do that check, by putting more at risk or trying to get the same result in a slightly different way.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think any of these behaviors are WRONG, per se, but it makes following some of the conventions from some rules-light games quite difficult.  I then noticed that while the examples I&amp;#39;ve read from these games are pretty good, nothing has talked about the players &lt;em&gt;instincts&lt;/em&gt; vs what the game &lt;em&gt;recommends&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;When I as a GM introduce a game, and don&amp;#39;t make a point of showing how these things will differ from some previous games, then the players never consider changing their styles.  When I as GM don&amp;#39;t know to try to suggest these alternate versions, I don&amp;#39;t do so.   Meaning that we get in a spot where, to meet the expectations of the game, I have to step up the pressure, which influences how the game feels.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Huh?&amp;quot; you say.  &amp;quot;Can I have an example?&amp;quot;  I&amp;#39;ll try, but this is one of those things that I&amp;#39;m passing on just after realizing it, so my example may be poor.  &lt;/p&gt;\n\n&lt;p&gt;Please don&amp;#39;t get hung up on the specific example and instead think of the generic case.&lt;/p&gt;\n\n&lt;p&gt;GM: &amp;quot;You are heading to Greg&amp;#39;s apartment.  The door is open, and you can hear some small noises from inside, like someone is moving a number of things around - furniture, items on a table, something like that&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Players: &amp;quot;We sneak up to the door and take a quick peek in&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;GM: &amp;quot;You see a large white man with a buzz-cut that is distinctly NOT Greg.  His side is to you, he&amp;#39;s pawing through a drawer at the kitchen island.  He doesn&amp;#39;t appear to have noticed you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Player: &amp;quot;I run in and grab him!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(some rolls occur, player fails)&lt;/p&gt;\n\n&lt;p&gt;GM: &amp;quot;He slips aside and dives out the window, wher-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Player: &amp;quot;I &amp;lt;SOMETHING&amp;gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Here we have a case where the player FAILED at the grab.  At this point, I as GM think the most interesting thing to do would be to have the guy escape - possibly followed by PCs, possibly just being someone they can research.  I was okay with them grabbing him, but they failed.   The Players, however, still want to grab him.  Either I let this succeed, or I deny them, but either way pacing has slowed down, and the players aren&amp;#39;t thinking of the scene as changed, they&amp;#39;re still trying to grab him.  If he gets out the window, sprouts wings, and flies away, they will try any number of things to catch him as long as I allow it.  As soon as I deny it, they frown at me for &amp;#39;protecting the NPC&amp;#39;.  (This may be totally in my head - don&amp;#39;t blame the players).&lt;/p&gt;\n\n&lt;p&gt;To cover the other problem, the above is WAY TOO SIMPLE for my players.  They wouldn&amp;#39;t just peek in the door, then go to grapple someone.  They&amp;#39;d establish where the doors and windows are, who is in place to do what, what equipment they have on them and what is in hand.  Someone might try a distraction move that I think is desperate and ridiculous, while someone is trying to grab him in a very specific way so that even &amp;quot;failure&amp;quot; would prevent escape.&lt;/p&gt;\n\n&lt;p&gt;Which means it becomes harder for anyone (them or me) to improvise anything about the scene.  I can&amp;#39;t have someone get out or come in through an adjacent room - because the layout was defined.  No one can pick up an item off the floor/table to use as a weapon or tool - because everything notable was defined.  &lt;/p&gt;\n\n&lt;p&gt;This has been true for all of my groups (so, somewhere between a dozen and 20 people over 25+ years).  Are we just odd, am I just too unwilling to say &amp;#39;no&amp;#39;, of is this a common issue that others have had to learn to back off of as well (assuming one is interested in these more impromptu moments as I am)?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "TL;DR: I realized my players and I have certain habits that many modern games apparently don't expect us to have.  Are my groups off, or is this common?\n\nI've recently been reading Urban Shadows (a PbtA game built around the drama of different supernatural types interacting within a city).  I've had problems \"getting\" PbtA in the recent past, and my efforts at Fate are great in one-shots and terrible at anything longer term, so I am trying to carefully read the book cover-to-cover to make sure I don't assume anything that is incorrect.\n\nI notice that the examples in the book (which are quite nice), assume players don't try to flesh out every detail, and assumes that players accept a loss.  \n\nIn contrast, in any of my groups, if someone is trying to do something, they will inevitably add a fair amount of detail.   If there is a check they fail that doesn't result in immediate disaster, they'll try to find a way to re-do that check, by putting more at risk or trying to get the same result in a slightly different way.\n\nI don't think any of these behaviors are WRONG, per se, but it makes following some of the conventions from some rules-light games quite difficult.  I then noticed that while the examples I've read from these games are pretty good, nothing has talked about the players _instincts_ vs what the game _recommends_. \n\nWhen I as a GM introduce a game, and don't make a point of showing how these things will differ from some previous games, then the players never consider changing their styles.  When I as GM don't know to try to suggest these alternate versions, I don't do so.   Meaning that we get in a spot where, to meet the expectations of the game, I have to step up the pressure, which influences how the game feels.\n\n\"Huh?\" you say.  \"Can I have an example?\"  I'll try, but this is one of those things that I'm passing on just after realizing it, so my example may be poor.  \n\nPlease don't get hung up on the specific example and instead think of the generic case.\n\nGM: \"You are heading to Greg's apartment.  The door is open, and you can hear some small noises from inside, like someone is moving a number of things around - furniture, items on a table, something like that\"\n\nPlayers: \"We sneak up to the door and take a quick peek in\"\n\nGM: \"You see a large white man with a buzz-cut that is distinctly NOT Greg.  His side is to you, he's pawing through a drawer at the kitchen island.  He doesn't appear to have noticed you.\"\n\nPlayer: \"I run in and grab him!\"\n\n(some rolls occur, player fails)\n\nGM: \"He slips aside and dives out the window, wher-\"\n\nPlayer: \"I &lt;SOMETHING&gt;\"\n\nHere we have a case where the player FAILED at the grab.  At this point, I as GM think the most interesting thing to do would be to have the guy escape - possibly followed by PCs, possibly just being someone they can research.  I was okay with them grabbing him, but they failed.   The Players, however, still want to grab him.  Either I let this succeed, or I deny them, but either way pacing has slowed down, and the players aren't thinking of the scene as changed, they're still trying to grab him.  If he gets out the window, sprouts wings, and flies away, they will try any number of things to catch him as long as I allow it.  As soon as I deny it, they frown at me for 'protecting the NPC'.  (This may be totally in my head - don't blame the players).\n\nTo cover the other problem, the above is WAY TOO SIMPLE for my players.  They wouldn't just peek in the door, then go to grapple someone.  They'd establish where the doors and windows are, who is in place to do what, what equipment they have on them and what is in hand.  Someone might try a distraction move that I think is desperate and ridiculous, while someone is trying to grab him in a very specific way so that even \"failure\" would prevent escape.\n\nWhich means it becomes harder for anyone (them or me) to improvise anything about the scene.  I can't have someone get out or come in through an adjacent room - because the layout was defined.  No one can pick up an item off the floor/table to use as a weapon or tool - because everything notable was defined.  \n\nThis has been true for all of my groups (so, somewhere between a dozen and 20 people over 25+ years).  Are we just odd, am I just too unwilling to say 'no', of is this a common issue that others have had to learn to back off of as well (assuming one is interested in these more impromptu moments as I am)?\n\n\n\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6571es", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 25, "report_reasons": null, "author": "SwiftOneSpeaks", "saved": false, "mod_reports": [], "name": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "approved_by": null, "over_18": false, "domain": "self.rpg", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2s", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/rpg/comments/6571es/the_tyranny_of_definition/", "num_reports": null, "locked": false, "stickied": false, "created": 1492134260.0, "url": "https://www.reddit.com/r/rpg/comments/6571es/the_tyranny_of_definition/", "author_flair_text": null, "quarantine": false, "title": "The Tyranny of Definition", "created_utc": 1492105460.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 57, "visited": false, "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg843ys", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Kosine", "parent_id": "t1_dg7z2ar", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Exactly this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg843ys", "score_hidden": false, "stickied": false, "created": 1492141819.0, "created_utc": 1492113019.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dgamw6m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JasonYoakam", "parent_id": "t1_dgaejsz", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "When was the last time you climbed out a window? Also, we are talking about someone running across the room and *then* climbing out the window. One player tries to grab them and he slips away. What are the other players doing? Are they in the room too?\n\nIf the guy was half way out the window already, I would agree with you, though.", "edited": 1492277317.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When was the last time you climbed out a window? Also, we are talking about someone running across the room and &lt;em&gt;then&lt;/em&gt; climbing out the window. One player tries to grab them and he slips away. What are the other players doing? Are they in the room too?&lt;/p&gt;\n\n&lt;p&gt;If the guy was half way out the window already, I would agree with you, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgamw6m", "score_hidden": false, "stickied": false, "created": 1492291393.0, "created_utc": 1492262593.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaejsz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ProsperityInitiative", "parent_id": "t1_dg95trr", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "The example he gave was someone escaping when they failed to grab him.  It's reasonable to determine that this is something that they get one shot at before the baddie goes out a window.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The example he gave was someone escaping when they failed to grab him.  It&amp;#39;s reasonable to determine that this is something that they get one shot at before the baddie goes out a window.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgaejsz", "score_hidden": false, "stickied": false, "created": 1492268408.0, "created_utc": 1492239608.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95trr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JasonYoakam", "parent_id": "t1_dg7z2ar", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Yeah, but it also sounds an awful lot like OP is making hard moves that aren't in following with \"What the Truth Demands.\" The players are reacting to this in an unfavorable way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, but it also sounds an awful lot like OP is making hard moves that aren&amp;#39;t in following with &amp;quot;What the Truth Demands.&amp;quot; The players are reacting to this in an unfavorable way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg95trr", "score_hidden": false, "stickied": false, "created": 1492207288.0, "created_utc": 1492178488.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7z2ar", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "ArsenyKz", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Maybe try explaining to your players what a hard move (in PbtA games) is? Like, “when you fail a roll, I get to make a hard move, which means that I get to describe how stuff goes wrong without you getting an opportunity to prevent it”.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe try explaining to your players what a hard move (in PbtA games) is? Like, “when you fail a roll, I get to make a hard move, which means that I get to describe how stuff goes wrong without you getting an opportunity to prevent it”.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg7z2ar", "score_hidden": false, "stickied": false, "created": 1492136377.0, "created_utc": 1492107577.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg81tpq", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "NullOperative", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; To cover the other problem, the above is WAY TOO SIMPLE for my players. They wouldn't just peek in the door, then go to grapple someone. They'd establish where the doors and windows are, who is in place to do what, what equipment they have on them and what is in hand. Someone might try a distraction move that I think is desperate and ridiculous, while someone is trying to grab him in a very specific way so that even \"failure\" would prevent escape.\n\nI can think of a few ways you might handle this in a PbtA game.\n\n* *\"So what are you trying to do?  Cover all the escape routes to trap him in there, then grab him?  Ok, cool.  I'm not going to draw a map of the place or anything like that -- your characters are experienced military/police/mercenaries/whatever; you're good at this sort of thing.  You get into position.  Who goes in?  Ok, Steve goes in and tries to grab him, he slips away and bolts for the window where Jane kicks through and knocks him to the floor.  Now you have him tied to a chair in the kitchen.  What do you do?\"*  \nIf the planning is going to lead to guaranteed success and the target isn't going to notice them or finish before they're in place, just give it to them and get to the important part -- who is this guy and what does he want from Greg?  How do they find that out?\n\n* *\"So what are you trying to do?  Cover all the escape routes to trap him in there?  Ok, cool.  I'm not going to draw a map of the place or anything like that -- your characters are experienced military/police/mercenaries/whatever; you're good at this sort of thing.  You have all the exits covered.  Now what's your plan?  Go in and attack him?  Confront him and try to get some answers?  He might put up a fight either way.\"*  \nFictional positioning says he can't get away, but nothing's stopping him from fighting back, or destroying something valuable, or getting himself killed before they can find out what he's there for.  But skip past the boring details and say \"you do it\", then bring them to the situation that has consequences.\n\n* *\"So what are you trying to do?  Cover all the escape routes to trap him in there?  Ok, cool.  I'm not going to draw a map of the place or anything like that; you know enough to get the job done.  But he's up to something in there, so whoever is leading the effort is going to have to Act Under Pressure (or whatever the closest move is in the PbtA game you're playing) to get everything into place before he finishes and leaves, forcing your hand.\"*  \nFictional positioning says that, with success, they lay the trap and he can't escape.  With a partial success, he can't escape, but maybe he notices them coming and locks the place down so they can't get to him.  With a failure, they missed a window, or they take too long and he gets out.\n\n* *\"So what are you trying to do?  Cover all the escape routes to trap him in there?  Ok, cool.  This is something you might be doing a few times in the future, so let's introduce a new move, Close the Net.  Whoever is leading the action rolls +Wits; on a success, you cover the exits, get in there, and grab him, but if it's a partial success he gets to make a move before you get him.  On a failure, he escapes.  We'll write down this move for future use; note it on your rules summary sheets.\"*  \nThis is like the above one, but you can create a move for it.  Maybe you make it a choose-X-from-this-list move.  Maybe it's more open than that.\n\n* *\"So what are you trying to do?  Cover all the escape routes to trap him in there?  Well, while you're about to head off to do that, he finds what he's looking for and turns to the door to see it ajar.  He turns toward the window behind him.  What do you do?\"*  \nIn this case, you don't give them time to do all that excessive planning.  The NPCs don't wait for the players to step past the line and trigger the event flag.  They act *now.*\n\nWhich do you use?  Depends on the situation.  But don't feel obligated to map things out and define all the details.  Ask their intention and say \"yeah, ok, you do that\" or \"sorry, there's not enough time\" or \"maybe; let's roll for it\".  Make it about the competence of the characters, not, for instance, the soldier in the group whose characters all inexplicably have the knowledge and equipment to breach a terrorist-held building.", "edited": 1492111198.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;To cover the other problem, the above is WAY TOO SIMPLE for my players. They wouldn&amp;#39;t just peek in the door, then go to grapple someone. They&amp;#39;d establish where the doors and windows are, who is in place to do what, what equipment they have on them and what is in hand. Someone might try a distraction move that I think is desperate and ridiculous, while someone is trying to grab him in a very specific way so that even &amp;quot;failure&amp;quot; would prevent escape.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can think of a few ways you might handle this in a PbtA game.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;&amp;quot;So what are you trying to do?  Cover all the escape routes to trap him in there, then grab him?  Ok, cool.  I&amp;#39;m not going to draw a map of the place or anything like that -- your characters are experienced military/police/mercenaries/whatever; you&amp;#39;re good at this sort of thing.  You get into position.  Who goes in?  Ok, Steve goes in and tries to grab him, he slips away and bolts for the window where Jane kicks through and knocks him to the floor.  Now you have him tied to a chair in the kitchen.  What do you do?&amp;quot;&lt;/em&gt;&lt;br/&gt;\nIf the planning is going to lead to guaranteed success and the target isn&amp;#39;t going to notice them or finish before they&amp;#39;re in place, just give it to them and get to the important part -- who is this guy and what does he want from Greg?  How do they find that out?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;&amp;quot;So what are you trying to do?  Cover all the escape routes to trap him in there?  Ok, cool.  I&amp;#39;m not going to draw a map of the place or anything like that -- your characters are experienced military/police/mercenaries/whatever; you&amp;#39;re good at this sort of thing.  You have all the exits covered.  Now what&amp;#39;s your plan?  Go in and attack him?  Confront him and try to get some answers?  He might put up a fight either way.&amp;quot;&lt;/em&gt;&lt;br/&gt;\nFictional positioning says he can&amp;#39;t get away, but nothing&amp;#39;s stopping him from fighting back, or destroying something valuable, or getting himself killed before they can find out what he&amp;#39;s there for.  But skip past the boring details and say &amp;quot;you do it&amp;quot;, then bring them to the situation that has consequences.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;&amp;quot;So what are you trying to do?  Cover all the escape routes to trap him in there?  Ok, cool.  I&amp;#39;m not going to draw a map of the place or anything like that; you know enough to get the job done.  But he&amp;#39;s up to something in there, so whoever is leading the effort is going to have to Act Under Pressure (or whatever the closest move is in the PbtA game you&amp;#39;re playing) to get everything into place before he finishes and leaves, forcing your hand.&amp;quot;&lt;/em&gt;&lt;br/&gt;\nFictional positioning says that, with success, they lay the trap and he can&amp;#39;t escape.  With a partial success, he can&amp;#39;t escape, but maybe he notices them coming and locks the place down so they can&amp;#39;t get to him.  With a failure, they missed a window, or they take too long and he gets out.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;&amp;quot;So what are you trying to do?  Cover all the escape routes to trap him in there?  Ok, cool.  This is something you might be doing a few times in the future, so let&amp;#39;s introduce a new move, Close the Net.  Whoever is leading the action rolls +Wits; on a success, you cover the exits, get in there, and grab him, but if it&amp;#39;s a partial success he gets to make a move before you get him.  On a failure, he escapes.  We&amp;#39;ll write down this move for future use; note it on your rules summary sheets.&amp;quot;&lt;/em&gt;&lt;br/&gt;\nThis is like the above one, but you can create a move for it.  Maybe you make it a choose-X-from-this-list move.  Maybe it&amp;#39;s more open than that.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;&amp;quot;So what are you trying to do?  Cover all the escape routes to trap him in there?  Well, while you&amp;#39;re about to head off to do that, he finds what he&amp;#39;s looking for and turns to the door to see it ajar.  He turns toward the window behind him.  What do you do?&amp;quot;&lt;/em&gt;&lt;br/&gt;\nIn this case, you don&amp;#39;t give them time to do all that excessive planning.  The NPCs don&amp;#39;t wait for the players to step past the line and trigger the event flag.  They act &lt;em&gt;now.&lt;/em&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Which do you use?  Depends on the situation.  But don&amp;#39;t feel obligated to map things out and define all the details.  Ask their intention and say &amp;quot;yeah, ok, you do that&amp;quot; or &amp;quot;sorry, there&amp;#39;s not enough time&amp;quot; or &amp;quot;maybe; let&amp;#39;s roll for it&amp;quot;.  Make it about the competence of the characters, not, for instance, the soldier in the group whose characters all inexplicably have the knowledge and equipment to breach a terrorist-held building.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg81tpq", "score_hidden": false, "stickied": false, "created": 1492139345.0, "created_utc": 1492110545.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg884qy", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "JasonYoakam", "parent_id": "t1_dg86opf", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Thank you! This is what I came here to say. These are not problem-players, this is easily corrected by following the GM moves.", "edited": 1492117722.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! This is what I came here to say. These are not problem-players, this is easily corrected by following the GM moves.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg884qy", "score_hidden": false, "stickied": false, "created": 1492146320.0, "created_utc": 1492117520.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg8wji8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JustusGS", "parent_id": "t1_dg86opf", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "If you really want this guy to try to escape (which is reasonable, given that it's a thing people tend to do when caught burgling someone's house), then the easiest move to make would probably be \"offer an opportunity *with a cost*.\"\n\n\"He bolts for the window, obviously trying to escape. You can catch him before he gets there, but it would mean...\" and then you can name whatever price you see fit. It would mean dropping your gun, or maybe you see the glint of a knife in his hand and if you get too close he'll probably take a swing at you, or maybe it would mean not being careful enough to see the guy with the gun behind the door, who'll have a clear shot at your back. Then let the players decide if the cost is worth the opportunity you're presenting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you really want this guy to try to escape (which is reasonable, given that it&amp;#39;s a thing people tend to do when caught burgling someone&amp;#39;s house), then the easiest move to make would probably be &amp;quot;offer an opportunity &lt;em&gt;with a cost&lt;/em&gt;.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He bolts for the window, obviously trying to escape. You can catch him before he gets there, but it would mean...&amp;quot; and then you can name whatever price you see fit. It would mean dropping your gun, or maybe you see the glint of a knife in his hand and if you get too close he&amp;#39;ll probably take a swing at you, or maybe it would mean not being careful enough to see the guy with the gun behind the door, who&amp;#39;ll have a clear shot at your back. Then let the players decide if the cost is worth the opportunity you&amp;#39;re presenting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8wji8", "score_hidden": false, "stickied": false, "created": 1492184595.0, "created_utc": 1492155795.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86opf", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "M0dusPwnens", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I don't think that this is actually a problem with the players, I think it's mostly an issue with how to GM PbtA. Which is good! That makes it much more fixable!\n\n(I didn't remember the specific *Urban Shadows* moves when I started writing this, so I'm just going to use generic/*Apocalypse World* names. It should still be pretty clear.)\n\nWhen you get really passive play in a PbtA game, it's because you're not using the GM moves aggressively enough. Remember that you use GM moves when they fail rolls, but *also* when they present you with a golden opportunity or when they look to you to see what happens.\n\nIt's crucial to remember that those are not *opportunities* to use GM moves, they're times when you are *required* to make a GM move. Every single time they look to you to see what happens next, look at the GM moves and make one. That's your job.\n\nIf the PC goes to prison and decides to keep to himself and stay out of trouble, think about all the movies you've seen: how does that usually go? If you try to stay away from trouble, great, but trouble has no such compunctions about staying away from you.\n\n&gt; If there is a check they fail that doesn't result in immediate disaster, they'll try to find a way to re-do that check, by putting more at risk or trying to get the same result in a slightly different way.\n\nThat is 100% in line with PbtA. That's what you *want* the players to do: respond to failure with escalation. But remember, every failure does, in a sense, lead to immediate disaster. Maybe it's not a particularly serious disaster (at least not yet), but you're still making a GM move. If they fail to pick a lock, that doesn't just mean the lock isn't picked, it means you make a GM move - maybe they spring a trap (do damage), maybe an alarm goes off (put them in a spot), maybe they can force the door open just enough that only the two smaller characters can get through (split them up). But *something* (one of the GM moves) happens.\n\nPbtA games don't need rules about how you can't retry failed checks without the circumstances changing because failed checks directly cause the circumstances to change.\n\n&gt;  Here we have a case where the player FAILED at the grab. At this point, I as GM think the most interesting thing to do would be to have the guy escape - possibly followed by PCs, possibly just being someone they can research.\n\nThat isn't how you GM PbtA. You don't just think of the most interesting thing to do, you pick a GM move (which one you pick and what the specifics are is, of course, dependent on the most interesting thing to do).\n\nGlancing at the MC moves for *Urban Shadows*, I can't see how having the guy getting away falls under any of them. This is crucial to understanding PbtA: that means you are not allowed to react to a miss with the guy getting away. GMing PbtA is *not* freeform, anything-goes GMing. You're like a blackjack dealer: the game tells you what moves to make and when (and you have to make the moves - just like the blackjack dealer they aren't optional). You get to pick the move and the specifics and describe the color of it, but otherwise your hands are tied. In practice, this still gives you an enormous amount of freedom, but it is incredibly important. This is what makes the game function. Without it, you end up with problems like the one you're describing.\n\n&gt; If he gets out the window, sprouts wings, and flies away, they will try any number of things to catch him as long as I allow it.\n\nAs well they should. And you should allow it so long as it makes sense. The PCs are pursuing a goal. Blowing a roll to do something doesn't mean that they're not supposed to be able to accomplish their goal, it means that continuing to pursue it comes at a greater cost, or a greater risk, or there's some complication they'll have to overcome.\n\n&gt; As soon as I deny it, they frown at me for 'protecting the NPC'.\n\nAs well they should, unless you're protecting the NPC by making an MC move. But if you look, you'll notice that things like having NPCs escape tends to be hard to do within the MC moves. In most situations, there's no clear way to spin an MC move to allow you to do that. This isn't an accident.\n\nHere's maybe another way to think of it: When the PCs try to do something, one question is \"will they succeed?\". That's one of the things the dice tell you. The other thing, the larger, more general thing, is \"how hard will it be to succeed and what will it cost them?\".\n\nAnd another way: You don't have the authority to say \"he gets away\" in response to a failed roll to capture him. All you can do is put more shit in the way of further attempts to capture him. He gets away if the players either can't think of a way through the new shit that's between them and their goal, or they decide it's not worth it. *That's* when they go do research to figure out where he went or whatever. You don't decide that, they do.\n\n&gt;  They'd establish where the doors and windows are, who is in place to do what, what equipment they have on them and what is in hand.\n\nCool. Nothing wrong with that. Even if they know every single detail about the place, nothing stops you from making a GM move. Knowing the floorplan and guard patrols doesn't prevent a van of guards showing up, or the police inconveniently showing up to investigate an unrelated crime in the building at just the wrong time. GM moves are your license (your *requirement* even) to introduce things like that. A missed roll means that the situation just got more complicated - and not necessarily as a direct result of the character's failure. If a character fails on a roll while picking a lock, maybe that triggers an alarm. But it's just as acceptable for it to mean that the character is in the middle of picking the lock when the janitor (who came in early because his wife kicked him out) comes around the corner and sees them. Unless the characters are literally omniscient, they can't defend against coincidences.\n\n&gt; Someone might try a distraction move that I think is desperate and ridiculous\n\nIf it's \"desperate and ridiculous\" in the sense that it literally doesn't make sense, then they can't do it. You can't \"trade harm\" with someone using a plastic spoon just because you say that's what you want to do. Some things just aren't possible.\n\nIf it's just desperate and ridiculous, then great! If they succeed, it's fun (remember your Principles: you're a fan of the characters). If it's desperate and it fails, hit them with a seriously *hard* MC move.\n\nYou have two other tools here:\n\n1. You should require Keep Your Cool to do anything that involves avoiding danger to accomplish a goal. If a character is running between cover to act as a distraction, first they roll Keep Your Cool to see if there are any problems making it between cover. *Then* they roll Mislead, Distract, or Trick (or maybe Lend a Hand or Get in the Way if that makes more sense in aiding the character they're creating the distraction for). You shouldn't make people roll Keep Your Cool every time, but it's your swiss army knife for creating two possibilities for things to go wrong rather than just one.\n\n2. The third time you are required to make an MC move: when a player hands you a golden opportunity. If two dozen guys have assault rifles trained on someone and that person says they want to run forward creating a distraction, they roll Mislead, Distract, or Trick, but they don't avoid damage just because they rolled high. They succeed at creating a distraction, but by knowingly running into a wall of bullets, they've presented you with a golden opportunity. Use that golden opportunity to choose the \"inflict harm\" MC move. There's no way they're pulling that off without taking a few hits.\n\nOverall, reread the MC chapter and play it to the letter. There are three circumstances in which you can *and must* make an MC move. That's your role in the game: making MC moves. Keep the list of MC moves in front of you at all times until it's second nature.\n\nIf they play passively, respond actively. If they peek in the window and ask you what's there, guess what: \"there’s a lull in the action\". Make an MC move. The thing they see on the other side is two rival gangs arguing (surface a conflict, ancient or modern) or one of their allies bloody and tied to a chair (put someone in danger), or any number of other things.\n\nMake moves. Make moves and color them in. That is your only job. When they ask what's on the other side of the window, you don't just tell them what's on the other side of the window, you make a move (even if it looks to *them* like you're just telling them what's on the other side of the window).\n\nThis relies in part on another crucial element of most PbtA games: you cannot plan ahead. The book tells you how to prep Threats and that's not the minimal amount of prep, it's also the maximal amount of prep. You can't plan out the building and \"encounter\" before the PCs get there because that would mean that when they decide to look in the window, you can't make an MC move because you already know what's there. When the PCs investigate things, it should feel to them like they're uncovering things you've planned, but in actuality their investigation is prompting you to create the details, which is what gives you the room you need to make MC moves in response to their investigation.\n\nDon't plan. Play to find out.", "edited": 1492119051.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think that this is actually a problem with the players, I think it&amp;#39;s mostly an issue with how to GM PbtA. Which is good! That makes it much more fixable!&lt;/p&gt;\n\n&lt;p&gt;(I didn&amp;#39;t remember the specific &lt;em&gt;Urban Shadows&lt;/em&gt; moves when I started writing this, so I&amp;#39;m just going to use generic/&lt;em&gt;Apocalypse World&lt;/em&gt; names. It should still be pretty clear.)&lt;/p&gt;\n\n&lt;p&gt;When you get really passive play in a PbtA game, it&amp;#39;s because you&amp;#39;re not using the GM moves aggressively enough. Remember that you use GM moves when they fail rolls, but &lt;em&gt;also&lt;/em&gt; when they present you with a golden opportunity or when they look to you to see what happens.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s crucial to remember that those are not &lt;em&gt;opportunities&lt;/em&gt; to use GM moves, they&amp;#39;re times when you are &lt;em&gt;required&lt;/em&gt; to make a GM move. Every single time they look to you to see what happens next, look at the GM moves and make one. That&amp;#39;s your job.&lt;/p&gt;\n\n&lt;p&gt;If the PC goes to prison and decides to keep to himself and stay out of trouble, think about all the movies you&amp;#39;ve seen: how does that usually go? If you try to stay away from trouble, great, but trouble has no such compunctions about staying away from you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If there is a check they fail that doesn&amp;#39;t result in immediate disaster, they&amp;#39;ll try to find a way to re-do that check, by putting more at risk or trying to get the same result in a slightly different way.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is 100% in line with PbtA. That&amp;#39;s what you &lt;em&gt;want&lt;/em&gt; the players to do: respond to failure with escalation. But remember, every failure does, in a sense, lead to immediate disaster. Maybe it&amp;#39;s not a particularly serious disaster (at least not yet), but you&amp;#39;re still making a GM move. If they fail to pick a lock, that doesn&amp;#39;t just mean the lock isn&amp;#39;t picked, it means you make a GM move - maybe they spring a trap (do damage), maybe an alarm goes off (put them in a spot), maybe they can force the door open just enough that only the two smaller characters can get through (split them up). But &lt;em&gt;something&lt;/em&gt; (one of the GM moves) happens.&lt;/p&gt;\n\n&lt;p&gt;PbtA games don&amp;#39;t need rules about how you can&amp;#39;t retry failed checks without the circumstances changing because failed checks directly cause the circumstances to change.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Here we have a case where the player FAILED at the grab. At this point, I as GM think the most interesting thing to do would be to have the guy escape - possibly followed by PCs, possibly just being someone they can research.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That isn&amp;#39;t how you GM PbtA. You don&amp;#39;t just think of the most interesting thing to do, you pick a GM move (which one you pick and what the specifics are is, of course, dependent on the most interesting thing to do).&lt;/p&gt;\n\n&lt;p&gt;Glancing at the MC moves for &lt;em&gt;Urban Shadows&lt;/em&gt;, I can&amp;#39;t see how having the guy getting away falls under any of them. This is crucial to understanding PbtA: that means you are not allowed to react to a miss with the guy getting away. GMing PbtA is &lt;em&gt;not&lt;/em&gt; freeform, anything-goes GMing. You&amp;#39;re like a blackjack dealer: the game tells you what moves to make and when (and you have to make the moves - just like the blackjack dealer they aren&amp;#39;t optional). You get to pick the move and the specifics and describe the color of it, but otherwise your hands are tied. In practice, this still gives you an enormous amount of freedom, but it is incredibly important. This is what makes the game function. Without it, you end up with problems like the one you&amp;#39;re describing.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If he gets out the window, sprouts wings, and flies away, they will try any number of things to catch him as long as I allow it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As well they should. And you should allow it so long as it makes sense. The PCs are pursuing a goal. Blowing a roll to do something doesn&amp;#39;t mean that they&amp;#39;re not supposed to be able to accomplish their goal, it means that continuing to pursue it comes at a greater cost, or a greater risk, or there&amp;#39;s some complication they&amp;#39;ll have to overcome.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As soon as I deny it, they frown at me for &amp;#39;protecting the NPC&amp;#39;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As well they should, unless you&amp;#39;re protecting the NPC by making an MC move. But if you look, you&amp;#39;ll notice that things like having NPCs escape tends to be hard to do within the MC moves. In most situations, there&amp;#39;s no clear way to spin an MC move to allow you to do that. This isn&amp;#39;t an accident.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s maybe another way to think of it: When the PCs try to do something, one question is &amp;quot;will they succeed?&amp;quot;. That&amp;#39;s one of the things the dice tell you. The other thing, the larger, more general thing, is &amp;quot;how hard will it be to succeed and what will it cost them?&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;And another way: You don&amp;#39;t have the authority to say &amp;quot;he gets away&amp;quot; in response to a failed roll to capture him. All you can do is put more shit in the way of further attempts to capture him. He gets away if the players either can&amp;#39;t think of a way through the new shit that&amp;#39;s between them and their goal, or they decide it&amp;#39;s not worth it. &lt;em&gt;That&amp;#39;s&lt;/em&gt; when they go do research to figure out where he went or whatever. You don&amp;#39;t decide that, they do.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;They&amp;#39;d establish where the doors and windows are, who is in place to do what, what equipment they have on them and what is in hand.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Cool. Nothing wrong with that. Even if they know every single detail about the place, nothing stops you from making a GM move. Knowing the floorplan and guard patrols doesn&amp;#39;t prevent a van of guards showing up, or the police inconveniently showing up to investigate an unrelated crime in the building at just the wrong time. GM moves are your license (your &lt;em&gt;requirement&lt;/em&gt; even) to introduce things like that. A missed roll means that the situation just got more complicated - and not necessarily as a direct result of the character&amp;#39;s failure. If a character fails on a roll while picking a lock, maybe that triggers an alarm. But it&amp;#39;s just as acceptable for it to mean that the character is in the middle of picking the lock when the janitor (who came in early because his wife kicked him out) comes around the corner and sees them. Unless the characters are literally omniscient, they can&amp;#39;t defend against coincidences.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Someone might try a distraction move that I think is desperate and ridiculous&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If it&amp;#39;s &amp;quot;desperate and ridiculous&amp;quot; in the sense that it literally doesn&amp;#39;t make sense, then they can&amp;#39;t do it. You can&amp;#39;t &amp;quot;trade harm&amp;quot; with someone using a plastic spoon just because you say that&amp;#39;s what you want to do. Some things just aren&amp;#39;t possible.&lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s just desperate and ridiculous, then great! If they succeed, it&amp;#39;s fun (remember your Principles: you&amp;#39;re a fan of the characters). If it&amp;#39;s desperate and it fails, hit them with a seriously &lt;em&gt;hard&lt;/em&gt; MC move.&lt;/p&gt;\n\n&lt;p&gt;You have two other tools here:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;You should require Keep Your Cool to do anything that involves avoiding danger to accomplish a goal. If a character is running between cover to act as a distraction, first they roll Keep Your Cool to see if there are any problems making it between cover. &lt;em&gt;Then&lt;/em&gt; they roll Mislead, Distract, or Trick (or maybe Lend a Hand or Get in the Way if that makes more sense in aiding the character they&amp;#39;re creating the distraction for). You shouldn&amp;#39;t make people roll Keep Your Cool every time, but it&amp;#39;s your swiss army knife for creating two possibilities for things to go wrong rather than just one.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The third time you are required to make an MC move: when a player hands you a golden opportunity. If two dozen guys have assault rifles trained on someone and that person says they want to run forward creating a distraction, they roll Mislead, Distract, or Trick, but they don&amp;#39;t avoid damage just because they rolled high. They succeed at creating a distraction, but by knowingly running into a wall of bullets, they&amp;#39;ve presented you with a golden opportunity. Use that golden opportunity to choose the &amp;quot;inflict harm&amp;quot; MC move. There&amp;#39;s no way they&amp;#39;re pulling that off without taking a few hits.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Overall, reread the MC chapter and play it to the letter. There are three circumstances in which you can &lt;em&gt;and must&lt;/em&gt; make an MC move. That&amp;#39;s your role in the game: making MC moves. Keep the list of MC moves in front of you at all times until it&amp;#39;s second nature.&lt;/p&gt;\n\n&lt;p&gt;If they play passively, respond actively. If they peek in the window and ask you what&amp;#39;s there, guess what: &amp;quot;there’s a lull in the action&amp;quot;. Make an MC move. The thing they see on the other side is two rival gangs arguing (surface a conflict, ancient or modern) or one of their allies bloody and tied to a chair (put someone in danger), or any number of other things.&lt;/p&gt;\n\n&lt;p&gt;Make moves. Make moves and color them in. That is your only job. When they ask what&amp;#39;s on the other side of the window, you don&amp;#39;t just tell them what&amp;#39;s on the other side of the window, you make a move (even if it looks to &lt;em&gt;them&lt;/em&gt; like you&amp;#39;re just telling them what&amp;#39;s on the other side of the window).&lt;/p&gt;\n\n&lt;p&gt;This relies in part on another crucial element of most PbtA games: you cannot plan ahead. The book tells you how to prep Threats and that&amp;#39;s not the minimal amount of prep, it&amp;#39;s also the maximal amount of prep. You can&amp;#39;t plan out the building and &amp;quot;encounter&amp;quot; before the PCs get there because that would mean that when they decide to look in the window, you can&amp;#39;t make an MC move because you already know what&amp;#39;s there. When the PCs investigate things, it should feel to them like they&amp;#39;re uncovering things you&amp;#39;ve planned, but in actuality their investigation is prompting you to create the details, which is what gives you the room you need to make MC moves in response to their investigation.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t plan. Play to find out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg86opf", "score_hidden": false, "stickied": false, "created": 1492144671.0, "created_utc": 1492115871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg94s93", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "anon_adderlan", "parent_id": "t1_dg8cf7a", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; It is okay for them to deal with the failure, but they cannot try that first thing again, the opportunity is gone.\n\nIt's basically \\#LetItRide from the player's point of view. Just like the GM shouldn't force a player to just keep rolling until they fail, a player shouldn't have the opportunity to just keep rolling until they succeed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It is okay for them to deal with the failure, but they cannot try that first thing again, the opportunity is gone.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s basically #LetItRide from the player&amp;#39;s point of view. Just like the GM shouldn&amp;#39;t force a player to just keep rolling until they fail, a player shouldn&amp;#39;t have the opportunity to just keep rolling until they succeed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg94s93", "score_hidden": false, "stickied": false, "created": 1492205773.0, "created_utc": 1492176973.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8cf7a", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Roxfall", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "In PbtA games, all of them, failure HAS to drive the story forward. Fail forward, they call it.\n\nThis means players cannot enter the same river twice, because the failure of the dice has changed the situation. \n\nIt is okay for them to deal with the failure, but they cannot try that first thing again, the opportunity is gone.\n\nWhen you fail to pick a lock, the lockpick breaks and jams it. When you fail to grapple a mobster he grabs you by the collar and jams a gun up your nose with a snarl. What do you do?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In PbtA games, all of them, failure HAS to drive the story forward. Fail forward, they call it.&lt;/p&gt;\n\n&lt;p&gt;This means players cannot enter the same river twice, because the failure of the dice has changed the situation. &lt;/p&gt;\n\n&lt;p&gt;It is okay for them to deal with the failure, but they cannot try that first thing again, the opportunity is gone.&lt;/p&gt;\n\n&lt;p&gt;When you fail to pick a lock, the lockpick breaks and jams it. When you fail to grapple a mobster he grabs you by the collar and jams a gun up your nose with a snarl. What do you do?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8cf7a", "score_hidden": false, "stickied": false, "created": 1492151729.0, "created_utc": 1492122929.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg80q0q", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "waiwode", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Not at all uncommon among older gamers, where many solutions were not rolled, but talked through -- especially looking for secrets or overcoming traps. Heck, all of the Grimtooths Traps books were basically things that had no game-mechanical solutions, but things that must be puzzled through as players.\n\nAnd that's a significantly different approach to gaming today, with robust skill systems and mechanical solutions to almost any situation.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not at all uncommon among older gamers, where many solutions were not rolled, but talked through -- especially looking for secrets or overcoming traps. Heck, all of the Grimtooths Traps books were basically things that had no game-mechanical solutions, but things that must be puzzled through as players.&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s a significantly different approach to gaming today, with robust skill systems and mechanical solutions to almost any situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg80q0q", "score_hidden": false, "stickied": false, "created": 1492138146.0, "created_utc": 1492109346.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg8anfc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "scrollbreak", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; As soon as I deny it, they frown at me for 'protecting the NPC'. (This may be totally in my head - don't blame the players).\n\nIt sounds like you're not actually defining the stakes of the dice roll before rolling, like 'Okay, if you fail the check, he slips aside and dives out the window, running down the alley. Now lets roll!'. And your players were giving no leeway to you from them failing the check.\n\n&gt; while someone is trying to grab him in a very specific way so that even \"failure\" would prevent escape.\n\nAnd here the player is trying to avoid having to roll at all, trying to establish fiction to make them auto win.\n \nYes, there are some bad habits here. Bad as in they suck the fun out of play.", "edited": 1492121301.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;As soon as I deny it, they frown at me for &amp;#39;protecting the NPC&amp;#39;. (This may be totally in my head - don&amp;#39;t blame the players).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It sounds like you&amp;#39;re not actually defining the stakes of the dice roll before rolling, like &amp;#39;Okay, if you fail the check, he slips aside and dives out the window, running down the alley. Now lets roll!&amp;#39;. And your players were giving no leeway to you from them failing the check.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;while someone is trying to grab him in a very specific way so that even &amp;quot;failure&amp;quot; would prevent escape.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And here the player is trying to avoid having to roll at all, trying to establish fiction to make them auto win.&lt;/p&gt;\n\n&lt;p&gt;Yes, there are some bad habits here. Bad as in they suck the fun out of play.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8anfc", "score_hidden": false, "stickied": false, "created": 1492149415.0, "created_utc": 1492120615.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg8bqcr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "GoblinLoveChild", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "* some people actually like distinct tactical options in their games that are anti-\"generic descriptor\"  -  This is fine.  Give me a grid, range penalties,  hard cover and flanking penalties any day. \n\nnarrative based encounter games like fate are great if thats what you are into but they are not for everyone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;some people actually like distinct tactical options in their games that are anti-&amp;quot;generic descriptor&amp;quot;  -  This is fine.  Give me a grid, range penalties,  hard cover and flanking penalties any day. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;narrative based encounter games like fate are great if thats what you are into but they are not for everyone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8bqcr", "score_hidden": false, "stickied": false, "created": 1492150814.0, "created_utc": 1492122014.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg8uyel", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "12_bowls_of_chowder", "parent_id": "t1_dg8iwjm", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I think what your players are doing isn't usual at all. I usually see it in players who've had GMs that thwart them or trick them. It seems especially common with players who like tactical games a la D&amp;D 4th ed. \n\n&gt;  but nothing in the writing indicated any thought that players might do as mine have. Why?\n\nI think it's not talked about in the rules because when the rules are all followed this behavior fades away naturally.\n\nWhen I first played Dungeon World some of this happened. Players trying to manipulate the fiction to their advantage hamhandedly and focusing on short-term success. That game didn't go very well. Then I played Apocalypse World and everything clicked. I followed the rules as written and the other players' behavior changed. Failing was fun. Long term goals moved to the front of mind. And they started to feel like I was there to help them achieve their goals instead of thwart them. It was the world and NPCs that wanted to stop them if anything did at all. It was great!\n\nI realized I hadn't been playing Dungeon World by the rules. I'd been playing like a D&amp;D GM thinking I could ignore the rules and trying to lead the PCs into my plans. It broke the game. I think that, or something like it, is what is happening to you.\n\nI'd recommend reading the [Dungeon World Guide](https://dl.dropboxusercontent.com/u/3269630/dwdotcom/eon-guide/Dungeon%20World%20Guide%20pdf%20version%201.2.pdf) if you haven't yet. It's very helpful for all PbtA games IMO. \n\nAnd if you can read [Apocalypse World](https://payhip.com/b/tACJ) I highly recommend it even if you never play. It's the original PbtA and really informs play for all the systems based on it.\n\n/u/M0dusPwnens has outlined some of the changes you can make. Think about them while reading the DW Guide and AW and I think it will be valuable to you. I would add to that advice: when you start making really nasty GM moves you need to make them and then work with the PCs to solve the problem you just created. That makes it fun. If you make a GM move and then sit back while the PCs struggle with what seems like overwhelming badness it won't work well. Make the move and then help; the \"be a fan of the PCs\" principal will start to make sense on another level.\n\nPPS. You could also try to sit in on a PbtA game run by someone else. It gives a whole new understanding. Or you can listen to [this game on youtube](https://www.youtube.com/playlist?list=PLTj75n3v9eTmtwQ0CEhIRILKitKLrLohc) which might be easier than finding a game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think what your players are doing isn&amp;#39;t usual at all. I usually see it in players who&amp;#39;ve had GMs that thwart them or trick them. It seems especially common with players who like tactical games a la D&amp;amp;D 4th ed. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;but nothing in the writing indicated any thought that players might do as mine have. Why?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think it&amp;#39;s not talked about in the rules because when the rules are all followed this behavior fades away naturally.&lt;/p&gt;\n\n&lt;p&gt;When I first played Dungeon World some of this happened. Players trying to manipulate the fiction to their advantage hamhandedly and focusing on short-term success. That game didn&amp;#39;t go very well. Then I played Apocalypse World and everything clicked. I followed the rules as written and the other players&amp;#39; behavior changed. Failing was fun. Long term goals moved to the front of mind. And they started to feel like I was there to help them achieve their goals instead of thwart them. It was the world and NPCs that wanted to stop them if anything did at all. It was great!&lt;/p&gt;\n\n&lt;p&gt;I realized I hadn&amp;#39;t been playing Dungeon World by the rules. I&amp;#39;d been playing like a D&amp;amp;D GM thinking I could ignore the rules and trying to lead the PCs into my plans. It broke the game. I think that, or something like it, is what is happening to you.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d recommend reading the &lt;a href=\"https://dl.dropboxusercontent.com/u/3269630/dwdotcom/eon-guide/Dungeon%20World%20Guide%20pdf%20version%201.2.pdf\"&gt;Dungeon World Guide&lt;/a&gt; if you haven&amp;#39;t yet. It&amp;#39;s very helpful for all PbtA games IMO. &lt;/p&gt;\n\n&lt;p&gt;And if you can read &lt;a href=\"https://payhip.com/b/tACJ\"&gt;Apocalypse World&lt;/a&gt; I highly recommend it even if you never play. It&amp;#39;s the original PbtA and really informs play for all the systems based on it.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"/u/M0dusPwnens\"&gt;/u/M0dusPwnens&lt;/a&gt; has outlined some of the changes you can make. Think about them while reading the DW Guide and AW and I think it will be valuable to you. I would add to that advice: when you start making really nasty GM moves you need to make them and then work with the PCs to solve the problem you just created. That makes it fun. If you make a GM move and then sit back while the PCs struggle with what seems like overwhelming badness it won&amp;#39;t work well. Make the move and then help; the &amp;quot;be a fan of the PCs&amp;quot; principal will start to make sense on another level.&lt;/p&gt;\n\n&lt;p&gt;PPS. You could also try to sit in on a PbtA game run by someone else. It gives a whole new understanding. Or you can listen to &lt;a href=\"https://www.youtube.com/playlist?list=PLTj75n3v9eTmtwQ0CEhIRILKitKLrLohc\"&gt;this game on youtube&lt;/a&gt; which might be easier than finding a game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8uyel", "score_hidden": false, "stickied": false, "created": 1492180352.0, "created_utc": 1492151552.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg94jbx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JasonYoakam", "parent_id": "t1_dg8iwjm", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; I noticed this difference that seems very normal, but nothing in the writing indicated any thought that players might do as mine have. Why?\n\nBecause it doesn't sound like a player issue. It sounds like you are making moves that are a little too large for the expectations of the table and not in keeping with \"What the Truth Demands\" of the fiction. (This is a GM principle from AW, I assume something like it is in US, too, but I'm not sure.)\n\nThis is covered explicitly by the rules about the conversation. You make your move, and then you ask \"what do you do?\" It sounds like your issue is that your players are trying to interrupt while you are in the middle of you making your move. That's not cool, but it does point to the fact that your moves are not in keeping with the reality of the fiction. So \"he starts to slip out the window, what do you do?\" should play out differently from \"he gets out the window in a flash and is now running down the alley, what do you do?\" Even though both are valid moves, you should probably in 90% of cases be going with the first one. The second would not be in following with your principle to say \"What the Truth Demands.\" If he is a super slippery ninja, getting out the window before the players can do anything might make more sense, but you would then be able to just say \"no, most people you would have had another chance to catch, but he's just *that* fast\" and your players will likely accept that response.\n\nBasically, your players are narrating a specific behavior \"I try to grab him right now in the kitchen\" and you are interpreting it as a broad behavior \"we try to catch him before he escapes.\" Then, when they roll, they are assuming your resulting move will be based upon the specific behavior that they narrated (\"so if we don't catch him in the kitchen, he will make a break for it out through that hallway\") and for some reason you are making a large move disproportional to their actions (\"he gets out the window and escapes, and there is no trace of him\"). \n\nIt sounds like you might also be denying the players the fruits of their labor (there is usually a principle against this in most PbtA games), or not acting as a fan of the players. \n\nThere is nothing generally in PbtA games that says you cannot try again once you fail. It's just that things have now changed. So, you failed to surprise him and he is trying to escape.. now he is halfway out the window. You try to grab him and fail, now you have his boot in your hand but he's running down the street. You try to track him down, and fail. Looks like he caught up with his Crew and they're all ready for you and they're pissed. See what I mean? They can keep trying! That's expected.", "edited": 1492178740.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I noticed this difference that seems very normal, but nothing in the writing indicated any thought that players might do as mine have. Why?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because it doesn&amp;#39;t sound like a player issue. It sounds like you are making moves that are a little too large for the expectations of the table and not in keeping with &amp;quot;What the Truth Demands&amp;quot; of the fiction. (This is a GM principle from AW, I assume something like it is in US, too, but I&amp;#39;m not sure.)&lt;/p&gt;\n\n&lt;p&gt;This is covered explicitly by the rules about the conversation. You make your move, and then you ask &amp;quot;what do you do?&amp;quot; It sounds like your issue is that your players are trying to interrupt while you are in the middle of you making your move. That&amp;#39;s not cool, but it does point to the fact that your moves are not in keeping with the reality of the fiction. So &amp;quot;he starts to slip out the window, what do you do?&amp;quot; should play out differently from &amp;quot;he gets out the window in a flash and is now running down the alley, what do you do?&amp;quot; Even though both are valid moves, you should probably in 90% of cases be going with the first one. The second would not be in following with your principle to say &amp;quot;What the Truth Demands.&amp;quot; If he is a super slippery ninja, getting out the window before the players can do anything might make more sense, but you would then be able to just say &amp;quot;no, most people you would have had another chance to catch, but he&amp;#39;s just &lt;em&gt;that&lt;/em&gt; fast&amp;quot; and your players will likely accept that response.&lt;/p&gt;\n\n&lt;p&gt;Basically, your players are narrating a specific behavior &amp;quot;I try to grab him right now in the kitchen&amp;quot; and you are interpreting it as a broad behavior &amp;quot;we try to catch him before he escapes.&amp;quot; Then, when they roll, they are assuming your resulting move will be based upon the specific behavior that they narrated (&amp;quot;so if we don&amp;#39;t catch him in the kitchen, he will make a break for it out through that hallway&amp;quot;) and for some reason you are making a large move disproportional to their actions (&amp;quot;he gets out the window and escapes, and there is no trace of him&amp;quot;). &lt;/p&gt;\n\n&lt;p&gt;It sounds like you might also be denying the players the fruits of their labor (there is usually a principle against this in most PbtA games), or not acting as a fan of the players. &lt;/p&gt;\n\n&lt;p&gt;There is nothing generally in PbtA games that says you cannot try again once you fail. It&amp;#39;s just that things have now changed. So, you failed to surprise him and he is trying to escape.. now he is halfway out the window. You try to grab him and fail, now you have his boot in your hand but he&amp;#39;s running down the street. You try to track him down, and fail. Looks like he caught up with his Crew and they&amp;#39;re all ready for you and they&amp;#39;re pissed. See what I mean? They can keep trying! That&amp;#39;s expected.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg94jbx", "score_hidden": false, "stickied": false, "created": 1492205393.0, "created_utc": 1492176593.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg95qs6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anon_adderlan", "parent_id": "t1_dg8iwjm", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; I noticed this difference that seems very normal, but nothing in the writing indicated any thought that players might do as mine have. Why?\n\nBecause *the system guides play*, and that shouldn't matter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I noticed this difference that seems very normal, but nothing in the writing indicated any thought that players might do as mine have. Why?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because &lt;em&gt;the system guides play&lt;/em&gt;, and that shouldn&amp;#39;t matter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg95qs6", "score_hidden": false, "stickied": false, "created": 1492207169.0, "created_utc": 1492178369.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8iwjm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SwiftOneSpeaks", "parent_id": "t1_dg8gv2f", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I appreciate the advice from everyone, and you've got a good idea, but my real question was just: \n\nI noticed this difference that seems very normal, but nothing in the writing indicated any thought that players might do as mine have.  Why? \n\nAre my groups weird (and have been for decades)?  Is this just a strange oversight by multiple authors?  Am I just failing to see things that are explicitly there?\n\nTalking with my group and deciding how to change things is a different set of concerns, and I'm pretty confident that we can do so - it's the lack of pointing out that such a conversation should occur that surprised me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I appreciate the advice from everyone, and you&amp;#39;ve got a good idea, but my real question was just: &lt;/p&gt;\n\n&lt;p&gt;I noticed this difference that seems very normal, but nothing in the writing indicated any thought that players might do as mine have.  Why? &lt;/p&gt;\n\n&lt;p&gt;Are my groups weird (and have been for decades)?  Is this just a strange oversight by multiple authors?  Am I just failing to see things that are explicitly there?&lt;/p&gt;\n\n&lt;p&gt;Talking with my group and deciding how to change things is a different set of concerns, and I&amp;#39;m pretty confident that we can do so - it&amp;#39;s the lack of pointing out that such a conversation should occur that surprised me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8iwjm", "score_hidden": false, "stickied": false, "created": 1492160476.0, "created_utc": 1492131676.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8gv2f", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "12_bowls_of_chowder", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "So others in this thread have already given you much better advice about how to play Urban Shadows as intended but if you want to play this way you can try getting a little help from your players.\n\nBefore any roll agree on what happens upon success and failure. Then have the players help. If failure means the guy escapes into a nearby ally and everybody knows that before the roll it's easy. \n\nIt also lets the other players know perhaps they want to try another approach if the failure outcome doesn't sit well with them.\n\nThat's more Burning Wheel than Urban Shadows but your group might like it anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So others in this thread have already given you much better advice about how to play Urban Shadows as intended but if you want to play this way you can try getting a little help from your players.&lt;/p&gt;\n\n&lt;p&gt;Before any roll agree on what happens upon success and failure. Then have the players help. If failure means the guy escapes into a nearby ally and everybody knows that before the roll it&amp;#39;s easy. &lt;/p&gt;\n\n&lt;p&gt;It also lets the other players know perhaps they want to try another approach if the failure outcome doesn&amp;#39;t sit well with them.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s more Burning Wheel than Urban Shadows but your group might like it anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8gv2f", "score_hidden": false, "stickied": false, "created": 1492157679.0, "created_utc": 1492128879.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg95kzr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JasonYoakam", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; In contrast, in any of my groups, if someone is trying to do something, they will inevitably add a fair amount of detail. \n\nThis is a correct behavior in PbtA. \n\n&gt; If there is a check they fail that doesn't result in immediate disaster, they'll try to find a way to re-do that check, by putting more at risk or trying to get the same result in a slightly different way.\n\nThere is nothing in PbtA games I've seen to suggest this is incorrect. In fact this is exactly correct. Things should be escalating and they should continue to push towards their goal.\n\n&gt; Here we have a case where the player FAILED at the grab. At this point, I as GM think the most interesting thing to do would be to have the guy escape\n\nYou *MUST* follow your principles. Usually there is a principle that says something to the effect of \"Say what the Truth Demands.\" So, although you may be fulfilling *one* of your principles with this example \"Fill their Lives With Adventure,\" you are not allowed to do so at the detriment of the other principles. In the truth of the fiction it seems incredibly unlikely that the NPC would be able to get out of the window without the PCs having some chance to make an action.  \n\n&gt; either way pacing has slowed down, and the players aren't thinking of the scene as changed, they're still trying to grab him\n\nThe *scene* hasn't changed. BUT the *fiction* has. The new fiction is that the bad guy is half way out the window, or he is making his way towards the window, or he pushes a button and a hole blows in the wall. \n\nIt is perfectly normal and good for the pacing to slow down in these action sequences. Going moment by moment is how the game is intended to work. This is how moves are designed.\n\n&gt; If he gets out the window, sprouts wings, and flies away, they will try any number of things to catch him as long as I allow it.\n\nAs they should. You should be gradually making harder and harder moves until it is apparent that he is close to fully escaping, and then if the players fail a roll *then*, he will get away. An example: \n\n\"He's far off in the distance now and it looks like he's about to round a corner. He might escape if you don't do something fast. What do you do?\"\n\n&gt; As soon as I deny it, they frown at me for 'protecting the NPC'. (This may be totally in my head - don't blame the players).\n\nWell, *aren't* you? You just said you thought it would be most interesting if they escaped.\n\n&gt; They'd establish where the doors and windows are, who is in place to do what, what equipment they have on them and what is in hand. \n\nThat sounds like spectacular player behavior. Remember, whenever they look to you, you should be making a move. \n\n&gt; Someone might try a distraction move that I think is desperate and ridiculous, \n\nThat's ok, it happens. \n\n&gt; while someone is trying to grab him in a very specific way so that even \"failure\" would prevent escape.\n\nThat's excellent! This will allow them to limit his chances for escape and perhaps instead force a fight or a surrender.\n\n&gt; Which means it becomes harder for anyone (them or me) to improvise anything about the scene. I can't have someone get out or come in through an adjacent room - because the layout was defined. No one can pick up an item off the floor/table to use as a weapon or tool - because everything notable was defined.\n\nEvery time they say \"hey is there a window?\" and look to you to see what happens *that's a \"Golden Opportunity\"* and you should be making a move \"there is a window, but it looks like it would make a lot of noise to get there. What do you do?\" \"I think I'll check the other side of the building.\" \"You see a suspicious looking white van circling the street. Looks like there are some real hard-asses driving, and it looks like they may have seen you. What do you do?\" So, basically as you are defining everything, the situation is getting more and more complicated and messy, meaning, this issue shouldn't really come up in the first place. By the time you are done defining everything, there will be so many problems and complications that you won't know how to deal with them all.", "edited": 1492179805.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In contrast, in any of my groups, if someone is trying to do something, they will inevitably add a fair amount of detail. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is a correct behavior in PbtA. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If there is a check they fail that doesn&amp;#39;t result in immediate disaster, they&amp;#39;ll try to find a way to re-do that check, by putting more at risk or trying to get the same result in a slightly different way.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There is nothing in PbtA games I&amp;#39;ve seen to suggest this is incorrect. In fact this is exactly correct. Things should be escalating and they should continue to push towards their goal.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Here we have a case where the player FAILED at the grab. At this point, I as GM think the most interesting thing to do would be to have the guy escape&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You &lt;em&gt;MUST&lt;/em&gt; follow your principles. Usually there is a principle that says something to the effect of &amp;quot;Say what the Truth Demands.&amp;quot; So, although you may be fulfilling &lt;em&gt;one&lt;/em&gt; of your principles with this example &amp;quot;Fill their Lives With Adventure,&amp;quot; you are not allowed to do so at the detriment of the other principles. In the truth of the fiction it seems incredibly unlikely that the NPC would be able to get out of the window without the PCs having some chance to make an action.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;either way pacing has slowed down, and the players aren&amp;#39;t thinking of the scene as changed, they&amp;#39;re still trying to grab him&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The &lt;em&gt;scene&lt;/em&gt; hasn&amp;#39;t changed. BUT the &lt;em&gt;fiction&lt;/em&gt; has. The new fiction is that the bad guy is half way out the window, or he is making his way towards the window, or he pushes a button and a hole blows in the wall. &lt;/p&gt;\n\n&lt;p&gt;It is perfectly normal and good for the pacing to slow down in these action sequences. Going moment by moment is how the game is intended to work. This is how moves are designed.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If he gets out the window, sprouts wings, and flies away, they will try any number of things to catch him as long as I allow it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As they should. You should be gradually making harder and harder moves until it is apparent that he is close to fully escaping, and then if the players fail a roll &lt;em&gt;then&lt;/em&gt;, he will get away. An example: &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He&amp;#39;s far off in the distance now and it looks like he&amp;#39;s about to round a corner. He might escape if you don&amp;#39;t do something fast. What do you do?&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As soon as I deny it, they frown at me for &amp;#39;protecting the NPC&amp;#39;. (This may be totally in my head - don&amp;#39;t blame the players).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, &lt;em&gt;aren&amp;#39;t&lt;/em&gt; you? You just said you thought it would be most interesting if they escaped.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;They&amp;#39;d establish where the doors and windows are, who is in place to do what, what equipment they have on them and what is in hand. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That sounds like spectacular player behavior. Remember, whenever they look to you, you should be making a move. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Someone might try a distraction move that I think is desperate and ridiculous, &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s ok, it happens. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;while someone is trying to grab him in a very specific way so that even &amp;quot;failure&amp;quot; would prevent escape.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s excellent! This will allow them to limit his chances for escape and perhaps instead force a fight or a surrender.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Which means it becomes harder for anyone (them or me) to improvise anything about the scene. I can&amp;#39;t have someone get out or come in through an adjacent room - because the layout was defined. No one can pick up an item off the floor/table to use as a weapon or tool - because everything notable was defined.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Every time they say &amp;quot;hey is there a window?&amp;quot; and look to you to see what happens &lt;em&gt;that&amp;#39;s a &amp;quot;Golden Opportunity&amp;quot;&lt;/em&gt; and you should be making a move &amp;quot;there is a window, but it looks like it would make a lot of noise to get there. What do you do?&amp;quot; &amp;quot;I think I&amp;#39;ll check the other side of the building.&amp;quot; &amp;quot;You see a suspicious looking white van circling the street. Looks like there are some real hard-asses driving, and it looks like they may have seen you. What do you do?&amp;quot; So, basically as you are defining everything, the situation is getting more and more complicated and messy, meaning, this issue shouldn&amp;#39;t really come up in the first place. By the time you are done defining everything, there will be so many problems and complications that you won&amp;#39;t know how to deal with them all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg95kzr", "score_hidden": false, "stickied": false, "created": 1492206942.0, "created_utc": 1492178142.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg82dwz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NullOperative", "parent_id": "t1_dg7zizn", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt;I never let players roll unless there's immediate consequences for failure, like lost time and resources, or tipping off their enemies to their plans. Automatic success is easier to handle.\n\nOne way I've seen this justified is to say that, whatever the players roll, that's their best effort.  If it was something they could retry, they did that already and it didn't work.  Consequences happen, and if it's even possible to still try to achieve their goal, they need to take a notably different approach.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I never let players roll unless there&amp;#39;s immediate consequences for failure, like lost time and resources, or tipping off their enemies to their plans. Automatic success is easier to handle.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;One way I&amp;#39;ve seen this justified is to say that, whatever the players roll, that&amp;#39;s their best effort.  If it was something they could retry, they did that already and it didn&amp;#39;t work.  Consequences happen, and if it&amp;#39;s even possible to still try to achieve their goal, they need to take a notably different approach.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg82dwz", "score_hidden": false, "stickied": false, "created": 1492139949.0, "created_utc": 1492111149.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg8ww5a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JustusGS", "parent_id": "t1_dg7zizn", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "This isn't bad general advice, but it's worth noting that most PbtA games do not have a \"say yes or roll the dice\" rule. Played as written, players roll for a move *whenever* the trigger is met. Most of the time, in a well-written hack, the moves do this work automatically--shooting an unconscious guy in the head doesn't trigger the \"fight someone\" move any more than stabbing a Marine with a plastic spork would. A trained thief picking a lock when no one's around probably wouldn't trigger the \"do something dangerous\" move, since they *aren't* doing anything particularly dangerous. When the players do something not covered by a move, you have free reign to follow through on the fiction. But if the conditions to roll the move are met, don't give it to the players for free just because there aren't any *obvious* consequences--there are very few circumstances where you really can't make *any* move on a failure.\n\nThat said, you can still give them their automatic success *and* make them roll, in some cases. (Since a 6- is technically a \"miss,\" not a \"failure.\") If they're picking a lock, they can do it, but the roll determines whether they do it flawlessly, whether they take too much time, or whether they trip the silent alarm, summoning the guards immediately. They're through the door regardless, but they're in a much worse position on a \"failure.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t bad general advice, but it&amp;#39;s worth noting that most PbtA games do not have a &amp;quot;say yes or roll the dice&amp;quot; rule. Played as written, players roll for a move &lt;em&gt;whenever&lt;/em&gt; the trigger is met. Most of the time, in a well-written hack, the moves do this work automatically--shooting an unconscious guy in the head doesn&amp;#39;t trigger the &amp;quot;fight someone&amp;quot; move any more than stabbing a Marine with a plastic spork would. A trained thief picking a lock when no one&amp;#39;s around probably wouldn&amp;#39;t trigger the &amp;quot;do something dangerous&amp;quot; move, since they &lt;em&gt;aren&amp;#39;t&lt;/em&gt; doing anything particularly dangerous. When the players do something not covered by a move, you have free reign to follow through on the fiction. But if the conditions to roll the move are met, don&amp;#39;t give it to the players for free just because there aren&amp;#39;t any &lt;em&gt;obvious&lt;/em&gt; consequences--there are very few circumstances where you really can&amp;#39;t make &lt;em&gt;any&lt;/em&gt; move on a failure.&lt;/p&gt;\n\n&lt;p&gt;That said, you can still give them their automatic success &lt;em&gt;and&lt;/em&gt; make them roll, in some cases. (Since a 6- is technically a &amp;quot;miss,&amp;quot; not a &amp;quot;failure.&amp;quot;) If they&amp;#39;re picking a lock, they can do it, but the roll determines whether they do it flawlessly, whether they take too much time, or whether they trip the silent alarm, summoning the guards immediately. They&amp;#39;re through the door regardless, but they&amp;#39;re in a much worse position on a &amp;quot;failure.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8ww5a", "score_hidden": false, "stickied": false, "created": 1492185619.0, "created_utc": 1492156819.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7zizn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "thomar", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; If there is a check they fail that doesn't result in immediate disaster, they'll try to find a way to re-do that check, by putting more at risk or trying to get the same result in a slightly different way.\n\nI never let players roll unless there's immediate consequences for failure, like lost time and resources, or tipping off their enemies to their plans. Automatic success is easier to handle. I do this because I don't want to cheapen die rolls.\n\n&gt; To cover the other problem, the above is WAY TOO SIMPLE for my players. They wouldn't just peek in the door, then go to grapple someone. They'd establish where the doors and windows are, who is in place to do what, what equipment they have on them and what is in hand. Someone might try a distraction move that I think is desperate and ridiculous, while someone is trying to grab him in a very specific way so that even \"failure\" would prevent escape.\n\nI would answer their question partially, but then stop and ask them what exactly they're looking for before you've written them into a corner. A few careful leading questions can get a lot of information out of players.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If there is a check they fail that doesn&amp;#39;t result in immediate disaster, they&amp;#39;ll try to find a way to re-do that check, by putting more at risk or trying to get the same result in a slightly different way.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I never let players roll unless there&amp;#39;s immediate consequences for failure, like lost time and resources, or tipping off their enemies to their plans. Automatic success is easier to handle. I do this because I don&amp;#39;t want to cheapen die rolls.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;To cover the other problem, the above is WAY TOO SIMPLE for my players. They wouldn&amp;#39;t just peek in the door, then go to grapple someone. They&amp;#39;d establish where the doors and windows are, who is in place to do what, what equipment they have on them and what is in hand. Someone might try a distraction move that I think is desperate and ridiculous, while someone is trying to grab him in a very specific way so that even &amp;quot;failure&amp;quot; would prevent escape.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I would answer their question partially, but then stop and ask them what exactly they&amp;#39;re looking for before you&amp;#39;ve written them into a corner. A few careful leading questions can get a lot of information out of players.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg7zizn", "score_hidden": false, "stickied": false, "created": 1492136861.0, "created_utc": 1492108061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg8568g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SwiftOneSpeaks", "parent_id": "t1_dg84jzr", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "*shrug* I'm just passing on the comments.   It's a bit of a fuzzy line - given the choices in the move results in Urban Shadows, they are okay.  Picking whether they take damage or get in a bad situation as the \"cost\" of their success they are okay with (I guess they feel like the specifics of the character's actions influence the result).  Dictating _what_ bad happens to them is usually not desirable to them unless they get a great idea.  \n\nFor myself, I do struggle if players are defining what the bad guys do when they don't know the larger motivations for said bad guys.  \n\nI also struggle to keep the pressure on for \"what do you do\" type questions whenever the players try to understand the situation fully but aren't performing active actions (social or physical)...we either bog down in nothing dramatic happening, or I can keep the pressure on, but it ends up as a bit silly.   I think that's something I can improve with practice, but part of it is getting to move in the same direction as the players and not swimming upstream.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;shrug&lt;/em&gt; I&amp;#39;m just passing on the comments.   It&amp;#39;s a bit of a fuzzy line - given the choices in the move results in Urban Shadows, they are okay.  Picking whether they take damage or get in a bad situation as the &amp;quot;cost&amp;quot; of their success they are okay with (I guess they feel like the specifics of the character&amp;#39;s actions influence the result).  Dictating &lt;em&gt;what&lt;/em&gt; bad happens to them is usually not desirable to them unless they get a great idea.  &lt;/p&gt;\n\n&lt;p&gt;For myself, I do struggle if players are defining what the bad guys do when they don&amp;#39;t know the larger motivations for said bad guys.  &lt;/p&gt;\n\n&lt;p&gt;I also struggle to keep the pressure on for &amp;quot;what do you do&amp;quot; type questions whenever the players try to understand the situation fully but aren&amp;#39;t performing active actions (social or physical)...we either bog down in nothing dramatic happening, or I can keep the pressure on, but it ends up as a bit silly.   I think that&amp;#39;s something I can improve with practice, but part of it is getting to move in the same direction as the players and not swimming upstream.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8568g", "score_hidden": false, "stickied": false, "created": 1492142988.0, "created_utc": 1492114188.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84jzr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Kosine", "parent_id": "t1_dg83lpp", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "But... that's how Urban Shadows (and I presume other PbtA games) are played. Everyone gets a chance to craft the story, cooperatively.\n\nThe session moves even force the issue, if they're reluctant - each player is given a turn to craft the current events in the city, before roleplaying really begins.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But... that&amp;#39;s how Urban Shadows (and I presume other PbtA games) are played. Everyone gets a chance to craft the story, cooperatively.&lt;/p&gt;\n\n&lt;p&gt;The session moves even force the issue, if they&amp;#39;re reluctant - each player is given a turn to craft the current events in the city, before roleplaying really begins.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg84jzr", "score_hidden": false, "stickied": false, "created": 1492142301.0, "created_utc": 1492113501.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg8ofr5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SwiftOneSpeaks", "parent_id": "t1_dg86uq4", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I have a hard time reacting to this.  \n\n If you say \"You play without player input\", I'd think you were crazy.   The plot grows in reaction to PC actions (or inaction).  I equate lack of player input to a plot that would be the same regardless of the players, and that's not how I play at all - generally I have a vague setting and some factions and some secrets, but how everything goes from there is based on PC actions.\n\nOTOH, if you say \"your players almost never directly dictate how NPCs behave, or facts of the setting\", outside of campaign start up that's pretty true.  Players can tell me some aspect of the game is interesting or boring to change the focus, and the PCs themselves will decide what gets focus and development, but my players don't generally say mid-campaign what a cult wants, or that the cop they just ran into is an old friend, or that the feral dog they were feeding is actually a werewolf.    And though such games can totally work for some people, neither my players nor I show any real desire for that - I'm into the story creation, they are into the story interaction, and I'm into finding out how they direct my ideas into totally new ways.  When we've tried players creating things, we tend to end up with shallow and/or silly plots, because it's hard to come up with anything intricate when not everyone knows everything, and it's hard to have real twists that had foreshadowing if everyone knows everything.\n\nIf the audience was dictating the setting, you could never have Sixth Sense.  You could have surprises, but there would be \"Kirk's old friend you've never heard of is on this trip\" type surprises.  \n\nI'm not dissing the style - I'm sure for many groups it's what they want.   But at the same time, when people say things like \"I can't imagine playing without player input anymore\", I feel like I'm being cast as some sort of railroading dictator.\n\nMy players DO trust me - any adversarial relationship is between them and the problem solving, not them and me, though you are correct that their approach is in an adversarial vein. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a hard time reacting to this.  &lt;/p&gt;\n\n&lt;p&gt;If you say &amp;quot;You play without player input&amp;quot;, I&amp;#39;d think you were crazy.   The plot grows in reaction to PC actions (or inaction).  I equate lack of player input to a plot that would be the same regardless of the players, and that&amp;#39;s not how I play at all - generally I have a vague setting and some factions and some secrets, but how everything goes from there is based on PC actions.&lt;/p&gt;\n\n&lt;p&gt;OTOH, if you say &amp;quot;your players almost never directly dictate how NPCs behave, or facts of the setting&amp;quot;, outside of campaign start up that&amp;#39;s pretty true.  Players can tell me some aspect of the game is interesting or boring to change the focus, and the PCs themselves will decide what gets focus and development, but my players don&amp;#39;t generally say mid-campaign what a cult wants, or that the cop they just ran into is an old friend, or that the feral dog they were feeding is actually a werewolf.    And though such games can totally work for some people, neither my players nor I show any real desire for that - I&amp;#39;m into the story creation, they are into the story interaction, and I&amp;#39;m into finding out how they direct my ideas into totally new ways.  When we&amp;#39;ve tried players creating things, we tend to end up with shallow and/or silly plots, because it&amp;#39;s hard to come up with anything intricate when not everyone knows everything, and it&amp;#39;s hard to have real twists that had foreshadowing if everyone knows everything.&lt;/p&gt;\n\n&lt;p&gt;If the audience was dictating the setting, you could never have Sixth Sense.  You could have surprises, but there would be &amp;quot;Kirk&amp;#39;s old friend you&amp;#39;ve never heard of is on this trip&amp;quot; type surprises.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not dissing the style - I&amp;#39;m sure for many groups it&amp;#39;s what they want.   But at the same time, when people say things like &amp;quot;I can&amp;#39;t imagine playing without player input anymore&amp;quot;, I feel like I&amp;#39;m being cast as some sort of railroading dictator.&lt;/p&gt;\n\n&lt;p&gt;My players DO trust me - any adversarial relationship is between them and the problem solving, not them and me, though you are correct that their approach is in an adversarial vein. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8ofr5", "score_hidden": false, "stickied": false, "created": 1492168318.0, "created_utc": 1492139518.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86uq4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg83lpp", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg86uq4", "score_hidden": false, "stickied": false, "created": 1492144863.0, "created_utc": 1492116063.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83lpp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SwiftOneSpeaks", "parent_id": "t1_dg82ky9", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; Let them answer their own questions\n\nThat's something my players tend to dislike.  They want to stay in-character, not drop out and be meta.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Let them answer their own questions&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s something my players tend to dislike.  They want to stay in-character, not drop out and be meta.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg83lpp", "score_hidden": false, "stickied": false, "created": 1492141274.0, "created_utc": 1492112474.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82ky9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg82ky9", "score_hidden": false, "stickied": false, "created": 1492140164.0, "created_utc": 1492111364.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg90o9o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DavousRex", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Player: \"I &lt;SOMETHING&gt;\"\n\nGM: \"Too late, he's already out the window.\"\n\nThis might also happen:\n\nPlayer: \"&lt;COMPLAINING, DEMANDING ANOTHER ROLL&gt;\"\n\nGM: \"Now he's running down the street. Spend more time complaining, this head start is really helpful.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Player: &amp;quot;I &amp;lt;SOMETHING&amp;gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;GM: &amp;quot;Too late, he&amp;#39;s already out the window.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This might also happen:&lt;/p&gt;\n\n&lt;p&gt;Player: &amp;quot;&amp;lt;COMPLAINING, DEMANDING ANOTHER ROLL&amp;gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;GM: &amp;quot;Now he&amp;#39;s running down the street. Spend more time complaining, this head start is really helpful.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg90o9o", "score_hidden": false, "stickied": false, "created": 1492197585.0, "created_utc": 1492168785.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg9i6q6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Reddit4Play", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "There's a lot of very long, detailed advice and comments in here already, so I'll just focus on one tiny piece of what's going on.\n\n&gt; even \"failure\" would prevent escape.\n\nThis is actually the correct way to play PbtA games for somebody interested in winning. If your group is interested in games as exercises in overcoming challenges then this is the natural result. \n\nIt's also not really the intended method of play for PbtA games. They're more about finding enjoyment in making a good story than in being a clever player so as to achieve your character's goals. That doesn't mean you can't do the latter - I find it quite enjoyable. But it does mean the game wasn't really written for that kind of play experience, hence the lack of consideration.\n\nHere is my concrete game-running advice, which is much longer and may not necessarily be as reassuring or helpful as that was:\n\n&gt; Here we have a case where the player FAILED at the grab.\n\nA trick I picked up from some Fate system game, IIRC, is that you need to describe player failure in a certain way to get buy-in.\n\nFirst of all, make it clear that when they roll and fail they lose control of what happens. It's like if it's the enemy's turn in D&amp;D and they roll a hit for 6 damage - you can't be like \"wait, no, I do something to stop that,\" it's just not how the game works.\n\nHowever, I'd recommend doing three things to frame this procedure in a way that will hopefully make players more receptive.\n\nOne, make it clear that rolling for Moves isn't the only way to do things. For example, many PbtA games have some kind of \"Fight\" Move that assumes you are having some kind of scuffle. If you just stab somebody in their sleep you don't roll that - you just kill them.\n\nIf the players have set it up so that there's no reasonable way this guy can escape then that's that - he can't escape. But if they haven't planned in advance and start rolling dice then whatever opportunities are available (like that unguarded window) are yours to exploit freely as the GM.\n\nSecond, make it clear what's going to happen when they fail a Move. Players who play to win appreciate having more information (\"oh, if I miss he's going to get away? Let me distract him instead while George goes around to the window...\"), and it's also best-practice whenever you're using that generic \"roll+stat because danger\" Move that most PbtA games have. If you're making them roll tell them why - what will happen if they succeed (usually baked into the Move) and what will happen if they fail so they can make an informed decision.\n\nThird, it's fine if people try to jump in the way of a failed roll. The most important principle in these games, in my opinion, is \"do what the truth demands\" (or whatever variant there is in whatever PbtA game you're playing). If another PC would reasonably have been ready for this guy to run and would have beaten him to the window? Fine. But there's still a GM Move floating around and now that guy gets a knife to the ribs. Or when this goon's escape is cut off he bites down on his cyanide to escape interrogation. Or something. It doesn't really matter what, as long as it makes sense.\n\n\"But this guy has a Move that says 'escape out the window' - he's really great it!\" That's fine. But if you have a Move that says 'knock somebody out' and you're tied to a chair and also asleep that doesn't mean you can just do it - it has to make sense. If you think it DOES still make sense then argue your case - achieving consensus on what makes sense is part of what PbtA games are about.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a lot of very long, detailed advice and comments in here already, so I&amp;#39;ll just focus on one tiny piece of what&amp;#39;s going on.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;even &amp;quot;failure&amp;quot; would prevent escape.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is actually the correct way to play PbtA games for somebody interested in winning. If your group is interested in games as exercises in overcoming challenges then this is the natural result. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also not really the intended method of play for PbtA games. They&amp;#39;re more about finding enjoyment in making a good story than in being a clever player so as to achieve your character&amp;#39;s goals. That doesn&amp;#39;t mean you can&amp;#39;t do the latter - I find it quite enjoyable. But it does mean the game wasn&amp;#39;t really written for that kind of play experience, hence the lack of consideration.&lt;/p&gt;\n\n&lt;p&gt;Here is my concrete game-running advice, which is much longer and may not necessarily be as reassuring or helpful as that was:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Here we have a case where the player FAILED at the grab.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A trick I picked up from some Fate system game, IIRC, is that you need to describe player failure in a certain way to get buy-in.&lt;/p&gt;\n\n&lt;p&gt;First of all, make it clear that when they roll and fail they lose control of what happens. It&amp;#39;s like if it&amp;#39;s the enemy&amp;#39;s turn in D&amp;amp;D and they roll a hit for 6 damage - you can&amp;#39;t be like &amp;quot;wait, no, I do something to stop that,&amp;quot; it&amp;#39;s just not how the game works.&lt;/p&gt;\n\n&lt;p&gt;However, I&amp;#39;d recommend doing three things to frame this procedure in a way that will hopefully make players more receptive.&lt;/p&gt;\n\n&lt;p&gt;One, make it clear that rolling for Moves isn&amp;#39;t the only way to do things. For example, many PbtA games have some kind of &amp;quot;Fight&amp;quot; Move that assumes you are having some kind of scuffle. If you just stab somebody in their sleep you don&amp;#39;t roll that - you just kill them.&lt;/p&gt;\n\n&lt;p&gt;If the players have set it up so that there&amp;#39;s no reasonable way this guy can escape then that&amp;#39;s that - he can&amp;#39;t escape. But if they haven&amp;#39;t planned in advance and start rolling dice then whatever opportunities are available (like that unguarded window) are yours to exploit freely as the GM.&lt;/p&gt;\n\n&lt;p&gt;Second, make it clear what&amp;#39;s going to happen when they fail a Move. Players who play to win appreciate having more information (&amp;quot;oh, if I miss he&amp;#39;s going to get away? Let me distract him instead while George goes around to the window...&amp;quot;), and it&amp;#39;s also best-practice whenever you&amp;#39;re using that generic &amp;quot;roll+stat because danger&amp;quot; Move that most PbtA games have. If you&amp;#39;re making them roll tell them why - what will happen if they succeed (usually baked into the Move) and what will happen if they fail so they can make an informed decision.&lt;/p&gt;\n\n&lt;p&gt;Third, it&amp;#39;s fine if people try to jump in the way of a failed roll. The most important principle in these games, in my opinion, is &amp;quot;do what the truth demands&amp;quot; (or whatever variant there is in whatever PbtA game you&amp;#39;re playing). If another PC would reasonably have been ready for this guy to run and would have beaten him to the window? Fine. But there&amp;#39;s still a GM Move floating around and now that guy gets a knife to the ribs. Or when this goon&amp;#39;s escape is cut off he bites down on his cyanide to escape interrogation. Or something. It doesn&amp;#39;t really matter what, as long as it makes sense.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But this guy has a Move that says &amp;#39;escape out the window&amp;#39; - he&amp;#39;s really great it!&amp;quot; That&amp;#39;s fine. But if you have a Move that says &amp;#39;knock somebody out&amp;#39; and you&amp;#39;re tied to a chair and also asleep that doesn&amp;#39;t mean you can just do it - it has to make sense. If you think it DOES still make sense then argue your case - achieving consensus on what makes sense is part of what PbtA games are about.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9i6q6", "score_hidden": false, "stickied": false, "created": 1492221991.0, "created_utc": 1492193191.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg9pln4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SwiftOneSpeaks", "parent_id": "t1_dg9onwv", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; The first is trying to capture someone in #UrbanShadows doesn't trigger a move\n\nBut, I mean, it has to.  Sure, there isn't a move \"capture\", but if the fiction is \"you try to capture him\" there has to be a way to do it - be that an attack, or whatever.  And if they miss on that, target escapes (or something else, but in this case we're imagining a target that wants to get away).\n\nI'm very used to skill-based systems, so thinking in Moves is new to me.  Superficially it seems easy, but I foresee details like this coming up a lot, so how would you handle this sort of thing as a Move?   PC wants to make sure target can't escape, target most definitely wants to escape.  What move?\n\n(My original question was not that I can't get US/PbtA to work, because I've not tried yet)\n\n&gt; I'd run at least one session following the RAW \n\nOh yes, I'm not trying to change anything, I'm still understanding.  (though that seems difficult, as there's a lot of contradictory advice.  In fact, I was just reading in the US book last night that they consider the MC's role very traditional: Players describe their actions and reactions, and MC declares everything else.  That doesn't entirely jive with some of the examples in that same book (they have a lot of players declaring setting situations, but at the start of session, not in-game), but it also doesn't remotely jive with some of the comments I've gotten here or in my previous thread.\n\n&gt; there's always #BladesInTheDark ;)\n\nHardcopy already pre-ordered, but I like a lot of games, so this is probably not a \"one game to rule them all\" situation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The first is trying to capture someone in #UrbanShadows doesn&amp;#39;t trigger a move&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But, I mean, it has to.  Sure, there isn&amp;#39;t a move &amp;quot;capture&amp;quot;, but if the fiction is &amp;quot;you try to capture him&amp;quot; there has to be a way to do it - be that an attack, or whatever.  And if they miss on that, target escapes (or something else, but in this case we&amp;#39;re imagining a target that wants to get away).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m very used to skill-based systems, so thinking in Moves is new to me.  Superficially it seems easy, but I foresee details like this coming up a lot, so how would you handle this sort of thing as a Move?   PC wants to make sure target can&amp;#39;t escape, target most definitely wants to escape.  What move?&lt;/p&gt;\n\n&lt;p&gt;(My original question was not that I can&amp;#39;t get US/PbtA to work, because I&amp;#39;ve not tried yet)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;d run at least one session following the RAW &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Oh yes, I&amp;#39;m not trying to change anything, I&amp;#39;m still understanding.  (though that seems difficult, as there&amp;#39;s a lot of contradictory advice.  In fact, I was just reading in the US book last night that they consider the MC&amp;#39;s role very traditional: Players describe their actions and reactions, and MC declares everything else.  That doesn&amp;#39;t entirely jive with some of the examples in that same book (they have a lot of players declaring setting situations, but at the start of session, not in-game), but it also doesn&amp;#39;t remotely jive with some of the comments I&amp;#39;ve gotten here or in my previous thread.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;there&amp;#39;s always #BladesInTheDark ;)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hardcopy already pre-ordered, but I like a lot of games, so this is probably not a &amp;quot;one game to rule them all&amp;quot; situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9pln4", "score_hidden": false, "stickied": false, "created": 1492230903.0, "created_utc": 1492202103.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9onwv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anon_adderlan", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "So based on what I'm reading, there seems to be two key concepts causing dissonance.\n\nThe first is trying to capture someone in \\#UrbanShadows *doesn't trigger a move*. Persuading them does. Tricking them does. Attacking them does. But capturing them does not. So if a target slips out the window players should feel free to pursue until a \\#Move is triggered, and they or the target are persuaded, subdued, or dead. \\#JustAsPlanned.\n\nThe second is that \\#FictionalPositioning only makes success *possible*, not *more likely*. For example, nothing you do in the fiction when rolling for 'Lend a Hand or Get in the Way' will affect how likely you are to contribute a +1 or -2 to a roll, or expose yourself to danger, entanglement, or cost. But if you don't have a \\#ProtonPack handy you may not be able to 'lend a hand' to subdue that ghost at all.\n\nNow you could add rules to 'fix' these 'deficiencies', but by doing so you'll also change the focus of the game and what it's about, because *even the rules which are missing are important*. So I'd run at least one session following the RAW and see where that takes you, and if it turns out this isn't your game, then there's always \\#BladesInTheDark ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So based on what I&amp;#39;m reading, there seems to be two key concepts causing dissonance.&lt;/p&gt;\n\n&lt;p&gt;The first is trying to capture someone in #UrbanShadows &lt;em&gt;doesn&amp;#39;t trigger a move&lt;/em&gt;. Persuading them does. Tricking them does. Attacking them does. But capturing them does not. So if a target slips out the window players should feel free to pursue until a #Move is triggered, and they or the target are persuaded, subdued, or dead. #JustAsPlanned.&lt;/p&gt;\n\n&lt;p&gt;The second is that #FictionalPositioning only makes success &lt;em&gt;possible&lt;/em&gt;, not &lt;em&gt;more likely&lt;/em&gt;. For example, nothing you do in the fiction when rolling for &amp;#39;Lend a Hand or Get in the Way&amp;#39; will affect how likely you are to contribute a +1 or -2 to a roll, or expose yourself to danger, entanglement, or cost. But if you don&amp;#39;t have a #ProtonPack handy you may not be able to &amp;#39;lend a hand&amp;#39; to subdue that ghost at all.&lt;/p&gt;\n\n&lt;p&gt;Now you could add rules to &amp;#39;fix&amp;#39; these &amp;#39;deficiencies&amp;#39;, but by doing so you&amp;#39;ll also change the focus of the game and what it&amp;#39;s about, because &lt;em&gt;even the rules which are missing are important&lt;/em&gt;. So I&amp;#39;d run at least one session following the RAW and see where that takes you, and if it turns out this isn&amp;#39;t your game, then there&amp;#39;s always #BladesInTheDark ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9onwv", "score_hidden": false, "stickied": false, "created": 1492229775.0, "created_utc": 1492200975.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg831vc", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "M0dusPwnens", "parent_id": "t1_dg822to", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I really recommend trying it sometime (specifically *Apocalypse World*, which I think is still the best introduction to the ideas). It's a wonderful game because it's so easy to see the \"guts\" when you play - so long as you just follow the rules, you'll end up with a particular style of game and GMing.\n\nMaybe you like it, maybe you don't, but there aren't many other systems that can easily get you to play in a new style simply by following the rules.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really recommend trying it sometime (specifically &lt;em&gt;Apocalypse World&lt;/em&gt;, which I think is still the best introduction to the ideas). It&amp;#39;s a wonderful game because it&amp;#39;s so easy to see the &amp;quot;guts&amp;quot; when you play - so long as you just follow the rules, you&amp;#39;ll end up with a particular style of game and GMing.&lt;/p&gt;\n\n&lt;p&gt;Maybe you like it, maybe you don&amp;#39;t, but there aren&amp;#39;t many other systems that can easily get you to play in a new style simply by following the rules.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg831vc", "score_hidden": false, "stickied": false, "created": 1492140673.0, "created_utc": 1492111873.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg822to", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "foxsable", "parent_id": "t1_dg81vqq", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "| There isn't really any reality bending involved. You don't ever retcon anything.\n\nSorry, again, I was trying to be glib and it failed. I think I have the concept, but if I didn't, your explanation is excellent. And I can see how more dramatic scenes would move faster. \n\nThat really is a different concept than anything I've experienced! Neat! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;| There isn&amp;#39;t really any reality bending involved. You don&amp;#39;t ever retcon anything.&lt;/p&gt;\n\n&lt;p&gt;Sorry, again, I was trying to be glib and it failed. I think I have the concept, but if I didn&amp;#39;t, your explanation is excellent. And I can see how more dramatic scenes would move faster. &lt;/p&gt;\n\n&lt;p&gt;That really is a different concept than anything I&amp;#39;ve experienced! Neat! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg822to", "score_hidden": false, "stickied": false, "created": 1492139617.0, "created_utc": 1492110817.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81vqq", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "M0dusPwnens", "parent_id": "t1_dg80tdu", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "There isn't really any reality bending involved. You don't ever retcon anything.\n\nThe way it works is like this:\n\n1. Player tries to capture the guy, triggering some kind of roll.\n\n2. Roll fails.\n\n3. GM looks at the GM moves and picks one that makes sense and seems sensible given the situation.\n\n4. Let's say they go with \"do damage\". Again, this has to make sense in context. If the player who was trying to capture the guy had described running past the other guys and tackling him, it totally makes sense that he might take a few grazing bullets on the way, so that's exactly what you describe (you don't actually tell the players you're making a GM move or which move it is). Or perhaps, as the player is chasing after the guy, you describe how he ends up corning the guy in an alley, but quickly notices all the gangsters on the fire escapes above with guns pointed right at him (\"put them in a spot\").\n\n5. The GM says \"Okay, what do you do?\".\n\nThe player is totally still capable of capturing the guy, but the failure to capture him didn't just \"not happen\" - it meant that there was some complication. Many other games have rules about not being allowed to retry rolls that failed unless the circumstances change, and PbtA handles that instead by saying \"a failed roll means the circumstances change\".\n\nNotice how any of these things could totally happen in just about any other game. A player running across a room of enemies to try to tackle the guy might easily end up taking damage in a lot of systems. Failing to capture a guy, chasing him, and ending up in that alley might happen in *any* system. What PbtA does though is control how that stuff happens - it turns failed rolls into complications, but it also dictates what the complications can be, so significant railroading is basically impossible so long as you're playing by the rules.\n\n&gt; And super cautious play is the correct way to play as a player.\n\nIt can be, but here's the crucial thing: what is the \"super cautious\" thing to do when your house is burning down with you in it and someone has a gun aimed at your friend's head?\n\nThe reason super cautious play is fine in PbtA games is the other thing that triggers GM moves: every time the players look to you to see what happens next. And this isn't an *option* to make a GM move, it's an obligation. The more passive the players are being, the more shit the rules end up giving them to deal with. If you don't go looking for trouble, that's fine - trouble is going to come looking for you. Think of the stereotypical prison plot where the guy goes in, decides he's going to keep to himself and not get involved in any drama, and then discovers that the other people are going to decide to involve him whether he wants it or not.", "edited": 1492110857.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There isn&amp;#39;t really any reality bending involved. You don&amp;#39;t ever retcon anything.&lt;/p&gt;\n\n&lt;p&gt;The way it works is like this:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Player tries to capture the guy, triggering some kind of roll.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Roll fails.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;GM looks at the GM moves and picks one that makes sense and seems sensible given the situation.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Let&amp;#39;s say they go with &amp;quot;do damage&amp;quot;. Again, this has to make sense in context. If the player who was trying to capture the guy had described running past the other guys and tackling him, it totally makes sense that he might take a few grazing bullets on the way, so that&amp;#39;s exactly what you describe (you don&amp;#39;t actually tell the players you&amp;#39;re making a GM move or which move it is). Or perhaps, as the player is chasing after the guy, you describe how he ends up corning the guy in an alley, but quickly notices all the gangsters on the fire escapes above with guns pointed right at him (&amp;quot;put them in a spot&amp;quot;).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The GM says &amp;quot;Okay, what do you do?&amp;quot;.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The player is totally still capable of capturing the guy, but the failure to capture him didn&amp;#39;t just &amp;quot;not happen&amp;quot; - it meant that there was some complication. Many other games have rules about not being allowed to retry rolls that failed unless the circumstances change, and PbtA handles that instead by saying &amp;quot;a failed roll means the circumstances change&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Notice how any of these things could totally happen in just about any other game. A player running across a room of enemies to try to tackle the guy might easily end up taking damage in a lot of systems. Failing to capture a guy, chasing him, and ending up in that alley might happen in &lt;em&gt;any&lt;/em&gt; system. What PbtA does though is control how that stuff happens - it turns failed rolls into complications, but it also dictates what the complications can be, so significant railroading is basically impossible so long as you&amp;#39;re playing by the rules.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And super cautious play is the correct way to play as a player.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It can be, but here&amp;#39;s the crucial thing: what is the &amp;quot;super cautious&amp;quot; thing to do when your house is burning down with you in it and someone has a gun aimed at your friend&amp;#39;s head?&lt;/p&gt;\n\n&lt;p&gt;The reason super cautious play is fine in PbtA games is the other thing that triggers GM moves: every time the players look to you to see what happens next. And this isn&amp;#39;t an &lt;em&gt;option&lt;/em&gt; to make a GM move, it&amp;#39;s an obligation. The more passive the players are being, the more shit the rules end up giving them to deal with. If you don&amp;#39;t go looking for trouble, that&amp;#39;s fine - trouble is going to come looking for you. Think of the stereotypical prison plot where the guy goes in, decides he&amp;#39;s going to keep to himself and not get involved in any drama, and then discovers that the other people are going to decide to involve him whether he wants it or not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg81vqq", "score_hidden": false, "stickied": false, "created": 1492139406.0, "created_utc": 1492110606.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg81xr3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "foxsable", "parent_id": "t1_dg81pa7", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "No, given the information about the system, it sounds like you and your group are playing as you are supposed to in the system, and your only disconnect is \"trying hard roles\" and the like, which is more specific than I was shooting for. I appreciate all the explanations, my writeup was good, I think, if you were in a more typical system... which you are not :-)\n\nMy experience with that kind of thing was in AD&amp;D (or one of the variations) where i was playing with a group where illusions were everywhere, and everything was trapped, so exploring a dungeon became super tedious rather than fun. My style and group has changed a lot since then. Not really appropriate to your setting, it sounds like. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, given the information about the system, it sounds like you and your group are playing as you are supposed to in the system, and your only disconnect is &amp;quot;trying hard roles&amp;quot; and the like, which is more specific than I was shooting for. I appreciate all the explanations, my writeup was good, I think, if you were in a more typical system... which you are not :-)&lt;/p&gt;\n\n&lt;p&gt;My experience with that kind of thing was in AD&amp;amp;D (or one of the variations) where i was playing with a group where illusions were everywhere, and everything was trapped, so exploring a dungeon became super tedious rather than fun. My style and group has changed a lot since then. Not really appropriate to your setting, it sounds like. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg81xr3", "score_hidden": false, "stickied": false, "created": 1492139466.0, "created_utc": 1492110666.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg9bicg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SwiftOneSpeaks", "parent_id": "t1_dg9b8s8", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; Should things like #CandyLand clearly explain how it isn't a wargame?\n\nWow, thanks for taking the time to write to tell me how much you think I suck and either can't follow the rules or am playing the wrong game.   That was really insightful and helpful.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Should things like #CandyLand clearly explain how it isn&amp;#39;t a wargame?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wow, thanks for taking the time to write to tell me how much you think I suck and either can&amp;#39;t follow the rules or am playing the wrong game.   That was really insightful and helpful.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9bicg", "score_hidden": false, "stickied": false, "created": 1492214401.0, "created_utc": 1492185601.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9b8s8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anon_adderlan", "parent_id": "t1_dg81pa7", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; I'm focused on how the game has expectations, my group has expectations, but it's never called out that these expectations are different. \n\nAgain, it's not necessary *if you're following the rules*. And how many different expectations should be called out? Should things like \\#CandyLand clearly explain how it isn't a wargame?\n\nI think you'll find that if you just follow the rules then the only problem you'll encounter is an unwillingness to engage. And if you encounter that, then it's time to find another game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m focused on how the game has expectations, my group has expectations, but it&amp;#39;s never called out that these expectations are different. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again, it&amp;#39;s not necessary &lt;em&gt;if you&amp;#39;re following the rules&lt;/em&gt;. And how many different expectations should be called out? Should things like #CandyLand clearly explain how it isn&amp;#39;t a wargame?&lt;/p&gt;\n\n&lt;p&gt;I think you&amp;#39;ll find that if you just follow the rules then the only problem you&amp;#39;ll encounter is an unwillingness to engage. And if you encounter that, then it&amp;#39;s time to find another game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9b8s8", "score_hidden": false, "stickied": false, "created": 1492214095.0, "created_utc": 1492185295.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81pa7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SwiftOneSpeaks", "parent_id": "t1_dg80tdu", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "OP here: I'm not (yet) addressing if this is a good system for us (though I think it totally can be).   I'm focused on how the game has expectations, my group has expectations, but it's never called out that these expectations are different.  Which means either failing to call that out is a huge hole, or that my group is weird.\n\nAlso:\n\n&gt; you have to bend reality kind of hard as a Storyteller in that system by means of the rules, and that is correct playing. And super cautious play is the correct way to play as a player.\n\nI'm not sure that's a good summary.  Fate, for example, prides itself on modeling FICTION as opposed to being REALISTIC.  And that can be a lot of fun.   Fate also has a similar concept: only roll when the results of BOTH success and failure are interesting.   PbtA* has both those concepts, it just changes it up by saying \"sometimes you don't want to autodeclare success, so when we have a roll, we can bring in an interesting failure\".  But then, I'm still getting a strong grasp on PbtA, so I may be giving it too much/too little credit.\n\n* PbtA is a really a set of concepts, and every game that implements deviates and changes, so as far as I can tell you can only say so much about PbtA generically, otherwise you have to be speaking of an implementation.   This is similar to, but more extreme than, how Fate games tend to implement different skills and add different concepts (Venture City vs Acthung Cthulhu vs Eclipse Phase).  As far as I can tell, Urban Shadows is not The Sprawl is not Worlds In Peril is not Apocalypse World 2nd is not Uncharted Worlds.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP here: I&amp;#39;m not (yet) addressing if this is a good system for us (though I think it totally can be).   I&amp;#39;m focused on how the game has expectations, my group has expectations, but it&amp;#39;s never called out that these expectations are different.  Which means either failing to call that out is a huge hole, or that my group is weird.&lt;/p&gt;\n\n&lt;p&gt;Also:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;you have to bend reality kind of hard as a Storyteller in that system by means of the rules, and that is correct playing. And super cautious play is the correct way to play as a player.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not sure that&amp;#39;s a good summary.  Fate, for example, prides itself on modeling FICTION as opposed to being REALISTIC.  And that can be a lot of fun.   Fate also has a similar concept: only roll when the results of BOTH success and failure are interesting.   PbtA* has both those concepts, it just changes it up by saying &amp;quot;sometimes you don&amp;#39;t want to autodeclare success, so when we have a roll, we can bring in an interesting failure&amp;quot;.  But then, I&amp;#39;m still getting a strong grasp on PbtA, so I may be giving it too much/too little credit.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;PbtA is a really a set of concepts, and every game that implements deviates and changes, so as far as I can tell you can only say so much about PbtA generically, otherwise you have to be speaking of an implementation.   This is similar to, but more extreme than, how Fate games tend to implement different skills and add different concepts (Venture City vs Acthung Cthulhu vs Eclipse Phase).  As far as I can tell, Urban Shadows is not The Sprawl is not Worlds In Peril is not Apocalypse World 2nd is not Uncharted Worlds.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg81pa7", "score_hidden": false, "stickied": false, "created": 1492139208.0, "created_utc": 1492110408.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80tdu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "foxsable", "parent_id": "t1_dg80lks", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Wow.. I had no idea it was that different. So, really, you have to bend reality kind of hard as a Storyteller in that system by means of the rules, and that is correct playing. And super cautious play is the correct way to play as a player. \n\nOkay, so doesn't sound like that is a system for me. But perhaps it is not for OP's group either? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow.. I had no idea it was that different. So, really, you have to bend reality kind of hard as a Storyteller in that system by means of the rules, and that is correct playing. And super cautious play is the correct way to play as a player. &lt;/p&gt;\n\n&lt;p&gt;Okay, so doesn&amp;#39;t sound like that is a system for me. But perhaps it is not for OP&amp;#39;s group either? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg80tdu", "score_hidden": false, "stickied": false, "created": 1492138245.0, "created_utc": 1492109445.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80lks", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "M0dusPwnens", "parent_id": "t1_dg7zmr9", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; Okay, I'm not familiar with PbtA specifically, but it sounds like you need some sort of initiative system.\n\nAlmost all PbtA games specifically, explicitly do not have initiative systems. Adding an initiative system would be a *gigantic* deviation from the style of the game and really hurts the designed interplay between the PC and GM rules.\n\n&gt; shouldn't fail an encounter\n\nMost PbtA games don't really have the more discretized \"encounters\" in the sense of something like D&amp;D, but even when they come closer to that, the person escaping in your example is probably not a possible outcome if the GM is playing according to the rules. The rules in PbtA games literally have a list of the things a GM is allowed to do in response to a failed roll (either the move itself says what happens on a failed roll, or, more likely, you make a GM Move, which is a list of things like \"put them in a spot\", \"do damage to them\", \"use up their resources\", etc.). The GM moves are designed such that \"you failed a roll to catch the bad guy, so the bad guy gets away, and there's nothing you can do to follow up in any meaningful way\" generally just isn't one of the outcomes you're allowed. The GM rules basically give you a license to make things happen, but they avoid the pitfalls that creates in other games by making it a restricted license that only allows for certain kinds of things that generally move things forward rather than just stymieing the players' efforts.\n\n&gt; I'm going to start trying to \"powergame\" situations because I know if I fail a roll my agency is challenged.\n\nThis is how you're intended to play PbtA games. The possibilities for \"powergaming\" are pretty limited, and you're definitely expected to take advantage of them as much as you possibly can. And the downside to failing rolls is almost always some loss of agency. If you fail to capture a guy, you *fail to capture him* - it never just means \"you failed so nothing happens\". Every roll moves things forward. Every roll means something happens. If you fail a roll to pick a lock, something happens (maybe an alarm sounds, or maybe the door unlocks from the other side and swings open leaving the party face to face with the guards) - it isn't just that the lock is unpicked.\n\nThe flipside is that there's one other situation where you lose agency: when you do nothing. This *also* triggers a GM move. Passive play will very quickly present you with complications that you need to actively deal with when you're GMing according to the rules.\n\nIn general, I think this is a really, really hard question to answer without familiarity with PbtA stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Okay, I&amp;#39;m not familiar with PbtA specifically, but it sounds like you need some sort of initiative system.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Almost all PbtA games specifically, explicitly do not have initiative systems. Adding an initiative system would be a &lt;em&gt;gigantic&lt;/em&gt; deviation from the style of the game and really hurts the designed interplay between the PC and GM rules.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;shouldn&amp;#39;t fail an encounter&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Most PbtA games don&amp;#39;t really have the more discretized &amp;quot;encounters&amp;quot; in the sense of something like D&amp;amp;D, but even when they come closer to that, the person escaping in your example is probably not a possible outcome if the GM is playing according to the rules. The rules in PbtA games literally have a list of the things a GM is allowed to do in response to a failed roll (either the move itself says what happens on a failed roll, or, more likely, you make a GM Move, which is a list of things like &amp;quot;put them in a spot&amp;quot;, &amp;quot;do damage to them&amp;quot;, &amp;quot;use up their resources&amp;quot;, etc.). The GM moves are designed such that &amp;quot;you failed a roll to catch the bad guy, so the bad guy gets away, and there&amp;#39;s nothing you can do to follow up in any meaningful way&amp;quot; generally just isn&amp;#39;t one of the outcomes you&amp;#39;re allowed. The GM rules basically give you a license to make things happen, but they avoid the pitfalls that creates in other games by making it a restricted license that only allows for certain kinds of things that generally move things forward rather than just stymieing the players&amp;#39; efforts.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m going to start trying to &amp;quot;powergame&amp;quot; situations because I know if I fail a roll my agency is challenged.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is how you&amp;#39;re intended to play PbtA games. The possibilities for &amp;quot;powergaming&amp;quot; are pretty limited, and you&amp;#39;re definitely expected to take advantage of them as much as you possibly can. And the downside to failing rolls is almost always some loss of agency. If you fail to capture a guy, you &lt;em&gt;fail to capture him&lt;/em&gt; - it never just means &amp;quot;you failed so nothing happens&amp;quot;. Every roll moves things forward. Every roll means something happens. If you fail a roll to pick a lock, something happens (maybe an alarm sounds, or maybe the door unlocks from the other side and swings open leaving the party face to face with the guards) - it isn&amp;#39;t just that the lock is unpicked.&lt;/p&gt;\n\n&lt;p&gt;The flipside is that there&amp;#39;s one other situation where you lose agency: when you do nothing. This &lt;em&gt;also&lt;/em&gt; triggers a GM move. Passive play will very quickly present you with complications that you need to actively deal with when you&amp;#39;re GMing according to the rules.&lt;/p&gt;\n\n&lt;p&gt;In general, I think this is a really, really hard question to answer without familiarity with PbtA stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg80lks", "score_hidden": false, "stickied": false, "created": 1492138015.0, "created_utc": 1492109215.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7zmr9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "foxsable", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Okay, I'm not familiar with PbtA specifically, but it sounds like you need some sort of initiative system. Whether it is fate's \"ST decides who goes first and then that person decides who goes next\" or something. That way, it doesn't matter who shouts out what, things happen on their turn. \n\nNow I'm going to try to take this from your player's perspective, or my perspective if I was one of your players...\n\nThat said, failing one roll, particularly the first one, shouldn't fail an encounter. If player 1 made the grab, figure out if player 2 goes next or if it is NOTGREG. If it is NOTGREG, then they can move their allotted movement. If movement rate moves them not a specific distance but to the next area \"Outside\", that's fine, Player 2 can also go through the window (move outside) and pursue. \n\nOf course your players want to grab him. They did one thing, and then he magically escapes? That's not fun. Unless it is designed that way, in which case the roll to grab him maybe shouldn't have occurred? \n\nAnd if this scenario plays out more than once, I'm going to be frustrated as a player. I'm going to start trying to \"powergame\" situations because I know if I fail a roll my agency is challenged. So when your players are avoiding doing things WAY TOO SIMPLE, it is probably because if they don't, they fail a roll, and they have wasted the scene. But... if they sit outside, figure out where everything in the room is, when they get inside, there are no surprises that cause them to fail. \n\nIf I can generalize, it sounds like both you, and they, have sort of lost the trust. And that might not be your fault... Some of them may have played with other ST's who were worse and railroaded and pulled Dues Ex Machina out and maybe even caused a party wipe. -- So to you, Bad guy jumps out window to fly away is normal because that is what he would want to do... But to them, that is \"there goes ST doing it again, invincible badguy escapes again\". \n\nBut, IMO, anything that could happen, should be possible to happen. If someone in a movie tried to grab someone and failed, that person might try to escape, but they might try to catch them, these could happen. As a ST your job is to make sure it's possible, and you do that by thinking of the angles... why was NOTGREG here. How did he get in here? Does he know people are coming? Does he know who these people are and that they can't simply fly after him? Does he know whether or not he can \"take\" them? \n\nMaybe PbtA is even more rules light than Fate, but in our fate game, I imagine three \"scenes\", hallway, room, outside. So player 1 goes first, they try to grab, fails. So NOTGREG goes next, and chooses to move to outside, spreads wings, etc. He can do that in one action, so no player yelling \"I grab him\" is relevant. Player 2 can now decide what to do. Maybe they jump out the window and try to tackle him out of the air? Maybe they shoot at him? Lots of options. And that sort of thing might help rebuild trust? \n\nsorry if that was a ramble! Anything resonate?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, I&amp;#39;m not familiar with PbtA specifically, but it sounds like you need some sort of initiative system. Whether it is fate&amp;#39;s &amp;quot;ST decides who goes first and then that person decides who goes next&amp;quot; or something. That way, it doesn&amp;#39;t matter who shouts out what, things happen on their turn. &lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m going to try to take this from your player&amp;#39;s perspective, or my perspective if I was one of your players...&lt;/p&gt;\n\n&lt;p&gt;That said, failing one roll, particularly the first one, shouldn&amp;#39;t fail an encounter. If player 1 made the grab, figure out if player 2 goes next or if it is NOTGREG. If it is NOTGREG, then they can move their allotted movement. If movement rate moves them not a specific distance but to the next area &amp;quot;Outside&amp;quot;, that&amp;#39;s fine, Player 2 can also go through the window (move outside) and pursue. &lt;/p&gt;\n\n&lt;p&gt;Of course your players want to grab him. They did one thing, and then he magically escapes? That&amp;#39;s not fun. Unless it is designed that way, in which case the roll to grab him maybe shouldn&amp;#39;t have occurred? &lt;/p&gt;\n\n&lt;p&gt;And if this scenario plays out more than once, I&amp;#39;m going to be frustrated as a player. I&amp;#39;m going to start trying to &amp;quot;powergame&amp;quot; situations because I know if I fail a roll my agency is challenged. So when your players are avoiding doing things WAY TOO SIMPLE, it is probably because if they don&amp;#39;t, they fail a roll, and they have wasted the scene. But... if they sit outside, figure out where everything in the room is, when they get inside, there are no surprises that cause them to fail. &lt;/p&gt;\n\n&lt;p&gt;If I can generalize, it sounds like both you, and they, have sort of lost the trust. And that might not be your fault... Some of them may have played with other ST&amp;#39;s who were worse and railroaded and pulled Dues Ex Machina out and maybe even caused a party wipe. -- So to you, Bad guy jumps out window to fly away is normal because that is what he would want to do... But to them, that is &amp;quot;there goes ST doing it again, invincible badguy escapes again&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;But, IMO, anything that could happen, should be possible to happen. If someone in a movie tried to grab someone and failed, that person might try to escape, but they might try to catch them, these could happen. As a ST your job is to make sure it&amp;#39;s possible, and you do that by thinking of the angles... why was NOTGREG here. How did he get in here? Does he know people are coming? Does he know who these people are and that they can&amp;#39;t simply fly after him? Does he know whether or not he can &amp;quot;take&amp;quot; them? &lt;/p&gt;\n\n&lt;p&gt;Maybe PbtA is even more rules light than Fate, but in our fate game, I imagine three &amp;quot;scenes&amp;quot;, hallway, room, outside. So player 1 goes first, they try to grab, fails. So NOTGREG goes next, and chooses to move to outside, spreads wings, etc. He can do that in one action, so no player yelling &amp;quot;I grab him&amp;quot; is relevant. Player 2 can now decide what to do. Maybe they jump out the window and try to tackle him out of the air? Maybe they shoot at him? Lots of options. And that sort of thing might help rebuild trust? &lt;/p&gt;\n\n&lt;p&gt;sorry if that was a ramble! Anything resonate?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg7zmr9", "score_hidden": false, "stickied": false, "created": 1492136970.0, "created_utc": 1492108170.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg9t8np", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "12_bowls_of_chowder", "parent_id": "t1_dg9stmf", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Oh, wow. I totally thought you wrote that you played Monsterhearts when you wrote Monster of the Week.\n\nHaving run MotW I totally agree with all you said. I really wanted a PbtA game and my players really wanted Buffyverse. MotW seemed like the perfect fit but it was hard. I think I could run it now that I have more experience but I think other systems would generally work better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, wow. I totally thought you wrote that you played Monsterhearts when you wrote Monster of the Week.&lt;/p&gt;\n\n&lt;p&gt;Having run MotW I totally agree with all you said. I really wanted a PbtA game and my players really wanted Buffyverse. MotW seemed like the perfect fit but it was hard. I think I could run it now that I have more experience but I think other systems would generally work better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9t8np", "score_hidden": false, "stickied": false, "created": 1492235467.0, "created_utc": 1492206667.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9stmf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FourOfPipes", "parent_id": "t1_dg9reaq", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I've never played Monsterhearts, so I can't speak to the specifics of that system.  I wouldn't be surprised if there are similar mechanics though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never played Monsterhearts, so I can&amp;#39;t speak to the specifics of that system.  I wouldn&amp;#39;t be surprised if there are similar mechanics though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9stmf", "score_hidden": false, "stickied": false, "created": 1492234932.0, "created_utc": 1492206132.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9reaq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "12_bowls_of_chowder", "parent_id": "t1_dg9oro3", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Sounds like it shares a lot of the same issues as Monster of the Week and Dungeon World. I've run both of those so I think I'm prepared.\n\nIs the balance issue in Monsterhearts as obvious as it is in MotW?\n\nDoes the Monsterhearts expect you to plan the Chosen One's destiny in advance? That seems like the sort of thing to figure out in play.\n\nAs for Druids and Teleporters I have some experience. It can get annoying trying to come up with moves related to the failure. I just drop any pretense with the connection and go for it. \n\nPlayer: \"I teleport to the nightclub.\" Rolls a 6. \nMe: \"What does that look like?\"\nPlayer: \"I fade out for a moment and then pop back into reality. It feels like something is blocking me.\"\nMe: \"Perfect. So Xander your eyes flutter open. It looks like you're on the floor in a men's room somewhere. Something slithers in the shadow behind a nearby toilet. What do you do?\"\n\nIs it fair that Player1's careless use of teleporting just got Xander captured?\n Maybe not but I don't care. And his player is usually happy to have the spotlight.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like it shares a lot of the same issues as Monster of the Week and Dungeon World. I&amp;#39;ve run both of those so I think I&amp;#39;m prepared.&lt;/p&gt;\n\n&lt;p&gt;Is the balance issue in Monsterhearts as obvious as it is in MotW?&lt;/p&gt;\n\n&lt;p&gt;Does the Monsterhearts expect you to plan the Chosen One&amp;#39;s destiny in advance? That seems like the sort of thing to figure out in play.&lt;/p&gt;\n\n&lt;p&gt;As for Druids and Teleporters I have some experience. It can get annoying trying to come up with moves related to the failure. I just drop any pretense with the connection and go for it. &lt;/p&gt;\n\n&lt;p&gt;Player: &amp;quot;I teleport to the nightclub.&amp;quot; Rolls a 6. \nMe: &amp;quot;What does that look like?&amp;quot;\nPlayer: &amp;quot;I fade out for a moment and then pop back into reality. It feels like something is blocking me.&amp;quot;\nMe: &amp;quot;Perfect. So Xander your eyes flutter open. It looks like you&amp;#39;re on the floor in a men&amp;#39;s room somewhere. Something slithers in the shadow behind a nearby toilet. What do you do?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Is it fair that Player1&amp;#39;s careless use of teleporting just got Xander captured?\n Maybe not but I don&amp;#39;t care. And his player is usually happy to have the spotlight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9reaq", "score_hidden": false, "stickied": false, "created": 1492233112.0, "created_utc": 1492204312.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9oro3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FourOfPipes", "parent_id": "t1_dg9irg9", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "1.  The first few sessions I was running the naive mashup of D&amp;D and PbtA that was absolutely awful.  So, don't do that.\n\n2.  The balance of Monster of the Week is awful.  One of my players ended up being able to deal 4-6 damage per attack with the ability to attack twice per turn, while another capped out at 3 damage.  There were no monsters that were an interesting challenge to the first that the second could even scratch.  Be very willing to nerf moves from, or completely veto access to \"expansion\" playbooks.\n\n3.  There are a lot of moves that require a lot of the GM.  One of my players was a chosen one, and before every session he'd roll to find out what he'd learn about his secret destiny.  I had a good secret destiny planned out for him, but it was incredibly hard to shoehorn a revelation about it of a random tone into every single session.  Combine this with someone with a secret agenda that sometimes runs contrary to the party, or an avatar of the apocalypse that's nearly invincible but might randomly go evil, and it takes a lot of improvisation to end up with a session that's coherent.\n\n4.  The system is unreasonably wedded to it's 3 outcome dice system.  I cannot figure out why Dungeon World requires a Druid to roll every single time they transform, for example.  \"Hold\" is a perfectly good mechanic; they should make more use of it.  Take note of your players' moves, and come up with a stock of negative consequences to inflict when they start failing so you're not stuck improvising 4 negative consequences to the exactly same failed ability one after another.  For example, one of my characters could teleport.  There's not really any negative consequences to constantly teleporting that can't also be fixed by teleporting unless you're willing to invent a whole system that explains how the teleporting works and extrapolate things out of that.  That meant that the less well described the character was, the more powerful it was.  I had to start imposing arbitrary restrictions on teleporting, or having it stop working for periods of time, etc.  Eventually I just had him pick a new move.\n\nAt the end of the day, we told a good story and had some good times.  But, man, it would have been way easier to do in almost any other system.  The playbooks are very inspiring because they really nail the characters that people want to play in that genre.  If you want my honest opinion, you should use the playbooks for inspiration and then use a different system to make and play the characters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;The first few sessions I was running the naive mashup of D&amp;amp;D and PbtA that was absolutely awful.  So, don&amp;#39;t do that.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The balance of Monster of the Week is awful.  One of my players ended up being able to deal 4-6 damage per attack with the ability to attack twice per turn, while another capped out at 3 damage.  There were no monsters that were an interesting challenge to the first that the second could even scratch.  Be very willing to nerf moves from, or completely veto access to &amp;quot;expansion&amp;quot; playbooks.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There are a lot of moves that require a lot of the GM.  One of my players was a chosen one, and before every session he&amp;#39;d roll to find out what he&amp;#39;d learn about his secret destiny.  I had a good secret destiny planned out for him, but it was incredibly hard to shoehorn a revelation about it of a random tone into every single session.  Combine this with someone with a secret agenda that sometimes runs contrary to the party, or an avatar of the apocalypse that&amp;#39;s nearly invincible but might randomly go evil, and it takes a lot of improvisation to end up with a session that&amp;#39;s coherent.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The system is unreasonably wedded to it&amp;#39;s 3 outcome dice system.  I cannot figure out why Dungeon World requires a Druid to roll every single time they transform, for example.  &amp;quot;Hold&amp;quot; is a perfectly good mechanic; they should make more use of it.  Take note of your players&amp;#39; moves, and come up with a stock of negative consequences to inflict when they start failing so you&amp;#39;re not stuck improvising 4 negative consequences to the exactly same failed ability one after another.  For example, one of my characters could teleport.  There&amp;#39;s not really any negative consequences to constantly teleporting that can&amp;#39;t also be fixed by teleporting unless you&amp;#39;re willing to invent a whole system that explains how the teleporting works and extrapolate things out of that.  That meant that the less well described the character was, the more powerful it was.  I had to start imposing arbitrary restrictions on teleporting, or having it stop working for periods of time, etc.  Eventually I just had him pick a new move.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;At the end of the day, we told a good story and had some good times.  But, man, it would have been way easier to do in almost any other system.  The playbooks are very inspiring because they really nail the characters that people want to play in that genre.  If you want my honest opinion, you should use the playbooks for inspiration and then use a different system to make and play the characters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9oro3", "score_hidden": false, "stickied": false, "created": 1492229898.0, "created_utc": 1492201098.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9irg9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "12_bowls_of_chowder", "parent_id": "t1_dg8st4c", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; I hated running it, but my players had a good time.\n\nCan you please share more about this? I'm thinking of starting a Monsterhearts game when 2nd edition drops. \n\nWhat made you hate running it? Is there anything you could change if you ran it again to like it more?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I hated running it, but my players had a good time.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Can you please share more about this? I&amp;#39;m thinking of starting a Monsterhearts game when 2nd edition drops. &lt;/p&gt;\n\n&lt;p&gt;What made you hate running it? Is there anything you could change if you ran it again to like it more?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9irg9", "score_hidden": false, "stickied": false, "created": 1492222676.0, "created_utc": 1492193876.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8st4c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FourOfPipes", "parent_id": "t1_dg8npq7", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Most of my experience of PtbA comes from Monster of the Week, which does a pretty good job of replicating the feeling of a serialized monster hunting TV show with a somewhat coherent plot.  I hated running it, but my players had a good time.\n\nIn my opinion, D&amp;D is the most obvious way of making a roleplaying game about High Fantasy, and once you've played it, it's hard to unlearn what it shows you.  That doesn't make it good, just memetically impactful.  I've run some good games in D&amp;D too (particularly 5th edition) but I found it mechanically very restraining.\n\nFATE is the best general purpose system I've found so far, but that's because I like the narrative/storytelling aspect of RPGs far above everything else.  The fact that FATE doesn't have very strong character progression or loot bothers some of my players.  Keep trying different systems; I'm sure you'll find one you like.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most of my experience of PtbA comes from Monster of the Week, which does a pretty good job of replicating the feeling of a serialized monster hunting TV show with a somewhat coherent plot.  I hated running it, but my players had a good time.&lt;/p&gt;\n\n&lt;p&gt;In my opinion, D&amp;amp;D is the most obvious way of making a roleplaying game about High Fantasy, and once you&amp;#39;ve played it, it&amp;#39;s hard to unlearn what it shows you.  That doesn&amp;#39;t make it good, just memetically impactful.  I&amp;#39;ve run some good games in D&amp;amp;D too (particularly 5th edition) but I found it mechanically very restraining.&lt;/p&gt;\n\n&lt;p&gt;FATE is the best general purpose system I&amp;#39;ve found so far, but that&amp;#39;s because I like the narrative/storytelling aspect of RPGs far above everything else.  The fact that FATE doesn&amp;#39;t have very strong character progression or loot bothers some of my players.  Keep trying different systems; I&amp;#39;m sure you&amp;#39;ll find one you like.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8st4c", "score_hidden": false, "stickied": false, "created": 1492175704.0, "created_utc": 1492146904.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8npq7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SwiftOneSpeaks", "parent_id": "t1_dg8d326", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "That's interesting, because I have very similar dislikes, but in the reverse.  \"Traditional\" initiative systems tend to give players way too much time to react, way too perfect information, and way too much happening during a turn.   In D&amp;D, I can spit at you and run 30(!) feet away while drawing a weapon.  30 feet is huge!  that's running from my front yard to my back yard before I can react at all.\n\nThe flip side is to go super granular, like GURPS initiative.  That tends to resolve my complaints about allowing too much to happen, but at the cost of being somewhat tedious.  \n\nI can't say anything for/against PbtA yet, I want to give it a fair shake.   I think you are correct that there are a lot of implied rules inside and around the moves, but at the same time whether that is good/bad depends on how well they work to match fictional expectations, and if they generate satisfying story.  I'll have to see, but not matching the expectations we've had from other RPGs is not necessarily bad.   \n\nI have a standing, um, \"discussion\" with some of my friends about whether D&amp;D is a good intro game or not.   They think it's simple, I think it's simple only after you learn a lot of potentially bad habits, and as D&amp;D exists well towards one side of the RPG spectrum, I feel it puts those new players very far away from some other styles that may match them better.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s interesting, because I have very similar dislikes, but in the reverse.  &amp;quot;Traditional&amp;quot; initiative systems tend to give players way too much time to react, way too perfect information, and way too much happening during a turn.   In D&amp;amp;D, I can spit at you and run 30(!) feet away while drawing a weapon.  30 feet is huge!  that&amp;#39;s running from my front yard to my back yard before I can react at all.&lt;/p&gt;\n\n&lt;p&gt;The flip side is to go super granular, like GURPS initiative.  That tends to resolve my complaints about allowing too much to happen, but at the cost of being somewhat tedious.  &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t say anything for/against PbtA yet, I want to give it a fair shake.   I think you are correct that there are a lot of implied rules inside and around the moves, but at the same time whether that is good/bad depends on how well they work to match fictional expectations, and if they generate satisfying story.  I&amp;#39;ll have to see, but not matching the expectations we&amp;#39;ve had from other RPGs is not necessarily bad.   &lt;/p&gt;\n\n&lt;p&gt;I have a standing, um, &amp;quot;discussion&amp;quot; with some of my friends about whether D&amp;amp;D is a good intro game or not.   They think it&amp;#39;s simple, I think it&amp;#39;s simple only after you learn a lot of potentially bad habits, and as D&amp;amp;D exists well towards one side of the RPG spectrum, I feel it puts those new players very far away from some other styles that may match them better.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8npq7", "score_hidden": false, "stickied": false, "created": 1492167230.0, "created_utc": 1492138430.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dga55ud", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FourOfPipes", "parent_id": "t1_dg9x0to", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "When I play games with mechanics that correspond to things that are happening in the game world, when I master the system it feels less and less mechanical.  I can describe any event that happens in terms of the system.  PbtA gives me the exact opposite feeling.  The game world, or fiction if you perfer, only exists as an extension of the mechanics instead of being described by them.  It always feels intensely mechanical, to the point it's more like a choose your own adventure book than an rpg.\n\nI mean, you do you, if you're having fun you're doing rpgs right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I play games with mechanics that correspond to things that are happening in the game world, when I master the system it feels less and less mechanical.  I can describe any event that happens in terms of the system.  PbtA gives me the exact opposite feeling.  The game world, or fiction if you perfer, only exists as an extension of the mechanics instead of being described by them.  It always feels intensely mechanical, to the point it&amp;#39;s more like a choose your own adventure book than an rpg.&lt;/p&gt;\n\n&lt;p&gt;I mean, you do you, if you&amp;#39;re having fun you&amp;#39;re doing rpgs right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dga55ud", "score_hidden": false, "stickied": false, "created": 1492251555.0, "created_utc": 1492222755.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9x0to", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "larrynom", "parent_id": "t1_dg9fmir", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt;Example: You're playing Dungeon World. The party is fighting a Druid and his 3 pet wolves. A character attacks the Druid and fails. The GM says that this failure is a result of a wolf launching a surprise attack from behind, and biting into the attacking player's leg. It's very logical to want to roll Defy Danger here, but you can't. If you encountered a wild wolf and it tried to bite you from behind, you'd be able to roll Defy Danger to avoid it.   \n  \nIn this situation, the player has the option of either defying the danger of the wolves, or going straight into attacking the druid.  \nThe player doesn't get to defy danger because mechanically it's happened already as a consequence for missing, and narrativly because they were doing something else instead.  \n  \n&gt;GM moves are incredibly difficult to remember because they're very close to the things I consider normal GMing. It's like someone gave me a grocery list of 12 items, let me look at it for a minute, and then started quizzing me on the order of the list. You can do it easily enough with a reference sheet or a DM screen, but the same can be said of running any complicated system.  \n  \nThe fact that the feel like normal GMing is what I like about them. It gives you rules for what you should do without feeling mechanical.  \nAW moves don't feel any more like a shopping list than D&amp;D monster stat blocks or rules for grappled/incapacitated/prone/whatever do.\n  \n&gt; The difference between D&amp;D and PbtA is that D&amp;D has rules that correspond to actions that characters attempt. PbtA has rules that correspond to narrative outcomes that players want.  \n  \n\nThat's a fairly good description of what a fiction-first game is, yes.  \nIf you like that play AW or one of it's hacks, if you don't play something else. That's the way the game is designed to feel and I feel we should be able to acknowledge that it's good at producing games with that feeling even if that feeling isn't what we want personally.  \nI like both.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Example: You&amp;#39;re playing Dungeon World. The party is fighting a Druid and his 3 pet wolves. A character attacks the Druid and fails. The GM says that this failure is a result of a wolf launching a surprise attack from behind, and biting into the attacking player&amp;#39;s leg. It&amp;#39;s very logical to want to roll Defy Danger here, but you can&amp;#39;t. If you encountered a wild wolf and it tried to bite you from behind, you&amp;#39;d be able to roll Defy Danger to avoid it.   &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In this situation, the player has the option of either defying the danger of the wolves, or going straight into attacking the druid.&lt;br/&gt;\nThe player doesn&amp;#39;t get to defy danger because mechanically it&amp;#39;s happened already as a consequence for missing, and narrativly because they were doing something else instead.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;GM moves are incredibly difficult to remember because they&amp;#39;re very close to the things I consider normal GMing. It&amp;#39;s like someone gave me a grocery list of 12 items, let me look at it for a minute, and then started quizzing me on the order of the list. You can do it easily enough with a reference sheet or a DM screen, but the same can be said of running any complicated system.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The fact that the feel like normal GMing is what I like about them. It gives you rules for what you should do without feeling mechanical.&lt;br/&gt;\nAW moves don&amp;#39;t feel any more like a shopping list than D&amp;amp;D monster stat blocks or rules for grappled/incapacitated/prone/whatever do.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The difference between D&amp;amp;D and PbtA is that D&amp;amp;D has rules that correspond to actions that characters attempt. PbtA has rules that correspond to narrative outcomes that players want.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s a fairly good description of what a fiction-first game is, yes.&lt;br/&gt;\nIf you like that play AW or one of it&amp;#39;s hacks, if you don&amp;#39;t play something else. That&amp;#39;s the way the game is designed to feel and I feel we should be able to acknowledge that it&amp;#39;s good at producing games with that feeling even if that feeling isn&amp;#39;t what we want personally.&lt;br/&gt;\nI like both.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9x0to", "score_hidden": false, "stickied": false, "created": 1492240509.0, "created_utc": 1492211709.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9fmir", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FourOfPipes", "parent_id": "t1_dg90jrh", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; No? If this was dungeon world, you'd probably narrate it such that on a partial \"You hit the createatue, but one of it's allies distracts you or whatever and leaves you vulnerable to a counter attack.\" or on a miss, 'use a monster, danger, or location move' or just 'deal damage' to have one of the other creatures attack a PC.\n\nI was illustrating an easy way to misunderstand the rules.  If you take the basic assumptions of normal RPGs into PtbA, you'll quickly hit really weird situations.  You have to treat the moves as the reality warpers they are or the game doesn't work.\n\nExample: You're playing Dungeon World.  The party is fighting a Druid and his 3 pet wolves.  A character attacks the Druid and fails.  The GM says that this failure is a result of a wolf launching a surprise attack from behind, and biting into the attacking player's leg.  It's very logical to want to roll Defy Danger here, but you can't.  If you encountered a wild wolf and it tried to bite you from behind, you'd be able to roll Defy Danger to avoid it.  But here, being bitten by the wolf is the fallout from a move you already did.  A move isn't a special ability or mechanical thing a Character is doing, it's a narrative mandate.  You tried to fight and failed, so something bad is going to happen to you.  \n\nEven weirder, next turn, when you want to get away from the wolf, you'll be able to roll Defy Danger to do it, even if your Defy Danger move relies on a stat that doesn't make any sense.  Want to dodge a wolf gnawing on your leg?  You totally can.\n\n&gt; DW, has 12 GM moves and 3 times to use them and they are only a few word long. I don't think a flow chart is at all necessary.\n\nGM moves are incredibly difficult to remember because they're very close to the things I consider normal GMing.  It's like someone gave me a grocery list of 12 items, let me look at it for a minute, and then started quizzing me on the order of the list.  You can do it easily enough with a reference sheet or a DM screen, but the same can be said of running any complicated system.\n\n&gt;  Anything anyone playing does is a change to to the game state, and if you treat the world like a character then the GM deciding what happens in the world isn't any more fiat than deciding what an NPC would do in D&amp;D.\n\nThe difference between D&amp;D and PbtA is that D&amp;D has rules that correspond to actions that characters attempt.  PbtA has rules that correspond to narrative outcomes that players want.  In D&amp;D, a character that steps over a pit trap will always take a Dexterity saving throw, because a dexterity saving throw is the mechanical representation of a character dodging something.  There is nothing analogous in PbtA.  Instead of focusing on individual actions, the dice decide the direction the narrative is taking, and then things just happen by fiat to support that.  This is why the rules talk so much about respecting the narrative - nothing in the mechanics respects the narrative in any way, so the GM has to do that all themselves.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;No? If this was dungeon world, you&amp;#39;d probably narrate it such that on a partial &amp;quot;You hit the createatue, but one of it&amp;#39;s allies distracts you or whatever and leaves you vulnerable to a counter attack.&amp;quot; or on a miss, &amp;#39;use a monster, danger, or location move&amp;#39; or just &amp;#39;deal damage&amp;#39; to have one of the other creatures attack a PC.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I was illustrating an easy way to misunderstand the rules.  If you take the basic assumptions of normal RPGs into PtbA, you&amp;#39;ll quickly hit really weird situations.  You have to treat the moves as the reality warpers they are or the game doesn&amp;#39;t work.&lt;/p&gt;\n\n&lt;p&gt;Example: You&amp;#39;re playing Dungeon World.  The party is fighting a Druid and his 3 pet wolves.  A character attacks the Druid and fails.  The GM says that this failure is a result of a wolf launching a surprise attack from behind, and biting into the attacking player&amp;#39;s leg.  It&amp;#39;s very logical to want to roll Defy Danger here, but you can&amp;#39;t.  If you encountered a wild wolf and it tried to bite you from behind, you&amp;#39;d be able to roll Defy Danger to avoid it.  But here, being bitten by the wolf is the fallout from a move you already did.  A move isn&amp;#39;t a special ability or mechanical thing a Character is doing, it&amp;#39;s a narrative mandate.  You tried to fight and failed, so something bad is going to happen to you.  &lt;/p&gt;\n\n&lt;p&gt;Even weirder, next turn, when you want to get away from the wolf, you&amp;#39;ll be able to roll Defy Danger to do it, even if your Defy Danger move relies on a stat that doesn&amp;#39;t make any sense.  Want to dodge a wolf gnawing on your leg?  You totally can.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;DW, has 12 GM moves and 3 times to use them and they are only a few word long. I don&amp;#39;t think a flow chart is at all necessary.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;GM moves are incredibly difficult to remember because they&amp;#39;re very close to the things I consider normal GMing.  It&amp;#39;s like someone gave me a grocery list of 12 items, let me look at it for a minute, and then started quizzing me on the order of the list.  You can do it easily enough with a reference sheet or a DM screen, but the same can be said of running any complicated system.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Anything anyone playing does is a change to to the game state, and if you treat the world like a character then the GM deciding what happens in the world isn&amp;#39;t any more fiat than deciding what an NPC would do in D&amp;amp;D.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The difference between D&amp;amp;D and PbtA is that D&amp;amp;D has rules that correspond to actions that characters attempt.  PbtA has rules that correspond to narrative outcomes that players want.  In D&amp;amp;D, a character that steps over a pit trap will always take a Dexterity saving throw, because a dexterity saving throw is the mechanical representation of a character dodging something.  There is nothing analogous in PbtA.  Instead of focusing on individual actions, the dice decide the direction the narrative is taking, and then things just happen by fiat to support that.  This is why the rules talk so much about respecting the narrative - nothing in the mechanics respects the narrative in any way, so the GM has to do that all themselves.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9fmir", "score_hidden": false, "stickied": false, "created": 1492219014.0, "created_utc": 1492190214.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90jrh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "larrynom", "parent_id": "t1_dg8d326", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt;PtbA pretends to be rules light  \n  \nI don't think I've ever seen a popular PbtA game described as rules-light by their creators. They usually describe it as fiction-first, which I think is much more fitting.  \n  \n  \n&gt;You think you understand the system, and then you get into a fight where the party tries to focus fire one bad guy and ignores the rest, so... the guy they're focusing on attacks a bunch of times and everyone else just watches?\n\nNo? If this was dungeon world, you'd probably narrate it such that on a partial \"You hit the createatue, but one of it's allies distracts you or whatever and leaves you vulnerable to a counter attack.\" or on a miss, 'use a monster, danger, or location move' or just 'deal damage' to have one of the other creatures attack a PC.   \n  \n  \n&gt;Moves are changes to the game state by fiat that you're supposed to justify via narration.  \nYou really do need to memorise the flowchart of what the GM is and isn't allowed to do, and when, in order to play this game  \n  \nDW, has 12 GM moves and 3 times to use them and they are only a few word long. I don't think a flow chart is at all necessary.  \nAnything anyone playing does is a change to to the game state, and if you treat the world like a character then the GM deciding what happens in the world isn't any more fiat than deciding what an NPC would do in D&amp;D.", "edited": 1492171289.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;PtbA pretends to be rules light  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think I&amp;#39;ve ever seen a popular PbtA game described as rules-light by their creators. They usually describe it as fiction-first, which I think is much more fitting.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You think you understand the system, and then you get into a fight where the party tries to focus fire one bad guy and ignores the rest, so... the guy they&amp;#39;re focusing on attacks a bunch of times and everyone else just watches?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No? If this was dungeon world, you&amp;#39;d probably narrate it such that on a partial &amp;quot;You hit the createatue, but one of it&amp;#39;s allies distracts you or whatever and leaves you vulnerable to a counter attack.&amp;quot; or on a miss, &amp;#39;use a monster, danger, or location move&amp;#39; or just &amp;#39;deal damage&amp;#39; to have one of the other creatures attack a PC.   &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Moves are changes to the game state by fiat that you&amp;#39;re supposed to justify via narration.&lt;br/&gt;\nYou really do need to memorise the flowchart of what the GM is and isn&amp;#39;t allowed to do, and when, in order to play this game  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;DW, has 12 GM moves and 3 times to use them and they are only a few word long. I don&amp;#39;t think a flow chart is at all necessary.&lt;br/&gt;\nAnything anyone playing does is a change to to the game state, and if you treat the world like a character then the GM deciding what happens in the world isn&amp;#39;t any more fiat than deciding what an NPC would do in D&amp;amp;D.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg90jrh", "score_hidden": false, "stickied": false, "created": 1492197240.0, "created_utc": 1492168440.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg96660", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JasonYoakam", "parent_id": "t1_dg8d326", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; At one point I was trying to have a bad guy walk away and get on a train, and something like 8 round of combat happened while he was walking up the steps.\n\nYeah, you didn't follow your GM principles.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;At one point I was trying to have a bad guy walk away and get on a train, and something like 8 round of combat happened while he was walking up the steps.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, you didn&amp;#39;t follow your GM principles.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg96660", "score_hidden": false, "stickied": false, "created": 1492207776.0, "created_utc": 1492178976.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg9hb3t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FourOfPipes", "parent_id": "t1_dg9adpn", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; Both #Rounds and #Moves are nothing more than quantums of situation resolution. \n\nYes, that's my point.  The time dilation problem comes from mixing a more familiar time abstraction with the very different one that PbtA uses.\n\n&gt;  Setting = System. And if #SpiderMan wants to swing from the rooftops while in the middle of the ocean, it ain't gonna happen no matter how hard he tries. In fact, in PtbA, he wouldn't be able to trigger that move at all. #ProblemSolved.\n\nMan, there's a lot here.  First, Setting != System.  Spiderman and Star Lord are clearly playing the same system, but not the same setting, while Spiderman and Rorschach are playing the same setting, but not the same system.  There's also at least one missing layer here, which is Genre.  It is true that some systems make mechanics that fit the genre which fits their setting, but not all of them work like that.\n\n\\#bonusedit:  the more I think about it, the more telling the omission of genre becomes.  PbtA's essential innovation was abandoning a mechanical description of the world in favor of a mechanical description of the genre.\n\nSecond, Spiderman wouldn't have a Web-Slinging move in PbtA, because that's not what moves are.  Moves are narrative mandates.  In Masks, for example, web slinging as normal probably isn't a move at all, while trying to websling somewhere very quickly probably falls under:\n\n&gt; UNLEASH YOUR POWERS\n&gt; When you unleash your powers to overcome an obstacle, reshape your environment, or extend your senses, roll + Freak. On a hit, you do it. On a 7-9, mark a condition or the GM will tell you how the effect is unstable or temporary.\n\nso Spiderman rolls Freak to get from point A to point B quickly, instead of something more logical like Dexterity.  I don't even think Dexterity has an analog in Masks, because it's so beside the point of what they're doing.\n\nThird, narrative restrictions aren't restrictions at all.  If the player playing Spiderman wants to use Unleash Your Powers to cross an ocean, he's just going to lash together branches using webbing and form a makeshift raft propelled by a spidersilk sail.\n\nI explained the difference between PbtA's outside-the-fiction moves and D&amp;D's mechanics in my reply [here.](https://www.reddit.com/r/rpg/comments/6571es/the_tyranny_of_definition/dg9fmir/) \n\n&gt; And what happens if you cast a #Fireball while underwater, or when there's lots of oxygen about? What happens when there aren't any established modifiers for these? Do they just not happen, or are the results determined by what makes sense in the fiction?\n\nYou know, I have really solid answers to these questions in every variant of a FATE, DnD, or supers games I've played.  In PbtA, I have no idea.  If you use Fireball in an oxygen rich or otherwise extremely explosive environment and roll a critical success, the rules would seem to indicate that nothing bad happens.  Good job on very carefully shaping the fireball I guess?\n\n\\#edit: #hashtags.  My #post didn't have any, so I felt #inadequate, and I'm trying to #catchup.", "edited": 1492193537.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Both #Rounds and #Moves are nothing more than quantums of situation resolution. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, that&amp;#39;s my point.  The time dilation problem comes from mixing a more familiar time abstraction with the very different one that PbtA uses.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Setting = System. And if #SpiderMan wants to swing from the rooftops while in the middle of the ocean, it ain&amp;#39;t gonna happen no matter how hard he tries. In fact, in PtbA, he wouldn&amp;#39;t be able to trigger that move at all. #ProblemSolved.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Man, there&amp;#39;s a lot here.  First, Setting != System.  Spiderman and Star Lord are clearly playing the same system, but not the same setting, while Spiderman and Rorschach are playing the same setting, but not the same system.  There&amp;#39;s also at least one missing layer here, which is Genre.  It is true that some systems make mechanics that fit the genre which fits their setting, but not all of them work like that.&lt;/p&gt;\n\n&lt;p&gt;#bonusedit:  the more I think about it, the more telling the omission of genre becomes.  PbtA&amp;#39;s essential innovation was abandoning a mechanical description of the world in favor of a mechanical description of the genre.&lt;/p&gt;\n\n&lt;p&gt;Second, Spiderman wouldn&amp;#39;t have a Web-Slinging move in PbtA, because that&amp;#39;s not what moves are.  Moves are narrative mandates.  In Masks, for example, web slinging as normal probably isn&amp;#39;t a move at all, while trying to websling somewhere very quickly probably falls under:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;UNLEASH YOUR POWERS\nWhen you unleash your powers to overcome an obstacle, reshape your environment, or extend your senses, roll + Freak. On a hit, you do it. On a 7-9, mark a condition or the GM will tell you how the effect is unstable or temporary.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;so Spiderman rolls Freak to get from point A to point B quickly, instead of something more logical like Dexterity.  I don&amp;#39;t even think Dexterity has an analog in Masks, because it&amp;#39;s so beside the point of what they&amp;#39;re doing.&lt;/p&gt;\n\n&lt;p&gt;Third, narrative restrictions aren&amp;#39;t restrictions at all.  If the player playing Spiderman wants to use Unleash Your Powers to cross an ocean, he&amp;#39;s just going to lash together branches using webbing and form a makeshift raft propelled by a spidersilk sail.&lt;/p&gt;\n\n&lt;p&gt;I explained the difference between PbtA&amp;#39;s outside-the-fiction moves and D&amp;amp;D&amp;#39;s mechanics in my reply &lt;a href=\"https://www.reddit.com/r/rpg/comments/6571es/the_tyranny_of_definition/dg9fmir/\"&gt;here.&lt;/a&gt; &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And what happens if you cast a #Fireball while underwater, or when there&amp;#39;s lots of oxygen about? What happens when there aren&amp;#39;t any established modifiers for these? Do they just not happen, or are the results determined by what makes sense in the fiction?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You know, I have really solid answers to these questions in every variant of a FATE, DnD, or supers games I&amp;#39;ve played.  In PbtA, I have no idea.  If you use Fireball in an oxygen rich or otherwise extremely explosive environment and roll a critical success, the rules would seem to indicate that nothing bad happens.  Good job on very carefully shaping the fireball I guess?&lt;/p&gt;\n\n&lt;p&gt;#edit: #hashtags.  My #post didn&amp;#39;t have any, so I felt #inadequate, and I&amp;#39;m trying to #catchup.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9hb3t", "score_hidden": false, "stickied": false, "created": 1492220967.0, "created_utc": 1492192167.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_6571es", "likes": null, "replies": "", "user_reports": [], "id": "dg9jb0e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "12_bowls_of_chowder", "parent_id": "t1_dg9adpn", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "You have some worthwhile ideas here but your presentation makes them very hard to engage with.\n\nThe main one that interests me is \"Things just never happen even if unless they don't make narrative sense.\" \n\nReading the rules it seems like the GM is supposed to pick a move that will make sense in the narrative and then make that move even if it strains verisimilitude. Would you agree?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have some worthwhile ideas here but your presentation makes them very hard to engage with.&lt;/p&gt;\n\n&lt;p&gt;The main one that interests me is &amp;quot;Things just never happen even if unless they don&amp;#39;t make narrative sense.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Reading the rules it seems like the GM is supposed to pick a move that will make sense in the narrative and then make that move even if it strains verisimilitude. Would you agree?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9jb0e", "score_hidden": false, "stickied": false, "created": 1492223320.0, "created_utc": 1492194520.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9adpn", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "anon_adderlan", "parent_id": "t1_dg8d326", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; In games with a clearly defined round concept, this doesn't happen because there's a clear sense that the bad guy gets to act once for every time the good guys act. PtbA doesn't have this. Instead, the bad guys only act in response to the good guys.\n\nBoth \\#Rounds and \\#Moves are nothing more than quantums of situation resolution. The difference is with rounds I have to determine how long an action takes, which actions are too long to resolve in a round, and what counts as a discrete action in the first place. So depending on the action, the bad guy does *not* necessarily act once for every time the good guys do, and outside combat rounds make absolutely no sense.\n\n&gt; It isn't rules light at all.\n***\n &gt; PtbA pretends to be rules light, so it catches a lot of people off guard.\n\nJust recently I dealt with a fellow who wanted to know if they should call their game 'rules lite'. I told them the term was inconsistently defined and only meaningful to a small subset of the market. In the end they decided their game was 'rules medium', which is even *less* meaningful.\n\nIn other words, those assumptions are on you.\n\n&gt; GM moves, like all moves in PtbA, are reality warping.\n\nIn which RPGs does a GM *not* have this power?\n\n&gt;Things ~~just~~ **never** happen ~~even if~~ **unless** they ~~don't~~ make narrative sense.\n\n\\#FixedYourSpelling\n\n&gt; Advocates for PbtA will argue that the rules explicitly say that moves are constrained by the fiction. Well, the rules wouldn't have to say that if moves weren't reality warping by definition.\n\nSetting = System. And if \\#SpiderMan wants to swing from the rooftops while in the middle of the ocean, it ain't gonna happen no matter how hard he tries. In fact, in PtbA, he wouldn't be able to trigger that move at all. \\#ProblemSolved.\n\n&gt; Nowhere in DnD does it say that feats or spells are constrained by the fiction, because casting a Fireball is something that exists inside the fiction and therefore can't break it by definition.\n\nAnything that exists 'inside the fiction' is by definition 'constrained by the fiction'. The only difference here is it's explicitly spelled out in the spell description rather than determined by the situation. \n\nIn fact, casting a \\#Fireball even resembles a PtbA \\#Move...\n\nWhen you Cast a Fireball\n\n* Crit Success: Do more damage\n* Success: Do damage\n* Crit Failure: Do damage to yourself or allies\n\n...and that's not even including the random \\#SpellFumble table, which is essentially a list of \\#HardMoves.\n\nAnd what happens if you cast a \\#Fireball while underwater, or when there's lots of oxygen about? What happens when there aren't any established modifiers for these? Do they just not happen, or are the results determined *by what makes sense in the fiction*?\n\nPtbA certainly has its issues, but these aren't it.\n", "edited": 1492186118.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In games with a clearly defined round concept, this doesn&amp;#39;t happen because there&amp;#39;s a clear sense that the bad guy gets to act once for every time the good guys act. PtbA doesn&amp;#39;t have this. Instead, the bad guys only act in response to the good guys.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Both #Rounds and #Moves are nothing more than quantums of situation resolution. The difference is with rounds I have to determine how long an action takes, which actions are too long to resolve in a round, and what counts as a discrete action in the first place. So depending on the action, the bad guy does &lt;em&gt;not&lt;/em&gt; necessarily act once for every time the good guys do, and outside combat rounds make absolutely no sense.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It isn&amp;#39;t rules light at all.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;PtbA pretends to be rules light, so it catches a lot of people off guard.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Just recently I dealt with a fellow who wanted to know if they should call their game &amp;#39;rules lite&amp;#39;. I told them the term was inconsistently defined and only meaningful to a small subset of the market. In the end they decided their game was &amp;#39;rules medium&amp;#39;, which is even &lt;em&gt;less&lt;/em&gt; meaningful.&lt;/p&gt;\n\n&lt;p&gt;In other words, those assumptions are on you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;GM moves, like all moves in PtbA, are reality warping.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In which RPGs does a GM &lt;em&gt;not&lt;/em&gt; have this power?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Things &lt;del&gt;just&lt;/del&gt; &lt;strong&gt;never&lt;/strong&gt; happen &lt;del&gt;even if&lt;/del&gt; &lt;strong&gt;unless&lt;/strong&gt; they &lt;del&gt;don&amp;#39;t&lt;/del&gt; make narrative sense.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;#FixedYourSpelling&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Advocates for PbtA will argue that the rules explicitly say that moves are constrained by the fiction. Well, the rules wouldn&amp;#39;t have to say that if moves weren&amp;#39;t reality warping by definition.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Setting = System. And if #SpiderMan wants to swing from the rooftops while in the middle of the ocean, it ain&amp;#39;t gonna happen no matter how hard he tries. In fact, in PtbA, he wouldn&amp;#39;t be able to trigger that move at all. #ProblemSolved.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Nowhere in DnD does it say that feats or spells are constrained by the fiction, because casting a Fireball is something that exists inside the fiction and therefore can&amp;#39;t break it by definition.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Anything that exists &amp;#39;inside the fiction&amp;#39; is by definition &amp;#39;constrained by the fiction&amp;#39;. The only difference here is it&amp;#39;s explicitly spelled out in the spell description rather than determined by the situation. &lt;/p&gt;\n\n&lt;p&gt;In fact, casting a #Fireball even resembles a PtbA #Move...&lt;/p&gt;\n\n&lt;p&gt;When you Cast a Fireball&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Crit Success: Do more damage&lt;/li&gt;\n&lt;li&gt;Success: Do damage&lt;/li&gt;\n&lt;li&gt;Crit Failure: Do damage to yourself or allies&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;...and that&amp;#39;s not even including the random #SpellFumble table, which is essentially a list of #HardMoves.&lt;/p&gt;\n\n&lt;p&gt;And what happens if you cast a #Fireball while underwater, or when there&amp;#39;s lots of oxygen about? What happens when there aren&amp;#39;t any established modifiers for these? Do they just not happen, or are the results determined &lt;em&gt;by what makes sense in the fiction&lt;/em&gt;?&lt;/p&gt;\n\n&lt;p&gt;PtbA certainly has its issues, but these aren&amp;#39;t it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9adpn", "score_hidden": false, "stickied": false, "created": 1492213098.0, "created_utc": 1492184298.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8d326", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FourOfPipes", "parent_id": "t3_6571es", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I call this the time dilation problem.  A character attempts something and fails, so I narrate what happens as a result, and they immediately try to respond to it.  At one point I was trying to have a bad guy walk away and get on a train, and something like 8 round of combat happened while he was walking up the steps.  \n\nIn games with a clearly defined round concept, this doesn't happen because there's a clear sense that the bad guy gets to act once for every time the good guys act.  PtbA doesn't have this.  Instead, the bad guys only act in response to the good guys.\n\nThis really gets at the core of why I dislike PbtA as a system.  It isn't rules light at all.  The rules aren't crunchy, in the sense that there aren't a lot of numbers being thrown around, but the GM needs to memorize and implement just as many rules as they would in the average DnD session if not more.  Worse, PtbA pretends to be rules light, so it catches a lot of people off guard.  You think you understand the system, and then you get into a fight where the party tries to focus fire one bad guy and ignores the rest, so... the guy they're focusing on attacks a bunch of times and everyone else just watches?\n\nWhen a player makes a move and fails, they haven't just tried to do something and not succeeded.  They've given the GM free license to use one of their moves.  GM moves, like all moves in PtbA, are reality warping.  Things just happen even if they don't make narrative sense.  When a character bursts into a room and tries to wrestle someone to the ground and fails, you can use any hard move you want.  You can choose to separate the party if you want.  The character grabs the bad guy, but the baddie has too much momentum going, and both characters crash through the window, leaving the location.  When the character fails the roll, you can have the bad guy escape, regardless of anything else happening in the scene.\n\nAdvocates for PbtA will argue that the rules explicitly say that moves are constrained by the fiction.  Well, the rules wouldn't have to say that if moves weren't reality warping by definition.  Nowhere in DnD does it say that feats or spells are constrained by the fiction, because casting a Fireball is something that exists inside the fiction and therefore can't break it by definition.  Moves aren't like this; they're not special abilities of Characters.  Moves are changes to the game state by fiat that you're supposed to justify via narration.\n \nYou really do need to memorize the flowchart of what the GM is and isn't allowed to do, and when, in order to play this game.  Things like Hard Moves are so similar to normal GM behavior that it's easy to forget them, and how mechanical they are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I call this the time dilation problem.  A character attempts something and fails, so I narrate what happens as a result, and they immediately try to respond to it.  At one point I was trying to have a bad guy walk away and get on a train, and something like 8 round of combat happened while he was walking up the steps.  &lt;/p&gt;\n\n&lt;p&gt;In games with a clearly defined round concept, this doesn&amp;#39;t happen because there&amp;#39;s a clear sense that the bad guy gets to act once for every time the good guys act.  PtbA doesn&amp;#39;t have this.  Instead, the bad guys only act in response to the good guys.&lt;/p&gt;\n\n&lt;p&gt;This really gets at the core of why I dislike PbtA as a system.  It isn&amp;#39;t rules light at all.  The rules aren&amp;#39;t crunchy, in the sense that there aren&amp;#39;t a lot of numbers being thrown around, but the GM needs to memorize and implement just as many rules as they would in the average DnD session if not more.  Worse, PtbA pretends to be rules light, so it catches a lot of people off guard.  You think you understand the system, and then you get into a fight where the party tries to focus fire one bad guy and ignores the rest, so... the guy they&amp;#39;re focusing on attacks a bunch of times and everyone else just watches?&lt;/p&gt;\n\n&lt;p&gt;When a player makes a move and fails, they haven&amp;#39;t just tried to do something and not succeeded.  They&amp;#39;ve given the GM free license to use one of their moves.  GM moves, like all moves in PtbA, are reality warping.  Things just happen even if they don&amp;#39;t make narrative sense.  When a character bursts into a room and tries to wrestle someone to the ground and fails, you can use any hard move you want.  You can choose to separate the party if you want.  The character grabs the bad guy, but the baddie has too much momentum going, and both characters crash through the window, leaving the location.  When the character fails the roll, you can have the bad guy escape, regardless of anything else happening in the scene.&lt;/p&gt;\n\n&lt;p&gt;Advocates for PbtA will argue that the rules explicitly say that moves are constrained by the fiction.  Well, the rules wouldn&amp;#39;t have to say that if moves weren&amp;#39;t reality warping by definition.  Nowhere in DnD does it say that feats or spells are constrained by the fiction, because casting a Fireball is something that exists inside the fiction and therefore can&amp;#39;t break it by definition.  Moves aren&amp;#39;t like this; they&amp;#39;re not special abilities of Characters.  Moves are changes to the game state by fiat that you&amp;#39;re supposed to justify via narration.&lt;/p&gt;\n\n&lt;p&gt;You really do need to memorize the flowchart of what the GM is and isn&amp;#39;t allowed to do, and when, in order to play this game.  Things like Hard Moves are so similar to normal GM behavior that it&amp;#39;s easy to forget them, and how mechanical they are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg8d326", "score_hidden": false, "stickied": false, "created": 1492152599.0, "created_utc": 1492123799.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]