[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "rpg", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First off feel free to ask a question is any part of this post is unclear.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m writing a two part role-playing game where Earth is basically a post-apocalyptic quarantine zone and, the rest of existence is an ever expanding bubble of human colonization and exploration.&lt;/p&gt;\n\n&lt;p&gt;My problem is I know I&amp;#39;m an American and well, I doubt I&amp;#39;d do other cultures justice showing how well everyone survived the transition into space. In other words, I do not want to fall into a trap shown in a lot of sci-fi where one human culture dominates space and anyone not &amp;quot;American&amp;quot; is reduced to a stereotyped character that basically pulled on a pair of blue jeans and reduced their own identity down to a funny accent when they spoke.&lt;/p&gt;\n\n&lt;p&gt;I want to at least try and show that more than one culture survived the transition into space.&lt;/p&gt;\n\n&lt;p&gt;So, anyone willing to try and help? Even if all you want to do is tell me what not to do that would be helpful.&lt;/p&gt;\n\n&lt;p&gt;Thanks y&amp;quot;all.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "First off feel free to ask a question is any part of this post is unclear.\n\nI'm writing a two part role-playing game where Earth is basically a post-apocalyptic quarantine zone and, the rest of existence is an ever expanding bubble of human colonization and exploration.\n\nMy problem is I know I'm an American and well, I doubt I'd do other cultures justice showing how well everyone survived the transition into space. In other words, I do not want to fall into a trap shown in a lot of sci-fi where one human culture dominates space and anyone not \"American\" is reduced to a stereotyped character that basically pulled on a pair of blue jeans and reduced their own identity down to a funny accent when they spoke.\n\nI want to at least try and show that more than one culture survived the transition into space.\n\nSo, anyone willing to try and help? Even if all you want to do is tell me what not to do that would be helpful.\n\nThanks y\"all.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65eimo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 27, "report_reasons": null, "author": "Seamus999", "saved": false, "mod_reports": [], "name": "t3_65eimo", "subreddit_name_prefixed": "r/rpg", "approved_by": null, "over_18": false, "domain": "self.rpg", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2s", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/rpg/comments/65eimo/generic_scifi_world_cultures_in_space/", "num_reports": null, "locked": false, "stickied": false, "created": 1492225649.0, "url": "https://www.reddit.com/r/rpg/comments/65eimo/generic_scifi_world_cultures_in_space/", "author_flair_text": null, "quarantine": false, "title": "[Generic Sci-Fi] World Cultures in Space", "created_utc": 1492196849.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": "", "user_reports": [], "id": "dg9rr89", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Seamus999", "parent_id": "t1_dg9qori", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I thought I put that into my post, sorry guess I cut it out when trying to edit on my dumb phone. As far as the fall of Earth I have the United States being hit the worst, a patches of land there being terraformed into an alien biome by probes that \"attacked\" us.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought I put that into my post, sorry guess I cut it out when trying to edit on my dumb phone. As far as the fall of Earth I have the United States being hit the worst, a patches of land there being terraformed into an alien biome by probes that &amp;quot;attacked&amp;quot; us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9rr89", "score_hidden": false, "stickied": false, "created": 1492233563.0, "created_utc": 1492204763.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9qori", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "theICEBear_dk", "parent_id": "t3_65eimo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "To be fair you could use the population counts (and the nature of your apocalypse) as a bit of a guide for which cultures you want to expand on. That will at least give you a fairer starting point. For example if all Indians die then that is a billion people off the map right that. Does it make sense that they all died if for example 500 million Europeans didn't. \n\nPersonally I'd start that way. Once you have selected the cultures (not areas) then you can dive a bit into each to avoid making them American. Most of them will have thousands of years of history and current trends for you to lean on. Also world culture is aligning somewhat because of branding, marketing, spread of cinema and the Internet. It is not unusual for some Asian people to watch TV and content that they happen to speak the language for not just American but maybe Korean as well. Europeans all are deeply versed in American TV and culture, but does not understand the drive for Independence and Individualism on the same deep level as Americans just like Americans do not have the same culture for socialization and cooperation without competition that can be seen underlying those European cultures that were forced to be like that to be able to survive their climate or have had their cultures develop in cramped tiny cities of the Dark Ages (which are different from the Modern Metroplexes of the US). There are a lot things to pull from that can make it more fun and stop worrying I doubt many will be offended since just that fact that you care means that you have a good chance of making other cultures more than a funny accent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be fair you could use the population counts (and the nature of your apocalypse) as a bit of a guide for which cultures you want to expand on. That will at least give you a fairer starting point. For example if all Indians die then that is a billion people off the map right that. Does it make sense that they all died if for example 500 million Europeans didn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;Personally I&amp;#39;d start that way. Once you have selected the cultures (not areas) then you can dive a bit into each to avoid making them American. Most of them will have thousands of years of history and current trends for you to lean on. Also world culture is aligning somewhat because of branding, marketing, spread of cinema and the Internet. It is not unusual for some Asian people to watch TV and content that they happen to speak the language for not just American but maybe Korean as well. Europeans all are deeply versed in American TV and culture, but does not understand the drive for Independence and Individualism on the same deep level as Americans just like Americans do not have the same culture for socialization and cooperation without competition that can be seen underlying those European cultures that were forced to be like that to be able to survive their climate or have had their cultures develop in cramped tiny cities of the Dark Ages (which are different from the Modern Metroplexes of the US). There are a lot things to pull from that can make it more fun and stop worrying I doubt many will be offended since just that fact that you care means that you have a good chance of making other cultures more than a funny accent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9qori", "score_hidden": false, "stickied": false, "created": 1492232221.0, "created_utc": 1492203421.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": "", "user_reports": [], "id": "dg9sxwm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jwbjerk", "parent_id": "t3_65eimo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; My problem is I know I'm an American and well, I doubt I'd do other cultures justice showing how well everyone survived the transition into space. In other words, I do not want to fall into a trap shown in a lot of sci-fi where one human culture dominates space and anyone not \"American\" is reduced to a stereotyped character that basically pulled on a pair of blue jeans and reduced their own identity down to a funny accent when they spoke.\n\nThen don't make one culture dominate. I don't think that's a very plausible future anyway, space is too big.\n\n  But there's nothing wrong with starting out an adventure in an english speaking cultural zone of space descended of western culture.  But weave in references to other zones of space founded by different languages and cultures-- trading partners, rivals, and enemies.\n\nBut don't just project the current global situation into space-- that always seems lazy and contrived.\n\nAnd add some new cultures/languages.  People keep changing, and going into space won't stop that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;My problem is I know I&amp;#39;m an American and well, I doubt I&amp;#39;d do other cultures justice showing how well everyone survived the transition into space. In other words, I do not want to fall into a trap shown in a lot of sci-fi where one human culture dominates space and anyone not &amp;quot;American&amp;quot; is reduced to a stereotyped character that basically pulled on a pair of blue jeans and reduced their own identity down to a funny accent when they spoke.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Then don&amp;#39;t make one culture dominate. I don&amp;#39;t think that&amp;#39;s a very plausible future anyway, space is too big.&lt;/p&gt;\n\n&lt;p&gt;But there&amp;#39;s nothing wrong with starting out an adventure in an english speaking cultural zone of space descended of western culture.  But weave in references to other zones of space founded by different languages and cultures-- trading partners, rivals, and enemies.&lt;/p&gt;\n\n&lt;p&gt;But don&amp;#39;t just project the current global situation into space-- that always seems lazy and contrived.&lt;/p&gt;\n\n&lt;p&gt;And add some new cultures/languages.  People keep changing, and going into space won&amp;#39;t stop that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9sxwm", "score_hidden": false, "stickied": false, "created": 1492235083.0, "created_utc": 1492206283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": "", "user_reports": [], "id": "dg9lkch", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ericvulgaris", "parent_id": "t3_65eimo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Hey thanks for trying to figure this stuff out-- it's hard but I bet your players will really like the extra attention to your portrayals! \n\nMaybe watch a few youtube videos on the history of certain religions or national histories for some context for what you want?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey thanks for trying to figure this stuff out-- it&amp;#39;s hard but I bet your players will really like the extra attention to your portrayals! &lt;/p&gt;\n\n&lt;p&gt;Maybe watch a few youtube videos on the history of certain religions or national histories for some context for what you want?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9lkch", "score_hidden": false, "stickied": false, "created": 1492226044.0, "created_utc": 1492197244.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": "", "user_reports": [], "id": "dg9rvfx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Seamus999", "parent_id": "t1_dg9rqom", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "It at least gives me some none technical reading material at the moment lol, thanks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It at least gives me some none technical reading material at the moment lol, thanks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9rvfx", "score_hidden": false, "stickied": false, "created": 1492233711.0, "created_utc": 1492204911.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rqom", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VonAether", "parent_id": "t3_65eimo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "In [Trinity](https://www.drivethrurpg.com/product/3407?affiliate_id=13), Earth is still in recovery from a devastating war with powerful mutant humans called Aberrants about 60 years ago. Some places are worse than others, but overall, it's thriving. The major exceptions are Europe -- returning Aberrants recently attacked a space station which crashed on France, scattering debris across Europe -- and the Federated States of America, who tend to focus inward rather than outward.\n\nThere are outposts throughout the solar system, and many major nations have established extrasolar colonies. The first was *Khantze Lu Ge*, established by the Chinese in Alpha Centauri. The Chinese were also first to establish contact with the *Qin*, a friendly yet enigmatic species, from a world designated *Qinshui*.\n\nThe United African Nations established a stellar science and mining station from connected asteroids just outside the Crab Nebula called the *Karoo Mining Colony* which has recently come under attack from a species dubbed the *Chromatics* due to their apparent capacity for communicating with light rather than sound. The UAN has also colonized *Far Nyumba*, the largest moon of gas giant *Mgitu*, which itself seems to have strange alien structures floating in the upper layers of its atmosphere.\n\nAlthough its sun is set to go nova within the next 1000-2000 years, Brazil established *Averiguas*, publicly as a training ground for psions, but privately as a way of protecting its future should the Aberrants return to Earth, and thus intended Averiguas to be an extrasolar military base of sorts. Unfortunately they used subjugated Euro-American workers to build the facilities, and suffering under brutal conditions, the workers staged a coup against the Brazilian leaders. A few small teams were sent in to quell the mutiny before contact was cut off; no one knows the current status of the colony.\n\nMore information on these and other colonies can be found in [Trinity Field Report: Extrasolar Colonies](http://www.drivethrurpg.com/product/3396?affiliate_id=13) and [Stellar Frontier: Psi Order Upeo wa Macho &amp; Extrasolar Space Sourcebook](http://www.drivethrurpg.com/product/3070?affiliate_id=13). This sort of thing may not be exactly what you're looking for, but I hope that helps. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In &lt;a href=\"https://www.drivethrurpg.com/product/3407?affiliate_id=13\"&gt;Trinity&lt;/a&gt;, Earth is still in recovery from a devastating war with powerful mutant humans called Aberrants about 60 years ago. Some places are worse than others, but overall, it&amp;#39;s thriving. The major exceptions are Europe -- returning Aberrants recently attacked a space station which crashed on France, scattering debris across Europe -- and the Federated States of America, who tend to focus inward rather than outward.&lt;/p&gt;\n\n&lt;p&gt;There are outposts throughout the solar system, and many major nations have established extrasolar colonies. The first was &lt;em&gt;Khantze Lu Ge&lt;/em&gt;, established by the Chinese in Alpha Centauri. The Chinese were also first to establish contact with the &lt;em&gt;Qin&lt;/em&gt;, a friendly yet enigmatic species, from a world designated &lt;em&gt;Qinshui&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;The United African Nations established a stellar science and mining station from connected asteroids just outside the Crab Nebula called the &lt;em&gt;Karoo Mining Colony&lt;/em&gt; which has recently come under attack from a species dubbed the &lt;em&gt;Chromatics&lt;/em&gt; due to their apparent capacity for communicating with light rather than sound. The UAN has also colonized &lt;em&gt;Far Nyumba&lt;/em&gt;, the largest moon of gas giant &lt;em&gt;Mgitu&lt;/em&gt;, which itself seems to have strange alien structures floating in the upper layers of its atmosphere.&lt;/p&gt;\n\n&lt;p&gt;Although its sun is set to go nova within the next 1000-2000 years, Brazil established &lt;em&gt;Averiguas&lt;/em&gt;, publicly as a training ground for psions, but privately as a way of protecting its future should the Aberrants return to Earth, and thus intended Averiguas to be an extrasolar military base of sorts. Unfortunately they used subjugated Euro-American workers to build the facilities, and suffering under brutal conditions, the workers staged a coup against the Brazilian leaders. A few small teams were sent in to quell the mutiny before contact was cut off; no one knows the current status of the colony.&lt;/p&gt;\n\n&lt;p&gt;More information on these and other colonies can be found in &lt;a href=\"http://www.drivethrurpg.com/product/3396?affiliate_id=13\"&gt;Trinity Field Report: Extrasolar Colonies&lt;/a&gt; and &lt;a href=\"http://www.drivethrurpg.com/product/3070?affiliate_id=13\"&gt;Stellar Frontier: Psi Order Upeo wa Macho &amp;amp; Extrasolar Space Sourcebook&lt;/a&gt;. This sort of thing may not be exactly what you&amp;#39;re looking for, but I hope that helps. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9rqom", "score_hidden": false, "stickied": false, "created": 1492233544.0, "created_utc": 1492204744.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": "", "user_reports": [], "id": "dg9tm2h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Seamus999", "parent_id": "t1_dg9t1em", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Thanks for the ideas, I was wresting with a few of those ideas already but, that's the fun of trying to do something different. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the ideas, I was wresting with a few of those ideas already but, that&amp;#39;s the fun of trying to do something different. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9tm2h", "score_hidden": false, "stickied": false, "created": 1492235947.0, "created_utc": 1492207147.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9t1em", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gnoxic-blue", "parent_id": "t3_65eimo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "The only help I can offer is a few points worth considering.\n\nFirstly, architecture. Obviously the technology level of the setting affects the degree to which cultural preferences  can be accomodated - if your humans don't have any kind of artifical gravity, the need to work around that will overtake everything else - but so long as you have centrifugal gravity or better, you can show things that the current culture has inherited from pre-dispora designs.\n\nFor an example of what I mean, think about housing. Some cultures tend to favour smaller cohabiting groups than others. In Britain, for example, we spend huge sums of money on buying or renting tiny new-build box homes rather in preference to living with our parents or with housemates. The same trend would probably continue on space stations: lots of very small, self-catering cabins, with only one or two occupants. Other cultures favour multigeneration cohabiting groups, with parents, grandparents and children all living in the same home. This would probably carry over to space with larger communal areas shared between a few cabins, probably with shared dining facilities.\n\nA second question is how Earth-centric cultures and religions have adapted to space. Assuming Islam is still practised in your setting, for example, how have they adapted the Qibla (the praying facing Mecca*) tradition? Do they pray facing in the direction of Earth? If so, how? On a ship or station with centrifugal gravity, the direction of Earth isn't going to be constant, it's going to move quite rapidly relative to somebody standing in the spin section. This would be solvable by putting the mosque on the central axis of the ship, so that the prayer room is in zero gravity, and worshippers can pray facing Earth. Of course, this raises the question of of how they manage to perform Salah without gravity... Regardless, this would give you some very distinctive buildings that give the ship a less conventionally american character.\n\nI suppose my advice basically boils down this: Work out what cultures survived whatever event lead to the disapora, and work out how they have to adapt to the practicalities of living in space. A lot of the \"big\" stuff like food is going to be strongly tied to the technology and resources your people have, rather than their culture, but the more personal things like religion and family will make a big difference to the character of each location\n\n*Actually they face the Kaaba, which is a big cube-thing in Mecca. Given that Earth is off-limits, that would raise the question of whether Muslims are still obligated to perform the Hajj (the pilgrimage to Mecca). It's quite possible that the dispora version of Islam doesn't require it, on the grounds that it's not possible, but it's also possible that they've somehow agreed on a \"new Mecca\". Either by agreement, or by physically putting the city of Mecca in a big spaceship and taking it off-planet. Either way, that could be a character motivation, and I'm sure you could hang a few interesting plots off it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only help I can offer is a few points worth considering.&lt;/p&gt;\n\n&lt;p&gt;Firstly, architecture. Obviously the technology level of the setting affects the degree to which cultural preferences  can be accomodated - if your humans don&amp;#39;t have any kind of artifical gravity, the need to work around that will overtake everything else - but so long as you have centrifugal gravity or better, you can show things that the current culture has inherited from pre-dispora designs.&lt;/p&gt;\n\n&lt;p&gt;For an example of what I mean, think about housing. Some cultures tend to favour smaller cohabiting groups than others. In Britain, for example, we spend huge sums of money on buying or renting tiny new-build box homes rather in preference to living with our parents or with housemates. The same trend would probably continue on space stations: lots of very small, self-catering cabins, with only one or two occupants. Other cultures favour multigeneration cohabiting groups, with parents, grandparents and children all living in the same home. This would probably carry over to space with larger communal areas shared between a few cabins, probably with shared dining facilities.&lt;/p&gt;\n\n&lt;p&gt;A second question is how Earth-centric cultures and religions have adapted to space. Assuming Islam is still practised in your setting, for example, how have they adapted the Qibla (the praying facing Mecca*) tradition? Do they pray facing in the direction of Earth? If so, how? On a ship or station with centrifugal gravity, the direction of Earth isn&amp;#39;t going to be constant, it&amp;#39;s going to move quite rapidly relative to somebody standing in the spin section. This would be solvable by putting the mosque on the central axis of the ship, so that the prayer room is in zero gravity, and worshippers can pray facing Earth. Of course, this raises the question of of how they manage to perform Salah without gravity... Regardless, this would give you some very distinctive buildings that give the ship a less conventionally american character.&lt;/p&gt;\n\n&lt;p&gt;I suppose my advice basically boils down this: Work out what cultures survived whatever event lead to the disapora, and work out how they have to adapt to the practicalities of living in space. A lot of the &amp;quot;big&amp;quot; stuff like food is going to be strongly tied to the technology and resources your people have, rather than their culture, but the more personal things like religion and family will make a big difference to the character of each location&lt;/p&gt;\n\n&lt;p&gt;*Actually they face the Kaaba, which is a big cube-thing in Mecca. Given that Earth is off-limits, that would raise the question of whether Muslims are still obligated to perform the Hajj (the pilgrimage to Mecca). It&amp;#39;s quite possible that the dispora version of Islam doesn&amp;#39;t require it, on the grounds that it&amp;#39;s not possible, but it&amp;#39;s also possible that they&amp;#39;ve somehow agreed on a &amp;quot;new Mecca&amp;quot;. Either by agreement, or by physically putting the city of Mecca in a big spaceship and taking it off-planet. Either way, that could be a character motivation, and I&amp;#39;m sure you could hang a few interesting plots off it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9t1em", "score_hidden": false, "stickied": false, "created": 1492235205.0, "created_utc": 1492206405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": "", "user_reports": [], "id": "dgak0rk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "alex_monk", "parent_id": "t1_dg9vask", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Like in \"Clockwork orange\" you can use non-english words in english speech. Also you can use names from different cultures (e.g. korean name for white guy).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like in &amp;quot;Clockwork orange&amp;quot; you can use non-english words in english speech. Also you can use names from different cultures (e.g. korean name for white guy).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgak0rk", "score_hidden": false, "stickied": false, "created": 1492284787.0, "created_utc": 1492255987.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9vask", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Seamus999", "parent_id": "t1_dg9uqtz", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I was thinking both would naturally happen. The cramped environment of a station would make things mutate and I figure at least a few groups will simply want to go their own way when planets and asteroids are terraformed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was thinking both would naturally happen. The cramped environment of a station would make things mutate and I figure at least a few groups will simply want to go their own way when planets and asteroids are terraformed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9vask", "score_hidden": false, "stickied": false, "created": 1492238189.0, "created_utc": 1492209389.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9uqtz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "alex_monk", "parent_id": "t3_65eimo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Do you want to make eclectic culture of earth cultures or do you want to make different regions of space belong to different cultures?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you want to make eclectic culture of earth cultures or do you want to make different regions of space belong to different cultures?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dg9uqtz", "score_hidden": false, "stickied": false, "created": 1492237442.0, "created_utc": 1492208642.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": "", "user_reports": [], "id": "dga7ak7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ithillidcs", "parent_id": "t3_65eimo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "One way to do it is to build towards a middle. Space, and offworld colonization is likely to create a lot of new practices as people adapt to their new environment. \n\nSo on one side I have the situation. Lets say that the population that I am considering is spacers, that being people that live their whole lives in space ships or on stations. One of the obvious challenges that they are going to face is limited life support, and the nature of a ship requiring a high degree of cooperation. Find solutions to those challenges. These solutions will modify the base culture, because a group of Spanish origin who live on space ships is going to have some different practices than a group of Spanish origin who live on a desert world.  \n\nOn the other side, find the culture or cultures that you find interesting and usable. Do the research, and find what interesting or cool elements come up. Focus on the practical. How do people live? What are the centerpoints of their community? Religion? What are the family obligations? Who counts as family? Of course, these are sample questions. If your RPG has different needs then of course modify the list to fit what you need. \n\nFrom these two sets of answers. Challenges and possible solutions on one side, and known practices on the other, then start building the two into each other to try and form a unique synthesis to reflect both the original culture, and the changes that it sees in trying to survive and thrive in a new environment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One way to do it is to build towards a middle. Space, and offworld colonization is likely to create a lot of new practices as people adapt to their new environment. &lt;/p&gt;\n\n&lt;p&gt;So on one side I have the situation. Lets say that the population that I am considering is spacers, that being people that live their whole lives in space ships or on stations. One of the obvious challenges that they are going to face is limited life support, and the nature of a ship requiring a high degree of cooperation. Find solutions to those challenges. These solutions will modify the base culture, because a group of Spanish origin who live on space ships is going to have some different practices than a group of Spanish origin who live on a desert world.  &lt;/p&gt;\n\n&lt;p&gt;On the other side, find the culture or cultures that you find interesting and usable. Do the research, and find what interesting or cool elements come up. Focus on the practical. How do people live? What are the centerpoints of their community? Religion? What are the family obligations? Who counts as family? Of course, these are sample questions. If your RPG has different needs then of course modify the list to fit what you need. &lt;/p&gt;\n\n&lt;p&gt;From these two sets of answers. Challenges and possible solutions on one side, and known practices on the other, then start building the two into each other to try and form a unique synthesis to reflect both the original culture, and the changes that it sees in trying to survive and thrive in a new environment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dga7ak7", "score_hidden": false, "stickied": false, "created": 1492254644.0, "created_utc": 1492225844.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": "", "user_reports": [], "id": "dga9vno", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "golem64", "parent_id": "t3_65eimo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Take a look at 2300 AD. It depicts a future in which different nations have colonized different arms of nearby stars. \n\nhttp://www.mongoosepublishing.com/rpgs/2300ad.html ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take a look at 2300 AD. It depicts a future in which different nations have colonized different arms of nearby stars. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.mongoosepublishing.com/rpgs/2300ad.html\"&gt;http://www.mongoosepublishing.com/rpgs/2300ad.html&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dga9vno", "score_hidden": false, "stickied": false, "created": 1492258852.0, "created_utc": 1492230052.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": "", "user_reports": [], "id": "dgaenru", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brockritcey", "parent_id": "t3_65eimo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I would figure out the nature of you technology first. How easy is it to travel from planet to planet, how are the colonies for resources, how long have colonies been established, and things of that nature. Then I would build cultures around that.\n\nIf there are multiple colonies on different worlds then they have probably been there for generations and would have developed their own cultures. If we were to colonize a planet and live in underground cities it wouldn't matter if we started as English or French we would have developed our own identity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would figure out the nature of you technology first. How easy is it to travel from planet to planet, how are the colonies for resources, how long have colonies been established, and things of that nature. Then I would build cultures around that.&lt;/p&gt;\n\n&lt;p&gt;If there are multiple colonies on different worlds then they have probably been there for generations and would have developed their own cultures. If we were to colonize a planet and live in underground cities it wouldn&amp;#39;t matter if we started as English or French we would have developed our own identity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgaenru", "score_hidden": false, "stickied": false, "created": 1492268692.0, "created_utc": 1492239892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65eimo", "likes": null, "replies": "", "user_reports": [], "id": "dgangm1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dicegeeks", "parent_id": "t3_65eimo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "For planets and systems, name them after diverse cultures. For example: The Württemberg syatem was founded mainly German explorers. The planet of Nouveau Paris was founded by French explorers. And so on...\n\nFor people, combine culture specific names to represent a blending of cultures. For example: Wang Hamza Hathaway (Chinese, Moroccan, English) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For planets and systems, name them after diverse cultures. For example: The Württemberg syatem was founded mainly German explorers. The planet of Nouveau Paris was founded by French explorers. And so on...&lt;/p&gt;\n\n&lt;p&gt;For people, combine culture specific names to represent a blending of cultures. For example: Wang Hamza Hathaway (Chinese, Moroccan, English) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgangm1", "score_hidden": false, "stickied": false, "created": 1492292451.0, "created_utc": 1492263651.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]