[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "rpg", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Backstory: Some mosaic maker dude who portrayed us as demons went blind and insane after seeing a statue in a cave. When we went in and touched the statue of (Azsuna or Azula or something like that), we were teleported into a cave complex where we solved a couple riddles and tricky rooms.&lt;/p&gt;\n\n&lt;p&gt;Mechanics backstory: In the system we&amp;#39;re playing, everything not an ability is a skill which can be gained in a lot of ways. Levels translate to dice, e.g a 7 skill means you roll it with D8. Also, as a house rule initiative is rerolled every round.&lt;/p&gt;\n\n&lt;p&gt;Characters: Yashimie, human cleric (magic is really weak in this system, so yeah); Rangar, human barbarian; Sylvia Xayah, shapeshifter assassin/prostitute (my character). &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR&lt;/strong&gt;: We fight with a weird patch of fog in the last room of the cave complex. Figuring out that irreality is solved by explaining with logic why that thing it did isn&amp;#39;t possible (it turns our stuff into weird stuff whenit touches them), we can damage it. The last-hit comes from the barbarian who explains, using his knowledge of trade, that lollipop shields would ruin the economy. &lt;/p&gt;\n\n&lt;p&gt;So, we&amp;#39;re in the last room, a snake-thing (we nicknamed it Hisshiss) is circling around us, asking stupid questions like &amp;quot;what did we learn on our journey&amp;quot; or something like that. We guess blindly and one of them must&amp;#39;ve been correct, because he lifts his body in one place, forming an arc that&amp;#39;s the exit. Suddenly it cries out and turns into stone and a patch of fog appears. I yell at it because hey, it hurt Hisshiss, and it touches me. GM tells me to roll luck, I get 85, a really bad number. Suddenly, all my body hairs turn purple and my left leg turns 86° inwards. Well, shit. &lt;/p&gt;\n\n&lt;p&gt;I try to stab it with my sneaky knife (aka wristdagger), I get some minimal damage in and I have to roll luck again. This time I roll better and my sneaky knife turns blue. I can live with that. Next is Rangar, he does decent damage with his sword, but as again, he has to roll luck and his sword turns to lead. (Yashimie was trying to bow like, for 3-4 rounds but she never hit.) We reroll initiative and I get the lead. Well, I don&amp;#39;t particularly want to stab the fog, worrying for my really expensive wristblade and my only weapon, but in the end I do. Minimal damage, luck roll and my sneaky knife flies away as birds. Blue birds. Fuck me, right?! Next is the fog. It attacks Rangar who had taunted it, but he can&amp;#39;t get past the shield. Whatever, he still touched it, so luck roll again! It... turns to lollipop. Rangar is holding a big, circle-shaped lollipop as shield. Rangar attacks again with his (now leaden) sword, it does decent damage again and with a not-so-bad roll luck, it slightly melts, leaving cool molten streaks in the air.&lt;/p&gt;\n\n&lt;p&gt;But now something happens. Hisshiss the snake, who had been turned into stone by Mr. Fog turns alive for a second and all of us who have modified stuff roll D10. The one with the greatest value on the die is reverted. It&amp;#39;s won by my purple hair (like, the only thing I liked). Yey. Next round. This time, instead of hitting the fog with my fists (I would &lt;em&gt;not&lt;/em&gt; like them to be turned into birds or lollipop or whatever), I run up to Hisshiss&amp;#39; head, behind the fog, to ask it to turn back our features. The other three participants all miss. Fun times. &lt;/p&gt;\n\n&lt;p&gt;This round, the GM makes all of us roll an Int check (D6+Int), and neither of us rolls that well or that badly, so the GM takes pity on us and asks us how to deal with irrealities as shown by Mr. Fog, turning our stuff into stuff that makes no sense. So, I spent my round loudly declaring &amp;quot;I don&amp;#39;t believe you! You don&amp;#39;t exist&amp;quot; and throwing some anti-zombie powder we had obtained in room 1 on it. Nothing happens. (Yashimie, OOC: &amp;quot;I think it would&amp;#39;ve been more effective without the powder. Like, &amp;#39;I don&amp;#39;t believe you&amp;#39; but still throwing salt on it!&amp;quot; We all laugh.) Rangar damages the fog and turns his slightly molten lead sword into an obsidian sword, the monster misses again and Yashimie hits for like 2 damage, finally. Next round. With my eyes closed, I jump behind the fog and try to stab it with my sneaky knife, since if I don&amp;#39;t believe it isn&amp;#39;t there, it has to deal damage, right? Well, no. I still deal like 3 wrist damage and since I roll really good (06), my leg turns back to normal. I would&amp;#39;ve preferred getting my sneaky knife back, but a beggar is no chooser. The monster attacks Rangar again but only hits the shield, and due to another good roll it turns to metal. Sweet(er than lollipop)! Yashimie bows again, misses as usual. It was an unlucky round for her. &lt;/p&gt;\n\n&lt;p&gt;Rangar&amp;#39;s round. He thinks for a while what to do, then does something neither of us expected: he yells that his iron sword can&amp;#39;t turn into lead or obsidian because he knows alchemy well and these things can&amp;#39;t happen. GM grins and says: roll Alchemy. He doesn&amp;#39;t score bad and the GM takes some notes. We&amp;#39;re revitalized. So this is the way to defeat the monster! Since my highest &amp;quot;knowledge&amp;quot; level is in Alchemy too, I explain that metals can&amp;#39;t change their colours randomly, especially not blue. Yashimie says something too, about my leg and her knowledge of healing I think. Next round. Rangar gets initiative and since God knows why his highest skill is in trade (lv7, rolls with D8) so he says &amp;quot;I know you&amp;#39;re irreal, because if everyone had lollipop shields, it would ruin economy and lollipop prices would plummet&amp;quot;. He rolls a really wild number and the fog disperses. We all high-five, Hisshiss unstones itself and we go through the portal leading out. All changes are reverted when we step out, of course. Moral of the day: anti-zombie powder doesn&amp;#39;t work on hostile fog and lollipop shields are bad for the economy. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Backstory: Some mosaic maker dude who portrayed us as demons went blind and insane after seeing a statue in a cave. When we went in and touched the statue of (Azsuna or Azula or something like that), we were teleported into a cave complex where we solved a couple riddles and tricky rooms.\n\nMechanics backstory: In the system we're playing, everything not an ability is a skill which can be gained in a lot of ways. Levels translate to dice, e.g a 7 skill means you roll it with D8. Also, as a house rule initiative is rerolled every round.\n\nCharacters: Yashimie, human cleric (magic is really weak in this system, so yeah); Rangar, human barbarian; Sylvia Xayah, shapeshifter assassin/prostitute (my character). \n\n**TLDR**: We fight with a weird patch of fog in the last room of the cave complex. Figuring out that irreality is solved by explaining with logic why that thing it did isn't possible (it turns our stuff into weird stuff whenit touches them), we can damage it. The last-hit comes from the barbarian who explains, using his knowledge of trade, that lollipop shields would ruin the economy. \n\nSo, we're in the last room, a snake-thing (we nicknamed it Hisshiss) is circling around us, asking stupid questions like \"what did we learn on our journey\" or something like that. We guess blindly and one of them must've been correct, because he lifts his body in one place, forming an arc that's the exit. Suddenly it cries out and turns into stone and a patch of fog appears. I yell at it because hey, it hurt Hisshiss, and it touches me. GM tells me to roll luck, I get 85, a really bad number. Suddenly, all my body hairs turn purple and my left leg turns 86° inwards. Well, shit. \n\nI try to stab it with my sneaky knife (aka wristdagger), I get some minimal damage in and I have to roll luck again. This time I roll better and my sneaky knife turns blue. I can live with that. Next is Rangar, he does decent damage with his sword, but as again, he has to roll luck and his sword turns to lead. (Yashimie was trying to bow like, for 3-4 rounds but she never hit.) We reroll initiative and I get the lead. Well, I don't particularly want to stab the fog, worrying for my really expensive wristblade and my only weapon, but in the end I do. Minimal damage, luck roll and my sneaky knife flies away as birds. Blue birds. Fuck me, right?! Next is the fog. It attacks Rangar who had taunted it, but he can't get past the shield. Whatever, he still touched it, so luck roll again! It... turns to lollipop. Rangar is holding a big, circle-shaped lollipop as shield. Rangar attacks again with his (now leaden) sword, it does decent damage again and with a not-so-bad roll luck, it slightly melts, leaving cool molten streaks in the air.\n\nBut now something happens. Hisshiss the snake, who had been turned into stone by Mr. Fog turns alive for a second and all of us who have modified stuff roll D10. The one with the greatest value on the die is reverted. It's won by my purple hair (like, the only thing I liked). Yey. Next round. This time, instead of hitting the fog with my fists (I would *not* like them to be turned into birds or lollipop or whatever), I run up to Hisshiss' head, behind the fog, to ask it to turn back our features. The other three participants all miss. Fun times. \n\nThis round, the GM makes all of us roll an Int check (D6+Int), and neither of us rolls that well or that badly, so the GM takes pity on us and asks us how to deal with irrealities as shown by Mr. Fog, turning our stuff into stuff that makes no sense. So, I spent my round loudly declaring \"I don't believe you! You don't exist\" and throwing some anti-zombie powder we had obtained in room 1 on it. Nothing happens. (Yashimie, OOC: \"I think it would've been more effective without the powder. Like, 'I don't believe you' but still throwing salt on it!\" We all laugh.) Rangar damages the fog and turns his slightly molten lead sword into an obsidian sword, the monster misses again and Yashimie hits for like 2 damage, finally. Next round. With my eyes closed, I jump behind the fog and try to stab it with my sneaky knife, since if I don't believe it isn't there, it has to deal damage, right? Well, no. I still deal like 3 wrist damage and since I roll really good (06), my leg turns back to normal. I would've preferred getting my sneaky knife back, but a beggar is no chooser. The monster attacks Rangar again but only hits the shield, and due to another good roll it turns to metal. Sweet(er than lollipop)! Yashimie bows again, misses as usual. It was an unlucky round for her. \n\nRangar's round. He thinks for a while what to do, then does something neither of us expected: he yells that his iron sword can't turn into lead or obsidian because he knows alchemy well and these things can't happen. GM grins and says: roll Alchemy. He doesn't score bad and the GM takes some notes. We're revitalized. So this is the way to defeat the monster! Since my highest \"knowledge\" level is in Alchemy too, I explain that metals can't change their colours randomly, especially not blue. Yashimie says something too, about my leg and her knowledge of healing I think. Next round. Rangar gets initiative and since God knows why his highest skill is in trade (lv7, rolls with D8) so he says \"I know you're irreal, because if everyone had lollipop shields, it would ruin economy and lollipop prices would plummet\". He rolls a really wild number and the fog disperses. We all high-five, Hisshiss unstones itself and we go through the portal leading out. All changes are reverted when we step out, of course. Moral of the day: anti-zombie powder doesn't work on hostile fog and lollipop shields are bad for the economy. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65fqjh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "Vievin", "saved": false, "mod_reports": [], "name": "t3_65fqjh", "subreddit_name_prefixed": "r/rpg", "approved_by": null, "over_18": false, "domain": "self.rpg", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2s", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/rpg/comments/65fqjh/game_tale_the_story_of_lollipop_shield_and_blue/", "num_reports": null, "locked": false, "stickied": false, "created": 1492238411.0, "url": "https://www.reddit.com/r/rpg/comments/65fqjh/game_tale_the_story_of_lollipop_shield_and_blue/", "author_flair_text": null, "quarantine": false, "title": "[Game Tale] The story of Lollipop Shield and Blue Bird Sneaky Knife, or how did a barbarian kill a patch of fog with his knowledge of trade", "created_utc": 1492209611.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65fqjh", "likes": null, "replies": "", "user_reports": [], "id": "dga47ug", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "kinderdemon", "parent_id": "t3_65fqjh", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Has someone turned LSD into a rpg system? \n\nOr is your GM just a magnificent bastard?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Has someone turned LSD into a rpg system? &lt;/p&gt;\n\n&lt;p&gt;Or is your GM just a magnificent bastard?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dga47ug", "score_hidden": false, "stickied": false, "created": 1492250179.0, "created_utc": 1492221379.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65fqjh", "likes": null, "replies": "", "user_reports": [], "id": "dgagvqh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Vorathol", "parent_id": "t3_65fqjh", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I love it! It's so dumb it blasts all the way through and come out awesome, you must have a great GM.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love it! It&amp;#39;s so dumb it blasts all the way through and come out awesome, you must have a great GM.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgagvqh", "score_hidden": false, "stickied": false, "created": 1492274949.0, "created_utc": 1492246149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]