[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "rpg", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65gdp2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "RobertNathanDavis", "saved": false, "mod_reports": [], "name": "t3_65gdp2", "subreddit_name_prefixed": "r/rpg", "approved_by": null, "over_18": false, "domain": "tbegamenight.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2s", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/rpg/comments/65gdp2/tabletop_roleplaying_as_a_tool_for_selfdevelopment/", "num_reports": null, "locked": false, "stickied": false, "created": 1492246206.0, "url": "https://tbegamenight.com/tabletop-roleplaying-as-a-tool-for-self-development/", "author_flair_text": null, "quarantine": false, "title": "Tabletop Roleplaying as a Tool for Self-Development", "created_utc": 1492217406.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65gdp2", "likes": null, "replies": "", "user_reports": [], "id": "dga6r24", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "gabriel_larkins", "parent_id": "t3_65gdp2", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I've recently become very interested in this aspect of roleplaying, after seeing it in action with one of my players.\n\nThis guy, let's call him Mark, lived in my suite freshman year of college, and we quickly bonded over video games. He was your classic socially awkward guy  - stuttered sometimes, had trouble following the rhythm of conversation in social contexts, and wasn't great at \"reading the room\" when it came to his jokes. Nonetheless, he was a super cool guy, we had a lot in common, and Mark became a valued member of our friend group.\n\nI was eventually running a Pathfinder game my senior year that spilled over into post-college, and we started playing over Roll20 as a means of keeping in touch after graduation. He had pulled me aside and told me he wanted to focus more on RP (he'd previously been mostly the rules-lawyer theorycrafter), so I tried my best to oblige him.\n\nEventually we had a game where a friendly NPC had been tricked by the BBEG into fighting for him, and was leading a military occupation in a town they were set to liberate. The original plan was that the party would be forced into a situation where they had to either give up the town or fight this NPC. \n\nIn comes Mark. He has a plan, one that he devised before game when he had a sneaking suspicion this NPC would be involved, and he consulted the party on executing it. It involved a lot of illusion magic (he was a Gnome Sorcerer) that I won't go into the details of here, but it resulted in the NPC being convinced to abandon his post and stand down. I told him that this was a big ask, and if he wanted to do it, he would have to beat the NPC in opposed Bluff v Sense Motive *and* roleplay it out. \n\nHe stepped up, and it was amazing. The other five members of the party weren't even mad that they weren't taking part in the climax of this game, because they were riveted by the tension going on in this conversation between Mark and I, and they knew how huge of a deal it was that Mark was putting himself into the spotlight. Thanks to some deft roleplay and a few high rolls (vs. this guy's very high Sense Motive), Mark managed to defuse the situation entirely without bloodshed.\n\nHe was a changed player after that game, far more confident to speak up during group planning times and even engaging in some witty banter with the party rogue during down time. He had always enjoyed game, but I could tell he was LOVING it now, and the party was enjoying it much more thanks to his presence.\n\nWhen it eventually came time to retire those characters, we moved on to FFG Star Wars, and he told me that he wanted to play a Scoundrel Smuggler. Normally this would just mean \"I want to play a rogue\", but in Star Wars, that's huge. That's Han Solo. The guy who, when we first met, once sent me a Facebook message apologizing and beating himself up for trashtalking me during a game of Marvel vs. Capcom (it was totally fine, but he was just that socially insecure) now wanted to play **Han Solo**. Now the rest of the party has followed his lead, and this campaign has across the board better roleplaying than the last.\n\nI'm really glad other organizations are looking into these capabilities of the hobby, because I've seen firsthand the huge benefits it can have for people, and I honestly think it has made Mark a more confident, happier person as a result.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve recently become very interested in this aspect of roleplaying, after seeing it in action with one of my players.&lt;/p&gt;\n\n&lt;p&gt;This guy, let&amp;#39;s call him Mark, lived in my suite freshman year of college, and we quickly bonded over video games. He was your classic socially awkward guy  - stuttered sometimes, had trouble following the rhythm of conversation in social contexts, and wasn&amp;#39;t great at &amp;quot;reading the room&amp;quot; when it came to his jokes. Nonetheless, he was a super cool guy, we had a lot in common, and Mark became a valued member of our friend group.&lt;/p&gt;\n\n&lt;p&gt;I was eventually running a Pathfinder game my senior year that spilled over into post-college, and we started playing over Roll20 as a means of keeping in touch after graduation. He had pulled me aside and told me he wanted to focus more on RP (he&amp;#39;d previously been mostly the rules-lawyer theorycrafter), so I tried my best to oblige him.&lt;/p&gt;\n\n&lt;p&gt;Eventually we had a game where a friendly NPC had been tricked by the BBEG into fighting for him, and was leading a military occupation in a town they were set to liberate. The original plan was that the party would be forced into a situation where they had to either give up the town or fight this NPC. &lt;/p&gt;\n\n&lt;p&gt;In comes Mark. He has a plan, one that he devised before game when he had a sneaking suspicion this NPC would be involved, and he consulted the party on executing it. It involved a lot of illusion magic (he was a Gnome Sorcerer) that I won&amp;#39;t go into the details of here, but it resulted in the NPC being convinced to abandon his post and stand down. I told him that this was a big ask, and if he wanted to do it, he would have to beat the NPC in opposed Bluff v Sense Motive &lt;em&gt;and&lt;/em&gt; roleplay it out. &lt;/p&gt;\n\n&lt;p&gt;He stepped up, and it was amazing. The other five members of the party weren&amp;#39;t even mad that they weren&amp;#39;t taking part in the climax of this game, because they were riveted by the tension going on in this conversation between Mark and I, and they knew how huge of a deal it was that Mark was putting himself into the spotlight. Thanks to some deft roleplay and a few high rolls (vs. this guy&amp;#39;s very high Sense Motive), Mark managed to defuse the situation entirely without bloodshed.&lt;/p&gt;\n\n&lt;p&gt;He was a changed player after that game, far more confident to speak up during group planning times and even engaging in some witty banter with the party rogue during down time. He had always enjoyed game, but I could tell he was LOVING it now, and the party was enjoying it much more thanks to his presence.&lt;/p&gt;\n\n&lt;p&gt;When it eventually came time to retire those characters, we moved on to FFG Star Wars, and he told me that he wanted to play a Scoundrel Smuggler. Normally this would just mean &amp;quot;I want to play a rogue&amp;quot;, but in Star Wars, that&amp;#39;s huge. That&amp;#39;s Han Solo. The guy who, when we first met, once sent me a Facebook message apologizing and beating himself up for trashtalking me during a game of Marvel vs. Capcom (it was totally fine, but he was just that socially insecure) now wanted to play &lt;strong&gt;Han Solo&lt;/strong&gt;. Now the rest of the party has followed his lead, and this campaign has across the board better roleplaying than the last.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really glad other organizations are looking into these capabilities of the hobby, because I&amp;#39;ve seen firsthand the huge benefits it can have for people, and I honestly think it has made Mark a more confident, happier person as a result.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dga6r24", "score_hidden": false, "stickied": false, "created": 1492253836.0, "created_utc": 1492225036.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65gdp2", "likes": null, "replies": "", "user_reports": [], "id": "dgalj7m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "grade_E", "parent_id": "t3_65gdp2", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "This hits the nail on the head.\n\nI belong to a gaming group(soon to be a society), our stated intent is to use tabletop roleplaying games to foster soft skill development. We welcome anyone who wants to play and we have moved out of \"the basement\" and into the very public library. We actually play in large glass rooms, in full view of the public.\n\nOur group ranges in age from 10-70, with 30+ regular members in attendance. People from all walks of life, male and female. From Professionals to school kids. \n\nOur group has many members that face significant life challenges, mental health issues and autism.\n\nRoleplaying allows them to break down the stigma surrounding those challenges while fostering their soft skills. I've personally seen this happen. Communication, leadership, team building, and a slew of other social skills increase dramatically.\n\nYou can check us out on twitter @HandAtruro. \n\nHappy to see more folks recognizing the positives this great hobby has to offer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This hits the nail on the head.&lt;/p&gt;\n\n&lt;p&gt;I belong to a gaming group(soon to be a society), our stated intent is to use tabletop roleplaying games to foster soft skill development. We welcome anyone who wants to play and we have moved out of &amp;quot;the basement&amp;quot; and into the very public library. We actually play in large glass rooms, in full view of the public.&lt;/p&gt;\n\n&lt;p&gt;Our group ranges in age from 10-70, with 30+ regular members in attendance. People from all walks of life, male and female. From Professionals to school kids. &lt;/p&gt;\n\n&lt;p&gt;Our group has many members that face significant life challenges, mental health issues and autism.&lt;/p&gt;\n\n&lt;p&gt;Roleplaying allows them to break down the stigma surrounding those challenges while fostering their soft skills. I&amp;#39;ve personally seen this happen. Communication, leadership, team building, and a slew of other social skills increase dramatically.&lt;/p&gt;\n\n&lt;p&gt;You can check us out on twitter @HandAtruro. &lt;/p&gt;\n\n&lt;p&gt;Happy to see more folks recognizing the positives this great hobby has to offer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgalj7m", "score_hidden": false, "stickied": false, "created": 1492288547.0, "created_utc": 1492259747.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]