[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "rpg", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi there I&amp;#39;m a GM with about two years under my belt in 5e and that&amp;#39;s about it. I wanted to make this post because before running the Maze Engine encounter I found several posts complaining about different and severe magical effects.&lt;/p&gt;\n\n&lt;p&gt;These effects are generally randomly rolled for on a table provided in Out of the Abyss. One of them sends players back in time to the point of start of the campaign. All the way back to Velkynvelve. One of the posts I saw commenting on this effect said this would effectively end the campaign, and I saw more sentiment of this kind. Oddly enough never once did I see someone offer an alternative solution.&lt;/p&gt;\n\n&lt;p&gt;Now I had plenty of time to prepare for most of the effects of the maze engine, but I didn&amp;#39;t think this would come up. It did, that&amp;#39;s why we&amp;#39;re here. Instead of despairing, I went into improv and research on the fly mode. Pretty sure every GM has one of these moments most every session.&lt;/p&gt;\n\n&lt;p&gt;First I made it clear to the players that they were back in time, and I did this by letting them see their old selves jump a cliff just like they had before. I did get lucky as we had to end the session in the middle of combat with the drow forces.&lt;/p&gt;\n\n&lt;p&gt;Fortunately I had kept some pretty good logs so I could trace what could affect what. Like the fact that if they killed the priestess of Lolth at Velkynvelve it would cause one of their former members to die (long story, cool counter-ambush). I started mapping some other events as well. Then I realized that I still hadn&amp;#39;t settled on what set of time-travel rules I would follow. This leads me to the first point-&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;When running time travel always decide what your rules are and stick to them!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Do you follow &amp;quot;Back to the Future&amp;quot; rules? &amp;quot;Butterfly Effect&amp;quot;? Michael Crichton&amp;#39;s &amp;quot;Timeline&amp;quot;? &amp;quot;Looper&amp;quot; (modified BttF)? &amp;quot;Day&amp;#39;s of Future Past&amp;quot;? &amp;quot;The Dark Tower&amp;quot;? So many to choose from, so little time.&lt;strong&gt;And don&amp;#39;t forget no matter what you choose there will be plot holes.&lt;/strong&gt; It comes with the territory, so pick the holes you are most comfortable with.&lt;/p&gt;\n\n&lt;p&gt;At first I wanted to go with &amp;quot;Back the Future&amp;quot;, from a storytelling perspective it&amp;#39;s cool and has high stakes- one wrong move and the characters are gone. Ultimately though the way Forgotten Realms itself provided the answer. It&amp;#39;s built in a multiverse. So I chose the quantum mechanics fueled &amp;quot;Timeline&amp;quot; as the primary ruler, and incorporating elements from &amp;quot;The Dark tower.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;To shortly explain- the book &amp;quot;Timeline&amp;quot; does not have it&amp;#39;s characters travel through time so much as travel across planes to a similar timeline that was not as far along as their own. This is oversimplification, but I highly recommend giving it a read. Actual quantum mechanics of course are way more complicated and I do not claim to actually understand them, but they make for cool sci-fi. I&amp;#39;ll  explain &amp;quot;The Dark Tower&amp;quot; stuff later, though some of you probably know where this is going.&lt;/p&gt;\n\n&lt;p&gt;How do convey all this to the players though? How do you give them any hope of continuing the story? Isn&amp;#39;t it mighty convenient if a character showed up that knew all about their situation, why yes, yes it would. This is where reading your players also comes in handy, what bullcrap willing to put up with to get back on track? Keep in mind we&amp;#39;ve been playing this campaign for over a year some of the players really want to kill the demon lords. I decided there would only be one session they&amp;#39;d have to go through to get back to the future, no running around with fetch quests. Not that there wasn&amp;#39;t peril involved.&lt;/p&gt;\n\n&lt;p&gt;First, I made an odd mind flayer I cheekily named Nocter. He had an assistant named Esiver and they weren&amp;#39;t too far away. Why? because they&amp;#39;d been studying a temporal anomaly in the area, one they knew would eventually occur. So when it finally occurred they had reason to be there.&lt;/p&gt;\n\n&lt;p&gt;After the adventurers impressively killed the drow forces at Velkynvelve they were quite spent. The drow priestess of Lolth had been killed so I brought in &amp;quot;The Dark Tower&amp;quot; side of my time travel rules- dissonant memories. Remembering the same events two different ways because, in a way, both things happened. If they spent a long enough time in this timeline they would have been driven even crazier than they were. They spent about 24 hours in this timeline. Nocter came investigating soon after they rested. He was able to convince the players to come back to his lab. &lt;/p&gt;\n\n&lt;p&gt;When they got to the lab I described several objects in the room as well as had Esiver comment on them. This led to the players asking about a map he had of the planes. Which led to them asking where they were and ow they&amp;#39;d come back, which allowed me to explain a fantasy version of &amp;quot;Timeline&amp;quot; like mechanics to them. He explained the dangers of sending them back, explained that not everything would necessarily be the same.&lt;/p&gt;\n\n&lt;p&gt;When they started the actual ritual I used a kind of stone I&amp;#39;ve inserted several times already that&amp;#39;s been shown to have extraplanar connections (this was something I got lucky on, not everyone will have this). Using a connection with the Feywild and their own innate wrongness on this timeline he was able to get most of them back to their own timeline. Most of them anyways, but I don&amp;#39;t need to go into that.&lt;/p&gt;\n\n&lt;p&gt;When they arrived back in their proper timeline the lab was still there, Nocter was there, but he wasn&amp;#39;t the curious mind flayer they&amp;#39;d met. He was a Ulitharid and quite angry at their sudden appearance. They killed him and that&amp;#39;s about where we&amp;#39;ve ended for now.&lt;/p&gt;\n\n&lt;p&gt;Initial feedback was good. They were doubtful at first about the whole time-travel thing. Everyone felt a bit down at first, but once I made it clear that this was simply another obstacle that could be overcome (and not in laborious fashion), they were far willing to see it through. As of now they&amp;#39;ve all said they liked it. And as a bonus they are far closer to Araumycos!&lt;/p&gt;\n\n&lt;p&gt;I really hope this was helpful and I wouldn&amp;#39;t mind hearing some feedback as well. &lt;/p&gt;\n\n&lt;p&gt;TL;DR Sent players back to the beginning of the campaign and found an fun way for them to get back to the future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi there I'm a GM with about two years under my belt in 5e and that's about it. I wanted to make this post because before running the Maze Engine encounter I found several posts complaining about different and severe magical effects.\n\nThese effects are generally randomly rolled for on a table provided in Out of the Abyss. One of them sends players back in time to the point of start of the campaign. All the way back to Velkynvelve. One of the posts I saw commenting on this effect said this would effectively end the campaign, and I saw more sentiment of this kind. Oddly enough never once did I see someone offer an alternative solution.\n\nNow I had plenty of time to prepare for most of the effects of the maze engine, but I didn't think this would come up. It did, that's why we're here. Instead of despairing, I went into improv and research on the fly mode. Pretty sure every GM has one of these moments most every session.\n\nFirst I made it clear to the players that they were back in time, and I did this by letting them see their old selves jump a cliff just like they had before. I did get lucky as we had to end the session in the middle of combat with the drow forces.\n\nFortunately I had kept some pretty good logs so I could trace what could affect what. Like the fact that if they killed the priestess of Lolth at Velkynvelve it would cause one of their former members to die (long story, cool counter-ambush). I started mapping some other events as well. Then I realized that I still hadn't settled on what set of time-travel rules I would follow. This leads me to the first point-\n\n**When running time travel always decide what your rules are and stick to them!**\n\nDo you follow \"Back to the Future\" rules? \"Butterfly Effect\"? Michael Crichton's \"Timeline\"? \"Looper\" (modified BttF)? \"Day's of Future Past\"? \"The Dark Tower\"? So many to choose from, so little time.**And don't forget no matter what you choose there will be plot holes.** It comes with the territory, so pick the holes you are most comfortable with.\n\nAt first I wanted to go with \"Back the Future\", from a storytelling perspective it's cool and has high stakes- one wrong move and the characters are gone. Ultimately though the way Forgotten Realms itself provided the answer. It's built in a multiverse. So I chose the quantum mechanics fueled \"Timeline\" as the primary ruler, and incorporating elements from \"The Dark tower.\"\n\nTo shortly explain- the book \"Timeline\" does not have it's characters travel through time so much as travel across planes to a similar timeline that was not as far along as their own. This is oversimplification, but I highly recommend giving it a read. Actual quantum mechanics of course are way more complicated and I do not claim to actually understand them, but they make for cool sci-fi. I'll  explain \"The Dark Tower\" stuff later, though some of you probably know where this is going.\n\nHow do convey all this to the players though? How do you give them any hope of continuing the story? Isn't it mighty convenient if a character showed up that knew all about their situation, why yes, yes it would. This is where reading your players also comes in handy, what bullcrap willing to put up with to get back on track? Keep in mind we've been playing this campaign for over a year some of the players really want to kill the demon lords. I decided there would only be one session they'd have to go through to get back to the future, no running around with fetch quests. Not that there wasn't peril involved.\n\nFirst, I made an odd mind flayer I cheekily named Nocter. He had an assistant named Esiver and they weren't too far away. Why? because they'd been studying a temporal anomaly in the area, one they knew would eventually occur. So when it finally occurred they had reason to be there.\n\nAfter the adventurers impressively killed the drow forces at Velkynvelve they were quite spent. The drow priestess of Lolth had been killed so I brought in \"The Dark Tower\" side of my time travel rules- dissonant memories. Remembering the same events two different ways because, in a way, both things happened. If they spent a long enough time in this timeline they would have been driven even crazier than they were. They spent about 24 hours in this timeline. Nocter came investigating soon after they rested. He was able to convince the players to come back to his lab. \n\nWhen they got to the lab I described several objects in the room as well as had Esiver comment on them. This led to the players asking about a map he had of the planes. Which led to them asking where they were and ow they'd come back, which allowed me to explain a fantasy version of \"Timeline\" like mechanics to them. He explained the dangers of sending them back, explained that not everything would necessarily be the same.\n\nWhen they started the actual ritual I used a kind of stone I've inserted several times already that's been shown to have extraplanar connections (this was something I got lucky on, not everyone will have this). Using a connection with the Feywild and their own innate wrongness on this timeline he was able to get most of them back to their own timeline. Most of them anyways, but I don't need to go into that.\n\nWhen they arrived back in their proper timeline the lab was still there, Nocter was there, but he wasn't the curious mind flayer they'd met. He was a Ulitharid and quite angry at their sudden appearance. They killed him and that's about where we've ended for now.\n\nInitial feedback was good. They were doubtful at first about the whole time-travel thing. Everyone felt a bit down at first, but once I made it clear that this was simply another obstacle that could be overcome (and not in laborious fashion), they were far willing to see it through. As of now they've all said they liked it. And as a bonus they are far closer to Araumycos!\n\nI really hope this was helpful and I wouldn't mind hearing some feedback as well. \n\nTL;DR Sent players back to the beginning of the campaign and found an fun way for them to get back to the future.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65nw9f", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 44, "report_reasons": null, "author": "Feldragoon", "saved": false, "mod_reports": [], "name": "t3_65nw9f", "subreddit_name_prefixed": "r/rpg", "approved_by": null, "over_18": false, "domain": "self.rpg", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2s", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/rpg/comments/65nw9f/we_were_playing_out_of_the_abyss_when_the_maze/", "num_reports": null, "locked": false, "stickied": false, "created": 1492353861.0, "url": "https://www.reddit.com/r/rpg/comments/65nw9f/we_were_playing_out_of_the_abyss_when_the_maze/", "author_flair_text": null, "quarantine": false, "title": "We were playing Out of the Abyss when the Maze Engine's time travel effect took place...", "created_utc": 1492325061.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 44}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65nw9f", "likes": null, "replies": "", "user_reports": [], "id": "dgc1baz", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "BillRoyceJohnson", "parent_id": "t3_65nw9f", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I knew the Maze Engine was petty deep into the campaign. The book states they appear, \"Unbound, will all their XP, equipment, ect.\" so I'd imagine they have dawn-bringer, a-bunch of magical equipment, ect.\n\nMaybe I'd just do the \"Alternative History in a different time-line thing,\" but I know at-least my players (Mind you I had nine) would be giddy to be level 13 or so returning to their captors armed well with magical effects, even if they had to deal with the anti-magic field of the chamber. They'd probably bum rush demogorgon full of vigor at Sloopdiloop. Chances of survival might be limited, but that's just them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I knew the Maze Engine was petty deep into the campaign. The book states they appear, &amp;quot;Unbound, will all their XP, equipment, ect.&amp;quot; so I&amp;#39;d imagine they have dawn-bringer, a-bunch of magical equipment, ect.&lt;/p&gt;\n\n&lt;p&gt;Maybe I&amp;#39;d just do the &amp;quot;Alternative History in a different time-line thing,&amp;quot; but I know at-least my players (Mind you I had nine) would be giddy to be level 13 or so returning to their captors armed well with magical effects, even if they had to deal with the anti-magic field of the chamber. They&amp;#39;d probably bum rush demogorgon full of vigor at Sloopdiloop. Chances of survival might be limited, but that&amp;#39;s just them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgc1baz", "score_hidden": false, "stickied": false, "created": 1492378936.0, "created_utc": 1492350136.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65nw9f", "likes": null, "replies": "", "user_reports": [], "id": "dgc25yh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EarlMcFisticuffs", "parent_id": "t3_65nw9f", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I've not played Out of the Abyss, but [Time Bastard](https://www.chronocompendium.com/Term/Time_Bastard.html) is my favorite method of sorting things like this out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve not played Out of the Abyss, but &lt;a href=\"https://www.chronocompendium.com/Term/Time_Bastard.html\"&gt;Time Bastard&lt;/a&gt; is my favorite method of sorting things like this out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgc25yh", "score_hidden": false, "stickied": false, "created": 1492380434.0, "created_utc": 1492351634.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65nw9f", "likes": null, "replies": "", "user_reports": [], "id": "dgc385j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lottabullets", "parent_id": "t3_65nw9f", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "It sounds like you handled it excellently. I like the way you gave them the time travel situation and then got them right back to where they were\n\n\nIt seems silly to have such a campaign ending device pop up so late into a campaign, if i was a player id be pissed about it being over just like that. \n\nKudos", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you handled it excellently. I like the way you gave them the time travel situation and then got them right back to where they were&lt;/p&gt;\n\n&lt;p&gt;It seems silly to have such a campaign ending device pop up so late into a campaign, if i was a player id be pissed about it being over just like that. &lt;/p&gt;\n\n&lt;p&gt;Kudos&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgc385j", "score_hidden": false, "stickied": false, "created": 1492382117.0, "created_utc": 1492353317.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]