[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "rpg", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I&amp;#39;m making a dungeon for a game I&amp;#39;m running. My players have been talking about wanting to see more complex/lethal puzzles and the like. Which I am in no way opposed to. But my current problem is since I&amp;#39;m making them I know the answer so the hints I give seem clear to me. But I&amp;#39;m worried the players will be left in the dark. And then they get stuck and no ones having fun. Any tips to make sure that doesn&amp;#39;t happen?&lt;/p&gt;\n\n&lt;p&gt;TL;DR how to make sure your puzzles are solvable and the clues give just enough away?&lt;/p&gt;\n\n&lt;p&gt;Edit: I no type good&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, I'm making a dungeon for a game I'm running. My players have been talking about wanting to see more complex/lethal puzzles and the like. Which I am in no way opposed to. But my current problem is since I'm making them I know the answer so the hints I give seem clear to me. But I'm worried the players will be left in the dark. And then they get stuck and no ones having fun. Any tips to make sure that doesn't happen?\n\nTL;DR how to make sure your puzzles are solvable and the clues give just enough away?\n\nEdit: I no type good", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65sqt5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 44, "report_reasons": null, "author": "AgentBae", "saved": false, "mod_reports": [], "name": "t3_65sqt5", "subreddit_name_prefixed": "r/rpg", "approved_by": null, "over_18": false, "domain": "self.rpg", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2s", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/rpg/comments/65sqt5/puzzles_and_riddles/", "num_reports": null, "locked": false, "stickied": false, "created": 1492421696.0, "url": "https://www.reddit.com/r/rpg/comments/65sqt5/puzzles_and_riddles/", "author_flair_text": null, "quarantine": false, "title": "Puzzles and riddles", "created_utc": 1492392896.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 44}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dgdfa6u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AgentBae", "parent_id": "t1_dgdf3nl", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I have a large TV that I on hook my laptop up to and just opening up the riddle as a doc up there.\nAnd they are gonna walk through the tomb that holds their bodies that will have their birth and death dates before they get to the room. I could have the walls of the room be painted in like waves and a ocean theme. \nI'm not sure what to do if they get the sundial wrong. I was thinking just some light thunder damage. \nAnd none of the the archways will kill them. I'm thinking if they go through the wrong way they are still taken where they need to go. Just it will hurt them somehow. \nAnd I'm not sure worried about player death. They are level 15 (dnd 5e) with a cleric and a druid. They can come back lol. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a large TV that I on hook my laptop up to and just opening up the riddle as a doc up there.\nAnd they are gonna walk through the tomb that holds their bodies that will have their birth and death dates before they get to the room. I could have the walls of the room be painted in like waves and a ocean theme. \nI&amp;#39;m not sure what to do if they get the sundial wrong. I was thinking just some light thunder damage. \nAnd none of the the archways will kill them. I&amp;#39;m thinking if they go through the wrong way they are still taken where they need to go. Just it will hurt them somehow. \nAnd I&amp;#39;m not sure worried about player death. They are level 15 (dnd 5e) with a cleric and a druid. They can come back lol. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgdfa6u", "score_hidden": false, "stickied": false, "created": 1492461364.0, "created_utc": 1492432564.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdf3nl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NullOperative", "parent_id": "t1_dgdcnvo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Ok, that sounds good for a riddle, but there's always a risk that connecting the clue with the puzzle just doesn't click.  That's what you need to plan around with these.  It might help to refresh the sources of some of those clues, even just something at the beginning of your story referring to the old heroes by their epithets.  \n\nI'm assuming this story is going to be a printed handout so they can refer back to it without scrambling to take notes as you read it.  If you feel mildly artistic, you can scatter line drawings around the borders with pictures that just happen to match pictures in the room where the passage next to the picture is relevant.\n\n\"Ocean's birth\" referring to \"Ocean's Fury's birth\" may not be immediately clear, but that's one place where you can write up a hint card.  Assuming they don't get it right away, what happens if they do some trial and error on the sundial?  Do they just get to try again, or is there feedback (Buzzer?  Gout of flame?  Room starts flooding?)?  If they try the hero's birthday, rather than the day before, does it tell them \"You are too late; their journey has begun\", or do they just guess again?\n\nHow about if they walk through the wrong door?  It sounds like you've set up some consequences, so it doesn't have to end if they guess wrong.  That's good, as long as one or two wrong guesses won't kill them outright.  Max 5 tries to get it right.  You could always have the gems flare up with something representing their appropriate effect if the players guess wrong; the burning of the red gem might spark their memories.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok, that sounds good for a riddle, but there&amp;#39;s always a risk that connecting the clue with the puzzle just doesn&amp;#39;t click.  That&amp;#39;s what you need to plan around with these.  It might help to refresh the sources of some of those clues, even just something at the beginning of your story referring to the old heroes by their epithets.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m assuming this story is going to be a printed handout so they can refer back to it without scrambling to take notes as you read it.  If you feel mildly artistic, you can scatter line drawings around the borders with pictures that just happen to match pictures in the room where the passage next to the picture is relevant.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ocean&amp;#39;s birth&amp;quot; referring to &amp;quot;Ocean&amp;#39;s Fury&amp;#39;s birth&amp;quot; may not be immediately clear, but that&amp;#39;s one place where you can write up a hint card.  Assuming they don&amp;#39;t get it right away, what happens if they do some trial and error on the sundial?  Do they just get to try again, or is there feedback (Buzzer?  Gout of flame?  Room starts flooding?)?  If they try the hero&amp;#39;s birthday, rather than the day before, does it tell them &amp;quot;You are too late; their journey has begun&amp;quot;, or do they just guess again?&lt;/p&gt;\n\n&lt;p&gt;How about if they walk through the wrong door?  It sounds like you&amp;#39;ve set up some consequences, so it doesn&amp;#39;t have to end if they guess wrong.  That&amp;#39;s good, as long as one or two wrong guesses won&amp;#39;t kill them outright.  Max 5 tries to get it right.  You could always have the gems flare up with something representing their appropriate effect if the players guess wrong; the burning of the red gem might spark their memories.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgdf3nl", "score_hidden": false, "stickied": false, "created": 1492461010.0, "created_utc": 1492432210.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dgdpewt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hacksoncode", "parent_id": "t1_dgdcnvo", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Basically, my answer to this problem is to have many clues up my sleeve, that can be discovered by the PCs using their skills if the first clue is insufficient. \n\nJust to give one example from your description, maybe they don't get that the red gem represents fire, for example, but a perception roll could see a small flame burning in the gemstone. \n\nOr another one, maybe they aren't sure whether the \"eve of the ocean's birth\" means the night before or the night *of* the birthday (both are legitimate interpretations), but perhaps either both work, or there's some knowledge roll that can be made to understand what the language of the time of the old heroes would mean by that... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Basically, my answer to this problem is to have many clues up my sleeve, that can be discovered by the PCs using their skills if the first clue is insufficient. &lt;/p&gt;\n\n&lt;p&gt;Just to give one example from your description, maybe they don&amp;#39;t get that the red gem represents fire, for example, but a perception roll could see a small flame burning in the gemstone. &lt;/p&gt;\n\n&lt;p&gt;Or another one, maybe they aren&amp;#39;t sure whether the &amp;quot;eve of the ocean&amp;#39;s birth&amp;quot; means the night before or the night &lt;em&gt;of&lt;/em&gt; the birthday (both are legitimate interpretations), but perhaps either both work, or there&amp;#39;s some knowledge roll that can be made to understand what the language of the time of the old heroes would mean by that... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgdpewt", "score_hidden": false, "stickied": false, "created": 1492475143.0, "created_utc": 1492446343.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcnvo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AgentBae", "parent_id": "t1_dgd0v5b", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Well I've only got a few thought out, but a little context. The dungeon is a tomb/temple built to honor a long forgotten band of hero's. The party is actually the reincarnation of said group (they are aware of this) \nOn the entrance of the place I was gonna put a little rhyme/story telling the story of the group, and the party is going to have to piece together the answers in the dungeon based on that. \nLike one I have thought of is a line somewhere along the lines of \"on the eve of the oceans birth, they walked through the fire, for the earth brought madness, the sky pain and the light blinded them and the darkness subdued them\" (one of the hero's in the past was commonly referred to as the \"oceans fury\") and two puzzles out of that being a large room of a sun dial that does months and days, some levers to move the dial to what ever day they need. \nThe answer is to move the dial to the correct day, the day before the old hero's birthday, which the party does have access to said date. Which causes a ring of five arcs to rise around them, each with a gemstone over it, one red, brown, blue, white and black. They have to go through the red one", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I&amp;#39;ve only got a few thought out, but a little context. The dungeon is a tomb/temple built to honor a long forgotten band of hero&amp;#39;s. The party is actually the reincarnation of said group (they are aware of this) \nOn the entrance of the place I was gonna put a little rhyme/story telling the story of the group, and the party is going to have to piece together the answers in the dungeon based on that. \nLike one I have thought of is a line somewhere along the lines of &amp;quot;on the eve of the oceans birth, they walked through the fire, for the earth brought madness, the sky pain and the light blinded them and the darkness subdued them&amp;quot; (one of the hero&amp;#39;s in the past was commonly referred to as the &amp;quot;oceans fury&amp;quot;) and two puzzles out of that being a large room of a sun dial that does months and days, some levers to move the dial to what ever day they need. \nThe answer is to move the dial to the correct day, the day before the old hero&amp;#39;s birthday, which the party does have access to said date. Which causes a ring of five arcs to rise around them, each with a gemstone over it, one red, brown, blue, white and black. They have to go through the red one&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgdcnvo", "score_hidden": false, "stickied": false, "created": 1492455075.0, "created_utc": 1492426275.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dgd14lj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "auner01", "parent_id": "t1_dgd0v5b", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Excellent points, especially the clue cards. DMAcademy or loremasters might be good places to test out a puzzle also.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent points, especially the clue cards. DMAcademy or loremasters might be good places to test out a puzzle also.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgd14lj", "score_hidden": false, "stickied": false, "created": 1492427761.0, "created_utc": 1492398961.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dgdt29c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lazin", "parent_id": "t1_dgd0v5b", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "&gt; **Don't make the puzzle a roadblock.**\n\nThis is a very important note, I've been in a game before were we wouldn't figure out a solution to a maze puzzle, so every time we tried some solution, turning this sundial type thing, we walked through part of the maze, and hit a new encounter. We didn't have any feeling of if anything we did got us closer, or if anything we tried was right, or completely wrong, and after 3 combat encounters it seemed like were still at square 1. It was very demotivational, feeling stuck like that.\n\nOP, IF they can't figure out a solution, and you want to punish them with a trap/spell, combat encounter, remember to after each of these, to give them something that shows them they've gotten part of the solution.\n\nEvery puzzle should have several solutions.\n\nOne I used was a mirror-room in this lost civilization dungeon, it had text in \"ancient Draconic\" around it, the chracters with draconic, arcana skill, and religion skill could roll to understand the text, that basically said \"Talk to yourself, to end the hostility\". After trying to decipher the text, and rolling very poorly, the character with the lowest will save falls unconscious, and is \"trapped\" in the mirror.\n\nThey could smash the mirror, giving damage to the person who got sucked in and have to fight a shadow, or doppelganger or something (depends on the level), or continue to try to communicate with the trapped character, each round with new checks they get more words translated, and could succeed by dragging the body over to the mirror and have the trapped person talk with themselves. Worst comes to worst, the person ends up unconscious with 0 HP, but still alive.\n\nAt any rate, they could smash through it for more combat, they could use spells to understand the text if they had them, they could role checks to understand the riddle, or failing all that, they could still move on, just with more lost HP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;Don&amp;#39;t make the puzzle a roadblock.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is a very important note, I&amp;#39;ve been in a game before were we wouldn&amp;#39;t figure out a solution to a maze puzzle, so every time we tried some solution, turning this sundial type thing, we walked through part of the maze, and hit a new encounter. We didn&amp;#39;t have any feeling of if anything we did got us closer, or if anything we tried was right, or completely wrong, and after 3 combat encounters it seemed like were still at square 1. It was very demotivational, feeling stuck like that.&lt;/p&gt;\n\n&lt;p&gt;OP, IF they can&amp;#39;t figure out a solution, and you want to punish them with a trap/spell, combat encounter, remember to after each of these, to give them something that shows them they&amp;#39;ve gotten part of the solution.&lt;/p&gt;\n\n&lt;p&gt;Every puzzle should have several solutions.&lt;/p&gt;\n\n&lt;p&gt;One I used was a mirror-room in this lost civilization dungeon, it had text in &amp;quot;ancient Draconic&amp;quot; around it, the chracters with draconic, arcana skill, and religion skill could roll to understand the text, that basically said &amp;quot;Talk to yourself, to end the hostility&amp;quot;. After trying to decipher the text, and rolling very poorly, the character with the lowest will save falls unconscious, and is &amp;quot;trapped&amp;quot; in the mirror.&lt;/p&gt;\n\n&lt;p&gt;They could smash the mirror, giving damage to the person who got sucked in and have to fight a shadow, or doppelganger or something (depends on the level), or continue to try to communicate with the trapped character, each round with new checks they get more words translated, and could succeed by dragging the body over to the mirror and have the trapped person talk with themselves. Worst comes to worst, the person ends up unconscious with 0 HP, but still alive.&lt;/p&gt;\n\n&lt;p&gt;At any rate, they could smash through it for more combat, they could use spells to understand the text if they had them, they could role checks to understand the riddle, or failing all that, they could still move on, just with more lost HP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgdt29c", "score_hidden": false, "stickied": false, "created": 1492479198.0, "created_utc": 1492450398.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0v5b", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "NullOperative", "parent_id": "t3_65sqt5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Some thoughts on the topic:\n\n1. Learn what types of puzzles your players like.  I've included a few puzzles in my games; one of them, a tangram (\"reassemble the broken tablet\"), was only added because I learned one of my players enjoys them.  If you throw a word square at the player who does crossword puzzles, you have less to worry about than if you give that player a cryptogram or a logic puzzle.\n\n2. Don't make the puzzle a roadblock.  Try, if at all possible, to avoid making it so that the only way to advance the adventure is to solve the puzzle.  Let them avoid a fight, avoid damage, make a much easier skill check, get some extra treasure, or find a shortcut.  But don't make things come to a halt.  Build in a safety valve to keep the puzzle from ruining the session in case they can't solve it.\n\n3. Let character skill make up for player confusion.  Assemble a list of increasingly obvious hints and let a character with the appropriate knowledge skill roll for them.  If you're worried about the players not wanting all the hints on a good roll, write each one on an index card and give the players a stack of the ones they've earned through skill checks, with the vaguest on top and the most obvious on the bottom, and tell them it's up to them how many they flip over.\n\n4. If your players don't frequent this sub, pose a proposed puzzle here and ask people to solve it and give feedback on what wasn't clear, what was too obvious, and what just took too darned long.  If your players do lurk here, maybe find some folks you can PM.  I don't claim to be an expert, but I'd be happy to be a sounding board.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some thoughts on the topic:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Learn what types of puzzles your players like.  I&amp;#39;ve included a few puzzles in my games; one of them, a tangram (&amp;quot;reassemble the broken tablet&amp;quot;), was only added because I learned one of my players enjoys them.  If you throw a word square at the player who does crossword puzzles, you have less to worry about than if you give that player a cryptogram or a logic puzzle.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Don&amp;#39;t make the puzzle a roadblock.  Try, if at all possible, to avoid making it so that the only way to advance the adventure is to solve the puzzle.  Let them avoid a fight, avoid damage, make a much easier skill check, get some extra treasure, or find a shortcut.  But don&amp;#39;t make things come to a halt.  Build in a safety valve to keep the puzzle from ruining the session in case they can&amp;#39;t solve it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Let character skill make up for player confusion.  Assemble a list of increasingly obvious hints and let a character with the appropriate knowledge skill roll for them.  If you&amp;#39;re worried about the players not wanting all the hints on a good roll, write each one on an index card and give the players a stack of the ones they&amp;#39;ve earned through skill checks, with the vaguest on top and the most obvious on the bottom, and tell them it&amp;#39;s up to them how many they flip over.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If your players don&amp;#39;t frequent this sub, pose a proposed puzzle here and ask people to solve it and give feedback on what wasn&amp;#39;t clear, what was too obvious, and what just took too darned long.  If your players do lurk here, maybe find some folks you can PM.  I don&amp;#39;t claim to be an expert, but I&amp;#39;d be happy to be a sounding board.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgd0v5b", "score_hidden": false, "stickied": false, "created": 1492427383.0, "created_utc": 1492398583.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dgd6373", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Dachimotsu", "parent_id": "t3_65sqt5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "When it comes to puzzle hints, it's actually impossible to be too obvious. Never ever try to be subtle.\n\nYou ever play a point-and-click adventure and get stuck on one of its puzzles? Then you look up the solution and it seems SO obvious to you now? That's how players feel when their DMs give them riddles with equally-cryptic hints.\n\nBe as blunt as possible with your hints. Your players will STILL feel smart for solving them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When it comes to puzzle hints, it&amp;#39;s actually impossible to be too obvious. Never ever try to be subtle.&lt;/p&gt;\n\n&lt;p&gt;You ever play a point-and-click adventure and get stuck on one of its puzzles? Then you look up the solution and it seems SO obvious to you now? That&amp;#39;s how players feel when their DMs give them riddles with equally-cryptic hints.&lt;/p&gt;\n\n&lt;p&gt;Be as blunt as possible with your hints. Your players will STILL feel smart for solving them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgd6373", "score_hidden": false, "stickied": false, "created": 1492436315.0, "created_utc": 1492407515.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dgd47jv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ptrst", "parent_id": "t3_65sqt5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "My biggest piece of advice is to not make solving the puzzle mandatory. With most puzzles (at least the ones I've encountered in RPGs) I either understand them immediately or they make no sense to me. I don't think I've seen a puzzle in a game that took me a couple of minutes to figure out and was satisfying; I either immediately solve it or will sit there until someone else comes up with the solution. Too many times, the \"sitting there\" has taken a very, very long time because nobody else understands it either, but the plot says we have to get through this door (which can literally only be opened by answering a riddle).\n\nPuzzles are cool things to put in for an extra treasure or flavor - a map, or a door leading to a hidden cache, or a way to bypass some enemies or something like that. But if you lock the plot behind a puzzle, and nobody gets the puzzle, you're going to have some frustrated, bored players on your hands.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My biggest piece of advice is to not make solving the puzzle mandatory. With most puzzles (at least the ones I&amp;#39;ve encountered in RPGs) I either understand them immediately or they make no sense to me. I don&amp;#39;t think I&amp;#39;ve seen a puzzle in a game that took me a couple of minutes to figure out and was satisfying; I either immediately solve it or will sit there until someone else comes up with the solution. Too many times, the &amp;quot;sitting there&amp;quot; has taken a very, very long time because nobody else understands it either, but the plot says we have to get through this door (which can literally only be opened by answering a riddle).&lt;/p&gt;\n\n&lt;p&gt;Puzzles are cool things to put in for an extra treasure or flavor - a map, or a door leading to a hidden cache, or a way to bypass some enemies or something like that. But if you lock the plot behind a puzzle, and nobody gets the puzzle, you&amp;#39;re going to have some frustrated, bored players on your hands.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgd47jv", "score_hidden": false, "stickied": false, "created": 1492432641.0, "created_utc": 1492403841.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dgd71s0", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "CristolGDM", "parent_id": "t1_dgd4snl", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "The opposite is true too: they sometimes see a puzzle where there is none, and start solving it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The opposite is true too: they sometimes see a puzzle where there is none, and start solving it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgd71s0", "score_hidden": false, "stickied": false, "created": 1492438360.0, "created_utc": 1492409560.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd4snl", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "willow625", "parent_id": "t3_65sqt5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Honestly, I gave up trying to do formal puzzles. Instead, I just come up with a situation and see what my players come up with to get out of it. It always seemed like every time I would try to plan how they would solve a puzzle they would come up with something completely different. I think they'll solve a riddle, they decide to just hack through the door. I think they'll remember the special item I gave them two sessions ago, no one remembered to write it down so they'll just torture some NPC for the info. \n\nI finally decided that just rolling with whatever they come up with is more fun for both them and me. I get to reward them for coming up with ridiculous ideas, and they get to give me ideas that are way better than anything I would come up with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, I gave up trying to do formal puzzles. Instead, I just come up with a situation and see what my players come up with to get out of it. It always seemed like every time I would try to plan how they would solve a puzzle they would come up with something completely different. I think they&amp;#39;ll solve a riddle, they decide to just hack through the door. I think they&amp;#39;ll remember the special item I gave them two sessions ago, no one remembered to write it down so they&amp;#39;ll just torture some NPC for the info. &lt;/p&gt;\n\n&lt;p&gt;I finally decided that just rolling with whatever they come up with is more fun for both them and me. I get to reward them for coming up with ridiculous ideas, and they get to give me ideas that are way better than anything I would come up with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgd4snl", "score_hidden": false, "stickied": false, "created": 1492433726.0, "created_utc": 1492404926.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dgdcfha", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AgentBae", "parent_id": "t1_dgdazwy", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "That's actually very helpful. Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s actually very helpful. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgdcfha", "score_hidden": false, "stickied": false, "created": 1492454358.0, "created_utc": 1492425558.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dgdiwb8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rfisher", "parent_id": "t1_dgdazwy", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "For me &amp; my group, while I try to provide for those players who want to get into the lore of the game world, I also want to provide for those who don’t. So my riddles are generally geared to the players’ context rather than the characters’. (And I let them know that.)\n\nIt is an abstraction. The same way I wouldn’t expect everyone to learn the languages of the game world and only speak in them. English is a stand-in for the in-game languages. The riddles are stand-ins for the in-game riddles.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me &amp;amp; my group, while I try to provide for those players who want to get into the lore of the game world, I also want to provide for those who don’t. So my riddles are generally geared to the players’ context rather than the characters’. (And I let them know that.)&lt;/p&gt;\n\n&lt;p&gt;It is an abstraction. The same way I wouldn’t expect everyone to learn the languages of the game world and only speak in them. English is a stand-in for the in-game languages. The riddles are stand-ins for the in-game riddles.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgdiwb8", "score_hidden": false, "stickied": false, "created": 1492467237.0, "created_utc": 1492438437.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdazwy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Kangalooney", "parent_id": "t3_65sqt5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Concerning riddles; if you are going to use them then a riddle needs social, historical or situational context.\n\nLet us look at a literary favourite amongst roleplayers, The Hobbit. Specifically the Riddles in the Dark chapter.\n\nLook at their riddles in turn, each one looks pretty straight forward but the answers are deeper. Gollum riddles about life in the dark in the mountains, Bilbo riddles about life in the shire. The context, the situation and location make the answers easier for both parties; Bilbo is in the mountains and can see how Gollum lives and Gollum was once a hobbit living in conditions similar to the shire. Without that situational context those riddles are either nonsensical or can have different answers.\n\nTake the egg riddle, for example. To Bilbo and Gollum the answer is obvious as eggs are, or were, a significant part of their life. But what about a dwarf? To a dwarf the answer would be more literal and obviously be a mine, or perhaps a gold seam. How about an elf? The answer could just as easily be the sky or the heavens, a great box with a golden treasure (the sun), or more philosophically, life itself.\n\nLet's look at another staple of riddles; what gets shorter the more you use it? Most people would answer a candle or pencil, mostly depending on the answer given last time they were asked. But what about context? Context, who is answering, where the riddle is asked, and who is asking, can alter that answer a lot:\n\n* A courier or shop clerk would say a ball of twine.\n\n* A travelling merchant or pilgrim would say the road.\n\n* A ranger would say a rope.\n\n* A scribe would say a pencil.\n\n* A scholar would say a candle.\n\n* A farmer would say the day.\n\n* A bitter old man would say life.\n\nEtcetera, etcetera, etcetera.\n\nEven the good old staple, the riddle of the sphinx, is subject to contextual answers as shown in the movie Mirrormask. The original riddle, at least the one most of us are familiar with, is also very much contextual in use. The riddle reflects Oedipus' journey through life, starting out as a child, growing as a man then ending as a cripple.\n\nThe important factor for a riddle to work is that everyone be on the same contextual page, otherwise someone can give an answer that is obviously correct but it is still wrong for the person asking the riddle.\n\nSo, if you are going to use riddles then keep the riddle within the context of where and how it is being asked. Build your riddles around the people, events and locations of an adventure.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Concerning riddles; if you are going to use them then a riddle needs social, historical or situational context.&lt;/p&gt;\n\n&lt;p&gt;Let us look at a literary favourite amongst roleplayers, The Hobbit. Specifically the Riddles in the Dark chapter.&lt;/p&gt;\n\n&lt;p&gt;Look at their riddles in turn, each one looks pretty straight forward but the answers are deeper. Gollum riddles about life in the dark in the mountains, Bilbo riddles about life in the shire. The context, the situation and location make the answers easier for both parties; Bilbo is in the mountains and can see how Gollum lives and Gollum was once a hobbit living in conditions similar to the shire. Without that situational context those riddles are either nonsensical or can have different answers.&lt;/p&gt;\n\n&lt;p&gt;Take the egg riddle, for example. To Bilbo and Gollum the answer is obvious as eggs are, or were, a significant part of their life. But what about a dwarf? To a dwarf the answer would be more literal and obviously be a mine, or perhaps a gold seam. How about an elf? The answer could just as easily be the sky or the heavens, a great box with a golden treasure (the sun), or more philosophically, life itself.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s look at another staple of riddles; what gets shorter the more you use it? Most people would answer a candle or pencil, mostly depending on the answer given last time they were asked. But what about context? Context, who is answering, where the riddle is asked, and who is asking, can alter that answer a lot:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;A courier or shop clerk would say a ball of twine.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A travelling merchant or pilgrim would say the road.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A ranger would say a rope.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A scribe would say a pencil.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A scholar would say a candle.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A farmer would say the day.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A bitter old man would say life.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Etcetera, etcetera, etcetera.&lt;/p&gt;\n\n&lt;p&gt;Even the good old staple, the riddle of the sphinx, is subject to contextual answers as shown in the movie Mirrormask. The original riddle, at least the one most of us are familiar with, is also very much contextual in use. The riddle reflects Oedipus&amp;#39; journey through life, starting out as a child, growing as a man then ending as a cripple.&lt;/p&gt;\n\n&lt;p&gt;The important factor for a riddle to work is that everyone be on the same contextual page, otherwise someone can give an answer that is obviously correct but it is still wrong for the person asking the riddle.&lt;/p&gt;\n\n&lt;p&gt;So, if you are going to use riddles then keep the riddle within the context of where and how it is being asked. Build your riddles around the people, events and locations of an adventure.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgdazwy", "score_hidden": false, "stickied": false, "created": 1492449577.0, "created_utc": 1492420777.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dgd96it", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PixelCanuck", "parent_id": "t3_65sqt5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I just finished playing through Legend of Grimrock, and one of the clever puzzle techniques I found they used a few times was to give you a very obvious answer to a puzzle,  then let you figure out where it applies. The puzzle then moves from figuring out how to solve X, to figuring out which given solution applies here. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just finished playing through Legend of Grimrock, and one of the clever puzzle techniques I found they used a few times was to give you a very obvious answer to a puzzle,  then let you figure out where it applies. The puzzle then moves from figuring out how to solve X, to figuring out which given solution applies here. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgd96it", "score_hidden": false, "stickied": false, "created": 1492443518.0, "created_utc": 1492414718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dgdj1kn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rfisher", "parent_id": "t3_65sqt5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "It is better to give away surprises than to seem unfair.\n\nThat is one of my cardinal rules of the RPG judge. Start making the clues overly obvious. As you gain experience with your group, you’ll learn to balance it more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is better to give away surprises than to seem unfair.&lt;/p&gt;\n\n&lt;p&gt;That is one of my cardinal rules of the RPG judge. Start making the clues overly obvious. As you gain experience with your group, you’ll learn to balance it more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgdj1kn", "score_hidden": false, "stickied": false, "created": 1492467438.0, "created_utc": 1492438638.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dge3ri6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kfsb", "parent_id": "t3_65sqt5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "logic puzzles are really good, as well as riddles. as others have said, keep the puzzles as special goodies, not roadblocks to stories.\n\nsome basic logic puzzles would be 3 doors with writing on them, each saying which door is the correct door and only one is telling the truth.\n\nor needing to place a series of gems in a certain order to unlock a gateway- give them a riddle that reveals the order if they can solve it.\n\notherwise, print out a picture and cut it up and make it into an actual puzzle. then grab a sand timer from another board game, flip it over, and have them solve the puzzle before the sand runs out.\n\ndoesn't matter how easy the puzzle is, they'll all freak out once that sand starts pouring out", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;logic puzzles are really good, as well as riddles. as others have said, keep the puzzles as special goodies, not roadblocks to stories.&lt;/p&gt;\n\n&lt;p&gt;some basic logic puzzles would be 3 doors with writing on them, each saying which door is the correct door and only one is telling the truth.&lt;/p&gt;\n\n&lt;p&gt;or needing to place a series of gems in a certain order to unlock a gateway- give them a riddle that reveals the order if they can solve it.&lt;/p&gt;\n\n&lt;p&gt;otherwise, print out a picture and cut it up and make it into an actual puzzle. then grab a sand timer from another board game, flip it over, and have them solve the puzzle before the sand runs out.&lt;/p&gt;\n\n&lt;p&gt;doesn&amp;#39;t matter how easy the puzzle is, they&amp;#39;ll all freak out once that sand starts pouring out&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dge3ri6", "score_hidden": false, "stickied": false, "created": 1492491192.0, "created_utc": 1492462392.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65sqt5", "likes": null, "replies": "", "user_reports": [], "id": "dge9wo4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thexar", "parent_id": "t3_65sqt5", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "More important than the puzzle is the way it affects the game world. As in, it shouldn't be absolutely necessary to complete the puzzle to move the adventure forward. I once posed a variant of liars and truth tellers. After 20 minutes of disappointment from not getting a repeatable answer, one player said \"At some point we should be able to roll some dice, and get the answer.\"\n\nTo which I replied, \"At some point, you can just pick a path and move on.\" So they spit up, and slowly moved up both caves intending to be able to run to the teams aid that find the trap. Phase two of this gag is, both tunnels are well over a mile before the good or bad becomes apparent. They picked the wrong path, and eventually were dumped into a big room with a big monster they had to fight before returning to the other path.\n\nThere's a common puzzle that involves a variety of weights before a large scale, and a poem that emphasizes the need for balance. The gag is: the balanced set of weights must be set on the scales at the same time. If one person tries to quickly set the weights alone the party is doomed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;More important than the puzzle is the way it affects the game world. As in, it shouldn&amp;#39;t be absolutely necessary to complete the puzzle to move the adventure forward. I once posed a variant of liars and truth tellers. After 20 minutes of disappointment from not getting a repeatable answer, one player said &amp;quot;At some point we should be able to roll some dice, and get the answer.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;To which I replied, &amp;quot;At some point, you can just pick a path and move on.&amp;quot; So they spit up, and slowly moved up both caves intending to be able to run to the teams aid that find the trap. Phase two of this gag is, both tunnels are well over a mile before the good or bad becomes apparent. They picked the wrong path, and eventually were dumped into a big room with a big monster they had to fight before returning to the other path.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a common puzzle that involves a variety of weights before a large scale, and a poem that emphasizes the need for balance. The gag is: the balanced set of weights must be set on the scales at the same time. If one person tries to quickly set the weights alone the party is doomed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dge9wo4", "score_hidden": false, "stickied": false, "created": 1492498833.0, "created_utc": 1492470033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]