[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "rpg", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My last session did not go anywhere near what I planned.  We&amp;#39;re nearing the end of a long running (2-ish years now) weekly Pathfinder campaign, and my PC&amp;#39;s just learned the weakness of a seemingly invincible Big Bad who had been an acting antagonist since early on.  I &lt;em&gt;assumed&lt;/em&gt; the PC&amp;#39;s would make a straight line for the Bad&amp;#39;s estate to confront him and had a whole session planned to take place inside the estate.&lt;/p&gt;\n\n&lt;p&gt;But they were in no rush, instead spending time dicking around the area of their last adventure, interacting with NPCs and arguing with one another about trust (note to other GMs: Making one of your villains the Paragon of Deception, a living embodiment of lies and intrigue, is a great way to produce a particularly paranoid party).  One of my PC&amp;#39;s, a viking-type Skald who goes by Grim, decided that he needed to go threaten the region&amp;#39;s new lord (for reasons that would take a whole &amp;#39;nother post to explain).  This lord was a former antihero adventurer type and wasn&amp;#39;t about to take these threats sitting down, and a fight breaks out.&lt;/p&gt;\n\n&lt;p&gt;Flash to a few hours in the session later, and Grim is dead, the lord is dead, another PC has gotten his soul sucked into a demon spear, and one of the PC&amp;#39;s longest standing allies is near death with his trust in the PC&amp;#39;s shattered.&lt;/p&gt;\n\n&lt;p&gt;Now, the PC&amp;#39;s are already at that point in D&amp;amp;D/Pathfinder were death isn&amp;#39;t much of a consequence and they use their Staff of Life to revive Grim.  however the other fallen PC, the warrior Shen, provides a greater challenge since they can&amp;#39;t retrieve his soul from the spear.  They negotiate to get the spear by agreeing to revive the lord that Grim killed, then take it to the most powerful good guy they know, the Paragon of Courage.&lt;/p&gt;\n\n&lt;p&gt;Now, in this setting, becoming a Paragon, good or evil, requires a great personal sacrifice.  In Courage&amp;#39;s case, he gave up his eyesight.  He examines the spear and gives the PC&amp;#39;s two options: he can destroy the spear, thus freeing Shen&amp;#39;s soul, however, due to the nature of the spear, this would not allow them to call Shen&amp;#39;s soul back through revival spells.  The other option was that Courage calls out the demon in the spear and destroys it, thus freeing Shen&amp;#39;s soul up for Revival, but Courage would require additional power to accomplish this.&lt;/p&gt;\n\n&lt;p&gt;Basically, he would require one of the PC&amp;#39;s to join in his power, which require the PC also give up their eyesight.&lt;/p&gt;\n\n&lt;p&gt;Grim immediately volunteered, feeling somewhat guilty about the situation, and wouldn&amp;#39;t listen to any argument otherwise.  He gave up his eyesight, Courage destroyed the demon, and Shen&amp;#39;s soul was freed, then revived.&lt;/p&gt;\n\n&lt;p&gt;By the end of this session, they had made no progress in defeating the Big Bad, but Grim was now blind, they were no longer welcome in the lord&amp;#39;s region, and their oldest ally no longer completely trusted them.  Very rarely have a been so surprised at a session&amp;#39;s outcome.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR;&lt;/strong&gt; PC threatens a lord, shit goes down, another of the PC&amp;#39;s gets his soul trapped in a demon spear, and the PC that started all of this had to give up his eyesight to get him back.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My last session did not go anywhere near what I planned.  We're nearing the end of a long running (2-ish years now) weekly Pathfinder campaign, and my PC's just learned the weakness of a seemingly invincible Big Bad who had been an acting antagonist since early on.  I *assumed* the PC's would make a straight line for the Bad's estate to confront him and had a whole session planned to take place inside the estate.\n\nBut they were in no rush, instead spending time dicking around the area of their last adventure, interacting with NPCs and arguing with one another about trust (note to other GMs: Making one of your villains the Paragon of Deception, a living embodiment of lies and intrigue, is a great way to produce a particularly paranoid party).  One of my PC's, a viking-type Skald who goes by Grim, decided that he needed to go threaten the region's new lord (for reasons that would take a whole 'nother post to explain).  This lord was a former antihero adventurer type and wasn't about to take these threats sitting down, and a fight breaks out.\n\nFlash to a few hours in the session later, and Grim is dead, the lord is dead, another PC has gotten his soul sucked into a demon spear, and one of the PC's longest standing allies is near death with his trust in the PC's shattered.\n\nNow, the PC's are already at that point in D&amp;D/Pathfinder were death isn't much of a consequence and they use their Staff of Life to revive Grim.  however the other fallen PC, the warrior Shen, provides a greater challenge since they can't retrieve his soul from the spear.  They negotiate to get the spear by agreeing to revive the lord that Grim killed, then take it to the most powerful good guy they know, the Paragon of Courage.\n\nNow, in this setting, becoming a Paragon, good or evil, requires a great personal sacrifice.  In Courage's case, he gave up his eyesight.  He examines the spear and gives the PC's two options: he can destroy the spear, thus freeing Shen's soul, however, due to the nature of the spear, this would not allow them to call Shen's soul back through revival spells.  The other option was that Courage calls out the demon in the spear and destroys it, thus freeing Shen's soul up for Revival, but Courage would require additional power to accomplish this.\n\nBasically, he would require one of the PC's to join in his power, which require the PC also give up their eyesight.\n\nGrim immediately volunteered, feeling somewhat guilty about the situation, and wouldn't listen to any argument otherwise.  He gave up his eyesight, Courage destroyed the demon, and Shen's soul was freed, then revived.\n\nBy the end of this session, they had made no progress in defeating the Big Bad, but Grim was now blind, they were no longer welcome in the lord's region, and their oldest ally no longer completely trusted them.  Very rarely have a been so surprised at a session's outcome.\n\n**TLDR;** PC threatens a lord, shit goes down, another of the PC's gets his soul trapped in a demon spear, and the PC that started all of this had to give up his eyesight to get him back.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65z1z8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 96, "report_reasons": null, "author": "PFDavids", "saved": false, "mod_reports": [], "name": "t3_65z1z8", "subreddit_name_prefixed": "r/rpg", "approved_by": null, "over_18": false, "domain": "self.rpg", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2s", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/rpg/comments/65z1z8/so_i_blinded_one_of_my_pcs/", "num_reports": null, "locked": false, "stickied": false, "created": 1492498992.0, "url": "https://www.reddit.com/r/rpg/comments/65z1z8/so_i_blinded_one_of_my_pcs/", "author_flair_text": null, "quarantine": false, "title": "So I blinded one of my PC's...", "created_utc": 1492470192.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 96}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": "", "user_reports": [], "id": "dgemfst", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CristolGDM", "parent_id": "t1_dgeevst", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "[Kind of like this?](http://imgur.com/gXajqIP)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://imgur.com/gXajqIP\"&gt;Kind of like this?&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgemfst", "score_hidden": true, "stickied": false, "created": 1492514493.0, "created_utc": 1492485693.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeevst", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "PFDavids", "parent_id": "t1_dgeefhy", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Pretty much my thoughts.  I'm thinking that the remaining villains are going to have some illusion specialists amongst their ranks, who are going to be in for a hell of a surprise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pretty much my thoughts.  I&amp;#39;m thinking that the remaining villains are going to have some illusion specialists amongst their ranks, who are going to be in for a hell of a surprise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgeevst", "score_hidden": false, "stickied": false, "created": 1492505204.0, "created_utc": 1492476404.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": "", "user_reports": [], "id": "dgejmov", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "imariaprime", "parent_id": "t1_dgeh869", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "I've done a lot of this sort of thing, but I don't think I've ever seen it codified quite so clearly.\n\nLetting the players feel the impact of their actions has always been a big deal in my games; I threw a party forward in time 50 years once, and they came out as legends. A young girl they'd saved and been particularly kind towards ended up a revolution leader in a later war, inspired directly by them. That sort of thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve done a lot of this sort of thing, but I don&amp;#39;t think I&amp;#39;ve ever seen it codified quite so clearly.&lt;/p&gt;\n\n&lt;p&gt;Letting the players feel the impact of their actions has always been a big deal in my games; I threw a party forward in time 50 years once, and they came out as legends. A young girl they&amp;#39;d saved and been particularly kind towards ended up a revolution leader in a later war, inspired directly by them. That sort of thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgejmov", "score_hidden": true, "stickied": false, "created": 1492510958.0, "created_utc": 1492482158.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeh869", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "trampolinebears", "parent_id": "t1_dgeft78", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "In our last game, the party was visiting a chief's home for a festival, and they were entertained by a story told by a traveling bard.  The story was about something they had done a few adventures earlier, though it had gotten mangled pretty badly in the telling.\n\nThe players really, really enjoyed it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In our last game, the party was visiting a chief&amp;#39;s home for a festival, and they were entertained by a story told by a traveling bard.  The story was about something they had done a few adventures earlier, though it had gotten mangled pretty badly in the telling.&lt;/p&gt;\n\n&lt;p&gt;The players really, really enjoyed it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgeh869", "score_hidden": false, "stickied": false, "created": 1492508125.0, "created_utc": 1492479325.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeft78", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "imariaprime", "parent_id": "t1_dgeefhy", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Man, these are great rules for dealing with a PC's sacrifice. I'm going to have to remember these as written.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, these are great rules for dealing with a PC&amp;#39;s sacrifice. I&amp;#39;m going to have to remember these as written.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgeft78", "score_hidden": false, "stickied": false, "created": 1492506342.0, "created_utc": 1492477542.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": "", "user_reports": [], "id": "dgeh4kk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "trampolinebears", "parent_id": "t1_dgegrbt", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Instead, let them listen through the ears of anyone whose blood they have spilled.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Instead, let them listen through the ears of anyone whose blood they have spilled.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgeh4kk", "score_hidden": false, "stickied": false, "created": 1492507998.0, "created_utc": 1492479198.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgegrbt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "wrgrant", "parent_id": "t1_dgeefhy", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Off the top if my head, i would make the skald deal with things being blind for a while, but down the road give them a familiar of some sort - perhaps a raven they can see through the eyes of by magical means - after they earn it if course :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Off the top if my head, i would make the skald deal with things being blind for a while, but down the road give them a familiar of some sort - perhaps a raven they can see through the eyes of by magical means - after they earn it if course :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgegrbt", "score_hidden": false, "stickied": false, "created": 1492507534.0, "created_utc": 1492478734.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeefhy", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "trampolinebears", "parent_id": "t3_65z1z8", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Respect the PC's sacrifice, honor the character, put the spotlight on them, and don't cheapen it by giving them their eyesight back any time soon.\n\n**Honor the character**  \nIf they've just made a big sacrifice to do something great and noble, let it be known.  Random strangers buy them drinks.  Let them overhear a song being sung or a story being told that's about this character, and let them realize who it's about without you just telling them outright.\n\n**Put them in situations where they can shine**  \nMake situations for the party to run across where the blind character can shine.  If no one can see, but only one character has experience with this, they're the obvious leader.  Practice describing whole scenes without a single visual description.\n\n**Don't cheapen it**  \nThe player made the choice to pay a great cost to achieve a high goal.  If they get their character's eyesight back quickly, was the cost really that great?  And if the cost wasn't actually that great, was the goal truly so high?  Let their decision matter.\n\n(I ran a game with a blind character for several years, and it made for an interesting and enjoyable challenge.  Feel free to ask me questions if you want to know more.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Respect the PC&amp;#39;s sacrifice, honor the character, put the spotlight on them, and don&amp;#39;t cheapen it by giving them their eyesight back any time soon.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Honor the character&lt;/strong&gt;&lt;br/&gt;\nIf they&amp;#39;ve just made a big sacrifice to do something great and noble, let it be known.  Random strangers buy them drinks.  Let them overhear a song being sung or a story being told that&amp;#39;s about this character, and let them realize who it&amp;#39;s about without you just telling them outright.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Put them in situations where they can shine&lt;/strong&gt;&lt;br/&gt;\nMake situations for the party to run across where the blind character can shine.  If no one can see, but only one character has experience with this, they&amp;#39;re the obvious leader.  Practice describing whole scenes without a single visual description.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Don&amp;#39;t cheapen it&lt;/strong&gt;&lt;br/&gt;\nThe player made the choice to pay a great cost to achieve a high goal.  If they get their character&amp;#39;s eyesight back quickly, was the cost really that great?  And if the cost wasn&amp;#39;t actually that great, was the goal truly so high?  Let their decision matter.&lt;/p&gt;\n\n&lt;p&gt;(I ran a game with a blind character for several years, and it made for an interesting and enjoyable challenge.  Feel free to ask me questions if you want to know more.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgeefhy", "score_hidden": false, "stickied": false, "created": 1492504636.0, "created_utc": 1492475836.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": "", "user_reports": [], "id": "dgedmco", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "scrollbreak", "parent_id": "t3_65z1z8", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "This is what happens when you don't have a plot to follow. Terrible, isn't it? And wonderful.... &gt;:)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is what happens when you don&amp;#39;t have a plot to follow. Terrible, isn&amp;#39;t it? And wonderful.... &amp;gt;:)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgedmco", "score_hidden": false, "stickied": false, "created": 1492503626.0, "created_utc": 1492474826.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": "", "user_reports": [], "id": "dgee94a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "WolfishEU", "parent_id": "t1_dgedwz4", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Go to /r/lfg and join a game. :) There are plenty of online games and depending on where you live local games running, and almost all are newbie-friendly. It's better with friends but you never know, a random group you decide to join may end up being lifelong pals!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go to &lt;a href=\"/r/lfg\"&gt;/r/lfg&lt;/a&gt; and join a game. :) There are plenty of online games and depending on where you live local games running, and almost all are newbie-friendly. It&amp;#39;s better with friends but you never know, a random group you decide to join may end up being lifelong pals!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgee94a", "score_hidden": false, "stickied": false, "created": 1492504424.0, "created_utc": 1492475624.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": "", "user_reports": [], "id": "dgee977", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ThomasHobbesJr", "parent_id": "t1_dgee15a", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Oh right on, apparently there's a subreddit for that. Thanks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh right on, apparently there&amp;#39;s a subreddit for that. Thanks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgee977", "score_hidden": false, "stickied": false, "created": 1492504427.0, "created_utc": 1492475627.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgee15a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PFDavids", "parent_id": "t1_dgedwz4", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "There are always groups recruiting for online campaigns if you wanted to try it.  Find a group thats planning a Roll20 campaign or something similar.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are always groups recruiting for online campaigns if you wanted to try it.  Find a group thats planning a Roll20 campaign or something similar.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgee15a", "score_hidden": false, "stickied": false, "created": 1492504148.0, "created_utc": 1492475348.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": "", "user_reports": [], "id": "dgek99s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThomasHobbesJr", "parent_id": "t1_dgeipmf", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Large city so I'm sure it does. Is that a common thing? just stumbling in like that? xD", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Large city so I&amp;#39;m sure it does. Is that a common thing? just stumbling in like that? xD&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgek99s", "score_hidden": true, "stickied": false, "created": 1492511708.0, "created_utc": 1492482908.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeipmf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nebulousmenace", "parent_id": "t1_dgedwz4", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Do you live somewhere that has a Fine Local Game Shop? Good place to find gamers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you live somewhere that has a Fine Local Game Shop? Good place to find gamers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgeipmf", "score_hidden": false, "stickied": false, "created": 1492509893.0, "created_utc": 1492481093.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": "", "user_reports": [], "id": "dgeny0i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BlazeCell", "parent_id": "t1_dgedwz4", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Also if you want more stories of RPG escapades /r/DnDgreentext has got you covered. ; )", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also if you want more stories of RPG escapades &lt;a href=\"/r/DnDgreentext\"&gt;/r/DnDgreentext&lt;/a&gt; has got you covered. ; )&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgeny0i", "score_hidden": true, "stickied": false, "created": 1492516633.0, "created_utc": 1492487833.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgedwz4", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ThomasHobbesJr", "parent_id": "t3_65z1z8", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "Don't really follow this sub, just stumbled upon it. This amused me and is the kind of thing that upsets me that my friends are not the sort of people to RPG, consequently never played it before. Oh well, at least I can live vicariously through others' stories", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t really follow this sub, just stumbled upon it. This amused me and is the kind of thing that upsets me that my friends are not the sort of people to RPG, consequently never played it before. Oh well, at least I can live vicariously through others&amp;#39; stories&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgedwz4", "score_hidden": false, "stickied": false, "created": 1492504002.0, "created_utc": 1492475202.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2s", "removal_reason": null, "link_id": "t3_65z1z8", "likes": null, "replies": "", "user_reports": [], "id": "dgei3mw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bobo311", "parent_id": "t3_65z1z8", "subreddit_name_prefixed": "r/rpg", "controversiality": 0, "body": "A love a good PC run game.  I have always had the most fun as a PC when we clearly had to do X, but did A B C and Œ instead. Only to end up with a dozen new side plots that just complicate things.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A love a good PC run game.  I have always had the most fun as a PC when we clearly had to do X, but did A B C and Œ instead. Only to end up with a dozen new side plots that just complicate things.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "rpg", "name": "t1_dgei3mw", "score_hidden": false, "stickied": false, "created": 1492509168.0, "created_utc": 1492480368.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]