[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheLastAirbender", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty late to the Avatar fandom, but I picked up ATLA a couple weeks ago and went through the entire thing. After that i just recently began LoK and have just finished Book 2. I absolutely loved ATLA and Book 1 of Korra, but there&amp;#39;s something that bugs me that could have been so easily changed to make Book 2 a lot better over all. &lt;/p&gt;\n\n&lt;p&gt;My main issues with Korra surround the ending of Book 1. I loved Amon as a villain and found his story beautifully tragic. I would have loved to have such a good antagonist stick around longer, but at the same time, I felt that his death was rather perfect. With that said, I really think two small things could have tremendously increased how much I enjoyed not only the end of Book 1, but Book 2 as well. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1)&lt;/strong&gt; I&amp;#39;m sure this isn&amp;#39;t an uncommon opinion, but I &lt;em&gt;really&lt;/em&gt; wish that the Equalist Movement would have continued on in some form even after Amon&amp;#39;s true identity was revealed and he died. &lt;/p&gt;\n\n&lt;p&gt;Even if the Equalists didn&amp;#39;t play a part as the major villains of any of the following books, I strongly believed that some remnant of them should have still been present within the show. The Equalist Movement, while misguided, &lt;em&gt;did&lt;/em&gt; have a point and the push for true equality in a world where some are inherently born unequal is a strong theme that definitely should have continue to be explored. I&amp;#39;ve heard that the book ended the way it did because the creators didn&amp;#39;t expect to get another season, and that is a shame if true, but even still, there still should have at least been a minor recurring threat from people who idolized the symbol of Amon and his movement... despite his questionable hypocrisy. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;     &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2)&lt;/strong&gt; Perhaps even more than point one, I feel &lt;em&gt;very strongly&lt;/em&gt; that Amon/Noatak&amp;#39;s severing of Korra&amp;#39;s ability to bend everything other than air should have continued far into Book 2. &lt;/p&gt;\n\n&lt;p&gt;The fact that everything was reversed so easily at the end of Book 1 felt very unfulfilling to me and I honestly believe that, considering Book 2 was focused on the Spirit World, one of its major themes should have been Korra struggling or finding a way to reawaken her other bending abilities outside of the Avatar State. I think it would have been a perfect ending to Book 1 if Korra lost her water, fire and earth bending, but while gaining more connection to her spiritual side was able to use those elements again &lt;em&gt;only&lt;/em&gt; in the Avatar State until she could have gotten them back in the Spirit World somehow. Not only would this have made Amon&amp;#39;s arc have more of an effect on the series and impact on Korra herself, it really would have livened up a Book about the Spirit world that was, honestly, otherwise a bit of a letdown compared to Book 1. Making it about Korra&amp;#39;s journey to find a way to regain her abilities would have been a much stronger story and it still could have involved many of the same spirits.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure I&amp;#39;m not the first person to think these two things or would have preferred them, but as a new fan, I felt like sharing my opinion as I continue on the journey and into finishing the last two Books of the Legend of Korra. I&amp;#39;ve heard that Books 3 and 4 are much better than 2, so I&amp;#39;m excited to see what they have in store, but I&amp;#39;m also curious to hear from the community here concerning my two main issues with the ending of Book 1 and Book 2. &lt;/p&gt;\n\n&lt;p&gt;Any and all comments or criticisms are welcome and I&amp;#39;m genuinely interested to hear how many others would have enjoyed a Book 2 more in line with the one I mentioned in my second point as well as exactly how many wish the Equalists would have at least been a semi-recurring element (no pun intended) in the world of Korra. Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm pretty late to the Avatar fandom, but I picked up ATLA a couple weeks ago and went through the entire thing. After that i just recently began LoK and have just finished Book 2. I absolutely loved ATLA and Book 1 of Korra, but there's something that bugs me that could have been so easily changed to make Book 2 a lot better over all. \n\n\nMy main issues with Korra surround the ending of Book 1. I loved Amon as a villain and found his story beautifully tragic. I would have loved to have such a good antagonist stick around longer, but at the same time, I felt that his death was rather perfect. With that said, I really think two small things could have tremendously increased how much I enjoyed not only the end of Book 1, but Book 2 as well. \n\n&amp;nbsp;\n\n**1)** I'm sure this isn't an uncommon opinion, but I *really* wish that the Equalist Movement would have continued on in some form even after Amon's true identity was revealed and he died. \n\nEven if the Equalists didn't play a part as the major villains of any of the following books, I strongly believed that some remnant of them should have still been present within the show. The Equalist Movement, while misguided, *did* have a point and the push for true equality in a world where some are inherently born unequal is a strong theme that definitely should have continue to be explored. I've heard that the book ended the way it did because the creators didn't expect to get another season, and that is a shame if true, but even still, there still should have at least been a minor recurring threat from people who idolized the symbol of Amon and his movement... despite his questionable hypocrisy. \n\n\n&amp;nbsp;     \n\n\n**2)** Perhaps even more than point one, I feel *very strongly* that Amon/Noatak's severing of Korra's ability to bend everything other than air should have continued far into Book 2. \n  \nThe fact that everything was reversed so easily at the end of Book 1 felt very unfulfilling to me and I honestly believe that, considering Book 2 was focused on the Spirit World, one of its major themes should have been Korra struggling or finding a way to reawaken her other bending abilities outside of the Avatar State. I think it would have been a perfect ending to Book 1 if Korra lost her water, fire and earth bending, but while gaining more connection to her spiritual side was able to use those elements again *only* in the Avatar State until she could have gotten them back in the Spirit World somehow. Not only would this have made Amon's arc have more of an effect on the series and impact on Korra herself, it really would have livened up a Book about the Spirit world that was, honestly, otherwise a bit of a letdown compared to Book 1. Making it about Korra's journey to find a way to regain her abilities would have been a much stronger story and it still could have involved many of the same spirits.\n\n&amp;nbsp;\n\nI'm sure I'm not the first person to think these two things or would have preferred them, but as a new fan, I felt like sharing my opinion as I continue on the journey and into finishing the last two Books of the Legend of Korra. I've heard that Books 3 and 4 are much better than 2, so I'm excited to see what they have in store, but I'm also curious to hear from the community here concerning my two main issues with the ending of Book 1 and Book 2. \n\nAny and all comments or criticisms are welcome and I'm genuinely interested to hear how many others would have enjoyed a Book 2 more in line with the one I mentioned in my second point as well as exactly how many wish the Equalists would have at least been a semi-recurring element (no pun intended) in the world of Korra. Thanks!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Lol B2", "id": "65hrhq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "Sparowes", "saved": false, "mod_reports": [], "name": "t3_65hrhq", "subreddit_name_prefixed": "r/TheLastAirbender", "approved_by": null, "over_18": false, "domain": "self.TheLastAirbender", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rybx", "edited": 1492238093.0, "link_flair_css_class": "two", "author_flair_css_class": "Equalists", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheLastAirbender/comments/65hrhq/lol_b2_so_i_finally_decided_to_jump_into_avatar/", "num_reports": null, "locked": false, "stickied": false, "created": 1492266590.0, "url": "https://www.reddit.com/r/TheLastAirbender/comments/65hrhq/lol_b2_so_i_finally_decided_to_jump_into_avatar/", "author_flair_text": "Equality is Freedom. Equalism is the Way.", "quarantine": false, "title": "[Lol B2] So I finally decided to jump into Avatar and there are two things that I think would have make LoK much better...", "created_utc": 1492237790.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": "", "user_reports": [], "id": "dgaeob4", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Kronenburg_Korra", "parent_id": "t1_dgae5mr", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "As someone who actually slightly prefers LOK to ATLA, the resolution of Book 1 (particularly with regards to Korra and that resolutions lack of connections to the rest of the series) is the biggest narrative flaw in the show. Bigger than anything I can think of in ATLA. \n\nIt's, I think, tied directly to the fact that LOK was conceived originally and written as a single season, while the latter three seasons were written with each other in mind. I won't get into specifics to avoid spoilers, but it's clear that the writers had an overall character arc in mind for Korra and it feels like they were trying to show the resolution of that arc in the literal last few minutes of Book 1. Problem is, while Korra did grow that season, it wasn't to the extent that would support such a resolution. It sort of just happens *to* Korra instead of her being an active agent in achieving it. \n\nBook 2 is a bit rough around the edges, particularly in the first half, but I really like the conclusion of it. It's an inflection point for Korra's growth and for the the world and lays important thematic foundations for later. There are consequences (some unforeseen) from the ending of Book 2 that are going to cascade into Book 3 and consequences from the end of Book 3 will cascade into Book 4. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who actually slightly prefers LOK to ATLA, the resolution of Book 1 (particularly with regards to Korra and that resolutions lack of connections to the rest of the series) is the biggest narrative flaw in the show. Bigger than anything I can think of in ATLA. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s, I think, tied directly to the fact that LOK was conceived originally and written as a single season, while the latter three seasons were written with each other in mind. I won&amp;#39;t get into specifics to avoid spoilers, but it&amp;#39;s clear that the writers had an overall character arc in mind for Korra and it feels like they were trying to show the resolution of that arc in the literal last few minutes of Book 1. Problem is, while Korra did grow that season, it wasn&amp;#39;t to the extent that would support such a resolution. It sort of just happens &lt;em&gt;to&lt;/em&gt; Korra instead of her being an active agent in achieving it. &lt;/p&gt;\n\n&lt;p&gt;Book 2 is a bit rough around the edges, particularly in the first half, but I really like the conclusion of it. It&amp;#39;s an inflection point for Korra&amp;#39;s growth and for the the world and lays important thematic foundations for later. There are consequences (some unforeseen) from the ending of Book 2 that are going to cascade into Book 3 and consequences from the end of Book 3 will cascade into Book 4. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgaeob4", "score_hidden": false, "stickied": false, "created": 1492268729.0, "created_utc": 1492239929.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": "", "user_reports": [], "id": "dgbns2c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sassafrass238", "parent_id": "t1_dgae5mr", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "Don't worry, the events of season 3 are directly caused by those in season 2, and season 4 would've never happened were it not for season 3. Season 1 was written as a miniseries, while the other 3 were planned out together; that's why season 1 is so disconnected.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t worry, the events of season 3 are directly caused by those in season 2, and season 4 would&amp;#39;ve never happened were it not for season 3. Season 1 was written as a miniseries, while the other 3 were planned out together; that&amp;#39;s why season 1 is so disconnected.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgbns2c", "score_hidden": false, "stickied": false, "created": 1492344486.0, "created_utc": 1492315686.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgae5mr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sparowes", "parent_id": "t1_dgae0pm", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "I don't really have a problem with separating the Books into different stories really. I like that Book 2 focused on the Spirit World and not the politics of Republic City and even had a different villain -- I'm fine with the episodic nature of of LoK in that way.   \n\n\nWith  that said, I still would have liked to see some of the effects of previous books carrying over more into the next ones. Having the Equalists still exist as a minor villains or even just a political movement would have been a nice touch. And having Amon successfully stripping Korra's bending, but ultimately failing his mission, so that she has to seek out a new way to reconnect with the other elements via the Spirits would have been the perfect way to gap the Books without having them be too serialized in the way of ATLA. \n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really have a problem with separating the Books into different stories really. I like that Book 2 focused on the Spirit World and not the politics of Republic City and even had a different villain -- I&amp;#39;m fine with the episodic nature of of LoK in that way.   &lt;/p&gt;\n\n&lt;p&gt;With  that said, I still would have liked to see some of the effects of previous books carrying over more into the next ones. Having the Equalists still exist as a minor villains or even just a political movement would have been a nice touch. And having Amon successfully stripping Korra&amp;#39;s bending, but ultimately failing his mission, so that she has to seek out a new way to reconnect with the other elements via the Spirits would have been the perfect way to gap the Books without having them be too serialized in the way of ATLA. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgae5mr", "score_hidden": false, "stickied": false, "created": 1492267436.0, "created_utc": 1492238636.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgae0pm", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SevenSnows", "parent_id": "t3_65hrhq", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "I just recently got into Korra myself and am about to finish book 2. \n\nI agree with you on both aspects. However, as for the over arching story line aspect, at first, I was a little disappointed at self contained stories, but at the same time, thats 4 different stories that Korra goes through, so I figured thats ok.\n\nI did feel the same about her losing all her bending abilities except air and it would have been interesting to see how she would have handled things using only air bending and being very new to it. \n\nI will start book 3 this weekend..depending on time I may be able to watch a good chunk of it and get to book 4. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just recently got into Korra myself and am about to finish book 2. &lt;/p&gt;\n\n&lt;p&gt;I agree with you on both aspects. However, as for the over arching story line aspect, at first, I was a little disappointed at self contained stories, but at the same time, thats 4 different stories that Korra goes through, so I figured thats ok.&lt;/p&gt;\n\n&lt;p&gt;I did feel the same about her losing all her bending abilities except air and it would have been interesting to see how she would have handled things using only air bending and being very new to it. &lt;/p&gt;\n\n&lt;p&gt;I will start book 3 this weekend..depending on time I may be able to watch a good chunk of it and get to book 4. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgae0pm", "score_hidden": false, "stickied": false, "created": 1492267101.0, "created_utc": 1492238301.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": "", "user_reports": [], "id": "dgb5r1k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sparowes", "parent_id": "t1_dgaooao", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "Yeah, I get that and it makes sense. But I feel like once they knew Book 2 was a go, they still could have gone with a story where Korra only has access to her water/fire/earth bending while in the Avatar State and has to reaquire her power in the Spirit World. The last pair of scenes with her using any bending in Book 1 show her going into the Avatar State and using all of the elements after Aang gives her back her ability to bend and then the one where she uses Energy Bending to restore Lin's earthbnding.   \n\n\nAs they began work on season two, they could have easily said that she was using the Avatar State both times and didn't regain her full power outside of the AS and simply has the ability to airbend and has gained some access to her spiritual side that now let's her communicate and channel her past incarnations. It would have been plausible considering her eyes were glowing both times which we know is something that happens in the Avatar State. While the creators may have planned this to be the ending because they didn't think they would get a Book 2, once they got the conformation on the next season, they definitely had the chance to still have Korra's other bending gone outside of the Avatar State. All of the pieces were still there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I get that and it makes sense. But I feel like once they knew Book 2 was a go, they still could have gone with a story where Korra only has access to her water/fire/earth bending while in the Avatar State and has to reaquire her power in the Spirit World. The last pair of scenes with her using any bending in Book 1 show her going into the Avatar State and using all of the elements after Aang gives her back her ability to bend and then the one where she uses Energy Bending to restore Lin&amp;#39;s earthbnding.   &lt;/p&gt;\n\n&lt;p&gt;As they began work on season two, they could have easily said that she was using the Avatar State both times and didn&amp;#39;t regain her full power outside of the AS and simply has the ability to airbend and has gained some access to her spiritual side that now let&amp;#39;s her communicate and channel her past incarnations. It would have been plausible considering her eyes were glowing both times which we know is something that happens in the Avatar State. While the creators may have planned this to be the ending because they didn&amp;#39;t think they would get a Book 2, once they got the conformation on the next season, they definitely had the chance to still have Korra&amp;#39;s other bending gone outside of the Avatar State. All of the pieces were still there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgb5r1k", "score_hidden": false, "stickied": false, "created": 1492318357.0, "created_utc": 1492289557.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaooao", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Lolipopman", "parent_id": "t3_65hrhq", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "It's important to keep in mind that korra was only supposed to be a one season short, so the ending of book one was originally gonna be actual end to the show. So her getting her bending back was kind of happy ending wrap up to it before the rest of the books were confirmed. \n\nThat being said it would've been cool to see more equalist stuff. Mako and asami's stories were more placed in republic city during book 2 so they could've had some stuff dealing with that (especially since mako is a cop). But I personally really liked where they went anyway. If they brought in equalist stuff it would just feel like a bunch of people struggling for a lost cause, I don't think it would've been very impactful. At least to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s important to keep in mind that korra was only supposed to be a one season short, so the ending of book one was originally gonna be actual end to the show. So her getting her bending back was kind of happy ending wrap up to it before the rest of the books were confirmed. &lt;/p&gt;\n\n&lt;p&gt;That being said it would&amp;#39;ve been cool to see more equalist stuff. Mako and asami&amp;#39;s stories were more placed in republic city during book 2 so they could&amp;#39;ve had some stuff dealing with that (especially since mako is a cop). But I personally really liked where they went anyway. If they brought in equalist stuff it would just feel like a bunch of people struggling for a lost cause, I don&amp;#39;t think it would&amp;#39;ve been very impactful. At least to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgaooao", "score_hidden": false, "stickied": false, "created": 1492294570.0, "created_utc": 1492265770.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": "", "user_reports": [], "id": "dgbpc2m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cark_Muban", "parent_id": "t1_dgbffsp", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "I agree, sadly it looks like Korra might be the last Avatar series we'll see for a while :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree, sadly it looks like Korra might be the last Avatar series we&amp;#39;ll see for a while :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgbpc2m", "score_hidden": false, "stickied": false, "created": 1492347220.0, "created_utc": 1492318420.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbffsp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sparowes", "parent_id": "t1_dgbezju", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "That sucks that their funding was low. The quality of ATLA and Korra is so fantastic in terms of visuals and story that I really think Nick not backing the creators a lot more heavily is a mistake. Avatar is something they should have been promoting hard and should have been built into a flagship franchise where we would have a third and maybe even fourth series, one for an Avatar of each element. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sucks that their funding was low. The quality of ATLA and Korra is so fantastic in terms of visuals and story that I really think Nick not backing the creators a lot more heavily is a mistake. Avatar is something they should have been promoting hard and should have been built into a flagship franchise where we would have a third and maybe even fourth series, one for an Avatar of each element. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgbffsp", "score_hidden": false, "stickied": false, "created": 1492332108.0, "created_utc": 1492303308.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbezju", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cark_Muban", "parent_id": "t1_dgbde5s", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "Books 3 and 4 were great. However, one thing about book 4 was that Nick cut an episodes worth of funding so there's a clipshow episode. It's funny, but it feels out of place, but they had no choice but to make that episode. So the book might feel a bit rushed near the end, which is on Nick rather than the creators", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Books 3 and 4 were great. However, one thing about book 4 was that Nick cut an episodes worth of funding so there&amp;#39;s a clipshow episode. It&amp;#39;s funny, but it feels out of place, but they had no choice but to make that episode. So the book might feel a bit rushed near the end, which is on Nick rather than the creators&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgbezju", "score_hidden": false, "stickied": false, "created": 1492331453.0, "created_utc": 1492302653.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbde5s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sparowes", "parent_id": "t1_dgbcw06", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "Yeah, I can understand that. I am definitely just coming from my view point of seeing the first two Books. And it seems like her regaining her bending in the Spirit World would have been a cool story. But wanting to start fresh makes sense and I've hears that Books 3 and 4 are arguably the best (especially hear this about 3), so as long as things progress positively, I'll l enjoy it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I can understand that. I am definitely just coming from my view point of seeing the first two Books. And it seems like her regaining her bending in the Spirit World would have been a cool story. But wanting to start fresh makes sense and I&amp;#39;ve hears that Books 3 and 4 are arguably the best (especially hear this about 3), so as long as things progress positively, I&amp;#39;ll l enjoy it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgbde5s", "score_hidden": false, "stickied": false, "created": 1492329187.0, "created_utc": 1492300387.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcw06", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cark_Muban", "parent_id": "t3_65hrhq", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "I agree with your points. But, since Book 1 was a standalone, and they essentially tied all the loose ends, they probably wanted a fresh start with Book 2. I know you haven't seen the rest of the show, but what they did with Books 3 and 4 is what I feel like they would have done if Book 1 wasn't the only season planned.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with your points. But, since Book 1 was a standalone, and they essentially tied all the loose ends, they probably wanted a fresh start with Book 2. I know you haven&amp;#39;t seen the rest of the show, but what they did with Books 3 and 4 is what I feel like they would have done if Book 1 wasn&amp;#39;t the only season planned.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgbcw06", "score_hidden": false, "stickied": false, "created": 1492328491.0, "created_utc": 1492299691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rybx", "removal_reason": null, "link_id": "t3_65hrhq", "likes": null, "replies": "", "user_reports": [], "id": "dgbwc8u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blockpro156", "parent_id": "t3_65hrhq", "subreddit_name_prefixed": "r/TheLastAirbender", "controversiality": 0, "body": "* **1**: I would argue that the Equalists did stick around, in the form of mecha tanks.  \nJust think about it, the Equalists may be gone, but their weapons that empower non benders still remain.  \n\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;1&lt;/strong&gt;: I would argue that the Equalists did stick around, in the form of mecha tanks.&lt;br/&gt;\nJust think about it, the Equalists may be gone, but their weapons that empower non benders still remain.&lt;br/&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "TheLastAirbender", "name": "t1_dgbwc8u", "score_hidden": false, "stickied": false, "created": 1492365860.0, "created_utc": 1492337060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]