[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You know the moment. The second when you&amp;#39;re staring into the eyes of the person you love and you&amp;#39;re bearing your naked soul for them to embrace. You&amp;#39;re thinking about the future, about your future with them. All of the prosperous and exuberant times to come fill your mind with serenity and love. Finally it seems like all the pain and hardships in your life had a purpose. Despite all the rough paths in your previous life they were the paths that led you to them, to those gorgeous sparkling hazel eyes in front of you. It&amp;#39;s like a huge weight being lifted off your shoulders. At last you can breathe again because you no longer have to fight. You are where you&amp;#39;re supposed to be. &lt;/p&gt;\n\n&lt;p&gt;Then those beautiful eyes drop from yours. The pink lips that you&amp;#39;ve traced with your tongue part, and the words they utter slash at you. This is the moment. The moment when the world falls away, when you can physically feel your heart being brutally ripped, shredded, and torn into a mush of pulsating bloody meat. You can&amp;#39;t breathe. You can&amp;#39;t feel your body. The sound of your own blood steadily draining from the open wound in the centre of your chest floods your ears. This is the moment when you lose everything. This is where the one fucking thing that you want more than anything in the world simply walks away from you. But that&amp;#39;s not even the worst part. The worst part is that you can&amp;#39;t stop it. You contributed and are now helpless to your own undoing. The thing that you have loved, cared for, and put first before even yourself is the thing that has destroyed you. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re alone now. There are bits and remnants of you on the ground. Try as you will to collect them all, but they will never fit back together the way that they did before. A piece is missing now, a very crucial piece. You will never get that fragment back and you will never be whole again. You plug the leak, you slice away the dead flesh, you cut off the limb, you do what you have to to survive. But in the deepest trenches of your mind you know that you can&amp;#39;t do it forever. There is only one thing that will truly and permanently fix you, to get you back to your peace and tranquility....... and it does not want you.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "You know the moment. The second when you're staring into the eyes of the person you love and you're bearing your naked soul for them to embrace. You're thinking about the future, about your future with them. All of the prosperous and exuberant times to come fill your mind with serenity and love. Finally it seems like all the pain and hardships in your life had a purpose. Despite all the rough paths in your previous life they were the paths that led you to them, to those gorgeous sparkling hazel eyes in front of you. It's like a huge weight being lifted off your shoulders. At last you can breathe again because you no longer have to fight. You are where you're supposed to be. \n\nThen those beautiful eyes drop from yours. The pink lips that you've traced with your tongue part, and the words they utter slash at you. This is the moment. The moment when the world falls away, when you can physically feel your heart being brutally ripped, shredded, and torn into a mush of pulsating bloody meat. You can't breathe. You can't feel your body. The sound of your own blood steadily draining from the open wound in the centre of your chest floods your ears. This is the moment when you lose everything. This is where the one fucking thing that you want more than anything in the world simply walks away from you. But that's not even the worst part. The worst part is that you can't stop it. You contributed and are now helpless to your own undoing. The thing that you have loved, cared for, and put first before even yourself is the thing that has destroyed you. \n\nYou're alone now. There are bits and remnants of you on the ground. Try as you will to collect them all, but they will never fit back together the way that they did before. A piece is missing now, a very crucial piece. You will never get that fragment back and you will never be whole again. You plug the leak, you slice away the dead flesh, you cut off the limb, you do what you have to to survive. But in the deepest trenches of your mind you know that you can't do it forever. There is only one thing that will truly and permanently fix you, to get you back to your peace and tranquility....... and it does not want you.  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ov41", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "fuckeater", "saved": false, "mod_reports": [], "name": "t3_64ov41", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": true, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/64ov41/the_moment/", "num_reports": null, "locked": false, "stickied": false, "created": 1491915667.0, "url": "https://www.reddit.com/r/self/comments/64ov41/the_moment/", "author_flair_text": null, "quarantine": false, "title": "The Moment", "created_utc": 1491886867.0, "distinguished": null, "media": null, "upvote_ratio": 0.65, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_64ov41", "likes": null, "replies": "", "user_reports": [], "id": "dg3ygtt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "neurocist", "parent_id": "t3_64ov41", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Hold on, good things will happen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hold on, good things will happen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg3ygtt", "score_hidden": false, "stickied": false, "created": 1491921021.0, "created_utc": 1491892221.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_64ov41", "likes": null, "replies": "", "user_reports": [], "id": "dg3ynpb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "agnn", "parent_id": "t3_64ov41", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "I'm in the exact same place, it's really hard to do anything. The only advice I have is to learn to love yourself. At least that's what I'm trying to do...\n\nThe second half of this video shed a little light on my perception of this situation: https://youtu.be/UoLWYhwROBI\n\nBe well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in the exact same place, it&amp;#39;s really hard to do anything. The only advice I have is to learn to love yourself. At least that&amp;#39;s what I&amp;#39;m trying to do...&lt;/p&gt;\n\n&lt;p&gt;The second half of this video shed a little light on my perception of this situation: &lt;a href=\"https://youtu.be/UoLWYhwROBI\"&gt;https://youtu.be/UoLWYhwROBI&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Be well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg3ynpb", "score_hidden": false, "stickied": false, "created": 1491921493.0, "created_utc": 1491892693.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]