[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It happened on a narrow two-lane road so when I came around the small curve I was right there. I pulled off the road and onto the side in a small ditch (I drive a Jeep) to get out of the way and and see if I could help. I saw the motorcyclist on the road and I knew the person most likely didn&amp;#39;t survive. I had never seen something like that, or been right up on an accident and I saw a lot and it was bad. The victim looked to be a teenage boy and an older man was kneeled next to him and crying while saying he was sorry and he didn&amp;#39;t mean to do it. I&amp;#39;ll never forget that and I close my eyes and see it so vividly. 911 had been called so I pulled out of the ditch and around the motorcycle and truck that was involved and after I got up the road a bit I had to pull over and compose myself. I was still shaken by what I had seen when I returned home and was debating on Googling for information about the accident and victim when my daughter told me that it was not a teenage boy that I had seen; it was her cosmotology instructor who I also went to high school with, knew her casually then and more recently I know her as my kid&amp;#39;s instructor. She had been out for a ride on her bike (cycle) and drifted into the next lane and in front of the truck who had no way fo avoid hitting her. Like I said it is a narrow scenic two lane road. So she is who I saw in that condition. It was the man driving the truck who was kneeling beside her and crying and telling her he was sorry. I cannot get this out of my head. The visual, what I saw, I can&amp;#39;t unsee that. I worry about the man in the truck who hit her. He had no way to avoid hitting her and I wonder how he&amp;#39;s holding up. I hope her family knows he was with her and beside her out there. I can&amp;#39;t seperate what I saw from how I know she looked and how much she didn&amp;#39;t look that way at the end. It&amp;#39;s rattled me and I&amp;#39;m shook. I&amp;#39;m leery to get behind the wheel and I worry for my loved ones driving, especially my 19 yr old daughter. She and her classmates have taken food and baskets of supplies to her instructor&amp;#39;s family. She (my daughter)  appears to be handling this well but when will I stop seeing what I saw on that road? \nI guess by writing this I&amp;#39;m hoping to hear some reassurance?? I don&amp;#39;t really know but I thank you for reading. I can&amp;#39;t sleep at all and thought writing it out might help. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It happened on a narrow two-lane road so when I came around the small curve I was right there. I pulled off the road and onto the side in a small ditch (I drive a Jeep) to get out of the way and and see if I could help. I saw the motorcyclist on the road and I knew the person most likely didn't survive. I had never seen something like that, or been right up on an accident and I saw a lot and it was bad. The victim looked to be a teenage boy and an older man was kneeled next to him and crying while saying he was sorry and he didn't mean to do it. I'll never forget that and I close my eyes and see it so vividly. 911 had been called so I pulled out of the ditch and around the motorcycle and truck that was involved and after I got up the road a bit I had to pull over and compose myself. I was still shaken by what I had seen when I returned home and was debating on Googling for information about the accident and victim when my daughter told me that it was not a teenage boy that I had seen; it was her cosmotology instructor who I also went to high school with, knew her casually then and more recently I know her as my kid's instructor. She had been out for a ride on her bike (cycle) and drifted into the next lane and in front of the truck who had no way fo avoid hitting her. Like I said it is a narrow scenic two lane road. So she is who I saw in that condition. It was the man driving the truck who was kneeling beside her and crying and telling her he was sorry. I cannot get this out of my head. The visual, what I saw, I can't unsee that. I worry about the man in the truck who hit her. He had no way to avoid hitting her and I wonder how he's holding up. I hope her family knows he was with her and beside her out there. I can't seperate what I saw from how I know she looked and how much she didn't look that way at the end. It's rattled me and I'm shook. I'm leery to get behind the wheel and I worry for my loved ones driving, especially my 19 yr old daughter. She and her classmates have taken food and baskets of supplies to her instructor's family. She (my daughter)  appears to be handling this well but when will I stop seeing what I saw on that road? \nI guess by writing this I'm hoping to hear some reassurance?? I don't really know but I thank you for reading. I can't sleep at all and thought writing it out might help. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64px3x", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 25, "report_reasons": null, "author": "baconlettucejesus", "saved": false, "mod_reports": [], "name": "t3_64px3x", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/64px3x/i_came_up_on_a_fatality_accident_involving_a/", "num_reports": null, "locked": false, "stickied": false, "created": 1491933742.0, "url": "https://www.reddit.com/r/self/comments/64px3x/i_came_up_on_a_fatality_accident_involving_a/", "author_flair_text": null, "quarantine": false, "title": "I came up on a fatality accident involving a motorcycle and a pickup almost immediately after it happened last Saturday. Turns out I knew the victim and it's all I can think about.", "created_utc": 1491904942.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_64px3x", "likes": null, "replies": "", "user_reports": [], "id": "dg4csxa", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "pauliesfreakin", "parent_id": "t3_64px3x", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Just wanted to let you know I hear you. Not much will help for now other than time and perhaps finding someone professional to chat with. Sending love. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just wanted to let you know I hear you. Not much will help for now other than time and perhaps finding someone professional to chat with. Sending love. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg4csxa", "score_hidden": false, "stickied": false, "created": 1491951057.0, "created_utc": 1491922257.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]