[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;hello everyone, i am not sure whether i&amp;#39;m posting in the right subreddit so i hope to be redirected if i&amp;#39;m in a wrong place. i am 23 y/o, struggle with bipolar 2 and anxiety. i&amp;#39;ve been in a depressive episode for over a year now. &lt;/p&gt;\n\n&lt;p&gt;i&amp;#39;ve been dealing with angry episodes since i first started showing symptomps of BAP as a young teenager. i was always a feisty, stubborn child. i thought it would go away with puberty. i had epsiodes such as smashing things against the wall, filling pillowcases with rubber to throw it against the wall, punching my wardrobe and wall with my fist until it bled. i started drinking young, and by drinking i mean getting wasted and getting promiscuous. luckily, my substance abuse hasn&amp;#39;t gotten further from using pot. also, i have been obsessed with my weight for as long as i can remember and have always been on the heavier side of the scale, since i use food as weapon against myself.&lt;/p&gt;\n\n&lt;p&gt;since the beginning of the ongoing depressive episode, i have been struggling to keep my self-destructive behaviour as low as possible because of it possibly interfering my newest therapy. i don&amp;#39;t go out and have a drink every couple of weeks, i&amp;#39;ve stopped smoking cigarettes and smoke pot every few months. however, a few days ago i&amp;#39;ve had a panic attack and i don&amp;#39;t know what triggered it. i started slapping my face as hard as i can. then i stopped, then i slapped it more until it burned and then started punching myself and banging my forehead against the door. my mom ran to me and stopped me. i couldn&amp;#39;t help myself, i just felt the urge to do it and it made the crying and screaming easier for me. this is the first time i&amp;#39;ve done something like this since 2012 when i slapped myself only once, in front of my then-boyfriend, midst-fight.&lt;/p&gt;\n\n&lt;p&gt;i reckon it&amp;#39;s connected to the feeling of helplessness and restlessness. please, if anyone has experience with this kind of abuse, please reach out to me. i scare myself and i don&amp;#39;t know how to channel this anger. i don&amp;#39;t have any past of cutting. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "hello everyone, i am not sure whether i'm posting in the right subreddit so i hope to be redirected if i'm in a wrong place. i am 23 y/o, struggle with bipolar 2 and anxiety. i've been in a depressive episode for over a year now. \n\ni've been dealing with angry episodes since i first started showing symptomps of BAP as a young teenager. i was always a feisty, stubborn child. i thought it would go away with puberty. i had epsiodes such as smashing things against the wall, filling pillowcases with rubber to throw it against the wall, punching my wardrobe and wall with my fist until it bled. i started drinking young, and by drinking i mean getting wasted and getting promiscuous. luckily, my substance abuse hasn't gotten further from using pot. also, i have been obsessed with my weight for as long as i can remember and have always been on the heavier side of the scale, since i use food as weapon against myself.\n\nsince the beginning of the ongoing depressive episode, i have been struggling to keep my self-destructive behaviour as low as possible because of it possibly interfering my newest therapy. i don't go out and have a drink every couple of weeks, i've stopped smoking cigarettes and smoke pot every few months. however, a few days ago i've had a panic attack and i don't know what triggered it. i started slapping my face as hard as i can. then i stopped, then i slapped it more until it burned and then started punching myself and banging my forehead against the door. my mom ran to me and stopped me. i couldn't help myself, i just felt the urge to do it and it made the crying and screaming easier for me. this is the first time i've done something like this since 2012 when i slapped myself only once, in front of my then-boyfriend, midst-fight.\n\ni reckon it's connected to the feeling of helplessness and restlessness. please, if anyone has experience with this kind of abuse, please reach out to me. i scare myself and i don't know how to channel this anger. i don't have any past of cutting. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64q3e7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "nauseah", "saved": false, "mod_reports": [], "name": "t3_64q3e7", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/64q3e7/selfharm_that_is_not_cutting_and_other/", "num_reports": null, "locked": false, "stickied": false, "created": 1491936619.0, "url": "https://www.reddit.com/r/self/comments/64q3e7/selfharm_that_is_not_cutting_and_other/", "author_flair_text": null, "quarantine": false, "title": "self-harm - that is not cutting - and other self-destructive behaviour", "created_utc": 1491907819.0, "distinguished": null, "media": null, "upvote_ratio": 0.65, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_64q3e7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_64q3e7", "likes": null, "replies": "", "user_reports": [], "id": "dg5116j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nauseah", "parent_id": "t1_dg4o1yc", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "thank you so much for your answer. :) i absolutely agree that depression is too personal to give concrete advice. i feel better by reading and hearing people understand this and have experience fighting similar symptoms their own way. hearing your story helped me because you were kind enough to share it with me. thank you.\n\nright now i am kind of in between therapists. actually, i am seeing a therapist who doesn't practice cognitive behavioral therapy but thinks all i need is the right meds combo to fix my chemical imbalance. because i am so insecure, i do take medication, but also see another therapist just to talk to her. still, we didn't really connect so i am focusing on self-help, reddit, meditation, nutrition, trying to get in touch with myself better (right now i'm going thru a sexuality crisis). \n\ni've made a decision to move to the seaside and work with my best friend, who is now far from me, in a very small rural place. this place has a vibe that suits me, it's not very developed so i won't rely on internet, and some physical work will do good for me. i also miss my friend like crazy, we used to be roommates and when i came back to live with my parents since my condition worsened, it broke my heart to be so far away from him. i believe i'm onto something good here.\n\nthank you :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thank you so much for your answer. :) i absolutely agree that depression is too personal to give concrete advice. i feel better by reading and hearing people understand this and have experience fighting similar symptoms their own way. hearing your story helped me because you were kind enough to share it with me. thank you.&lt;/p&gt;\n\n&lt;p&gt;right now i am kind of in between therapists. actually, i am seeing a therapist who doesn&amp;#39;t practice cognitive behavioral therapy but thinks all i need is the right meds combo to fix my chemical imbalance. because i am so insecure, i do take medication, but also see another therapist just to talk to her. still, we didn&amp;#39;t really connect so i am focusing on self-help, reddit, meditation, nutrition, trying to get in touch with myself better (right now i&amp;#39;m going thru a sexuality crisis). &lt;/p&gt;\n\n&lt;p&gt;i&amp;#39;ve made a decision to move to the seaside and work with my best friend, who is now far from me, in a very small rural place. this place has a vibe that suits me, it&amp;#39;s not very developed so i won&amp;#39;t rely on internet, and some physical work will do good for me. i also miss my friend like crazy, we used to be roommates and when i came back to live with my parents since my condition worsened, it broke my heart to be so far away from him. i believe i&amp;#39;m onto something good here.&lt;/p&gt;\n\n&lt;p&gt;thank you :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg5116j", "score_hidden": false, "stickied": false, "created": 1491978159.0, "created_utc": 1491949359.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4o1yc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64q3e7", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "I used to smash my fists into brick walls and even trees to hurt myself when I was really depressed. \n\n&gt; i reckon it's connected to the feeling of helplessness and restlessness. please, if anyone has experience with this kind of abuse, please reach out to me. i scare myself and i don't know how to channel this anger. i don't have any past of cutting.\n\nI get what you're saying- Beyond the blinding pain kind of wiping away whatever awful feelings you're going through there was a bit of a power thing. Im breaking something because I feel hopeless, or helpless.\n\nIts a fight to stop this kind of unhealthy behaviour. And its something you gotta stop- When I was doing it at its worst Id hit the wall a little bit harder. One time I popped my knuckle out and my entire hand was swollen like a balloon! It got scary how easy it was to hurt myself... And It scared me even more to know that it was only gonna be more extreme.\n\nI still do it on occasion, but far less violent. Its still unhealthy, but Ive worked to curb those urges. I cant say I did anything specific to stop, I think partnered with the realization that I was going to really hurt myself, and that I had a strong network of people to keep me in check I just slowly got better. \n\nHave you seen a professional? I had a severe anxiety attack a month ago and went and talked to a social worker at a hospital. It felt really good to just vent to a total stranger- We even talked about my self harm issues! She was very informative and beyond that she seemed to really care about my well being. At the very least someone like that can direct you to somewhere that can offer more help. Its worth checking out.\n\nI wont offer you specific information because if depression taught me one thing- its that other people have no idea what they're talking about when they try to give advice. Its a very personal disease I think, and beyond just venting to others you should only listen to professionals. If you're worried about medication, from what Ive seen lots of good doctors are moving away from that method because they're realizing how shitty a bandage antidepressants can be. Cognitive behavioral therapy seems to be the big thing right now!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to smash my fists into brick walls and even trees to hurt myself when I was really depressed. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;i reckon it&amp;#39;s connected to the feeling of helplessness and restlessness. please, if anyone has experience with this kind of abuse, please reach out to me. i scare myself and i don&amp;#39;t know how to channel this anger. i don&amp;#39;t have any past of cutting.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I get what you&amp;#39;re saying- Beyond the blinding pain kind of wiping away whatever awful feelings you&amp;#39;re going through there was a bit of a power thing. Im breaking something because I feel hopeless, or helpless.&lt;/p&gt;\n\n&lt;p&gt;Its a fight to stop this kind of unhealthy behaviour. And its something you gotta stop- When I was doing it at its worst Id hit the wall a little bit harder. One time I popped my knuckle out and my entire hand was swollen like a balloon! It got scary how easy it was to hurt myself... And It scared me even more to know that it was only gonna be more extreme.&lt;/p&gt;\n\n&lt;p&gt;I still do it on occasion, but far less violent. Its still unhealthy, but Ive worked to curb those urges. I cant say I did anything specific to stop, I think partnered with the realization that I was going to really hurt myself, and that I had a strong network of people to keep me in check I just slowly got better. &lt;/p&gt;\n\n&lt;p&gt;Have you seen a professional? I had a severe anxiety attack a month ago and went and talked to a social worker at a hospital. It felt really good to just vent to a total stranger- We even talked about my self harm issues! She was very informative and beyond that she seemed to really care about my well being. At the very least someone like that can direct you to somewhere that can offer more help. Its worth checking out.&lt;/p&gt;\n\n&lt;p&gt;I wont offer you specific information because if depression taught me one thing- its that other people have no idea what they&amp;#39;re talking about when they try to give advice. Its a very personal disease I think, and beyond just venting to others you should only listen to professionals. If you&amp;#39;re worried about medication, from what Ive seen lots of good doctors are moving away from that method because they&amp;#39;re realizing how shitty a bandage antidepressants can be. Cognitive behavioral therapy seems to be the big thing right now!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg4o1yc", "score_hidden": false, "stickied": false, "created": 1491963455.0, "created_utc": 1491934655.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]