[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I had volunteered at a school in a rural mountain town during my travels in Ecuador. During my month-long stay there, the village had multiple weddings. These weddings would last about 3 days. There would be lots of drinking and dancing; mostly drinking. They&amp;#39;d make this drink called &amp;#39;puro&amp;#39; from plants that grew all over their town. The final product was a deep purple and they would serve it out of barrels. \nI decided to go to one of these weddings. None of the other volunteers wanted to head out with me, and it was late in the night. I pre-gamed with some of them before heading out. I didn&amp;#39;t know where the wedding was, it was dark, I was unfamiliar with the town, and I was now a bit tipsy. As I head out, I noticed one of the dogs that hangs out near the library (the volunteers&amp;#39; hotel) starts to follow me. I don&amp;#39;t pay &amp;#39;em much attention at first. In the dark, I try to make my way through the dirt trails, being drawn towards the base from the wedding&amp;#39;s music. I look back every now and then to notice the dog still trailing me. After about a half-hour of walking, I managed to find the wedding. I join them, dance a bit, smile at everyone, accept drinks...they offered lots of drinks as I was recognizable as a volunteer for their local school. I remember telling one dude, &amp;quot;yo soy un gringo!&amp;quot; He replied, &amp;quot;no,no,no. eres mi amigo!&amp;quot; or something along the lines of &amp;#39;you&amp;#39;re a friend&amp;#39;.\nAfter about an hour of partying, I decide to head back. At this point, I am drunk. Hiccuping, stumbling, blissfully smiling. As I start towards the direction of what I THINK may be towards the library, I see the dog that was following me. This whole time, the dude was chilling nearby. The dog starts to head out in front of me. As I keep walking, the dog looks back every 10 secs or so, as if they were checking to see if I was following them. I decided to follow the dog, as I was uncertain on where to head. The dog takes a turn, I decided to take that same turn. The entire time, the dog would stop or slow down and look back periodically. At one moment when the dog did this, I stopped, smiled, and asked &amp;quot;are you helping me find a way back?&amp;quot; The dog paused for a moment and continued on, as did I. Eventually, the dog led me back to the library and then hurried off into the darkness.&lt;/p&gt;\n\n&lt;p&gt;A village dog followed me to a wedding. The dog guided drunk-me back &amp;#39;home&amp;#39;. I love that dog.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I had volunteered at a school in a rural mountain town during my travels in Ecuador. During my month-long stay there, the village had multiple weddings. These weddings would last about 3 days. There would be lots of drinking and dancing; mostly drinking. They'd make this drink called 'puro' from plants that grew all over their town. The final product was a deep purple and they would serve it out of barrels. \nI decided to go to one of these weddings. None of the other volunteers wanted to head out with me, and it was late in the night. I pre-gamed with some of them before heading out. I didn't know where the wedding was, it was dark, I was unfamiliar with the town, and I was now a bit tipsy. As I head out, I noticed one of the dogs that hangs out near the library (the volunteers' hotel) starts to follow me. I don't pay 'em much attention at first. In the dark, I try to make my way through the dirt trails, being drawn towards the base from the wedding's music. I look back every now and then to notice the dog still trailing me. After about a half-hour of walking, I managed to find the wedding. I join them, dance a bit, smile at everyone, accept drinks...they offered lots of drinks as I was recognizable as a volunteer for their local school. I remember telling one dude, \"yo soy un gringo!\" He replied, \"no,no,no. eres mi amigo!\" or something along the lines of 'you're a friend'.\nAfter about an hour of partying, I decide to head back. At this point, I am drunk. Hiccuping, stumbling, blissfully smiling. As I start towards the direction of what I THINK may be towards the library, I see the dog that was following me. This whole time, the dude was chilling nearby. The dog starts to head out in front of me. As I keep walking, the dog looks back every 10 secs or so, as if they were checking to see if I was following them. I decided to follow the dog, as I was uncertain on where to head. The dog takes a turn, I decided to take that same turn. The entire time, the dog would stop or slow down and look back periodically. At one moment when the dog did this, I stopped, smiled, and asked \"are you helping me find a way back?\" The dog paused for a moment and continued on, as did I. Eventually, the dog led me back to the library and then hurried off into the darkness.\n\nA village dog followed me to a wedding. The dog guided drunk-me back 'home'. I love that dog.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "650dvr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "Wizzology", "saved": false, "mod_reports": [], "name": "t3_650dvr", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/650dvr/story_time_i_love_that_dog/", "num_reports": null, "locked": false, "stickied": false, "created": 1492054074.0, "url": "https://www.reddit.com/r/self/comments/650dvr/story_time_i_love_that_dog/", "author_flair_text": null, "quarantine": false, "title": "[Story time] I love that dog!!", "created_utc": 1492025274.0, "distinguished": null, "media": null, "upvote_ratio": 0.66, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_650dvr", "likes": null, "replies": "", "user_reports": [], "id": "dg6fp5i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "vxx", "parent_id": "t3_650dvr", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Good story. I could really need a dog like that with my bad orientation instincts.  ", "edited": 1492026888.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good story. I could really need a dog like that with my bad orientation instincts.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg6fp5i", "score_hidden": false, "stickied": false, "created": 1492055205.0, "created_utc": 1492026405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]