[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We met at work and have been together a bit over a year. Our relationship has never been super stable but I told him I loved him after 8 months and I meant it. Over the last couple of months, things have been extra rocky. We&amp;#39;ve probably gotten into an argument about every week. It was grating on both of us. I haven&amp;#39;t felt like he&amp;#39;s satisfied my physical or emotional needs.&lt;/p&gt;\n\n&lt;p&gt;One night after as bit of drinking, he left his his iPad playing music all night while we were sleeping. He told me he sometimes does this when he sleeps alone. The morning after, I wanted to see what app it was because the interface looked unfamiliar so I pressed the home button twice and accidentally discovered his secret Instagram soft core porn collection. No big deal. I understand that&amp;#39;s not out of the norm and I was curious about what kind of girls he found attractive since he would never talk about it to me directly.&lt;/p&gt;\n\n&lt;p&gt;Over the next couple of weeks, I&amp;#39;ve been more curious than ever to learn more about him. I start work later than he does and I have his place to myself after I stay over. I started looking about his backed up images and text messages with his best friend. There were lots of hints that he was sleazy, but today I dug deep enough that I know for sure. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s been lying to my face about wanting to work remote together and go on vacation together, when he clearly told his friend he had no intention. He&amp;#39;s obsessed with Asian massage parlors and has been going to them before our relationship as well as during the course of it. He has regulars and even his best friend who lives across the state refers to them by their names. He cheated on me during his last vacation which was supposedly a boy&amp;#39;s diving trip. He used to be a scuba diving instructor years ago and now he&amp;#39;s telling his friend he&amp;#39;s in his prime now. He&amp;#39;s getting older, he&amp;#39;ll be 34 next month, but he still feels young and has money now.&lt;/p&gt;\n\n&lt;p&gt;He has so many double standards for me. They&amp;#39;re just too ridiculous to list. When he&amp;#39;s upset at me for something, I now have evidence that he is so much worse. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just tired. I feel cheated. I feel like I&amp;#39;ve wasted so much time. Usually it&amp;#39;s way easier for me to pick up on scumbags. I&amp;#39;m not sure what to do. I don&amp;#39;t feel like bringing all this up to him directly. I want to tell him general break up reasons like, &amp;quot;I can&amp;#39;t see a future with you, we want different things, etc.&amp;quot; The place we worked at was a very close knit company and now we work in different offices and don&amp;#39;t have to deal with people directly. I guess I don&amp;#39;t want him to say bad things about our breakup. I want to let my closest work friends (who are now at different companies) to know about this. Is that a terrible idea?&lt;/p&gt;\n\n&lt;p&gt;Earlier tonight, I cancelled our dinner and brunch reservations for the weekend. I also cancelled a birthday dinner reservation for him. I feel like these are the first baby steps. I&amp;#39;ve thought about breaking up with him a lot before and never followed through. I guess through all the turbulence the relationship faced, I still really enjoyed his company. He&amp;#39;s smart, funny and a bit of a dork.&lt;/p&gt;\n\n&lt;p&gt;Before him, I was single for about 5 years. A lot of that was because I was traveling a lot and because I enjoyed the dating scene. Now, I&amp;#39;m getting older and I&amp;#39;ve gained some relationship weight. My self-esteem is not in a healthy state like it used to be. I joined a yoga and cycling gym yesterday and have already gone to 3 classes. This is the first time I&amp;#39;ve channeled negative energy into something more positive thank drinking too much and laying in bed all day. I&amp;#39;m a little proud of myself. I&amp;#39;ve told some of my closest friends that I&amp;#39;m going to break up with my boyfriend but didn&amp;#39;t give details. Everyone has been completely supportive and they want to spend time with me to talk about it. I felt so numb about all this in the morning but now I&amp;#39;ve just started crying uncontrollably and shaking over writing the last paragraph or two. One of my best friends who lives in Australia and whom I haven&amp;#39;t seen in years just texted me back and gave me some very supportive words. I think that may have to do with the crying a bit too. Anyway, I think I got out all I wanted to say. I&amp;#39;m looking forward to being free again. I&amp;#39;ll need to learn how to open up myself to love and trust again. I will followthrough with the break up this time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "We met at work and have been together a bit over a year. Our relationship has never been super stable but I told him I loved him after 8 months and I meant it. Over the last couple of months, things have been extra rocky. We've probably gotten into an argument about every week. It was grating on both of us. I haven't felt like he's satisfied my physical or emotional needs.\n\nOne night after as bit of drinking, he left his his iPad playing music all night while we were sleeping. He told me he sometimes does this when he sleeps alone. The morning after, I wanted to see what app it was because the interface looked unfamiliar so I pressed the home button twice and accidentally discovered his secret Instagram soft core porn collection. No big deal. I understand that's not out of the norm and I was curious about what kind of girls he found attractive since he would never talk about it to me directly.\n\nOver the next couple of weeks, I've been more curious than ever to learn more about him. I start work later than he does and I have his place to myself after I stay over. I started looking about his backed up images and text messages with his best friend. There were lots of hints that he was sleazy, but today I dug deep enough that I know for sure. \n\nHe's been lying to my face about wanting to work remote together and go on vacation together, when he clearly told his friend he had no intention. He's obsessed with Asian massage parlors and has been going to them before our relationship as well as during the course of it. He has regulars and even his best friend who lives across the state refers to them by their names. He cheated on me during his last vacation which was supposedly a boy's diving trip. He used to be a scuba diving instructor years ago and now he's telling his friend he's in his prime now. He's getting older, he'll be 34 next month, but he still feels young and has money now.\n\nHe has so many double standards for me. They're just too ridiculous to list. When he's upset at me for something, I now have evidence that he is so much worse. \n\nI'm just tired. I feel cheated. I feel like I've wasted so much time. Usually it's way easier for me to pick up on scumbags. I'm not sure what to do. I don't feel like bringing all this up to him directly. I want to tell him general break up reasons like, \"I can't see a future with you, we want different things, etc.\" The place we worked at was a very close knit company and now we work in different offices and don't have to deal with people directly. I guess I don't want him to say bad things about our breakup. I want to let my closest work friends (who are now at different companies) to know about this. Is that a terrible idea?\n\nEarlier tonight, I cancelled our dinner and brunch reservations for the weekend. I also cancelled a birthday dinner reservation for him. I feel like these are the first baby steps. I've thought about breaking up with him a lot before and never followed through. I guess through all the turbulence the relationship faced, I still really enjoyed his company. He's smart, funny and a bit of a dork.\n\nBefore him, I was single for about 5 years. A lot of that was because I was traveling a lot and because I enjoyed the dating scene. Now, I'm getting older and I've gained some relationship weight. My self-esteem is not in a healthy state like it used to be. I joined a yoga and cycling gym yesterday and have already gone to 3 classes. This is the first time I've channeled negative energy into something more positive thank drinking too much and laying in bed all day. I'm a little proud of myself. I've told some of my closest friends that I'm going to break up with my boyfriend but didn't give details. Everyone has been completely supportive and they want to spend time with me to talk about it. I felt so numb about all this in the morning but now I've just started crying uncontrollably and shaking over writing the last paragraph or two. One of my best friends who lives in Australia and whom I haven't seen in years just texted me back and gave me some very supportive words. I think that may have to do with the crying a bit too. Anyway, I think I got out all I wanted to say. I'm looking forward to being free again. I'll need to learn how to open up myself to love and trust again. I will followthrough with the break up this time.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "653qe0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "ididntseeanysigns", "saved": false, "mod_reports": [], "name": "t3_653qe0", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/653qe0/i_found_out_today_that_my_boyfriend_has_been/", "num_reports": null, "locked": false, "stickied": false, "created": 1492091945.0, "url": "https://www.reddit.com/r/self/comments/653qe0/i_found_out_today_that_my_boyfriend_has_been/", "author_flair_text": null, "quarantine": false, "title": "I found out today that my boyfriend has been cheating on me", "created_utc": 1492063145.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_653qe0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_653qe0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_653qe0", "likes": null, "replies": "", "user_reports": [], "id": "dg79c40", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sporks5000", "parent_id": "t1_dg797kw", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "I am glad to know that it was appreciated.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am glad to know that it was appreciated.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg79c40", "score_hidden": false, "stickied": false, "created": 1492095044.0, "created_utc": 1492066244.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg797kw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tzucon", "parent_id": "t1_dg78i15", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "A very thorough and useful reply to OP. Thank you for posting it.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A very thorough and useful reply to OP. Thank you for posting it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg797kw", "score_hidden": false, "stickied": false, "created": 1492094728.0, "created_utc": 1492065928.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_653qe0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_653qe0", "likes": null, "replies": "", "user_reports": [], "id": "dg7cne3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sporks5000", "parent_id": "t1_dg7bvv5", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Thank you. I just... really like people and want a world where people can be happy. If I can help someone, even a little bit, with words... then I think it's worth trying to do.\n\nI do want to say that it sounds to me like you're handling this incredibly well. Don't give up hope and find the path forward that works best for you. But... yeah, given the details that you've provided, I don't think that this relationship is worth putting any more time or effort into.\n\nHonestly, I've always been of the opinion that everything in life is temporary, including relationships. Whether they only last a few days, or last you to the end of your life, they WILL end. The only healthy way to handle that knowledge is to take them one day at a time, enjoy them as much as you can, and learn from them when they present you with things worth learning.\n\nI'm not saying that no relationship is worth fighting for, or that you should always give up on them if they get rough, but I **am** saying that it's okay to reach a point where you feel that a relationship is not worth moving forward with.\n\nMy fingers are crossed that you can move on from this one without forgetting the positive things and without overlooking any life lessons that it might have provided.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I just... really like people and want a world where people can be happy. If I can help someone, even a little bit, with words... then I think it&amp;#39;s worth trying to do.&lt;/p&gt;\n\n&lt;p&gt;I do want to say that it sounds to me like you&amp;#39;re handling this incredibly well. Don&amp;#39;t give up hope and find the path forward that works best for you. But... yeah, given the details that you&amp;#39;ve provided, I don&amp;#39;t think that this relationship is worth putting any more time or effort into.&lt;/p&gt;\n\n&lt;p&gt;Honestly, I&amp;#39;ve always been of the opinion that everything in life is temporary, including relationships. Whether they only last a few days, or last you to the end of your life, they WILL end. The only healthy way to handle that knowledge is to take them one day at a time, enjoy them as much as you can, and learn from them when they present you with things worth learning.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying that no relationship is worth fighting for, or that you should always give up on them if they get rough, but I &lt;strong&gt;am&lt;/strong&gt; saying that it&amp;#39;s okay to reach a point where you feel that a relationship is not worth moving forward with.&lt;/p&gt;\n\n&lt;p&gt;My fingers are crossed that you can move on from this one without forgetting the positive things and without overlooking any life lessons that it might have provided.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg7cne3", "score_hidden": false, "stickied": false, "created": 1492104693.0, "created_utc": 1492075893.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bvv5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ididntseeanysigns", "parent_id": "t1_dg78i15", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Thank you for the thoughtful reply, kind wishes, and support. I looked a little at your post history. Keep doing what you're doing. The world needs more people like you. Hope your day is going better than mine ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the thoughtful reply, kind wishes, and support. I looked a little at your post history. Keep doing what you&amp;#39;re doing. The world needs more people like you. Hope your day is going better than mine ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg7bvv5", "score_hidden": false, "stickied": false, "created": 1492102341.0, "created_utc": 1492073541.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78i15", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "sporks5000", "parent_id": "t3_653qe0", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "&gt; I want to tell him general break up reasons like, \"I can't see a future with you, we want different things, etc.\" \n\nThat sounds reasonable, given the circumstances - If you tell him the specifics, even if you came about those details legitimately, he will likely try to turn those details back on you to make you look bad to others. I'm making assumptions about his character here that cannot be ascertained by the details that you've provided. I might be completely wrong, but it sounds like this is one of your concerns as well.\n\n&gt; I want to let my closest work friends (who are now at different companies) to know about this. Is that a terrible idea?\n\nIt depends on how much of a risk there is for that information to get back to him. I definitely feel that you should have friends that you can open up to about this, I think that it will probably make healing from it easier. But if it gets back to him, it will make the healing process more complicated, so... use your best judgment?\n\n&gt; I guess through all the turbulence the relationship faced, I still really enjoyed his company. He's smart, funny and a bit of a dork.\n\nThese are good qualities, but my fingers are crossed that you can find someone else who has them as well and also isn't willing to be dishonest with you.\n\n&gt; I felt so numb about all this in the morning but now I've just started crying uncontrollably and shaking over writing the last paragraph or two.\n\nLife decisions like this are hard, even when one of the choices is fairly obviously the right one.\n\n&gt; I'm looking forward to being free again. I'll need to learn how to open up myself to love and trust again. I will followthrough with the break up this time.\n\nI wish you the very best luck in this endeavor. This is not the end of the world. You can do this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I want to tell him general break up reasons like, &amp;quot;I can&amp;#39;t see a future with you, we want different things, etc.&amp;quot; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That sounds reasonable, given the circumstances - If you tell him the specifics, even if you came about those details legitimately, he will likely try to turn those details back on you to make you look bad to others. I&amp;#39;m making assumptions about his character here that cannot be ascertained by the details that you&amp;#39;ve provided. I might be completely wrong, but it sounds like this is one of your concerns as well.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I want to let my closest work friends (who are now at different companies) to know about this. Is that a terrible idea?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It depends on how much of a risk there is for that information to get back to him. I definitely feel that you should have friends that you can open up to about this, I think that it will probably make healing from it easier. But if it gets back to him, it will make the healing process more complicated, so... use your best judgment?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I guess through all the turbulence the relationship faced, I still really enjoyed his company. He&amp;#39;s smart, funny and a bit of a dork.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;These are good qualities, but my fingers are crossed that you can find someone else who has them as well and also isn&amp;#39;t willing to be dishonest with you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I felt so numb about all this in the morning but now I&amp;#39;ve just started crying uncontrollably and shaking over writing the last paragraph or two.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Life decisions like this are hard, even when one of the choices is fairly obviously the right one.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m looking forward to being free again. I&amp;#39;ll need to learn how to open up myself to love and trust again. I will followthrough with the break up this time.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I wish you the very best luck in this endeavor. This is not the end of the world. You can do this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg78i15", "score_hidden": false, "stickied": false, "created": 1492092969.0, "created_utc": 1492064169.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_653qe0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_653qe0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_653qe0", "likes": null, "replies": "", "user_reports": [], "id": "dg7c3so", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tzucon", "parent_id": "t1_dg7byci", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "I'm afraid I'm not much of a relationship expert, perhaps someone else here can suggest ideas on how to find the right person. \n\nYou said that your former boyfriend was \"Funny, smart and kind of a dork.\" If you're also a dork, perhaps look into people with similar hobbies or interests? I got into Firefly and Dr Who from my GF, and she watches West Wing and a few others from me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m afraid I&amp;#39;m not much of a relationship expert, perhaps someone else here can suggest ideas on how to find the right person. &lt;/p&gt;\n\n&lt;p&gt;You said that your former boyfriend was &amp;quot;Funny, smart and kind of a dork.&amp;quot; If you&amp;#39;re also a dork, perhaps look into people with similar hobbies or interests? I got into Firefly and Dr Who from my GF, and she watches West Wing and a few others from me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg7c3so", "score_hidden": false, "stickied": false, "created": 1492103025.0, "created_utc": 1492074225.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7byci", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ididntseeanysigns", "parent_id": "t1_dg798lz", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Thanks, I'm really hoping I can find someone that I'm crazy excited about. I'm getting better at knowing what I want and at this stage in my life, I've realized I want something long term as long as it's with the right person.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I&amp;#39;m really hoping I can find someone that I&amp;#39;m crazy excited about. I&amp;#39;m getting better at knowing what I want and at this stage in my life, I&amp;#39;ve realized I want something long term as long as it&amp;#39;s with the right person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg7byci", "score_hidden": false, "stickied": false, "created": 1492102558.0, "created_utc": 1492073758.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg798lz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tzucon", "parent_id": "t3_653qe0", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "I'm sorry this happened to you, but it sounds like you're got good ideas for solving the relationship without it imploding. \n\nI hope you have better luck in the future, find someone who deserves you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry this happened to you, but it sounds like you&amp;#39;re got good ideas for solving the relationship without it imploding. &lt;/p&gt;\n\n&lt;p&gt;I hope you have better luck in the future, find someone who deserves you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg798lz", "score_hidden": false, "stickied": false, "created": 1492094798.0, "created_utc": 1492065998.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_653qe0", "likes": null, "replies": "", "user_reports": [], "id": "dg7qud6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jimrings", "parent_id": "t3_653qe0", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Man this would be fine if you just said \"we're done\" and he asks why and you say \"You know why\" then proceed to ghost him for the rest of time. Fuck him, he needs no explanation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man this would be fine if you just said &amp;quot;we&amp;#39;re done&amp;quot; and he asks why and you say &amp;quot;You know why&amp;quot; then proceed to ghost him for the rest of time. Fuck him, he needs no explanation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg7qud6", "score_hidden": false, "stickied": false, "created": 1492127630.0, "created_utc": 1492098830.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]