[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h2&gt;Throwaway.&lt;/h2&gt;\n\n&lt;p&gt;I&amp;#39;ve been skipping school for various reasons since I was probably in 4th grade. Some of the reasons have been class presentations or speeches, assignments that I&amp;#39;d procrastinate on or didn&amp;#39;t want to turn in quite yet (wanted to see what other people turned in first just to make sure that mine was &amp;quot;perfect&amp;quot; or &amp;quot;up to par&amp;quot;), anxiety issues, and just having an overall lack of enthusiasm for school which has been declining throughout the years.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;I am currently in college; my 4th year. It&amp;#39;s been very difficult since I have depression and social anxiety as well as some self esteem issues. I went to uni for my first year - made some regrettable\n decisions - then moved onto a local community college where I stayed for 2 years, and now am enrolled at a vocational school. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really happy with the program I&amp;#39;m in; I keep up with the work for the most part; I&amp;#39;ve actually made some friends at my new school; I earned a 4.0 GPA last semester; but I&amp;#39;m slowly falling into my bad habits with skipping school. I always seem to find one reason or another to miss. I feel so ashamed that I do this to myself especially since in the past it has caused even more depression and social anxiety. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t bring myself to tell my family or my boyfriend. They all think I&amp;#39;ve been doing better although my family has mentioned that I seem a little &amp;quot;down&amp;quot; lately. I really don&amp;#39;t have much to be sad about but I am anyways. I&amp;#39;m on medication for it and I felt like I was doing better but now I&amp;#39;m unsure what to do.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;The reason isn&amp;#39;t completely because I&amp;#39;m afraid of the social situations that come along with school; I just hate going. Whenever I&amp;#39;ve been employed in the past (currently unemployed and looking for a part time job) I&amp;#39;ve been a really hard worker and rise above and beyond and have been regarded by my employers as a pleasure to have. I just don&amp;#39;t know what to do with myself anymore. I&amp;#39;m so scared that I&amp;#39;ll end up ruining the rest of my life because my &amp;quot;bad habit&amp;quot; will start to affect everything else in my life and that I&amp;#39;ll never get a good career and that my boyfriend will have to support the both of us (if he would even put up with it, he doesn&amp;#39;t know how bad I&amp;#39;ve been feeling about everything). I&amp;#39;m so mortified with myself that I feel like I lack the motivation to fix it.&lt;/p&gt;\n\n&lt;h2&gt;What should I do? Any suggestions?&lt;/h2&gt;\n\n&lt;h2&gt;Also, let me know if I should include any more information. Just kind of spitballing here.&lt;/h2&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "##Throwaway.\n\n\nI've been skipping school for various reasons since I was probably in 4th grade. Some of the reasons have been class presentations or speeches, assignments that I'd procrastinate on or didn't want to turn in quite yet (wanted to see what other people turned in first just to make sure that mine was \"perfect\" or \"up to par\"), anxiety issues, and just having an overall lack of enthusiasm for school which has been declining throughout the years.\n\n&amp;nbsp;\n\nI am currently in college; my 4th year. It's been very difficult since I have depression and social anxiety as well as some self esteem issues. I went to uni for my first year - made some regrettable\n decisions - then moved onto a local community college where I stayed for 2 years, and now am enrolled at a vocational school. \n\n&amp;nbsp;\n\nI'm really happy with the program I'm in; I keep up with the work for the most part; I've actually made some friends at my new school; I earned a 4.0 GPA last semester; but I'm slowly falling into my bad habits with skipping school. I always seem to find one reason or another to miss. I feel so ashamed that I do this to myself especially since in the past it has caused even more depression and social anxiety. \n\n&amp;nbsp;\n\nI can't bring myself to tell my family or my boyfriend. They all think I've been doing better although my family has mentioned that I seem a little \"down\" lately. I really don't have much to be sad about but I am anyways. I'm on medication for it and I felt like I was doing better but now I'm unsure what to do.\n\n&amp;nbsp;\n\nThe reason isn't completely because I'm afraid of the social situations that come along with school; I just hate going. Whenever I've been employed in the past (currently unemployed and looking for a part time job) I've been a really hard worker and rise above and beyond and have been regarded by my employers as a pleasure to have. I just don't know what to do with myself anymore. I'm so scared that I'll end up ruining the rest of my life because my \"bad habit\" will start to affect everything else in my life and that I'll never get a good career and that my boyfriend will have to support the both of us (if he would even put up with it, he doesn't know how bad I've been feeling about everything). I'm so mortified with myself that I feel like I lack the motivation to fix it.\n\n\n##What should I do? Any suggestions?\n\n\n##Also, let me know if I should include any more information. Just kind of spitballing here.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "655aam", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "throwaway5520-1", "saved": false, "mod_reports": [], "name": "t3_655aam", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": 1492093802.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/655aam/i_skip_school_a_lot_help/", "num_reports": null, "locked": false, "stickied": false, "created": 1492116988.0, "url": "https://www.reddit.com/r/self/comments/655aam/i_skip_school_a_lot_help/", "author_flair_text": null, "quarantine": false, "title": "I skip school a lot... help!", "created_utc": 1492088188.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_655aam", "likes": null, "replies": "", "user_reports": [], "id": "dg87reb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dizzy-Cat", "parent_id": "t3_655aam", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Your college should have some counseling services.  They will be confidential.  I'd strongly suggest calling them up and scheduling a meeting.  If you are unsure if your school has services, just ask a professor or walk into the main office and ask.  You don't need to explain yourself - as far as they are concerned, you are just curious, or hell, gathering info for a friend who might want to attend, if you feel awkward asking.\n\nCounseling would serve you well, and it really isn't scary.  I know.  I'm a grad student in mental health counseling and if I knew what I do now about counseling back when I was struggling as an undergrad (who flunked out his senior year), I would have gladly walked through that door.  \n\nAnd again, if you attend, it will be confidential.  Your family doesn't need to know, your partner doesn't need to know, no one needs to know if you don't want - just you and the counseling service will know.\n\nIf you have questions about counseling, feel free to ask me and I'll do my best to give you any and all the information I have about the process.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your college should have some counseling services.  They will be confidential.  I&amp;#39;d strongly suggest calling them up and scheduling a meeting.  If you are unsure if your school has services, just ask a professor or walk into the main office and ask.  You don&amp;#39;t need to explain yourself - as far as they are concerned, you are just curious, or hell, gathering info for a friend who might want to attend, if you feel awkward asking.&lt;/p&gt;\n\n&lt;p&gt;Counseling would serve you well, and it really isn&amp;#39;t scary.  I know.  I&amp;#39;m a grad student in mental health counseling and if I knew what I do now about counseling back when I was struggling as an undergrad (who flunked out his senior year), I would have gladly walked through that door.  &lt;/p&gt;\n\n&lt;p&gt;And again, if you attend, it will be confidential.  Your family doesn&amp;#39;t need to know, your partner doesn&amp;#39;t need to know, no one needs to know if you don&amp;#39;t want - just you and the counseling service will know.&lt;/p&gt;\n\n&lt;p&gt;If you have questions about counseling, feel free to ask me and I&amp;#39;ll do my best to give you any and all the information I have about the process.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg87reb", "score_hidden": false, "stickied": false, "created": 1492145892.0, "created_utc": 1492117092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_655aam", "likes": null, "replies": "", "user_reports": [], "id": "dg7ojr2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "enderpretender", "parent_id": "t3_655aam", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Woody Allen: \"Showing up is 80% of life.\"\n\nImmerse yourself in the external duties that you've agreed to. Some days you'll be  miserable from your obligations, some neutral, and some invigorated. Your willingness to engage must be the constant. \n\nEvery time you choose to ditch, you'll feel shittier about your choices. Stopping the behavioral pattern will result in less feelings of anxiety.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Woody Allen: &amp;quot;Showing up is 80% of life.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Immerse yourself in the external duties that you&amp;#39;ve agreed to. Some days you&amp;#39;ll be  miserable from your obligations, some neutral, and some invigorated. Your willingness to engage must be the constant. &lt;/p&gt;\n\n&lt;p&gt;Every time you choose to ditch, you&amp;#39;ll feel shittier about your choices. Stopping the behavioral pattern will result in less feelings of anxiety.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg7ojr2", "score_hidden": false, "stickied": false, "created": 1492125171.0, "created_utc": 1492096371.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]