[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Had a really big drinking problem that ruined everything I had before it started. A fiance left me, jobs fired me, friends abandoned me, and my relationship with my family was the last I had to fall back on. &lt;/p&gt;\n\n&lt;p&gt;But I was depressed, and vodka is really good at making depression worse. I didn&amp;#39;t want to work, I didn&amp;#39;t want to look for work. I had a small epiphany after my brother, the closet person to me in my life, really dug into me. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Remember that day Lucus died (our close friend fell to his death from a rock climbing accident didn&amp;#39;t know who the fatality was: him or my brother, until my brother came off 3 hours later, covered in Lucus&amp;#39; brother)? It was 11am and you were loaded. You couldn&amp;#39;t lay off the booze even when you were awaiting to see who had died. That was the worst day of my life, and you were drunk and yelling at search and rescue.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;That did it for me. I&amp;#39;m not a Christian, but a mega church in my community offers free substance abuse therapy, and they help you write a resume, find a job and cheap housing. They knew I was a non-believer, so they focused it on: be who you want to be when Hollywood decides to make a movie. I really liked that advice, because it acknowledged I was in a shameful place, but like so many movies, there&amp;#39;s a happy ending. Cheezy, I know.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;ve been sober for three months. If anyone is struggling with sobriety: just try your best to get that first 10 days under your belt. Love yourself and do it for every reason you can come up with. Go to bed thinking about all the things that will get better if you blow past those first 10 days. &lt;/p&gt;\n\n&lt;p&gt;The church got me a job at a carpet manufacturer miles from my house. The owner goes to the church and hires from their program. We instantly hit it off, and he treats his employees sternly, but always acknowledges good work, and is a really strong motivator. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m making more than I thought a former sod could make, but the work is brutal and it took some getting used to. Today I got in my car and cried holding my first check, direct deposit starts next paycheck. But holy shit I&amp;#39;m not that piece of garbage that hurt so many people. I&amp;#39;m going to be able to pay rent, save up for a root canal.. buy a bday present for my nephew.. something that&amp;#39;s bothered me every time April rolls around. &lt;/p&gt;\n\n&lt;p&gt;Going sober is worth how difficult it is at first. It isn&amp;#39;t easy, and shouldn&amp;#39;t be, because of all the abuse it puts on the buddy. Take care ya&amp;#39;ll. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Had a really big drinking problem that ruined everything I had before it started. A fiance left me, jobs fired me, friends abandoned me, and my relationship with my family was the last I had to fall back on. \n\nBut I was depressed, and vodka is really good at making depression worse. I didn't want to work, I didn't want to look for work. I had a small epiphany after my brother, the closet person to me in my life, really dug into me. \n\n\"Remember that day Lucus died (our close friend fell to his death from a rock climbing accident didn't know who the fatality was: him or my brother, until my brother came off 3 hours later, covered in Lucus' brother)? It was 11am and you were loaded. You couldn't lay off the booze even when you were awaiting to see who had died. That was the worst day of my life, and you were drunk and yelling at search and rescue.\" \n\nThat did it for me. I'm not a Christian, but a mega church in my community offers free substance abuse therapy, and they help you write a resume, find a job and cheap housing. They knew I was a non-believer, so they focused it on: be who you want to be when Hollywood decides to make a movie. I really liked that advice, because it acknowledged I was in a shameful place, but like so many movies, there's a happy ending. Cheezy, I know.\n\nSo I've been sober for three months. If anyone is struggling with sobriety: just try your best to get that first 10 days under your belt. Love yourself and do it for every reason you can come up with. Go to bed thinking about all the things that will get better if you blow past those first 10 days. \n\nThe church got me a job at a carpet manufacturer miles from my house. The owner goes to the church and hires from their program. We instantly hit it off, and he treats his employees sternly, but always acknowledges good work, and is a really strong motivator. \n\nI'm making more than I thought a former sod could make, but the work is brutal and it took some getting used to. Today I got in my car and cried holding my first check, direct deposit starts next paycheck. But holy shit I'm not that piece of garbage that hurt so many people. I'm going to be able to pay rent, save up for a root canal.. buy a bday present for my nephew.. something that's bothered me every time April rolls around. \n\nGoing sober is worth how difficult it is at first. It isn't easy, and shouldn't be, because of all the abuse it puts on the buddy. Take care ya'll. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "659iqc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "stumply_", "saved": false, "mod_reports": [], "name": "t3_659iqc", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/659iqc/first_paycheck_after_being_unemployed_and_an/", "num_reports": null, "locked": false, "stickied": false, "created": 1492159651.0, "url": "https://www.reddit.com/r/self/comments/659iqc/first_paycheck_after_being_unemployed_and_an/", "author_flair_text": null, "quarantine": false, "title": "first paycheck after being unemployed and an alcoholic for four years and sober for three months", "created_utc": 1492130851.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_659iqc", "likes": null, "replies": "", "user_reports": [], "id": "dg8k8rs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "freedomlily", "parent_id": "t3_659iqc", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Congrats my friend!  :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congrats my friend!  :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg8k8rs", "score_hidden": false, "stickied": false, "created": 1492162326.0, "created_utc": 1492133526.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_659iqc", "likes": null, "replies": "", "user_reports": [], "id": "dg95kfr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zerul", "parent_id": "t3_659iqc", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Reading this really brightened my day. Im glad you found the strength to get out of the trap you were in. Buying that birthday present is going to feel so satisfying!\n\nGood job man, keep that strength going!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading this really brightened my day. Im glad you found the strength to get out of the trap you were in. Buying that birthday present is going to feel so satisfying!&lt;/p&gt;\n\n&lt;p&gt;Good job man, keep that strength going!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg95kfr", "score_hidden": false, "stickied": false, "created": 1492206919.0, "created_utc": 1492178119.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]