[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I got there dressed to the 9&amp;#39;s and I was trying to be ready for anything. When I first saw her and the other guy I was crushed and a lot of feelings came flooding back, but I completed my goal of meeting a few new people who were super supportive when I told them that I don&amp;#39;t usually go to concerts and that there&amp;#39;s some personal stuff that&amp;#39;s making it tough for me. At one point my ex did pass me alone and she said &amp;quot;hi&amp;quot; and it was a little tough to hide how I felt, but once the music started it got easier except for some songs that we both loved when we were together. But at the end of the night she was by herself for a moment and I came over with a smile and said that I had a great night and I hoped she had as well. It was nice to leave on a good note. I then got a record signed by the musician who told me to &amp;quot;keep my chin up&amp;quot; when I told him the gist of what I&amp;#39;ve been going through. I start personal counseling this coming Monday, but while I still hurt I was proud that I could have a good time by myself. I just wanted to share since so many of you in this subreddit were incredibly supportive on my last post. Thanks a million.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I got there dressed to the 9's and I was trying to be ready for anything. When I first saw her and the other guy I was crushed and a lot of feelings came flooding back, but I completed my goal of meeting a few new people who were super supportive when I told them that I don't usually go to concerts and that there's some personal stuff that's making it tough for me. At one point my ex did pass me alone and she said \"hi\" and it was a little tough to hide how I felt, but once the music started it got easier except for some songs that we both loved when we were together. But at the end of the night she was by herself for a moment and I came over with a smile and said that I had a great night and I hoped she had as well. It was nice to leave on a good note. I then got a record signed by the musician who told me to \"keep my chin up\" when I told him the gist of what I've been going through. I start personal counseling this coming Monday, but while I still hurt I was proud that I could have a good time by myself. I just wanted to share since so many of you in this subreddit were incredibly supportive on my last post. Thanks a million.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65c0d6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "kevinflorky", "saved": false, "mod_reports": [], "name": "t3_65c0d6", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/65c0d6/i_went_to_a_concert_that_my_ex_fiancé_was_at_with/", "num_reports": null, "locked": false, "stickied": false, "created": 1492198475.0, "url": "https://www.reddit.com/r/self/comments/65c0d6/i_went_to_a_concert_that_my_ex_fiancé_was_at_with/", "author_flair_text": null, "quarantine": false, "title": "I went to a concert that my ex fiancé was at with another man and I still managed to have a good time.", "created_utc": 1492169675.0, "distinguished": null, "media": null, "upvote_ratio": 0.8, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]