[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work in a small office with fewer than 10 people. I&amp;#39;m in the USA, I&amp;#39;m the only one in the office whose native language is English. Everyone speaks English to some degree, ranging from 2 who are fluent to one who can barely make himself understood and relies mostly on hand gestures when he has to talk to me. They all share a common native language, which I do not speak at all. I was brought in a couple of months ago, and I really have felt welcomed. Everyone treats me as part of the team, despite the language barrier. &lt;/p&gt;\n\n&lt;p&gt;Anytime someone needs to get on the phone with some other company and ask strange questions, it falls on me as the native English speaker. Sometimes that gets awkward. My boss will give me questions to ask, I&amp;#39;ll call and ask, then give him the answers and that will make him think of more questions, so I&amp;#39;ll have to call back. It can be very frustrating, but I never show my frustration because I want to be a team player and demonstrate my value to the company. &lt;/p&gt;\n\n&lt;p&gt;Well, now I have a real problem. We just purchased some new desks and they&amp;#39;re being set up in one room where several of us will eventually be moving. There&amp;#39;s some wiring that has to be done first to accommodate the multi-plug set up of the new cubes. One of the guys in the office is in charge of this (the one who uses hand gestures, so I really have no idea how knowledgeable he is).&lt;/p&gt;\n\n&lt;p&gt;My boss asked me to find 2 plugs that are set up so the wires come out the bottom. This us for a standard US plug. After a little trial and error, I discovered that what he wants is called a downward angled plug, and the plug style is called 5-15P.&lt;/p&gt;\n\n&lt;p&gt;I found several suitable plugs. They&amp;#39;re all over the internet and can be had for just a few dollars. The problem is that once I showed my boss what I&amp;#39;d found, he told me that he wants one with a 20 amp capacity. I did some more research and learned that 5-15P plugs don&amp;#39;t come in 20 amps due to electrical regulations. &lt;/p&gt;\n\n&lt;p&gt;I explained this to my boss, thinking that would be the end of it. Nope. He found some other plugs (which &lt;em&gt;will not&lt;/em&gt; fit a standard US outlet) that were 20 amps and insists that if they make &lt;em&gt;those&lt;/em&gt; plugs in 20 amp, then they make the others in 20 amp also. &lt;/p&gt;\n\n&lt;p&gt;Which is incorrect, but he won&amp;#39;t believe me. I&amp;#39;m not sure if he doesn&amp;#39;t understand because of the language barrier or if he thinks I&amp;#39;m lazy, dumb, not trying hard enough, etc. I&amp;#39;ve found many resources that show that what he&amp;#39;s asking for doesn&amp;#39;t exist and would likely be illegal to sell.&lt;/p&gt;\n\n&lt;p&gt;I have no idea what to do here. I&amp;#39;m afraid I&amp;#39;m going to lose my job over this, because I really haven&amp;#39;t been here long. I can&amp;#39;t think of another way to explain to him that these plugs only come in 15 amps. I&amp;#39;m pretty screwed. &lt;/p&gt;\n\n&lt;p&gt;TL;DR: Boss and I have two different native languages. He speaks mine a little, I do not speak his at all. He has asked me to locate a piece of hardware which, after researching, does not exist. He refuses to believe me and I have no idea how else to explain it, fear losing my job.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I work in a small office with fewer than 10 people. I'm in the USA, I'm the only one in the office whose native language is English. Everyone speaks English to some degree, ranging from 2 who are fluent to one who can barely make himself understood and relies mostly on hand gestures when he has to talk to me. They all share a common native language, which I do not speak at all. I was brought in a couple of months ago, and I really have felt welcomed. Everyone treats me as part of the team, despite the language barrier. \n\nAnytime someone needs to get on the phone with some other company and ask strange questions, it falls on me as the native English speaker. Sometimes that gets awkward. My boss will give me questions to ask, I'll call and ask, then give him the answers and that will make him think of more questions, so I'll have to call back. It can be very frustrating, but I never show my frustration because I want to be a team player and demonstrate my value to the company. \n\nWell, now I have a real problem. We just purchased some new desks and they're being set up in one room where several of us will eventually be moving. There's some wiring that has to be done first to accommodate the multi-plug set up of the new cubes. One of the guys in the office is in charge of this (the one who uses hand gestures, so I really have no idea how knowledgeable he is).\n\nMy boss asked me to find 2 plugs that are set up so the wires come out the bottom. This us for a standard US plug. After a little trial and error, I discovered that what he wants is called a downward angled plug, and the plug style is called 5-15P.\n\nI found several suitable plugs. They're all over the internet and can be had for just a few dollars. The problem is that once I showed my boss what I'd found, he told me that he wants one with a 20 amp capacity. I did some more research and learned that 5-15P plugs don't come in 20 amps due to electrical regulations. \n\nI explained this to my boss, thinking that would be the end of it. Nope. He found some other plugs (which *will not* fit a standard US outlet) that were 20 amps and insists that if they make *those* plugs in 20 amp, then they make the others in 20 amp also. \n\nWhich is incorrect, but he won't believe me. I'm not sure if he doesn't understand because of the language barrier or if he thinks I'm lazy, dumb, not trying hard enough, etc. I've found many resources that show that what he's asking for doesn't exist and would likely be illegal to sell.\n\nI have no idea what to do here. I'm afraid I'm going to lose my job over this, because I really haven't been here long. I can't think of another way to explain to him that these plugs only come in 15 amps. I'm pretty screwed. \n\nTL;DR: Boss and I have two different native languages. He speaks mine a little, I do not speak his at all. He has asked me to locate a piece of hardware which, after researching, does not exist. He refuses to believe me and I have no idea how else to explain it, fear losing my job.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65cxsb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "SharMarali", "saved": false, "mod_reports": [], "name": "t3_65cxsb", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": 1492181534.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/65cxsb/my_boss_wants_something_that_is_actually_truly/", "num_reports": null, "locked": false, "stickied": false, "created": 1492210144.0, "url": "https://www.reddit.com/r/self/comments/65cxsb/my_boss_wants_something_that_is_actually_truly/", "author_flair_text": null, "quarantine": false, "title": "My boss wants something that is actually, truly, 100% impossible", "created_utc": 1492181344.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65cxsb", "likes": null, "replies": "", "user_reports": [], "id": "dg98pev", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "belowthepovertyline", "parent_id": "t3_65cxsb", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "I'm leaning towards cultural differences here. The reason you can't find the plug in 20 amps is because it's considered hazardous. I'm willing to bet the regulations in his home country aren't as tight as they are here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m leaning towards cultural differences here. The reason you can&amp;#39;t find the plug in 20 amps is because it&amp;#39;s considered hazardous. I&amp;#39;m willing to bet the regulations in his home country aren&amp;#39;t as tight as they are here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg98pev", "score_hidden": false, "stickied": false, "created": 1492211084.0, "created_utc": 1492182284.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65cxsb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65cxsb", "likes": null, "replies": "", "user_reports": [], "id": "dg9nv8g", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "SharMarali", "parent_id": "t1_dg9gu0r", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Fortunately, the story has a happy, if not very satisfying ending. My boss called me into his office about 30 minutes ago. I was scared. He told me he had talked it over with the guy in charge of the project and decided that 15 amps would be enough. I don't know exactly what made him (or both of them) change his mind, but I'm glad. I ordered the plugs. Hopefully they know what they're doing and don't electrocute everyone in the office for an encore.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fortunately, the story has a happy, if not very satisfying ending. My boss called me into his office about 30 minutes ago. I was scared. He told me he had talked it over with the guy in charge of the project and decided that 15 amps would be enough. I don&amp;#39;t know exactly what made him (or both of them) change his mind, but I&amp;#39;m glad. I ordered the plugs. Hopefully they know what they&amp;#39;re doing and don&amp;#39;t electrocute everyone in the office for an encore.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg9nv8g", "score_hidden": false, "stickied": false, "created": 1492228813.0, "created_utc": 1492200013.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9gu0r", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "quietlight", "parent_id": "t3_65cxsb", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Hey, I trained as a theater/stage electrician in NYC. \n\nYou are correct, you cannot get ('.') style plugs larger than 15a. After that it moves to ('.-) for 20a. \n\nI recommend hiring a local electrician in your area to consult and then inevitably be the one that says no to your boss. That way you can be the one that says \"I can't find it, so I brought you the best expert in town! See, I'm helping the process along\" and be less responsible for the results. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I trained as a theater/stage electrician in NYC. &lt;/p&gt;\n\n&lt;p&gt;You are correct, you cannot get (&amp;#39;.&amp;#39;) style plugs larger than 15a. After that it moves to (&amp;#39;.-) for 20a. &lt;/p&gt;\n\n&lt;p&gt;I recommend hiring a local electrician in your area to consult and then inevitably be the one that says no to your boss. That way you can be the one that says &amp;quot;I can&amp;#39;t find it, so I brought you the best expert in town! See, I&amp;#39;m helping the process along&amp;quot; and be less responsible for the results. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg9gu0r", "score_hidden": false, "stickied": false, "created": 1492220417.0, "created_utc": 1492191617.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65cxsb", "likes": null, "replies": "", "user_reports": [], "id": "dg9h4ua", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hup234", "parent_id": "t3_65cxsb", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "I'm guessing it's a 15 amp circuit if the outlet uses that kind of plug so why does he insist on a 20A plug? Get one of the fluent English speakers to explain it to him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m guessing it&amp;#39;s a 15 amp circuit if the outlet uses that kind of plug so why does he insist on a 20A plug? Get one of the fluent English speakers to explain it to him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg9h4ua", "score_hidden": false, "stickied": false, "created": 1492220762.0, "created_utc": 1492191962.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65cxsb", "likes": null, "replies": "", "user_reports": [], "id": "dg9mseg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "spinlock", "parent_id": "t3_65cxsb", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Call an electrician and have them explain it to your boss. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Call an electrician and have them explain it to your boss. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dg9mseg", "score_hidden": false, "stickied": false, "created": 1492227518.0, "created_utc": 1492198718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]