[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi!&lt;/p&gt;\n\n&lt;p&gt;This is the beginning of my rant post, of things that I want to take out of my mind, and get a second point of view. I won&amp;#39;t really order this in an understandable manner, as I will write to clear stuff out of my mind as I go. If this doesn&amp;#39;t even go in this SR, please let me know, but I just want to write this down.\nThrowaway because i&amp;#39;m to ashamed to post on my real acc.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 19, about to go on 20, and i&amp;#39;ve been living on my own since i was 17. I finished a programming curse last year, and this year I went to work at this startup. Since I was living in the suburbs (couldn&amp;#39;t pay rent on the city, I was working as a waiter at a restaurant), I had 2 hours at least of commute - for each travel. 4hs just WAISTED on commute every day, and you couldn&amp;#39;t even read or study on the train and bus that I took every day - as it was packed. So I start there, and a month later I start attending a night college. I woke up every day @6am, and went to sleep @1am.... I slept at most 5hs per day. Say goodbye to any social interaction, study time outside w/e, or normal sleep patterns.&lt;/p&gt;\n\n&lt;p&gt;This went on for a couple of months... until last month, where I got kicked out of work. And as I was on first year of night college, the shit that I saw there was really easy for me - and I considered it not even usefull. After getting kicked out, it felt like a kick in the balls. I moved to the city the week before getting kicked out to minimize travel time, thus getting better sleep. They didn&amp;#39;t give a flying fuck, but it&amp;#39;s not their fault. The boss had a thing for time, and if you got 10 minutes later than the time that you had to enter, ggwp, that&amp;#39;s a late entry. So... mix that with a 2hs commute that changes every single day (one day it might take 1h 30m, and another day  2h 15m)... even If I got out of my house at the same time every single day, one day i&amp;#39;d be  30 minutes early, and the other day 15 minutes late. So, time passed by, and by the time I reached my 5th late entry, he fed up and kicked me out. I mean, I was warned, and told him that I was going to move, and that I was looking for places downtown to be closer to work... well.... fuck me. Moved to a more expensive place for absolutely nothing.&lt;/p&gt;\n\n&lt;p&gt;So, queue actual fuckup:&lt;/p&gt;\n\n&lt;p&gt;(Or rather, the moment where i&amp;#39;m right now.)&lt;/p&gt;\n\n&lt;p&gt;3 weeks have gone by. I only went out of my apartment to buy groceries. I still wake up early, shower, and take basic care of myself.... but nothing else. I&amp;#39;ve been sitting around all day playing video games, watching netflix, and masturbating. I&amp;#39;ve had more than 10 e-mails from companies that &lt;em&gt;actually&lt;/em&gt; want my service, calling me for an interview. I know that I could get a job for next week if I even cared.&lt;/p&gt;\n\n&lt;p&gt;I have 1.2k whatsapp messages. I haven&amp;#39;t picked up my phone to any of the calls I&amp;#39;ve received. My family wants to know what the fuck is going on. My grandmother rang my bell the other day and I didn&amp;#39;t even bother to answer. I&amp;#39;m too ashamed to show what a complete utter fuck-up I am. I couldn&amp;#39;t keep even a fucking entry level programming job at almost minimum wage on a fucking startup. And I think I won&amp;#39;t approve college just because I haven&amp;#39;t attended enough classes.&lt;/p&gt;\n\n&lt;p&gt;What the fuck has happened to my life. I used to have the &lt;strong&gt;only&lt;/strong&gt; 100% covered scholarship on one of the best (read: most expensive) high school in my country. I was the only one on the history of the school that got both Academics &lt;em&gt;and&lt;/em&gt; Sports leaderships. My (ex) HS gf was a model. I traveled abroad for the math Olympics, representing my country (argentina). My swimming times are &lt;em&gt;still&lt;/em&gt; the record times at my hs. And all this while bearing with my shitty diagnosed ADD, without ever taking medication.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m lost. i&amp;#39;ve done nothing usefull out of my life in the past 3 years, and it is a trend. No, I won&amp;#39;t kill myself, I&amp;#39;m not stupid enough. But I had such a great future, and I&amp;#39;m letting everybody that ever knew me down, including my family.&lt;/p&gt;\n\n&lt;p&gt;I need help.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi!\n\nThis is the beginning of my rant post, of things that I want to take out of my mind, and get a second point of view. I won't really order this in an understandable manner, as I will write to clear stuff out of my mind as I go. If this doesn't even go in this SR, please let me know, but I just want to write this down.\nThrowaway because i'm to ashamed to post on my real acc.\n\nI'm 19, about to go on 20, and i've been living on my own since i was 17. I finished a programming curse last year, and this year I went to work at this startup. Since I was living in the suburbs (couldn't pay rent on the city, I was working as a waiter at a restaurant), I had 2 hours at least of commute - for each travel. 4hs just WAISTED on commute every day, and you couldn't even read or study on the train and bus that I took every day - as it was packed. So I start there, and a month later I start attending a night college. I woke up every day @6am, and went to sleep @1am.... I slept at most 5hs per day. Say goodbye to any social interaction, study time outside w/e, or normal sleep patterns.\n\nThis went on for a couple of months... until last month, where I got kicked out of work. And as I was on first year of night college, the shit that I saw there was really easy for me - and I considered it not even usefull. After getting kicked out, it felt like a kick in the balls. I moved to the city the week before getting kicked out to minimize travel time, thus getting better sleep. They didn't give a flying fuck, but it's not their fault. The boss had a thing for time, and if you got 10 minutes later than the time that you had to enter, ggwp, that's a late entry. So... mix that with a 2hs commute that changes every single day (one day it might take 1h 30m, and another day  2h 15m)... even If I got out of my house at the same time every single day, one day i'd be  30 minutes early, and the other day 15 minutes late. So, time passed by, and by the time I reached my 5th late entry, he fed up and kicked me out. I mean, I was warned, and told him that I was going to move, and that I was looking for places downtown to be closer to work... well.... fuck me. Moved to a more expensive place for absolutely nothing.\n\nSo, queue actual fuckup:\n\n(Or rather, the moment where i'm right now.)\n\n\n3 weeks have gone by. I only went out of my apartment to buy groceries. I still wake up early, shower, and take basic care of myself.... but nothing else. I've been sitting around all day playing video games, watching netflix, and masturbating. I've had more than 10 e-mails from companies that *actually* want my service, calling me for an interview. I know that I could get a job for next week if I even cared.\n\nI have 1.2k whatsapp messages. I haven't picked up my phone to any of the calls I've received. My family wants to know what the fuck is going on. My grandmother rang my bell the other day and I didn't even bother to answer. I'm too ashamed to show what a complete utter fuck-up I am. I couldn't keep even a fucking entry level programming job at almost minimum wage on a fucking startup. And I think I won't approve college just because I haven't attended enough classes.\n\n\nWhat the fuck has happened to my life. I used to have the **only** 100% covered scholarship on one of the best (read: most expensive) high school in my country. I was the only one on the history of the school that got both Academics *and* Sports leaderships. My (ex) HS gf was a model. I traveled abroad for the math Olympics, representing my country (argentina). My swimming times are *still* the record times at my hs. And all this while bearing with my shitty diagnosed ADD, without ever taking medication.\n\n\nI'm lost. i've done nothing usefull out of my life in the past 3 years, and it is a trend. No, I won't kill myself, I'm not stupid enough. But I had such a great future, and I'm letting everybody that ever knew me down, including my family.\n\nI need help.\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65gm0m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 26, "report_reasons": null, "author": "throwaway_sponsored", "saved": false, "mod_reports": [], "name": "t3_65gm0m", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/65gm0m/im_lost_currently_3_weeks_into_doing_absolutely/", "num_reports": null, "locked": false, "stickied": false, "created": 1492249262.0, "url": "https://www.reddit.com/r/self/comments/65gm0m/im_lost_currently_3_weeks_into_doing_absolutely/", "author_flair_text": null, "quarantine": false, "title": "I'm lost. Currently 3 weeks into doing absolutely nothing at all.", "created_utc": 1492220462.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65gm0m", "likes": null, "replies": "", "user_reports": [], "id": "dga7fgq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "The_Angry_Anus", "parent_id": "t3_65gm0m", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "It's so crazy uncanny how similar of a situation we're both in. No, we're not suicidal, but we're lost. I have achievements like you as well, things to actually be proud of and skills that have real value. But I choose to sit inside and do nothing. \n\nMy best piece of advice right now is do something out of your element. I have taken up the millwright trade, having never seen myself as a trades-person before. I love it, it gives me direction. Education is key to success and it doesn't always come in the way of a university degree. Never stop the pursuit of education; in whatever form it may come in. \n\nSo while I may have zero answers for you, at least we're lost together and you can take comfort in the fact that most of society is. Open back up to your family, they will always love you and support you. Be you astronaut of garbage man you are their universe, don't forget that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s so crazy uncanny how similar of a situation we&amp;#39;re both in. No, we&amp;#39;re not suicidal, but we&amp;#39;re lost. I have achievements like you as well, things to actually be proud of and skills that have real value. But I choose to sit inside and do nothing. &lt;/p&gt;\n\n&lt;p&gt;My best piece of advice right now is do something out of your element. I have taken up the millwright trade, having never seen myself as a trades-person before. I love it, it gives me direction. Education is key to success and it doesn&amp;#39;t always come in the way of a university degree. Never stop the pursuit of education; in whatever form it may come in. &lt;/p&gt;\n\n&lt;p&gt;So while I may have zero answers for you, at least we&amp;#39;re lost together and you can take comfort in the fact that most of society is. Open back up to your family, they will always love you and support you. Be you astronaut of garbage man you are their universe, don&amp;#39;t forget that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dga7fgq", "score_hidden": false, "stickied": false, "created": 1492254854.0, "created_utc": 1492226054.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65gm0m", "likes": null, "replies": "", "user_reports": [], "id": "dgak89b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zaldarr", "parent_id": "t3_65gm0m", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Mate, I think you're being way way too hard on yourself. First of all, you did your absolute darndest to keep the job. You packed up and fucking moved to please your asswipe boss who obviously has no understanding of how the real world works. Trust me, as someone who has had a lot of terrible bosses/management, you're not the one at fault here.\n\nYou've got prospects dude. You've got companies literally trying to get you to work for them. You have people who care about you. You are the opposite of a fuckup. What I think you've got, however, is a sink of depression from the shitty work environment you've been put in. And that's something you need to battle and pull yourself out of, with the help from the people who obviously give a damn about you. Friends and family. Youre beating yourself up a lot dude. You're 19/20. I'm 23 and I don't even have my damn drivers license at this age. Why? Girlfriend died on the highway when I was 18 and initially learning to drive. Difficult father who was not very good at instruction. But now I've got my shit together and I should have my license at the end of the year, or close to it. I'm utterly ashamed that I didn't push past my problems and deal with them in an emotionally healthy way. I'm still not out of the woods but I'm doing a lot better and I'm back on track. It's all about two steps forward, one step back. This is your step back man, and I know you can put your foot forward again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mate, I think you&amp;#39;re being way way too hard on yourself. First of all, you did your absolute darndest to keep the job. You packed up and fucking moved to please your asswipe boss who obviously has no understanding of how the real world works. Trust me, as someone who has had a lot of terrible bosses/management, you&amp;#39;re not the one at fault here.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve got prospects dude. You&amp;#39;ve got companies literally trying to get you to work for them. You have people who care about you. You are the opposite of a fuckup. What I think you&amp;#39;ve got, however, is a sink of depression from the shitty work environment you&amp;#39;ve been put in. And that&amp;#39;s something you need to battle and pull yourself out of, with the help from the people who obviously give a damn about you. Friends and family. Youre beating yourself up a lot dude. You&amp;#39;re 19/20. I&amp;#39;m 23 and I don&amp;#39;t even have my damn drivers license at this age. Why? Girlfriend died on the highway when I was 18 and initially learning to drive. Difficult father who was not very good at instruction. But now I&amp;#39;ve got my shit together and I should have my license at the end of the year, or close to it. I&amp;#39;m utterly ashamed that I didn&amp;#39;t push past my problems and deal with them in an emotionally healthy way. I&amp;#39;m still not out of the woods but I&amp;#39;m doing a lot better and I&amp;#39;m back on track. It&amp;#39;s all about two steps forward, one step back. This is your step back man, and I know you can put your foot forward again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgak89b", "score_hidden": false, "stickied": false, "created": 1492285351.0, "created_utc": 1492256551.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65gm0m", "likes": null, "replies": "", "user_reports": [], "id": "dgas718", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kingdomlike", "parent_id": "t3_65gm0m", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Maybe I can help but please respond to my comment so I know my words aren't falling on deaf ears.\n\nThe expectations you are placing on yourself are killing you. You are swinging to the extreme. You either want to meet all expectations flawlessly or if you can't, you will self-destruct and hide yourself from the world. LET GO OF ALL EXPECTATIONS.\n\nYou need to realize you are human and that it's ok to show others that you are human. Humans aren't perfect and make mistakes. This is a great thing because it means we get to adjust and give it a 2nd try. The second time around is usually even better than the first. Without that fuck up we would never have gotten the 2nd try opportunity. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe I can help but please respond to my comment so I know my words aren&amp;#39;t falling on deaf ears.&lt;/p&gt;\n\n&lt;p&gt;The expectations you are placing on yourself are killing you. You are swinging to the extreme. You either want to meet all expectations flawlessly or if you can&amp;#39;t, you will self-destruct and hide yourself from the world. LET GO OF ALL EXPECTATIONS.&lt;/p&gt;\n\n&lt;p&gt;You need to realize you are human and that it&amp;#39;s ok to show others that you are human. Humans aren&amp;#39;t perfect and make mistakes. This is a great thing because it means we get to adjust and give it a 2nd try. The second time around is usually even better than the first. Without that fuck up we would never have gotten the 2nd try opportunity. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgas718", "score_hidden": false, "stickied": false, "created": 1492299837.0, "created_utc": 1492271037.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65gm0m", "likes": null, "replies": "", "user_reports": [], "id": "dgb5rvd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Keizerrr", "parent_id": "t3_65gm0m", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Hey OP,\n\nNot to downplay your issues, but just a matter of perspective - be happy with what you achieved so far. You're still in your teens and you've achieved so much already. There are people who would REALLY want to be in your shoes. These 3 weeks may be the first time there are cracks in the (pretty much) perfect picture you describe above. But that's OK - you're human. \n\nDon't think you're future is ruined - it is absolutely not. You're the only person who can make a change, so get off the couch and take action!\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey OP,&lt;/p&gt;\n\n&lt;p&gt;Not to downplay your issues, but just a matter of perspective - be happy with what you achieved so far. You&amp;#39;re still in your teens and you&amp;#39;ve achieved so much already. There are people who would REALLY want to be in your shoes. These 3 weeks may be the first time there are cracks in the (pretty much) perfect picture you describe above. But that&amp;#39;s OK - you&amp;#39;re human. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t think you&amp;#39;re future is ruined - it is absolutely not. You&amp;#39;re the only person who can make a change, so get off the couch and take action!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgb5rvd", "score_hidden": false, "stickied": false, "created": 1492318388.0, "created_utc": 1492289588.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]