[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Some backstory:&lt;/strong&gt; A few weeks ago my first kiss/relationship/whatever started ignoring me after I slept with him, then ~10 days later he broke up with me. That was (and still is) tough, but a few weeks ago I decided to get Tinder with a lot of encouragement from friends (I jokingly said how much I like going on dates...).&lt;/p&gt;\n\n&lt;p&gt;Tinder was interesting, and I just did it to chat to random people if anything. If we got on, then cool, but I didn&amp;#39;t expect anything.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Main story (meeting Seb):&lt;/strong&gt; The fact that I didn&amp;#39;t expect anything is why I feel so emotionally conflicted right now. Basically, the other day I got a match with Seb (name changed). Usually I just ignore Tinder matches, but this was after a stressful day of revision and I just wanted to straight-up talk to someone. Turns out as I was typing, he messaged me first - which was an unusually pleasant surprise.&lt;/p&gt;\n\n&lt;p&gt;Cue several of the most engaging conversations I&amp;#39;ve ever had with a stranger. We both took each other&amp;#39;s blunt personas well and we had similar views on life. Then in came the flirty stuff like &amp;quot;you&amp;#39;re so attractive/cute/hot throwaway766916&amp;quot;, &amp;quot;you don&amp;#39;t say the same menial shit like others do throwaway766916&amp;quot; and &amp;quot;Why are you so perfect throwaway 766916?&amp;quot;. I believed it. Seb was blunt, debonair, smart and had aspirations. My type of guy. We added each other on Facebook and after a nervous half-hour it seemed we both liked what we saw - no red flags.&lt;/p&gt;\n\n&lt;p&gt;Seb had one insecurity which he told me about - he was a closeted bisexual. He was nervous that I&amp;#39;d care, but I didn&amp;#39;t at all. However, I feel stupid for not considering this last night.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Last night:&lt;/strong&gt; Last [Thursday] night we were chatting as usual, but then Seb made our conversation raunchy. I was down for that, so we both ended up pleasuring ourselves whilst chatting over Messenger. Turns out Seb is a kinky fuck and seemingly enjoyed the feeling of having possession over me. I wasn&amp;#39;t really phased by it - different people have different fantasies and I enjoy going along with them. Besides, it was quite romantic. We finished, he said some nice shit and also said &amp;quot;I&amp;#39;ll be away from Friday evening to Tuesday afternoon - don&amp;#39;t masturbate until Tuesday to prove your loyalty to me. Talk tomorrow ;)&amp;quot;. I agreed and would happily wait until Tuesday.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Today:&lt;/strong&gt; He didn&amp;#39;t send me a message, or read mine. I saw early this morning he viewed my LinkedIn. He&amp;#39;d also seemed to make most of his photos private. Late this evening I checked again, because it felt off. Couldn&amp;#39;t find him. Checked Messenger, he still had his name but he was &amp;quot;unavailable&amp;quot; to message - meaning he&amp;#39;d blocked me. Also unmatched me on Tinder.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The aftermath:&lt;/strong&gt; So now I just feel pathetic. I get so attached to people so fast. I tell them how I&amp;#39;ve felt used in the past and that I don&amp;#39;t expect anything long-term, but closure would be fucking nice. So many times I&amp;#39;ve been left out to rot by lying sacks of shit. I can&amp;#39;t help it if I get attached to people quickly, can I? What do I do?&lt;/p&gt;\n\n&lt;p&gt;The worst thing is I only knew Seb for a few fucking days! What the fuck is wrong with me? Even right now part of me is thinking he just got spooked by a major bout of post-fap regret and he&amp;#39;ll come back soon...&lt;/p&gt;\n\n&lt;p&gt;I suppose I&amp;#39;m also disappointed because I&amp;#39;ve been against the generalisation that when it comes to relationships, guys are easily freaked out and run away without saying anything. However, all my experiences support that claim. Now I&amp;#39;m scared I have trust issues.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR:&lt;/strong&gt; Tinder actually gave me a decent-seeming match - loljk he ghosted me after using me for dirty talk.&lt;/p&gt;\n\n&lt;p&gt;Fuck you Seb. I&amp;#39;m going to masturbate now, so fuck you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**Some backstory:** A few weeks ago my first kiss/relationship/whatever started ignoring me after I slept with him, then ~10 days later he broke up with me. That was (and still is) tough, but a few weeks ago I decided to get Tinder with a lot of encouragement from friends (I jokingly said how much I like going on dates...).\n\nTinder was interesting, and I just did it to chat to random people if anything. If we got on, then cool, but I didn't expect anything.\n\n**Main story (meeting Seb):** The fact that I didn't expect anything is why I feel so emotionally conflicted right now. Basically, the other day I got a match with Seb (name changed). Usually I just ignore Tinder matches, but this was after a stressful day of revision and I just wanted to straight-up talk to someone. Turns out as I was typing, he messaged me first - which was an unusually pleasant surprise.\n\nCue several of the most engaging conversations I've ever had with a stranger. We both took each other's blunt personas well and we had similar views on life. Then in came the flirty stuff like \"you're so attractive/cute/hot throwaway766916\", \"you don't say the same menial shit like others do throwaway766916\" and \"Why are you so perfect throwaway 766916?\". I believed it. Seb was blunt, debonair, smart and had aspirations. My type of guy. We added each other on Facebook and after a nervous half-hour it seemed we both liked what we saw - no red flags.\n\nSeb had one insecurity which he told me about - he was a closeted bisexual. He was nervous that I'd care, but I didn't at all. However, I feel stupid for not considering this last night.\n\n**Last night:** Last [Thursday] night we were chatting as usual, but then Seb made our conversation raunchy. I was down for that, so we both ended up pleasuring ourselves whilst chatting over Messenger. Turns out Seb is a kinky fuck and seemingly enjoyed the feeling of having possession over me. I wasn't really phased by it - different people have different fantasies and I enjoy going along with them. Besides, it was quite romantic. We finished, he said some nice shit and also said \"I'll be away from Friday evening to Tuesday afternoon - don't masturbate until Tuesday to prove your loyalty to me. Talk tomorrow ;)\". I agreed and would happily wait until Tuesday.\n\n**Today:** He didn't send me a message, or read mine. I saw early this morning he viewed my LinkedIn. He'd also seemed to make most of his photos private. Late this evening I checked again, because it felt off. Couldn't find him. Checked Messenger, he still had his name but he was \"unavailable\" to message - meaning he'd blocked me. Also unmatched me on Tinder.\n\n**The aftermath:** So now I just feel pathetic. I get so attached to people so fast. I tell them how I've felt used in the past and that I don't expect anything long-term, but closure would be fucking nice. So many times I've been left out to rot by lying sacks of shit. I can't help it if I get attached to people quickly, can I? What do I do?\n\nThe worst thing is I only knew Seb for a few fucking days! What the fuck is wrong with me? Even right now part of me is thinking he just got spooked by a major bout of post-fap regret and he'll come back soon...\n\nI suppose I'm also disappointed because I've been against the generalisation that when it comes to relationships, guys are easily freaked out and run away without saying anything. However, all my experiences support that claim. Now I'm scared I have trust issues.\n\n**TLDR:** Tinder actually gave me a decent-seeming match - loljk he ghosted me after using me for dirty talk.\n\nFuck you Seb. I'm going to masturbate now, so fuck you.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65gtzm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "throwaway766916", "saved": false, "mod_reports": [], "name": "t3_65gtzm", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": true, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/65gtzm/nsfw_been_ghosted_for_the_first_time_i_feel/", "num_reports": null, "locked": false, "stickied": false, "created": 1492252205.0, "url": "https://www.reddit.com/r/self/comments/65gtzm/nsfw_been_ghosted_for_the_first_time_i_feel/", "author_flair_text": null, "quarantine": false, "title": "[NSFW] Been ghosted for the first time. I feel pathetic and in need of a virtual hug.", "created_utc": 1492223405.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65gtzm", "likes": null, "replies": "", "user_reports": [], "id": "dgb6r8k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eeek124", "parent_id": "t3_65gtzm", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "*HUGS* Lots of flakey people out there in the Tinderverse and beyond. Hate to say it but its the nature of dating these days. They ghost because they know you won't be compatible in the long run and are just too chicken shit of letting people down nicely before doing the ghosting bit. I think ghosters are afraid of confrontation or a pushy hanger on hoping for more, and ghosting is just easier because \"out of sight out of mind\" and they can forget anything happened because usually they never have to interact with you again in every day life if you are both fortunate.\nKeep trucking, sort through the frogs and eventually you'll find a prince.", "edited": 1492291212.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;HUGS&lt;/em&gt; Lots of flakey people out there in the Tinderverse and beyond. Hate to say it but its the nature of dating these days. They ghost because they know you won&amp;#39;t be compatible in the long run and are just too chicken shit of letting people down nicely before doing the ghosting bit. I think ghosters are afraid of confrontation or a pushy hanger on hoping for more, and ghosting is just easier because &amp;quot;out of sight out of mind&amp;quot; and they can forget anything happened because usually they never have to interact with you again in every day life if you are both fortunate.\nKeep trucking, sort through the frogs and eventually you&amp;#39;ll find a prince.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgb6r8k", "score_hidden": false, "stickied": false, "created": 1492319768.0, "created_utc": 1492290968.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65gtzm", "likes": null, "replies": "", "user_reports": [], "id": "dgaq6xf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CarthageForever", "parent_id": "t3_65gtzm", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Seb sounds like a real piece of shit to be honest. You're better off. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seb sounds like a real piece of shit to be honest. You&amp;#39;re better off. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgaq6xf", "score_hidden": false, "stickied": false, "created": 1492296962.0, "created_utc": 1492268162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]