[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is gonna be a sad/depressing story. I&amp;#39;m sorry&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Every day is a struggle for me. I wake up and get ready for school like the same thing everyone else does. Shower, shave, shoes, show up. And every day I get to school, I see a couple in the parking lot making out or laughing. Or there&amp;#39;s a group of people sitting in the back of a pickup truck eating fresh bacon from IHOP or something. I have very few friends and the friends I do have either don&amp;#39;t go to school with me, older than me, or I rarely see them in school. &lt;/p&gt;\n\n&lt;p&gt;I have anxiety when it comes to talking to girls. Let&amp;#39;s say I&amp;#39;m talking to a buddy and there&amp;#39;s a cute girl standing by herself in the hall or walking...she&amp;#39;s alone basically. The conversation that follows with....tom...let&amp;#39;s call him tom....goes like this:&lt;/p&gt;\n\n&lt;p&gt;Me: Hey that girl is really cute. &lt;/p&gt;\n\n&lt;p&gt;Tom: go talk to her then&lt;/p&gt;\n\n&lt;p&gt;Me: but what if she seems grossed out by me or uninterested?&lt;/p&gt;\n\n&lt;p&gt;Tom: then walk away&lt;/p&gt;\n\n&lt;p&gt;Me: so what&amp;#39;s the point of even going over there&lt;/p&gt;\n\n&lt;p&gt;Tom: to have a shot with her&lt;/p&gt;\n\n&lt;p&gt;Me: but she&amp;#39;s gonna say no&lt;/p&gt;\n\n&lt;p&gt;And it&amp;#39;s just an endless loop of that. I don&amp;#39;t know how some guys do it but I can&amp;#39;t. I physically can&amp;#39;t. I can&amp;#39;t approach girls and say hi. I seem awkward and I probably seem like a creep and a pig who is just looking to get laid or whatever. Even if on some miraculous reason I make it, I don&amp;#39;t know what to say. I don&amp;#39;t know how to act, and everything my parents taught me about chivalry goes out the window. It has been like this for years and I get pissed off at anyone who says &amp;quot;just go talk to her&amp;quot; like it&amp;#39;s the easiest task in the world. I don&amp;#39;t know how to overcome it&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Guys have feelings too. But we aren&amp;#39;t allowed to show them. Why? Who knows. I walk down the halls with anxiety wanting to scream and yell and cry my eyes out over nothing but depression. People tell me to get over it because I&amp;#39;m just sad. Well guess what buddy I&amp;#39;m sad for I fucking reason. I&amp;#39;m sad when I should be happy. I feel like my eyes are glued wide open at 3 am and I can&amp;#39;t shut them because I can&amp;#39;t find the reason to want to. I would love to talk to people about this stuff. But I can&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t even remember the last time I got a compliment from someone not named mom. And it sucks too because I love compliments. Even petty ones like &amp;quot;i like your eyes&amp;quot; or something...something that I may even be feeling self conscious about. Like my hair...or the fact that my beard doesn&amp;#39;t connect with my mustache or something I don&amp;#39;t know. It sucks that girls receive all these compliments every day from guys that don&amp;#39;t even know them and that&amp;#39;s considered normal but I&amp;#39;m sitting in a corner wondering if anyone even thinks I exist. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I would never in a million years commit suicide. I&amp;#39;m not stupid enough to put family members and the few friends I have in the position that I am currently in right now because I know there&amp;#39;s a way out of this. But I am not about to lie and say I&amp;#39;ve never thought about it or even never have done self harm. Because I have. I tried starving myself. Or taking an extra dose of Benadryl because I want to sleep longer. &lt;/p&gt;\n\n&lt;p&gt;I know what I&amp;#39;m doing when it comes to my actions. I stay awake at night wondering if the belt in my closet could support my weight if I hung myself. Or maybe even if I downed the entire bottle of NyQuil. But I chose not to because I actually do want to be alive&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going into the military. That&amp;#39;s all I have going for me. I trust myself to be happier by the time i ship out and hope to find new brothers and sisters trust and call my own. But I don&amp;#39;t ship out until august and I know I will most likely be single and probably not even receive a compliment other that &amp;quot;congratulations&amp;quot; or &amp;quot;im so proud of you&amp;quot;. Both of which probably coming from my mother. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;That&amp;#39;s all I have to rant about today. I apologize if this was depressing to any of y&amp;#39;all or was sad but I just needed to get that off my chest. Thank you for reading. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is gonna be a sad/depressing story. I'm sorry\n\n-------------\n\nEvery day is a struggle for me. I wake up and get ready for school like the same thing everyone else does. Shower, shave, shoes, show up. And every day I get to school, I see a couple in the parking lot making out or laughing. Or there's a group of people sitting in the back of a pickup truck eating fresh bacon from IHOP or something. I have very few friends and the friends I do have either don't go to school with me, older than me, or I rarely see them in school. \n\nI have anxiety when it comes to talking to girls. Let's say I'm talking to a buddy and there's a cute girl standing by herself in the hall or walking...she's alone basically. The conversation that follows with....tom...let's call him tom....goes like this:\n\nMe: Hey that girl is really cute. \n\nTom: go talk to her then\n\nMe: but what if she seems grossed out by me or uninterested?\n\nTom: then walk away\n\nMe: so what's the point of even going over there\n\nTom: to have a shot with her\n\nMe: but she's gonna say no\n\nAnd it's just an endless loop of that. I don't know how some guys do it but I can't. I physically can't. I can't approach girls and say hi. I seem awkward and I probably seem like a creep and a pig who is just looking to get laid or whatever. Even if on some miraculous reason I make it, I don't know what to say. I don't know how to act, and everything my parents taught me about chivalry goes out the window. It has been like this for years and I get pissed off at anyone who says \"just go talk to her\" like it's the easiest task in the world. I don't know how to overcome it\n\n-------\n\nGuys have feelings too. But we aren't allowed to show them. Why? Who knows. I walk down the halls with anxiety wanting to scream and yell and cry my eyes out over nothing but depression. People tell me to get over it because I'm just sad. Well guess what buddy I'm sad for I fucking reason. I'm sad when I should be happy. I feel like my eyes are glued wide open at 3 am and I can't shut them because I can't find the reason to want to. I would love to talk to people about this stuff. But I can't. \n\nI don't even remember the last time I got a compliment from someone not named mom. And it sucks too because I love compliments. Even petty ones like \"i like your eyes\" or something...something that I may even be feeling self conscious about. Like my hair...or the fact that my beard doesn't connect with my mustache or something I don't know. It sucks that girls receive all these compliments every day from guys that don't even know them and that's considered normal but I'm sitting in a corner wondering if anyone even thinks I exist. \n\n------------\n\nI would never in a million years commit suicide. I'm not stupid enough to put family members and the few friends I have in the position that I am currently in right now because I know there's a way out of this. But I am not about to lie and say I've never thought about it or even never have done self harm. Because I have. I tried starving myself. Or taking an extra dose of Benadryl because I want to sleep longer. \n\nI know what I'm doing when it comes to my actions. I stay awake at night wondering if the belt in my closet could support my weight if I hung myself. Or maybe even if I downed the entire bottle of NyQuil. But I chose not to because I actually do want to be alive\n\nI'm going into the military. That's all I have going for me. I trust myself to be happier by the time i ship out and hope to find new brothers and sisters trust and call my own. But I don't ship out until august and I know I will most likely be single and probably not even receive a compliment other that \"congratulations\" or \"im so proud of you\". Both of which probably coming from my mother. \n\n----------\n\nThat's all I have to rant about today. I apologize if this was depressing to any of y'all or was sad but I just needed to get that off my chest. Thank you for reading. \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65mu1b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "i_gotta_large_weiner", "saved": false, "mod_reports": [], "name": "t3_65mu1b", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/65mu1b/i_have_depression_and_i_feel_like_it_is_because_i/", "num_reports": null, "locked": false, "stickied": false, "created": 1492336926.0, "url": "https://www.reddit.com/r/self/comments/65mu1b/i_have_depression_and_i_feel_like_it_is_because_i/", "author_flair_text": null, "quarantine": false, "title": "I have depression, and I feel like it is because I am a guy most of the time.", "created_utc": 1492308126.0, "distinguished": null, "media": null, "upvote_ratio": 0.6, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65mu1b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65mu1b", "likes": null, "replies": "", "user_reports": [], "id": "dgblj23", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "i_gotta_large_weiner", "parent_id": "t1_dgbkcz0", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "I have tried. My counselor called my parents and told them and my dad thought I was lying and I was just being a drama queen and I should just man up", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have tried. My counselor called my parents and told them and my dad thought I was lying and I was just being a drama queen and I should just man up&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgblj23", "score_hidden": false, "stickied": false, "created": 1492340958.0, "created_utc": 1492312158.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbkcz0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JostleMania", "parent_id": "t3_65mu1b", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Talk to a therapist of some sort. Your school counselor/psychologist is a good start. You brain chemicals are out of whack. It isn't a personal failure on your part.\n\nSchool blows. Things can get better if you work to make them better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to a therapist of some sort. Your school counselor/psychologist is a good start. You brain chemicals are out of whack. It isn&amp;#39;t a personal failure on your part.&lt;/p&gt;\n\n&lt;p&gt;School blows. Things can get better if you work to make them better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgbkcz0", "score_hidden": false, "stickied": false, "created": 1492339245.0, "created_utc": 1492310445.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65mu1b", "likes": null, "replies": "", "user_reports": [], "id": "dgbvxk8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "seannzzzie", "parent_id": "t3_65mu1b", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "OP, I would hug you if I met you in person. \n\nI have been hiding my feelings for a while since my dad died last year. I'm a dude. I have to. My mom and sister have sort of gone to shit to say over it. I have to be the strong one now. I don't want to be that person anymore. \n\nLike the other person said, go to your school therapist. Tell them they aren't helping. Ask for off school help, but request it still be covered by the school. They might be able to do that, I'm not sure it will depend on your school most likely. If the school therapist called you parents after you went to them, that could be a breach of patient/doctor confidentiality depending on your school's policies. Most likely it is. If that is the case, you need to find the chain to go above the school therapist's head and do something about it. That is highly illegal. \n\nIf you are able to find off campus counseling that is affordable that will be better for you. \n\nAlso, try and live in the now as much as you can. Not the future. If you do, things will fall into place. Take each day at a time. \n\nAny opportunity you've missed or messed up with a girl wasn't meant to be, so don't sweat it. And honestly, it's cliche, but the worst they can do is say no after you initiate conversation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, I would hug you if I met you in person. &lt;/p&gt;\n\n&lt;p&gt;I have been hiding my feelings for a while since my dad died last year. I&amp;#39;m a dude. I have to. My mom and sister have sort of gone to shit to say over it. I have to be the strong one now. I don&amp;#39;t want to be that person anymore. &lt;/p&gt;\n\n&lt;p&gt;Like the other person said, go to your school therapist. Tell them they aren&amp;#39;t helping. Ask for off school help, but request it still be covered by the school. They might be able to do that, I&amp;#39;m not sure it will depend on your school most likely. If the school therapist called you parents after you went to them, that could be a breach of patient/doctor confidentiality depending on your school&amp;#39;s policies. Most likely it is. If that is the case, you need to find the chain to go above the school therapist&amp;#39;s head and do something about it. That is highly illegal. &lt;/p&gt;\n\n&lt;p&gt;If you are able to find off campus counseling that is affordable that will be better for you. &lt;/p&gt;\n\n&lt;p&gt;Also, try and live in the now as much as you can. Not the future. If you do, things will fall into place. Take each day at a time. &lt;/p&gt;\n\n&lt;p&gt;Any opportunity you&amp;#39;ve missed or messed up with a girl wasn&amp;#39;t meant to be, so don&amp;#39;t sweat it. And honestly, it&amp;#39;s cliche, but the worst they can do is say no after you initiate conversation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgbvxk8", "score_hidden": false, "stickied": false, "created": 1492364413.0, "created_utc": 1492335613.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65mu1b", "likes": null, "replies": "", "user_reports": [], "id": "dgbykah", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mellenzia", "parent_id": "t3_65mu1b", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Good advice here already but it sounds like you need some physical contact from another person, not necessarily sexual either. Find a good body work/massage center nearby and go get a full body massage, you'll feel better for it and it won't cost much usually especially if you can find a deal on Groupon if that's an option. I hope you feel better soon! 😃", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good advice here already but it sounds like you need some physical contact from another person, not necessarily sexual either. Find a good body work/massage center nearby and go get a full body massage, you&amp;#39;ll feel better for it and it won&amp;#39;t cost much usually especially if you can find a deal on Groupon if that&amp;#39;s an option. I hope you feel better soon! 😃&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgbykah", "score_hidden": false, "stickied": false, "created": 1492372881.0, "created_utc": 1492344081.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]