[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The one on the opposite of the country. The one that means that, as two adults with aggressive goals and realistic expectations, what we have can not continue. &lt;/p&gt;\n\n&lt;p&gt;She and I met a month ago. Friend of a friend of a friend. By all accounts, we had no reason to meet. But we did and everything worked and things worked out way better than they should have.&lt;/p&gt;\n\n&lt;p&gt;I knew she was looking for another job, and I knew she wanted this one. I guess I just hoped she wouldn&amp;#39;t end up taking it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m at the point in my life where I&amp;#39;m done looking for relationships. I dated around, and I watched as all of my college friends slowly settled down and figure it out. But nothing ever clicked for me, and eventually I decided that nothing will ever click. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve spent a lot of my life alone, by choice. Call it being picky, call it high standards, call it being unrealistic... I call it liking my life and having never felt a need to settle. &lt;/p&gt;\n\n&lt;p&gt;But she blew into my life like a hurricane and showed me a hint of everything I thought I had missed my chance on finding. And she saw the same in me. &lt;/p&gt;\n\n&lt;p&gt;But she was in the middle of a job search that could take her across the country. And then she was offered an exec track job that in her area of expertise on the wrong side of the continent. The same job as mine, but thousands of miles away. And she took it. And I picked her up from the airport and i took her to dinner and we split a bottle of wine and we celebrated.&lt;/p&gt;\n\n&lt;p&gt;And then we talked. And told each other what we already knew. It&amp;#39;s not going to work. It can&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;And then it was done. &lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s it. &lt;/p&gt;\n\n&lt;p&gt;And fuck me. I forgot what this felt like. I forgot what it felt like to feel this. And I forgot what it felt like to lose it.&lt;/p&gt;\n\n&lt;p&gt;So now I&amp;#39;m drunk and watching a movie. It&amp;#39;ll be alright. It&amp;#39;s always been alright.&lt;/p&gt;\n\n&lt;p&gt;But fuck me. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The one on the opposite of the country. The one that means that, as two adults with aggressive goals and realistic expectations, what we have can not continue. \n\nShe and I met a month ago. Friend of a friend of a friend. By all accounts, we had no reason to meet. But we did and everything worked and things worked out way better than they should have.\n\nI knew she was looking for another job, and I knew she wanted this one. I guess I just hoped she wouldn't end up taking it.\n\nI'm at the point in my life where I'm done looking for relationships. I dated around, and I watched as all of my college friends slowly settled down and figure it out. But nothing ever clicked for me, and eventually I decided that nothing will ever click. \n\nI've spent a lot of my life alone, by choice. Call it being picky, call it high standards, call it being unrealistic... I call it liking my life and having never felt a need to settle. \n\nBut she blew into my life like a hurricane and showed me a hint of everything I thought I had missed my chance on finding. And she saw the same in me. \n\nBut she was in the middle of a job search that could take her across the country. And then she was offered an exec track job that in her area of expertise on the wrong side of the continent. The same job as mine, but thousands of miles away. And she took it. And I picked her up from the airport and i took her to dinner and we split a bottle of wine and we celebrated.\n\nAnd then we talked. And told each other what we already knew. It's not going to work. It can't. \n\nAnd then it was done. \n\nAnd that's it. \n\nAnd fuck me. I forgot what this felt like. I forgot what it felt like to feel this. And I forgot what it felt like to lose it.\n\nSo now I'm drunk and watching a movie. It'll be alright. It's always been alright.\n\nBut fuck me. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65nml1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 52, "report_reasons": null, "author": "BLACK-AND-DICKER", "saved": false, "mod_reports": [], "name": "t3_65nml1", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": 1492358588.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/65nml1/she_took_the_job/", "num_reports": null, "locked": false, "stickied": false, "created": 1492348834.0, "url": "https://www.reddit.com/r/self/comments/65nml1/she_took_the_job/", "author_flair_text": null, "quarantine": false, "title": "She took the job.", "created_utc": 1492320034.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 52}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65nml1", "likes": null, "replies": "", "user_reports": [], "id": "dgbrsbw", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "tzucon", "parent_id": "t3_65nml1", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Sorry OP. I won't give you empty platitudes about \"More fish in the sea\" or other nonsense.\n\nIf you really think there is a strong connection between the two of you, then try long distance. It's not easy but its not horrible either, and if you like this girl alot, then seriously consider it. But I know exactly what you mean by \"she blew into your life like a hurricane and showed you everything you missed.\" Kind of turned your entire world view on its head. \n\nIt sounds like you really like this girl. You can't blame her for taking a decent job over a guy she hardly knows, but you owe it to yourself and her to lay the cards on the table: if you really like her, actually go talk to her and try to make it work. Encourage her to take the job, and see if there's enough connection to try long distance. \n\nOtherwise: part as friends, mourn, get drunk again, then pick yourself up and go look for another. If you met through friends, they might even know someone else to introduce you too.\n\n\nBest of luck.", "edited": 1492323893.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry OP. I won&amp;#39;t give you empty platitudes about &amp;quot;More fish in the sea&amp;quot; or other nonsense.&lt;/p&gt;\n\n&lt;p&gt;If you really think there is a strong connection between the two of you, then try long distance. It&amp;#39;s not easy but its not horrible either, and if you like this girl alot, then seriously consider it. But I know exactly what you mean by &amp;quot;she blew into your life like a hurricane and showed you everything you missed.&amp;quot; Kind of turned your entire world view on its head. &lt;/p&gt;\n\n&lt;p&gt;It sounds like you really like this girl. You can&amp;#39;t blame her for taking a decent job over a guy she hardly knows, but you owe it to yourself and her to lay the cards on the table: if you really like her, actually go talk to her and try to make it work. Encourage her to take the job, and see if there&amp;#39;s enough connection to try long distance. &lt;/p&gt;\n\n&lt;p&gt;Otherwise: part as friends, mourn, get drunk again, then pick yourself up and go look for another. If you met through friends, they might even know someone else to introduce you too.&lt;/p&gt;\n\n&lt;p&gt;Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgbrsbw", "score_hidden": false, "stickied": false, "created": 1492352206.0, "created_utc": 1492323406.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65nml1", "likes": null, "replies": "", "user_reports": [], "id": "dgc030p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "onionkimm", "parent_id": "t3_65nml1", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Like you said, it'll be alright. It might take some time, but it'll be alright. It might not feel like it sometimes, but it'll be alright. A few months from now, you'll look back on how you felt during this time and realize that everything's alright.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like you said, it&amp;#39;ll be alright. It might take some time, but it&amp;#39;ll be alright. It might not feel like it sometimes, but it&amp;#39;ll be alright. A few months from now, you&amp;#39;ll look back on how you felt during this time and realize that everything&amp;#39;s alright.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgc030p", "score_hidden": false, "stickied": false, "created": 1492376543.0, "created_utc": 1492347743.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65nml1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65nml1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65nml1", "likes": null, "replies": "", "user_reports": [], "id": "dgcq5mb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xXIJDIXx", "parent_id": "t1_dgcom6o", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Thank you. Honestly, I'm not sure how well I'm handling it. I'm on disability for BPD, anxiety, depression, and other things, and I think it still hasn't really hit me yet. Maybe my years of experience dealing with my mental problems is helping me through it, but there's definitely been some dark times. Right now, I just want to rip the band-aid off and be separate, physically, legally and emotionally, but it's not that easy, we have a lot to go over. And I still have a lot to get through. But I'm somewhat excited to see where life will take me next. I'm already talking with my old best friend about getting an apartment together again, so there's that. There's a lot I just want to forget, and a lot of good I want to remember, but right now I just need to keep moving forward, before I sink. I won't let that happen again, I've made too much progress, and I need to be in a better place for myself. I just hope I never have to live through anything like this again. I'm definitely in need of some comfort, but I also definitely don't want another relationship, at least for a good long time. I'll just have to see where this goes and make the best of it.\n\nIt's also comforting knowing I have a burial plot next to my daughter, so one day I'll be reunited with her in some way. It's actually jointly owned by my ex and I, but she's letting me have it, thankfully. Or we'll figure it out if she eventually wants to be there too. I don't think I could ever see myself wishing ill of her, even after all this. Relationship-wise, I've been through worse, this is still the best relationship I've ever had, even though it was pretty shitty what she just did, after what we've been through. She hates cheating with a passion, and even said she'd leave me before she cheated on me, and I guess she did - just not fully. Oh well. She's younger, she needs more experience in the relationship department anyway. She was upset when I was nervous about marrying her for this very reason, but I'm still glad I did.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. Honestly, I&amp;#39;m not sure how well I&amp;#39;m handling it. I&amp;#39;m on disability for BPD, anxiety, depression, and other things, and I think it still hasn&amp;#39;t really hit me yet. Maybe my years of experience dealing with my mental problems is helping me through it, but there&amp;#39;s definitely been some dark times. Right now, I just want to rip the band-aid off and be separate, physically, legally and emotionally, but it&amp;#39;s not that easy, we have a lot to go over. And I still have a lot to get through. But I&amp;#39;m somewhat excited to see where life will take me next. I&amp;#39;m already talking with my old best friend about getting an apartment together again, so there&amp;#39;s that. There&amp;#39;s a lot I just want to forget, and a lot of good I want to remember, but right now I just need to keep moving forward, before I sink. I won&amp;#39;t let that happen again, I&amp;#39;ve made too much progress, and I need to be in a better place for myself. I just hope I never have to live through anything like this again. I&amp;#39;m definitely in need of some comfort, but I also definitely don&amp;#39;t want another relationship, at least for a good long time. I&amp;#39;ll just have to see where this goes and make the best of it.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also comforting knowing I have a burial plot next to my daughter, so one day I&amp;#39;ll be reunited with her in some way. It&amp;#39;s actually jointly owned by my ex and I, but she&amp;#39;s letting me have it, thankfully. Or we&amp;#39;ll figure it out if she eventually wants to be there too. I don&amp;#39;t think I could ever see myself wishing ill of her, even after all this. Relationship-wise, I&amp;#39;ve been through worse, this is still the best relationship I&amp;#39;ve ever had, even though it was pretty shitty what she just did, after what we&amp;#39;ve been through. She hates cheating with a passion, and even said she&amp;#39;d leave me before she cheated on me, and I guess she did - just not fully. Oh well. She&amp;#39;s younger, she needs more experience in the relationship department anyway. She was upset when I was nervous about marrying her for this very reason, but I&amp;#39;m still glad I did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgcq5mb", "score_hidden": false, "stickied": false, "created": 1492412822.0, "created_utc": 1492384022.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcom6o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hulasikali_Wala", "parent_id": "t1_dgclk0p", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Jesus man, I'm so sorry. I can say with absolute certainty I would not handle this anywhere near as well as you seem to be. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus man, I&amp;#39;m so sorry. I can say with absolute certainty I would not handle this anywhere near as well as you seem to be. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgcom6o", "score_hidden": false, "stickied": false, "created": 1492410697.0, "created_utc": 1492381897.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclk0p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "xXIJDIXx", "parent_id": "t3_65nml1", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "A few months ago, I lost my daughter to SIDS. She was 2. Since then, my wife and I have slowly been drifting apart. I've done what I could to save the relationship, but it's felt like she hasn't put an ounce of care into it, despite all I do. Sure, she does things too, but not to better herself or the relationship. The day we lost our daughter, my (now 4 year old) stepdaughter was taken from us too, for safety reasons. DCYF came in, found no problem, and stopped responding, leaving my stepdaughter with her paternal grandparents, who have to supervise her father because he spent 2 years in jail for choking a 4 year old almost to death. We are supposed to have our first unsupervised visit Wednesday after court this last week.\n\nWell, the other night my wife and I were at my in-laws drinking, as we do once in a while, and she admitted she had a crush on a guy twice her age, one of our old neighbors we met after our daughter passed. She passed it off as silly, and not to worry, and she wanted to spend the rest of her life with me, blah blah blah. I've had a similar thing, but nothing serious, so I just let it go. She joked about masturbating to him, I joked about masturbating to her sister, it was good weird fun, nothing we haven't joked about before, except a little worse.\n\nThe next morning, I brought up that I was a little hurt, though, since she saw the neighbor guy a lot, and was close to him, they talked over Facebook and played a mobile pool game frequently. I was always invited to go hang out too, or play pool, had a few fun times, but it wasn't my thing. Point being I felt a little hurt that she joked so hard about it when she was so close to the guy when what I joked about I wasn't really that close with. I didn't want to bring it up at first, because I thought it was silly, but she said I hold back too much, so I told her about it.\n\nShe left me.\n\nSaid she just needed some space, and time, and to figure herself out, she wasn't going to anyone else, she wants to be single. She isn't willing to do therapy or reconcile anything. My life shattered, but I thought there was a chance.\n\nShe later hung out with the guy, and made out with him (edit: turns out later she sucked his dick a bit too, she was keeping that one from me, hopefully that's all, besides the emotional cheating). His fiancee's sister's husband saw, and told, and apparently he's getting kicked out. She told me this morning. Told me she didn't want to get back together, while she still cared about me and what we had it's changed, that it's over. She still wants to be single, and work on herself, etc. We'll see how that goes.\n\nWe're still friendly, and working out separating, but this is just so shitty, after all we've been through. She says I can still be around for her daughter, but it won't be the same. I was her only father figure for the longest time, the first one she knew, and she loves the shit out of me as I do her. Her biological father isn't the greatest obviously, and isn't very present. Doing that is going to get more and more complicated as time goes on though, as I can't really see her without my ex-wife being there too.\n\nI practically have lost a wife and two kids, now.\n\nMy point is, love is a fickle thing. It hits you like a brick, and you can lose it just as soon as you find it. It can be a great and terrible thing. All you can do is try and take the good from it, and don't hide from the pain. You need to grieve through it a bit, but life always goes on, and you can always find your place again, maybe with someone else, maybe not. Just be glad to have the time you had.", "edited": 1492392984.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A few months ago, I lost my daughter to SIDS. She was 2. Since then, my wife and I have slowly been drifting apart. I&amp;#39;ve done what I could to save the relationship, but it&amp;#39;s felt like she hasn&amp;#39;t put an ounce of care into it, despite all I do. Sure, she does things too, but not to better herself or the relationship. The day we lost our daughter, my (now 4 year old) stepdaughter was taken from us too, for safety reasons. DCYF came in, found no problem, and stopped responding, leaving my stepdaughter with her paternal grandparents, who have to supervise her father because he spent 2 years in jail for choking a 4 year old almost to death. We are supposed to have our first unsupervised visit Wednesday after court this last week.&lt;/p&gt;\n\n&lt;p&gt;Well, the other night my wife and I were at my in-laws drinking, as we do once in a while, and she admitted she had a crush on a guy twice her age, one of our old neighbors we met after our daughter passed. She passed it off as silly, and not to worry, and she wanted to spend the rest of her life with me, blah blah blah. I&amp;#39;ve had a similar thing, but nothing serious, so I just let it go. She joked about masturbating to him, I joked about masturbating to her sister, it was good weird fun, nothing we haven&amp;#39;t joked about before, except a little worse.&lt;/p&gt;\n\n&lt;p&gt;The next morning, I brought up that I was a little hurt, though, since she saw the neighbor guy a lot, and was close to him, they talked over Facebook and played a mobile pool game frequently. I was always invited to go hang out too, or play pool, had a few fun times, but it wasn&amp;#39;t my thing. Point being I felt a little hurt that she joked so hard about it when she was so close to the guy when what I joked about I wasn&amp;#39;t really that close with. I didn&amp;#39;t want to bring it up at first, because I thought it was silly, but she said I hold back too much, so I told her about it.&lt;/p&gt;\n\n&lt;p&gt;She left me.&lt;/p&gt;\n\n&lt;p&gt;Said she just needed some space, and time, and to figure herself out, she wasn&amp;#39;t going to anyone else, she wants to be single. She isn&amp;#39;t willing to do therapy or reconcile anything. My life shattered, but I thought there was a chance.&lt;/p&gt;\n\n&lt;p&gt;She later hung out with the guy, and made out with him (edit: turns out later she sucked his dick a bit too, she was keeping that one from me, hopefully that&amp;#39;s all, besides the emotional cheating). His fiancee&amp;#39;s sister&amp;#39;s husband saw, and told, and apparently he&amp;#39;s getting kicked out. She told me this morning. Told me she didn&amp;#39;t want to get back together, while she still cared about me and what we had it&amp;#39;s changed, that it&amp;#39;s over. She still wants to be single, and work on herself, etc. We&amp;#39;ll see how that goes.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re still friendly, and working out separating, but this is just so shitty, after all we&amp;#39;ve been through. She says I can still be around for her daughter, but it won&amp;#39;t be the same. I was her only father figure for the longest time, the first one she knew, and she loves the shit out of me as I do her. Her biological father isn&amp;#39;t the greatest obviously, and isn&amp;#39;t very present. Doing that is going to get more and more complicated as time goes on though, as I can&amp;#39;t really see her without my ex-wife being there too.&lt;/p&gt;\n\n&lt;p&gt;I practically have lost a wife and two kids, now.&lt;/p&gt;\n\n&lt;p&gt;My point is, love is a fickle thing. It hits you like a brick, and you can lose it just as soon as you find it. It can be a great and terrible thing. All you can do is try and take the good from it, and don&amp;#39;t hide from the pain. You need to grieve through it a bit, but life always goes on, and you can always find your place again, maybe with someone else, maybe not. Just be glad to have the time you had.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgclk0p", "score_hidden": false, "stickied": false, "created": 1492406629.0, "created_utc": 1492377829.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65nml1", "likes": null, "replies": "", "user_reports": [], "id": "dgc4muo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thatspep", "parent_id": "t3_65nml1", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "I was watching something last night, and one of the characters suffered a break-up and said, \"Now I know what used BBQ napkins feel like\".\n\nYour story was beautifully written, and my wish for you is that the feeling of loss quickly transforms into an appreciation of the positive ways in which knowing her shaped your life for the better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was watching something last night, and one of the characters suffered a break-up and said, &amp;quot;Now I know what used BBQ napkins feel like&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Your story was beautifully written, and my wish for you is that the feeling of loss quickly transforms into an appreciation of the positive ways in which knowing her shaped your life for the better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgc4muo", "score_hidden": false, "stickied": false, "created": 1492384244.0, "created_utc": 1492355444.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]