[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel be littled as usual, underestimated under valued for my worth even after i&amp;#39;ve shown you so much. I am hurt but it&amp;#39;s time to move on. I forgive you for everything that you have done, I thank you for trying. I understand you are here just like me struggling to get your ends meet with the current life. Both our perspectives are limited which causes the push for needs and conflicts. I always saw my self as more accurate and righteous as i have a natural highly critical analytical way of viewing life. I could easily pin point blind spots in yourself and me. Although i wasn&amp;#39;t perfect as utilizing my abilities just like you. I always wished you&amp;#39;d follow me as your leader, I always wished you&amp;#39;d put more confidence in me. But perhaps i always showed you i was weak from time to time which made you dislike the idea of following it or rather you don&amp;#39;t really like listening to others especially me as i constantly threaten your self image to the better, People don&amp;#39;t like to listen to advice especially when it&amp;#39;s mostly needed this applies to both of us. We&amp;#39;re too egocentric without realizing our blindspots. Now i really wonder why i&amp;#39;ve lost you in a pathetic way yet it doesn&amp;#39;t seem that pathetic because it happened. An emotional whore to your emotions and fake needs just like me. Lost you over a desire of lust and deprivation of contact due to dogma allowed you to access someone i thought that could help you overseas when he was local. Pretty ironic it seems like almost a love story in a movie. Especially the part of the affirmations of dirty play over a call asking you to imagine a different race doing you since your into their accents and what a suprise you mistake that to him as me as we talked. Your memory had a place of confusing as i predicted of switching what&amp;#39;s being met and who is who. I&amp;#39;ve even predicted you&amp;#39;d suck his dick isn&amp;#39;t that odd how i can see such algorithms with you as you reject them it&amp;#39;s quite scary yet i feel like all these affirmations are from me in the first place even as you assured me no such thing would happen. Am i being egocentric again point it all out? Am i here to forgive or mention i am a victim? Perhaps both. But mostly because isn&amp;#39;t forgiveness about expressing emotion and thought at a vent? You bonded behind my back over months, emotionally connected talking behind my back venting things without my consent speaking behind me behind the curtains not mentioning where you were gone for hours, avoiding me quite often, Not even feeling guilty about it and then finally ending it with no closure, I felt like an even lower man as i was sick with my mental issues due to my physiological needs not being met which caused me even more confusion comprehending what is, you left me because i was no longer stimulating your emotional whore ego needs. How can this be love i wonder, Why isn&amp;#39;t unconditional, why am i demanding it like i&amp;#39;m supposed to even have it? I don&amp;#39;t own you, you are you a terrible program that can&amp;#39;t see well and is probably not equipped to ever finding your true self alone. Just like me, we need the universe to guide us to it. I feel like i could serve as a guide as i&amp;#39;ve been blessed with more foresight but yet i am bad at utilizing myself. As for dogma. I pray the best for you whether it&amp;#39;s sticking to your conditions or not. Although ultimate freedom is really not to be the ego that you currently are. And that applies to me. It&amp;#39;s much deeper. This judgement is confusing how am i supposed to judge life without using the very tools that keep me alive? This paradox confuses me. I just want you to know that i am sorry and i forgive you and you could probably take care of yourself and examine your actions deeper as that is part of the key but not all of it. Contemplate seriously. If you need a helping hand i will always be here as you were a big hand of help for us both. Thank you for everything you were lovely to me. I still love you deeply. I am sorry it had to turn out the way it did but it&amp;#39;ll always be blissful in the end. As much as my ego feels like it deserves more of us together longing each other, as i&amp;#39;ve tried so hard for us over the years leaning on right pushing us towards the better, and so have you probably but it&amp;#39;s just a different perspective of seeing things of what matters from either actualizing eating healthy, exercising increasing intellect, knowledge, shedding limited beliefs by threatening them as i ask you to be aware of sensations that arise (you were really bad at noticing yourself you only turned it into hostile hate towards me i noticed, perhaps not the best approach for you but it may be a stepping stone from the universe who knows), reading, linking, meditating, self enquire, ,contemplating, enlightenment pointer of gold, it&amp;#39;s still quite selfish and sad. I&amp;#39;m not censoring anything as i feel like this is what should be of the thought of the moment. I hope you kept your word for yourself atleast. Stay clean stay pure my innocent angel. As much as you said you&amp;#39;d never do anything to break/hurt us. I trust you and i believe you. Because your true self would never. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I have some resentment on myself oddly, I really wanted to be with you and only you and i was never tempted by anyone or anything that came along. I knew what i wanted, knew what i had, valued it, and did anything in my power to never let it slip away. Yet ironically it wasn&amp;#39;t enough as ego can&amp;#39;t be contained or content with force. Perhaps everything would&amp;#39;ve worked out if not for power abuse and just sheer love. I wondered. Or would some true colors come out over the years making it fall apart? I thought we cared for each other just as much as true soul mate love, we did show it didn&amp;#39;t we or am i deluded? It does feel like it&amp;#39;s been manipulated away as you swift by just like clouds not being still where you are on your destination is that a good thing or a bad thing is beyond me. It feels like unauthentic wrong desires and wrong directions from my previous perceptive but perhaps it may be for the better to find true self. I&amp;#39;m not afraid to express my raw emotions and fight for my lady, I have my integrity and honor as i can&amp;#39;t really forget or let go like it has no value as my core value is heavy. Far from the kid you perceive. It takes more guts to know and be vulnerable over playing it without being vulnerable and safe with lies to cover weak spots. I&amp;#39;m sorry you could not see my touch of making you wanted and loved. I&amp;#39;m sorry my sincerity,honesty,warmth,loyalty and commitment wasn&amp;#39;t enough for you. I&amp;#39;m sorry trying to grow us for the better left a bad taste in your mouth. After all i am not perfect just like you. I&amp;#39;m just trying to make ends meet. I am not afraid to show you I care, I am not afraid of telling you when I&amp;#39;m a weak. I am not even afraid of you turning abusive or cold towards me. Sure it hurts but i always have faith in you. I&amp;#39;m still a man worth more than what you see. Do i not deserve to be loved? Perhaps why not? After all the universe has a different way of showing us things and perhaps being unfair is a good answer to experience life. Or maybe i have bliss left upon me or maybe vice versa with you. Who knows? All will be clear in the end or it may not be.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s time to let go and forgive. Thank you once again.. Yet thoughts cloud me and swift me away.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve read an offmychest post at &lt;a href=\"https://www.reddit.com/r/offmychest/comments/65qtrq/yesterday_i_was_planning_on_killing_myself/?utm_content=title&amp;amp;utm_medium=user&amp;amp;utm_source=reddit\"&gt;https://www.reddit.com/r/offmychest/comments/65qtrq/yesterday_i_was_planning_on_killing_myself/?utm_content=title&amp;amp;utm_medium=user&amp;amp;utm_source=reddit&lt;/a&gt; It hurts my heart. I want to lose my virginity and long for such an experience with you, I feel a connection that i only really want to share with you, But it&amp;#39;s just as forbidden and you&amp;#39;ve probably already gave it away. It&amp;#39;s something that we can never have now. I really wished for it. I find it unfair that these 3 years went for nothing and we couldn&amp;#39;t even have any good intercourse times. I&amp;#39;m not blaming you and neither me. Perhaps your happy about it. Maybe i should be too, Or maybe if we did do it things would&amp;#39;ve changed. So many if statements.. If he wasn&amp;#39;t there. If i didn&amp;#39;t say egoic actulizing things, If i didn&amp;#39;t try to change you to actualize. This isn&amp;#39;t letting go. I&amp;#39;m sorry. But the wonder clouds passed by and i starting playing with them they are sweet like childish. You do know how ridiculous my drive is? You&amp;#39;ve seen my blood test testosterone beyond the average. I could ejaculate up to 4~8 times daily. Imagine my suffering.. Yet you laugh at me for it without realizing what it&amp;#39;s like to be in my shoes. Well i don&amp;#39;t blame you for laughing or not, I pretty much laugh at how ridiculous it is sometimes when i give you signs i&amp;#39;m in pain with humor. Remember &amp;#39;suck my dick... please.... pleeeeeeeeeaaaassseeeeee... Remember the desperation innocence of a sleep deprived voice. It is quite funny yet deeply sad.  Just as any ego would. I wish you could know the pain of how much i suppress it and yet i get is all but teases and never the real thing. You do know i&amp;#39;ve always fantasized over you for years? I&amp;#39;ve always preferred white women over ebony&amp;#39;s but i&amp;#39;ve managed to project brainwash myself that i was cumming to you for years now. I wonder if you can imagine how mentally inducing painful the scar is and I always fear&amp;#39;d to hurt you out of love. I just really find it unfair at this point that someone can take it away that easily as your offering lust that i partook and created. The lust that i was creating wasn&amp;#39;t for that reason but more of a reason of why you couldn&amp;#39;t get turned on by me in bed yet i didn&amp;#39;t want to take it away from you, He&amp;#39;s already has his lust more than once while i&amp;#39;m facing difficulties that seem much higher on suppressing such libido levels of years. Aren&amp;#39;t i stupid? For not reaping what i sow&amp;#39;d and letting others take it away from me?  It&amp;#39;s already porn learnt and probably isn&amp;#39;t ideal but who am i to say. As leo said porn is ok so i was like why not? I kept continuing on it even though i suppressed the idea forgot to mention that phase or perhaps you never listened to what i had to say. Remember the moment where i told you i&amp;#39;m sorry for the porno act i learnt it off porn and i&amp;#39;m sick for licking and sucking on your nip? Kind of pathetic. But yet quite innocent i feel sorry for me truly an innocent pure heart trying to make it at life just like the rest of the world. There are no demons if you realize it. As demons just see the world differently. Even when they justify what&amp;#39;s ok or not. I can do whatever i want now and say sorry later. I hated that perspective i always wanted to be righteous but it was just as egoic. &lt;/p&gt;\n\n&lt;p&gt;You feel like you&amp;#39;ve improved in life but the problem it is just an ego that thinks it knows it all better, An ego that is like an employee that was once nice to everyone as it was in it&amp;#39;s place of being bullied by higher powers finally got promoted to a manager and now is now more abusive instead of being kind to everyone. The underdog used to be nice and kind towards itself and others but now it has turned to a salve of power and even more egoic desires. It&amp;#39;s sad that it doesn&amp;#39;t realize it&amp;#39;s self sabotaging self and hate even when it names it for the good for itself of selfishness. The hunger the greed and abuse of power that corrupts one is dangerous. I hope we overcome this stage. Realizing this is problem is half of it&amp;#39;s cure and a start of the journey to accept the cleanse of it. You aren&amp;#39;t happy. You might have developed new artificial skills,habits,thoughts,lies and self deceptions but it isn&amp;#39;t the answer to our life. I do sense some backslide but it is all part of growth. Yet do not misunderstand this growth to be your downfall as it is a phase of realizing there is something higher than what seems to be deceiving you through the phases of life.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s funny how we say trust yourself the current ego&amp;#39;s monkey mind that isn&amp;#39;t you that is pushing you away from your happiness for petty actions, a fake subconscious mind that controls us like puppets. I just wish you were free from it i tried telling you that. But you kept growing it by affirming yourself with ironic acceptance without realizing how much you needed skepticism to grow first before acceptance. One needs to question themselves constantly wondering what path to pick until a day reaches of uncertainty where they become better at seeing patterns where they can finally trust themselves to pick a pattern that isn&amp;#39;t pure lies of emotions but rather a mixture of logic and emotion. That is true intuition an intuition that comes from the very spiritual soul the true awareness awakening. This isn&amp;#39;t easy to even achieve it may sound simple but it&amp;#39;s far from that. Allowing manipulations by others who aren&amp;#39;t masters of even controlling themselves is dangerous as it steers it away way worse. In this case you allow yourself to be steer&amp;#39;d by your culture and even someone that you said you&amp;#39;d cut contact with on January. yet you didn&amp;#39;t. hopefully he&amp;#39;s on his path to awakening so he could hopefully guide you towards it unless if he plans to let you sleep without reaching his full awakening and ego desires of letting be for deepening oneself in the illusion as there are certain pitfalls on awakening paths from the self.&lt;/p&gt;\n\n&lt;p&gt;Dear universe please allow her to follow The Highest Hero&amp;#39;s Journey - What It Means To Be Real Hero, She deserves her inner peace she deserves her true self. That&amp;#39;s a wish i wish upon a wishing star if i had one, As that is what i was trying to point out with all silly anger of being petty while i lost my mental health state. This is the greatest gift one can ever taste in life and that is only the absolute truth. &lt;/p&gt;\n\n&lt;p&gt;It may be now or soon or years from now for the realization to hit various people but the universes has it&amp;#39;s ways. All i can say to the universe is just do your magic as that is what we are pure magical existence :)&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I thank us both for being good stepping stones for each other, I thank us both for the sacrifices we made, We both did good. Neither is to blame neither is perfect. We are both striving at life while being blind to the pointers the universe gives/shows us. Once you find your true self you will be truly content with everything as nothing can satisfy the fake ego&amp;#39;s thirst. &lt;/p&gt;\n\n&lt;p&gt;I forgive myself for my actions.\nI forgive you for your actions.\nBe at peace.\nAs there can never be a wrong movement when we never had enough data of what happens next we try and predict but our calculations aren&amp;#39;t accurate. So there is no wrong moves in life but only what it is at that moment of the absolute the universe doesn&amp;#39;t care to listen to our opinion&amp;#39;s it only shows us what is there after actions from story thoughts we tell ourselves.  &lt;/p&gt;\n\n&lt;p&gt;All this will be past all this will be laughable it already is quite laughable at ridiculous from how we think it&amp;#39;s all real when it&amp;#39;s not. Not even significant yet the emotions drive us to think it&amp;#39;s so real when it isn&amp;#39;t. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Old vent #2 Copy paste from a pm :&lt;/p&gt;\n\n&lt;p&gt;I think technically what pain i&amp;#39;m going through is pretty typical it&amp;#39;s just i&amp;#39;ve been try harding for this girl and she dumped for another guy just because i didn&amp;#39;t give her sex and i&amp;#39;m still a virgin about it even after 3 years. It&amp;#39;s just she&amp;#39;s from saudi arabia so it&amp;#39;s a big taboo to her and her family. I thought i was protecting her but ever since i&amp;#39;ve introduced her to self actualizing her ego got thicker and she&amp;#39;s still a muslim ironically. and she justisfied by leaving me over religion but i saw her posts and she&amp;#39;s actually fucking a british guy whenever she travels abroad to my country (bahrain). Behind her parents backs in a hotel. I&amp;#39;m confused by all this. She says it&amp;#39;s alright to do so since he&amp;#39;s muslim. Plus she&amp;#39;s been doing this language of desire (which is what self help on this forum shared for better sex) and is convinced that she shouldn&amp;#39;t be suppressed sexually (which i agree with but still.. something tells me it feels off maybe it&amp;#39;s because of dogma in me or my care for her as a sister with respect?) I don&amp;#39;t know how accurate marslow&amp;#39;s hiearchy is for self actualizing but she kept justifying that intimacy is a need and sex is a need for bettering herself. I&amp;#39;m not sure about that as it&amp;#39;s theory i&amp;#39;ve seen lots of virgins doing just fine. And i for one have ridiculous 1200~1600 testosterone (hormones do control what you do, i thought it wasn&amp;#39;t all will) in blood tests yet I&amp;#39;ve been suppressing myself deeply for her when we meet. So she&amp;#39;s cheated and dumped me. Doesn&amp;#39;t care about enlightenment because she says islam is the only truth due to her dogma yet she self actualizing which is confusing. She&amp;#39;s turn into a feminist too but i don&amp;#39;t understand her crave and lust to desire cock after going through that language of desire program. It feels like she&amp;#39;s turned into a whore that wants dick. Leo had a video where he said we should trust ourselves and intuition but as i look at her i judge and say that doesn&amp;#39;t look like intuition but rather seems like an emotional whore that follows monkey mind easily even while she meditates.. She&amp;#39;s emotionally bonded with that British guy while self actualizing discussing topics with him since he was a muslim too, she&amp;#39;s met him on an app last year with whoishere locals said she wants to discuss actualizing with muslim views instead of my ignostic like views. Which i let slide.. she got comfortable with him introduced him to self help content from leo and kept discussing stuff behind my back without letting me know. overtime she was detached with me slowly. made less time with me and then just ghosted it out without any closure.&lt;/p&gt;\n\n&lt;p&gt;The problem is she thinks everything she thinks is highly conscious and her higher self since she leo mentioned in an episode where we are supposed to trust yourself because we want the better for ourselves. Which is very misunderstood by her ironically.. She keeps thinking being an emotional whore is the key to her life. She believes in her thoughts over being skeptical about them. especially her dogma conditioning.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t entertain her as i used to due to my health issues (tinnitus and internal bleeding mostly, not meeting my physiological needs of rest and clarity) so it&amp;#39;s natural she got bored of me and went for a new toy to play with. She thinks she doesn&amp;#39;t need me anymore. She used to be so innocent it&amp;#39;s quite confusing.&lt;/p&gt;\n\n&lt;p&gt;Then again all this is an illusion i shouldn&amp;#39;t be bothered because i didn&amp;#39;t reap what i sow for 3 years. Plus i tried to change someone against their will to be better over the years, a thick ego would&amp;#39;ve let them rot over energy waste. a paradox here is acceptance without change though. I&amp;#39;ve never really used her for myself i was just genuinely present why do i care justifying myself so much? The presence of ego is very mad at what is and it&amp;#39;s against it&amp;#39;s rules of intellect and fairness i observe. Little does it know that what is will always be present to a cause or effect and not the happy dreams an ego thinks. Well maybe it depends on certain calculated luck. Yet again what ego thinks is meaningless. Hence go beyond ego matters more&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I feel be littled as usual, underestimated under valued for my worth even after i've shown you so much. I am hurt but it's time to move on. I forgive you for everything that you have done, I thank you for trying. I understand you are here just like me struggling to get your ends meet with the current life. Both our perspectives are limited which causes the push for needs and conflicts. I always saw my self as more accurate and righteous as i have a natural highly critical analytical way of viewing life. I could easily pin point blind spots in yourself and me. Although i wasn't perfect as utilizing my abilities just like you. I always wished you'd follow me as your leader, I always wished you'd put more confidence in me. But perhaps i always showed you i was weak from time to time which made you dislike the idea of following it or rather you don't really like listening to others especially me as i constantly threaten your self image to the better, People don't like to listen to advice especially when it's mostly needed this applies to both of us. We're too egocentric without realizing our blindspots. Now i really wonder why i've lost you in a pathetic way yet it doesn't seem that pathetic because it happened. An emotional whore to your emotions and fake needs just like me. Lost you over a desire of lust and deprivation of contact due to dogma allowed you to access someone i thought that could help you overseas when he was local. Pretty ironic it seems like almost a love story in a movie. Especially the part of the affirmations of dirty play over a call asking you to imagine a different race doing you since your into their accents and what a suprise you mistake that to him as me as we talked. Your memory had a place of confusing as i predicted of switching what's being met and who is who. I've even predicted you'd suck his dick isn't that odd how i can see such algorithms with you as you reject them it's quite scary yet i feel like all these affirmations are from me in the first place even as you assured me no such thing would happen. Am i being egocentric again point it all out? Am i here to forgive or mention i am a victim? Perhaps both. But mostly because isn't forgiveness about expressing emotion and thought at a vent? You bonded behind my back over months, emotionally connected talking behind my back venting things without my consent speaking behind me behind the curtains not mentioning where you were gone for hours, avoiding me quite often, Not even feeling guilty about it and then finally ending it with no closure, I felt like an even lower man as i was sick with my mental issues due to my physiological needs not being met which caused me even more confusion comprehending what is, you left me because i was no longer stimulating your emotional whore ego needs. How can this be love i wonder, Why isn't unconditional, why am i demanding it like i'm supposed to even have it? I don't own you, you are you a terrible program that can't see well and is probably not equipped to ever finding your true self alone. Just like me, we need the universe to guide us to it. I feel like i could serve as a guide as i've been blessed with more foresight but yet i am bad at utilizing myself. As for dogma. I pray the best for you whether it's sticking to your conditions or not. Although ultimate freedom is really not to be the ego that you currently are. And that applies to me. It's much deeper. This judgement is confusing how am i supposed to judge life without using the very tools that keep me alive? This paradox confuses me. I just want you to know that i am sorry and i forgive you and you could probably take care of yourself and examine your actions deeper as that is part of the key but not all of it. Contemplate seriously. If you need a helping hand i will always be here as you were a big hand of help for us both. Thank you for everything you were lovely to me. I still love you deeply. I am sorry it had to turn out the way it did but it'll always be blissful in the end. As much as my ego feels like it deserves more of us together longing each other, as i've tried so hard for us over the years leaning on right pushing us towards the better, and so have you probably but it's just a different perspective of seeing things of what matters from either actualizing eating healthy, exercising increasing intellect, knowledge, shedding limited beliefs by threatening them as i ask you to be aware of sensations that arise (you were really bad at noticing yourself you only turned it into hostile hate towards me i noticed, perhaps not the best approach for you but it may be a stepping stone from the universe who knows), reading, linking, meditating, self enquire, ,contemplating, enlightenment pointer of gold, it's still quite selfish and sad. I'm not censoring anything as i feel like this is what should be of the thought of the moment. I hope you kept your word for yourself atleast. Stay clean stay pure my innocent angel. As much as you said you'd never do anything to break/hurt us. I trust you and i believe you. Because your true self would never. \n\n----\n\nI have some resentment on myself oddly, I really wanted to be with you and only you and i was never tempted by anyone or anything that came along. I knew what i wanted, knew what i had, valued it, and did anything in my power to never let it slip away. Yet ironically it wasn't enough as ego can't be contained or content with force. Perhaps everything would've worked out if not for power abuse and just sheer love. I wondered. Or would some true colors come out over the years making it fall apart? I thought we cared for each other just as much as true soul mate love, we did show it didn't we or am i deluded? It does feel like it's been manipulated away as you swift by just like clouds not being still where you are on your destination is that a good thing or a bad thing is beyond me. It feels like unauthentic wrong desires and wrong directions from my previous perceptive but perhaps it may be for the better to find true self. I'm not afraid to express my raw emotions and fight for my lady, I have my integrity and honor as i can't really forget or let go like it has no value as my core value is heavy. Far from the kid you perceive. It takes more guts to know and be vulnerable over playing it without being vulnerable and safe with lies to cover weak spots. I'm sorry you could not see my touch of making you wanted and loved. I'm sorry my sincerity,honesty,warmth,loyalty and commitment wasn't enough for you. I'm sorry trying to grow us for the better left a bad taste in your mouth. After all i am not perfect just like you. I'm just trying to make ends meet. I am not afraid to show you I care, I am not afraid of telling you when I'm a weak. I am not even afraid of you turning abusive or cold towards me. Sure it hurts but i always have faith in you. I'm still a man worth more than what you see. Do i not deserve to be loved? Perhaps why not? After all the universe has a different way of showing us things and perhaps being unfair is a good answer to experience life. Or maybe i have bliss left upon me or maybe vice versa with you. Who knows? All will be clear in the end or it may not be.\n\nIt's time to let go and forgive. Thank you once again.. Yet thoughts cloud me and swift me away.\n\nI've read an offmychest post at https://www.reddit.com/r/offmychest/comments/65qtrq/yesterday_i_was_planning_on_killing_myself/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit It hurts my heart. I want to lose my virginity and long for such an experience with you, I feel a connection that i only really want to share with you, But it's just as forbidden and you've probably already gave it away. It's something that we can never have now. I really wished for it. I find it unfair that these 3 years went for nothing and we couldn't even have any good intercourse times. I'm not blaming you and neither me. Perhaps your happy about it. Maybe i should be too, Or maybe if we did do it things would've changed. So many if statements.. If he wasn't there. If i didn't say egoic actulizing things, If i didn't try to change you to actualize. This isn't letting go. I'm sorry. But the wonder clouds passed by and i starting playing with them they are sweet like childish. You do know how ridiculous my drive is? You've seen my blood test testosterone beyond the average. I could ejaculate up to 4~8 times daily. Imagine my suffering.. Yet you laugh at me for it without realizing what it's like to be in my shoes. Well i don't blame you for laughing or not, I pretty much laugh at how ridiculous it is sometimes when i give you signs i'm in pain with humor. Remember 'suck my dick... please.... pleeeeeeeeeaaaassseeeeee... Remember the desperation innocence of a sleep deprived voice. It is quite funny yet deeply sad.  Just as any ego would. I wish you could know the pain of how much i suppress it and yet i get is all but teases and never the real thing. You do know i've always fantasized over you for years? I've always preferred white women over ebony's but i've managed to project brainwash myself that i was cumming to you for years now. I wonder if you can imagine how mentally inducing painful the scar is and I always fear'd to hurt you out of love. I just really find it unfair at this point that someone can take it away that easily as your offering lust that i partook and created. The lust that i was creating wasn't for that reason but more of a reason of why you couldn't get turned on by me in bed yet i didn't want to take it away from you, He's already has his lust more than once while i'm facing difficulties that seem much higher on suppressing such libido levels of years. Aren't i stupid? For not reaping what i sow'd and letting others take it away from me?  It's already porn learnt and probably isn't ideal but who am i to say. As leo said porn is ok so i was like why not? I kept continuing on it even though i suppressed the idea forgot to mention that phase or perhaps you never listened to what i had to say. Remember the moment where i told you i'm sorry for the porno act i learnt it off porn and i'm sick for licking and sucking on your nip? Kind of pathetic. But yet quite innocent i feel sorry for me truly an innocent pure heart trying to make it at life just like the rest of the world. There are no demons if you realize it. As demons just see the world differently. Even when they justify what's ok or not. I can do whatever i want now and say sorry later. I hated that perspective i always wanted to be righteous but it was just as egoic. \n\nYou feel like you've improved in life but the problem it is just an ego that thinks it knows it all better, An ego that is like an employee that was once nice to everyone as it was in it's place of being bullied by higher powers finally got promoted to a manager and now is now more abusive instead of being kind to everyone. The underdog used to be nice and kind towards itself and others but now it has turned to a salve of power and even more egoic desires. It's sad that it doesn't realize it's self sabotaging self and hate even when it names it for the good for itself of selfishness. The hunger the greed and abuse of power that corrupts one is dangerous. I hope we overcome this stage. Realizing this is problem is half of it's cure and a start of the journey to accept the cleanse of it. You aren't happy. You might have developed new artificial skills,habits,thoughts,lies and self deceptions but it isn't the answer to our life. I do sense some backslide but it is all part of growth. Yet do not misunderstand this growth to be your downfall as it is a phase of realizing there is something higher than what seems to be deceiving you through the phases of life.\n\nIt's funny how we say trust yourself the current ego's monkey mind that isn't you that is pushing you away from your happiness for petty actions, a fake subconscious mind that controls us like puppets. I just wish you were free from it i tried telling you that. But you kept growing it by affirming yourself with ironic acceptance without realizing how much you needed skepticism to grow first before acceptance. One needs to question themselves constantly wondering what path to pick until a day reaches of uncertainty where they become better at seeing patterns where they can finally trust themselves to pick a pattern that isn't pure lies of emotions but rather a mixture of logic and emotion. That is true intuition an intuition that comes from the very spiritual soul the true awareness awakening. This isn't easy to even achieve it may sound simple but it's far from that. Allowing manipulations by others who aren't masters of even controlling themselves is dangerous as it steers it away way worse. In this case you allow yourself to be steer'd by your culture and even someone that you said you'd cut contact with on January. yet you didn't. hopefully he's on his path to awakening so he could hopefully guide you towards it unless if he plans to let you sleep without reaching his full awakening and ego desires of letting be for deepening oneself in the illusion as there are certain pitfalls on awakening paths from the self.\n\nDear universe please allow her to follow The Highest Hero's Journey - What It Means To Be Real Hero, She deserves her inner peace she deserves her true self. That's a wish i wish upon a wishing star if i had one, As that is what i was trying to point out with all silly anger of being petty while i lost my mental health state. This is the greatest gift one can ever taste in life and that is only the absolute truth. \n\nIt may be now or soon or years from now for the realization to hit various people but the universes has it's ways. All i can say to the universe is just do your magic as that is what we are pure magical existence :)\n\n----\n\nI thank us both for being good stepping stones for each other, I thank us both for the sacrifices we made, We both did good. Neither is to blame neither is perfect. We are both striving at life while being blind to the pointers the universe gives/shows us. Once you find your true self you will be truly content with everything as nothing can satisfy the fake ego's thirst. \n\nI forgive myself for my actions.\nI forgive you for your actions.\nBe at peace.\nAs there can never be a wrong movement when we never had enough data of what happens next we try and predict but our calculations aren't accurate. So there is no wrong moves in life but only what it is at that moment of the absolute the universe doesn't care to listen to our opinion's it only shows us what is there after actions from story thoughts we tell ourselves.  \n\nAll this will be past all this will be laughable it already is quite laughable at ridiculous from how we think it's all real when it's not. Not even significant yet the emotions drive us to think it's so real when it isn't. \n\n\n----\n\nOld vent #2 Copy paste from a pm :\n\n\n I think technically what pain i'm going through is pretty typical it's just i've been try harding for this girl and she dumped for another guy just because i didn't give her sex and i'm still a virgin about it even after 3 years. It's just she's from saudi arabia so it's a big taboo to her and her family. I thought i was protecting her but ever since i've introduced her to self actualizing her ego got thicker and she's still a muslim ironically. and she justisfied by leaving me over religion but i saw her posts and she's actually fucking a british guy whenever she travels abroad to my country (bahrain). Behind her parents backs in a hotel. I'm confused by all this. She says it's alright to do so since he's muslim. Plus she's been doing this language of desire (which is what self help on this forum shared for better sex) and is convinced that she shouldn't be suppressed sexually (which i agree with but still.. something tells me it feels off maybe it's because of dogma in me or my care for her as a sister with respect?) I don't know how accurate marslow's hiearchy is for self actualizing but she kept justifying that intimacy is a need and sex is a need for bettering herself. I'm not sure about that as it's theory i've seen lots of virgins doing just fine. And i for one have ridiculous 1200~1600 testosterone (hormones do control what you do, i thought it wasn't all will) in blood tests yet I've been suppressing myself deeply for her when we meet. So she's cheated and dumped me. Doesn't care about enlightenment because she says islam is the only truth due to her dogma yet she self actualizing which is confusing. She's turn into a feminist too but i don't understand her crave and lust to desire cock after going through that language of desire program. It feels like she's turned into a whore that wants dick. Leo had a video where he said we should trust ourselves and intuition but as i look at her i judge and say that doesn't look like intuition but rather seems like an emotional whore that follows monkey mind easily even while she meditates.. She's emotionally bonded with that British guy while self actualizing discussing topics with him since he was a muslim too, she's met him on an app last year with whoishere locals said she wants to discuss actualizing with muslim views instead of my ignostic like views. Which i let slide.. she got comfortable with him introduced him to self help content from leo and kept discussing stuff behind my back without letting me know. overtime she was detached with me slowly. made less time with me and then just ghosted it out without any closure.\n\n \n\nThe problem is she thinks everything she thinks is highly conscious and her higher self since she leo mentioned in an episode where we are supposed to trust yourself because we want the better for ourselves. Which is very misunderstood by her ironically.. She keeps thinking being an emotional whore is the key to her life. She believes in her thoughts over being skeptical about them. especially her dogma conditioning.\n\n \n\nI didn't entertain her as i used to due to my health issues (tinnitus and internal bleeding mostly, not meeting my physiological needs of rest and clarity) so it's natural she got bored of me and went for a new toy to play with. She thinks she doesn't need me anymore. She used to be so innocent it's quite confusing.\n\nThen again all this is an illusion i shouldn't be bothered because i didn't reap what i sow for 3 years. Plus i tried to change someone against their will to be better over the years, a thick ego would've let them rot over energy waste. a paradox here is acceptance without change though. I've never really used her for myself i was just genuinely present why do i care justifying myself so much? The presence of ego is very mad at what is and it's against it's rules of intellect and fairness i observe. Little does it know that what is will always be present to a cause or effect and not the happy dreams an ego thinks. Well maybe it depends on certain calculated luck. Yet again what ego thinks is meaningless. Hence go beyond ego matters more", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65qcgx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "therewasguy", "saved": false, "mod_reports": [], "name": "t3_65qcgx", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": 1492430217.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/65qcgx/im_sorry_for_us_thank_you_for_everything/", "num_reports": null, "locked": false, "stickied": false, "created": 1492393453.0, "url": "https://www.reddit.com/r/self/comments/65qcgx/im_sorry_for_us_thank_you_for_everything/", "author_flair_text": null, "quarantine": false, "title": "I'm sorry for us, Thank you for everything", "created_utc": 1492364653.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]