[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Been eating a lot of it lately and now I just feel nauseous when I think about it but at the same time I still kind of want some. Decided to quit it for good, wouldn&amp;#39;t feel real unless I told someone so here we are lol. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Been eating a lot of it lately and now I just feel nauseous when I think about it but at the same time I still kind of want some. Decided to quit it for good, wouldn't feel real unless I told someone so here we are lol. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65xaxb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "KevinMFJones", "saved": false, "mod_reports": [], "name": "t3_65xaxb", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/65xaxb/quitting_fast_food/", "num_reports": null, "locked": false, "stickied": false, "created": 1492481889.0, "url": "https://www.reddit.com/r/self/comments/65xaxb/quitting_fast_food/", "author_flair_text": null, "quarantine": false, "title": "Quitting fast food", "created_utc": 1492453089.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65xaxb", "likes": null, "replies": "", "user_reports": [], "id": "dgdz0ym", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "zeropointsforeffort", "parent_id": "t3_65xaxb", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Congratulations on making that hard decision!\n\nI cut most fast food because I stopped eating meat. While I will still patron Subway for veggie sandwiches or a Chinese place for steamed rice, I really don't eat out that much anymore.\n\nEven before I went full on vegan, I started to get tummy aches from eating tacos and burgers because I had started eating more fruits and vegetables in lieu of fast food. Your system tends to adapt to what you eat most, after all. So my body was always like \"nooooo\" whenever I decided to break routine and I paid for it afterwards. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congratulations on making that hard decision!&lt;/p&gt;\n\n&lt;p&gt;I cut most fast food because I stopped eating meat. While I will still patron Subway for veggie sandwiches or a Chinese place for steamed rice, I really don&amp;#39;t eat out that much anymore.&lt;/p&gt;\n\n&lt;p&gt;Even before I went full on vegan, I started to get tummy aches from eating tacos and burgers because I had started eating more fruits and vegetables in lieu of fast food. Your system tends to adapt to what you eat most, after all. So my body was always like &amp;quot;nooooo&amp;quot; whenever I decided to break routine and I paid for it afterwards. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgdz0ym", "score_hidden": false, "stickied": false, "created": 1492485883.0, "created_utc": 1492457083.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65xaxb", "likes": null, "replies": "", "user_reports": [], "id": "dgeb5f6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PrecisionGuesswork", "parent_id": "t3_65xaxb", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "Good decision! \n\nI'm in the same boat, quit that shit almost 2 weeks ago. I don't feel bloated and gross like I used to after a meal which is great. Meals are less expensive to cook at home. Hopefully with careful management of my diet I can even lose a few inches off my waist. This is actually my main goal. I used to be a 34 waist and lately I'm up to a 40. I can't wear a lot of shirts and pants I used to and I feel ashamed of myself for letting my weight go like that. \n\nOther goals I have are getting fit enough to do lots of backpacking and cycling this summer. Last summer I busted my ankle and spent 6 weeks on my ass which is when I started to get fat. \n\nI'd love to cut down on the amount of meat I eat as well. If I could cut down to eating meat only 1 or 2 days a week I'd be happy. \n\nThe struggle I have is sometimes I get strong cravings for fast food or sweets. I have to break down those thoughts that try to convince me that just once won't hurt and that it's totally worth cheating for how great that food will taste. I keep reminding myself of the reality that it's a waste of nutrition to eat like that and I will feel guilty and that's not worth it for me. I never though food would be such a battle but it is. Bad habits are hard to break. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good decision! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in the same boat, quit that shit almost 2 weeks ago. I don&amp;#39;t feel bloated and gross like I used to after a meal which is great. Meals are less expensive to cook at home. Hopefully with careful management of my diet I can even lose a few inches off my waist. This is actually my main goal. I used to be a 34 waist and lately I&amp;#39;m up to a 40. I can&amp;#39;t wear a lot of shirts and pants I used to and I feel ashamed of myself for letting my weight go like that. &lt;/p&gt;\n\n&lt;p&gt;Other goals I have are getting fit enough to do lots of backpacking and cycling this summer. Last summer I busted my ankle and spent 6 weeks on my ass which is when I started to get fat. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d love to cut down on the amount of meat I eat as well. If I could cut down to eating meat only 1 or 2 days a week I&amp;#39;d be happy. &lt;/p&gt;\n\n&lt;p&gt;The struggle I have is sometimes I get strong cravings for fast food or sweets. I have to break down those thoughts that try to convince me that just once won&amp;#39;t hurt and that it&amp;#39;s totally worth cheating for how great that food will taste. I keep reminding myself of the reality that it&amp;#39;s a waste of nutrition to eat like that and I will feel guilty and that&amp;#39;s not worth it for me. I never though food would be such a battle but it is. Bad habits are hard to break. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgeb5f6", "score_hidden": false, "stickied": false, "created": 1492500464.0, "created_utc": 1492471664.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]