[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "self", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have what most people consider a &amp;quot;good job.&amp;quot; For my level of education, I am paid well, I have great family insurance, and the retirement package is phenomenal. &lt;/p&gt;\n\n&lt;p&gt;But here&amp;#39;s what I&amp;#39;ve gone through:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Constant harassment from management.&lt;/strong&gt; Actually doing my job slows down production. Following their rules slows down production. The give and take has too much take. Manager&amp;#39;s performance evaluation includes write-ups. So, if a manager is doing well in pretty much every area, but does not write up an agreement employee, he puts his livelihood in danger. So, he will write up agreement employee on the things he let slide before. I have been followed across the train yard and through a bathroom break just to be written up.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;A forced relocation.&lt;/strong&gt; Our department is currently under a hiring freeze, and has been for over two years now. Apparently, middle management&amp;#39;s bonuses are tied to their budget. We have lost many men to retirement, injury, and/or outright quitting. We are so low on man power, that they cut the two junior employees (myself and another), and told us either we take the job at the outlying point, or we have no job. This outlying point is over an hour from the home point, and two and a half hours from my house. There was absolutely no assistance offered in this move. I was also forced out three quarters of the way into my daughter&amp;#39;s school year. No sense moving her this late in the game. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Sexism&lt;/strong&gt; The creepy old guy at work continues to creep. I have laid clear boundaries. I have publicly called him out. Everyone just looks the other way. Calling the EEO hotline would probably impact my career, since I am the only woman in my department in the whole service unit. Pretty easy to guess who turned him in. And speaking of impacting my career...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Being instructed to ignore federal guidelines&lt;/strong&gt; This comes back to the give and take. A lot of the times, if it is something relatively minor, we will let it roll.  The big things I cannot ignore. After so many shops, my general Foreman pulled me into his office and instructed me to only shop cars for z, x, and y reasons. This also came from the Director of our service unit. I am to ignore most of the federal regulations.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Abusive and aggressive managers&lt;/strong&gt; This is one manager in particular. He served in the military, and never quite left it mentally. He thinks that because I served too, that I would understand why he is being a shitty human being. No. I watched him berate and belittle a coworker, then physically block him from leaving the room when the employee needed to leave. &lt;/p&gt;\n\n&lt;p&gt;I have also been told that I have &amp;quot;an attitude problem,&amp;quot; when none of my male co workers are called out for their shitty behavior. I have had my bathroom breaks monitored, when no male employee has been called out on his &amp;quot;excessive&amp;quot; bathroom use. &lt;/p&gt;\n\n&lt;p&gt;I am trying so hard to hold out. To wait. I love my job, it&amp;#39;s just my managers are making it a living hell. I can handle a lot, but this is just too much. I am being forced to move to keep a job. I don&amp;#39;t even like the area I&amp;#39;m being forced to. &lt;/p&gt;\n\n&lt;p&gt;One year. In one year my safety violation falls off, and I&amp;#39;m eligible to move as I please. Hopefully the grass is greener on the other side, and not because it&amp;#39;s fertilized with bullshit.&lt;/p&gt;\n\n&lt;p&gt;But honestly, I just want to throw in the towel. Take a pay cut. Move to where I really want to be. Even if it means leaving this hellish industry all together. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have what most people consider a \"good job.\" For my level of education, I am paid well, I have great family insurance, and the retirement package is phenomenal. \n\nBut here's what I've gone through:\n\n**Constant harassment from management.** Actually doing my job slows down production. Following their rules slows down production. The give and take has too much take. Manager's performance evaluation includes write-ups. So, if a manager is doing well in pretty much every area, but does not write up an agreement employee, he puts his livelihood in danger. So, he will write up agreement employee on the things he let slide before. I have been followed across the train yard and through a bathroom break just to be written up.\n\n**A forced relocation.** Our department is currently under a hiring freeze, and has been for over two years now. Apparently, middle management's bonuses are tied to their budget. We have lost many men to retirement, injury, and/or outright quitting. We are so low on man power, that they cut the two junior employees (myself and another), and told us either we take the job at the outlying point, or we have no job. This outlying point is over an hour from the home point, and two and a half hours from my house. There was absolutely no assistance offered in this move. I was also forced out three quarters of the way into my daughter's school year. No sense moving her this late in the game. \n\n**Sexism** The creepy old guy at work continues to creep. I have laid clear boundaries. I have publicly called him out. Everyone just looks the other way. Calling the EEO hotline would probably impact my career, since I am the only woman in my department in the whole service unit. Pretty easy to guess who turned him in. And speaking of impacting my career...\n\n**Being instructed to ignore federal guidelines** This comes back to the give and take. A lot of the times, if it is something relatively minor, we will let it roll.  The big things I cannot ignore. After so many shops, my general Foreman pulled me into his office and instructed me to only shop cars for z, x, and y reasons. This also came from the Director of our service unit. I am to ignore most of the federal regulations.\n\n**Abusive and aggressive managers** This is one manager in particular. He served in the military, and never quite left it mentally. He thinks that because I served too, that I would understand why he is being a shitty human being. No. I watched him berate and belittle a coworker, then physically block him from leaving the room when the employee needed to leave. \n\nI have also been told that I have \"an attitude problem,\" when none of my male co workers are called out for their shitty behavior. I have had my bathroom breaks monitored, when no male employee has been called out on his \"excessive\" bathroom use. \n\nI am trying so hard to hold out. To wait. I love my job, it's just my managers are making it a living hell. I can handle a lot, but this is just too much. I am being forced to move to keep a job. I don't even like the area I'm being forced to. \n\nOne year. In one year my safety violation falls off, and I'm eligible to move as I please. Hopefully the grass is greener on the other side, and not because it's fertilized with bullshit.\n\nBut honestly, I just want to throw in the towel. Take a pay cut. Move to where I really want to be. Even if it means leaving this hellish industry all together. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65yvj5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "CVPPIECAEKS", "saved": false, "mod_reports": [], "name": "t3_65yvj5", "subreddit_name_prefixed": "r/self", "approved_by": null, "over_18": false, "domain": "self.self", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh96", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/self/comments/65yvj5/when_is_it_socially_acceptable_to_quit_a_good_job/", "num_reports": null, "locked": false, "stickied": false, "created": 1492497116.0, "url": "https://www.reddit.com/r/self/comments/65yvj5/when_is_it_socially_acceptable_to_quit_a_good_job/", "author_flair_text": null, "quarantine": false, "title": "When is it socially acceptable to quit a good job?", "created_utc": 1492468316.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65yvj5", "likes": null, "replies": "", "user_reports": [], "id": "dgefp92", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "garete", "parent_id": "t3_65yvj5", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "What most people think doesn't matter. If you think it's a good job, it's good. Otherwise it isn't. Just have something lined up before kicking the towel in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What most people think doesn&amp;#39;t matter. If you think it&amp;#39;s a good job, it&amp;#39;s good. Otherwise it isn&amp;#39;t. Just have something lined up before kicking the towel in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgefp92", "score_hidden": false, "stickied": false, "created": 1492506206.0, "created_utc": 1492477406.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65yvj5", "likes": null, "replies": "", "user_reports": [], "id": "dgeddvl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dingus521", "parent_id": "t3_65yvj5", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "&gt;When is it socially acceptable to quit a good job?\n\nWhen you have a better one lined up, whether that's because it pays more or because it would be better for your mental health to switch", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;When is it socially acceptable to quit a good job?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When you have a better one lined up, whether that&amp;#39;s because it pays more or because it would be better for your mental health to switch&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgeddvl", "score_hidden": false, "stickied": false, "created": 1492503331.0, "created_utc": 1492474531.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65yvj5", "likes": null, "replies": "", "user_reports": [], "id": "dgejfnw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AskmeAskme", "parent_id": "t3_65yvj5", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "It is always easier to get a new job while you have a job.  As long as you have something else lined up, get out of there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is always easier to get a new job while you have a job.  As long as you have something else lined up, get out of there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgejfnw", "score_hidden": false, "stickied": false, "created": 1492510729.0, "created_utc": 1492481929.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh96", "removal_reason": null, "link_id": "t3_65yvj5", "likes": null, "replies": "", "user_reports": [], "id": "dgeiqme", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TooSexyForMyKayak", "parent_id": "t3_65yvj5", "subreddit_name_prefixed": "r/self", "controversiality": 0, "body": "ANYTIME.  Corporations aren't people.  You can quit whenever you damn well please and no one is judging you.\n\nYou really need to get over this and do what's right for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ANYTIME.  Corporations aren&amp;#39;t people.  You can quit whenever you damn well please and no one is judging you.&lt;/p&gt;\n\n&lt;p&gt;You really need to get over this and do what&amp;#39;s right for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "self", "name": "t1_dgeiqme", "score_hidden": false, "stickied": false, "created": 1492509924.0, "created_utc": 1492481124.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]