[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "books", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello &lt;a href=\"/r/books\"&gt;/r/books&lt;/a&gt;!&lt;/p&gt;\n\n&lt;p&gt;This is the first time I&amp;#39;m posting in this subreddit. This is mainly due to the fact that I barely read anything besides German &amp;quot;classics&amp;quot;, which I guess you could say is expected of me, since I study German literature.&lt;/p&gt;\n\n&lt;p&gt;Today, I thought I&amp;#39;d maybe share some of my excitement about the greatest books and authors of all time, why I think they are so amazing and I&amp;#39;ll try to answer any questions that come up along the way.&lt;/p&gt;\n\n&lt;p&gt;Also if you have specific tastes, feel free to ask for recommendations.&lt;/p&gt;\n\n&lt;p&gt;In an effort to keep this short and concise, I thought I&amp;#39;d give you guys my &lt;em&gt;personal&lt;/em&gt; and &lt;em&gt;current&lt;/em&gt; top 3 suggestions for foreigners trying to dig into German literature. Please bear in mind that this is in no way &lt;em&gt;objective&lt;/em&gt; or &lt;em&gt;definitive&lt;/em&gt;, nor are any of my opinions on the subject.&lt;/p&gt;\n\n&lt;p&gt;You are very welcome to discuss the books and authors I&amp;#39;ve mentioned or any other relevant topic, and I&amp;#39;ll try to answer to the best of my ability!&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;1 . &lt;strong&gt;Die Leiden des jungen Werther&lt;/strong&gt; - &lt;em&gt;The Sorrows of Young Werther&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;by Johann Wolfgang von Goethe&lt;/p&gt;\n\n&lt;p&gt;No surprise to anyone, this book has shaped Europe in a marvelous way (although not in the short term; to avoid spoilers I recommend researching the short-term aftermath &lt;em&gt;after&lt;/em&gt; reading it). It was one of the first books to be mass printed and is said to have had a big impact on literacy throughout Europe, as everyone wanted to have read it. The source of the &amp;quot;Sturm und Drang&amp;quot; movement, Goethes work has inspired romantics everywhere to take a step back from puristic, protestant values.&lt;/p&gt;\n\n&lt;p&gt;2 . &lt;strong&gt;Ansichten eines Clowns&lt;/strong&gt; - &lt;em&gt;The Clown&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;by Heinrich Böll&lt;/p&gt;\n\n&lt;p&gt;This book describes post-war Germany (and a little bit of WW2 Germany) perfectly. Cut out, dry humour á la John Irving clashes with the (at the time) very real melancholy and nostalgia for the &amp;quot;good old times&amp;quot; by lots of older folks, as well as the depressive nihilism of lots of post-war generation youngsters. Stilistically, this books is great for finding out more about how time can be narrated in a very flexible way. In just the span of a few hours, the narrator tells his story of broken love in post war Germany.&lt;/p&gt;\n\n&lt;p&gt;P.S. Böll also wrote a great deal of the experience of WW2 soldiers, albeit from a non-political viewpoint, which is considered unique.&lt;/p&gt;\n\n&lt;p&gt;3 . &lt;strong&gt;Homo faber&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;by Max Frisch&lt;/p&gt;\n\n&lt;p&gt;Hailing from Switzerland and originally having finished a degree in architecture, Max Frisch soon turned to journalism and writing. (My personal favorite of his is a drama: &amp;quot;Biedermann und die Brandstifter (The Fire Raisers)&amp;quot;). This book has phenomal tempo, and once it&amp;#39;s picked up, you can&amp;#39;t put it down. Max Frisch has, in this book, perfected the genre of a family tragedy.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;These are my top 3 suggestions for foreigners, as in my opinion they all epitomize different eras and writing styles (although arguably Böll and Frisch are much closer to each other than Goethe is to either of them). They all excel in different areas of style, purpose and storytelling.&lt;/p&gt;\n\n&lt;p&gt;There are many more authors which I feel could and should be added, although I have the suspicion many literature buffs here will know them already: Kafka, albeit not from a german speaking country, is a great example, alongside Thomas Mann and his brother Heinrich Mann, both of which have great irony and tell some very personal stories; Thomas&amp;#39; are more of emotional nature, mostly of his homosexual nature which was not recognized at the time and still managed to become a big piece of German literature, Heinrichs&amp;#39; being of a more political variant.&lt;/p&gt;\n\n&lt;p&gt;Honorable mentions: Günther Grass, Heinrich Heine, Hermann Hesse, Robert Musil, Bernhard Schlinks &amp;quot;Der Vorleser (The Reader)&amp;quot;, Joseph von Eichendorff, Alfred Döblin, Eduard Mörike, Wolfgang Borchert.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Edit: Thank you guys for the amazing responses. As always when I am confronted with the sheer depth of all things literature, I managed to learn something new in this thread, and I hope you guys are having as much fun as I am! Keep &amp;#39;em coming!&lt;/p&gt;\n\n&lt;p&gt;Unfortunately there has been a bit of a commotion about my non-inclusion of Mein Kampf into this list, and as ridiculous as I feel for even responding to this, I want to make my position clear and hopefully alleviate some confusion.&lt;/p&gt;\n\n&lt;p&gt;Mein Kampf, and I really shouldn&amp;#39;t have to say this, shares an ideology that is abhorrent and misanthropic to its core. I have never personally met a German, even right wingers, who even in the slightest condones what is written in there, and obviously neither do I. There is a reason the state of Bavaria, which owned the copyright to it following Hitlers death, has kept it from being published in any way shape or form for the last 75 years, I believe. Obviously it was still avaiable, lots of people inherited copies and it was also free to read online, if you knew how to look. Alas, now it has been republished as a commented edition to limit its potential for abuse. This might prove useful, since, as most of our American redditors are probably aware, right-wing ideology is at a strong point and reading Mein Kampf might make it very clear to the reader just how similar ideologies only 75 years apart can be; learn from history, don&amp;#39;t repeat it.&lt;/p&gt;\n\n&lt;p&gt;That being said, as other commenters have pointed out, this is a thread about &lt;em&gt;literature&lt;/em&gt;, i.e. the art form of creating meaningful text. Mein Kampf is none of this, and I&amp;#39;ll quote &lt;a href=\"/u/tammio\"&gt;/u/tammio&lt;/a&gt;: it&amp;#39;s &amp;quot;the political ravings of a madman&amp;quot;. Not more, not less. Hitler never intended to create art, he meant to stir war into the hearts of the German people, and, sadly, succeeded.&lt;/p&gt;\n\n&lt;p&gt;If you guys want to read meaningful WW2 literature, go ahead, check out Heinrich Bölls &amp;quot;Im Westen nichts Neues (All Quiet on the Western Front)&amp;quot; or most short stories by Wolfgang Borchert, such as &amp;quot;Das Brot (The Bread)&amp;quot; or &amp;quot;Nachts schlafen die Ratten doch (Rats sleep at Night)&amp;quot;!&lt;/p&gt;\n\n&lt;p&gt;So please, please quite derailing the thread. It&amp;#39;s not about Nazis and it&amp;#39;s honestly getting pretty tiresome having to reurgitate this topic time and time again.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello /r/books!\n\nThis is the first time I'm posting in this subreddit. This is mainly due to the fact that I barely read anything besides German \"classics\", which I guess you could say is expected of me, since I study German literature.\n\nToday, I thought I'd maybe share some of my excitement about the greatest books and authors of all time, why I think they are so amazing and I'll try to answer any questions that come up along the way.\n\nAlso if you have specific tastes, feel free to ask for recommendations.\n\nIn an effort to keep this short and concise, I thought I'd give you guys my *personal* and *current* top 3 suggestions for foreigners trying to dig into German literature. Please bear in mind that this is in no way *objective* or *definitive*, nor are any of my opinions on the subject.\n\nYou are very welcome to discuss the books and authors I've mentioned or any other relevant topic, and I'll try to answer to the best of my ability!\n\n\n------------------------------------------------------------------------------------------------------\n\n1 . **Die Leiden des jungen Werther** - *The Sorrows of Young Werther*\n\n  by Johann Wolfgang von Goethe\n\nNo surprise to anyone, this book has shaped Europe in a marvelous way (although not in the short term; to avoid spoilers I recommend researching the short-term aftermath *after* reading it). It was one of the first books to be mass printed and is said to have had a big impact on literacy throughout Europe, as everyone wanted to have read it. The source of the \"Sturm und Drang\" movement, Goethes work has inspired romantics everywhere to take a step back from puristic, protestant values.\n\n2 . **Ansichten eines Clowns** - *The Clown*\n\n   by Heinrich Böll\n\nThis book describes post-war Germany (and a little bit of WW2 Germany) perfectly. Cut out, dry humour á la John Irving clashes with the (at the time) very real melancholy and nostalgia for the \"good old times\" by lots of older folks, as well as the depressive nihilism of lots of post-war generation youngsters. Stilistically, this books is great for finding out more about how time can be narrated in a very flexible way. In just the span of a few hours, the narrator tells his story of broken love in post war Germany.\n\nP.S. Böll also wrote a great deal of the experience of WW2 soldiers, albeit from a non-political viewpoint, which is considered unique.\n\n3 . **Homo faber**\n\nby Max Frisch\n\nHailing from Switzerland and originally having finished a degree in architecture, Max Frisch soon turned to journalism and writing. (My personal favorite of his is a drama: \"Biedermann und die Brandstifter (The Fire Raisers)\"). This book has phenomal tempo, and once it's picked up, you can't put it down. Max Frisch has, in this book, perfected the genre of a family tragedy.\n\n--------------------\n\nThese are my top 3 suggestions for foreigners, as in my opinion they all epitomize different eras and writing styles (although arguably Böll and Frisch are much closer to each other than Goethe is to either of them). They all excel in different areas of style, purpose and storytelling.\n\n\nThere are many more authors which I feel could and should be added, although I have the suspicion many literature buffs here will know them already: Kafka, albeit not from a german speaking country, is a great example, alongside Thomas Mann and his brother Heinrich Mann, both of which have great irony and tell some very personal stories; Thomas' are more of emotional nature, mostly of his homosexual nature which was not recognized at the time and still managed to become a big piece of German literature, Heinrichs' being of a more political variant.\n\nHonorable mentions: Günther Grass, Heinrich Heine, Hermann Hesse, Robert Musil, Bernhard Schlinks \"Der Vorleser (The Reader)\", Joseph von Eichendorff, Alfred Döblin, Eduard Mörike, Wolfgang Borchert.\n\n----\n\nEdit: Thank you guys for the amazing responses. As always when I am confronted with the sheer depth of all things literature, I managed to learn something new in this thread, and I hope you guys are having as much fun as I am! Keep 'em coming!\n\nUnfortunately there has been a bit of a commotion about my non-inclusion of Mein Kampf into this list, and as ridiculous as I feel for even responding to this, I want to make my position clear and hopefully alleviate some confusion.\n\nMein Kampf, and I really shouldn't have to say this, shares an ideology that is abhorrent and misanthropic to its core. I have never personally met a German, even right wingers, who even in the slightest condones what is written in there, and obviously neither do I. There is a reason the state of Bavaria, which owned the copyright to it following Hitlers death, has kept it from being published in any way shape or form for the last 75 years, I believe. Obviously it was still avaiable, lots of people inherited copies and it was also free to read online, if you knew how to look. Alas, now it has been republished as a commented edition to limit its potential for abuse. This might prove useful, since, as most of our American redditors are probably aware, right-wing ideology is at a strong point and reading Mein Kampf might make it very clear to the reader just how similar ideologies only 75 years apart can be; learn from history, don't repeat it.\n\nThat being said, as other commenters have pointed out, this is a thread about *literature*, i.e. the art form of creating meaningful text. Mein Kampf is none of this, and I'll quote /u/tammio: it's \"the political ravings of a madman\". Not more, not less. Hitler never intended to create art, he meant to stir war into the hearts of the German people, and, sadly, succeeded.\n\nIf you guys want to read meaningful WW2 literature, go ahead, check out Heinrich Bölls \"Im Westen nichts Neues (All Quiet on the Western Front)\" or most short stories by Wolfgang Borchert, such as \"Das Brot (The Bread)\" or \"Nachts schlafen die Ratten doch (Rats sleep at Night)\"!\n\nSo please, please quite derailing the thread. It's not about Nazis and it's honestly getting pretty tiresome having to reurgitate this topic time and time again.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64knhs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 47, "report_reasons": null, "author": "reomc", "saved": false, "mod_reports": [], "name": "t3_64knhs", "subreddit_name_prefixed": "r/books", "approved_by": null, "over_18": false, "domain": "self.books", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh4i", "edited": 1491920010.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/books/comments/64knhs/a_small_inside_look_into_german_literature/", "num_reports": null, "locked": false, "stickied": false, "created": 1491870839.0, "url": "https://www.reddit.com/r/books/comments/64knhs/a_small_inside_look_into_german_literature/", "author_flair_text": null, "quarantine": false, "title": "A small inside look into German literature, including some suggestions for must-reads. Also AMA about German literature and I'll try to recommend books for your specific wants!", "created_utc": 1491842039.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 50, "visited": false, "subreddit_type": "public", "ups": 47}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg43vfr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tammio", "parent_id": "t1_dg41o0n", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Okay that's a good point. Reading Faust in German is a challenge", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay that&amp;#39;s a good point. Reading Faust in German is a challenge&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg43vfr", "score_hidden": false, "stickied": false, "created": 1491936743.0, "created_utc": 1491907943.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg41o0n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reomc", "parent_id": "t1_dg34hxa", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Yess! The Taugenichts is amazing.\n\nI recommended Werther because it has made a big impact on society. I thought about using Faust instead but I reckoned it'd not be as good of a match for most people as it does require a good command of German to read in original, and I personally feel that bound language (ie. poems) lose too much of their charm when translated.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yess! The Taugenichts is amazing.&lt;/p&gt;\n\n&lt;p&gt;I recommended Werther because it has made a big impact on society. I thought about using Faust instead but I reckoned it&amp;#39;d not be as good of a match for most people as it does require a good command of German to read in original, and I personally feel that bound language (ie. poems) lose too much of their charm when translated.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg41o0n", "score_hidden": false, "stickied": false, "created": 1491930079.0, "created_utc": 1491901279.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg34hxa", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "tammio", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Seriously Die Leiden des Jungen Werter? That's my least favorite book from Goethe. \n\nI do however  love the \"Faust\" part I, from Goethe too, fiercely.  So if you're  not into the lovesick ramblings of a frustratingly romantic kid, read the Faust and enjoy Orgies, murder, adultery, deals with the devil (you know as in \"making a Faustian bargain\") and so forth.\n\nOh and I couldn't  agree more with Eichendorfs mention. I love \"aus dem Leben eines Taugenichts\" ", "edited": 1491852780.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seriously Die Leiden des Jungen Werter? That&amp;#39;s my least favorite book from Goethe. &lt;/p&gt;\n\n&lt;p&gt;I do however  love the &amp;quot;Faust&amp;quot; part I, from Goethe too, fiercely.  So if you&amp;#39;re  not into the lovesick ramblings of a frustratingly romantic kid, read the Faust and enjoy Orgies, murder, adultery, deals with the devil (you know as in &amp;quot;making a Faustian bargain&amp;quot;) and so forth.&lt;/p&gt;\n\n&lt;p&gt;Oh and I couldn&amp;#39;t  agree more with Eichendorfs mention. I love &amp;quot;aus dem Leben eines Taugenichts&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg34hxa", "score_hidden": false, "stickied": false, "created": 1491881340.0, "created_utc": 1491852540.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg41z9i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "reomc", "parent_id": "t1_dg37yej", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Great shout out to a great author, which is well deserved!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great shout out to a great author, which is well deserved!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg41z9i", "score_hidden": false, "stickied": false, "created": 1491931053.0, "created_utc": 1491902253.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg37yej", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Rudi_Reifenstecher", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "shout out for Woyzeck by Georg Büchner, best German classic I've read ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;shout out for Woyzeck by Georg Büchner, best German classic I&amp;#39;ve read &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg37yej", "score_hidden": false, "stickied": false, "created": 1491884933.0, "created_utc": 1491856133.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg420ol", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "reomc", "parent_id": "t1_dg3dlv0", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "If you enjoy Grass, check out Hesses \"Das Glasperlenspiel (The Glass Bead Game)\"!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you enjoy Grass, check out Hesses &amp;quot;Das Glasperlenspiel (The Glass Bead Game)&amp;quot;!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg420ol", "score_hidden": false, "stickied": false, "created": 1491931176.0, "created_utc": 1491902376.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3dlv0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Perry0485", "parent_id": "t1_dg3bfyg", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Oh \"The Tin Drum\" is insane, I'm planning on reading it sometimes soon. When it first came out, it was hated by most critics. Now, it is seen as one of the greatest literary accomplishments of 20th century Germany.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh &amp;quot;The Tin Drum&amp;quot; is insane, I&amp;#39;m planning on reading it sometimes soon. When it first came out, it was hated by most critics. Now, it is seen as one of the greatest literary accomplishments of 20th century Germany.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3dlv0", "score_hidden": false, "stickied": false, "created": 1491891291.0, "created_utc": 1491862491.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg41iag", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reomc", "parent_id": "t1_dg3bfyg", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "You could definitely start on youth books, as they are generally not as complicated. For this purpose I highly recommend Erich Kästner, a great author that has lots of imagination and has also allowed (a revolutionary move) his protagonists, which are mostly children, to resolve their problems themselves instead of turning to more conventional methods. Check out \"Das fliegende Klassenzimmer\" and \"Emil und die Detektive\"!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could definitely start on youth books, as they are generally not as complicated. For this purpose I highly recommend Erich Kästner, a great author that has lots of imagination and has also allowed (a revolutionary move) his protagonists, which are mostly children, to resolve their problems themselves instead of turning to more conventional methods. Check out &amp;quot;Das fliegende Klassenzimmer&amp;quot; and &amp;quot;Emil und die Detektive&amp;quot;!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg41iag", "score_hidden": false, "stickied": false, "created": 1491929578.0, "created_utc": 1491900778.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3bfyg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Joedirt112", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Actually just read Günter Grass's \"The Tin Drum\" the other day. Looked on Reddit but it didn't seem like any one else had read it!\n\nThere are a few German writers I've read before (Grass, Jünger, Böll, Nossack to name a few) but they've all been translations. I'm in college now however and have so far taken one year of German language and plan on continuing it all four years of school. Do you have any recommendations for \"simple\" books that I could read in German? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually just read Günter Grass&amp;#39;s &amp;quot;The Tin Drum&amp;quot; the other day. Looked on Reddit but it didn&amp;#39;t seem like any one else had read it!&lt;/p&gt;\n\n&lt;p&gt;There are a few German writers I&amp;#39;ve read before (Grass, Jünger, Böll, Nossack to name a few) but they&amp;#39;ve all been translations. I&amp;#39;m in college now however and have so far taken one year of German language and plan on continuing it all four years of school. Do you have any recommendations for &amp;quot;simple&amp;quot; books that I could read in German? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3bfyg", "score_hidden": false, "stickied": false, "created": 1491888705.0, "created_utc": 1491859905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg5ff4f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wish_to_conquer_pain", "parent_id": "t1_dg421xq", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I haven't yet, but it's on my list! Have you read Fontane's Effi Briest? What did you think?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t yet, but it&amp;#39;s on my list! Have you read Fontane&amp;#39;s Effi Briest? What did you think?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg5ff4f", "score_hidden": false, "stickied": false, "created": 1491997630.0, "created_utc": 1491968830.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg421xq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "reomc", "parent_id": "t1_dg3e0mm", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Honestly haven't read her, thanks for the tip! Have you read Death in Venice by Mann? It's my favorite of his, I'm a sucker for self expressive literature.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly haven&amp;#39;t read her, thanks for the tip! Have you read Death in Venice by Mann? It&amp;#39;s my favorite of his, I&amp;#39;m a sucker for self expressive literature.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg421xq", "score_hidden": false, "stickied": false, "created": 1491931280.0, "created_utc": 1491902480.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3e0mm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "wish_to_conquer_pain", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Oh awesome, I've been reading a lot of German lit lately (and Der Vorleser is one of my all-time favorite books) so this thread is a great find.\n\nI'm currently working my way through The Magic Mountain, and I'm really enjoying it. I'm reading it in English (I've been trying to learn German, but my progress is slow, and this isn't a book to learn on).  Is there anything you'd tell a first-time reader to keep their eyes open for?\n\nHow do you feel about Imgard Keun?  I really enjoyed The Artificial Silk Girl, but I had a hard time with Child of All Nations.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh awesome, I&amp;#39;ve been reading a lot of German lit lately (and Der Vorleser is one of my all-time favorite books) so this thread is a great find.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m currently working my way through The Magic Mountain, and I&amp;#39;m really enjoying it. I&amp;#39;m reading it in English (I&amp;#39;ve been trying to learn German, but my progress is slow, and this isn&amp;#39;t a book to learn on).  Is there anything you&amp;#39;d tell a first-time reader to keep their eyes open for?&lt;/p&gt;\n\n&lt;p&gt;How do you feel about Imgard Keun?  I really enjoyed The Artificial Silk Girl, but I had a hard time with Child of All Nations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3e0mm", "score_hidden": false, "stickied": false, "created": 1491891802.0, "created_utc": 1491863002.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg38xep", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "imoinda", "parent_id": "t1_dg34g0t", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "*Schachnovelle* is excellent for someone not used to German literature. And Kafka has the most beautiful German of all German-language authors, in my opinion - but I'd maybe start with *Die Verwandlung*, since it's shorter and somewhat easier to read.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Schachnovelle&lt;/em&gt; is excellent for someone not used to German literature. And Kafka has the most beautiful German of all German-language authors, in my opinion - but I&amp;#39;d maybe start with &lt;em&gt;Die Verwandlung&lt;/em&gt;, since it&amp;#39;s shorter and somewhat easier to read.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg38xep", "score_hidden": false, "stickied": false, "created": 1491885954.0, "created_utc": 1491857154.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg397xx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cha0tiqu3", "parent_id": "t1_dg34g0t", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "+1 on Schachnovelle, really powerful story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;+1 on Schachnovelle, really powerful story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg397xx", "score_hidden": false, "stickied": false, "created": 1491886262.0, "created_utc": 1491857462.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg34g0t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheDiscussionMan", "parent_id": "t1_dg33lks", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "If you're just starting out with reading German literature in German it'd be best to start with something like 'Schachnovelle' by Stefan Zweig or \"Der Prozess' by Kafka. Both are relatively easy to read in German, same as, for example, Camus is for french.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re just starting out with reading German literature in German it&amp;#39;d be best to start with something like &amp;#39;Schachnovelle&amp;#39; by Stefan Zweig or &amp;quot;Der Prozess&amp;#39; by Kafka. Both are relatively easy to read in German, same as, for example, Camus is for french.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg34g0t", "score_hidden": false, "stickied": false, "created": 1491881285.0, "created_utc": 1491852485.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg41kja", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reomc", "parent_id": "t1_dg33lks", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Homo faber, honestly, as it relies more heavily on the great story which I imagine comes out nicely if the translation is done well enough. The other two are more demanding in terms of language. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Homo faber, honestly, as it relies more heavily on the great story which I imagine comes out nicely if the translation is done well enough. The other two are more demanding in terms of language. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg41kja", "score_hidden": false, "stickied": false, "created": 1491929772.0, "created_utc": 1491900972.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg33lks", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Donuil23", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I'm sure you would advocate reading them all in German if one was able, but which of these would you recommend the most?  (ie.  which of these three looses the most by being read in English?)\n\nI've never read a novel in German, but welcome the challenge!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure you would advocate reading them all in German if one was able, but which of these would you recommend the most?  (ie.  which of these three looses the most by being read in English?)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never read a novel in German, but welcome the challenge!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg33lks", "score_hidden": false, "stickied": false, "created": 1491880400.0, "created_utc": 1491851600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg41q7o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "reomc", "parent_id": "t1_dg350o1", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I did read some Hohlbein when I was younger, as I did read a lot of Fantasy back in the day - if you enjoy him, give Markus Heinz a try!\n\nI'v since stopped reading Fantasy as I turned more towards literature as an art form, whereas I feel the genre is more of a storytelling one. This is just my opinion though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did read some Hohlbein when I was younger, as I did read a lot of Fantasy back in the day - if you enjoy him, give Markus Heinz a try!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;v since stopped reading Fantasy as I turned more towards literature as an art form, whereas I feel the genre is more of a storytelling one. This is just my opinion though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg41q7o", "score_hidden": false, "stickied": false, "created": 1491930274.0, "created_utc": 1491901474.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg394e0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "imoinda", "parent_id": "t1_dg350o1", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Wow, that man wrote a lot... I've read one book by him, but I don't remember the name. And I can't find it on the Wikipedia list, it's too long... I think it had something to do with time travel.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, that man wrote a lot... I&amp;#39;ve read one book by him, but I don&amp;#39;t remember the name. And I can&amp;#39;t find it on the Wikipedia list, it&amp;#39;s too long... I think it had something to do with time travel.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg394e0", "score_hidden": false, "stickied": false, "created": 1491886160.0, "created_utc": 1491857360.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg350o1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BarcodePrinter", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I know this isn't a \"classic\" but I read Märchenmond by Wolfgang Hohlbein. What do you thing about Wolfgang and Heike Hohlbein work ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know this isn&amp;#39;t a &amp;quot;classic&amp;quot; but I read Märchenmond by Wolfgang Hohlbein. What do you thing about Wolfgang and Heike Hohlbein work ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg350o1", "score_hidden": false, "stickied": false, "created": 1491881877.0, "created_utc": 1491853077.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg3f5tt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tammio", "parent_id": "t1_dg3eoyl", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "well in that regard I can't help you. My beach reeds are usually si-fi or high quality fantasy books I pick up in the English Bookstore in my city :P\n\n TBH I only read German if its considered \"classic\" literature, or if it's a classic from a language I can't read (like say the epic of gilgamesh)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well in that regard I can&amp;#39;t help you. My beach reeds are usually si-fi or high quality fantasy books I pick up in the English Bookstore in my city :P&lt;/p&gt;\n\n&lt;p&gt;TBH I only read German if its considered &amp;quot;classic&amp;quot; literature, or if it&amp;#39;s a classic from a language I can&amp;#39;t read (like say the epic of gilgamesh)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3f5tt", "score_hidden": false, "stickied": false, "created": 1491893244.0, "created_utc": 1491864444.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg48uq4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tammio", "parent_id": "t1_dg3eoyl", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Ha I just thought of something! Read one of Karl May's books, if possible Winnetou. It's surprisingly progressive for a 150 year old book, very well known and can be considered YA (even though back in the day it was proper adult) \n\nAnd it's mind blowing how accurate the books are when you realise that Karl May never left Germany until he was rich and famous but people still used his books as travel guides to places like Egypt, US etc", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ha I just thought of something! Read one of Karl May&amp;#39;s books, if possible Winnetou. It&amp;#39;s surprisingly progressive for a 150 year old book, very well known and can be considered YA (even though back in the day it was proper adult) &lt;/p&gt;\n\n&lt;p&gt;And it&amp;#39;s mind blowing how accurate the books are when you realise that Karl May never left Germany until he was rich and famous but people still used his books as travel guides to places like Egypt, US etc&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg48uq4", "score_hidden": false, "stickied": false, "created": 1491946073.0, "created_utc": 1491917273.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg4xj01", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mczolly", "parent_id": "t1_dg3eoyl", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Not chick-lit in the strongest sense but I recommend \"Das Wetter vor 15 Jahren\" from Wolf Haas, it's a great meta-story and very easy to read. Similarly easy book is \"Gut gegen  Nordwind\" from Daniel Glattauer.\n\nSource: I'm a learner/teacher", "edited": 1491945346.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not chick-lit in the strongest sense but I recommend &amp;quot;Das Wetter vor 15 Jahren&amp;quot; from Wolf Haas, it&amp;#39;s a great meta-story and very easy to read. Similarly easy book is &amp;quot;Gut gegen  Nordwind&amp;quot; from Daniel Glattauer.&lt;/p&gt;\n\n&lt;p&gt;Source: I&amp;#39;m a learner/teacher&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg4xj01", "score_hidden": false, "stickied": false, "created": 1491973848.0, "created_utc": 1491945048.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3eoyl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cha0tiqu3", "parent_id": "t1_dg3dxon", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Thank you! I've actually read the Zwieg story in translation quite recently, so maybe I'll wait until I forget the details. But I had never heard about Dürrenmatt so I'll definitely give it a try.\nAny YA or chick-lit in German worth mentioning? Please don't judge me, I need beach reads as well :))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! I&amp;#39;ve actually read the Zwieg story in translation quite recently, so maybe I&amp;#39;ll wait until I forget the details. But I had never heard about Dürrenmatt so I&amp;#39;ll definitely give it a try.\nAny YA or chick-lit in German worth mentioning? Please don&amp;#39;t judge me, I need beach reads as well :))&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3eoyl", "score_hidden": false, "stickied": false, "created": 1491892652.0, "created_utc": 1491863852.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3dxon", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tammio", "parent_id": "t1_dg395gp", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Not OP, but I'll pitch in my two cents anyway. You'll probably look for something relativeley modern so the language is understandable  (so let's say since WW II). So no Shiller, Goethe, Eichendorf for you, sorry! \n\nSomeone mentioned \"Schachnovelle\" by Stephan Zweig in a thread above, I think that's a good one to start. Engaging topic, relatively easy to understand and one of the few school books I actually liked. \n\nAlternatively maybe \"Die Physiker\", a play by Dürrenmatt. I personally find plays easier to comprehend sometimes because you don't have to deal with so many descriptions of things. Both are very \"historic\" in the sence that schachnovelle is set in ww2 Austria, while the other is set in a Sanatorium in Cold-war Zürich (? I think. It's been a while)  Both were written by very famous authors, Steffen Zweig and Dürrenmatt and both explore the topic of insanity in their own way. \n \nSo in conclusion just read both ;D\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not OP, but I&amp;#39;ll pitch in my two cents anyway. You&amp;#39;ll probably look for something relativeley modern so the language is understandable  (so let&amp;#39;s say since WW II). So no Shiller, Goethe, Eichendorf for you, sorry! &lt;/p&gt;\n\n&lt;p&gt;Someone mentioned &amp;quot;Schachnovelle&amp;quot; by Stephan Zweig in a thread above, I think that&amp;#39;s a good one to start. Engaging topic, relatively easy to understand and one of the few school books I actually liked. &lt;/p&gt;\n\n&lt;p&gt;Alternatively maybe &amp;quot;Die Physiker&amp;quot;, a play by Dürrenmatt. I personally find plays easier to comprehend sometimes because you don&amp;#39;t have to deal with so many descriptions of things. Both are very &amp;quot;historic&amp;quot; in the sence that schachnovelle is set in ww2 Austria, while the other is set in a Sanatorium in Cold-war Zürich (? I think. It&amp;#39;s been a while)  Both were written by very famous authors, Steffen Zweig and Dürrenmatt and both explore the topic of insanity in their own way. &lt;/p&gt;\n\n&lt;p&gt;So in conclusion just read both ;D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3dxon", "score_hidden": false, "stickied": false, "created": 1491891700.0, "created_utc": 1491862900.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg46t7m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reomc", "parent_id": "t1_dg46hti", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I have to agree that he is more on the simpler side, although he still manages to give language a beautiful, unique twist. My favorite of his is \"Rosshalde\", but it's kind of dark and maybe not for everyone. \n\nSpeaking of Siddharta, if you enjoy the idea of western authors picking up indian culture and toying with it in their stories, do check out \"Die vertauschten Köpfe\" by Thomas Mann. Sadly I don't believe there is a translation avaiable and he does have a demanding ironic style, but I thought I'd point you at it if you ever get around to it. I'd pick it over Siddharta any day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have to agree that he is more on the simpler side, although he still manages to give language a beautiful, unique twist. My favorite of his is &amp;quot;Rosshalde&amp;quot;, but it&amp;#39;s kind of dark and maybe not for everyone. &lt;/p&gt;\n\n&lt;p&gt;Speaking of Siddharta, if you enjoy the idea of western authors picking up indian culture and toying with it in their stories, do check out &amp;quot;Die vertauschten Köpfe&amp;quot; by Thomas Mann. Sadly I don&amp;#39;t believe there is a translation avaiable and he does have a demanding ironic style, but I thought I&amp;#39;d point you at it if you ever get around to it. I&amp;#39;d pick it over Siddharta any day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg46t7m", "score_hidden": false, "stickied": false, "created": 1491942937.0, "created_utc": 1491914137.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg46hti", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bluebluebluered", "parent_id": "t1_dg41xlk", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Out of interest. What level would you consider Hesse to be at for somebody learning German? The prose in a work like Siddhartha are extremely simplistic. (Granted I know some of his works get quite esoteric at points but I'd love to read Hesse in the original German one day.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Out of interest. What level would you consider Hesse to be at for somebody learning German? The prose in a work like Siddhartha are extremely simplistic. (Granted I know some of his works get quite esoteric at points but I&amp;#39;d love to read Hesse in the original German one day.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg46hti", "score_hidden": false, "stickied": false, "created": 1491942387.0, "created_utc": 1491913587.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg41xlk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "reomc", "parent_id": "t1_dg395gp", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Hello! I generally agree with /u/tammio, and Dürrenmatt is just one of the many great authors I forgot to list in the OP. That being said, maybe you could ease yourself into it with some youth literature as I've said above, suggesting Erich Kästner as a starting point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello! I generally agree with &lt;a href=\"/u/tammio\"&gt;/u/tammio&lt;/a&gt;, and Dürrenmatt is just one of the many great authors I forgot to list in the OP. That being said, maybe you could ease yourself into it with some youth literature as I&amp;#39;ve said above, suggesting Erich Kästner as a starting point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg41xlk", "score_hidden": false, "stickied": false, "created": 1491930905.0, "created_utc": 1491902105.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg395gp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cha0tiqu3", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "This might be an odd question, but would you have a recommendation of a German (or German-language) book that is both worth reading and not overly complicated in terms of language? My level is sort of upper-intermediate, so I fully accept there'll be plenty of dictionary visits, but looking up every other word might put me off completely. TIA", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This might be an odd question, but would you have a recommendation of a German (or German-language) book that is both worth reading and not overly complicated in terms of language? My level is sort of upper-intermediate, so I fully accept there&amp;#39;ll be plenty of dictionary visits, but looking up every other word might put me off completely. TIA&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg395gp", "score_hidden": false, "stickied": false, "created": 1491886191.0, "created_utc": 1491857391.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg3l2wq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Thatseemsright", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Any love for Arno Schmidt? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Any love for Arno Schmidt? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3l2wq", "score_hidden": false, "stickied": false, "created": 1491900827.0, "created_utc": 1491872027.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg34fx0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Inkberrow", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "No Joseph von Westphalen?   Too farcical?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No Joseph von Westphalen?   Too farcical?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg34fx0", "score_hidden": false, "stickied": false, "created": 1491881282.0, "created_utc": 1491852482.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg41rtd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "reomc", "parent_id": "t1_dg35d6f", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I honestly can't speak for all of the world, but Germany is highly influenced by the Nibelungenlied, an ancient saga of Siegfried, who took on a Dragon (not trying to spoiler too much; I highly recommend it!).\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I honestly can&amp;#39;t speak for all of the world, but Germany is highly influenced by the Nibelungenlied, an ancient saga of Siegfried, who took on a Dragon (not trying to spoiler too much; I highly recommend it!).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg41rtd", "score_hidden": false, "stickied": false, "created": 1491930408.0, "created_utc": 1491901608.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg492d3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tammio", "parent_id": "t1_dg35d6f", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "The Nibelungenlied was all ready mentioned, but I think Parzival is worth mentioning too as it's regarded as an  (or eveb THE) Archetypical story of a knight. \n\nOr something by Walther von der Vogelweide, he is regarded as the most influential medieval lyricist \n\n\nHowever if you read anything from German middle ages you might as well read it in English because it's translated from middle high German with is as unreadable for modern Germans as middle high English is for modern English speakers", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Nibelungenlied was all ready mentioned, but I think Parzival is worth mentioning too as it&amp;#39;s regarded as an  (or eveb THE) Archetypical story of a knight. &lt;/p&gt;\n\n&lt;p&gt;Or something by Walther von der Vogelweide, he is regarded as the most influential medieval lyricist &lt;/p&gt;\n\n&lt;p&gt;However if you read anything from German middle ages you might as well read it in English because it&amp;#39;s translated from middle high German with is as unreadable for modern Germans as middle high English is for modern English speakers&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg492d3", "score_hidden": false, "stickied": false, "created": 1491946367.0, "created_utc": 1491917567.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg35d6f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dharmist", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I've grown up reading German fairy tales, mostly those collected by Grimm brothers, as well as the darker stuff written by Hoffman and Hauff, but I don't remember most of them. Considering the impact that German folklore and those tales in particular had on the world literature (and music, and what have you), which tale do you think had the most impact on storytellers all over the globe? Which one was replicated or re-told the most, or maybe left the most vivid imprint in the history of literature, in your opinion? Is it Faust? Is it one of the Grimm tales? \n\nAlso, thank you for reminding me to read more of Goethe. For some reason I've only read *Faust*, but never really thought of getting acquainted with his other works. I'll make sure to read *The Sorrows of Young Werther* someday per your recommendation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve grown up reading German fairy tales, mostly those collected by Grimm brothers, as well as the darker stuff written by Hoffman and Hauff, but I don&amp;#39;t remember most of them. Considering the impact that German folklore and those tales in particular had on the world literature (and music, and what have you), which tale do you think had the most impact on storytellers all over the globe? Which one was replicated or re-told the most, or maybe left the most vivid imprint in the history of literature, in your opinion? Is it Faust? Is it one of the Grimm tales? &lt;/p&gt;\n\n&lt;p&gt;Also, thank you for reminding me to read more of Goethe. For some reason I&amp;#39;ve only read &lt;em&gt;Faust&lt;/em&gt;, but never really thought of getting acquainted with his other works. I&amp;#39;ll make sure to read &lt;em&gt;The Sorrows of Young Werther&lt;/em&gt; someday per your recommendation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg35d6f", "score_hidden": false, "stickied": false, "created": 1491882241.0, "created_utc": 1491853441.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg383oq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RaygunnerRei", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "What can you tell me about German Pulps? How were they different from the American/German Pulps of the same era? \n\nI ask this I'm looking for a series of 'lost' German Sci-Fi Novella. Der Luftpirat und sein Lenkbares Luftschiff\" Or 'The Air Pirate And His Steerable Airship'. But I've turned up VERY little information about it. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What can you tell me about German Pulps? How were they different from the American/German Pulps of the same era? &lt;/p&gt;\n\n&lt;p&gt;I ask this I&amp;#39;m looking for a series of &amp;#39;lost&amp;#39; German Sci-Fi Novella. Der Luftpirat und sein Lenkbares Luftschiff&amp;quot; Or &amp;#39;The Air Pirate And His Steerable Airship&amp;#39;. But I&amp;#39;ve turned up VERY little information about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg383oq", "score_hidden": false, "stickied": false, "created": 1491885083.0, "created_utc": 1491856283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg40e04", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Reggie222", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I just re-read The Sorrows of Young Werther and have started Faust, by Johann Wolfgang von Goethe. I recommend both.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just re-read The Sorrows of Young Werther and have started Faust, by Johann Wolfgang von Goethe. I recommend both.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg40e04", "score_hidden": false, "stickied": false, "created": 1491926167.0, "created_utc": 1491897367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg45jt4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fescil", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I read Young Werther about a year ago, and it really stuck with me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read Young Werther about a year ago, and it really stuck with me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg45jt4", "score_hidden": false, "stickied": false, "created": 1491940627.0, "created_utc": 1491911827.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg49mp8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dos_Manos", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I don't see Hans Fallada here, so if anybody is reading this please consider giving him a go. He wrote *The Drinker* in 2 weeks while locked in an insane asylum. Also W.G Sebald - such beguiling, strange, haunting work.\n\nEDIT: also thanks OP, this is a really great post, and the kind of thing I come to r/books for. I'll be sure to check out some of your suggestions.", "edited": 1491918609.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t see Hans Fallada here, so if anybody is reading this please consider giving him a go. He wrote &lt;em&gt;The Drinker&lt;/em&gt; in 2 weeks while locked in an insane asylum. Also W.G Sebald - such beguiling, strange, haunting work.&lt;/p&gt;\n\n&lt;p&gt;EDIT: also thanks OP, this is a really great post, and the kind of thing I come to &lt;a href=\"/r/books\"&gt;r/books&lt;/a&gt; for. I&amp;#39;ll be sure to check out some of your suggestions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg49mp8", "score_hidden": false, "stickied": false, "created": 1491947129.0, "created_utc": 1491918329.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg37vgn", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Rudi_Reifenstecher", "parent_id": "t1_dg31y7r", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "it's not even german because Hitler was from austria ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it&amp;#39;s not even german because Hitler was from austria &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg37vgn", "score_hidden": false, "stickied": false, "created": 1491884850.0, "created_utc": 1491856050.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg3jaln", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Donuil23", "parent_id": "t1_dg3hpdm", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "&gt; OP was hoping to focus on lesser-known works,\n\nThat may be, but I stand by my point.\n\nThanks for the heads-up, though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;OP was hoping to focus on lesser-known works,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That may be, but I stand by my point.&lt;/p&gt;\n\n&lt;p&gt;Thanks for the heads-up, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3jaln", "score_hidden": false, "stickied": false, "created": 1491898598.0, "created_utc": 1491869798.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3hpdm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Duke_Paul", "parent_id": "t1_dg370kh", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Just so you and /u/RiccoUSA are aware, OP was hoping to focus on lesser-known works, which he discussed in a message to the mods before posting. Just a possible reason why MK isn't mentioned, which I just realized isn't alluded to in the post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just so you and &lt;a href=\"/u/RiccoUSA\"&gt;/u/RiccoUSA&lt;/a&gt; are aware, OP was hoping to focus on lesser-known works, which he discussed in a message to the mods before posting. Just a possible reason why MK isn&amp;#39;t mentioned, which I just realized isn&amp;#39;t alluded to in the post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3hpdm", "score_hidden": false, "stickied": false, "created": 1491896581.0, "created_utc": 1491867781.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg370kh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Donuil23", "parent_id": "t1_dg35u8u", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Look, this will be my last word on the subject, because I'm not much of a word-smith, and I rarely do well in these internet arguments.\n\nYou're conflating reading about someone, and reading their works.  Conflating reading something for literary value and reading something to learning historic perspective.  You seem to think because I disagree with you, I think a book needs burning.  None of these things jive.\n\nThis book in particular does not meet most peoples criteria for a well written book.  Read all the biographies of Hitler you want.  Some of them are well written, some of them aren't.  Read Mein Kampf, you will learn something of Germany and its people at that time.  But its inclusion in this list of OP's don't pass muster.  That wasn't the point of the list.\n\nI'm not saying you should burn or ban the book.  But it isn't something with literary value either, just historic.  There is a difference, I just don't think you want to see that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look, this will be my last word on the subject, because I&amp;#39;m not much of a word-smith, and I rarely do well in these internet arguments.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re conflating reading about someone, and reading their works.  Conflating reading something for literary value and reading something to learning historic perspective.  You seem to think because I disagree with you, I think a book needs burning.  None of these things jive.&lt;/p&gt;\n\n&lt;p&gt;This book in particular does not meet most peoples criteria for a well written book.  Read all the biographies of Hitler you want.  Some of them are well written, some of them aren&amp;#39;t.  Read Mein Kampf, you will learn something of Germany and its people at that time.  But its inclusion in this list of OP&amp;#39;s don&amp;#39;t pass muster.  That wasn&amp;#39;t the point of the list.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying you should burn or ban the book.  But it isn&amp;#39;t something with literary value either, just historic.  There is a difference, I just don&amp;#39;t think you want to see that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg370kh", "score_hidden": false, "stickied": false, "created": 1491883955.0, "created_utc": 1491855155.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg3hmke", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Duke_Paul", "parent_id": "t1_dg3hl7g", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Hah that's nuts!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hah that&amp;#39;s nuts!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3hmke", "score_hidden": false, "stickied": false, "created": 1491896475.0, "created_utc": 1491867675.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3hl7g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg3hiwy", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3hl7g", "score_hidden": false, "stickied": false, "created": 1491896424.0, "created_utc": 1491867624.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3hiwy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Duke_Paul", "parent_id": "t1_dg35u8u", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "...Jack the Stripper?\n\nDid I miss, like, a really important history class?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;...Jack the Stripper?&lt;/p&gt;\n\n&lt;p&gt;Did I miss, like, a really important history class?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3hiwy", "score_hidden": false, "stickied": false, "created": 1491896340.0, "created_utc": 1491867540.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg35u8u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg35bvs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "[deleted]", "edited": 1491854216.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg35u8u", "score_hidden": false, "stickied": false, "created": 1491882732.0, "created_utc": 1491853932.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg35bvs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Donuil23", "parent_id": "t1_dg34bnw", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Fine, point taken.  \n\nMy point was, OP put together a short list of quality selections of German Literature that those interested in the topic could try.  You said that Mein Kampf should be on the list.  You obviously weren't paying attention to what OP was trying to impart, or you're trolling.  Fine. it may be literature, but it's not quality, and not representative.  It still has a place in the world, but IMO, as an artifact of history.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fine, point taken.  &lt;/p&gt;\n\n&lt;p&gt;My point was, OP put together a short list of quality selections of German Literature that those interested in the topic could try.  You said that Mein Kampf should be on the list.  You obviously weren&amp;#39;t paying attention to what OP was trying to impart, or you&amp;#39;re trolling.  Fine. it may be literature, but it&amp;#39;s not quality, and not representative.  It still has a place in the world, but IMO, as an artifact of history.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg35bvs", "score_hidden": false, "stickied": false, "created": 1491882202.0, "created_utc": 1491853402.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg34bnw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg33g2v", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg34bnw", "score_hidden": false, "stickied": false, "created": 1491881161.0, "created_utc": 1491852361.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg33g2v", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Donuil23", "parent_id": "t1_dg3317w", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Historical Artifact =/= Literature", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Historical Artifact =/= Literature&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg33g2v", "score_hidden": false, "stickied": false, "created": 1491880240.0, "created_utc": 1491851440.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3317w", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg31y7r", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3317w", "score_hidden": false, "stickied": false, "created": 1491879804.0, "created_utc": 1491851004.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg31y7r", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "TheDiscussionMan", "parent_id": "t1_dg2zrhv", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Even if the book was well-written, which it isn't, it still would't be literature. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even if the book was well-written, which it isn&amp;#39;t, it still would&amp;#39;t be literature. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg31y7r", "score_hidden": false, "stickied": false, "created": 1491878676.0, "created_utc": 1491849876.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg3entz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tammio", "parent_id": "t1_dg36erf", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I think you kind of miss the point here. OP selected a list of German literature. If it were British he'd mention The likes of Shakespeare and Dickens. A book like Mein Kampf has nothing to do with this; it could be written in the most beautifully language ever written (wich it definitely isn't) and it wouldn't  be literature. \n\nYou mention you want gritty reality? Check out some real gritty German  reality. Watch \"Das Leben der Anderen\". Read \"Die Blechtrommel\".  Check out Heinrich Heine. I'll even copy a poem of his in here. If you bother looking you will find translations in Google and musicalised versions on YouTube. My point is if all you ever read from Germany is Mein Kampf you have managed to pick the worst example of German writing there is.\n\nDie schlesischen Weber by Heinrich Heine\n\nIm düstern Auge keine Träne,\n\nSie sitzen am Webstuhl und fletschen die Zähne:\n\nDeutschland, wir weben dein Leichentuch,\n\nWir weben hinein den dreifachen Fluch -\n\nWir weben, wir weben! \n\n--\nEin Fluch dem Gotte, zu dem wir gebeten\n\nIn Winterskälte und Hungersnöten;\n\nWir haben vergebens gehofft und geharrt,\n\nEr hat uns geäfft und gefoppt und genarrt -\n\nWir weben, wir weben! \n\n---\n\nEin Fluch dem König, dem König der Reichen, \n\nDen unser Elend nicht konnte erweichen,\n\nDer den letzten Groschen von uns erpreßt\n\nUnd uns wie Hunde erschießen läßt -\n\nWir weben, wir weben! \n\n---\n\nEin Fluch dem falschen Vaterlande,\n\nWo nur gedeihen Schmach und Schande,\n\nWo jede Blume früh geknickt,\n\nWo Fäulnis und Moder den Wurm erquickt -\n\nWir weben, wir weben! \n\n---\n\nDas Schiffchen fliegt, der Webstuhl kracht,\n\nWir weben emsig Tag und Nacht -\n\nAltdeutschland, wir weben dein Leichentuch,\n\nWir weben hinein den dreifachen Fluch,\n\nWir weben, wir weben! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you kind of miss the point here. OP selected a list of German literature. If it were British he&amp;#39;d mention The likes of Shakespeare and Dickens. A book like Mein Kampf has nothing to do with this; it could be written in the most beautifully language ever written (wich it definitely isn&amp;#39;t) and it wouldn&amp;#39;t  be literature. &lt;/p&gt;\n\n&lt;p&gt;You mention you want gritty reality? Check out some real gritty German  reality. Watch &amp;quot;Das Leben der Anderen&amp;quot;. Read &amp;quot;Die Blechtrommel&amp;quot;.  Check out Heinrich Heine. I&amp;#39;ll even copy a poem of his in here. If you bother looking you will find translations in Google and musicalised versions on YouTube. My point is if all you ever read from Germany is Mein Kampf you have managed to pick the worst example of German writing there is.&lt;/p&gt;\n\n&lt;p&gt;Die schlesischen Weber by Heinrich Heine&lt;/p&gt;\n\n&lt;p&gt;Im düstern Auge keine Träne,&lt;/p&gt;\n\n&lt;p&gt;Sie sitzen am Webstuhl und fletschen die Zähne:&lt;/p&gt;\n\n&lt;p&gt;Deutschland, wir weben dein Leichentuch,&lt;/p&gt;\n\n&lt;p&gt;Wir weben hinein den dreifachen Fluch -&lt;/p&gt;\n\n&lt;p&gt;Wir weben, wir weben! &lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;Ein Fluch dem Gotte, zu dem wir gebeten&lt;/p&gt;\n\n&lt;p&gt;In Winterskälte und Hungersnöten;&lt;/p&gt;\n\n&lt;p&gt;Wir haben vergebens gehofft und geharrt,&lt;/p&gt;\n\n&lt;p&gt;Er hat uns geäfft und gefoppt und genarrt -&lt;/p&gt;\n\n&lt;p&gt;Wir weben, wir weben! &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Ein Fluch dem König, dem König der Reichen, &lt;/p&gt;\n\n&lt;p&gt;Den unser Elend nicht konnte erweichen,&lt;/p&gt;\n\n&lt;p&gt;Der den letzten Groschen von uns erpreßt&lt;/p&gt;\n\n&lt;p&gt;Und uns wie Hunde erschießen läßt -&lt;/p&gt;\n\n&lt;p&gt;Wir weben, wir weben! &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Ein Fluch dem falschen Vaterlande,&lt;/p&gt;\n\n&lt;p&gt;Wo nur gedeihen Schmach und Schande,&lt;/p&gt;\n\n&lt;p&gt;Wo jede Blume früh geknickt,&lt;/p&gt;\n\n&lt;p&gt;Wo Fäulnis und Moder den Wurm erquickt -&lt;/p&gt;\n\n&lt;p&gt;Wir weben, wir weben! &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Das Schiffchen fliegt, der Webstuhl kracht,&lt;/p&gt;\n\n&lt;p&gt;Wir weben emsig Tag und Nacht -&lt;/p&gt;\n\n&lt;p&gt;Altdeutschland, wir weben dein Leichentuch,&lt;/p&gt;\n\n&lt;p&gt;Wir weben hinein den dreifachen Fluch,&lt;/p&gt;\n\n&lt;p&gt;Wir weben, wir weben! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3entz", "score_hidden": false, "stickied": false, "created": 1491892611.0, "created_utc": 1491863811.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg36erf", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg3622l", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg36erf", "score_hidden": false, "stickied": false, "created": 1491883318.0, "created_utc": 1491854518.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64knhs", "likes": null, "replies": "", "user_reports": [], "id": "dg41v7c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reomc", "parent_id": "t1_dg367nz", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I suggest you get out to see the world a bit to cure your ignorance, brother! Mein Kampf is not only not reflective of Germany, it was forbidden to print or sell until just very recently and has sparked a very big debate when it's copyright ran out. There was a compromise to only print a version commented by political analysts. I have glanced into the book a few times, and honestly, it's poorly constructed and written, so even if I'd agree with it's political message, I'd rather not read it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suggest you get out to see the world a bit to cure your ignorance, brother! Mein Kampf is not only not reflective of Germany, it was forbidden to print or sell until just very recently and has sparked a very big debate when it&amp;#39;s copyright ran out. There was a compromise to only print a version commented by political analysts. I have glanced into the book a few times, and honestly, it&amp;#39;s poorly constructed and written, so even if I&amp;#39;d agree with it&amp;#39;s political message, I&amp;#39;d rather not read it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg41v7c", "score_hidden": false, "stickied": false, "created": 1491930695.0, "created_utc": 1491901895.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg367nz", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg3622l", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg367nz", "score_hidden": false, "stickied": false, "created": 1491883114.0, "created_utc": 1491854314.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3622l", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "tammio", "parent_id": "t1_dg2zrhv", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "1000 years of literary tradition you have to shoe in the political ravings of a madman? If you really try to reduce the complexities of German culture into that not even two decade long era, at least make an effort to mention actual literature instead of political \"philosophy\". Mention  the great films like \"Triumph des Willens\" or \"Tanz auf dem Vulkan\" or the songs of singers like Marlene Dietrich or so. \n\n\nIf however you mean a POLITICAL/ECONOMIC/PHILOSOPHICAL German booklist, sure you'll  have to mention Mein  Kampf. And Das Manifest der Kommunistischen Partei. And Wohlstand für  Alle. And Wilhelm von Humboldts \"ideen zu einem Versuch die Grenzen des Staates zu bestimmen\". Oh and mention thinkers like Kant and Haiek etc. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1000 years of literary tradition you have to shoe in the political ravings of a madman? If you really try to reduce the complexities of German culture into that not even two decade long era, at least make an effort to mention actual literature instead of political &amp;quot;philosophy&amp;quot;. Mention  the great films like &amp;quot;Triumph des Willens&amp;quot; or &amp;quot;Tanz auf dem Vulkan&amp;quot; or the songs of singers like Marlene Dietrich or so. &lt;/p&gt;\n\n&lt;p&gt;If however you mean a POLITICAL/ECONOMIC/PHILOSOPHICAL German booklist, sure you&amp;#39;ll  have to mention Mein  Kampf. And Das Manifest der Kommunistischen Partei. And Wohlstand für  Alle. And Wilhelm von Humboldts &amp;quot;ideen zu einem Versuch die Grenzen des Staates zu bestimmen&amp;quot;. Oh and mention thinkers like Kant and Haiek etc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg3622l", "score_hidden": false, "stickied": false, "created": 1491882955.0, "created_utc": 1491854155.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg2zrhv", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64knhs", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg2zrhv", "score_hidden": false, "stickied": false, "created": 1491876395.0, "created_utc": 1491847595.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]