[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "books", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi guys,&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve read different explanations about how our taste for food or music is developed through the years, especially if you start practicing them since you are very young. There is evidence in how  a musically educated person might only experiment physiological pleasure by listening to &amp;quot;complex&amp;quot; or mature music such as classical music; instead of something more &amp;quot;basic&amp;quot;. I was wondering if there was something similar for reading in terms of writing style and plot. Have you read/heard anything about this?&lt;/p&gt;\n\n&lt;p&gt;Thanks :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi guys,\n\nI've read different explanations about how our taste for food or music is developed through the years, especially if you start practicing them since you are very young. There is evidence in how  a musically educated person might only experiment physiological pleasure by listening to \"complex\" or mature music such as classical music; instead of something more \"basic\". I was wondering if there was something similar for reading in terms of writing style and plot. Have you read/heard anything about this?\n\nThanks :)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64tnte", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 25, "report_reasons": null, "author": "TiasNM", "saved": false, "mod_reports": [], "name": "t3_64tnte", "subreddit_name_prefixed": "r/books", "approved_by": null, "over_18": false, "domain": "self.books", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh4i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/books/comments/64tnte/is_there_any_study_that_shows_how_our_reading/", "num_reports": null, "locked": false, "stickied": false, "created": 1491972946.0, "url": "https://www.reddit.com/r/books/comments/64tnte/is_there_any_study_that_shows_how_our_reading/", "author_flair_text": null, "quarantine": false, "title": "Is there any study that shows how our reading preferences develop the more we read?", "created_utc": 1491944146.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64tnte", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64tnte", "likes": null, "replies": "", "user_reports": [], "id": "dg5xefj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TiasNM", "parent_id": "t1_dg5oywc", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Hi! I can look it up after work. What I remember from school (I'm a Psychologist in Argentina), is something about pattern recognition and prediction. It was something like: the more educated and experienced you are in music, the easiest it is to predict what's happening next in a \"simpler\" song. But, more \"complex\" music such as classical can be more unpredictable and exciting and for this kind of people, more enjoyable. \n\nEven though I'm just a statistically insignificant simple person, with basic music education: this happens to me very frequently. Whenever I listen to something more \"pop\", I can usually predict what's coming next and how they are going to do it. It feels formulaic and kind of boring. But with other genres, not necessarily only classic music, I enjoy it a lot more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! I can look it up after work. What I remember from school (I&amp;#39;m a Psychologist in Argentina), is something about pattern recognition and prediction. It was something like: the more educated and experienced you are in music, the easiest it is to predict what&amp;#39;s happening next in a &amp;quot;simpler&amp;quot; song. But, more &amp;quot;complex&amp;quot; music such as classical can be more unpredictable and exciting and for this kind of people, more enjoyable. &lt;/p&gt;\n\n&lt;p&gt;Even though I&amp;#39;m just a statistically insignificant simple person, with basic music education: this happens to me very frequently. Whenever I listen to something more &amp;quot;pop&amp;quot;, I can usually predict what&amp;#39;s coming next and how they are going to do it. It feels formulaic and kind of boring. But with other genres, not necessarily only classic music, I enjoy it a lot more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg5xefj", "score_hidden": false, "stickied": false, "created": 1492035919.0, "created_utc": 1492007119.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5oywc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deliciouschickenwing", "parent_id": "t3_64tnte", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I dont really have an opinion yet on this but what you said about musical tastes is interesting. Where could I find the study you are talking about?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dont really have an opinion yet on this but what you said about musical tastes is interesting. Where could I find the study you are talking about?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg5oywc", "score_hidden": false, "stickied": false, "created": 1492020614.0, "created_utc": 1491991814.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64tnte", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64tnte", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_64tnte", "likes": null, "replies": "", "user_reports": [], "id": "dg60rig", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Aistar", "parent_id": "t1_dg5xnd8", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Yes, pattern recognition definitely plays a part, I can clearly see that as the songs follow the curve of \"love\" from \"wow, I can listen to this one all day\", to \"OK, I love it, but maybe this time I can skip it\" to \"This song again? It's great, but we really need some time apart...\".\n\nOne thing that I noticed about my own music preferences is that there are some kinds of sound that just hook me, for example Beach Boys-like vocal harmonies, or the lower end of female vocal range, like Ella's voice, especially when she tries to imitate Louis Armstrong in that one verse of her version of \"Mack the Knife\". On the other hand, high \"academic\" female vocals, like those usually used in opera, annoy me to no end.\n\nActually, I think that for some reason I pay much more attention to voices than to instrumental part of music, which is why I usually don't like pure instrumentals (which includes almost all classic music, but various operas and cantatas, and most of high-brow jazz).\n\nAs I look back on the development of my music tastes, I don't see them getting much more complex, but rather broader. I constantly seek \"new\" sound, but I prefer it to be a lot like \"old\" sound, melodies I already love, and I see some clear borders which I just can't cross (for example, I can't cross from rock to metal - the emphasis on super-overdriven guitars and fast drumming turns me off).\n\nOn the other hand, I distinctly remember that it was hard for me to learn to love harder rock after 50's rock'n'roll. For example, when I first bought Creedence Clearwater Revival's self-titled first album, I thought it to be awful - too loud, too noisy! I listened to it two times, and then only came back to it later, after I got a gentler introduction to 70's rock via Slade's \"Nobody's Fools\" album. But I definitely learned to love CCR since then!\n\nWhat I'm trying to say with this rambling post (I love to talk about music too much), is that the development of music taste, in my opinion, requires (though body's reward mechanisms) not so much new complexity, as just fresh patterns that are ever so slightly different from the previous patterns. It does not necessary lead one to more complex music eventually, although, I suppose it's one of the possible ways. But the path of the music fan is guided closely by his favorite kinds of sound, and his dislikes. Where those come from is a different topic, but I think they even might be genetic, as well as acquired (I, for one, can't see anything in common between overdriven guitars and high female vocals, but the fact that I don't like either...).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, pattern recognition definitely plays a part, I can clearly see that as the songs follow the curve of &amp;quot;love&amp;quot; from &amp;quot;wow, I can listen to this one all day&amp;quot;, to &amp;quot;OK, I love it, but maybe this time I can skip it&amp;quot; to &amp;quot;This song again? It&amp;#39;s great, but we really need some time apart...&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;One thing that I noticed about my own music preferences is that there are some kinds of sound that just hook me, for example Beach Boys-like vocal harmonies, or the lower end of female vocal range, like Ella&amp;#39;s voice, especially when she tries to imitate Louis Armstrong in that one verse of her version of &amp;quot;Mack the Knife&amp;quot;. On the other hand, high &amp;quot;academic&amp;quot; female vocals, like those usually used in opera, annoy me to no end.&lt;/p&gt;\n\n&lt;p&gt;Actually, I think that for some reason I pay much more attention to voices than to instrumental part of music, which is why I usually don&amp;#39;t like pure instrumentals (which includes almost all classic music, but various operas and cantatas, and most of high-brow jazz).&lt;/p&gt;\n\n&lt;p&gt;As I look back on the development of my music tastes, I don&amp;#39;t see them getting much more complex, but rather broader. I constantly seek &amp;quot;new&amp;quot; sound, but I prefer it to be a lot like &amp;quot;old&amp;quot; sound, melodies I already love, and I see some clear borders which I just can&amp;#39;t cross (for example, I can&amp;#39;t cross from rock to metal - the emphasis on super-overdriven guitars and fast drumming turns me off).&lt;/p&gt;\n\n&lt;p&gt;On the other hand, I distinctly remember that it was hard for me to learn to love harder rock after 50&amp;#39;s rock&amp;#39;n&amp;#39;roll. For example, when I first bought Creedence Clearwater Revival&amp;#39;s self-titled first album, I thought it to be awful - too loud, too noisy! I listened to it two times, and then only came back to it later, after I got a gentler introduction to 70&amp;#39;s rock via Slade&amp;#39;s &amp;quot;Nobody&amp;#39;s Fools&amp;quot; album. But I definitely learned to love CCR since then!&lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m trying to say with this rambling post (I love to talk about music too much), is that the development of music taste, in my opinion, requires (though body&amp;#39;s reward mechanisms) not so much new complexity, as just fresh patterns that are ever so slightly different from the previous patterns. It does not necessary lead one to more complex music eventually, although, I suppose it&amp;#39;s one of the possible ways. But the path of the music fan is guided closely by his favorite kinds of sound, and his dislikes. Where those come from is a different topic, but I think they even might be genetic, as well as acquired (I, for one, can&amp;#39;t see anything in common between overdriven guitars and high female vocals, but the fact that I don&amp;#39;t like either...).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg60rig", "score_hidden": false, "stickied": false, "created": 1492039730.0, "created_utc": 1492010930.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5xnd8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TiasNM", "parent_id": "t1_dg5wtv2", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Hi! I'm going to copy/paste something I just answered because I'm at work but I can keep chatting about it later. \n\n---\nWhat I remember from school (I'm a Psychologist in Argentina), is something about pattern recognition and prediction. It was something like: the more educated and experienced you are in music, the easiest it is to predict what's happening next in a \"simpler\" song. But, more \"complex\" music such as classical can be more unpredictable and exciting and for this kind of people, more enjoyable.\n\nEven though I'm just a statistically insignificant simple person, with basic music education: this happens to me very frequently. Whenever I listen to something more \"pop\", I can usually predict what's coming next and how they are going to do it. It feels formulaic and kind of boring. But with other genres, not necessarily only classic music, I enjoy it a lot more.\n\n---\nI think that the music you are describing probably falls into the vague category of \"complex\" music, while there are probably scales of \"complexity\" I think \"simple\" music is something like generic pop music. I enjoy a lot of different styles of music but I think what \"excites\" me the most is progressive rock/metal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! I&amp;#39;m going to copy/paste something I just answered because I&amp;#39;m at work but I can keep chatting about it later. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;What I remember from school (I&amp;#39;m a Psychologist in Argentina), is something about pattern recognition and prediction. It was something like: the more educated and experienced you are in music, the easiest it is to predict what&amp;#39;s happening next in a &amp;quot;simpler&amp;quot; song. But, more &amp;quot;complex&amp;quot; music such as classical can be more unpredictable and exciting and for this kind of people, more enjoyable.&lt;/p&gt;\n\n&lt;p&gt;Even though I&amp;#39;m just a statistically insignificant simple person, with basic music education: this happens to me very frequently. Whenever I listen to something more &amp;quot;pop&amp;quot;, I can usually predict what&amp;#39;s coming next and how they are going to do it. It feels formulaic and kind of boring. But with other genres, not necessarily only classic music, I enjoy it a lot more.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I think that the music you are describing probably falls into the vague category of &amp;quot;complex&amp;quot; music, while there are probably scales of &amp;quot;complexity&amp;quot; I think &amp;quot;simple&amp;quot; music is something like generic pop music. I enjoy a lot of different styles of music but I think what &amp;quot;excites&amp;quot; me the most is progressive rock/metal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg5xnd8", "score_hidden": false, "stickied": false, "created": 1492036215.0, "created_utc": 1492007415.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wtv2", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Aistar", "parent_id": "t3_64tnte", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I heard many times that classical music is an acquired taste, but I just don't know... Personally, I started with singers-songwriters (Russian \"bards\"), then move to a mix of disco an swing jazz, then discovered 50's rock'n'roll and only later got into harder rock. Still can't listen to much of classical music or complex (and boring) jazz that replaced swing in 50's.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I heard many times that classical music is an acquired taste, but I just don&amp;#39;t know... Personally, I started with singers-songwriters (Russian &amp;quot;bards&amp;quot;), then move to a mix of disco an swing jazz, then discovered 50&amp;#39;s rock&amp;#39;n&amp;#39;roll and only later got into harder rock. Still can&amp;#39;t listen to much of classical music or complex (and boring) jazz that replaced swing in 50&amp;#39;s.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg5wtv2", "score_hidden": false, "stickied": false, "created": 1492035233.0, "created_utc": 1492006433.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]