[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "books", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Since 2014 (the year I graduated high school), I&amp;#39;ve been having a host of mental health problems, which caused me to not be able to read. The concentration I earned from elementary school through high school had been completely obliterated, I couldn&amp;#39;t even finish a book, and when I did, it took me almost a year. Currently I&amp;#39;m trying to read &lt;em&gt;A Clash of Kings, Pride and Prejudice, As I Lay Dying, and Tess of the D&amp;#39;Urbervilles.&lt;/em&gt; They aren&amp;#39;t hard books to read, I&amp;#39;m just concerned with my current reading stamina. I used to be able to read all day, in fact, when I was in classes I didn&amp;#39;t care for, I just read the whole time. It seems like a stupid question, I know, but how does one get that kind of stamina back? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Since 2014 (the year I graduated high school), I've been having a host of mental health problems, which caused me to not be able to read. The concentration I earned from elementary school through high school had been completely obliterated, I couldn't even finish a book, and when I did, it took me almost a year. Currently I'm trying to read *A Clash of Kings, Pride and Prejudice, As I Lay Dying, and Tess of the D'Urbervilles.* They aren't hard books to read, I'm just concerned with my current reading stamina. I used to be able to read all day, in fact, when I was in classes I didn't care for, I just read the whole time. It seems like a stupid question, I know, but how does one get that kind of stamina back? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657236", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "dylanfurr246", "saved": false, "mod_reports": [], "name": "t3_657236", "subreddit_name_prefixed": "r/books", "approved_by": null, "over_18": false, "domain": "self.books", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh4i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "reread", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/books/comments/657236/how_do_you_get_your_reading_stamina_back_after/", "num_reports": null, "locked": false, "stickied": false, "created": 1492134425.0, "url": "https://www.reddit.com/r/books/comments/657236/how_do_you_get_your_reading_stamina_back_after/", "author_flair_text": "Absalom Absalom!", "quarantine": false, "title": "How do you get your reading stamina back after years of mental health problems?", "created_utc": 1492105625.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg80x0j", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "nothingcleverleft", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I went through something like this. I am at work right now, so I am typing this as fast as I can, so please excuse any melodrama or errors. If this is the wrong place for a life story, please downvote and move on. I only want to share my experience for anyone going through something like I have. \n\nIt took me a long time to get to where I am now, and it was at times very frustrating. I was a good reader, and overall a somewhat-talented person throughout my youth. Then the issues started. I was diagnosed as bi-polar, Obsessive Compulsive, and manic depressive. I have Panic Disorder and one therapist even said I show some early signs of schizophrenia (nothing, in my opinion at least, has come of this - I met with her  *twice*, though I am still prone to delusions and extreme paranoia, so I keep a close eye on it.)\n\nAfter trying more medication than I could list here, with little to no results, I gave up on the professionals, and opted to self-medicate. I spent 6 years addicted to heroin, 3 of which I was also addicted to methamphetamine. I was homeless for just under two years, and made my way by stealing items from various stores, and returning them for store credit, just to eat. I was an objectively bad person. I sold drugs, and still wasn't able to control my habit. I have a few suicide attempts under my belt, and one 18 day stay in a mental institution. I went to meetings, rehabs, spiritual counselors, and begged every family member and friend for forgiveness until it lost all meaning.  \n\nThe last - and hopefully final - time I kicked was by far the worst. I could barely move for days, and the sickness felt like having the flu, a terrible cold, migraines worse than I could describe, chills, major depression, and more sore in every part of my body than after my first weight-lifting session. After the worst had passed, I decided to try reading again. Years before, I loved books. I wanted to write, and I would dream of having read every book in the world by the time I grew up. Instead, I spent most of my late-teens and early-twenties high, homeless, friendless, and knowing I'd be dead before I hit 30. \n\nI picked Malazan Book of the Fallen, because it seemed to be loved by fantasy fans, and I wanted something like ASoIaF, which I had loved when I was young. I fell in love with reading again. I cried - truly cried - for the first time in a very long time. I laughed as well, I had forgotten what that felt like. It was incredibly freeing and enlightening to realize I could still feel. I became addicted (what can I say, it's in my blood) to reading. I picked up Infinite Jest, knowing it explored some of the issues I had been dealing with, and that was the nail in the coffin. I have dedicated my life to reading and writing now, and though my mind has been more destroyed than most, I can feel myself getting better every single day. I move on to harder and harder books every week, and they get easier every time. I have a fiance that I love. I read every day for at least three hours, and try to write at least one sentence a day, even if it's shit. My family has accepted me again, and I have even made a few friends - while sober, if you can believe it. I am starting to enjoy life again, a little more every day, and reading has been a huge part of that.  \n\nYou can recover from anything, and it does get easier, it just takes time. \n\nI have this quote from David Foster Wallace as my phone background, and it is helpful at times. \n\n\"There's been time this whole time. You can't kill time with your heart. Everything takes time. Bees have to move very fast to stay still.\"", "edited": 1492110707.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went through something like this. I am at work right now, so I am typing this as fast as I can, so please excuse any melodrama or errors. If this is the wrong place for a life story, please downvote and move on. I only want to share my experience for anyone going through something like I have. &lt;/p&gt;\n\n&lt;p&gt;It took me a long time to get to where I am now, and it was at times very frustrating. I was a good reader, and overall a somewhat-talented person throughout my youth. Then the issues started. I was diagnosed as bi-polar, Obsessive Compulsive, and manic depressive. I have Panic Disorder and one therapist even said I show some early signs of schizophrenia (nothing, in my opinion at least, has come of this - I met with her  &lt;em&gt;twice&lt;/em&gt;, though I am still prone to delusions and extreme paranoia, so I keep a close eye on it.)&lt;/p&gt;\n\n&lt;p&gt;After trying more medication than I could list here, with little to no results, I gave up on the professionals, and opted to self-medicate. I spent 6 years addicted to heroin, 3 of which I was also addicted to methamphetamine. I was homeless for just under two years, and made my way by stealing items from various stores, and returning them for store credit, just to eat. I was an objectively bad person. I sold drugs, and still wasn&amp;#39;t able to control my habit. I have a few suicide attempts under my belt, and one 18 day stay in a mental institution. I went to meetings, rehabs, spiritual counselors, and begged every family member and friend for forgiveness until it lost all meaning.  &lt;/p&gt;\n\n&lt;p&gt;The last - and hopefully final - time I kicked was by far the worst. I could barely move for days, and the sickness felt like having the flu, a terrible cold, migraines worse than I could describe, chills, major depression, and more sore in every part of my body than after my first weight-lifting session. After the worst had passed, I decided to try reading again. Years before, I loved books. I wanted to write, and I would dream of having read every book in the world by the time I grew up. Instead, I spent most of my late-teens and early-twenties high, homeless, friendless, and knowing I&amp;#39;d be dead before I hit 30. &lt;/p&gt;\n\n&lt;p&gt;I picked Malazan Book of the Fallen, because it seemed to be loved by fantasy fans, and I wanted something like ASoIaF, which I had loved when I was young. I fell in love with reading again. I cried - truly cried - for the first time in a very long time. I laughed as well, I had forgotten what that felt like. It was incredibly freeing and enlightening to realize I could still feel. I became addicted (what can I say, it&amp;#39;s in my blood) to reading. I picked up Infinite Jest, knowing it explored some of the issues I had been dealing with, and that was the nail in the coffin. I have dedicated my life to reading and writing now, and though my mind has been more destroyed than most, I can feel myself getting better every single day. I move on to harder and harder books every week, and they get easier every time. I have a fiance that I love. I read every day for at least three hours, and try to write at least one sentence a day, even if it&amp;#39;s shit. My family has accepted me again, and I have even made a few friends - while sober, if you can believe it. I am starting to enjoy life again, a little more every day, and reading has been a huge part of that.  &lt;/p&gt;\n\n&lt;p&gt;You can recover from anything, and it does get easier, it just takes time. &lt;/p&gt;\n\n&lt;p&gt;I have this quote from David Foster Wallace as my phone background, and it is helpful at times. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;There&amp;#39;s been time this whole time. You can&amp;#39;t kill time with your heart. Everything takes time. Bees have to move very fast to stay still.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg80x0j", "score_hidden": false, "stickied": false, "created": 1492138352.0, "created_utc": 1492109552.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg80775", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dylanfurr246", "parent_id": "t1_dg7xzxe", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Thanks! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg80775", "score_hidden": false, "stickied": false, "created": 1492137584.0, "created_utc": 1492108784.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xzxe", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "tking191919", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "It doesn't seem like a strange question to me :-) I'm a lifelong drug addict bi polar crazy person who loves to read.  I've certainly gone in phases where focus and the ability to digest what I'm reading at a fundamental level.. ping pong all over the place.  One day I'm deeply, yet joyfully laboring over The World as Will and Representation.  The next I can't even make it more than five sentences through a rudimentary article in the newspaper.  And the cloud of intellectual despair hath rendered me useless.  \n\nNow if I stay sober and healthy... my focus, concentration, retainability, and dissection of what I'm reading is astronomically better.  \n\nBut as far as what to do when you do find yourself in a similar zone?  Read something different.  Read something short, complete and more accessible.  An article, perhaps.  Or a non-fiction book with easily separable chapters.  It's tough, but I've found it is still very useful to keep the brain moving.  Plus I like non-fiction here because then I can possibly learn something that excites me, and that excitement alone can combat the fatigue.  Finally.. in this situation... I just like reading things I can complete in that sitting.  A complete article, or chapter.  One full digestible.. whatever.  I can't say exactly why, but it makes me feel like I was mentally useful.  Keeps this image alive of progressing through the fog.  If you keep doing these things, you may find it gets easier in general.  And you can parlay that into more reading of what you're really interested in.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t seem like a strange question to me :-) I&amp;#39;m a lifelong drug addict bi polar crazy person who loves to read.  I&amp;#39;ve certainly gone in phases where focus and the ability to digest what I&amp;#39;m reading at a fundamental level.. ping pong all over the place.  One day I&amp;#39;m deeply, yet joyfully laboring over The World as Will and Representation.  The next I can&amp;#39;t even make it more than five sentences through a rudimentary article in the newspaper.  And the cloud of intellectual despair hath rendered me useless.  &lt;/p&gt;\n\n&lt;p&gt;Now if I stay sober and healthy... my focus, concentration, retainability, and dissection of what I&amp;#39;m reading is astronomically better.  &lt;/p&gt;\n\n&lt;p&gt;But as far as what to do when you do find yourself in a similar zone?  Read something different.  Read something short, complete and more accessible.  An article, perhaps.  Or a non-fiction book with easily separable chapters.  It&amp;#39;s tough, but I&amp;#39;ve found it is still very useful to keep the brain moving.  Plus I like non-fiction here because then I can possibly learn something that excites me, and that excitement alone can combat the fatigue.  Finally.. in this situation... I just like reading things I can complete in that sitting.  A complete article, or chapter.  One full digestible.. whatever.  I can&amp;#39;t say exactly why, but it makes me feel like I was mentally useful.  Keeps this image alive of progressing through the fog.  If you keep doing these things, you may find it gets easier in general.  And you can parlay that into more reading of what you&amp;#39;re really interested in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg7xzxe", "score_hidden": false, "stickied": false, "created": 1492135238.0, "created_utc": 1492106438.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg807u6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TeikaDunmora", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I've been through the same thing, couldn't even attempt a book.\n\nI use audiobooks, either alone or with the text. Sometimes it's nice to get into a story without having to work at reading, sometimes hearing it is like someone pushing you when you're learning to cycle - once you get the momentum, you can happily do the rest yourself.\n\nPush yourself to read your current books regularly, even if it's just a paragraph. A neglected book quickly turns into a book you feel guilty about, avoid, feel worse about, etc.\n\nBut do take it easy. If you had given up running for a while, you wouldn't try to immediately run a marathon. Try short story collections, mindless junk food books, as well your usual preferences.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been through the same thing, couldn&amp;#39;t even attempt a book.&lt;/p&gt;\n\n&lt;p&gt;I use audiobooks, either alone or with the text. Sometimes it&amp;#39;s nice to get into a story without having to work at reading, sometimes hearing it is like someone pushing you when you&amp;#39;re learning to cycle - once you get the momentum, you can happily do the rest yourself.&lt;/p&gt;\n\n&lt;p&gt;Push yourself to read your current books regularly, even if it&amp;#39;s just a paragraph. A neglected book quickly turns into a book you feel guilty about, avoid, feel worse about, etc.&lt;/p&gt;\n\n&lt;p&gt;But do take it easy. If you had given up running for a while, you wouldn&amp;#39;t try to immediately run a marathon. Try short story collections, mindless junk food books, as well your usual preferences.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg807u6", "score_hidden": false, "stickied": false, "created": 1492137603.0, "created_utc": 1492108803.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg81j4v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "amity_", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Meditate. Ok yes it's the cliche advice everyone will give you. But it really works if you let it. Sit and think about nothing, your breath, whatever. Whenever stray thoughts enter your head, as they undoubtedly will, recognize them, then go back to the breath. Do this for 10 or 15 minutes a day, come hell or high water. Because you definitely won't always feel like it when watching netflix or playing games or browsing reddit is so much easier...\n\nYou'll be training your mind to stay present and on task in all things you do, and in my experience it will translate to much better reading sessions. Of course you can also do the same sort of thing while actually reading. Just stay focused on the book and brush off any pesky thoughts that enter your head. No excuses, just do it. It's like making yourself go to the gym even though you know it's going to hurt.\n\n\nThere are many resources, books, guided meditations out there that can help you get started practicing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Meditate. Ok yes it&amp;#39;s the cliche advice everyone will give you. But it really works if you let it. Sit and think about nothing, your breath, whatever. Whenever stray thoughts enter your head, as they undoubtedly will, recognize them, then go back to the breath. Do this for 10 or 15 minutes a day, come hell or high water. Because you definitely won&amp;#39;t always feel like it when watching netflix or playing games or browsing reddit is so much easier...&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll be training your mind to stay present and on task in all things you do, and in my experience it will translate to much better reading sessions. Of course you can also do the same sort of thing while actually reading. Just stay focused on the book and brush off any pesky thoughts that enter your head. No excuses, just do it. It&amp;#39;s like making yourself go to the gym even though you know it&amp;#39;s going to hurt.&lt;/p&gt;\n\n&lt;p&gt;There are many resources, books, guided meditations out there that can help you get started practicing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg81j4v", "score_hidden": false, "stickied": false, "created": 1492139019.0, "created_utc": 1492110219.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg81vn0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "akka-akka", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "The best thing, no matter how hard it is, is to try and be as healthy as possible. I have problems with depression, anxiety etc., so I had to give up alcohol and now I try to do some exercise everyday, meditate etc., Even when I'm maintaining a perfect schedule and diet, I still have days where I can't concentrate on my reading or my writing or my job. My suggestion is more a comment: this will pass. If not, talk to a therapist about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best thing, no matter how hard it is, is to try and be as healthy as possible. I have problems with depression, anxiety etc., so I had to give up alcohol and now I try to do some exercise everyday, meditate etc., Even when I&amp;#39;m maintaining a perfect schedule and diet, I still have days where I can&amp;#39;t concentrate on my reading or my writing or my job. My suggestion is more a comment: this will pass. If not, talk to a therapist about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg81vn0", "score_hidden": false, "stickied": false, "created": 1492139403.0, "created_utc": 1492110603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg8euwd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "overactive-bladder", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "by reading depressing books. i somehow feel comfort and peace when i read through them. heck i even ate up \"girl on the train\" in 2 days because of the dark moody narrator. and it was my first book after 4 years of nothingness.\n\non the other hand, i really got into locked room and impossible mysteries lately and wanted to document as many summaries as i could. so i got a notebook and am jolting down scenarios as i read books. it gives me a purpose and a clear objective to keep going. sometimes a goal is all we need to set to pull through the lull.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;by reading depressing books. i somehow feel comfort and peace when i read through them. heck i even ate up &amp;quot;girl on the train&amp;quot; in 2 days because of the dark moody narrator. and it was my first book after 4 years of nothingness.&lt;/p&gt;\n\n&lt;p&gt;on the other hand, i really got into locked room and impossible mysteries lately and wanted to document as many summaries as i could. so i got a notebook and am jolting down scenarios as i read books. it gives me a purpose and a clear objective to keep going. sometimes a goal is all we need to set to pull through the lull.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg8euwd", "score_hidden": false, "stickied": false, "created": 1492154971.0, "created_utc": 1492126171.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg9lkd9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "strawberrybluecat", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I went from being an avid reader to stopping completely for a few years and had the exact same problem! Adult short stories / novellas can be a great re-introduction / concentration practice for reading as you can get the buzz of exploring and finishing a story without the slog to finish an epic. Revisiting books or series you read as a teen was also a great practice for me as you can re-visit old favourite characters and gain extra insight into the books. I also liked finishing series that I'd started as a teenager but wasn't able to finish at that time for various reasons (the sequel hadn't been published yet / my library didn't have a copy ect.)\n\nSome of the shorter books I've read in my get-back-into-reading phase are:\nThe Penelopiad by Margaret Atwood (I do have mixed feelings about this one though), The Invisible Man by Ralph Ellison, The Pumpkin Eater by Penelope Mortimer and Roald Dahls collection of adult short stories.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went from being an avid reader to stopping completely for a few years and had the exact same problem! Adult short stories / novellas can be a great re-introduction / concentration practice for reading as you can get the buzz of exploring and finishing a story without the slog to finish an epic. Revisiting books or series you read as a teen was also a great practice for me as you can re-visit old favourite characters and gain extra insight into the books. I also liked finishing series that I&amp;#39;d started as a teenager but wasn&amp;#39;t able to finish at that time for various reasons (the sequel hadn&amp;#39;t been published yet / my library didn&amp;#39;t have a copy ect.)&lt;/p&gt;\n\n&lt;p&gt;Some of the shorter books I&amp;#39;ve read in my get-back-into-reading phase are:\nThe Penelopiad by Margaret Atwood (I do have mixed feelings about this one though), The Invisible Man by Ralph Ellison, The Pumpkin Eater by Penelope Mortimer and Roald Dahls collection of adult short stories.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg9lkd9", "score_hidden": false, "stickied": false, "created": 1492226045.0, "created_utc": 1492197245.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg8ber4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MeesaClumsie", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "- Start with something that has a simple fast plot - maybe teen-aimed fantasy (theres some good ones out there)\n\n- read something that you feel excited about\n\n- try an interesting non fiction, they can be easier because you dont have to follow a story...browse the bookstore and see what grabs you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Start with something that has a simple fast plot - maybe teen-aimed fantasy (theres some good ones out there)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;read something that you feel excited about&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;try an interesting non fiction, they can be easier because you dont have to follow a story...browse the bookstore and see what grabs you&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg8ber4", "score_hidden": false, "stickied": false, "created": 1492150386.0, "created_utc": 1492121586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg8fgwa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "readerf52", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I go through times when I just can't concentrate, for whatever reason.  Sometimes I'm sick, sometimes I'm bored, sometimes I'm just restless.  The best thing for me is to reread something that fits that mood.  There are some books that will make me cry my heart out--I literally sob out loud at the last 20 pages or so of Pay it Forward--and that often relieves an undercurrent of sadness I don't understand.  Anything by Terry Pratchett will make me laugh out loud.  And sometimes just sitting with The Tao of Pooh...yes, that's Winnie the Pooh, makes me consider my life, where I'm going, what I want.  \n\nSomething like that will get me through until I find a new author I love and devour everything they've written, and then I have to go through some funk until I find another.\n\nI'm not sure that is exactly your case, but maybe something will click for you.  I just have to say Kudos to you for slogging through this.  It's not easy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I go through times when I just can&amp;#39;t concentrate, for whatever reason.  Sometimes I&amp;#39;m sick, sometimes I&amp;#39;m bored, sometimes I&amp;#39;m just restless.  The best thing for me is to reread something that fits that mood.  There are some books that will make me cry my heart out--I literally sob out loud at the last 20 pages or so of Pay it Forward--and that often relieves an undercurrent of sadness I don&amp;#39;t understand.  Anything by Terry Pratchett will make me laugh out loud.  And sometimes just sitting with The Tao of Pooh...yes, that&amp;#39;s Winnie the Pooh, makes me consider my life, where I&amp;#39;m going, what I want.  &lt;/p&gt;\n\n&lt;p&gt;Something like that will get me through until I find a new author I love and devour everything they&amp;#39;ve written, and then I have to go through some funk until I find another.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure that is exactly your case, but maybe something will click for you.  I just have to say Kudos to you for slogging through this.  It&amp;#39;s not easy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg8fgwa", "score_hidden": false, "stickied": false, "created": 1492155763.0, "created_utc": 1492126963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg8y4zp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "robgraves", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "I'm 37 and I have bipolar disorder, and I've noticed over the years that I go through phases with reading.  Sometimes I can burn through book after book after book, other times I can barely get through a few pages.  I think what's helped me out in getting back into reading is to diversify what I'm reading and also to make sure its something I really want to read.  If I'm reading something because I feel I should or someone else recommended it and it doesn't grab me, then it might not be a book for me.  Also I sometimes switch between reading 1000 page novels, like Stephen King or something along those lines, to reading programming books like C programming which are more \"this is how this works, now try this bit of code\" so I'm reading and then demonstrating by actually doing something, this I've classified as \"reading to learn how to do something\" which is a different type of reading than say reading a novel.  Then lastly, I don't feel I necessarily have to conquer a huge 1000 page novel or a 1000 page C++ programming book, I can do lighter reading too, which might mean short stories, it might mean magazine articles, or things like \"The Cartoon History of the Universe\" by Larry Gonick.  I don't care.  Whatever strikes my interest at the time.  Sometimes I have years where I barely do any intensive reading.  Other years I go through novels as if they are running out.  Although reading something huge isn't necessarily hard if you digest it in small pieces.  I had a professor use to say to us, \"How do you eat an elephant? One bite at a time.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 37 and I have bipolar disorder, and I&amp;#39;ve noticed over the years that I go through phases with reading.  Sometimes I can burn through book after book after book, other times I can barely get through a few pages.  I think what&amp;#39;s helped me out in getting back into reading is to diversify what I&amp;#39;m reading and also to make sure its something I really want to read.  If I&amp;#39;m reading something because I feel I should or someone else recommended it and it doesn&amp;#39;t grab me, then it might not be a book for me.  Also I sometimes switch between reading 1000 page novels, like Stephen King or something along those lines, to reading programming books like C programming which are more &amp;quot;this is how this works, now try this bit of code&amp;quot; so I&amp;#39;m reading and then demonstrating by actually doing something, this I&amp;#39;ve classified as &amp;quot;reading to learn how to do something&amp;quot; which is a different type of reading than say reading a novel.  Then lastly, I don&amp;#39;t feel I necessarily have to conquer a huge 1000 page novel or a 1000 page C++ programming book, I can do lighter reading too, which might mean short stories, it might mean magazine articles, or things like &amp;quot;The Cartoon History of the Universe&amp;quot; by Larry Gonick.  I don&amp;#39;t care.  Whatever strikes my interest at the time.  Sometimes I have years where I barely do any intensive reading.  Other years I go through novels as if they are running out.  Although reading something huge isn&amp;#39;t necessarily hard if you digest it in small pieces.  I had a professor use to say to us, &amp;quot;How do you eat an elephant? One bite at a time.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg8y4zp", "score_hidden": false, "stickied": false, "created": 1492189600.0, "created_utc": 1492160800.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg8yuft", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Everlastinglol", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "love what you read. its for fun after all", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;love what you read. its for fun after all&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg8yuft", "score_hidden": false, "stickied": false, "created": 1492191904.0, "created_utc": 1492163104.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4i", "removal_reason": null, "link_id": "t3_657236", "likes": null, "replies": "", "user_reports": [], "id": "dg97v73", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Comedynerd", "parent_id": "t3_657236", "subreddit_name_prefixed": "r/books", "controversiality": 0, "body": "Set daily page goals and break it up into smaller, manageable chunks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Set daily page goals and break it up into smaller, manageable chunks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "books", "name": "t1_dg97v73", "score_hidden": false, "stickied": false, "created": 1492210026.0, "created_utc": 1492181226.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]