[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "personalfinance", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Please forgive if this is the wrong place, but my heart sank when reading the post about the young man who has been busting his ass to pay off debt for years, but still has an $86G student debt. I know his feeling and was there myself.&lt;/p&gt;\n\n&lt;p&gt;Let us travel back in time 20 years. I was a happily married man with two kids, a beautiful wife, 10 acres in the country, a 3 bedroom ranch and a garage with all the tools a man needs and several he doesn&amp;#39;t, a kick ass truck, riding lawn mower and guns. I was 35 years old and the world was mine. The little woman and I both had good jobs, she a line supervisor at a factory and me a sports editor. We each had our own vehicles and were the middle-est of middle class. My credit score was so high, it had to take a urine test every time I needed it.&lt;/p&gt;\n\n&lt;p&gt;Five years later, my credit score was lower than a dog&amp;#39;s ass scraping on the carpet. The short story is: divorce. Followed by a shit ton of bad decisions with a soon-to-be second ex.&lt;/p&gt;\n\n&lt;p&gt;My two kids, who I had custody of, and I ended up homeless for a week. We were finally barely able to secure an apartment, a two bedroom on the outskirts of town, but we had shelter. Two of the things my second ex had going for her, aside from her physical flexibility, was the ability to lie her ass off about where my paychecks were going and racking up credit card debts in my name. I am not a smart man and was slow to get to the point where I divorced her, but I was too late. &lt;/p&gt;\n\n&lt;p&gt;There I was, broke as hell. I had to hock my Canon camera equipment to have enough money to feed us for a week. It was so bad, the Christmas tree was a Christmas Pole with two strings of lights we couldn&amp;#39;t afford to keep lit, and the gifts were crap that weren&amp;#39;t wrapped. I hit a low so bad I broke the law, rationalizing that it was the only thing I could do to get by for another week. Thank God I didn&amp;#39;t get caught.&lt;/p&gt;\n\n&lt;p&gt;The stress of worry gnawed at me. My sleep suffered, the only reason I didn&amp;#39;t gain weight was because I didn&amp;#39;t have food in the house most of the time. I had nothing and my thoughts often went to how easy it would be to just GTFO.&lt;/p&gt;\n\n&lt;p&gt;Like I said, I am not a smart man. I&amp;#39;m not good looking or a relation to anyone with money. The law breaking scared me so bad, I think I poo-ed myself a little when I finally realized where I was in life and how close I came to spending five years locked up. I may not be a handsome man, but I&amp;#39;m too pretty and frail for prison and I&amp;#39;m rather fond of my kids and enjoy seeing them regularly.&lt;/p&gt;\n\n&lt;p&gt;Rock bottom was the thought that no one was going to help me. At some point, I realized, I shouldered all the responsibility for me. I called myself a pussy, grabbed myself by the scruff of the neck and told myself to grow up. It took me more than nine years to do finish the job.&lt;/p&gt;\n\n&lt;p&gt;It seems like life may have passed me by because I spent every extra cent on paying off all those debts. I gave up nights out with friends and vacations, new toys and new clothes I didn&amp;#39;t need.&lt;/p&gt;\n\n&lt;p&gt;It is worth it.&lt;/p&gt;\n\n&lt;p&gt;Now, at middle age, everything is paid off. My kids are grown and working at jobs. Having kids grow up while I supervised was so much fun, I got a couple more rental kids, one from Norway, the other from Hungary. I also took in a couple of strays who shared our home for a while when they needed shelter. It is fricking amazing to see kids who others gave up on become doctors and engineers, teachers and supervisors.&lt;/p&gt;\n\n&lt;p&gt;What do I have? A modular home in a park. It&amp;#39;s not a mansion, needs new carpet and some work on the vinyl siding. I drive an old truck that needs work, but I can do it with the few tools I have in my shed. My vacation are mission trips to Kenya and Dominican Republic to build houses and teach. My bills are paid now and I sleep well, except for the prostate bullshit that comes with age. What I thought I was missing out on in life, wasn&amp;#39;t what I found was important and fulfilling. I&amp;#39;m a minimalist by nature I guess. I don&amp;#39;t need all the things I thought I wanted.&lt;/p&gt;\n\n&lt;p&gt;I sleep well. I don&amp;#39;t worry about the bills I can&amp;#39;t pay because I have paid off every last one of them. It took  more than nine years of being broke, but I did it and you can too. I can&amp;#39;t guarantee you&amp;#39;ll be happy, but it feels gooder to not have bills than it does to have them hanging around your neck like heavy cow bells, banging continually reminding you they are there. At the time, the nine years felt like forever and I wanted to quit so many times, but looking back, oh wait, it did suck, but it was worth it to get where I am happy today. I know the $86g looks insurmountable, but I hope you don&amp;#39;t throw away all of your hard work in getting this far, just for a short term of spending. &lt;/p&gt;\n\n&lt;p&gt;Take it from an old man who&amp;#39;s probably not long for this world. Pay off everything you can as soon as you can, because there will come a day when the cow bells will be off and freedom will feel so much more sweeter.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Please forgive if this is the wrong place, but my heart sank when reading the post about the young man who has been busting his ass to pay off debt for years, but still has an $86G student debt. I know his feeling and was there myself.\n\nLet us travel back in time 20 years. I was a happily married man with two kids, a beautiful wife, 10 acres in the country, a 3 bedroom ranch and a garage with all the tools a man needs and several he doesn't, a kick ass truck, riding lawn mower and guns. I was 35 years old and the world was mine. The little woman and I both had good jobs, she a line supervisor at a factory and me a sports editor. We each had our own vehicles and were the middle-est of middle class. My credit score was so high, it had to take a urine test every time I needed it.\n\nFive years later, my credit score was lower than a dog's ass scraping on the carpet. The short story is: divorce. Followed by a shit ton of bad decisions with a soon-to-be second ex.\n\nMy two kids, who I had custody of, and I ended up homeless for a week. We were finally barely able to secure an apartment, a two bedroom on the outskirts of town, but we had shelter. Two of the things my second ex had going for her, aside from her physical flexibility, was the ability to lie her ass off about where my paychecks were going and racking up credit card debts in my name. I am not a smart man and was slow to get to the point where I divorced her, but I was too late. \n\nThere I was, broke as hell. I had to hock my Canon camera equipment to have enough money to feed us for a week. It was so bad, the Christmas tree was a Christmas Pole with two strings of lights we couldn't afford to keep lit, and the gifts were crap that weren't wrapped. I hit a low so bad I broke the law, rationalizing that it was the only thing I could do to get by for another week. Thank God I didn't get caught.\n\nThe stress of worry gnawed at me. My sleep suffered, the only reason I didn't gain weight was because I didn't have food in the house most of the time. I had nothing and my thoughts often went to how easy it would be to just GTFO.\n\nLike I said, I am not a smart man. I'm not good looking or a relation to anyone with money. The law breaking scared me so bad, I think I poo-ed myself a little when I finally realized where I was in life and how close I came to spending five years locked up. I may not be a handsome man, but I'm too pretty and frail for prison and I'm rather fond of my kids and enjoy seeing them regularly.\n\nRock bottom was the thought that no one was going to help me. At some point, I realized, I shouldered all the responsibility for me. I called myself a pussy, grabbed myself by the scruff of the neck and told myself to grow up. It took me more than nine years to do finish the job.\n\nIt seems like life may have passed me by because I spent every extra cent on paying off all those debts. I gave up nights out with friends and vacations, new toys and new clothes I didn't need.\n\nIt is worth it.\n\nNow, at middle age, everything is paid off. My kids are grown and working at jobs. Having kids grow up while I supervised was so much fun, I got a couple more rental kids, one from Norway, the other from Hungary. I also took in a couple of strays who shared our home for a while when they needed shelter. It is fricking amazing to see kids who others gave up on become doctors and engineers, teachers and supervisors.\n\nWhat do I have? A modular home in a park. It's not a mansion, needs new carpet and some work on the vinyl siding. I drive an old truck that needs work, but I can do it with the few tools I have in my shed. My vacation are mission trips to Kenya and Dominican Republic to build houses and teach. My bills are paid now and I sleep well, except for the prostate bullshit that comes with age. What I thought I was missing out on in life, wasn't what I found was important and fulfilling. I'm a minimalist by nature I guess. I don't need all the things I thought I wanted.\n\nI sleep well. I don't worry about the bills I can't pay because I have paid off every last one of them. It took  more than nine years of being broke, but I did it and you can too. I can't guarantee you'll be happy, but it feels gooder to not have bills than it does to have them hanging around your neck like heavy cow bells, banging continually reminding you they are there. At the time, the nine years felt like forever and I wanted to quit so many times, but looking back, oh wait, it did suck, but it was worth it to get where I am happy today. I know the $86g looks insurmountable, but I hope you don't throw away all of your hard work in getting this far, just for a short term of spending. \n\nTake it from an old man who's probably not long for this world. Pay off everything you can as soon as you can, because there will come a day when the cow bells will be off and freedom will feel so much more sweeter.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Other", "id": "65gicx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 53, "report_reasons": null, "author": "MrDreamThief", "saved": false, "mod_reports": [], "name": "t3_65gicx", "subreddit_name_prefixed": "r/personalfinance", "approved_by": null, "over_18": false, "domain": "self.personalfinance", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qstm", "edited": false, "link_flair_css_class": "Other", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/personalfinance/comments/65gicx/maybe_its_not_success_but_its_success_enough/", "num_reports": null, "locked": false, "stickied": false, "created": 1492247899.0, "url": "https://www.reddit.com/r/personalfinance/comments/65gicx/maybe_its_not_success_but_its_success_enough/", "author_flair_text": null, "quarantine": false, "title": "Maybe it's not success, but it's success enough", "created_utc": 1492219099.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 53}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65gicx", "likes": null, "replies": "", "user_reports": [], "id": "dga6ms0", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "sydjax", "parent_id": "t3_65gicx", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "even though i don't know you, i'm beaming with pride. i'm so proud of you! i needed this. thank you so much for helping me stay focused and keep my eyes on the prize. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;even though i don&amp;#39;t know you, i&amp;#39;m beaming with pride. i&amp;#39;m so proud of you! i needed this. thank you so much for helping me stay focused and keep my eyes on the prize. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dga6ms0", "score_hidden": false, "stickied": false, "created": 1492253665.0, "created_utc": 1492224865.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65gicx", "likes": null, "replies": "", "user_reports": [], "id": "dgaw6dr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "an_imperfect_lady", "parent_id": "t3_65gicx", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Life really is a roller coaster, isn't it? Congrats on hanging on!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Life really is a roller coaster, isn&amp;#39;t it? Congrats on hanging on!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaw6dr", "score_hidden": false, "stickied": false, "created": 1492305383.0, "created_utc": 1492276583.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65gicx", "likes": null, "replies": "", "user_reports": [], "id": "dgaxv0o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "somewhat_pragmatic", "parent_id": "t3_65gicx", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "&gt;Take it from an old man who's probably not long for this world. Pay off everything you can as soon as you can, because there will come a day when the cow bells will be off and freedom will feel so much more sweeter.\n\nAs an adult I never hit bottom by being in debt, but I certainly had 2 digit checking account balances at times.  Instead I looked at what I'd spent on garbage and realized that it represented missed opportunity.    \n\nI came to the same conclusion you did about debt.  I discovered worry is expensive.  Debt is a very easy source of worry.  It keeps you from focusing on tomorrow's opportunities because you're focused on yesterday's spending.\n\nYou've done amazingly well to fall so low, dig yourself out, and ride high again.  Congratulations! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Take it from an old man who&amp;#39;s probably not long for this world. Pay off everything you can as soon as you can, because there will come a day when the cow bells will be off and freedom will feel so much more sweeter.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As an adult I never hit bottom by being in debt, but I certainly had 2 digit checking account balances at times.  Instead I looked at what I&amp;#39;d spent on garbage and realized that it represented missed opportunity.    &lt;/p&gt;\n\n&lt;p&gt;I came to the same conclusion you did about debt.  I discovered worry is expensive.  Debt is a very easy source of worry.  It keeps you from focusing on tomorrow&amp;#39;s opportunities because you&amp;#39;re focused on yesterday&amp;#39;s spending.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve done amazingly well to fall so low, dig yourself out, and ride high again.  Congratulations! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaxv0o", "score_hidden": false, "stickied": false, "created": 1492307672.0, "created_utc": 1492278872.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65gicx", "likes": null, "replies": "", "user_reports": [], "id": "dgb996w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "femtester", "parent_id": "t3_65gicx", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I chortled at \"too pretty and frail for prison\" 😂\n\nThank you for this oddly inspirational anecdote. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I chortled at &amp;quot;too pretty and frail for prison&amp;quot; 😂&lt;/p&gt;\n\n&lt;p&gt;Thank you for this oddly inspirational anecdote. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb996w", "score_hidden": false, "stickied": false, "created": 1492323221.0, "created_utc": 1492294421.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65gicx", "likes": null, "replies": "", "user_reports": [], "id": "dgbetp6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NatH502", "parent_id": "t3_65gicx", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Great story, thanks for sharing!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great story, thanks for sharing!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbetp6", "score_hidden": false, "stickied": false, "created": 1492331209.0, "created_utc": 1492302409.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65gicx", "likes": null, "replies": "", "user_reports": [], "id": "dgah6jn", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "motorstrip", "parent_id": "t3_65gicx", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 1, "body": "First off, this needs a TL;DR.  \n\nThe original guy who is still 86k in the hole from student loans was putting off his entire life to pay bills.  That is having kids, getting a little bigger place.  I think your story is great but I'm sure the situation are a bit different.  \n\nCongrats on becoming debt free and happy though!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First off, this needs a TL;DR.  &lt;/p&gt;\n\n&lt;p&gt;The original guy who is still 86k in the hole from student loans was putting off his entire life to pay bills.  That is having kids, getting a little bigger place.  I think your story is great but I&amp;#39;m sure the situation are a bit different.  &lt;/p&gt;\n\n&lt;p&gt;Congrats on becoming debt free and happy though!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgah6jn", "score_hidden": false, "stickied": false, "created": 1492275908.0, "created_utc": 1492247108.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65gicx", "likes": null, "replies": "", "user_reports": [], "id": "dgau7nz", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "SoggyMcmufffinns", "parent_id": "t3_65gicx", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Eh, that's why this is \"personal\" finance. While I agree paying off debt fast is a good thing, I don't agree \"personally\" that at \"any\" cost you should just keep chugging \"EVERY LAST DIME.\" I have other financial goals besides \"just\" paying off debt that I would like to do before I have a family. I also, like taking vacations, and enjoying my life now as well. Every situation is different and I personally am debt adversive so I try to  take routes that avoid it as much as possible or low interest rates at the very least. If you have no \"fun\" money whatsoever that is a bad thing in \"my\"  humble opinion. I am not sacrificing hanging out with friends or going out to eat \"at all,\" because I have debt. I make it work to meet all my goals. That means paying it off aggressively while still saving enough to hang with friends and have some me time. \n\nI don't have a lot of material possessions, because the don't mean as much to me at this time. I put that toward debt and retirement, but I refuse to give up my fun entirely. At the moment I budget $100 a month for \"fun\" money. When I was dating it was $240 for dates as I think that is both an investment and part of courting your wife or girlfriend. My budget may even go up next month as my expenses will go down significantly allowing more cash flow. If you are not budgeting \"fun money\" in your budget you are doing it wrong in my opinion. It doesn't need to be crazy, but to just not have fun is silly. That extra $100 I spend on myself every month is worth every penny. Not all gains in life are monetary. Experienceso are priceless and I'm not sacrificing 10 years worth of experiences and relationships for any company. \n\nThanks for your input and congrats on being debt free. We may have disagreements on how to reach that point, but as long as we both get there we are both winning. I am having a blast saving money, knocking out debt, AND building relationships and experience through the budgeted money I put aside for myself. Been one hell of a ride so far! Super excited for things to come!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh, that&amp;#39;s why this is &amp;quot;personal&amp;quot; finance. While I agree paying off debt fast is a good thing, I don&amp;#39;t agree &amp;quot;personally&amp;quot; that at &amp;quot;any&amp;quot; cost you should just keep chugging &amp;quot;EVERY LAST DIME.&amp;quot; I have other financial goals besides &amp;quot;just&amp;quot; paying off debt that I would like to do before I have a family. I also, like taking vacations, and enjoying my life now as well. Every situation is different and I personally am debt adversive so I try to  take routes that avoid it as much as possible or low interest rates at the very least. If you have no &amp;quot;fun&amp;quot; money whatsoever that is a bad thing in &amp;quot;my&amp;quot;  humble opinion. I am not sacrificing hanging out with friends or going out to eat &amp;quot;at all,&amp;quot; because I have debt. I make it work to meet all my goals. That means paying it off aggressively while still saving enough to hang with friends and have some me time. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have a lot of material possessions, because the don&amp;#39;t mean as much to me at this time. I put that toward debt and retirement, but I refuse to give up my fun entirely. At the moment I budget $100 a month for &amp;quot;fun&amp;quot; money. When I was dating it was $240 for dates as I think that is both an investment and part of courting your wife or girlfriend. My budget may even go up next month as my expenses will go down significantly allowing more cash flow. If you are not budgeting &amp;quot;fun money&amp;quot; in your budget you are doing it wrong in my opinion. It doesn&amp;#39;t need to be crazy, but to just not have fun is silly. That extra $100 I spend on myself every month is worth every penny. Not all gains in life are monetary. Experienceso are priceless and I&amp;#39;m not sacrificing 10 years worth of experiences and relationships for any company. &lt;/p&gt;\n\n&lt;p&gt;Thanks for your input and congrats on being debt free. We may have disagreements on how to reach that point, but as long as we both get there we are both winning. I am having a blast saving money, knocking out debt, AND building relationships and experience through the budgeted money I put aside for myself. Been one hell of a ride so far! Super excited for things to come!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgau7nz", "score_hidden": false, "stickied": false, "created": 1492302652.0, "created_utc": 1492273852.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]