[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "personalfinance", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am an a1c living in the dorms on an air force base. I am single and childfree (I don&amp;#39;t want children). I come from a pretty bad/messed up/absuive family, and i joined the service to drag myself out of the cesspool of abuse and poverty. I&amp;#39;m pretty comfortable with a few k in savings, and I&amp;#39;m looking for any advice really on how to raise my nephew well.&lt;/p&gt;\n\n&lt;p&gt;I make 21500k a year, and currently I live and eat free in the dorms. The military will give me roughly 1600 a month in dependent BAH. So 19000 annually. (BAH is tax free) and 300 a month for food (Also tax free). This brings me to a rough salary of 44700 a year, with a significant portion untaxed, so lets say 50k.&lt;/p&gt;\n\n&lt;p&gt;The boy has been raised around strange men who hit him. His mother (my estranged sister), and her current boyfriend of choice, are pretty standard southern white druggie trash. They live on welfare. The boy has been neglected and abused, at the very least hit often, and possibly sexually abused. I don&amp;#39;t know him very well, but he&amp;#39;s intelligent and was a sweet child before the abuse made him act out. They have him dosed up on Klonipin. I&amp;#39;m not familiar with this drug, but he&amp;#39;s on it because he was misbehaving and throwing fits. If possible, i&amp;#39;d like him weaned off the drug assuming i can get him the help he needs. I think I can raise him fairly well, I didn&amp;#39;t really want to but I&amp;#39;d rather my nephew not be tossed between foster homes that won&amp;#39;t be able to help him get him what he needs, so I am fully willing to take care of him. I can cook fine and I&amp;#39;m a naturally clean and tidy person, and my normal work schedule isn&amp;#39;t too grueling, so I have enough free time to be able to.&lt;/p&gt;\n\n&lt;p&gt;I was also abused as a child and and I don&amp;#39;t want him to have to grow up with nobody loving him like I did.&lt;/p&gt;\n\n&lt;p&gt;My sister (whom i don&amp;#39;t speak to) Is putting the boy into a foster home, and my grandparents fighting for custody of him before that happens. They&amp;#39;re nice people, but they&amp;#39;re old and sick, so I offered to take him in after they have him for a few months or a year or so, in order to give me time to get prepared get everything set up.&lt;/p&gt;\n\n&lt;p&gt;What do I need? What hidden expenses might I overlook? Any medical will be covered as I&amp;#39;m a servicemember, and the money should be enough to comfortable take care of a child..&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really sorry if this is rambling or if this is the wrong place to post this, but i&amp;#39;m happy for any advice anyone can give me. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am an a1c living in the dorms on an air force base. I am single and childfree (I don't want children). I come from a pretty bad/messed up/absuive family, and i joined the service to drag myself out of the cesspool of abuse and poverty. I'm pretty comfortable with a few k in savings, and I'm looking for any advice really on how to raise my nephew well.\n\n\nI make 21500k a year, and currently I live and eat free in the dorms. The military will give me roughly 1600 a month in dependent BAH. So 19000 annually. (BAH is tax free) and 300 a month for food (Also tax free). This brings me to a rough salary of 44700 a year, with a significant portion untaxed, so lets say 50k.\n\n\nThe boy has been raised around strange men who hit him. His mother (my estranged sister), and her current boyfriend of choice, are pretty standard southern white druggie trash. They live on welfare. The boy has been neglected and abused, at the very least hit often, and possibly sexually abused. I don't know him very well, but he's intelligent and was a sweet child before the abuse made him act out. They have him dosed up on Klonipin. I'm not familiar with this drug, but he's on it because he was misbehaving and throwing fits. If possible, i'd like him weaned off the drug assuming i can get him the help he needs. I think I can raise him fairly well, I didn't really want to but I'd rather my nephew not be tossed between foster homes that won't be able to help him get him what he needs, so I am fully willing to take care of him. I can cook fine and I'm a naturally clean and tidy person, and my normal work schedule isn't too grueling, so I have enough free time to be able to.\n\nI was also abused as a child and and I don't want him to have to grow up with nobody loving him like I did.\n\nMy sister (whom i don't speak to) Is putting the boy into a foster home, and my grandparents fighting for custody of him before that happens. They're nice people, but they're old and sick, so I offered to take him in after they have him for a few months or a year or so, in order to give me time to get prepared get everything set up.\n\nWhat do I need? What hidden expenses might I overlook? Any medical will be covered as I'm a servicemember, and the money should be enough to comfortable take care of a child..\n\nI'm really sorry if this is rambling or if this is the wrong place to post this, but i'm happy for any advice anyone can give me. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Planning", "id": "65h4sz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 657, "report_reasons": null, "author": "advicethrowaway148", "saved": false, "mod_reports": [], "name": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "approved_by": null, "over_18": false, "domain": "self.personalfinance", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qstm", "edited": false, "link_flair_css_class": "Planning", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/personalfinance/comments/65h4sz/single_18m_air_force_member_may_soon_be_adopting/", "num_reports": null, "locked": false, "stickied": false, "created": 1492256376.0, "url": "https://www.reddit.com/r/personalfinance/comments/65h4sz/single_18m_air_force_member_may_soon_be_adopting/", "author_flair_text": null, "quarantine": false, "title": "Single (18m) Air force member may soon be adopting troubled nephew (5) from abusive family member.", "created_utc": 1492227576.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 133, "visited": false, "subreddit_type": "public", "ups": 657}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgaox3j", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "rossmilkq", "parent_id": "t1_dgaahfe", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "The AF also helps with adoption fees. Have you talked with your shirt at all? I know not all shirts are created equal but if you have a good shirt or supervisor it would be worth while to talk to them about it so they know what is going on. This a big weight to carry don't try to do it all your self!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The AF also helps with adoption fees. Have you talked with your shirt at all? I know not all shirts are created equal but if you have a good shirt or supervisor it would be worth while to talk to them about it so they know what is going on. This a big weight to carry don&amp;#39;t try to do it all your self!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaox3j", "score_hidden": false, "stickied": false, "created": 1492294974.0, "created_utc": 1492266174.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 52}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgapnqe", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "colazion", "parent_id": "t1_dgaahfe", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Being a former AF guy, I was going to give as much advice as I could, but EWCM has WAY BETTER advice than I could give. Look at all your resources and use them, is the best advice I could give at this point. The klonopin he's on is an anti-anxiety medication used to curb his symptoms, not treat them or address them. A stable environment and counseling will guide him away from misbehaving and acting out. We use similar drugs in our trauma ER too often for overly anxious and combative patients so that we can better address their medical needs, not to address their psychosocial needs. It may take time and a lot of patience, but moving him away from medication and teaching the kid how to deal with his life experiences is, in my opinion, the best medicine. I suggest talking to your direct supervisor, your first sergeant, or whom ever you trust that has rank and experience in the AF about what you may need to do to prepare and/or to make this transition as smooth as possible. They may also appreciate being kept in the loop. \n\nI really wish you the best of luck!! I too joined the USAF to move out and to make a better life. Please, keep us updated. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Being a former AF guy, I was going to give as much advice as I could, but EWCM has WAY BETTER advice than I could give. Look at all your resources and use them, is the best advice I could give at this point. The klonopin he&amp;#39;s on is an anti-anxiety medication used to curb his symptoms, not treat them or address them. A stable environment and counseling will guide him away from misbehaving and acting out. We use similar drugs in our trauma ER too often for overly anxious and combative patients so that we can better address their medical needs, not to address their psychosocial needs. It may take time and a lot of patience, but moving him away from medication and teaching the kid how to deal with his life experiences is, in my opinion, the best medicine. I suggest talking to your direct supervisor, your first sergeant, or whom ever you trust that has rank and experience in the AF about what you may need to do to prepare and/or to make this transition as smooth as possible. They may also appreciate being kept in the loop. &lt;/p&gt;\n\n&lt;p&gt;I really wish you the best of luck!! I too joined the USAF to move out and to make a better life. Please, keep us updated. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgapnqe", "score_hidden": false, "stickied": false, "created": 1492296153.0, "created_utc": 1492267353.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgax9iq", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "Mic_Check_One_Two", "parent_id": "t1_dgat7mg", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Seriously. What doctor would prescribe a 5 year old with klonopin? It sounds like they went \"eh, just give him an 'as needed' prescription, so I don't have to deal with his awful parents anymore.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seriously. What doctor would prescribe a 5 year old with klonopin? It sounds like they went &amp;quot;eh, just give him an &amp;#39;as needed&amp;#39; prescription, so I don&amp;#39;t have to deal with his awful parents anymore.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgax9iq", "score_hidden": false, "stickied": false, "created": 1492306858.0, "created_utc": 1492278058.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, "user_reports": [], "id": "dgat7mg", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "Yanamarie", "parent_id": "t1_dgaahfe", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I'd like to add in here, that Klonopin is an addictive drug when taken long term, or obviously, too much of it.  You may need resources to help you wean him off of it.  I would consider this and get that resource under your belt before taking him in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to add in here, that Klonopin is an addictive drug when taken long term, or obviously, too much of it.  You may need resources to help you wean him off of it.  I would consider this and get that resource under your belt before taking him in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgat7mg", "score_hidden": false, "stickied": false, "created": 1492301254.0, "created_utc": 1492272454.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgaz5bt", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "EWCM", "parent_id": "t1_dgaahfe", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "No problem! A couple of other on base services I thought of. The New Parent Support Program or Family Advocacy might provide parenting classes or could refer you to one. There might be a School Liaison office that provides information on local schools. The Air Force Aid Society provides no interest loans or grants for financial emergencies, so keep them in mind if you get in a jam. If you choose to live off base and don't have time to save for your deposit and first months rent, your finance office can​ provide the application for Advance BAH which gives you up to 3 months of BAH although you do have to pay it back (usually over 12 months).\n\nYou might also try to connect with a local community group for foster and adoptive parents. They might have other ideas and resources for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem! A couple of other on base services I thought of. The New Parent Support Program or Family Advocacy might provide parenting classes or could refer you to one. There might be a School Liaison office that provides information on local schools. The Air Force Aid Society provides no interest loans or grants for financial emergencies, so keep them in mind if you get in a jam. If you choose to live off base and don&amp;#39;t have time to save for your deposit and first months rent, your finance office can​ provide the application for Advance BAH which gives you up to 3 months of BAH although you do have to pay it back (usually over 12 months).&lt;/p&gt;\n\n&lt;p&gt;You might also try to connect with a local community group for foster and adoptive parents. They might have other ideas and resources for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaz5bt", "score_hidden": false, "stickied": false, "created": 1492309417.0, "created_utc": 1492280617.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaahfe", "gilded": 0, "archived": false, "score": 93, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dga9xkg", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Thank you for the reply! I honestly wasn't sure if i'd get any help here. I think i'll be financially comfortable, but i wasn't aware of some of those options for assistance you gave me, (free school lunches, duh). and he's 5 currently. Will probably be six by the time I get ahold of him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the reply! I honestly wasn&amp;#39;t sure if i&amp;#39;d get any help here. I think i&amp;#39;ll be financially comfortable, but i wasn&amp;#39;t aware of some of those options for assistance you gave me, (free school lunches, duh). and he&amp;#39;s 5 currently. Will probably be six by the time I get ahold of him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaahfe", "score_hidden": false, "stickied": false, "created": 1492259904.0, "created_utc": 1492231104.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 93}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb6zth", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AcidCyborg", "parent_id": "t1_dgb6ok7", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Wasn't trying to understate the shittiness of benzo withdrawal, but rather to highlight the added danger not present in other substances. Kolonopin especially has a long half-life and as such takes several days minimum to fully metabolize the drug and even longer to upregulate the associated (GABA) receptors.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wasn&amp;#39;t trying to understate the shittiness of benzo withdrawal, but rather to highlight the added danger not present in other substances. Kolonopin especially has a long half-life and as such takes several days minimum to fully metabolize the drug and even longer to upregulate the associated (GABA) receptors.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb6zth", "score_hidden": false, "stickied": false, "created": 1492320097.0, "created_utc": 1492291297.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb6ok7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MediocreFisherman", "parent_id": "t1_dgb41al", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Benzos suck to come off of, for sure. \n\nI was on a muscle relaxer for a month. Coming off felt like I'd had the shit beat out of me for days. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Benzos suck to come off of, for sure. &lt;/p&gt;\n\n&lt;p&gt;I was on a muscle relaxer for a month. Coming off felt like I&amp;#39;d had the shit beat out of me for days. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb6ok7", "score_hidden": false, "stickied": false, "created": 1492319661.0, "created_utc": 1492290861.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb41al", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "AcidCyborg", "parent_id": "t1_dgawqqp", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "One of the biggest dangers with benzodiazepenes is that unlike drugs like narcotics, the withdrawals don't just suck, but can actually be deadly. Especially with such a young brain, dependence can be extreme. Be careful OP!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of the biggest dangers with benzodiazepenes is that unlike drugs like narcotics, the withdrawals don&amp;#39;t just suck, but can actually be deadly. Especially with such a young brain, dependence can be extreme. Be careful OP!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb41al", "score_hidden": false, "stickied": false, "created": 1492316032.0, "created_utc": 1492287232.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbjq1s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lonewolf210", "parent_id": "t1_dgawqqp", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I would advise against on base housing in most cases. They take your full BAH and in most places you get better housing for cheaper off base. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would advise against on base housing in most cases. They take your full BAH and in most places you get better housing for cheaper off base. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbjq1s", "score_hidden": false, "stickied": false, "created": 1492338301.0, "created_utc": 1492309501.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawqqp", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "instrumentnerd", "parent_id": "t1_dga9xkg", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I would look into on-base housing like, an apartment or something. Also, if possible talk to a doctor about getting him off of Klonopin. It's highly addictive and it will suck, especially if he's been on it for a while, but if he doesn't need it he should Not be taking it.\n\nTry and get him enrolled in some sort of schooling. Get a routine set up, this will help his mental health and adjustment as well. Good on you. Good luck!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would look into on-base housing like, an apartment or something. Also, if possible talk to a doctor about getting him off of Klonopin. It&amp;#39;s highly addictive and it will suck, especially if he&amp;#39;s been on it for a while, but if he doesn&amp;#39;t need it he should Not be taking it.&lt;/p&gt;\n\n&lt;p&gt;Try and get him enrolled in some sort of schooling. Get a routine set up, this will help his mental health and adjustment as well. Good on you. Good luck!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgawqqp", "score_hidden": false, "stickied": false, "created": 1492306149.0, "created_utc": 1492277349.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgauyo2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "trap_pots", "parent_id": "t1_dga9xkg", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "You forgot he's going to have a local dmpo milpay office he should visit", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You forgot he&amp;#39;s going to have a local dmpo milpay office he should visit&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgauyo2", "score_hidden": false, "stickied": false, "created": 1492303719.0, "created_utc": 1492274919.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgawk2t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MareDot", "parent_id": "t1_dga9xkg", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Great advice!!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great advice!!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgawk2t", "score_hidden": false, "stickied": false, "created": 1492305899.0, "created_utc": 1492277099.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgay2tk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mpmmuirhead", "parent_id": "t1_dgay1ef", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Fair enough :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair enough :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgay2tk", "score_hidden": false, "stickied": false, "created": 1492307965.0, "created_utc": 1492279165.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgay1ef", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "EWCM", "parent_id": "t1_dgaxi7f", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Thanks! I realized that shortly after I posted. I thought he'd mentioned it, but I kept looking at the body of the post and couldn't​ find it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! I realized that shortly after I posted. I thought he&amp;#39;d mentioned it, but I kept looking at the body of the post and couldn&amp;#39;t​ find it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgay1ef", "score_hidden": false, "stickied": false, "created": 1492307912.0, "created_utc": 1492279112.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxi7f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mpmmuirhead", "parent_id": "t1_dga9xkg", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "He does say how old he is. Right in the title ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He does say how old he is. Right in the title &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaxi7f", "score_hidden": false, "stickied": false, "created": 1492307183.0, "created_utc": 1492278383.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb0mns", "gilded": 0, "archived": false, "score": -17, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dga9xkg", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb0mns", "score_hidden": false, "stickied": false, "created": 1492311452.0, "created_utc": 1492282652.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -17}}], "after": null, "before": null}}, "user_reports": [], "id": "dga9xkg", "gilded": 0, "archived": false, "score": 260, "report_reasons": null, "author": "EWCM", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Are you going to need a lawyer? Legal might be able to point you the right direction, but they won't usually represent you for custody issues.\n\n[The military offers a reimbursement of up to $2000 for adoption costs.](https://www.dfas.mil/militarymembers/payentitlements/adoptionreimbursement.html)\n\nStart now researching child care. You don't say how old he is, but there are options both on base and off for day care, after school care, etc. Ask about waiting lists and whether you can get on while the adoption is pending. Build a network for help if you have to work overnight, go on short TDYs, etc. If on base care is unavailable, you may qualify for a subsidy through ChildCare Aware.\n\nLook at housing options. On base/off base. School districts. Commuting times. Etc.\n\nFind out if you'd qualify for things like WIC, free or reduced cost school lunches, or discounted utilities.\n\nBudget for clothes, school supplies, sports or other activities, tutoring (check for free options at the education center or library), and toys.\n\nLook into EFMP. If he has a diagnosis that requires medication, he may qualify for extra services or support. EFMP is required if you have a dependent with special needs because it screens your possible duty stations to make sure the necessary services are available.\n\nFind out the differences between Tricare Standard and Tricare Prime. Decide which you think would work better or be more cost effective.\n\nLook into counseling options (Military One Source, MFLC, AFRC, Tricare, etc.)\n\nMake an appointment with a financial counselor at AFRC or through Military One Source. They can look at your current situation and help you build a plan for the future.\n\nGood luck and thanks for helping a child in need.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you going to need a lawyer? Legal might be able to point you the right direction, but they won&amp;#39;t usually represent you for custody issues.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.dfas.mil/militarymembers/payentitlements/adoptionreimbursement.html\"&gt;The military offers a reimbursement of up to $2000 for adoption costs.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Start now researching child care. You don&amp;#39;t say how old he is, but there are options both on base and off for day care, after school care, etc. Ask about waiting lists and whether you can get on while the adoption is pending. Build a network for help if you have to work overnight, go on short TDYs, etc. If on base care is unavailable, you may qualify for a subsidy through ChildCare Aware.&lt;/p&gt;\n\n&lt;p&gt;Look at housing options. On base/off base. School districts. Commuting times. Etc.&lt;/p&gt;\n\n&lt;p&gt;Find out if you&amp;#39;d qualify for things like WIC, free or reduced cost school lunches, or discounted utilities.&lt;/p&gt;\n\n&lt;p&gt;Budget for clothes, school supplies, sports or other activities, tutoring (check for free options at the education center or library), and toys.&lt;/p&gt;\n\n&lt;p&gt;Look into EFMP. If he has a diagnosis that requires medication, he may qualify for extra services or support. EFMP is required if you have a dependent with special needs because it screens your possible duty stations to make sure the necessary services are available.&lt;/p&gt;\n\n&lt;p&gt;Find out the differences between Tricare Standard and Tricare Prime. Decide which you think would work better or be more cost effective.&lt;/p&gt;\n\n&lt;p&gt;Look into counseling options (Military One Source, MFLC, AFRC, Tricare, etc.)&lt;/p&gt;\n\n&lt;p&gt;Make an appointment with a financial counselor at AFRC or through Military One Source. They can look at your current situation and help you build a plan for the future.&lt;/p&gt;\n\n&lt;p&gt;Good luck and thanks for helping a child in need.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dga9xkg", "score_hidden": false, "stickied": false, "created": 1492258948.0, "created_utc": 1492230148.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 260}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb9cbl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Rinas-the-name", "parent_id": "t1_dgaxyp4", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Also always do your best to explain why the rules are rules. That will make him much more likely to follow them, because he will understand that there is a good reason. For example: My niece kept playing in puddles and my sister kept yelling at her not to. I finally stopped her and asked her if she knew why her mom didn't want her doing that, she didn't, so I explained how rain runs into puddles and all the gross stuff that was in them. She made a face and never did it again. I always tell kids the why, otherwise it comes across as a \"because I said so\" rule. My son always gets a reminder of the why when he breaks the rules too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also always do your best to explain why the rules are rules. That will make him much more likely to follow them, because he will understand that there is a good reason. For example: My niece kept playing in puddles and my sister kept yelling at her not to. I finally stopped her and asked her if she knew why her mom didn&amp;#39;t want her doing that, she didn&amp;#39;t, so I explained how rain runs into puddles and all the gross stuff that was in them. She made a face and never did it again. I always tell kids the why, otherwise it comes across as a &amp;quot;because I said so&amp;quot; rule. My son always gets a reminder of the why when he breaks the rules too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb9cbl", "score_hidden": false, "stickied": false, "created": 1492323345.0, "created_utc": 1492294545.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxyp4", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "Mic_Check_One_Two", "parent_id": "t1_dgacdrj", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "&gt;No one knows how to be a parent when they first have a child! You'll make some mistakes. You will need a lot of patience as your nephew adjusts to some sense of normalcy and learns to trust.\n\nI also want to make a point that you'll need to be patient with yourself as well. Everybody makes mistakes. The important part is to learn from them.\n\nFurthermore, some advice about punishment and discipline - You should be able to clearly explain *why* you are punishing them without using \"I\" \"Me\" \"My\" etc... Punishment shouldn't be about you. If you're only punishing them because \"you made me angry\" then the punishment is only for *your* benefit, not the child's; You're only using it to vent anger or frustration. I only mention this because you've said that that you came from a bad home life, and he obviously is too - This is a huge thing that separates abusive households from non-abusive ones. Abusive parents punish children for their own benefit, not to teach the child something. I'm not going to get into a debate about *how* to punish or discipline the kid... But at least avoid doing it simply because *you* are angry or frustrated.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;No one knows how to be a parent when they first have a child! You&amp;#39;ll make some mistakes. You will need a lot of patience as your nephew adjusts to some sense of normalcy and learns to trust.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I also want to make a point that you&amp;#39;ll need to be patient with yourself as well. Everybody makes mistakes. The important part is to learn from them.&lt;/p&gt;\n\n&lt;p&gt;Furthermore, some advice about punishment and discipline - You should be able to clearly explain &lt;em&gt;why&lt;/em&gt; you are punishing them without using &amp;quot;I&amp;quot; &amp;quot;Me&amp;quot; &amp;quot;My&amp;quot; etc... Punishment shouldn&amp;#39;t be about you. If you&amp;#39;re only punishing them because &amp;quot;you made me angry&amp;quot; then the punishment is only for &lt;em&gt;your&lt;/em&gt; benefit, not the child&amp;#39;s; You&amp;#39;re only using it to vent anger or frustration. I only mention this because you&amp;#39;ve said that that you came from a bad home life, and he obviously is too - This is a huge thing that separates abusive households from non-abusive ones. Abusive parents punish children for their own benefit, not to teach the child something. I&amp;#39;m not going to get into a debate about &lt;em&gt;how&lt;/em&gt; to punish or discipline the kid... But at least avoid doing it simply because &lt;em&gt;you&lt;/em&gt; are angry or frustrated.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaxyp4", "score_hidden": false, "stickied": false, "created": 1492307811.0, "created_utc": 1492279011.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgadzo3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "dmickey79", "parent_id": "t1_dgacdrj", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "OP this is excellent advice ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP this is excellent advice &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgadzo3", "score_hidden": false, "stickied": false, "created": 1492267034.0, "created_utc": 1492238234.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgacdrj", "gilded": 0, "archived": false, "score": 56, "report_reasons": null, "author": "KBCme", "parent_id": "t1_dgaaril", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "No one knows how to be a parent when they first have a child! You'll make some mistakes. You will need a lot of patience as your nephew adjusts to some sense of normalcy and learns to trust.\n\nIf your nephew shows signs of emotional/learning/development problems, the school can develop an IEP - Individual Education Plan to address those problem areas.\n\nAnd parenting isn't rocket science. Treat your nephew the way you wish you had been treated as a child. Learn how to deal with anger and frustration in a healthy way. Kids are oh so good at testing you. :-) Ask for help when you need it.\n\nOn /r/legaladvice a few months ago there was a couple that took in a 3 yr old cousin/nephew. Neither had wanted kids and they planned on never having any. But they couldn't turn their backs to this kid who was in an awful environment. Turns out they totally fell in love with this kid and now can't imagine their lives without him.\n\nGood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No one knows how to be a parent when they first have a child! You&amp;#39;ll make some mistakes. You will need a lot of patience as your nephew adjusts to some sense of normalcy and learns to trust.&lt;/p&gt;\n\n&lt;p&gt;If your nephew shows signs of emotional/learning/development problems, the school can develop an IEP - Individual Education Plan to address those problem areas.&lt;/p&gt;\n\n&lt;p&gt;And parenting isn&amp;#39;t rocket science. Treat your nephew the way you wish you had been treated as a child. Learn how to deal with anger and frustration in a healthy way. Kids are oh so good at testing you. :-) Ask for help when you need it.&lt;/p&gt;\n\n&lt;p&gt;On &lt;a href=\"/r/legaladvice\"&gt;/r/legaladvice&lt;/a&gt; a few months ago there was a couple that took in a 3 yr old cousin/nephew. Neither had wanted kids and they planned on never having any. But they couldn&amp;#39;t turn their backs to this kid who was in an awful environment. Turns out they totally fell in love with this kid and now can&amp;#39;t imagine their lives without him.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgacdrj", "score_hidden": false, "stickied": false, "created": 1492263473.0, "created_utc": 1492234673.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 56}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dganf01", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "VerucaNaCltybish", "parent_id": "t1_dgaaril", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "As a former military spouse and parent of two kids, none of us really \"know how to be a parent\". The first step is one you've already taken by saying you want to be responsible for the care and welfare of a child. Military One Source is an EXCELLENT resource for counseling services and if both you and your nephew were in abusive households you both need counseling. Healing your own traumas from the past will help you not just be a better parent but be a better you. Also, they will give you tools to work through typical and atypical parenting situations. It sounds like you are emotionally aware enough to know he is repressing things, which causes the outbursts. Just be prepared. Whatever he's repressing can bring up a LOT of repressed feelings for you as well. I'd start counseling now before even taking him in, so you have a little more time to process everything before he comes to you.\n\n Also, if you are going to take him off your grandparents hands, you need to do so legally. JAG may not be able to help with that but they may be able to refer you to a civil attorney for adoption or custody. \n\nYou sound like a very mature 18 year old. Children of addicts typically fall into certain categories: hero, fixer, judge, addict, enabler. just be aware that taking in another child of addicts can create a codependent relationship and that in itself can be damaging because you are both \"wired\" to a certain type of relationship \"template\". Working through your own stuff first will help. Very best of luck to you! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a former military spouse and parent of two kids, none of us really &amp;quot;know how to be a parent&amp;quot;. The first step is one you&amp;#39;ve already taken by saying you want to be responsible for the care and welfare of a child. Military One Source is an EXCELLENT resource for counseling services and if both you and your nephew were in abusive households you both need counseling. Healing your own traumas from the past will help you not just be a better parent but be a better you. Also, they will give you tools to work through typical and atypical parenting situations. It sounds like you are emotionally aware enough to know he is repressing things, which causes the outbursts. Just be prepared. Whatever he&amp;#39;s repressing can bring up a LOT of repressed feelings for you as well. I&amp;#39;d start counseling now before even taking him in, so you have a little more time to process everything before he comes to you.&lt;/p&gt;\n\n&lt;p&gt;Also, if you are going to take him off your grandparents hands, you need to do so legally. JAG may not be able to help with that but they may be able to refer you to a civil attorney for adoption or custody. &lt;/p&gt;\n\n&lt;p&gt;You sound like a very mature 18 year old. Children of addicts typically fall into certain categories: hero, fixer, judge, addict, enabler. just be aware that taking in another child of addicts can create a codependent relationship and that in itself can be damaging because you are both &amp;quot;wired&amp;quot; to a certain type of relationship &amp;quot;template&amp;quot;. Working through your own stuff first will help. Very best of luck to you! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dganf01", "score_hidden": false, "stickied": false, "created": 1492292365.0, "created_utc": 1492263565.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgaiffe", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "AgedMaduro", "parent_id": "t1_dgaaril", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "&gt;I don't know how to actually do normal parent things and have a normal relationship with a child because I didn't have good parents\n\nNeither does he. As long as you're trying, you'll learn how to build a good relationship, together. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t know how to actually do normal parent things and have a normal relationship with a child because I didn&amp;#39;t have good parents&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Neither does he. As long as you&amp;#39;re trying, you&amp;#39;ll learn how to build a good relationship, together. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaiffe", "score_hidden": false, "stickied": false, "created": 1492279929.0, "created_utc": 1492251129.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb3fky", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dgarb1y", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I'm hoping they'll be able to take him for more than  a year, and i'm planning on visiting when I can. We live on opposite coasts though so that might be tricky.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m hoping they&amp;#39;ll be able to take him for more than  a year, and i&amp;#39;m planning on visiting when I can. We live on opposite coasts though so that might be tricky.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb3fky", "score_hidden": false, "stickied": false, "created": 1492315189.0, "created_utc": 1492286389.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgarb1y", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "An_Orange_Steel", "parent_id": "t1_dgaaril", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "If you plan on taking him off your grandparents after a year, you are going to want to visit with him as often as possible. He may not take moving from his parents to his grandparents to his uncles house well. Also try to become a positive person he can be with when you do the visits. It may sound obvious, but really try to become someone in his life before you get custody because a rapid change will be emotionally taxing for both of you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you plan on taking him off your grandparents after a year, you are going to want to visit with him as often as possible. He may not take moving from his parents to his grandparents to his uncles house well. Also try to become a positive person he can be with when you do the visits. It may sound obvious, but really try to become someone in his life before you get custody because a rapid change will be emotionally taxing for both of you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgarb1y", "score_hidden": false, "stickied": false, "created": 1492298583.0, "created_utc": 1492269783.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgaueul", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "1890rafaella", "parent_id": "t1_dgaaril", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "You sound very well grounded and intelligent    Use your compassionate intuitive sense in raising him and you will be fine   He will blossom with your love ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound very well grounded and intelligent    Use your compassionate intuitive sense in raising him and you will be fine   He will blossom with your love &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaueul", "score_hidden": false, "stickied": false, "created": 1492302935.0, "created_utc": 1492274135.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgax3rr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "shaddowkhan", "parent_id": "t1_dgaaril", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Don't over think it.  I can't stress enough how important it is to communicate with your nephew. Food, shelter, education and love.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t over think it.  I can&amp;#39;t stress enough how important it is to communicate with your nephew. Food, shelter, education and love.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgax3rr", "score_hidden": false, "stickied": false, "created": 1492306640.0, "created_utc": 1492277840.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbh3ol", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CentrifugalChicken", "parent_id": "t1_dgaaril", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Kids can deal with quite a bit, but thrive under stability. That's the biggest thing you're going to give him. The rest of the stuff is easy enough to ask friends (or us?!? We will have done it in the future, Reddit??).\n\nIt sounds like you're on the right track with your well-thought out questions. \n\nGood luck, and don't be shy when asking for help or advice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kids can deal with quite a bit, but thrive under stability. That&amp;#39;s the biggest thing you&amp;#39;re going to give him. The rest of the stuff is easy enough to ask friends (or us?!? We will have done it in the future, Reddit??).&lt;/p&gt;\n\n&lt;p&gt;It sounds like you&amp;#39;re on the right track with your well-thought out questions. &lt;/p&gt;\n\n&lt;p&gt;Good luck, and don&amp;#39;t be shy when asking for help or advice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbh3ol", "score_hidden": false, "stickied": false, "created": 1492334455.0, "created_utc": 1492305655.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaaril", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dga9fvj", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Thank you for the reply! Honestly i'm out of my depth here. I don't really know how to be a \"parent\". I've cooked and done the more mechanical stuff for younger family members throughout my life, but I don't know how to actually do normal parent things and have a normal relationship with a child because I didn't have good parents.. I'm the only one of about a dozen of my siblings and cousins that also had abusive childhoods to graduate high school (with honors) and to get a decent job. I didn't want kids, but I keep hearing about how this child is abused and now my sister planning on getting rid of him because she'd rather fuck around and spend her money on drugs. I'm sure he's not in a good place, but from what I can tell, he doesn't have any developmental issues, he's above average as far as raw intelligence  goes, but he's emotionally shut in with some small outbursts and acting out (which is why he was medicated). I managed to start doing well for myself after 15 years of living with abusive parents (and my grandparents on-and off when my parents were in jail or whatever before they took me full time when I was 15). They were planning on taking him, but they're old and they struggled to raise me through high school due to health and financial issues, so I offered to take him in if they can get ahold of him and get him out of the abusive home.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the reply! Honestly i&amp;#39;m out of my depth here. I don&amp;#39;t really know how to be a &amp;quot;parent&amp;quot;. I&amp;#39;ve cooked and done the more mechanical stuff for younger family members throughout my life, but I don&amp;#39;t know how to actually do normal parent things and have a normal relationship with a child because I didn&amp;#39;t have good parents.. I&amp;#39;m the only one of about a dozen of my siblings and cousins that also had abusive childhoods to graduate high school (with honors) and to get a decent job. I didn&amp;#39;t want kids, but I keep hearing about how this child is abused and now my sister planning on getting rid of him because she&amp;#39;d rather fuck around and spend her money on drugs. I&amp;#39;m sure he&amp;#39;s not in a good place, but from what I can tell, he doesn&amp;#39;t have any developmental issues, he&amp;#39;s above average as far as raw intelligence  goes, but he&amp;#39;s emotionally shut in with some small outbursts and acting out (which is why he was medicated). I managed to start doing well for myself after 15 years of living with abusive parents (and my grandparents on-and off when my parents were in jail or whatever before they took me full time when I was 15). They were planning on taking him, but they&amp;#39;re old and they struggled to raise me through high school due to health and financial issues, so I offered to take him in if they can get ahold of him and get him out of the abusive home.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaaril", "score_hidden": false, "stickied": false, "created": 1492260399.0, "created_utc": 1492231599.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbsn7a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CH2016", "parent_id": "t1_dgb3h37", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Is there anyway you could ask your grandparents to move closer to you? Then that means you can have a better relationship and also keep an eye on how they handle it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there anyway you could ask your grandparents to move closer to you? Then that means you can have a better relationship and also keep an eye on how they handle it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbsn7a", "score_hidden": false, "stickied": false, "created": 1492354317.0, "created_utc": 1492325517.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3h37", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dgaxezs", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I'm hoping they'll be able to take him for at least a year, hopefully two or three if their health remains stable. I'm planning on visiting when i'm able to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m hoping they&amp;#39;ll be able to take him for at least a year, hopefully two or three if their health remains stable. I&amp;#39;m planning on visiting when i&amp;#39;m able to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb3h37", "score_hidden": false, "stickied": false, "created": 1492315249.0, "created_utc": 1492286449.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbo3c8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "0102030405", "parent_id": "t1_dgaxezs", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I think this is a great idea, it would be best to slowly incorporate it and not expect too much from the kid at the start. It might be overwhelming, which is why i would suggest moving slowly, but it's definitely better than the child moving to new people every once in a while (though i know sometimes that has to happen).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is a great idea, it would be best to slowly incorporate it and not expect too much from the kid at the start. It might be overwhelming, which is why i would suggest moving slowly, but it&amp;#39;s definitely better than the child moving to new people every once in a while (though i know sometimes that has to happen).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbo3c8", "score_hidden": false, "stickied": false, "created": 1492345022.0, "created_utc": 1492316222.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxezs", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Mic_Check_One_Two", "parent_id": "t1_dga9fvj", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "OP has mentioned elsewhere in the thread that his grandparents will be taking the child for the first month or two, but that the grandparents taking care of him isn't a viable long-term solution. Would it be possible for him to spend time with the child before taking custody? Let the child get to know him, and hopefully start getting comfortable with/around him while he's still being taken care of by the grandparents. It will drastically lessen the shock of moving again, because he'll at least already be familiar with OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP has mentioned elsewhere in the thread that his grandparents will be taking the child for the first month or two, but that the grandparents taking care of him isn&amp;#39;t a viable long-term solution. Would it be possible for him to spend time with the child before taking custody? Let the child get to know him, and hopefully start getting comfortable with/around him while he&amp;#39;s still being taken care of by the grandparents. It will drastically lessen the shock of moving again, because he&amp;#39;ll at least already be familiar with OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaxezs", "score_hidden": false, "stickied": false, "created": 1492307064.0, "created_utc": 1492278264.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dga9fvj", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "0102030405", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I think it's great that you're thinking about this. It will take a lot of patience, but all of the drug issues and behaviour issues can be addressed. The boy is probably very resilient, especially at his age, and people are capable of astounding change.\n\nFinancially, I think you will be alright. You have a lot of things paid for, but keeping a large emergency fund is important. I think the resources you will need the most are time and good stress management. It will be a long process of teaching your nephew how to trust people, how to respond to you teaching things or reinforcement (like if you say he did something badly, or if you do have to discipline him - not physically - but otherwise), how to respond to touching and physical boundaries, and things like that. Even just having an abused child learn that you won't abandon them is a big step.\n\nYou seem very interested in doing this, and I'm not sure how best to prepare except to be really reflective about your own experience, how you react to stress, how you react to people disagreeing with you, fighting back when you say this, and \"disrespecting\" you - as in, when people perceive someone to be disrespecting them, they usually lash out if they aren't secure in themselves.\n\nBest of luck with this - I'm sure your nephew will appreciate this. Stopping the cycle of drug addiction and/or abuse one person at a time is the best we can do, right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s great that you&amp;#39;re thinking about this. It will take a lot of patience, but all of the drug issues and behaviour issues can be addressed. The boy is probably very resilient, especially at his age, and people are capable of astounding change.&lt;/p&gt;\n\n&lt;p&gt;Financially, I think you will be alright. You have a lot of things paid for, but keeping a large emergency fund is important. I think the resources you will need the most are time and good stress management. It will be a long process of teaching your nephew how to trust people, how to respond to you teaching things or reinforcement (like if you say he did something badly, or if you do have to discipline him - not physically - but otherwise), how to respond to touching and physical boundaries, and things like that. Even just having an abused child learn that you won&amp;#39;t abandon them is a big step.&lt;/p&gt;\n\n&lt;p&gt;You seem very interested in doing this, and I&amp;#39;m not sure how best to prepare except to be really reflective about your own experience, how you react to stress, how you react to people disagreeing with you, fighting back when you say this, and &amp;quot;disrespecting&amp;quot; you - as in, when people perceive someone to be disrespecting them, they usually lash out if they aren&amp;#39;t secure in themselves.&lt;/p&gt;\n\n&lt;p&gt;Best of luck with this - I&amp;#39;m sure your nephew will appreciate this. Stopping the cycle of drug addiction and/or abuse one person at a time is the best we can do, right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dga9fvj", "score_hidden": false, "stickied": false, "created": 1492258101.0, "created_utc": 1492229301.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb3pwd", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "blocked09", "parent_id": "t1_dgb3ib6", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Exactly, it's a medication for the symptoms of his circumstance. Very glad to see you have a good understanding of the situation and are making appropriate plans for him. Well done man and good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly, it&amp;#39;s a medication for the symptoms of his circumstance. Very glad to see you have a good understanding of the situation and are making appropriate plans for him. Well done man and good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb3pwd", "score_hidden": false, "stickied": false, "created": 1492315593.0, "created_utc": 1492286793.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3ib6", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dgb1kle", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "He was prescribed them for anxiety or anger issues or some such nonsense, when the real cause is neglect and abuse. I'm hoping (and my grandparents are of the same mindset) that we can have a doctor slowly lower the dosage until he's off of them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He was prescribed them for anxiety or anger issues or some such nonsense, when the real cause is neglect and abuse. I&amp;#39;m hoping (and my grandparents are of the same mindset) that we can have a doctor slowly lower the dosage until he&amp;#39;s off of them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb3ib6", "score_hidden": false, "stickied": false, "created": 1492315295.0, "created_utc": 1492286495.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1kle", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "blocked09", "parent_id": "t1_dgam9g9", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "This is what I came here to say. Klonopin is a benzodiazepine which is used as an anti-anxiety drug. Benzo's are the most difficult drugs to stop using and must be weened off, or it'll put the person in the hospital. I assume he's taking the prescribed amount and should be relatively easy to quit, I'd take extra care with the medication as it looses it's potency fairly quickly. Best of luck man, you are a hero.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is what I came here to say. Klonopin is a benzodiazepine which is used as an anti-anxiety drug. Benzo&amp;#39;s are the most difficult drugs to stop using and must be weened off, or it&amp;#39;ll put the person in the hospital. I assume he&amp;#39;s taking the prescribed amount and should be relatively easy to quit, I&amp;#39;d take extra care with the medication as it looses it&amp;#39;s potency fairly quickly. Best of luck man, you are a hero.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb1kle", "score_hidden": false, "stickied": false, "created": 1492312692.0, "created_utc": 1492283892.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgam9g9", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "coletron3000", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "First off, I applaud your desire to help your nephew. Second, I would find out if that klonopin's prescribed by a doctor or not if you can. If it is prescribed find out why your nephew needs it, and how much/how long he's been on it. It's in a pretty dangerous class of drugs in terms of long term effects on one's brain. It's also physically addictive and he would need to titrate off it slowly under medical supervision. This isn't to say your nephew has a drug problem (he's 5 after all), but dependency on klonopin builds up with longer use. Sorry if this isn't PF worthy. I generally just lurk but I'm familiar with that medication and it's generally not easy to stop taking it due to the withdrawal symptoms. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First off, I applaud your desire to help your nephew. Second, I would find out if that klonopin&amp;#39;s prescribed by a doctor or not if you can. If it is prescribed find out why your nephew needs it, and how much/how long he&amp;#39;s been on it. It&amp;#39;s in a pretty dangerous class of drugs in terms of long term effects on one&amp;#39;s brain. It&amp;#39;s also physically addictive and he would need to titrate off it slowly under medical supervision. This isn&amp;#39;t to say your nephew has a drug problem (he&amp;#39;s 5 after all), but dependency on klonopin builds up with longer use. Sorry if this isn&amp;#39;t PF worthy. I generally just lurk but I&amp;#39;m familiar with that medication and it&amp;#39;s generally not easy to stop taking it due to the withdrawal symptoms. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgam9g9", "score_hidden": false, "stickied": false, "created": 1492290120.0, "created_utc": 1492261320.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgan6z3", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "ishoot35", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Side note, AFI 36-3006, gives your commander ability to authorize up to 21 days permissive TDY after you adopt a child. No need to dip into leave to help get him all set up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Side note, AFI 36-3006, gives your commander ability to authorize up to 21 days permissive TDY after you adopt a child. No need to dip into leave to help get him all set up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgan6z3", "score_hidden": false, "stickied": false, "created": 1492291950.0, "created_utc": 1492263150.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgalywt", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "GummyBearFighter", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Hey man, really don't know enough to help you advice wise. I really respect what you're doing and how mature you are. Let me know when this is all cleared, would love to send over some nicer toys or whatever you'll need to buy him once the paperwork and legal stuff blows over. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, really don&amp;#39;t know enough to help you advice wise. I really respect what you&amp;#39;re doing and how mature you are. Let me know when this is all cleared, would love to send over some nicer toys or whatever you&amp;#39;ll need to buy him once the paperwork and legal stuff blows over. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgalywt", "score_hidden": false, "stickied": false, "created": 1492289503.0, "created_utc": 1492260703.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgare0a", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "love2go", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I'd bet he is on Clonidine which sounds like Klonipin. Clonidine is a blood pressure med that is used in kids with ADHD, behavior issues to calm them down. It can be sedating if has any side effects. If he's on it, doing well and not having side effects, think long and get input from a child psychiatrist before stopping it. Get him in therapy and let him develop some good coping skills before taking away something that may be helping him stay out of trouble.\n\nIf it is truly Klonipin, there are much better options. Either med will need to be slowly tapered and he may have withdrawal.\n\nIf he's been through abuse, he likely has PTSD which manifests very differently in kids his age (compared to combat vets). It can take years to truly deal with the effects of abuse when working with a good therapist and there can be lifelong effects in some.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d bet he is on Clonidine which sounds like Klonipin. Clonidine is a blood pressure med that is used in kids with ADHD, behavior issues to calm them down. It can be sedating if has any side effects. If he&amp;#39;s on it, doing well and not having side effects, think long and get input from a child psychiatrist before stopping it. Get him in therapy and let him develop some good coping skills before taking away something that may be helping him stay out of trouble.&lt;/p&gt;\n\n&lt;p&gt;If it is truly Klonipin, there are much better options. Either med will need to be slowly tapered and he may have withdrawal.&lt;/p&gt;\n\n&lt;p&gt;If he&amp;#39;s been through abuse, he likely has PTSD which manifests very differently in kids his age (compared to combat vets). It can take years to truly deal with the effects of abuse when working with a good therapist and there can be lifelong effects in some.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgare0a", "score_hidden": false, "stickied": false, "created": 1492298700.0, "created_utc": 1492269900.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb48bf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BonsterM0nster", "parent_id": "t1_dgargmp", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Part of their job is to know the services that are available and point you in the right direction. If they're worth their salt, they'll be glad to help you and take care of you during this big, life-changing event.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Part of their job is to know the services that are available and point you in the right direction. If they&amp;#39;re worth their salt, they&amp;#39;ll be glad to help you and take care of you during this big, life-changing event.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb48bf", "score_hidden": false, "stickied": false, "created": 1492316295.0, "created_utc": 1492287495.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgargmp", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "shootyD", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I don't see very many comments on here about this, talk to your leadership! Your supervisor, first sergeant, and probably even commander should know your intentions. This way the can offer advice, and help you when the time comes. Your leadership is going to have to get involved at some point, like getting you out of the dorms or signing and approving various things. They'd probably rather hear your plan before hand, instead of when you run into an issue. Hopefully your leadership is helpful. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t see very many comments on here about this, talk to your leadership! Your supervisor, first sergeant, and probably even commander should know your intentions. This way the can offer advice, and help you when the time comes. Your leadership is going to have to get involved at some point, like getting you out of the dorms or signing and approving various things. They&amp;#39;d probably rather hear your plan before hand, instead of when you run into an issue. Hopefully your leadership is helpful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgargmp", "score_hidden": false, "stickied": false, "created": 1492298802.0, "created_utc": 1492270002.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dga943j", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dga8rlo", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I have family members who could/would help out if I did deploy. I'm in a career field that doesn't deploy terribly often (I'm definitely not saying it won't happen) I'm on good terms with some aunts/uncles who could help out, and my grandparents would still likely be capable enough to take care of him with some financial support from myself.\n\nI don't WANT to have a child, but I'm willing to take one that's being abused. I wouldn't resent him, it's totally my choice. No one asked me to or even suggested it, my grandparents are moving to take him but just getting on in years and likely not able to full-time for the next decade. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have family members who could/would help out if I did deploy. I&amp;#39;m in a career field that doesn&amp;#39;t deploy terribly often (I&amp;#39;m definitely not saying it won&amp;#39;t happen) I&amp;#39;m on good terms with some aunts/uncles who could help out, and my grandparents would still likely be capable enough to take care of him with some financial support from myself.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t WANT to have a child, but I&amp;#39;m willing to take one that&amp;#39;s being abused. I wouldn&amp;#39;t resent him, it&amp;#39;s totally my choice. No one asked me to or even suggested it, my grandparents are moving to take him but just getting on in years and likely not able to full-time for the next decade. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dga943j", "score_hidden": false, "stickied": false, "created": 1492257561.0, "created_utc": 1492228761.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dga8t36", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "LineBreakBot", "parent_id": "t1_dga8rlo", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "You might have incorrectly formatted line breaks. To create a line break, either put two spaces at the end of the line or put an extra blank line in-between lines. ([See Reddit's page on commenting for more information.](http://www.reddit.com/wiki/commenting))\n\nI have attempted to automatically reformat your text with fixed line breaks.\n\nYour text might contain incorrectly formatted list(s). To format a list properly, add a space between the bullet points and list items, and add a blank line before the start of the list.\n\n----\n\n&gt; Some things to think about are:  \n&gt;   \n&gt; 1.  As a single parent, You'll be required to have a written plan for caring for him when you deploy.  \n&gt; 2.  Misbehaving dependents can have negative career impacts for you.  \n&gt; 3.  You don't want children, but are going to take custody of a child?  \n&gt; 4.  Don't assume that the courts will necessarily go along with all of your plans.\n&gt;   \n&gt; In the mean time, work hard, volunteer, dress sharp and get BTZ - more money always helps.  \n&gt;\n\n----\n\n^(I am a bot. Contact) ^[pentium4borg](https://www.reddit.com/user/pentium4borg) ^(with any feedback.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might have incorrectly formatted line breaks. To create a line break, either put two spaces at the end of the line or put an extra blank line in-between lines. (&lt;a href=\"http://www.reddit.com/wiki/commenting\"&gt;See Reddit&amp;#39;s page on commenting for more information.&lt;/a&gt;)&lt;/p&gt;\n\n&lt;p&gt;I have attempted to automatically reformat your text with fixed line breaks.&lt;/p&gt;\n\n&lt;p&gt;Your text might contain incorrectly formatted list(s). To format a list properly, add a space between the bullet points and list items, and add a blank line before the start of the list.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Some things to think about are:  &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt; As a single parent, You&amp;#39;ll be required to have a written plan for caring for him when you deploy.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt; Misbehaving dependents can have negative career impacts for you.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt; You don&amp;#39;t want children, but are going to take custody of a child?&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt; Don&amp;#39;t assume that the courts will necessarily go along with all of your plans.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;In the mean time, work hard, volunteer, dress sharp and get BTZ - more money always helps.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;I am a bot. Contact&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/user/pentium4borg\"&gt;pentium4borg&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;with any feedback.&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dga8t36", "score_hidden": false, "stickied": false, "created": 1492257054.0, "created_utc": 1492228254.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dga8rlo", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "c0-al", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Some things to think about are:\n1.  As a single parent, You'll be required to have a written plan for caring for him when you deploy.\n2.  Misbehaving dependents can have negative career impacts for you.\n3.  You don't want children, but are going to take custody of a child?\n4.  Don't assume that the courts will necessarily go along with all of your plans.\n\nIn the mean time, work hard, volunteer, dress sharp and get BTZ - more money always helps.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some things to think about are:\n1.  As a single parent, You&amp;#39;ll be required to have a written plan for caring for him when you deploy.\n2.  Misbehaving dependents can have negative career impacts for you.\n3.  You don&amp;#39;t want children, but are going to take custody of a child?\n4.  Don&amp;#39;t assume that the courts will necessarily go along with all of your plans.&lt;/p&gt;\n\n&lt;p&gt;In the mean time, work hard, volunteer, dress sharp and get BTZ - more money always helps.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dga8rlo", "score_hidden": false, "stickied": false, "created": 1492256986.0, "created_utc": 1492228186.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgarljm", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "engineerhear", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "This is a CINA (Child in need of assistance) case and CPS (Child Protective Services) needs to step in to address the child's needs. The child needs to be assigned a Social Worker and an Attorney. The Judge and CPS will determine the best placement for the child. They will also determine services that may need to be provided (financial assistance, medical, physical, residential, educational etc.).\n\nRequest the child be appointed a CASA (court appointed special advocate). A CASA will help address the court regarding all the child's needs to be sure the system is providing the best resources emotionally, physically, and socially for the child. \n\nDO NOT make medication changes for the kid on your behalf. Let a psychologist and psychiatrist as a team decipher the proper medication plan. \n\nI know you want to help, but you make just enough to scrape by on your own, and you use all of your time to do that. CPS will require time be a large resource to dedicate to the child which will eventually be a huge commitment that may overwhelm you and eventually put you in over your head. Do the right thing and use the system as a resource. Request a CASA to help the child.", "edited": 1492270692.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a CINA (Child in need of assistance) case and CPS (Child Protective Services) needs to step in to address the child&amp;#39;s needs. The child needs to be assigned a Social Worker and an Attorney. The Judge and CPS will determine the best placement for the child. They will also determine services that may need to be provided (financial assistance, medical, physical, residential, educational etc.).&lt;/p&gt;\n\n&lt;p&gt;Request the child be appointed a CASA (court appointed special advocate). A CASA will help address the court regarding all the child&amp;#39;s needs to be sure the system is providing the best resources emotionally, physically, and socially for the child. &lt;/p&gt;\n\n&lt;p&gt;DO NOT make medication changes for the kid on your behalf. Let a psychologist and psychiatrist as a team decipher the proper medication plan. &lt;/p&gt;\n\n&lt;p&gt;I know you want to help, but you make just enough to scrape by on your own, and you use all of your time to do that. CPS will require time be a large resource to dedicate to the child which will eventually be a huge commitment that may overwhelm you and eventually put you in over your head. Do the right thing and use the system as a resource. Request a CASA to help the child.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgarljm", "score_hidden": false, "stickied": false, "created": 1492298995.0, "created_utc": 1492270195.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgcx3k7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shadow1515", "parent_id": "t1_dgax5x6", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Probably not the best choice, if he stays on active duty he has free healthcare for himself and the child as well as an income already equivalent to the national household median which is only going to grow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably not the best choice, if he stays on active duty he has free healthcare for himself and the child as well as an income already equivalent to the national household median which is only going to grow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgcx3k7", "score_hidden": false, "stickied": false, "created": 1492422110.0, "created_utc": 1492393310.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgax5x6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "yoadrian209", "parent_id": "t1_dgasz4l", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I think OP might qualify for a hardship discharge if he wanted to go that route also.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think OP might qualify for a hardship discharge if he wanted to go that route also.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgax5x6", "score_hidden": false, "stickied": false, "created": 1492306723.0, "created_utc": 1492277923.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb0wxj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ViperNerd", "parent_id": "t1_dgasz4l", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Still called a family cafe plan in the AF too ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Still called a family cafe plan in the AF too ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb0wxj", "score_hidden": false, "stickied": false, "created": 1492311830.0, "created_utc": 1492283030.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgasz4l", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "zekthedeadcow", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Former Army Legal NCO here...\n\nTalk to Legal (They won't help with civil litigation but there are other factors)   ... and probably Finance...\n\nI've never done adoptions... well.. a kidnapping by CPS once... but it got sorted out...fun times... :)\n\nObviously you're not going to be having a kid in the dorms.  Plus as a single parent you will need an AF equivalent of a Family Care Plan.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Former Army Legal NCO here...&lt;/p&gt;\n\n&lt;p&gt;Talk to Legal (They won&amp;#39;t help with civil litigation but there are other factors)   ... and probably Finance...&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never done adoptions... well.. a kidnapping by CPS once... but it got sorted out...fun times... :)&lt;/p&gt;\n\n&lt;p&gt;Obviously you&amp;#39;re not going to be having a kid in the dorms.  Plus as a single parent you will need an AF equivalent of a Family Care Plan.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgasz4l", "score_hidden": false, "stickied": false, "created": 1492300931.0, "created_utc": 1492272131.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgatpkm", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "bustervich", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "In case no one else has mentioned this, here goes: Tell your chain of command immediately. If you haven't told anyone, then need time off to take care of a kid, take them to an appointment, whatever, it won't go well. Most chains of command will bend over backwards to help someone in a situation like yours, so the sooner you tell them, the more help you can get.\n\nHaving a kid in the military will mean more paperwork for you, but keeping it on the DL will blow up in your face.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In case no one else has mentioned this, here goes: Tell your chain of command immediately. If you haven&amp;#39;t told anyone, then need time off to take care of a kid, take them to an appointment, whatever, it won&amp;#39;t go well. Most chains of command will bend over backwards to help someone in a situation like yours, so the sooner you tell them, the more help you can get.&lt;/p&gt;\n\n&lt;p&gt;Having a kid in the military will mean more paperwork for you, but keeping it on the DL will blow up in your face.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgatpkm", "score_hidden": false, "stickied": false, "created": 1492301949.0, "created_utc": 1492273149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgawdkw", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Th3Roman", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Hey man, take a trip to your first sergeant and legal office. They will 100% hook you up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, take a trip to your first sergeant and legal office. They will 100% hook you up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgawdkw", "score_hidden": false, "stickied": false, "created": 1492305652.0, "created_utc": 1492276852.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgcx8th", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shadow1515", "parent_id": "t1_dgakz70", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Nice thing about military is your housing allowance is based on where you live. In LA, with a dependent, it's going to be at *least* $2469 monthly, tax free, and it only goes up with rank.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice thing about military is your housing allowance is based on where you live. In LA, with a dependent, it&amp;#39;s going to be at &lt;em&gt;least&lt;/em&gt; $2469 monthly, tax free, and it only goes up with rank.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgcx8th", "score_hidden": false, "stickied": false, "created": 1492422309.0, "created_utc": 1492393509.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakz70", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "barbecueer", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "He's five, so he's going to kindergarten the first thing you want to do it let him know he's in a safe place. 50k a year should be fine, unless you live in LA where living in crazy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s five, so he&amp;#39;s going to kindergarten the first thing you want to do it let him know he&amp;#39;s in a safe place. 50k a year should be fine, unless you live in LA where living in crazy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgakz70", "score_hidden": false, "stickied": false, "created": 1492287252.0, "created_utc": 1492258452.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgaux1f", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "broeklien", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I have no advice, but just wanted to say that you are a wonderful person for setting this up and devoting your life to this boy. \n\nI hope you get lots of help and an awesome father to son bond with this boy. \n\nAll the best and good luck!\nYou made my day all better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have no advice, but just wanted to say that you are a wonderful person for setting this up and devoting your life to this boy. &lt;/p&gt;\n\n&lt;p&gt;I hope you get lots of help and an awesome father to son bond with this boy. &lt;/p&gt;\n\n&lt;p&gt;All the best and good luck!\nYou made my day all better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaux1f", "score_hidden": false, "stickied": false, "created": 1492303658.0, "created_utc": 1492274858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgav3d4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ng300", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I don't have any advice but wow you're a great person. I wish the best for you and your nephew ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have any advice but wow you&amp;#39;re a great person. I wish the best for you and your nephew &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgav3d4", "score_hidden": false, "stickied": false, "created": 1492303906.0, "created_utc": 1492275106.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgaw6g3", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "dreadscaper", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I don't know if this is a good idea. You're in the air force and single so you would be going into the field or whatever they call training missions in the air force. You can't just leave him alone for days at a time. Daycare or not he needs a lot of loving attention right now to avoid developing issues his mother will cause. If he's been abused this much he's going to have some behavioral issues.\n\nI wish you the best luck. But maybe try to adopt him in your name and have grandma and grandpa help a lot while you provide money to help him grow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if this is a good idea. You&amp;#39;re in the air force and single so you would be going into the field or whatever they call training missions in the air force. You can&amp;#39;t just leave him alone for days at a time. Daycare or not he needs a lot of loving attention right now to avoid developing issues his mother will cause. If he&amp;#39;s been abused this much he&amp;#39;s going to have some behavioral issues.&lt;/p&gt;\n\n&lt;p&gt;I wish you the best luck. But maybe try to adopt him in your name and have grandma and grandpa help a lot while you provide money to help him grow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaw6g3", "score_hidden": false, "stickied": false, "created": 1492305386.0, "created_utc": 1492276586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbocar", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chavrus", "parent_id": "t1_dgb3uen", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "You take care! I am happy you were able to rescue yourself and join the Air Force! You are to be commended for having the strength. Never let your past define your future! I wish you and your nephew well. Continue to be a good role model!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You take care! I am happy you were able to rescue yourself and join the Air Force! You are to be commended for having the strength. Never let your past define your future! I wish you and your nephew well. Continue to be a good role model!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbocar", "score_hidden": false, "stickied": false, "created": 1492345454.0, "created_utc": 1492316654.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3uen", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dgayfes", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I'm not taking him in right now, this is a future plan. My grandparents will hopefully be able to take him for a couple of years (less if we're unlucky, obviously) and provide him with a loving, normal home (they're very kind people, they took me in when I ran away from home at 15 because I couldn't deal with getting screamed at and smacked around anymore) so I fully trust them to care for him. They're just too old to do it for the next 15 years, you know? In my mind the best scenario would be for them to keep him for a few years until he's healthy and loved, and to get to know me for awhile before I just take him. This is more a distant inevitability than something that's happening tomorrow. I'm sorry if i wasn't clear enough.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not taking him in right now, this is a future plan. My grandparents will hopefully be able to take him for a couple of years (less if we&amp;#39;re unlucky, obviously) and provide him with a loving, normal home (they&amp;#39;re very kind people, they took me in when I ran away from home at 15 because I couldn&amp;#39;t deal with getting screamed at and smacked around anymore) so I fully trust them to care for him. They&amp;#39;re just too old to do it for the next 15 years, you know? In my mind the best scenario would be for them to keep him for a few years until he&amp;#39;s healthy and loved, and to get to know me for awhile before I just take him. This is more a distant inevitability than something that&amp;#39;s happening tomorrow. I&amp;#39;m sorry if i wasn&amp;#39;t clear enough.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb3uen", "score_hidden": false, "stickied": false, "created": 1492315769.0, "created_utc": 1492286969.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgayfes", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "chavrus", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Please get with social services and find a 2 parent established home. You could remain his uncle. You are too young for this responsiblity. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please get with social services and find a 2 parent established home. You could remain his uncle. You are too young for this responsiblity. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgayfes", "score_hidden": false, "stickied": false, "created": 1492308429.0, "created_utc": 1492279629.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgas8ye", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "vagrantheather", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Hello there! Sounds like you have a good head on your shoulders and are the best shot this kiddo has at a stable future. I hope it works out for you! One thing I don't think anyone has addressed (probably because this is not a CPS page) is that your age might be a barrier. The state I worked for (MO) did not allow adoptions under the age of 21. We DID allow something called a \"kinship\" placement, though; this is where you would provide all the care for the child, but he would still technically be \"in\" foster care. This would go on until you are 21. At that point, assuming everything is going smoothly, you would be able to adopt him. \n\nIs this kid located in another state? It is a pretty long and annoying process to get an ICPC (interstate) placement arranged. It IS worthwhile - but you should definitely know it can take several months!\n\nIs this child recently in foster care? The first priority of any foster care case is to reunite with the family member they come in from. So, if he was removed from his mother's care, she would be given at minimum a year to go through counceling, drug treatment, parenting classes, etc to try to get him back. The courts REALLY don't like removing a kid very far from a parent who is working to get custody again, because they want to provide every opportunity for the relationship to be salvaged. So, if this is a new case, they are probably not anywhere close to looking for an adoptive home. It could be a year or more before they are, and during that time, the kiddo will need a place to stay that's in driving distance from mom.\n\nRegarding adoption by family. There is a legal requirement for the family to give priority first to any other parent (is the dad in the picture? Do they know who dad is?), then to any interested grandparent. Another family member would not be considered unless these other people were not options. In many families, this is an all-out battle to the death. So it is important that everyone is on the same page. \n\nFinally... When the child's case goal turns from \"reunify with mom\" to \"find an adoptive home\" (again, usually a year or longer into an open foster care case), the first people the worker will look at are the people the child has lived with during the case. If there was a family member the child lived with, they'll get priority. If there was no family nearby and the kid lived in a foster home, it's not a clear cut answer. Your best bet to get custody is to stay involved in the case all the way through. Attend the court hearings if you're able. Attend all \"family support meetings\" (where everyone is brought up to date on the case). Call to check in with the caseworker and make sure you know what's going on. Be a support resource for the kid (calling them up, getting to know them, providing them with clothing/toys/hygiene supplies/etc to show that you are willing and able to support them). Those things go a LONG way in your favor when it comes to the \"adoption staffing.\" The adoption staffing is a big meeting that the case worker, juvenile officer, Guardian Ad Litem (the child's appointed attorney), and even parents/grandparents participate in where potential adoptive resources (yourself, a foster parent who cared for the child, another relative, whoever) are officially interviewed for adoption and the participants choose who is the best possible caregiver for this child. Like I said earlier, family IS given preference, but it's more important that the kiddo feels comfortable with the person and that they are going to provide a stable home. So like, \"cousin I don't know very well\" might be lower on the totem pole than \"foster parent who's cared for me for the last year\" at that point. That relationship you build, and the support you provide, and your participation in the length of the case, those are the things that will tip the decision in your favor. But even then - age discrimination does play a factor. Many people will look at your age and think you can't do it. Your ability to show that you are stable and reliable are very important. Pay a lot of attention to how you come across.\n\nI know none of that was personal finance related, but I hope it helps! Good luck!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello there! Sounds like you have a good head on your shoulders and are the best shot this kiddo has at a stable future. I hope it works out for you! One thing I don&amp;#39;t think anyone has addressed (probably because this is not a CPS page) is that your age might be a barrier. The state I worked for (MO) did not allow adoptions under the age of 21. We DID allow something called a &amp;quot;kinship&amp;quot; placement, though; this is where you would provide all the care for the child, but he would still technically be &amp;quot;in&amp;quot; foster care. This would go on until you are 21. At that point, assuming everything is going smoothly, you would be able to adopt him. &lt;/p&gt;\n\n&lt;p&gt;Is this kid located in another state? It is a pretty long and annoying process to get an ICPC (interstate) placement arranged. It IS worthwhile - but you should definitely know it can take several months!&lt;/p&gt;\n\n&lt;p&gt;Is this child recently in foster care? The first priority of any foster care case is to reunite with the family member they come in from. So, if he was removed from his mother&amp;#39;s care, she would be given at minimum a year to go through counceling, drug treatment, parenting classes, etc to try to get him back. The courts REALLY don&amp;#39;t like removing a kid very far from a parent who is working to get custody again, because they want to provide every opportunity for the relationship to be salvaged. So, if this is a new case, they are probably not anywhere close to looking for an adoptive home. It could be a year or more before they are, and during that time, the kiddo will need a place to stay that&amp;#39;s in driving distance from mom.&lt;/p&gt;\n\n&lt;p&gt;Regarding adoption by family. There is a legal requirement for the family to give priority first to any other parent (is the dad in the picture? Do they know who dad is?), then to any interested grandparent. Another family member would not be considered unless these other people were not options. In many families, this is an all-out battle to the death. So it is important that everyone is on the same page. &lt;/p&gt;\n\n&lt;p&gt;Finally... When the child&amp;#39;s case goal turns from &amp;quot;reunify with mom&amp;quot; to &amp;quot;find an adoptive home&amp;quot; (again, usually a year or longer into an open foster care case), the first people the worker will look at are the people the child has lived with during the case. If there was a family member the child lived with, they&amp;#39;ll get priority. If there was no family nearby and the kid lived in a foster home, it&amp;#39;s not a clear cut answer. Your best bet to get custody is to stay involved in the case all the way through. Attend the court hearings if you&amp;#39;re able. Attend all &amp;quot;family support meetings&amp;quot; (where everyone is brought up to date on the case). Call to check in with the caseworker and make sure you know what&amp;#39;s going on. Be a support resource for the kid (calling them up, getting to know them, providing them with clothing/toys/hygiene supplies/etc to show that you are willing and able to support them). Those things go a LONG way in your favor when it comes to the &amp;quot;adoption staffing.&amp;quot; The adoption staffing is a big meeting that the case worker, juvenile officer, Guardian Ad Litem (the child&amp;#39;s appointed attorney), and even parents/grandparents participate in where potential adoptive resources (yourself, a foster parent who cared for the child, another relative, whoever) are officially interviewed for adoption and the participants choose who is the best possible caregiver for this child. Like I said earlier, family IS given preference, but it&amp;#39;s more important that the kiddo feels comfortable with the person and that they are going to provide a stable home. So like, &amp;quot;cousin I don&amp;#39;t know very well&amp;quot; might be lower on the totem pole than &amp;quot;foster parent who&amp;#39;s cared for me for the last year&amp;quot; at that point. That relationship you build, and the support you provide, and your participation in the length of the case, those are the things that will tip the decision in your favor. But even then - age discrimination does play a factor. Many people will look at your age and think you can&amp;#39;t do it. Your ability to show that you are stable and reliable are very important. Pay a lot of attention to how you come across.&lt;/p&gt;\n\n&lt;p&gt;I know none of that was personal finance related, but I hope it helps! Good luck!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgas8ye", "score_hidden": false, "stickied": false, "created": 1492299912.0, "created_utc": 1492271112.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb06ga", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bohmapik", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Klonopin in a benzo. I was prescribed it for a year for anxiety, and cannot think for the life of me why a child would be taking it. It is like Xanax. That's nucking futs. Yeah, he should have that decision reevaluated for sure. As for the financial part of my comment, I would put aside as much of the dependent money as you possibly can after his necessary expenses. Give him a nice little nest egg for a graduation gift (I'd say college graduation). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Klonopin in a benzo. I was prescribed it for a year for anxiety, and cannot think for the life of me why a child would be taking it. It is like Xanax. That&amp;#39;s nucking futs. Yeah, he should have that decision reevaluated for sure. As for the financial part of my comment, I would put aside as much of the dependent money as you possibly can after his necessary expenses. Give him a nice little nest egg for a graduation gift (I&amp;#39;d say college graduation). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb06ga", "score_hidden": false, "stickied": false, "created": 1492310845.0, "created_utc": 1492282045.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb0rqd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "teleterminal", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I think your number one course of action should be to talk to your flight chiefs and shirt. An experienced shirt will have either delt with this before or know all the resources that can help you succeed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your number one course of action should be to talk to your flight chiefs and shirt. An experienced shirt will have either delt with this before or know all the resources that can help you succeed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb0rqd", "score_hidden": false, "stickied": false, "created": 1492311639.0, "created_utc": 1492282839.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb9y0j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "leleusi", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Honestly man I don't know anything about military life or parenting, I just want to thank you for doing this. \n\nBeing a fair bit older than yourself, I can certainly attest to the challenges of growing up in any form of abusive home. \n\nThank you for helping this child. Wish there were more out there like you, not only those with the means to help, but those who actively seek it simply to do so. \n\nThank you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly man I don&amp;#39;t know anything about military life or parenting, I just want to thank you for doing this. &lt;/p&gt;\n\n&lt;p&gt;Being a fair bit older than yourself, I can certainly attest to the challenges of growing up in any form of abusive home. &lt;/p&gt;\n\n&lt;p&gt;Thank you for helping this child. Wish there were more out there like you, not only those with the means to help, but those who actively seek it simply to do so. &lt;/p&gt;\n\n&lt;p&gt;Thank you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb9y0j", "score_hidden": false, "stickied": false, "created": 1492324213.0, "created_utc": 1492295413.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbkjwx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Swift06", "parent_id": "t1_dgaz1xo", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Exactly. Age doesn't determine maturity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly. Age doesn&amp;#39;t determine maturity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbkjwx", "score_hidden": false, "stickied": false, "created": 1492339530.0, "created_utc": 1492310730.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaz1xo", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Yo_2T", "parent_id": "t1_dgau68j", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "A young uncle who's trying his best sounds infinitely better than druggie mother and her army of boyfriends or foster care...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A young uncle who&amp;#39;s trying his best sounds infinitely better than druggie mother and her army of boyfriends or foster care...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaz1xo", "score_hidden": false, "stickied": false, "created": 1492309281.0, "created_utc": 1492280481.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgau68j", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "WarriorForPeace", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Really not a good idea at 18.  In fact, a terrible idea.  Better to at least build your own life up for a few years first before you try to save others or else you will fall into the abyss and that won't be good for anyone", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really not a good idea at 18.  In fact, a terrible idea.  Better to at least build your own life up for a few years first before you try to save others or else you will fall into the abyss and that won&amp;#39;t be good for anyone&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgau68j", "score_hidden": false, "stickied": false, "created": 1492302596.0, "created_utc": 1492273796.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbtmh3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PaxilonHydrochlorate", "parent_id": "t1_dgbt8ha", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "No, it's just a heads up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, it&amp;#39;s just a heads up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbtmh3", "score_hidden": false, "stickied": false, "created": 1492356966.0, "created_utc": 1492328166.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbt8ha", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "partypwny", "parent_id": "t1_dgb7hou", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Is that excessive?\n\nRegardless I meant -1st Lt USAF not hashtag. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is that excessive?&lt;/p&gt;\n\n&lt;p&gt;Regardless I meant -1st Lt USAF not hashtag. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbt8ha", "score_hidden": false, "stickied": false, "created": 1492355907.0, "created_utc": 1492327107.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7hou", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PaxilonHydrochlorate", "parent_id": "t1_dgatu8h", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Please be aware using \"#\" at the being of a line bold the text. Excessive formatting abuse can lead to removals of comments.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please be aware using &amp;quot;#&amp;quot; at the being of a line bold the text. Excessive formatting abuse can lead to removals of comments.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb7hou", "score_hidden": false, "stickied": false, "created": 1492320781.0, "created_utc": 1492291981.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgatu8h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "partypwny", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Make sure your first sergeant, supervisor and commander are all in the loop. You'll be surprised how much help they can provide. Also MFLC is a great source of advice plus base legal. \nAre you in the airmen dorms right now? If you have a dependent you'll have to move hopefully base housing has something otherwise you may need to move off base and this adds new stresses to your life. \n\nI'm sure you'll find plenty but of good advice on this topic here. Good luck\n\n#1LT USAF", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make sure your first sergeant, supervisor and commander are all in the loop. You&amp;#39;ll be surprised how much help they can provide. Also MFLC is a great source of advice plus base legal. \nAre you in the airmen dorms right now? If you have a dependent you&amp;#39;ll have to move hopefully base housing has something otherwise you may need to move off base and this adds new stresses to your life. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure you&amp;#39;ll find plenty but of good advice on this topic here. Good luck&lt;/p&gt;\n\n&lt;h1&gt;1LT USAF&lt;/h1&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgatu8h", "score_hidden": false, "stickied": false, "created": 1492302132.0, "created_utc": 1492273332.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgauelb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fly_away_octopus", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "This is awesome and you've gotten a lot of great advice. Given that you have some time I'd say look into finding a good child psychiatrist and psychologist that works with your insurance. The waitlist can be long depending on where you live. Make sure you mention his history and medication when speaking to them so you get a good match. If you can start bringing him to the therapist before transitioning households (grandparents to you) that would probably make it easier on everyone. \n\nAlso, When speaking to schools make sure they know about his history. Don't be afraid to inquire about and push for a 504 plan or special education services if you think he needs them (may not be long term but possibly short term with the medication/behavior). The psychologist can also help you with this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is awesome and you&amp;#39;ve gotten a lot of great advice. Given that you have some time I&amp;#39;d say look into finding a good child psychiatrist and psychologist that works with your insurance. The waitlist can be long depending on where you live. Make sure you mention his history and medication when speaking to them so you get a good match. If you can start bringing him to the therapist before transitioning households (grandparents to you) that would probably make it easier on everyone. &lt;/p&gt;\n\n&lt;p&gt;Also, When speaking to schools make sure they know about his history. Don&amp;#39;t be afraid to inquire about and push for a 504 plan or special education services if you think he needs them (may not be long term but possibly short term with the medication/behavior). The psychologist can also help you with this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgauelb", "score_hidden": false, "stickied": false, "created": 1492302924.0, "created_utc": 1492274124.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgauxaa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LaffinIdUp", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "So good of you to take him in.  Please be careful with that klonopin.  Do some research on it.  Find out the dosage amount he's been prescribed, how long he's been on it, and hopefully your sister hasn't been giving him any extra, she hopefully took any extra for herself, but you never know).  It is addicting, and he should probably start slowly weaning off it ASAP.   A kid that young shouldn't be on it.   Best of everything to you and your nephew, and thank you for your service. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So good of you to take him in.  Please be careful with that klonopin.  Do some research on it.  Find out the dosage amount he&amp;#39;s been prescribed, how long he&amp;#39;s been on it, and hopefully your sister hasn&amp;#39;t been giving him any extra, she hopefully took any extra for herself, but you never know).  It is addicting, and he should probably start slowly weaning off it ASAP.   A kid that young shouldn&amp;#39;t be on it.   Best of everything to you and your nephew, and thank you for your service. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgauxaa", "score_hidden": false, "stickied": false, "created": 1492303668.0, "created_utc": 1492274868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgazuta", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ferocem", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I think this is an incredible thing you are doing! I highly recommend meeting with a counselor regularly before and during the time you're raising him. It will help prepare your heart and mind for parenthood and parenthood isn't easy and will most certainly bring out sides of yourself that you didn't know existed (good and bad). It's a long journey, but a very love filled one. Thank you for doing this for him.\n\nEdit: Also recommend taking the time to find a really good counselor that you like and feel comfortable with that specializes in individual/family/child therapy possibly outside of the military. You may have to budget for this short and long term as tricare prime may not cover the counselor you want.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is an incredible thing you are doing! I highly recommend meeting with a counselor regularly before and during the time you&amp;#39;re raising him. It will help prepare your heart and mind for parenthood and parenthood isn&amp;#39;t easy and will most certainly bring out sides of yourself that you didn&amp;#39;t know existed (good and bad). It&amp;#39;s a long journey, but a very love filled one. Thank you for doing this for him.&lt;/p&gt;\n\n&lt;p&gt;Edit: Also recommend taking the time to find a really good counselor that you like and feel comfortable with that specializes in individual/family/child therapy possibly outside of the military. You may have to budget for this short and long term as tricare prime may not cover the counselor you want.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgazuta", "score_hidden": false, "stickied": false, "created": 1492310400.0, "created_utc": 1492281600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb60c7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "snoopy369", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "One suggestion I would have is that you should read some different books or articles on parenting before you start. From what I have seen military parents tend towards a single way to handle discipline - a very heavy handed approach that may not work for everyone. Learn some different tactics then use what works for you. Don't feel that you have to parent the same way the other folks do; find the balance that is right for you and him and stick with it. It will be easier if you figure out some of the different approaches ahead of time.\n\nIn particular, you may want to look up some light or even no-discipline methods of raising kids. Given your past and his, some of these approaches can work much better; they focus on helping the child learn why proper behavior is appropriate (and when it's okay to go out of bounds a little), leading them to choose to behave well rather than forcing them to. This will be a bit odd in a military environment for obvious reasons but can be very helpful with kids from abusive situations - even if you don't go all the way and just take some pieces from several different approaches. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One suggestion I would have is that you should read some different books or articles on parenting before you start. From what I have seen military parents tend towards a single way to handle discipline - a very heavy handed approach that may not work for everyone. Learn some different tactics then use what works for you. Don&amp;#39;t feel that you have to parent the same way the other folks do; find the balance that is right for you and him and stick with it. It will be easier if you figure out some of the different approaches ahead of time.&lt;/p&gt;\n\n&lt;p&gt;In particular, you may want to look up some light or even no-discipline methods of raising kids. Given your past and his, some of these approaches can work much better; they focus on helping the child learn why proper behavior is appropriate (and when it&amp;#39;s okay to go out of bounds a little), leading them to choose to behave well rather than forcing them to. This will be a bit odd in a military environment for obvious reasons but can be very helpful with kids from abusive situations - even if you don&amp;#39;t go all the way and just take some pieces from several different approaches. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb60c7", "score_hidden": false, "stickied": false, "created": 1492318715.0, "created_utc": 1492289915.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb8jdr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "randomserenity", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I just want to say good luck and good on you. You are head and shoulders above most 18 year olds. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just want to say good luck and good on you. You are head and shoulders above most 18 year olds. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb8jdr", "score_hidden": false, "stickied": false, "created": 1492322216.0, "created_utc": 1492293416.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbg4yn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SneakyySquidd", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "This isn't a personal finance comment - but thanks for being a fucking champ dude", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t a personal finance comment - but thanks for being a fucking champ dude&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbg4yn", "score_hidden": false, "stickied": false, "created": 1492333089.0, "created_utc": 1492304289.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbj8js", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mrt638", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Please speak to your first shirt. You will qualify to move off base when you get a nephew as well as receive BAH w/ dependent which makes a huge difference. You will also more likely quality to receive free childcare from the CDC. The Air Force is amazing at supporting there troops. There is so many resources available to you especially because your active air force. If you have a half decent first shirt he will guide you thru everything. For the love of god, please let your leadership know your situation as this will help them help you and get your hours around child care. Source: currently active SrA", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please speak to your first shirt. You will qualify to move off base when you get a nephew as well as receive BAH w/ dependent which makes a huge difference. You will also more likely quality to receive free childcare from the CDC. The Air Force is amazing at supporting there troops. There is so many resources available to you especially because your active air force. If you have a half decent first shirt he will guide you thru everything. For the love of god, please let your leadership know your situation as this will help them help you and get your hours around child care. Source: currently active SrA&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbj8js", "score_hidden": false, "stickied": false, "created": 1492337588.0, "created_utc": 1492308788.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbx3et", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Officer_Coldhonkey", "parent_id": "t1_dgayups", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Yes. I do. It's unfortunate. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. I do. It&amp;#39;s unfortunate. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbx3et", "score_hidden": false, "stickied": false, "created": 1492368434.0, "created_utc": 1492339634.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgayups", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hypophora", "parent_id": "t1_dgattl0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "It looks like the alternative is foster care. Do you really think that's the better option?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like the alternative is foster care. Do you really think that&amp;#39;s the better option?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgayups", "score_hidden": false, "stickied": false, "created": 1492309003.0, "created_utc": 1492280203.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb9zl5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kennedys_Dad", "parent_id": "t1_dgb8p50", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Give it time..... you'll change your mind. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Give it time..... you&amp;#39;ll change your mind. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb9zl5", "score_hidden": false, "stickied": false, "created": 1492324275.0, "created_utc": 1492295475.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb8p50", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dgb7x1c", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I'm about a year into a six year enlistment, and reenlisting is something i've been seriously considering.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m about a year into a six year enlistment, and reenlisting is something i&amp;#39;ve been seriously considering.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb8p50", "score_hidden": false, "stickied": false, "created": 1492322441.0, "created_utc": 1492293641.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7x1c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kennedys_Dad", "parent_id": "t1_dgb42ry", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Then why are you asking? You'll likely be out of the military by the time this happens. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then why are you asking? You&amp;#39;ll likely be out of the military by the time this happens. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb7x1c", "score_hidden": false, "stickied": false, "created": 1492321358.0, "created_utc": 1492292558.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb8mlk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Casual_Spatula", "parent_id": "t1_dgb42ry", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Just because it will be hard doesn't mean you can't do it man. I'm just saying that you, as someone who had struggles, will most likely understand things this child will need you to understand. You're young, and this may not be what you want in life, but I want you to know that even when it's hard, it can be done. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just because it will be hard doesn&amp;#39;t mean you can&amp;#39;t do it man. I&amp;#39;m just saying that you, as someone who had struggles, will most likely understand things this child will need you to understand. You&amp;#39;re young, and this may not be what you want in life, but I want you to know that even when it&amp;#39;s hard, it can be done. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb8mlk", "score_hidden": false, "stickied": false, "created": 1492322339.0, "created_utc": 1492293539.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb42ry", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dgavckw", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I respect your opinion, but I want to clarify that he isn't going directly from my sister to me. My grandparents will most likely be taking him in for a few years, and they're very kind, patient people who have spent the majority of their lives taking in and trying to help the kids that my fuckup family member produce. They had me for several years after I left my parents house due to abuse, and they helped me get my life together and become the person I am today. I would be taking the boy in when they grow unable to, as they're simply getting old and have some health issues. This would give me a few years (I'm hoping) to prepare and get to know him before h comes and lives with me, and time for him to get a loving, normal home from people who know how to help abused children.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I respect your opinion, but I want to clarify that he isn&amp;#39;t going directly from my sister to me. My grandparents will most likely be taking him in for a few years, and they&amp;#39;re very kind, patient people who have spent the majority of their lives taking in and trying to help the kids that my fuckup family member produce. They had me for several years after I left my parents house due to abuse, and they helped me get my life together and become the person I am today. I would be taking the boy in when they grow unable to, as they&amp;#39;re simply getting old and have some health issues. This would give me a few years (I&amp;#39;m hoping) to prepare and get to know him before h comes and lives with me, and time for him to get a loving, normal home from people who know how to help abused children.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb42ry", "score_hidden": false, "stickied": false, "created": 1492316089.0, "created_utc": 1492287289.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgavckw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgattl0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "[removed]", "edited": 1492305539.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgavckw", "score_hidden": false, "stickied": false, "created": 1492304254.0, "created_utc": 1492275454.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgattl0", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Officer_Coldhonkey", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "This is a terrible idea. Your heart is in the right place but you're a child yourself. I don't care that you can go to war and buy a pack of smokes.  You are completely unable to care for a child. Especially a child who will undoubtedly be as damaged as your nephew is. He needs specialized care. From someone who is experienced in dealing with traumatized kids.  What're you gonna do? Move out of the dorms, get a little apartment and raise a kid? A guy who doesn't even want kids because HE was abused is going to raise an abused kid? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a terrible idea. Your heart is in the right place but you&amp;#39;re a child yourself. I don&amp;#39;t care that you can go to war and buy a pack of smokes.  You are completely unable to care for a child. Especially a child who will undoubtedly be as damaged as your nephew is. He needs specialized care. From someone who is experienced in dealing with traumatized kids.  What&amp;#39;re you gonna do? Move out of the dorms, get a little apartment and raise a kid? A guy who doesn&amp;#39;t even want kids because HE was abused is going to raise an abused kid? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgattl0", "score_hidden": false, "stickied": false, "created": 1492302106.0, "created_utc": 1492273306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgaszxr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KokopelliOnABike", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "As a brat growing up in the AF I can say this would be a great opportunity for both of you. And if you decide to stay in for the career and do as much travel as you can with your nephew, you can not beat the experience and education you will get from that. My Dad's belief was that it was a privilege to travel and  every base we were at, the weekends and vacation was out exploring the countries or nearby countries we were in.\n\nIt will not be easy, kids are hard, going in with open eyes, taking the legal and support advice here will be helpful. This is family and even at A1C you will have more opportunities to bring up a kid with a greater understanding of responsibility and respect than he is getting now. \n\nI do recommend talking with your Super, Chief and Commander. Yes, all three, because they will be the ones who approve and direct you on how the AF can help you out. If you get their support then you will be able to do just about anything.\n\nBest of luck and drop an update now and again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a brat growing up in the AF I can say this would be a great opportunity for both of you. And if you decide to stay in for the career and do as much travel as you can with your nephew, you can not beat the experience and education you will get from that. My Dad&amp;#39;s belief was that it was a privilege to travel and  every base we were at, the weekends and vacation was out exploring the countries or nearby countries we were in.&lt;/p&gt;\n\n&lt;p&gt;It will not be easy, kids are hard, going in with open eyes, taking the legal and support advice here will be helpful. This is family and even at A1C you will have more opportunities to bring up a kid with a greater understanding of responsibility and respect than he is getting now. &lt;/p&gt;\n\n&lt;p&gt;I do recommend talking with your Super, Chief and Commander. Yes, all three, because they will be the ones who approve and direct you on how the AF can help you out. If you get their support then you will be able to do just about anything.&lt;/p&gt;\n\n&lt;p&gt;Best of luck and drop an update now and again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaszxr", "score_hidden": false, "stickied": false, "created": 1492300960.0, "created_utc": 1492272160.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgawqju", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NinesRS", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I recall a similar thread by a woman, claiming her boyfriend was about to do something like this, and she no longer wanted to date him (understandably) due to it. \n\nThat's a hidden cost you should take into account as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I recall a similar thread by a woman, claiming her boyfriend was about to do something like this, and she no longer wanted to date him (understandably) due to it. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s a hidden cost you should take into account as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgawqju", "score_hidden": false, "stickied": false, "created": 1492306142.0, "created_utc": 1492277342.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgam8xs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "watery-tart", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "It sounds like you are making the right choice and I wish you both all the best. Parenting is a learning process, don't be too hard on him OR yourself! If at all possible, do sign him up with a therapist who can work with young children - he will probably love having a safe, neutral person to talk to about his very tough experiences and feelings, which will help him heal. My kid went to a therapist for several months for minor issues caused by being a child of divorced parents, and it helped us both. She loved the visits to the therapist. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you are making the right choice and I wish you both all the best. Parenting is a learning process, don&amp;#39;t be too hard on him OR yourself! If at all possible, do sign him up with a therapist who can work with young children - he will probably love having a safe, neutral person to talk to about his very tough experiences and feelings, which will help him heal. My kid went to a therapist for several months for minor issues caused by being a child of divorced parents, and it helped us both. She loved the visits to the therapist. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgam8xs", "score_hidden": false, "stickied": false, "created": 1492290090.0, "created_utc": 1492261290.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgaqkp6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheMarketLiberal93", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "A lot of good advice here, so I don't think I can really add much more.\n\nJust want to say you are doing the right thing, and I thank you for your service. The world needs more people like you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of good advice here, so I don&amp;#39;t think I can really add much more.&lt;/p&gt;\n\n&lt;p&gt;Just want to say you are doing the right thing, and I thank you for your service. The world needs more people like you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaqkp6", "score_hidden": false, "stickied": false, "created": 1492297536.0, "created_utc": 1492268736.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgat6wb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mistermuster420", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Dial 211 and tell them what your going to be doing and see what help they can give. There is allot of free help for people like you (first time using that in a good way 😊) and I'm sure you'll be ok. Biggest question is what happens when/if you get deployed. I'm not military so I don't know if they have shit set up for this but a friend was deployed for 2 years when his kid was 1, he had a civilian wife to take care of his kid though", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dial 211 and tell them what your going to be doing and see what help they can give. There is allot of free help for people like you (first time using that in a good way 😊) and I&amp;#39;m sure you&amp;#39;ll be ok. Biggest question is what happens when/if you get deployed. I&amp;#39;m not military so I don&amp;#39;t know if they have shit set up for this but a friend was deployed for 2 years when his kid was 1, he had a civilian wife to take care of his kid though&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgat6wb", "score_hidden": false, "stickied": false, "created": 1492301225.0, "created_utc": 1492272425.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgat7wy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PM_ME_URS_BUTTHOLE", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Plus all the other advices, I'd recommend going to your authorities about this problem, there are helpful people in the army who might convince the government to help you on this case. Anyway it is great of you to want the best for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plus all the other advices, I&amp;#39;d recommend going to your authorities about this problem, there are helpful people in the army who might convince the government to help you on this case. Anyway it is great of you to want the best for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgat7wy", "score_hidden": false, "stickied": false, "created": 1492301264.0, "created_utc": 1492272464.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb46zl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dgawl8w", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I am in a position that does not deploy often. The majority of the people I work with have never deployed. I'm not saying that it will not happen, I'm not that ignorant, but i'm not security forces looking at constant deployment by a long shot. My grandparents and other family members who wouldn't be able to keep him forever would likely be able to take him in while i'm deployed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am in a position that does not deploy often. The majority of the people I work with have never deployed. I&amp;#39;m not saying that it will not happen, I&amp;#39;m not that ignorant, but i&amp;#39;m not security forces looking at constant deployment by a long shot. My grandparents and other family members who wouldn&amp;#39;t be able to keep him forever would likely be able to take him in while i&amp;#39;m deployed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb46zl", "score_hidden": false, "stickied": false, "created": 1492316245.0, "created_utc": 1492287445.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawl8w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "annie_on_the_run", "parent_id": "t1_dgau684", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "That was the first thing that came to my mind - how are you going to handle deployment? Talking to your sup sooner rather than later will give you all the information you need to make this decision. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was the first thing that came to my mind - how are you going to handle deployment? Talking to your sup sooner rather than later will give you all the information you need to make this decision. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgawl8w", "score_hidden": false, "stickied": false, "created": 1492305940.0, "created_utc": 1492277140.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgau684", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ratgirl73", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I was in the Army a long time ago so my advice may be outdated.  My experience is for the Army which may have different SOP's than the Chair force.  OOPS.  I meant Air force.\n\nWhen my husband left me with my two children I was discharged from the Army because I had sole custody.\n\nCheck with your command to make sure you are covered in the legal custody area.  The military considers you undeployable if you are the sole caretaker of a child.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in the Army a long time ago so my advice may be outdated.  My experience is for the Army which may have different SOP&amp;#39;s than the Chair force.  OOPS.  I meant Air force.&lt;/p&gt;\n\n&lt;p&gt;When my husband left me with my two children I was discharged from the Army because I had sole custody.&lt;/p&gt;\n\n&lt;p&gt;Check with your command to make sure you are covered in the legal custody area.  The military considers you undeployable if you are the sole caretaker of a child.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgau684", "score_hidden": false, "stickied": false, "created": 1492302595.0, "created_utc": 1492273795.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgau96t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "INTJorINTP", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I don't have any advice, but I just want to comment to say you're a great guy for taking him in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have any advice, but I just want to comment to say you&amp;#39;re a great guy for taking him in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgau96t", "score_hidden": false, "stickied": false, "created": 1492302710.0, "created_utc": 1492273910.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgauv2x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "contramania", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I don't have any advice,  up I want to say that you're a good person.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have any advice,  up I want to say that you&amp;#39;re a good person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgauv2x", "score_hidden": false, "stickied": false, "created": 1492303581.0, "created_utc": 1492274781.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgav56v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "l84ad82cu", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Good on you, airman!! You've got all of the resources you could ever need at your fingertips as the AF is especially awesome for raising families. \n\nI also want to commend you for pulling yourself out of poverty. I know it's not been easy &amp; im sure you had a lot going against you. Good job!! You're obviously extremely resilient, responsible &amp; mature &amp; I'm really impressed by your wish to do this. You might just be exactly what that boy needs. Best of luck!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good on you, airman!! You&amp;#39;ve got all of the resources you could ever need at your fingertips as the AF is especially awesome for raising families. &lt;/p&gt;\n\n&lt;p&gt;I also want to commend you for pulling yourself out of poverty. I know it&amp;#39;s not been easy &amp;amp; im sure you had a lot going against you. Good job!! You&amp;#39;re obviously extremely resilient, responsible &amp;amp; mature &amp;amp; I&amp;#39;m really impressed by your wish to do this. You might just be exactly what that boy needs. Best of luck!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgav56v", "score_hidden": false, "stickied": false, "created": 1492303973.0, "created_utc": 1492275173.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb61m9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Julia_Kat", "parent_id": "t1_dgb4fdv", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "It's possible. You need to talk to a financial person. It depends how much they make, though. The cutoff is low but their disability income may not be considered part of gross income  (which is the number that determines if they qualify or not). Glad that this suggestion may help!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s possible. You need to talk to a financial person. It depends how much they make, though. The cutoff is low but their disability income may not be considered part of gross income  (which is the number that determines if they qualify or not). Glad that this suggestion may help!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb61m9", "score_hidden": false, "stickied": false, "created": 1492318765.0, "created_utc": 1492289965.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4fdv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dgb3tjs", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "That.. actually might be possible. My grandparents collect disability, but it might be possible for them to become my legal dependents themselves.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That.. actually might be possible. My grandparents collect disability, but it might be possible for them to become my legal dependents themselves.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb4fdv", "score_hidden": false, "stickied": false, "created": 1492316560.0, "created_utc": 1492287760.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3tjs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Julia_Kat", "parent_id": "t1_dgb311f", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I don't know if this is an option but could you get permanent housing with them on the airbase? I'm not certain about their living situation, but you'd have someone to care for him if you go overseas and can also take him to appointments during the day but then they aren't shouldering all the responsibility since you'd come home from work if you aren't overseas. You could also help with household issues that may be difficult for them in their present living situation. \n\nIt could also help with finances. If they own, they could sell their house (it's a good time to sell in a lot of areas) and that money could be put aside to care for them when they would need more assistance such as a retirement home. They could help pay for some of the utilities and groceries (which they likely already pay for at their present residence).\n\nI realize this doesn't work for everyone since they may not want to move or they have other obstacles.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if this is an option but could you get permanent housing with them on the airbase? I&amp;#39;m not certain about their living situation, but you&amp;#39;d have someone to care for him if you go overseas and can also take him to appointments during the day but then they aren&amp;#39;t shouldering all the responsibility since you&amp;#39;d come home from work if you aren&amp;#39;t overseas. You could also help with household issues that may be difficult for them in their present living situation. &lt;/p&gt;\n\n&lt;p&gt;It could also help with finances. If they own, they could sell their house (it&amp;#39;s a good time to sell in a lot of areas) and that money could be put aside to care for them when they would need more assistance such as a retirement home. They could help pay for some of the utilities and groceries (which they likely already pay for at their present residence).&lt;/p&gt;\n\n&lt;p&gt;I realize this doesn&amp;#39;t work for everyone since they may not want to move or they have other obstacles.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb3tjs", "score_hidden": false, "stickied": false, "created": 1492315735.0, "created_utc": 1492286935.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb311f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dgb2akp", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "You are correct; It is my grandparents and the childs great grandparents. They're in their mid-60s. My grandmother was injured when my father was 12, and through a series of poor events he ended up on the streets working and into drugs (through no fault of my grandmother). He's a terrible messed up person whom I have nothing to do with. My grandparents are kind (if disabled and not financially well off) people. The general plan right now is that they keep him for a year or two if they can until I'm prepared to take him in and they're unable to keep up with raising another child.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are correct; It is my grandparents and the childs great grandparents. They&amp;#39;re in their mid-60s. My grandmother was injured when my father was 12, and through a series of poor events he ended up on the streets working and into drugs (through no fault of my grandmother). He&amp;#39;s a terrible messed up person whom I have nothing to do with. My grandparents are kind (if disabled and not financially well off) people. The general plan right now is that they keep him for a year or two if they can until I&amp;#39;m prepared to take him in and they&amp;#39;re unable to keep up with raising another child.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb311f", "score_hidden": false, "stickied": false, "created": 1492314635.0, "created_utc": 1492285835.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2akp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Julia_Kat", "parent_id": "t1_dgavn2q", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "It's OP's grandparents, not his parents. It's the child's great grandparents. OP could have a different relationship with them than he does with his parents.  That means they're a generation older than you thought. Raising a kid at 60 is a lot different than 40 (rough age estimate based on having kids at 20, they could be even older) especially if they've been sick.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s OP&amp;#39;s grandparents, not his parents. It&amp;#39;s the child&amp;#39;s great grandparents. OP could have a different relationship with them than he does with his parents.  That means they&amp;#39;re a generation older than you thought. Raising a kid at 60 is a lot different than 40 (rough age estimate based on having kids at 20, they could be even older) especially if they&amp;#39;ve been sick.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb2akp", "score_hidden": false, "stickied": false, "created": 1492313651.0, "created_utc": 1492284851.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgavn2q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "agsoup", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Going to echo the advice here and say talk to your chain of command. Honestly they will probably try to talk you out of this situation but if you get to the point where this is happening and not something you're only considering they will be a huge resource for you. \n\nAlso something for you to think about, this may never happen. You may never get the kid. The grandparents (while you see them as old and sickly):\n\n1. may not see themselves that way so the probability they think they're the best option for the child since they already have experience raising children would be high, especially if they feel they messed up on prior children and want to \"make things right\" by raising this one better than their actual kids\n2. May see themselves as old and sickly but get the head rush from \"doing the right thing\" so they get a new sense of purpose and find themselves attached to the child \n3. They could just entirely backpedal on you and tell you that you are too young and inexperienced to do this whether they're happy about having the kid or not. \n\nYou mentioned in a previous comment you didn't have a good relationship with your parents growing up. If your parents are the same people trying to take custody of the kid I would not put my hope into the fact they will give you custody of this child.\n\nI hope it all works out for the kid. Your heart is in the right place. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Going to echo the advice here and say talk to your chain of command. Honestly they will probably try to talk you out of this situation but if you get to the point where this is happening and not something you&amp;#39;re only considering they will be a huge resource for you. &lt;/p&gt;\n\n&lt;p&gt;Also something for you to think about, this may never happen. You may never get the kid. The grandparents (while you see them as old and sickly):&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;may not see themselves that way so the probability they think they&amp;#39;re the best option for the child since they already have experience raising children would be high, especially if they feel they messed up on prior children and want to &amp;quot;make things right&amp;quot; by raising this one better than their actual kids&lt;/li&gt;\n&lt;li&gt;May see themselves as old and sickly but get the head rush from &amp;quot;doing the right thing&amp;quot; so they get a new sense of purpose and find themselves attached to the child &lt;/li&gt;\n&lt;li&gt;They could just entirely backpedal on you and tell you that you are too young and inexperienced to do this whether they&amp;#39;re happy about having the kid or not. &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;You mentioned in a previous comment you didn&amp;#39;t have a good relationship with your parents growing up. If your parents are the same people trying to take custody of the kid I would not put my hope into the fact they will give you custody of this child.&lt;/p&gt;\n\n&lt;p&gt;I hope it all works out for the kid. Your heart is in the right place. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgavn2q", "score_hidden": false, "stickied": false, "created": 1492304656.0, "created_utc": 1492275856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgax16b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilegendary", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I'm also an A1C USAF and live in the dorms. If you're east coast and need anything or just another person to talk to people do care. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m also an A1C USAF and live in the dorms. If you&amp;#39;re east coast and need anything or just another person to talk to people do care. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgax16b", "score_hidden": false, "stickied": false, "created": 1492306541.0, "created_utc": 1492277741.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgaxnsg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8bitmantra", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Just a bit of advice - as I'm sure you know going through what you have, what your nephews gone through even though he will be alright - can have some pretty strange and varying mental effects. In the long term (potentially several years down the line), even when it looks like he's over the bad things he's experienced. Try to stay patient with him while he's growing up - in my own case I had a lot of trouble fitting in and extreme social anxiety - to anybody on the outside it would have looked as though I was losing my mind in highschool - but I got past it. And the people I remember most were the ones I thought could understand me at the time - and gave me the necessary support and positive reinforcement when I began to come out of that time \n\nAlso your doing something wonderful for him - feel good about it :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just a bit of advice - as I&amp;#39;m sure you know going through what you have, what your nephews gone through even though he will be alright - can have some pretty strange and varying mental effects. In the long term (potentially several years down the line), even when it looks like he&amp;#39;s over the bad things he&amp;#39;s experienced. Try to stay patient with him while he&amp;#39;s growing up - in my own case I had a lot of trouble fitting in and extreme social anxiety - to anybody on the outside it would have looked as though I was losing my mind in highschool - but I got past it. And the people I remember most were the ones I thought could understand me at the time - and gave me the necessary support and positive reinforcement when I began to come out of that time &lt;/p&gt;\n\n&lt;p&gt;Also your doing something wonderful for him - feel good about it :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaxnsg", "score_hidden": false, "stickied": false, "created": 1492307394.0, "created_utc": 1492278594.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgaxzf7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Psifour", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Make sure to keep your chain of command informed as your switch from dorms to off-base housing won't go unnoticed by them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make sure to keep your chain of command informed as your switch from dorms to off-base housing won&amp;#39;t go unnoticed by them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaxzf7", "score_hidden": false, "stickied": false, "created": 1492307839.0, "created_utc": 1492279039.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb7ll7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tofu_llama", "parent_id": "t1_dgb4axg", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "When we were very young military, like yourself, we found ourselves often in places where rent, utilities, and the cost to commute ate up the BAH quickly. Add to that the isolation of city living, and it can really weigh on you. \n\nIf the program still works the same as ever, you are locked in to the lease for a year (or till PCS, whichever is first). That first year, you'll get a chance to see for yourself just how much you can/can't afford as a single parent. At the end of the first year, you'll know what to do.\n\nAbsolutely take advantage of the social programs available to you once you have custody: snap card, etc. Taxpayers fund those programs to help people like yourself who find themselves in a pinch.\n\nOnce the boy is in school, he'll qualify for free breakfast and lunch. Take advantage of that as well, unless he has food allergies. \n\nCheck out the frugal subreddits for advice there, as well. Good luck, Airman. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When we were very young military, like yourself, we found ourselves often in places where rent, utilities, and the cost to commute ate up the BAH quickly. Add to that the isolation of city living, and it can really weigh on you. &lt;/p&gt;\n\n&lt;p&gt;If the program still works the same as ever, you are locked in to the lease for a year (or till PCS, whichever is first). That first year, you&amp;#39;ll get a chance to see for yourself just how much you can/can&amp;#39;t afford as a single parent. At the end of the first year, you&amp;#39;ll know what to do.&lt;/p&gt;\n\n&lt;p&gt;Absolutely take advantage of the social programs available to you once you have custody: snap card, etc. Taxpayers fund those programs to help people like yourself who find themselves in a pinch.&lt;/p&gt;\n\n&lt;p&gt;Once the boy is in school, he&amp;#39;ll qualify for free breakfast and lunch. Take advantage of that as well, unless he has food allergies. &lt;/p&gt;\n\n&lt;p&gt;Check out the frugal subreddits for advice there, as well. Good luck, Airman. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb7ll7", "score_hidden": false, "stickied": false, "created": 1492320926.0, "created_utc": 1492292126.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4axg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dgb0v3o", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I'm looking into it, it would take all the BAH but the housing/utilities/maintenance and even lawn care would be covered. I think this would probably be the best option.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m looking into it, it would take all the BAH but the housing/utilities/maintenance and even lawn care would be covered. I think this would probably be the best option.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb4axg", "score_hidden": false, "stickied": false, "created": 1492316395.0, "created_utc": 1492287595.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb0v3o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tofu_llama", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "This may not sound like the right choice to civilians, but if you can get base housing, consider that. \n\nThe basic utilities used to be factored into the cost, so no surprise power bills. You will be surrounded by families your age (they generally group by rank) so your nephew can develop friends and social skills. You can see family modeling first hand and develop your own parenting skills based off what you already know and what you're now seeing. It's easier to carpool, there's almost always somebody in the area who will watch your nephew in an emergency for a a small fee. Occasionally, there will be an elementary school right on base. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This may not sound like the right choice to civilians, but if you can get base housing, consider that. &lt;/p&gt;\n\n&lt;p&gt;The basic utilities used to be factored into the cost, so no surprise power bills. You will be surrounded by families your age (they generally group by rank) so your nephew can develop friends and social skills. You can see family modeling first hand and develop your own parenting skills based off what you already know and what you&amp;#39;re now seeing. It&amp;#39;s easier to carpool, there&amp;#39;s almost always somebody in the area who will watch your nephew in an emergency for a a small fee. Occasionally, there will be an elementary school right on base. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb0v3o", "score_hidden": false, "stickied": false, "created": 1492311763.0, "created_utc": 1492282963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgb36ke", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "advicethrowaway148", "parent_id": "t1_dgb1qj2", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "From what I understand, it was prescribed to him for \"anxiety issues), when the real issue was being neglected and abused. It keeps him docile and quiet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From what I understand, it was prescribed to him for &amp;quot;anxiety issues), when the real issue was being neglected and abused. It keeps him docile and quiet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb36ke", "score_hidden": false, "stickied": false, "created": 1492314843.0, "created_utc": 1492286043.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1qj2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Julia_Kat", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I understand this is Finance, but I wanted to say as a healthcare worker and an aunt of a child who was on it and has mental issues, you should get him weaned off of Klonopin under the care of a doctor. I'm shocked they would jump to this in a young child unless nothing else worked (this is why my nephew was on it). I'd start looking for a psychologist who works with children in your area. You'll also need a psychiatrist or other MD for weaning since psychologists don't prescribe medications. If you find one, they may be able to recommend the other. Having doctors who work together is amazing. \n\nGood luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand this is Finance, but I wanted to say as a healthcare worker and an aunt of a child who was on it and has mental issues, you should get him weaned off of Klonopin under the care of a doctor. I&amp;#39;m shocked they would jump to this in a young child unless nothing else worked (this is why my nephew was on it). I&amp;#39;d start looking for a psychologist who works with children in your area. You&amp;#39;ll also need a psychiatrist or other MD for weaning since psychologists don&amp;#39;t prescribe medications. If you find one, they may be able to recommend the other. Having doctors who work together is amazing. &lt;/p&gt;\n\n&lt;p&gt;Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgb1qj2", "score_hidden": false, "stickied": false, "created": 1492312906.0, "created_utc": 1492284106.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbag65", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Crimmsin", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I would love to hear how this turns out, I'm also not in the market for children and I can't imagine how awesome it is that you're taking in a kid. You're going to change his life and be his world :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would love to hear how this turns out, I&amp;#39;m also not in the market for children and I can&amp;#39;t imagine how awesome it is that you&amp;#39;re taking in a kid. You&amp;#39;re going to change his life and be his world :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbag65", "score_hidden": false, "stickied": false, "created": 1492324952.0, "created_utc": 1492296152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbbsff", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "luqi_charmz", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "I've never heard of a doctor prescribing benzos to a small child. He will need counseling and assistance weaning him off the drugs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never heard of a doctor prescribing benzos to a small child. He will need counseling and assistance weaning him off the drugs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbbsff", "score_hidden": false, "stickied": false, "created": 1492326924.0, "created_utc": 1492298124.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbirp9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LuLuLog", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "If you get him as a foster child, he will likely get medical assistance through your states' Medicaid program that will coordinate with and be secondary to your Tricare. This is great considering his mental health and behavioral issues. He may also qualify for other programs like free school meals. As long as he's considered a foster child, even when placed with family, the state helps a lot with his care. They can probably also help you with parenting classes. With a high needs child, it's good to be proactive in your research and attending classes especially as a first time parent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you get him as a foster child, he will likely get medical assistance through your states&amp;#39; Medicaid program that will coordinate with and be secondary to your Tricare. This is great considering his mental health and behavioral issues. He may also qualify for other programs like free school meals. As long as he&amp;#39;s considered a foster child, even when placed with family, the state helps a lot with his care. They can probably also help you with parenting classes. With a high needs child, it&amp;#39;s good to be proactive in your research and attending classes especially as a first time parent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbirp9", "score_hidden": false, "stickied": false, "created": 1492336896.0, "created_utc": 1492308096.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbkg4c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Swift06", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Have a plan for when you deploy. Depending on your career field and tempo band this could be frequent.\n\nYellow ribbon briefings are a great resource that cover tons of deployment and military benefits in general, but you'll probably want a plan before you attend since I had mine a month or two before my departure date.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have a plan for when you deploy. Depending on your career field and tempo band this could be frequent.&lt;/p&gt;\n\n&lt;p&gt;Yellow ribbon briefings are a great resource that cover tons of deployment and military benefits in general, but you&amp;#39;ll probably want a plan before you attend since I had mine a month or two before my departure date.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbkg4c", "score_hidden": false, "stickied": false, "created": 1492339381.0, "created_utc": 1492310581.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgbomy1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "terriblemuriel", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Your nephew is so lucky to have someone with sensibility and a big heart to take him in. You are doing a noble and wonderful thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your nephew is so lucky to have someone with sensibility and a big heart to take him in. You are doing a noble and wonderful thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgbomy1", "score_hidden": false, "stickied": false, "created": 1492345965.0, "created_utc": 1492317165.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgc3p0w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fo13", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Talk to your shirt and CC. Let them know your situation and why. There is so much and so many orgs and people to help. Its a task raising a kid but can be one worthwhile, long term. If you adopt him, there is help for that also. While I do not have all the info and answers, i wish you the best and way to embrace the core values.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to your shirt and CC. Let them know your situation and why. There is so much and so many orgs and people to help. Its a task raising a kid but can be one worthwhile, long term. If you adopt him, there is help for that also. While I do not have all the info and answers, i wish you the best and way to embrace the core values.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgc3p0w", "score_hidden": false, "stickied": false, "created": 1492382838.0, "created_utc": 1492354038.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgcitgq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Production_super999", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Tons of great advice here and I wish you the best of luck. Two things I didn't see that I'd like to add are that if you adopt as a single Airman, start thinking about your family care plan now. You'll need both long and short term care arrangements that you can execute on minimal notice. Most supervisors/units will work with you on most aspects of being a single parent, but you may occasionally get tagged for TDYs/exercises/deployments that make you actually use the plan.  Also, if you're a particularly ambitious person career-wise, be careful to make choices that are in both your and your nephew's best interest. You may have to turn down good duty positions, or pursue ones that have less promotion prospects in order to maintain a good work-parent balance. \n\nLike others have said, nobody really knows what they're doing when they start out as parents, but it sounds like your heart is in the right place with your nephew and that will carry you most of the way towards being a good parent. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tons of great advice here and I wish you the best of luck. Two things I didn&amp;#39;t see that I&amp;#39;d like to add are that if you adopt as a single Airman, start thinking about your family care plan now. You&amp;#39;ll need both long and short term care arrangements that you can execute on minimal notice. Most supervisors/units will work with you on most aspects of being a single parent, but you may occasionally get tagged for TDYs/exercises/deployments that make you actually use the plan.  Also, if you&amp;#39;re a particularly ambitious person career-wise, be careful to make choices that are in both your and your nephew&amp;#39;s best interest. You may have to turn down good duty positions, or pursue ones that have less promotion prospects in order to maintain a good work-parent balance. &lt;/p&gt;\n\n&lt;p&gt;Like others have said, nobody really knows what they&amp;#39;re doing when they start out as parents, but it sounds like your heart is in the right place with your nephew and that will carry you most of the way towards being a good parent. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgcitgq", "score_hidden": false, "stickied": false, "created": 1492403065.0, "created_utc": 1492374265.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65h4sz", "likes": null, "replies": "", "user_reports": [], "id": "dgatlwp", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ISFPainter", "parent_id": "t3_65h4sz", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 1, "body": "This may be odd advice, but a couple of things:\n\n Please make sure he eats lots of fresh, whole foods that are detoxifying. A Nutribullet can be a fun thing - let him put a chunk of cucumber, celery, greens, grapefruit juice and a bit of stevia for his morning drink. Or a real fruit smoothie. No artificial colors. Limit TV.\n\nExercise outside together in nature and get him a reliable massage therapist+reiki practicioner for relaxation/healing energy/detox - it can undo much built in stress in his muscles from abuse, and allow him to experience healthy touching. (you too!)\n\n Lastly, involve him in this reddit - it can be a fun thing to talk about money and saving and investing - something to train his focus on positive futures for you both. (I knew the difference in a dime and a quarter when I was 5!! LOL)\n\nBest Wishes to you both. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This may be odd advice, but a couple of things:&lt;/p&gt;\n\n&lt;p&gt;Please make sure he eats lots of fresh, whole foods that are detoxifying. A Nutribullet can be a fun thing - let him put a chunk of cucumber, celery, greens, grapefruit juice and a bit of stevia for his morning drink. Or a real fruit smoothie. No artificial colors. Limit TV.&lt;/p&gt;\n\n&lt;p&gt;Exercise outside together in nature and get him a reliable massage therapist+reiki practicioner for relaxation/healing energy/detox - it can undo much built in stress in his muscles from abuse, and allow him to experience healthy touching. (you too!)&lt;/p&gt;\n\n&lt;p&gt;Lastly, involve him in this reddit - it can be a fun thing to talk about money and saving and investing - something to train his focus on positive futures for you both. (I knew the difference in a dime and a quarter when I was 5!! LOL)&lt;/p&gt;\n\n&lt;p&gt;Best Wishes to you both. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgatlwp", "score_hidden": false, "stickied": false, "created": 1492301806.0, "created_utc": 1492273006.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]