[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "personalfinance", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all, I just wanted to provide an update to this post. Original post: &lt;a href=\"https://www.reddit.com/r/personalfinance/comments/5xj9xc/got_laid_off_wife_is_inducing_panicking_need/?st=J1IQHHR7&amp;amp;sh=62173999\"&gt;https://www.reddit.com/r/personalfinance/comments/5xj9xc/got_laid_off_wife_is_inducing_panicking_need/?st=J1IQHHR7&amp;amp;sh=62173999&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Great news!  I got accepted to a position today, I&amp;#39;ll start on the 24th.  Wife is ecstatic, we are back to our normal selves.  I followed the advice of many folks and didn&amp;#39;t change anything drastic.  There were added stress in this period, I should add she had not been as &amp;#39;off the wall&amp;#39; as the first day we got the news.  It was hard to keep my head in the game, it&amp;#39;s a psychological roller coaster &amp;quot;how can I walk into a place and ask for that much money&amp;quot; was the common mental gremlin.  Some anecdotal data that folks may be interested in:&lt;/p&gt;\n\n&lt;p&gt;I must have applied to 20 places, got 6 phone interviews, 3 turned into in-person interviews, 1 offer.  The new job pays 92k so I&amp;#39;m taking a hit on pay but it&amp;#39;s still great (absolutely no complaints).  I just told them what I made and said I&amp;#39;d like to be in the same ballpark but very negotiable.  I didn&amp;#39;t have to dip too far into savings.  One item that I&amp;#39;d like to reiterate from the comments from the original post. Apply to unemployment early and be prepared for some runaround, understand when the actual payment requests can happen (which isn&amp;#39;t all that clear).  I requested a payment on the date they said I can first do it, but it was rejected.  When I called to find out about the rejection I was on hold for an hour and they said it was rejected because of the vacation pay and that I can request on the new date they provided over the phone.  The accrued vacation pay I received got factored into when I can start getting UI payments however &lt;em&gt;that&lt;/em&gt; date wasn&amp;#39;t the date the website had I can request payment.  I requested again on that new date and instead of getting 2 weeks of benefits I got 1, so I called back (another hold for 45 minutes) and asked what the deal was with that and they explained you only get the 1st week on the initial request and then 2 weeks on all subsequent requests (just sounded like a bunch of BS honestly).  I just want you guys to know that in the first month of unemployment, I only got 1 week of UI payments.  Fortunately I was able to weather that storm, but things could have easily been much worse if I didn&amp;#39;t have a cushion.&lt;/p&gt;\n\n&lt;p&gt;The only other thing I think is worth adding is that this place did an extensive background check including a drug test, all of which went well.  What I want to say here is &amp;#39;don&amp;#39;t do drugs folks&amp;#39;.  It would have been devastating to get the job only to be rejected because of drugs.  Yikes, can&amp;#39;t imagine the wife with something like that.  Anyway, thanks again if any commenters from the original post get to read this.  I&amp;#39;ll be happy to answer questions you guys might have.  Looking forward to a great weekend!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all, I just wanted to provide an update to this post. Original post: https://www.reddit.com/r/personalfinance/comments/5xj9xc/got_laid_off_wife_is_inducing_panicking_need/?st=J1IQHHR7&amp;sh=62173999\n\nGreat news!  I got accepted to a position today, I'll start on the 24th.  Wife is ecstatic, we are back to our normal selves.  I followed the advice of many folks and didn't change anything drastic.  There were added stress in this period, I should add she had not been as 'off the wall' as the first day we got the news.  It was hard to keep my head in the game, it's a psychological roller coaster \"how can I walk into a place and ask for that much money\" was the common mental gremlin.  Some anecdotal data that folks may be interested in:\n\nI must have applied to 20 places, got 6 phone interviews, 3 turned into in-person interviews, 1 offer.  The new job pays 92k so I'm taking a hit on pay but it's still great (absolutely no complaints).  I just told them what I made and said I'd like to be in the same ballpark but very negotiable.  I didn't have to dip too far into savings.  One item that I'd like to reiterate from the comments from the original post. Apply to unemployment early and be prepared for some runaround, understand when the actual payment requests can happen (which isn't all that clear).  I requested a payment on the date they said I can first do it, but it was rejected.  When I called to find out about the rejection I was on hold for an hour and they said it was rejected because of the vacation pay and that I can request on the new date they provided over the phone.  The accrued vacation pay I received got factored into when I can start getting UI payments however *that* date wasn't the date the website had I can request payment.  I requested again on that new date and instead of getting 2 weeks of benefits I got 1, so I called back (another hold for 45 minutes) and asked what the deal was with that and they explained you only get the 1st week on the initial request and then 2 weeks on all subsequent requests (just sounded like a bunch of BS honestly).  I just want you guys to know that in the first month of unemployment, I only got 1 week of UI payments.  Fortunately I was able to weather that storm, but things could have easily been much worse if I didn't have a cushion.\n\nThe only other thing I think is worth adding is that this place did an extensive background check including a drug test, all of which went well.  What I want to say here is 'don't do drugs folks'.  It would have been devastating to get the job only to be rejected because of drugs.  Yikes, can't imagine the wife with something like that.  Anyway, thanks again if any commenters from the original post get to read this.  I'll be happy to answer questions you guys might have.  Looking forward to a great weekend!\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Employment", "id": "65hdar", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "thr0wawayyyy1225", "saved": false, "mod_reports": [], "name": "t3_65hdar", "subreddit_name_prefixed": "r/personalfinance", "approved_by": null, "over_18": false, "domain": "self.personalfinance", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qstm", "edited": false, "link_flair_css_class": "Employment", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/personalfinance/comments/65hdar/update_sole_earner_laid_off/", "num_reports": null, "locked": false, "stickied": false, "created": 1492259919.0, "url": "https://www.reddit.com/r/personalfinance/comments/65hdar/update_sole_earner_laid_off/", "author_flair_text": null, "quarantine": false, "title": "Update: Sole earner, laid off.", "created_utc": 1492231119.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65hdar", "likes": null, "replies": "", "user_reports": [], "id": "dgaaw1i", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Doggonitdude", "parent_id": "t3_65hdar", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Congratulations mate! Seriously finding a new job, when the pressure is on, is the best feeling in the world. Peace n blessins.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congratulations mate! Seriously finding a new job, when the pressure is on, is the best feeling in the world. Peace n blessins.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaaw1i", "score_hidden": false, "stickied": false, "created": 1492260617.0, "created_utc": 1492231817.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65hdar", "likes": null, "replies": "", "user_reports": [], "id": "dgaetig", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "croatianscentsation", "parent_id": "t3_65hdar", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "It's always good to hear things are working out for people. Congratulations on the new job and your saved marriage! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s always good to hear things are working out for people. Congratulations on the new job and your saved marriage! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgaetig", "score_hidden": false, "stickied": false, "created": 1492269100.0, "created_utc": 1492240300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65hdar", "likes": null, "replies": "", "user_reports": [], "id": "dgdnh5w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thatssaguy", "parent_id": "t3_65hdar", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Congrats!  I can't imagine the stress.\n\nBuild that emergency fund back up and then test your wife to a nice dinner or something as a thank you for helping you deal with the stress.  I'm sure that'll be appreciated.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congrats!  I can&amp;#39;t imagine the stress.&lt;/p&gt;\n\n&lt;p&gt;Build that emergency fund back up and then test your wife to a nice dinner or something as a thank you for helping you deal with the stress.  I&amp;#39;m sure that&amp;#39;ll be appreciated.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgdnh5w", "score_hidden": false, "stickied": false, "created": 1492472945.0, "created_utc": 1492444145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]