[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "personalfinance", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Some background: graduated from high school in 2006 and spent five years traveling, playing in bands, and generally being a bum. In 2011 I started working for a grocery store, making $10/hr part-time.&lt;/p&gt;\n\n&lt;p&gt;Today, after working very hard for the past six years, I&amp;#39;m still working there in a managerial role. In the next couple of months I&amp;#39;ll be interviewing for another promotion, and if I get it I&amp;#39;ll go from making $46,000/yr to as much as $49,000/yr. I plan on staying with this company as long as I can - I have affordable medical and dental insurance, a generous store discount, and a 401k (although they don&amp;#39;t offer contribution matching). I would like to continue moving up into higher management positions over the next few years if they become available.&lt;/p&gt;\n\n&lt;p&gt;I live pretty comfortably right now. I&amp;#39;m still renting, but have no car payments. I&amp;#39;ve just gotten to the point where I can start saving money for an emergency fund and start contributing to my retirement account after recovering from some credit card debt I&amp;#39;d built up over the years. My credit score is excellent.&lt;/p&gt;\n\n&lt;p&gt;I enrolled at a nearby community college this year after experiencing a little bit of an existential crisis. I originally considered pursuing a degree in Engineering, but I just don&amp;#39;t think I have the math chops for it. Trying to earn that degree while working full time would eat me alive. I ended up picking some basic classes that apply to most degree programs just to get my feet wet. Right now my plan is to take 10 credits per semester (spring/summer/fall) for the next two years, get an associate&amp;#39;s degree, then transfer to a 4-year university in town for my bachelor&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;A one-time state grant for adult students paid for the majority of this semester&amp;#39;s tuition, and I&amp;#39;ve only paid $700 out of pocket so far. However, I&amp;#39;m approaching the end of the semester and I still have no clue what I&amp;#39;d want to pursue a degree in. It&amp;#39;s time to sign up for summer classes, but I&amp;#39;m hesitant to start accruing thousands of dollars in student loans. I don&amp;#39;t want to waste my time getting a worthless degree. I&amp;#39;m considering going for an Economics B.S., but I know it will eventually be pretty math-intensive and I&amp;#39;m not sure if the job prospects are that great. My goal is long-term financial security above all - I don&amp;#39;t really have a dream career in mind.&lt;/p&gt;\n\n&lt;p&gt;My question is whether I should even pursue a degree at this point in my life. I&amp;#39;m not sure if the return on investment will ever be worth it. Entry-level jobs in most fields will probably pay less than I&amp;#39;ll be making by the time I finish school. I estimate that at the end of the day I&amp;#39;ll have at least $40,000 in student loan debt if I get a bachelor&amp;#39;s degree, which could take me 4-6 years to complete depending on how much of a workload I&amp;#39;ll be able to handle while working full time. That&amp;#39;s $40,000 I could be contributing to my savings/401k, or using to put a down payment on a car/house in the future.&lt;/p&gt;\n\n&lt;p&gt;I enjoy my current job and hope to stay there for many years. I think I&amp;#39;m in an okay financial position for someone my age with a high school diploma. However, I fear getting stuck in middle management forever, or even worse, getting laid off. I feel like my fate is tied to this particular company. I worry that not having a degree will come back to bite me later in life.&lt;/p&gt;\n\n&lt;p&gt;Any thoughts? Thanks for reading.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Some background: graduated from high school in 2006 and spent five years traveling, playing in bands, and generally being a bum. In 2011 I started working for a grocery store, making $10/hr part-time.\n\nToday, after working very hard for the past six years, I'm still working there in a managerial role. In the next couple of months I'll be interviewing for another promotion, and if I get it I'll go from making $46,000/yr to as much as $49,000/yr. I plan on staying with this company as long as I can - I have affordable medical and dental insurance, a generous store discount, and a 401k (although they don't offer contribution matching). I would like to continue moving up into higher management positions over the next few years if they become available.\n\nI live pretty comfortably right now. I'm still renting, but have no car payments. I've just gotten to the point where I can start saving money for an emergency fund and start contributing to my retirement account after recovering from some credit card debt I'd built up over the years. My credit score is excellent.\n\nI enrolled at a nearby community college this year after experiencing a little bit of an existential crisis. I originally considered pursuing a degree in Engineering, but I just don't think I have the math chops for it. Trying to earn that degree while working full time would eat me alive. I ended up picking some basic classes that apply to most degree programs just to get my feet wet. Right now my plan is to take 10 credits per semester (spring/summer/fall) for the next two years, get an associate's degree, then transfer to a 4-year university in town for my bachelor's.\n\nA one-time state grant for adult students paid for the majority of this semester's tuition, and I've only paid $700 out of pocket so far. However, I'm approaching the end of the semester and I still have no clue what I'd want to pursue a degree in. It's time to sign up for summer classes, but I'm hesitant to start accruing thousands of dollars in student loans. I don't want to waste my time getting a worthless degree. I'm considering going for an Economics B.S., but I know it will eventually be pretty math-intensive and I'm not sure if the job prospects are that great. My goal is long-term financial security above all - I don't really have a dream career in mind.\n\nMy question is whether I should even pursue a degree at this point in my life. I'm not sure if the return on investment will ever be worth it. Entry-level jobs in most fields will probably pay less than I'll be making by the time I finish school. I estimate that at the end of the day I'll have at least $40,000 in student loan debt if I get a bachelor's degree, which could take me 4-6 years to complete depending on how much of a workload I'll be able to handle while working full time. That's $40,000 I could be contributing to my savings/401k, or using to put a down payment on a car/house in the future.\n\nI enjoy my current job and hope to stay there for many years. I think I'm in an okay financial position for someone my age with a high school diploma. However, I fear getting stuck in middle management forever, or even worse, getting laid off. I feel like my fate is tied to this particular company. I worry that not having a degree will come back to bite me later in life.\n\nAny thoughts? Thanks for reading.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Planning", "id": "65sds0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 27, "report_reasons": null, "author": "finch666", "saved": false, "mod_reports": [], "name": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "approved_by": null, "over_18": false, "domain": "self.personalfinance", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qstm", "edited": 1492388722.0, "link_flair_css_class": "Planning", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/personalfinance/comments/65sds0/29_years_old_making_46000yr_with_high_school/", "num_reports": null, "locked": false, "stickied": false, "created": 1492417188.0, "url": "https://www.reddit.com/r/personalfinance/comments/65sds0/29_years_old_making_46000yr_with_high_school/", "author_flair_text": null, "quarantine": false, "title": "29 years old, making $46,000/yr with high school diploma, not sure where to go from here", "created_utc": 1492388388.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": "", "user_reports": [], "id": "dgdy4a9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "finch666", "parent_id": "t1_dgctwja", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Thank you for the advice!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the advice!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgdy4a9", "score_hidden": false, "stickied": false, "created": 1492484846.0, "created_utc": 1492456046.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctwja", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "Alex35143", "parent_id": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Similar situation, had ok income with just high school degree, went back to school to a community college when I was 31 and only taking a couple classes each semester for a logistics degree (only a little bit of math). I'm about to graduate this July and already landed a job in logistics about a year ago because my employer saw that I was pursuing the degree. Income is more than before and don't work weekends anymore. I should also add that this was all happening while my wife and I welcomed our first child. It's never too late to change direction and it won't be easy but you won't find out what's possible if you don't try. I thank my wife for pushing me to do this because sincerely the last thing I wanted to do was go back to school in my 30s.  Good luck!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Similar situation, had ok income with just high school degree, went back to school to a community college when I was 31 and only taking a couple classes each semester for a logistics degree (only a little bit of math). I&amp;#39;m about to graduate this July and already landed a job in logistics about a year ago because my employer saw that I was pursuing the degree. Income is more than before and don&amp;#39;t work weekends anymore. I should also add that this was all happening while my wife and I welcomed our first child. It&amp;#39;s never too late to change direction and it won&amp;#39;t be easy but you won&amp;#39;t find out what&amp;#39;s possible if you don&amp;#39;t try. I thank my wife for pushing me to do this because sincerely the last thing I wanted to do was go back to school in my 30s.  Good luck!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgctwja", "score_hidden": false, "stickied": false, "created": 1492417914.0, "created_utc": 1492389114.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": "", "user_reports": [], "id": "dgdy3n7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "finch666", "parent_id": "t1_dgdvck8", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Point well taken.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Point well taken.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgdy3n7", "score_hidden": false, "stickied": false, "created": 1492484826.0, "created_utc": 1492456026.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvck8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crUnchakapoo", "parent_id": "t1_dgctm9e", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "It will be very math intensive. Accounting finance everything. Math is the language of money, and money is the language of business. I suggest OP does some sort of khan academy over summer and take stats business calc and maybe an economics course. Then enroll in fall. Op needs to realize that he can't escape math and his best bet is to attack it and figure it out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It will be very math intensive. Accounting finance everything. Math is the language of money, and money is the language of business. I suggest OP does some sort of khan academy over summer and take stats business calc and maybe an economics course. Then enroll in fall. Op needs to realize that he can&amp;#39;t escape math and his best bet is to attack it and figure it out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgdvck8", "score_hidden": false, "stickied": false, "created": 1492481717.0, "created_utc": 1492452917.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctm9e", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "kayoss_", "parent_id": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Look at the requirements to move up in your job. At some point, you may need a degree. And you don't want to miss out on a promotion for a few years while you are getting that degree. Or, if you are let go from this job, would you be able to get a similar paying job without a degree?\n\nPlus, if you get a degree, with your years of experience behind you, you wouldn't have to stick to just entry-level jobs. A person with a degree and 10+ years of experience has far better options than a fresh college grad.\n\nYou definitely are doing well for yourself, so don't beat yourself up. But do also think about what your future could be.\n\nFor degrees, consider business administration. It might give you a broad enough set of business knowledge that you could apply to this job. And I do not think it is math-intensive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look at the requirements to move up in your job. At some point, you may need a degree. And you don&amp;#39;t want to miss out on a promotion for a few years while you are getting that degree. Or, if you are let go from this job, would you be able to get a similar paying job without a degree?&lt;/p&gt;\n\n&lt;p&gt;Plus, if you get a degree, with your years of experience behind you, you wouldn&amp;#39;t have to stick to just entry-level jobs. A person with a degree and 10+ years of experience has far better options than a fresh college grad.&lt;/p&gt;\n\n&lt;p&gt;You definitely are doing well for yourself, so don&amp;#39;t beat yourself up. But do also think about what your future could be.&lt;/p&gt;\n\n&lt;p&gt;For degrees, consider business administration. It might give you a broad enough set of business knowledge that you could apply to this job. And I do not think it is math-intensive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgctm9e", "score_hidden": false, "stickied": false, "created": 1492417525.0, "created_utc": 1492388725.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": "", "user_reports": [], "id": "dgde0dz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "orsalite", "parent_id": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "If you're going the managerial path, I suggest Business Administration or HR-related degrees (maybe Project Management?). They should have minimal math requirements and would actually help you on your day to day job. Don't get a degree just to get a degree.\n\nI agree with other people to take it slowly. Even a \"currently enrolled\" and an \"estimated graduation date\" should help your resume for future promotions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re going the managerial path, I suggest Business Administration or HR-related degrees (maybe Project Management?). They should have minimal math requirements and would actually help you on your day to day job. Don&amp;#39;t get a degree just to get a degree.&lt;/p&gt;\n\n&lt;p&gt;I agree with other people to take it slowly. Even a &amp;quot;currently enrolled&amp;quot; and an &amp;quot;estimated graduation date&amp;quot; should help your resume for future promotions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgde0dz", "score_hidden": false, "stickied": false, "created": 1492458645.0, "created_utc": 1492429845.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": "", "user_reports": [], "id": "dgd0qkr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Beardologist", "parent_id": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Sounds like you've put in a ton of hard work. How far can you really go at your current company? Do you plan on having kids in the future? Buying a house? Will you be able to do that on $49k?\n\nI suggest keep it up with school. Finding that one thing you want to do is insanely hard to do.  Find something you would like to do more than your current job that would make you more right out of college. You're not too old to start something new! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you&amp;#39;ve put in a ton of hard work. How far can you really go at your current company? Do you plan on having kids in the future? Buying a house? Will you be able to do that on $49k?&lt;/p&gt;\n\n&lt;p&gt;I suggest keep it up with school. Finding that one thing you want to do is insanely hard to do.  Find something you would like to do more than your current job that would make you more right out of college. You&amp;#39;re not too old to start something new! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgd0qkr", "score_hidden": false, "stickied": false, "created": 1492427196.0, "created_utc": 1492398396.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": "", "user_reports": [], "id": "dgdfmc2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "karch131", "parent_id": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "If you enjoy what you do, consider some sort of business/management degree.  If your grocery store is a chain, it will help you move up the corporate ladder.  Ask around, a lot of companies will help contribute or reimburse for relevant schooling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you enjoy what you do, consider some sort of business/management degree.  If your grocery store is a chain, it will help you move up the corporate ladder.  Ask around, a lot of companies will help contribute or reimburse for relevant schooling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgdfmc2", "score_hidden": false, "stickied": false, "created": 1492462013.0, "created_utc": 1492433213.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": "", "user_reports": [], "id": "dgd09mc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "KBCme", "parent_id": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Since it sounds like you are doing quite well in your current place, there's no rush to get a degree. Does your employer offer any tuition assistance? Maybe plan on taking 1 or two courses per term and keep at it. Pay as you go for as much as you can. A degree in business, economics or finance would be most applicable (economics and finance are pretty math heavy, though). \n\nShowing your perseverance to get a degree while working your way up through the ranks would be a huge plus on your resume. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since it sounds like you are doing quite well in your current place, there&amp;#39;s no rush to get a degree. Does your employer offer any tuition assistance? Maybe plan on taking 1 or two courses per term and keep at it. Pay as you go for as much as you can. A degree in business, economics or finance would be most applicable (economics and finance are pretty math heavy, though). &lt;/p&gt;\n\n&lt;p&gt;Showing your perseverance to get a degree while working your way up through the ranks would be a huge plus on your resume. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgd09mc", "score_hidden": false, "stickied": false, "created": 1492426532.0, "created_utc": 1492397732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": "", "user_reports": [], "id": "dgctmed", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "the_grumpy_walrus", "parent_id": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Honestly man i'm in too deep to quit but gonna graduate with a degree in biochemistry and may start around the same as you. Lots of debt though, it was a struggle and if you're happy stick with it and try to advance in the company. I'm no expert obviously and I'm interested to see what others say. College is pretty expensive, if you do go I know alot of community colleges offer a 2 year degree in IT that could probably boost you up in the company.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly man i&amp;#39;m in too deep to quit but gonna graduate with a degree in biochemistry and may start around the same as you. Lots of debt though, it was a struggle and if you&amp;#39;re happy stick with it and try to advance in the company. I&amp;#39;m no expert obviously and I&amp;#39;m interested to see what others say. College is pretty expensive, if you do go I know alot of community colleges offer a 2 year degree in IT that could probably boost you up in the company.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgctmed", "score_hidden": false, "stickied": false, "created": 1492417530.0, "created_utc": 1492388730.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": "", "user_reports": [], "id": "dgczxks", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WorksInProcess", "parent_id": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Engineering is good money. But, you have to love it to make it a worthy pursuit. You are right to consider a change in degree as an engineering degree will just get more math intensive.\n\nIf you are a good manager and, I'm guessing, something of a people person, you might consider construction management. Corporate construction can have great stability and travel opportunities.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Engineering is good money. But, you have to love it to make it a worthy pursuit. You are right to consider a change in degree as an engineering degree will just get more math intensive.&lt;/p&gt;\n\n&lt;p&gt;If you are a good manager and, I&amp;#39;m guessing, something of a people person, you might consider construction management. Corporate construction can have great stability and travel opportunities.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgczxks", "score_hidden": false, "stickied": false, "created": 1492426059.0, "created_utc": 1492397259.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": "", "user_reports": [], "id": "dgcwqol", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SoggyMcmufffinns", "parent_id": "t1_dgcv80x", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Not really true for many grocery stores. If you want a cooperate position it is different, but for middle to upper management for the grocery store itself it tends not to be required as experience is the most important factor. This is coming from someone who worked his way up to the assistant store director position and denied the top level management position of store director to pursue something different. I have many friends that work in the grocery business across different chains (well known chains) across different states as well. You can get pretty high up in management without a degree in the grocery business. If you work for the really big chains and stores you can also make a really decent chunk of change. Of course this does depend on the company, but don't just assume it is required.\n\nThat being said, a degree gives you more options in life in general. If that's what you want then you can pick a degree that has many outlets and marketable selling points to give you more options in the future. If you love managing you can even get a degree in business management or something rather and use that coupled with prior experience to get jobs in other venues if you so choose. Management skills are ones that carry over pretty well across many fields. Anyway, good luck in whatever you decide!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really true for many grocery stores. If you want a cooperate position it is different, but for middle to upper management for the grocery store itself it tends not to be required as experience is the most important factor. This is coming from someone who worked his way up to the assistant store director position and denied the top level management position of store director to pursue something different. I have many friends that work in the grocery business across different chains (well known chains) across different states as well. You can get pretty high up in management without a degree in the grocery business. If you work for the really big chains and stores you can also make a really decent chunk of change. Of course this does depend on the company, but don&amp;#39;t just assume it is required.&lt;/p&gt;\n\n&lt;p&gt;That being said, a degree gives you more options in life in general. If that&amp;#39;s what you want then you can pick a degree that has many outlets and marketable selling points to give you more options in the future. If you love managing you can even get a degree in business management or something rather and use that coupled with prior experience to get jobs in other venues if you so choose. Management skills are ones that carry over pretty well across many fields. Anyway, good luck in whatever you decide!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgcwqol", "score_hidden": false, "stickied": false, "created": 1492421626.0, "created_utc": 1492392826.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv80x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gajoujai", "parent_id": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "You should definitely keep working on getting a degree, even if you why too stay with your current employer. Most if not all reputable employers would require a degree for 'higher Management positions', which is what you are shooting for.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should definitely keep working on getting a degree, even if you why too stay with your current employer. Most if not all reputable employers would require a degree for &amp;#39;higher Management positions&amp;#39;, which is what you are shooting for.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgcv80x", "score_hidden": false, "stickied": false, "created": 1492419679.0, "created_utc": 1492390879.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": "", "user_reports": [], "id": "dgd2zav", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "washypaige", "parent_id": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "A couple of points to make here. First off, you're young. Paying off loans for 5 years seems like a long time to you, and it's not. Once you get to your mid forties, entire decades blur together. When I look back on my high school and college years, I'm amazed at how myopic I was at the time, and what opportunities I passed up because they seemed either time consuming or difficult, and now I realize that I can handle way more difficulty I ever knew possible and time fucking flies. \n\nSecondly, with a few exceptions, what you study in undergrad rarely has anything to do with what field your career will end up in. My husband studied computer something or other, now he's in a specialized field of law which has nothing to do with IT, I studied photography and work in healthcare. \n\nMy advice is go to school, work as much as you can and borrow as little as you can. Work full time/overtime during the summer to save up tuition. Think about what you like about your work and what you don't like. Do you like helping people? Would you rather be left alone? Do you care if you're a cog in a wheel? Does your job need to be a big part of your identity? \n\nLastly, that salary may seem like a lot right now, but that perspective will change. I remember thinking that I'd be super stoked making x number of dollars some day, if only. I just paid that dollar amount in income tax this year. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A couple of points to make here. First off, you&amp;#39;re young. Paying off loans for 5 years seems like a long time to you, and it&amp;#39;s not. Once you get to your mid forties, entire decades blur together. When I look back on my high school and college years, I&amp;#39;m amazed at how myopic I was at the time, and what opportunities I passed up because they seemed either time consuming or difficult, and now I realize that I can handle way more difficulty I ever knew possible and time fucking flies. &lt;/p&gt;\n\n&lt;p&gt;Secondly, with a few exceptions, what you study in undergrad rarely has anything to do with what field your career will end up in. My husband studied computer something or other, now he&amp;#39;s in a specialized field of law which has nothing to do with IT, I studied photography and work in healthcare. &lt;/p&gt;\n\n&lt;p&gt;My advice is go to school, work as much as you can and borrow as little as you can. Work full time/overtime during the summer to save up tuition. Think about what you like about your work and what you don&amp;#39;t like. Do you like helping people? Would you rather be left alone? Do you care if you&amp;#39;re a cog in a wheel? Does your job need to be a big part of your identity? &lt;/p&gt;\n\n&lt;p&gt;Lastly, that salary may seem like a lot right now, but that perspective will change. I remember thinking that I&amp;#39;d be super stoked making x number of dollars some day, if only. I just paid that dollar amount in income tax this year. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgd2zav", "score_hidden": false, "stickied": false, "created": 1492430577.0, "created_utc": 1492401777.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qstm", "removal_reason": null, "link_id": "t3_65sds0", "likes": null, "replies": "", "user_reports": [], "id": "dgd5o06", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "TheINTL", "parent_id": "t3_65sds0", "subreddit_name_prefixed": "r/personalfinance", "controversiality": 0, "body": "Honestly everyone has a bachelor these days, I mean having one would give you better chances for a higher paying job but that's 4 to 5 years or studying and tuition.\n\nAt this point if you want more salary, look to jump ship.\n\nhttps://www.forbes.com/sites/cameronkeng/2014/06/22/employees-that-stay-in-companies-longer-than-2-years-get-paid-50-less/#52ed559de07f\n\nAnd do so every few years.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly everyone has a bachelor these days, I mean having one would give you better chances for a higher paying job but that&amp;#39;s 4 to 5 years or studying and tuition.&lt;/p&gt;\n\n&lt;p&gt;At this point if you want more salary, look to jump ship.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.forbes.com/sites/cameronkeng/2014/06/22/employees-that-stay-in-companies-longer-than-2-years-get-paid-50-less/#52ed559de07f\"&gt;https://www.forbes.com/sites/cameronkeng/2014/06/22/employees-that-stay-in-companies-longer-than-2-years-get-paid-50-less/#52ed559de07f&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;And do so every few years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "personalfinance", "name": "t1_dgd5o06", "score_hidden": false, "stickied": false, "created": 1492435446.0, "created_utc": 1492406646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}]