[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So... I love technology and all. I always have to get the newest tech. But the one thing I miss is getting to know someone new with real emotion. Asking anything, getting that awkwardness out during a first interaction. It&amp;#39;s so much more visceral through a voice chat/phone call than over a text. So, what I&amp;#39;m asking for is to get to know you, the real you, raw and uncut, through a skype or phone call! Let&amp;#39;s not hide behind the safety of typed words anymore.\nA little mini bio just so you know who you&amp;#39;re speaking with: 26, 6&amp;#39;3, runners build, sailing and cooking are my current obsessions, with lots more sitting on the back burner. I love cleaning the kitchen but can not stand folding and putting away laundry. I&amp;#39;m active and love to be outdoors but hate watching sports, any sports. If I were to cook you a meal and wanted to impress you the most I would grill Salmon. It&amp;#39;s by far my favorite meal and in my opinion the best one I can cook. I&amp;#39;ve been known to man my charcoal grill even in winter temperatures below zero just to get a good meal cooked. You would also be surprised by this post to find out that whenever I take the Meyers-Briggs test I score INTJ. I&amp;#39;m definitely naturally introverted, in that I really don&amp;#39;t mind sitting at home working on a project alone. But at the same time I don&amp;#39;t want to limit myself to this box so I constantly strive to push my limits and get out of my box.&lt;/p&gt;\n\n&lt;p&gt;If any of this sounds not 100% crazy to you, we should totally do this!. I want to know everything that makes you tick!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So... I love technology and all. I always have to get the newest tech. But the one thing I miss is getting to know someone new with real emotion. Asking anything, getting that awkwardness out during a first interaction. It's so much more visceral through a voice chat/phone call than over a text. So, what I'm asking for is to get to know you, the real you, raw and uncut, through a skype or phone call! Let's not hide behind the safety of typed words anymore.\nA little mini bio just so you know who you're speaking with: 26, 6'3, runners build, sailing and cooking are my current obsessions, with lots more sitting on the back burner. I love cleaning the kitchen but can not stand folding and putting away laundry. I'm active and love to be outdoors but hate watching sports, any sports. If I were to cook you a meal and wanted to impress you the most I would grill Salmon. It's by far my favorite meal and in my opinion the best one I can cook. I've been known to man my charcoal grill even in winter temperatures below zero just to get a good meal cooked. You would also be surprised by this post to find out that whenever I take the Meyers-Briggs test I score INTJ. I'm definitely naturally introverted, in that I really don't mind sitting at home working on a project alone. But at the same time I don't want to limit myself to this box so I constantly strive to push my limits and get out of my box.\n\n\nIf any of this sounds not 100% crazy to you, we should totally do this!. I want to know everything that makes you tick!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "64vh95", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "hugh0453", "saved": false, "mod_reports": [], "name": "t3_64vh95", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/64vh95/26_m4f_i_dont_care_lets_be_old_fashioned_and_get/", "num_reports": null, "locked": false, "stickied": false, "created": 1491992714.0, "url": "https://www.reddit.com/r/r4r/comments/64vh95/26_m4f_i_dont_care_lets_be_old_fashioned_and_get/", "author_flair_text": null, "quarantine": false, "title": "26 [M4F] I don't care - Let's be old fashioned and get to know each other by voice!", "created_utc": 1491963914.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]