[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;hi there. i&amp;#39;m a 20 y.o student in the middle of america. i like lots of things, but for the last six months my life has been revolving around fitness, specifically powerlifting. i&amp;#39;m basically a small girl who tries to stay politically moderate but leans left and after one too many acid trips i find myself in the eco-hippie category.&lt;br/&gt;\ni like folk/alternative/rap music. i like parks+rec/the office/cartoons and lots of movies. i like fantasy things the most. i don&amp;#39;t drink or do any kind of drugs nowaways, i&amp;#39;m more in the camp that living simply is the best way to live. one day when my (future) kids are grown and my responsibilities are lax, maybe i can pack a bowl but that&amp;#39;s a long time from now.&lt;br/&gt;\ni like asian-culture, but not like filthy frank weaboo type shit. i like japanese and korean trap music. i don&amp;#39;t eat meat, i&amp;#39;d like to live in japan so maybe one day i&amp;#39;ll take up fish again.&lt;br/&gt;\nif you like to lift heavy shit, pm ya girl and help me raise my bitch total. if you like to contemplate how shitty society is and how we can fix it, pm me. if you like music that makes your skin tingle, send me a link. i don&amp;#39;t use social media at all besides reddit and youtube, we can text tho. that&amp;#39;s all :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "hi there. i'm a 20 y.o student in the middle of america. i like lots of things, but for the last six months my life has been revolving around fitness, specifically powerlifting. i'm basically a small girl who tries to stay politically moderate but leans left and after one too many acid trips i find myself in the eco-hippie category.   \ni like folk/alternative/rap music. i like parks+rec/the office/cartoons and lots of movies. i like fantasy things the most. i don't drink or do any kind of drugs nowaways, i'm more in the camp that living simply is the best way to live. one day when my (future) kids are grown and my responsibilities are lax, maybe i can pack a bowl but that's a long time from now.    \ni like asian-culture, but not like filthy frank weaboo type shit. i like japanese and korean trap music. i don't eat meat, i'd like to live in japan so maybe one day i'll take up fish again.   \nif you like to lift heavy shit, pm ya girl and help me raise my bitch total. if you like to contemplate how shitty society is and how we can fix it, pm me. if you like music that makes your skin tingle, send me a link. i don't use social media at all besides reddit and youtube, we can text tho. that's all :)\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "F4R", "id": "64wmjb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "immediatethro", "saved": false, "mod_reports": [], "name": "t3_64wmjb", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "F4R", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/64wmjb/20_f4r_nebraska_but_really_who_cares_i_dont_have/", "num_reports": null, "locked": false, "stickied": false, "created": 1492009218.0, "url": "https://www.reddit.com/r/r4r/comments/64wmjb/20_f4r_nebraska_but_really_who_cares_i_dont_have/", "author_flair_text": null, "quarantine": false, "title": "20 [F4R] nebraska but really who cares - i don't have any friends with the same interests as me. do you like strength sports and over-thinking?", "created_utc": 1491980418.0, "distinguished": null, "media": null, "upvote_ratio": 0.73, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rn0e", "removal_reason": null, "link_id": "t3_64wmjb", "likes": null, "replies": "", "user_reports": [], "id": "dgaengc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "slc_monk", "parent_id": "t3_64wmjb", "subreddit_name_prefixed": "r/r4r", "controversiality": 0, "body": "Over thinking is what I do best.\nIt took me 30 minutes to write this message.\n\nIs over-thinking hyphenated? Is it pretentious to even mention hyphens? I sure hope this girl finds this hyphenation monologue sexy. But I also hope she's not a grammar nazi? Is grammar Nazism a deal breaker for me? Is it shallow if I say yes? Or is it the other way. Maybe I'm single because I have undiagnosed autism? ", "edited": 1492240052.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Over thinking is what I do best.\nIt took me 30 minutes to write this message.&lt;/p&gt;\n\n&lt;p&gt;Is over-thinking hyphenated? Is it pretentious to even mention hyphens? I sure hope this girl finds this hyphenation monologue sexy. But I also hope she&amp;#39;s not a grammar nazi? Is grammar Nazism a deal breaker for me? Is it shallow if I say yes? Or is it the other way. Maybe I&amp;#39;m single because I have undiagnosed autism? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "r4r", "name": "t1_dgaengc", "score_hidden": false, "stickied": false, "created": 1492268669.0, "created_utc": 1492239869.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]