[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve made this post once before and talked to some nice people and met with a very cool person who didn&amp;#39;t even try to murder me. So my strict &amp;quot;no murderers&amp;quot; policy is going great and I&amp;#39;m sticking to it.&lt;/p&gt;\n\n&lt;p&gt;And now a little about myself: I am, first and foremost, a maker of weird jokes, as you may have guessed. I have a degree in biology and graduated summa cum laude. I like to think I&amp;#39;m well versed in other areas too, so I should be good for most intellectual conversations. Currently I have a boring lab job that doesn&amp;#39;t pay particularly well, but I&amp;#39;ve had worse employers, so I&amp;#39;m quite thankful. &lt;/p&gt;\n\n&lt;p&gt;As for my interests: I&amp;#39;ve read a lot of books by Chuck Palahniuk, Kurt Vonnegut, and Stephen King. I&amp;#39;ve listened to a lot of songs by Elliott Smith, The Mountain Goats, and Pat the Bunny. I like to sing, have played in bands, but only play one instrument and it&amp;#39;s not something cool like guitar. I&amp;#39;m an ok tennis player, a better table tennis player, and cycle between periods of fitness and inactivity. I love stand up comedy, and have performed some at an open mic with some success. English is my native tongue, but I also speak russian very poorly and I forgotten most of what I knew about french. I&amp;#39;m probably leaving things out, but it is possible I might be a bit boring.&lt;/p&gt;\n\n&lt;p&gt;As for what I&amp;#39;m looking for, I&amp;#39;m not entirely sure. Even if I knew what I wanted it wouldn&amp;#39;t necessarily be what&amp;#39;s best for me. That said, intelligence is attractive. Physically, I tend to prefer petite women, because I&amp;#39;m more or less a petite man at 5&amp;#39;7. Mostly I&amp;#39;m looking for someone who accepts and understands me. If any of this resonates with you send me a message and we&amp;#39;ll see what happens.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've made this post once before and talked to some nice people and met with a very cool person who didn't even try to murder me. So my strict \"no murderers\" policy is going great and I'm sticking to it.\n\nAnd now a little about myself: I am, first and foremost, a maker of weird jokes, as you may have guessed. I have a degree in biology and graduated summa cum laude. I like to think I'm well versed in other areas too, so I should be good for most intellectual conversations. Currently I have a boring lab job that doesn't pay particularly well, but I've had worse employers, so I'm quite thankful. \n\nAs for my interests: I've read a lot of books by Chuck Palahniuk, Kurt Vonnegut, and Stephen King. I've listened to a lot of songs by Elliott Smith, The Mountain Goats, and Pat the Bunny. I like to sing, have played in bands, but only play one instrument and it's not something cool like guitar. I'm an ok tennis player, a better table tennis player, and cycle between periods of fitness and inactivity. I love stand up comedy, and have performed some at an open mic with some success. English is my native tongue, but I also speak russian very poorly and I forgotten most of what I knew about french. I'm probably leaving things out, but it is possible I might be a bit boring.\n\nAs for what I'm looking for, I'm not entirely sure. Even if I knew what I wanted it wouldn't necessarily be what's best for me. That said, intelligence is attractive. Physically, I tend to prefer petite women, because I'm more or less a petite man at 5'7. Mostly I'm looking for someone who accepts and understands me. If any of this resonates with you send me a message and we'll see what happens.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "64zal5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "AnAltForTheAges", "saved": false, "mod_reports": [], "name": "t3_64zal5", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/64zal5/28_m4f_philadelphia_area_looking_for_someone_cute/", "num_reports": null, "locked": false, "stickied": false, "created": 1492043894.0, "url": "https://www.reddit.com/r/r4r/comments/64zal5/28_m4f_philadelphia_area_looking_for_someone_cute/", "author_flair_text": null, "quarantine": false, "title": "28 [M4F] Philadelphia Area - Looking for someone cute who won't try to murder me.", "created_utc": 1492015094.0, "distinguished": null, "media": null, "upvote_ratio": 0.76, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rn0e", "removal_reason": null, "link_id": "t3_64zal5", "likes": null, "replies": "", "user_reports": [], "id": "dg75red", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Raptr117", "parent_id": "t3_64zal5", "subreddit_name_prefixed": "r/r4r", "controversiality": 0, "body": "You want someone who won't try to kill you in Philly? Good luck mate", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You want someone who won&amp;#39;t try to kill you in Philly? Good luck mate&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "r4r", "name": "t1_dg75red", "score_hidden": false, "stickied": false, "created": 1492087520.0, "created_utc": 1492058720.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]