[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Pics - &lt;a href=\"http://imgur.com/a/u8Nca\"&gt;http://imgur.com/a/u8Nca&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Being warm-hearted is a must.  I definitely shudder imagining someone reading that and being like, &amp;quot;fuck, is that me?  Do I have a warm heart?  I don&amp;#39;t really know.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I just want to be goobers with others who are wonderfully complex and unique.  I often find other peoples neuroses quite charming, especially prior to a point in a relationship where it&amp;#39;s eating you alive and ruining your life.  It tends to make people interesting, if difficult?  But sometimes it&amp;#39;s not so difficult at all.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m probably down to just talk on the phone, or skype.  I guess we could play tag here for a little bit.  But I&amp;#39;m really not looking to just text someone back and forth forever.  That doesn&amp;#39;t exactly feel especially real or engaging, and while I am looking for a little bit of solace in the cherished company of fellow weirdos with whom I can share more than less of myself, and have that go over splendidly - I&amp;#39;m really not seeking my comfort zone.  That&amp;#39;s a good place to fall asleep in, not so much a place to make wonderful connections and feel more alive than we were otherwise going to on this.. wait, let me check.. okay, Tuesday night.&lt;/p&gt;\n\n&lt;p&gt;I should write lots about me, in to this and that, blah blah.  Deeply non religious, pro science/empiricism/logic, love soft science even more than hard science, love people, have a lot of humility to compensate for all my self indulgent snowflakey self esteem, want to make weird noises with you, watch those artsy films, talk about everything grey, dynamic and related.  Want to see what you think about this and that.&lt;/p&gt;\n\n&lt;p&gt;I waaaaant to laugh and learn about each other via improvised answers to painfully broad yet meaningful questions.  Want to take risks of being ourselves while still not knowing what that will mean to the other person.&lt;/p&gt;\n\n&lt;p&gt;Want to not be normal or waste time with overly conventional pretenses for how we have to act.  Want to be engaged by something you say, or share, or ask me.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re shy, set yourself on fire just a little, because I might be worth it?  I just want to have weird and stimulating conversations, nobody is going to die.&lt;/p&gt;\n\n&lt;p&gt;Message me!  And for the love of something, possibly everything - please include pics of yourself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Pics - http://imgur.com/a/u8Nca\n\nBeing warm-hearted is a must.  I definitely shudder imagining someone reading that and being like, \"fuck, is that me?  Do I have a warm heart?  I don't really know.\"\n\nI just want to be goobers with others who are wonderfully complex and unique.  I often find other peoples neuroses quite charming, especially prior to a point in a relationship where it's eating you alive and ruining your life.  It tends to make people interesting, if difficult?  But sometimes it's not so difficult at all.\n\nI'm probably down to just talk on the phone, or skype.  I guess we could play tag here for a little bit.  But I'm really not looking to just text someone back and forth forever.  That doesn't exactly feel especially real or engaging, and while I am looking for a little bit of solace in the cherished company of fellow weirdos with whom I can share more than less of myself, and have that go over splendidly - I'm really not seeking my comfort zone.  That's a good place to fall asleep in, not so much a place to make wonderful connections and feel more alive than we were otherwise going to on this.. wait, let me check.. okay, Tuesday night.\n\nI should write lots about me, in to this and that, blah blah.  Deeply non religious, pro science/empiricism/logic, love soft science even more than hard science, love people, have a lot of humility to compensate for all my self indulgent snowflakey self esteem, want to make weird noises with you, watch those artsy films, talk about everything grey, dynamic and related.  Want to see what you think about this and that.\n\nI waaaaant to laugh and learn about each other via improvised answers to painfully broad yet meaningful questions.  Want to take risks of being ourselves while still not knowing what that will mean to the other person.\n\nWant to not be normal or waste time with overly conventional pretenses for how we have to act.  Want to be engaged by something you say, or share, or ask me.\n\nIf you're shy, set yourself on fire just a little, because I might be worth it?  I just want to have weird and stimulating conversations, nobody is going to die.\n\nMessage me!  And for the love of something, possibly everything - please include pics of yourself.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "651g2j", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "HighrAndHighr", "saved": false, "mod_reports": [], "name": "t3_651g2j", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/651g2j/30_m4f_colorado_anywhere_looking_for_other/", "num_reports": null, "locked": false, "stickied": false, "created": 1492064242.0, "url": "https://www.reddit.com/r/r4r/comments/651g2j/30_m4f_colorado_anywhere_looking_for_other/", "author_flair_text": null, "quarantine": false, "title": "30 [M4F] Colorado / Anywhere - Looking for other outrageously intelligent and playful weirdos [PICS]", "created_utc": 1492035442.0, "distinguished": null, "media": null, "upvote_ratio": 0.71, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]