[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;EDIT: Hello all, I am receiving many responses, apologizes in advance for slow replies! &lt;/p&gt;\n\n&lt;p&gt;Hi all, yes that&amp;#39;s a quote by Gandalf ;) well done.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m not sure where to start? This is pretty daunting. :)&lt;/p&gt;\n\n&lt;p&gt;Well, I&amp;#39;m a 27 yr old uk/asian working professional, who is looking to get to know someone whether being completely platonic or romantic. Unfortunately, due to where I live my life has ended up being quite isolated. I live a very low-key lifestyle where all I do is go to work and the few friends I have are mainly online. I admit this isn&amp;#39;t the life I want, but I&amp;#39;m making the most of it and have goals of moving in the near future.&lt;/p&gt;\n\n&lt;p&gt;Personality; I&amp;#39;m very much an introverted extrovert, who enjoys the balance of seeing people and having time to myself. I believe aspirations and self-development are very important and love encouraging or standing by someone&amp;#39;s passion no matter how ridiculous. Natural carer and worrier, pretty much the girl who is great at giving advice just not to herself. I&amp;#39;m diplomatic, will speak my mind if something is unfair but am open-minded and non-judgmental to people&amp;#39;s views. I have a mature side when necessary but also have a sensitive, silly, affectionate and flirty side. I&amp;#39;m a romantic and find joy out of little thoughtful gestures - except cooking (sorry, although I make a killer cup of tea).&lt;/p&gt;\n\n&lt;p&gt;Likes; I&amp;#39;m a nerd basically. I have an unhealthy obsession with LOTR. I am big on British comedy, comedians, panel shows. Love Marvel/DC movies. Interested in the paranormal. Nature, birds, green plains, rolling hills and trees inspire me. Reader of fantasy novels. Music enthusiast, I can listen to one piece of music and lose myself daydreaming. Old buildings, castles and cathedrals fascinate me. DOGS. Gaming (mostly LOTR). And silly stupid stuff like memes, going to conventions, black &amp;amp; white films and junk food.&lt;/p&gt;\n\n&lt;p&gt;You; I think what I seek is simple. But I still haven&amp;#39;t found it yet so maybe I&amp;#39;m kidding myself lol I&amp;#39;d like you to have dreams, be unassuming, have a subtle humor and relating to my interests would be a bonus! Appreciating romance and affection just as well as a lazy day doing literally nothing would also be a bingo. And as much as I appreciate unconventional individualism, a gentleman with a slightly traditional mind-set would be the icing on the cake...aka, don&amp;#39;t send me inappropriate pictures after 3 days. (honestly if you&amp;#39;re sex orientated or very forward you won&amp;#39;t like me).&lt;/p&gt;\n\n&lt;p&gt;F&amp;amp;Q&amp;#39;s: Pic: I&amp;#39;m willing to share as long as you are too! SM: I have most social media but getting to know you first would be good. I know these things don&amp;#39;t take like 5 mins and half way through we might not click? So feel free to message me and we&amp;#39;ll see how it goes! NB: Looking for serious people folks, comments like &amp;quot;send me a PM if interested&amp;quot; doesn&amp;#39;t give me anything to go by? If you want to talk, message me, I don&amp;#39;t bite!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "EDIT: Hello all, I am receiving many responses, apologizes in advance for slow replies! \n\nHi all, yes that's a quote by Gandalf ;) well done.\n\nSo I'm not sure where to start? This is pretty daunting. :)\n\nWell, I'm a 27 yr old uk/asian working professional, who is looking to get to know someone whether being completely platonic or romantic. Unfortunately, due to where I live my life has ended up being quite isolated. I live a very low-key lifestyle where all I do is go to work and the few friends I have are mainly online. I admit this isn't the life I want, but I'm making the most of it and have goals of moving in the near future.\n\nPersonality; I'm very much an introverted extrovert, who enjoys the balance of seeing people and having time to myself. I believe aspirations and self-development are very important and love encouraging or standing by someone's passion no matter how ridiculous. Natural carer and worrier, pretty much the girl who is great at giving advice just not to herself. I'm diplomatic, will speak my mind if something is unfair but am open-minded and non-judgmental to people's views. I have a mature side when necessary but also have a sensitive, silly, affectionate and flirty side. I'm a romantic and find joy out of little thoughtful gestures - except cooking (sorry, although I make a killer cup of tea).\n\nLikes; I'm a nerd basically. I have an unhealthy obsession with LOTR. I am big on British comedy, comedians, panel shows. Love Marvel/DC movies. Interested in the paranormal. Nature, birds, green plains, rolling hills and trees inspire me. Reader of fantasy novels. Music enthusiast, I can listen to one piece of music and lose myself daydreaming. Old buildings, castles and cathedrals fascinate me. DOGS. Gaming (mostly LOTR). And silly stupid stuff like memes, going to conventions, black &amp; white films and junk food.\n\nYou; I think what I seek is simple. But I still haven't found it yet so maybe I'm kidding myself lol I'd like you to have dreams, be unassuming, have a subtle humor and relating to my interests would be a bonus! Appreciating romance and affection just as well as a lazy day doing literally nothing would also be a bingo. And as much as I appreciate unconventional individualism, a gentleman with a slightly traditional mind-set would be the icing on the cake...aka, don't send me inappropriate pictures after 3 days. (honestly if you're sex orientated or very forward you won't like me).\n\nF&amp;Q's: Pic: I'm willing to share as long as you are too! SM: I have most social media but getting to know you first would be good. I know these things don't take like 5 mins and half way through we might not click? So feel free to message me and we'll see how it goes! NB: Looking for serious people folks, comments like \"send me a PM if interested\" doesn't give me anything to go by? If you want to talk, message me, I don't bite!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "F4M", "id": "6549xd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "Orientalelf", "saved": false, "mod_reports": [], "name": "t3_6549xd", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": 1492161817.0, "link_flair_css_class": "F4M", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/6549xd/27_f4m_anywhere_all_we_have_to_decide_is_what_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492101496.0, "url": "https://www.reddit.com/r/r4r/comments/6549xd/27_f4m_anywhere_all_we_have_to_decide_is_what_to/", "author_flair_text": null, "quarantine": false, "title": "27 [F4M] Anywhere - All we have to decide is what to do with the time given to us...", "created_utc": 1492072696.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rn0e", "removal_reason": null, "link_id": "t3_6549xd", "likes": null, "replies": "", "user_reports": [], "id": "dg8apcb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "grinktis", "parent_id": "t3_6549xd", "subreddit_name_prefixed": "r/r4r", "controversiality": 0, "body": "Here's a summary of myself in list form: \n\n24 yo male, \nINTJ-A (more of an ambivert), \nnerd, \nneutral good, \nhetero-demisexual (I prefer romance and getting to know someone first), \nautomath/polymath, \nphilosopher, \ncollege-educated mechanical engineer (control systems focus), \nenjoys cooking (but won't if there is no one to cook for), \nironic sense of humor, \nidolizes knights/samurai, \naims to be greatest person ever, \nlikes anime (dark and mature themes), doesn't like american animation, \ndog person, \nopen-minded,\nreads non-fiction books,\ndoes Okinawan karate and learned other martial arts from veterans,\nand many other qualities you may like. \n\n*Gets a breath of air*\nSo, how about giving me a message?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s a summary of myself in list form: &lt;/p&gt;\n\n&lt;p&gt;24 yo male, \nINTJ-A (more of an ambivert), \nnerd, \nneutral good, \nhetero-demisexual (I prefer romance and getting to know someone first), \nautomath/polymath, \nphilosopher, \ncollege-educated mechanical engineer (control systems focus), \nenjoys cooking (but won&amp;#39;t if there is no one to cook for), \nironic sense of humor, \nidolizes knights/samurai, \naims to be greatest person ever, \nlikes anime (dark and mature themes), doesn&amp;#39;t like american animation, \ndog person, \nopen-minded,\nreads non-fiction books,\ndoes Okinawan karate and learned other martial arts from veterans,\nand many other qualities you may like. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Gets a breath of air&lt;/em&gt;\nSo, how about giving me a message?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "r4r", "name": "t1_dg8apcb", "score_hidden": false, "stickied": false, "created": 1492149483.0, "created_utc": 1492120683.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rn0e", "removal_reason": null, "link_id": "t3_6549xd", "likes": null, "replies": "", "user_reports": [], "id": "dg8m7va", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gupbiee", "parent_id": "t3_6549xd", "subreddit_name_prefixed": "r/r4r", "controversiality": 0, "body": "Any idea where you wanna move? You sound amazing but you're all the way across the Atlantic Ocean sadly", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Any idea where you wanna move? You sound amazing but you&amp;#39;re all the way across the Atlantic Ocean sadly&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "r4r", "name": "t1_dg8m7va", "score_hidden": false, "stickied": false, "created": 1492165069.0, "created_utc": 1492136269.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]