[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay i&amp;#39;m guessing this may get no views or maybe it will but may get no responses or anything, but i would like to get to know someone &amp;amp; if things go well &amp;amp; we connect/click i wouldn&amp;#39;t mind if things could go further &amp;amp; end up being with someone (would like to have that certain girl that you get excited to hear from &amp;amp; who messages you) &amp;amp; just want someone genuine. &lt;/p&gt;\n\n&lt;p&gt;Likes: music (don&amp;#39;t mind which as long as i like the sound of it, will listen to different things sometimes depending on my mood), tv shows (watch quite a few maybe we could see if we watch the same or not), movies (don&amp;#39;t really mind which genre as long as the movie&amp;#39;s good), use to game (grew up with playstation, had all till PS3 stopped working &amp;amp; didn&amp;#39;t bother with PS4), would love to visit different countries (see around, explore the sights), working out (gotten use to it), don&amp;#39;t have any pets but wish i did (love siberian huskies), Star Wars, Marvel &amp;amp; DC superheroes, being outside lol, am a non smoker/drug user &amp;amp; don&amp;#39;t drink alcohol (but i don&amp;#39;t care if you do, but would prefer a non smoker too), guess i&amp;#39;ll leave it at that you can get to know more if you&amp;#39;d like to get in touch.&lt;/p&gt;\n\n&lt;p&gt;This doesn&amp;#39;t matter but i do have a preference for girls with dark hair (like really dark brown or black) below shoulder to just below chest length (but short is still alright, but just prefer long), brown eyes, don&amp;#39;t mind if you&amp;#39;re pale or tanned (but even if you don&amp;#39;t fit this description you can still message me i give all a chance &amp;amp; don&amp;#39;t mind), someone i could be able to pick up, would prefer younger than myself but same age is fine too or maybe a couple years older is alright with me.&lt;/p&gt;\n\n&lt;p&gt;As for me: i&amp;#39;m 5&amp;#39;8 maybe little above that, black hair, brown eyes, light brown skin, physique wise i&amp;#39;m not huge but i&amp;#39;m not a thin guy but i think slim built (do workout &amp;amp; have results) &amp;amp; been told i look good (have even heard &amp;amp; been told cute but can see for yourself if you&amp;#39;d like to get in touch).&lt;/p&gt;\n\n&lt;p&gt;I guess if this interests anyone it would be nice to hear from you &amp;amp; maybe see how things can maybe go &amp;amp; who knows whether we could just be friends or together even ? I also got other thigs we could chat on like kik or skype or could see if there&amp;#39;s anything else we could maybe chat on just let me know ? Don&amp;#39;t mind where in UK or Europe you&amp;#39;re from but would be better for maybe someone close because would be nice to meet for real, i&amp;#39;m in London just to put it out there.&lt;/p&gt;\n\n&lt;p&gt;Hope to maybe hear from any of you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Okay i'm guessing this may get no views or maybe it will but may get no responses or anything, but i would like to get to know someone &amp; if things go well &amp; we connect/click i wouldn't mind if things could go further &amp; end up being with someone (would like to have that certain girl that you get excited to hear from &amp; who messages you) &amp; just want someone genuine. \n\nLikes: music (don't mind which as long as i like the sound of it, will listen to different things sometimes depending on my mood), tv shows (watch quite a few maybe we could see if we watch the same or not), movies (don't really mind which genre as long as the movie's good), use to game (grew up with playstation, had all till PS3 stopped working &amp; didn't bother with PS4), would love to visit different countries (see around, explore the sights), working out (gotten use to it), don't have any pets but wish i did (love siberian huskies), Star Wars, Marvel &amp; DC superheroes, being outside lol, am a non smoker/drug user &amp; don't drink alcohol (but i don't care if you do, but would prefer a non smoker too), guess i'll leave it at that you can get to know more if you'd like to get in touch.\n\nThis doesn't matter but i do have a preference for girls with dark hair (like really dark brown or black) below shoulder to just below chest length (but short is still alright, but just prefer long), brown eyes, don't mind if you're pale or tanned (but even if you don't fit this description you can still message me i give all a chance &amp; don't mind), someone i could be able to pick up, would prefer younger than myself but same age is fine too or maybe a couple years older is alright with me.\n\nAs for me: i'm 5'8 maybe little above that, black hair, brown eyes, light brown skin, physique wise i'm not huge but i'm not a thin guy but i think slim built (do workout &amp; have results) &amp; been told i look good (have even heard &amp; been told cute but can see for yourself if you'd like to get in touch).\n\nI guess if this interests anyone it would be nice to hear from you &amp; maybe see how things can maybe go &amp; who knows whether we could just be friends or together even ? I also got other thigs we could chat on like kik or skype or could see if there's anything else we could maybe chat on just let me know ? Don't mind where in UK or Europe you're from but would be better for maybe someone close because would be nice to meet for real, i'm in London just to put it out there.\n\nHope to maybe hear from any of you.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "656744", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "ASI177", "saved": false, "mod_reports": [], "name": "t3_656744", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": 1492189522.0, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/656744/23_m4f_ukeurope_just_thought_id_give_this_a_shot/", "num_reports": null, "locked": false, "stickied": false, "created": 1492126377.0, "url": "https://www.reddit.com/r/r4r/comments/656744/23_m4f_ukeurope_just_thought_id_give_this_a_shot/", "author_flair_text": null, "quarantine": false, "title": "23 [M4F] UK/Europe - Just Thought I'd Give This A Shot", "created_utc": 1492097577.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]