[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, here we are. I&amp;#39;ve posted this ad, and you&amp;#39;re here reading it. I&amp;#39;d be lying if I said I didn&amp;#39;t feel at least a smidge of apprehension in writing this, having never really been fond of writing about myself. However, I&amp;#39;ve tried to paint an accurate picture of who I am and what I&amp;#39;m looking for, with all my quirks and flaws. Here we go, I suppose...&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been attracted to strong female figures for almost as long as I can remember, and in all honesty, a partner of that sort is a very big part of what I hope to get out of this life. And when I say partner, I really do mean partner. Sex and kink is all well and great, but I&amp;#39;m really looking for someone who has the potential to be more than that. I would love someone to talk to, to confide in, and really to share my life with. And I would love it if I could maybe fill the same spots for that person, too! What I&amp;#39;m looking for is a real relationship, the sort that you can get sappy over, the sort that gives you a real sense of purpose.&lt;/p&gt;\n\n&lt;p&gt;Personality-wise, I am of course, of the submissive sort. I like to please, both sexually and in almost every other way. I&amp;#39;m the person that obsesses over giving someone the perfect birthday present, the one who will try to cook someone&amp;#39;s favorite dish, the type who spends probably way too much time trying to perfect messages, letters, and posts like this. At times it can be that sort of exhausting where you wish you had someone to lean on. I wouldn&amp;#39;t necessarily consider myself shy, although I have been described as such before. And I also wouldn&amp;#39;t consider myself socially awkward, although I certainly have moments that still make me cringe internally. I guess I just don&amp;#39;t often put myself out there to meet people. I have good friends and all, but meeting someone in a romantic sense, and especially in a D/s sense, just intimidates me greatly. I&amp;#39;m a virgin, and I am not perfect by any means. I over-analyze, over-criticize, and can paralyze myself at times in these sorts of situations, or just when making decisions in general. I really don&amp;#39;t think I&amp;#39;m a needy person, but it would be nice to be able to talk through the the things that I struggle with now and then. Of course, I get that this isn&amp;#39;t something that happens overnight, and I certainly don&amp;#39;t expect it to. I only ask for an openness to see where things may lead.&lt;/p&gt;\n\n&lt;p&gt;As far as physical characteristics go, I can&amp;#39;t say that I&amp;#39;m really anything special. I&amp;#39;m 25, 5&amp;#39;7&amp;quot;, 135 lbs, white, with dark, nearly black hair. If anything, I suppose I&amp;#39;m on the thinner side of average, with not much muscle tone. I wear glasses on rare occasion, but I generally stumble through without. Also, I can wiggle my pinky toe independently of my other toes, which I find marginally exciting. I know, probably not the most thrilling description, but for those that care about appearance, I&amp;#39;m willing to share pictures via messages. I should probably also mention that I am a college grad, and fully employed. I work pretty normal hours. I&amp;#39;m located in the southeast US, and happy to give more detail if pressed. Given the nature of all this, it&amp;#39;s almost certain that things will have to at least start out online, and I&amp;#39;m okay with that. While I really hope to eventually pursue something irl, I get that that&amp;#39;s not always possible, especially when just getting to know someone.&lt;/p&gt;\n\n&lt;p&gt;Around this point is probably where I should be listing off what I&amp;#39;m looking for sexually, my various kinks, limits, and the like. But frankly, I think it might be apparent that these sorts of things aren&amp;#39;t really make or break for me. Rest assured, I definitely have a healthy sex drive, and one that I am eager to engage. However, this is a topic I would much prefer to discuss with someone who at least has an interest in me personally. Plus, kink is so much more fun to discuss in an engaging conversation, anyway!&lt;/p&gt;\n\n&lt;p&gt;I think my post is starting to overstay its welcome by now, even though there&amp;#39;s so much more to talk about. I hope I&amp;#39;ve been able to convey myself well, and I promise that I&amp;#39;m not nearly this serious all the time. This is something that means a lot to me, and even just in writing this, I think it may be the most true to myself that I have ever felt. If anything I&amp;#39;ve said has interested you, or if you have any questions, it would make my day to hear from you.&lt;/p&gt;\n\n&lt;p&gt;Thanks for reading!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, here we are. I've posted this ad, and you're here reading it. I'd be lying if I said I didn't feel at least a smidge of apprehension in writing this, having never really been fond of writing about myself. However, I've tried to paint an accurate picture of who I am and what I'm looking for, with all my quirks and flaws. Here we go, I suppose...\n\nI've been attracted to strong female figures for almost as long as I can remember, and in all honesty, a partner of that sort is a very big part of what I hope to get out of this life. And when I say partner, I really do mean partner. Sex and kink is all well and great, but I'm really looking for someone who has the potential to be more than that. I would love someone to talk to, to confide in, and really to share my life with. And I would love it if I could maybe fill the same spots for that person, too! What I'm looking for is a real relationship, the sort that you can get sappy over, the sort that gives you a real sense of purpose.\n\nPersonality-wise, I am of course, of the submissive sort. I like to please, both sexually and in almost every other way. I'm the person that obsesses over giving someone the perfect birthday present, the one who will try to cook someone's favorite dish, the type who spends probably way too much time trying to perfect messages, letters, and posts like this. At times it can be that sort of exhausting where you wish you had someone to lean on. I wouldn't necessarily consider myself shy, although I have been described as such before. And I also wouldn't consider myself socially awkward, although I certainly have moments that still make me cringe internally. I guess I just don't often put myself out there to meet people. I have good friends and all, but meeting someone in a romantic sense, and especially in a D/s sense, just intimidates me greatly. I'm a virgin, and I am not perfect by any means. I over-analyze, over-criticize, and can paralyze myself at times in these sorts of situations, or just when making decisions in general. I really don't think I'm a needy person, but it would be nice to be able to talk through the the things that I struggle with now and then. Of course, I get that this isn't something that happens overnight, and I certainly don't expect it to. I only ask for an openness to see where things may lead.\n\nAs far as physical characteristics go, I can't say that I'm really anything special. I'm 25, 5'7\", 135 lbs, white, with dark, nearly black hair. If anything, I suppose I'm on the thinner side of average, with not much muscle tone. I wear glasses on rare occasion, but I generally stumble through without. Also, I can wiggle my pinky toe independently of my other toes, which I find marginally exciting. I know, probably not the most thrilling description, but for those that care about appearance, I'm willing to share pictures via messages. I should probably also mention that I am a college grad, and fully employed. I work pretty normal hours. I'm located in the southeast US, and happy to give more detail if pressed. Given the nature of all this, it's almost certain that things will have to at least start out online, and I'm okay with that. While I really hope to eventually pursue something irl, I get that that's not always possible, especially when just getting to know someone.\n\nAround this point is probably where I should be listing off what I'm looking for sexually, my various kinks, limits, and the like. But frankly, I think it might be apparent that these sorts of things aren't really make or break for me. Rest assured, I definitely have a healthy sex drive, and one that I am eager to engage. However, this is a topic I would much prefer to discuss with someone who at least has an interest in me personally. Plus, kink is so much more fun to discuss in an engaging conversation, anyway!\n\nI think my post is starting to overstay its welcome by now, even though there's so much more to talk about. I hope I've been able to convey myself well, and I promise that I'm not nearly this serious all the time. This is something that means a lot to me, and even just in writing this, I think it may be the most true to myself that I have ever felt. If anything I've said has interested you, or if you have any questions, it would make my day to hear from you.\n\nThanks for reading!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "65fqap", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "sporadic_diaspora", "saved": false, "mod_reports": [], "name": "t3_65fqap", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/65fqap/25_m4f_a_submissive_guy_looking_for_his_caring/", "num_reports": null, "locked": false, "stickied": false, "created": 1492238329.0, "url": "https://www.reddit.com/r/r4r/comments/65fqap/25_m4f_a_submissive_guy_looking_for_his_caring/", "author_flair_text": null, "quarantine": false, "title": "25 [M4F] A submissive guy looking for his caring, dominant half", "created_utc": 1492209529.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]