[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;One day this will work... &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;About me:&lt;/strong&gt;\nName&amp;#39;s Elaine. I&amp;#39;m 30, single, and live with my cat, Poe, on the GA/SC border. By day, I&amp;#39;m a Nursing student (hoping to be an OR nurse some day) and a private caregiver to someone with special needs. By night, I&amp;#39;m walking around the neighborhood playing Pokemon Go, catching up on anime, or playing something on the PS4. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s always been a doofy fantasy of mine that I&amp;#39;ll meet my next girlfriend through reddit, out while playing Pokemon Go, or at a convention.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What I&amp;#39;m looking for:&lt;/strong&gt;\nFull figured soft butch ladies who are dorky catch my attention first because I&amp;#39;m also an overweight soft butch lady who is dorky, *but... *&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll go for any lady that treats me with respect, but is also really nice to the wait staff, who has goals in life and the desire to start and finish them, who isn&amp;#39;t afraid to hold my hand and kiss me in public, who enjoys the nights in as well as the nights out, who knows how to communicate, who loves &lt;strong&gt;my&lt;/strong&gt; cat because we&amp;#39;re a package deal, who doesn&amp;#39;t really want children, who is monogamous, who will grab me and start dancing with me in the living room/kitchen, who has a smile to rival the sun, who doesn&amp;#39;t mind that I&amp;#39;m a big girl &lt;strong&gt;if she&amp;#39;s not a big girl herself&lt;/strong&gt;, who thinks my nerdy hobbies (anime, video games, conventions, etc.) are interesting/fun &lt;strong&gt;if she&amp;#39;s not into it herself&lt;/strong&gt;, who loves traveling, who is close to me in age (23+) .... &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re out there somewhere, right? &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How I prefer we communicate:&lt;/strong&gt;\nTexting doesn&amp;#39;t bother me at all, but I have and use messengers regularly for those shy about giving out their numbers. Ultimately, I want to be in a relationship, someone to share my happiness with, but you&amp;#39;ll have to pretty much be able to check off all the aforementioned boxes. Once things progress naturally, I&amp;#39;d love to hear your voice and see your face sometime. I&amp;#39;ve come to terms with being okay with long distance as long as it&amp;#39;s not crazy (within the US), but within reasonable driving distance would be a major bonus. &lt;/p&gt;\n\n&lt;p&gt;I want something real. I&amp;#39;m tired of games and ladies that never put any real effort into getting to know someone. Help me, Reddit - You&amp;#39;re my only hope. (Okay, not really, but I wanted to use a Star Wars reference, lolol.)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://m.imgur.com/0HqIkUc\"&gt;(I&amp;#39;m in the middle)&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://m.imgur.com/1RziPnW\"&gt;(Conventions with friends make me happy)&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://imgur.com/7D2W2oM\"&gt;(Most recent)&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "One day this will work... \n\n**About me:**\nName's Elaine. I'm 30, single, and live with my cat, Poe, on the GA/SC border. By day, I'm a Nursing student (hoping to be an OR nurse some day) and a private caregiver to someone with special needs. By night, I'm walking around the neighborhood playing Pokemon Go, catching up on anime, or playing something on the PS4. \n\nIt's always been a doofy fantasy of mine that I'll meet my next girlfriend through reddit, out while playing Pokemon Go, or at a convention.\n\n**What I'm looking for:**\nFull figured soft butch ladies who are dorky catch my attention first because I'm also an overweight soft butch lady who is dorky, *but... *\n\nI'll go for any lady that treats me with respect, but is also really nice to the wait staff, who has goals in life and the desire to start and finish them, who isn't afraid to hold my hand and kiss me in public, who enjoys the nights in as well as the nights out, who knows how to communicate, who loves **my** cat because we're a package deal, who doesn't really want children, who is monogamous, who will grab me and start dancing with me in the living room/kitchen, who has a smile to rival the sun, who doesn't mind that I'm a big girl **if she's not a big girl herself**, who thinks my nerdy hobbies (anime, video games, conventions, etc.) are interesting/fun **if she's not into it herself**, who loves traveling, who is close to me in age (23+) .... \n\nYou're out there somewhere, right? \n\n**How I prefer we communicate:**\nTexting doesn't bother me at all, but I have and use messengers regularly for those shy about giving out their numbers. Ultimately, I want to be in a relationship, someone to share my happiness with, but you'll have to pretty much be able to check off all the aforementioned boxes. Once things progress naturally, I'd love to hear your voice and see your face sometime. I've come to terms with being okay with long distance as long as it's not crazy (within the US), but within reasonable driving distance would be a major bonus. \n\nI want something real. I'm tired of games and ladies that never put any real effort into getting to know someone. Help me, Reddit - You're my only hope. (Okay, not really, but I wanted to use a Star Wars reference, lolol.)\n\n[(I'm in the middle)](http://m.imgur.com/0HqIkUc)\n\n\n[(Conventions with friends make me happy)](http://m.imgur.com/1RziPnW) \n\n\n[(Most recent)](http://imgur.com/7D2W2oM)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "F4F", "id": "65j7vs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "pressatoplay30", "saved": false, "mod_reports": [], "name": "t3_65j7vs", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "F4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/65j7vs/30_f4f_united_statesgeorgiasouth_carolina_nerdy/", "num_reports": null, "locked": false, "stickied": false, "created": 1492293874.0, "url": "https://www.reddit.com/r/r4r/comments/65j7vs/30_f4f_united_statesgeorgiasouth_carolina_nerdy/", "author_flair_text": null, "quarantine": false, "title": "30 [F4F] United States/Georgia/South Carolina - Nerdy lesbian seeking fellow queer dorky woman~", "created_utc": 1492265074.0, "distinguished": null, "media": null, "upvote_ratio": 0.7, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]