[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m working on a project which I hope will drastically improve the both the experience and success rate of finding someone on the internet seeking the same things you are, whatever those things may be.&lt;/p&gt;\n\n&lt;p&gt;I want to make the project well suited to everyone, and as the male and female experience here is drastically different, I&amp;#39;m hoping some ladies would help me know exactly what needs they have and what problems they face when posting personals online.&lt;/p&gt;\n\n&lt;p&gt;From me, you can expect complete professionalism and respect towards personal/private details you do not wish to share, as well as a promise that nothing you share with me will be given to anyone else. The sole purpose of this information is to build a better service. From you, I only expect 100% honesty; feel free to withhold any information you don&amp;#39;t feel comfortable giving, but please keep any information you do give truthful.&lt;/p&gt;\n\n&lt;p&gt;If you happen to be trans-gendered and/or non-hetero and believe you have a unique experience to share, feel free to contact me as well.&lt;/p&gt;\n\n&lt;p&gt;No matter who you are, if you happen to come across this post and would like to help, please up-vote to increase visibility.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm working on a project which I hope will drastically improve the both the experience and success rate of finding someone on the internet seeking the same things you are, whatever those things may be.\n\nI want to make the project well suited to everyone, and as the male and female experience here is drastically different, I'm hoping some ladies would help me know exactly what needs they have and what problems they face when posting personals online.\n\nFrom me, you can expect complete professionalism and respect towards personal/private details you do not wish to share, as well as a promise that nothing you share with me will be given to anyone else. The sole purpose of this information is to build a better service. From you, I only expect 100% honesty; feel free to withhold any information you don't feel comfortable giving, but please keep any information you do give truthful.\n\nIf you happen to be trans-gendered and/or non-hetero and believe you have a unique experience to share, feel free to contact me as well.\n\nNo matter who you are, if you happen to come across this post and would like to help, please up-vote to increase visibility.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "65lguq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "abv23", "saved": false, "mod_reports": [], "name": "t3_65lguq", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/65lguq/22m4f_interviewing_women_of_reddit_to_improve_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492319576.0, "url": "https://www.reddit.com/r/r4r/comments/65lguq/22m4f_interviewing_women_of_reddit_to_improve_the/", "author_flair_text": null, "quarantine": false, "title": "22[M4F] Interviewing women of reddit to improve the online personals experience", "created_utc": 1492290776.0, "distinguished": null, "media": null, "upvote_ratio": 0.7, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rn0e", "removal_reason": null, "link_id": "t3_65lguq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rn0e", "removal_reason": null, "link_id": "t3_65lguq", "likes": null, "replies": "", "user_reports": [], "id": "dgc1wx7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "abv23", "parent_id": "t1_dgbvwhg", "subreddit_name_prefixed": "r/r4r", "controversiality": 0, "body": "That's completely fair. Unfortunately, there's not a not a whole lot I can do to prove otherwise, though I can answer your questions to the best of my ability.\n\nGoing to be building a matchmaking website. I've been browsing various subreddits looking for partners for various things a few months, and have noticed quite a few issues with the way it works as a male. Through reading various meta/advice posts from women, it doesn't seem like the experience is any better, though it is very different. There's a massive population disparity between men and women in these subreddits. I don't believe that disparity can be addressed by me in a significant way at all; however, I also believe the way in which reddit organizes and presents posts greatly magnifies the impact of this disparity. I think that's something I can address.\n\nI'm working on it by myself. I've done web development in school and believe I know how to solve the problems I'm going to face. The one area of concern I have is security, as I do not have a ton of experience with it and it's extremely important for these types of matchmaking sites. This won't be a site marketing towards cheaters, however, Ashley Madison does come to mind. The security aspect of it may involve me hiring a consultant, or paying another company to create that aspect for me. \n\nI've been asking the same few sets of questions to everyone before asking more specific questions about their experience. Then, I'll discuss one or several features I'm planning to implement and ask how they would use it, what they think the impact will be, and if they think it will help. Generally, the questions are about what subreddits/websites they use, what are they looking for when they post, how many replies they get, how many of those replies are \"on topic,\" how they go through the process of finding replies that appeal to them, when does a post which may have been getting a lot of replies begin to dry up, how often do they get replies about old posts vs brand new ones, etc.\n\nI've been toying with doing something like this for a while, though I've begun taking it seriously for the last week or so. These are the earliest parts of this project, so everything at this stage is conceptual, which I think is the biggest mark against me. I've got a pretty strong idea of what it is I want to do, but before continuing with developing this website and sinking time and money into it, I want to confirm that what I'm planning on doing will actually be helpful for people. If it's not, I want to know who I'm failing and brainstorm how the system can be improved for them.\n\nIn the long run, I'm hoping to build the service which I want, but can't ever seem to find. These interviews allow me to confirm that other people would be interested in it as well, in addition to allowing me to tailor and refine the experience to address the problems they are currently having as well. I'm also looking to make some money from this, most likely through non-intrusive advertising, still looking into that aspect of it as well.\n\nI can't really tell you what they get out of it, you would have to ask them. To make a widely off-scale and fundamentally different comparison which may or may not be accurate, I'd say it's like reducing your carbon footprint. It makes you feel good in the moment, but really your hope is it will have a larger impact a while down the line.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s completely fair. Unfortunately, there&amp;#39;s not a not a whole lot I can do to prove otherwise, though I can answer your questions to the best of my ability.&lt;/p&gt;\n\n&lt;p&gt;Going to be building a matchmaking website. I&amp;#39;ve been browsing various subreddits looking for partners for various things a few months, and have noticed quite a few issues with the way it works as a male. Through reading various meta/advice posts from women, it doesn&amp;#39;t seem like the experience is any better, though it is very different. There&amp;#39;s a massive population disparity between men and women in these subreddits. I don&amp;#39;t believe that disparity can be addressed by me in a significant way at all; however, I also believe the way in which reddit organizes and presents posts greatly magnifies the impact of this disparity. I think that&amp;#39;s something I can address.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m working on it by myself. I&amp;#39;ve done web development in school and believe I know how to solve the problems I&amp;#39;m going to face. The one area of concern I have is security, as I do not have a ton of experience with it and it&amp;#39;s extremely important for these types of matchmaking sites. This won&amp;#39;t be a site marketing towards cheaters, however, Ashley Madison does come to mind. The security aspect of it may involve me hiring a consultant, or paying another company to create that aspect for me. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been asking the same few sets of questions to everyone before asking more specific questions about their experience. Then, I&amp;#39;ll discuss one or several features I&amp;#39;m planning to implement and ask how they would use it, what they think the impact will be, and if they think it will help. Generally, the questions are about what subreddits/websites they use, what are they looking for when they post, how many replies they get, how many of those replies are &amp;quot;on topic,&amp;quot; how they go through the process of finding replies that appeal to them, when does a post which may have been getting a lot of replies begin to dry up, how often do they get replies about old posts vs brand new ones, etc.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been toying with doing something like this for a while, though I&amp;#39;ve begun taking it seriously for the last week or so. These are the earliest parts of this project, so everything at this stage is conceptual, which I think is the biggest mark against me. I&amp;#39;ve got a pretty strong idea of what it is I want to do, but before continuing with developing this website and sinking time and money into it, I want to confirm that what I&amp;#39;m planning on doing will actually be helpful for people. If it&amp;#39;s not, I want to know who I&amp;#39;m failing and brainstorm how the system can be improved for them.&lt;/p&gt;\n\n&lt;p&gt;In the long run, I&amp;#39;m hoping to build the service which I want, but can&amp;#39;t ever seem to find. These interviews allow me to confirm that other people would be interested in it as well, in addition to allowing me to tailor and refine the experience to address the problems they are currently having as well. I&amp;#39;m also looking to make some money from this, most likely through non-intrusive advertising, still looking into that aspect of it as well.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t really tell you what they get out of it, you would have to ask them. To make a widely off-scale and fundamentally different comparison which may or may not be accurate, I&amp;#39;d say it&amp;#39;s like reducing your carbon footprint. It makes you feel good in the moment, but really your hope is it will have a larger impact a while down the line.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "r4r", "name": "t1_dgc1wx7", "score_hidden": false, "stickied": false, "created": 1492380011.0, "created_utc": 1492351211.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbvwhg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Meior", "parent_id": "t3_65lguq", "subreddit_name_prefixed": "r/r4r", "controversiality": 0, "body": "This seems incredibly fishy. \"Interviewing\"? Sounds to me like another creative way to get attention from women. \n\nHow are you doing this project? Privately, with others? What kind of questions? To what end? What do you hope to achieve? What do the people that participate get out of it? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This seems incredibly fishy. &amp;quot;Interviewing&amp;quot;? Sounds to me like another creative way to get attention from women. &lt;/p&gt;\n\n&lt;p&gt;How are you doing this project? Privately, with others? What kind of questions? To what end? What do you hope to achieve? What do the people that participate get out of it? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "r4r", "name": "t1_dgbvwhg", "score_hidden": false, "stickied": false, "created": 1492364306.0, "created_utc": 1492335506.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]