[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I&amp;#39;m looking for someone nice and sensitive I guess. We can talk through text and voice and do whatever you feel like. I&amp;#39;d like if we can talk about personal stuff sometimes but I won&amp;#39;t make you lol. I like games, I&amp;#39;ve been playing Persona 5, Rimworld and The Secret World lately. Multiplayer stuff I play tends to be survival-crafting stuff and mmos but I&amp;#39;d try anything. I&amp;#39;m interested in playing tabletop rpgs with people, let me know if you want to try that. (I&amp;#39;ve never done it actually.) I&amp;#39;m considering doing original D&amp;amp;D or Chronicles of Darkness  at the moment. I&amp;#39;m in general interested in trying roleplaying stuff but never really did anything. &lt;/p&gt;\n\n&lt;p&gt;Besides that I like learning about stuff, lately computers. I get really involved in stuff that I study and stop talking to people (and normal stuff I should be doing in general), unless they message me, so there&amp;#39;s a warning. Also, I don&amp;#39;t like talking about or sharing my appearance so I&amp;#39;m not going to give you pictures, unless we get really close I guess. I&amp;#39;d prefer for people who don&amp;#39;t care about others&amp;#39; physical appearances in general, that goes from me to you as well. I also have social anxiety and depression  btw.&lt;/p&gt;\n\n&lt;p&gt;I live in the US and I tend to stay up late. I have nothing but free time rn, but will be in college again soon.  I may not respond immediately, sorry, but I&amp;#39;ll try to quickly enough! Queer friendly and stuff :) I look forward to hearing from you!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, I'm looking for someone nice and sensitive I guess. We can talk through text and voice and do whatever you feel like. I'd like if we can talk about personal stuff sometimes but I won't make you lol. I like games, I've been playing Persona 5, Rimworld and The Secret World lately. Multiplayer stuff I play tends to be survival-crafting stuff and mmos but I'd try anything. I'm interested in playing tabletop rpgs with people, let me know if you want to try that. (I've never done it actually.) I'm considering doing original D&amp;D or Chronicles of Darkness  at the moment. I'm in general interested in trying roleplaying stuff but never really did anything. \n\nBesides that I like learning about stuff, lately computers. I get really involved in stuff that I study and stop talking to people (and normal stuff I should be doing in general), unless they message me, so there's a warning. Also, I don't like talking about or sharing my appearance so I'm not going to give you pictures, unless we get really close I guess. I'd prefer for people who don't care about others' physical appearances in general, that goes from me to you as well. I also have social anxiety and depression  btw.\n\nI live in the US and I tend to stay up late. I have nothing but free time rn, but will be in college again soon.  I may not respond immediately, sorry, but I'll try to quickly enough! Queer friendly and stuff :) I look forward to hearing from you!\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "R4R", "id": "65om8d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "GhostsAreOurFriends", "saved": false, "mod_reports": [], "name": "t3_65om8d", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "R4R", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/65om8d/20_r4r_anywhere_looking_for_a_nice_shy_person_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492369690.0, "url": "https://www.reddit.com/r/r4r/comments/65om8d/20_r4r_anywhere_looking_for_a_nice_shy_person_to/", "author_flair_text": null, "quarantine": false, "title": "20 [R4R] Anywhere- Looking For a Nice Shy Person to Talk to and Play Games Maybe", "created_utc": 1492340890.0, "distinguished": null, "media": null, "upvote_ratio": 0.8, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rn0e", "removal_reason": null, "link_id": "t3_65om8d", "likes": null, "replies": "", "user_reports": [], "id": "dgc01nd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BaccataVita", "parent_id": "t3_65om8d", "subreddit_name_prefixed": "r/r4r", "controversiality": 0, "body": "Hey, I'd like to chat if you're up for that! Just send me a PM or reply here and we can dive in. I'm 25, and I live in the south (US). I have depression too, but I have it well managed now so it's more like something I keep an eye out for. I play a lot of games, but lately I've been on my 3DS the most. I'd be down to try D&amp;D too... I've been curious about it for a long while.\n\nI also take sword-fighting classes... Which is pretty cool :P", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I&amp;#39;d like to chat if you&amp;#39;re up for that! Just send me a PM or reply here and we can dive in. I&amp;#39;m 25, and I live in the south (US). I have depression too, but I have it well managed now so it&amp;#39;s more like something I keep an eye out for. I play a lot of games, but lately I&amp;#39;ve been on my 3DS the most. I&amp;#39;d be down to try D&amp;amp;D too... I&amp;#39;ve been curious about it for a long while.&lt;/p&gt;\n\n&lt;p&gt;I also take sword-fighting classes... Which is pretty cool :P&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "r4r", "name": "t1_dgc01nd", "score_hidden": false, "stickied": false, "created": 1492376460.0, "created_utc": 1492347660.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]