[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi! Reddit, I hate to say it, but I moved to a new area about 18 months ago and it sucks. I&amp;#39;ve had a really horrible streak when it comes to dating and making new friends, and I&amp;#39;m looking for someone with a decent amount of emotional depth to restore my faith in people. I&amp;#39;m sick of dealing with the stereotypical, self-centered, early 20&amp;#39;s type of person. If you understand this sort of frustration, read on!&lt;/p&gt;\n\n&lt;p&gt;OK, about me. I&amp;#39;m a graduate student working towards my PhD in theoretical physics. I&amp;#39;m as passionate about my work as anyone has ever been about anything, and I&amp;#39;ll happily talk your ear off about it. When I&amp;#39;m not doing physics, I&amp;#39;m often off riding my bike, drinking my millionth cup of coffee for the day, watching movies (I&amp;#39;m an honest to goodness cinephile), hitting the gym/yoga when I can get myself away from work, and reading/pursuing any number of miscellaneous projects.&lt;/p&gt;\n\n&lt;p&gt;What am I looking for? Someone who I can talk to about everything, from trivial every day nonsense that makes us both laugh, to bigger things that fill me with existential dread (like the imminent nuclear apocalypse!!!). Someone who I can bitch about the state of modern film to after having a chat about whatever it is that drives them nuts. Someone who&amp;#39;s down to watch Bob Ross with me. And maybe, just maybe, someone who I can build mutual attraction with and start dating. I think the odds of finding this on reddit are near zero, but fuck it, let&amp;#39;s try. I should be clear though, I&amp;#39;m happy to just make a new friend!&lt;/p&gt;\n\n&lt;p&gt;I think the easiest way to know whether or not we&amp;#39;ll get along is for you to know the following fact about me: there&amp;#39;s nothing that upsets me more than the idea that we should all lower our expectations until we&amp;#39;re happy with ourselves. I understand that we shouldn&amp;#39;t make our happiness conditional on achieving some outrageous success. But I think my defining quality is my commitment to not doing anything half-assed: whether it&amp;#39;s my work or my hobbies, I try to be second-to-none in all of my efforts. I find that people who understand the practice of refining their skill in some discipline - whether it&amp;#39;s a trade, art, science, performance, etc. - are people who I generally get along with. So I hope you&amp;#39;re serious about something, since it should give us a place to understand each other from the get-go.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m happy to exchange pictures if you&amp;#39;re interested (I&amp;#39;m told I&amp;#39;m pretty cute!), and I&amp;#39;m excited to hear from you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi! Reddit, I hate to say it, but I moved to a new area about 18 months ago and it sucks. I've had a really horrible streak when it comes to dating and making new friends, and I'm looking for someone with a decent amount of emotional depth to restore my faith in people. I'm sick of dealing with the stereotypical, self-centered, early 20's type of person. If you understand this sort of frustration, read on!\n\nOK, about me. I'm a graduate student working towards my PhD in theoretical physics. I'm as passionate about my work as anyone has ever been about anything, and I'll happily talk your ear off about it. When I'm not doing physics, I'm often off riding my bike, drinking my millionth cup of coffee for the day, watching movies (I'm an honest to goodness cinephile), hitting the gym/yoga when I can get myself away from work, and reading/pursuing any number of miscellaneous projects.\n\nWhat am I looking for? Someone who I can talk to about everything, from trivial every day nonsense that makes us both laugh, to bigger things that fill me with existential dread (like the imminent nuclear apocalypse!!!). Someone who I can bitch about the state of modern film to after having a chat about whatever it is that drives them nuts. Someone who's down to watch Bob Ross with me. And maybe, just maybe, someone who I can build mutual attraction with and start dating. I think the odds of finding this on reddit are near zero, but fuck it, let's try. I should be clear though, I'm happy to just make a new friend!\n\nI think the easiest way to know whether or not we'll get along is for you to know the following fact about me: there's nothing that upsets me more than the idea that we should all lower our expectations until we're happy with ourselves. I understand that we shouldn't make our happiness conditional on achieving some outrageous success. But I think my defining quality is my commitment to not doing anything half-assed: whether it's my work or my hobbies, I try to be second-to-none in all of my efforts. I find that people who understand the practice of refining their skill in some discipline - whether it's a trade, art, science, performance, etc. - are people who I generally get along with. So I hope you're serious about something, since it should give us a place to understand each other from the get-go.\n\nI'm happy to exchange pictures if you're interested (I'm told I'm pretty cute!), and I'm excited to hear from you.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "65rnpe", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "justathrowaway137", "saved": false, "mod_reports": [], "name": "t3_65rnpe", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/65rnpe/24_m4f_anywhere_can_we_raise_our_standards_please/", "num_reports": null, "locked": false, "stickied": false, "created": 1492408417.0, "url": "https://www.reddit.com/r/r4r/comments/65rnpe/24_m4f_anywhere_can_we_raise_our_standards_please/", "author_flair_text": null, "quarantine": false, "title": "24 [M4F] - Anywhere - Can we raise our standards please?", "created_utc": 1492379617.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]