[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So right now I&amp;#39;m at a non-profit temp role where it will either end May 1 or be extended. I had graduated college 2 years ago. I don&amp;#39;t really like the job. It&amp;#39;s tedious and a lot more office work than I had anticipated. I may be extended but it depends on if there will be enough work for me to do. Someone on our team went on maternity leave, so that&amp;#39;s why they hired me for a 6 month role, but she&amp;#39;s back so I should know in the next two weeks. It just makes me nervous. Not that I won&amp;#39;t be extended. That&amp;#39;s a little beyond my control. &lt;/p&gt;\n\n&lt;p&gt;My worry is, what is next? It&amp;#39;s something that has plagued me for years, my whole life. I remember on vacations I would always ask my parents &amp;quot;What are we doing next?&amp;quot; or &amp;quot;What are we doing for dinner tonight?&amp;quot; I obviously don&amp;#39;t find joy in my current work but I&amp;#39;m the kind of person who just doesn&amp;#39;t have jobable (that&amp;#39;s a word right?) passions. &lt;/p&gt;\n\n&lt;p&gt;I really enjoy tennis and chess. Really big hobbies, I put hours into those (well a couple hours a week for tennis and way more for chess). So I&amp;#39;m looking to see if I can make a career out of something of those. It&amp;#39;s tough though, since I&amp;#39;m not a professional athlete or a grandmaster. Although, I have a phone interview lined up for a full-time chess teacher position at a charter school so that might be promising. &lt;/p&gt;\n\n&lt;p&gt;But then I think about my life in general. Will I, like other millenials, just bounce from job to job, 6 months here a year there?  I think a burning question that I have is will I ever find a job that I actually enjoy? &lt;/p&gt;\n\n&lt;p&gt;My goal is to just save a lot of money so I can travel a lot. If finding a woman / buying a house / having a family happens, great. If it doesn&amp;#39;t happen, well then I&amp;#39;ll have a lot more money and freedom.  Besides, in today&amp;#39;s society we&amp;#39;re always connected with our friends. At least I have close friends who I will be friends with for life. &lt;/p&gt;\n\n&lt;p&gt;So, if you are having a similar experience then hit me up on here or on kik. My username is the same as this account (also my picture is there, bonus!). Also if you&amp;#39;re just looking for someone to chat in general / to talk about your problems then I&amp;#39;m your guy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So right now I'm at a non-profit temp role where it will either end May 1 or be extended. I had graduated college 2 years ago. I don't really like the job. It's tedious and a lot more office work than I had anticipated. I may be extended but it depends on if there will be enough work for me to do. Someone on our team went on maternity leave, so that's why they hired me for a 6 month role, but she's back so I should know in the next two weeks. It just makes me nervous. Not that I won't be extended. That's a little beyond my control. \n\nMy worry is, what is next? It's something that has plagued me for years, my whole life. I remember on vacations I would always ask my parents \"What are we doing next?\" or \"What are we doing for dinner tonight?\" I obviously don't find joy in my current work but I'm the kind of person who just doesn't have jobable (that's a word right?) passions. \n\nI really enjoy tennis and chess. Really big hobbies, I put hours into those (well a couple hours a week for tennis and way more for chess). So I'm looking to see if I can make a career out of something of those. It's tough though, since I'm not a professional athlete or a grandmaster. Although, I have a phone interview lined up for a full-time chess teacher position at a charter school so that might be promising. \n\nBut then I think about my life in general. Will I, like other millenials, just bounce from job to job, 6 months here a year there?  I think a burning question that I have is will I ever find a job that I actually enjoy? \n\nMy goal is to just save a lot of money so I can travel a lot. If finding a woman / buying a house / having a family happens, great. If it doesn't happen, well then I'll have a lot more money and freedom.  Besides, in today's society we're always connected with our friends. At least I have close friends who I will be friends with for life. \n\nSo, if you are having a similar experience then hit me up on here or on kik. My username is the same as this account (also my picture is there, bonus!). Also if you're just looking for someone to chat in general / to talk about your problems then I'm your guy.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "65tc9l", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "niickgeo", "saved": false, "mod_reports": [], "name": "t3_65tc9l", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/65tc9l/24_m4f_chicago_uncertain_future/", "num_reports": null, "locked": false, "stickied": false, "created": 1492429377.0, "url": "https://www.reddit.com/r/r4r/comments/65tc9l/24_m4f_chicago_uncertain_future/", "author_flair_text": null, "quarantine": false, "title": "24 [M4F] Chicago - Uncertain Future", "created_utc": 1492400577.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]