[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;♫ Wouldn&amp;#39;t it be nice to live together in the kind of world we belong? ♫ Oh Hi I didn&amp;#39;t notice you there. Haha I tend to get into my own worlds when I find a good song and start singing :D&lt;/p&gt;\n\n&lt;p&gt;Ok so. Who am I? I am just a guy from Finland. What do I do? Like generally? I do computer stuff, games, little bit of coding here and there. I actually study computer sciences too. Though I like to hang with buddies too! Also TV-shows and occasional random anime here and there too. Comedies are my weak spot.&lt;/p&gt;\n\n&lt;p&gt;What am I looking for? Something else. Even though I have friends I am missing that special someone from my life. Ok I know that it&amp;#39;s a 1 in a million you find it here but be my million then ;) &amp;lt;- Seee? I am great at lame pickup jokes. Considering this I can say that friends are ok too. Like jumping into something more straight is stupid. Having fun as friends is important too!&lt;/p&gt;\n\n&lt;p&gt;What else what else.... Hmm. What do I want from you? Just be honest and don&amp;#39;t disappear. I really miss you if you do T-T I get attached to people waaaay too quickly. Though I can be a bit heartless at times too. So just be yourself, smile (not enforced but preferred) and just come talk to me and let me make you laugh. Though I will probably fail at that in the beginning but I&amp;#39;ll get the hang of it!&lt;/p&gt;\n\n&lt;p&gt;This is a weird long post so here&amp;#39;s a tl;dr: Send me a message and let&amp;#39;s get to know each other. And for the first message as I myself too know it&amp;#39;s the hardest. If you come up with nothing make your lamest, most awful joke you can imagine, or the one that just pops into your head. I appreciate bad humor! :D&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "\n♫ Wouldn't it be nice to live together in the kind of world we belong? ♫ Oh Hi I didn't notice you there. Haha I tend to get into my own worlds when I find a good song and start singing :D\n\nOk so. Who am I? I am just a guy from Finland. What do I do? Like generally? I do computer stuff, games, little bit of coding here and there. I actually study computer sciences too. Though I like to hang with buddies too! Also TV-shows and occasional random anime here and there too. Comedies are my weak spot.\n\nWhat am I looking for? Something else. Even though I have friends I am missing that special someone from my life. Ok I know that it's a 1 in a million you find it here but be my million then ;) &lt;- Seee? I am great at lame pickup jokes. Considering this I can say that friends are ok too. Like jumping into something more straight is stupid. Having fun as friends is important too!\n\nWhat else what else.... Hmm. What do I want from you? Just be honest and don't disappear. I really miss you if you do T-T I get attached to people waaaay too quickly. Though I can be a bit heartless at times too. So just be yourself, smile (not enforced but preferred) and just come talk to me and let me make you laugh. Though I will probably fail at that in the beginning but I'll get the hang of it!\n\nThis is a weird long post so here's a tl;dr: Send me a message and let's get to know each other. And for the first message as I myself too know it's the hardest. If you come up with nothing make your lamest, most awful joke you can imagine, or the one that just pops into your head. I appreciate bad humor! :D", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "65u084", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "Shireato", "saved": false, "mod_reports": [], "name": "t3_65u084", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/65u084/20_m4f_northern_europe_video_games_tv_quotes/", "num_reports": null, "locked": false, "stickied": false, "created": 1492439539.0, "url": "https://www.reddit.com/r/r4r/comments/65u084/20_m4f_northern_europe_video_games_tv_quotes/", "author_flair_text": null, "quarantine": false, "title": "20 [M4F] - Northern Europe - Video Games, Tv Quotes, weird conversation and everything between", "created_utc": 1492410739.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]