[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After this week-end, where I was supposed to go to a heroic fantasy convention but ended up not going because the friend I was supposed to go with got sick, I had a epiphany: I REALLY need new people in my life so that I don&amp;#39;t end up bored alone, and so that my colleagues from the future don&amp;#39;t see on my gravestone &amp;quot;He was that guy who proved you could die out of boredom&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Anyway, let&amp;#39;s introduce myself so I can convince you I&amp;#39;d be one hell of a friend/boyfriend/other-thing-with-friend-in-it: I&amp;#39;m a 26 year-old guy, who just wants to finally find a job as an Archaeologist but will settle down for a scholarship and a PhD project. I&amp;#39;m a bit of a geek, despite not knowing half the references there are out there, but what I lack in knowledge, I compensate in enthusiasm and bad puns. Lots of bad puns. I speak French and English, and there was a time in my life where I could speak Dutch too (well, kinda). I love playing videogames on my toaster, watch soccer or wrestling (which is my guilty pleasure: you watch soap operas or reality TV, I watch men pretending to fight while wearing shiny underwears). I become evil everytime someone is crazy enough to tell me &amp;quot;Hey, wanna play Munchkin ?&amp;quot;. I read (mostly Stephen King, and horror/fantasy in general, and I&amp;#39;ll start Tom Clancy soon) and my musical taste goes from Dropkick Murphys to BB King and anything in between.&lt;/p&gt;\n\n&lt;p&gt;Those are the things I do when I&amp;#39;m all alone (and not an exhaustive list either), but our friendship doesn&amp;#39;t have to rely on those only. I would definitely enjoy going to the movies, museums, expos or just wander around with people. Basically, as long as it doesn&amp;#39;t involve getting drunk and/or dancing and is legal (somewhat), I can be interested.&lt;/p&gt;\n\n&lt;p&gt;So, yeah, just message me and we&amp;#39;ll see where it goes !&lt;/p&gt;\n\n&lt;p&gt;(PS: Yes, I&amp;#39;m terrible at writing those kind of posts, sue me ! Or teach me. Or I don&amp;#39;t know, just do something instead of judging: my personal preference would be to see you fight dragons with a broad axe while jumping out of a plane to manifest your disapproval with the way I wrote this, but hey, who am I to judge ?)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "After this week-end, where I was supposed to go to a heroic fantasy convention but ended up not going because the friend I was supposed to go with got sick, I had a epiphany: I REALLY need new people in my life so that I don't end up bored alone, and so that my colleagues from the future don't see on my gravestone \"He was that guy who proved you could die out of boredom\".\n\nAnyway, let's introduce myself so I can convince you I'd be one hell of a friend/boyfriend/other-thing-with-friend-in-it: I'm a 26 year-old guy, who just wants to finally find a job as an Archaeologist but will settle down for a scholarship and a PhD project. I'm a bit of a geek, despite not knowing half the references there are out there, but what I lack in knowledge, I compensate in enthusiasm and bad puns. Lots of bad puns. I speak French and English, and there was a time in my life where I could speak Dutch too (well, kinda). I love playing videogames on my toaster, watch soccer or wrestling (which is my guilty pleasure: you watch soap operas or reality TV, I watch men pretending to fight while wearing shiny underwears). I become evil everytime someone is crazy enough to tell me \"Hey, wanna play Munchkin ?\". I read (mostly Stephen King, and horror/fantasy in general, and I'll start Tom Clancy soon) and my musical taste goes from Dropkick Murphys to BB King and anything in between.\n\nThose are the things I do when I'm all alone (and not an exhaustive list either), but our friendship doesn't have to rely on those only. I would definitely enjoy going to the movies, museums, expos or just wander around with people. Basically, as long as it doesn't involve getting drunk and/or dancing and is legal (somewhat), I can be interested.\n\nSo, yeah, just message me and we'll see where it goes !\n\n(PS: Yes, I'm terrible at writing those kind of posts, sue me ! Or teach me. Or I don't know, just do something instead of judging: my personal preference would be to see you fight dragons with a broad axe while jumping out of a plane to manifest your disapproval with the way I wrote this, but hey, who am I to judge ?)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4R", "id": "65ukmq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "ArcheoOutOfNowhere", "saved": false, "mod_reports": [], "name": "t3_65ukmq", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4R", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/65ukmq/26_m4r_monsbelgiumanywhere_life_where_finding/", "num_reports": null, "locked": false, "stickied": false, "created": 1492450269.0, "url": "https://www.reddit.com/r/r4r/comments/65ukmq/26_m4r_monsbelgiumanywhere_life_where_finding/", "author_flair_text": null, "quarantine": false, "title": "26 [M4R] Mons/Belgium/Anywhere - Life, where finding Prehistoric arrowhead is easier than finding people to hang out with", "created_utc": 1492421469.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rn0e", "removal_reason": null, "link_id": "t3_65ukmq", "likes": null, "replies": "", "user_reports": [], "id": "dge9cgk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sunflowerfield1", "parent_id": "t3_65ukmq", "subreddit_name_prefixed": "r/r4r", "controversiality": 0, "body": "How do you play video games on your toaster?! lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How do you play video games on your toaster?! lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "r4r", "name": "t1_dge9cgk", "score_hidden": false, "stickied": false, "created": 1492498097.0, "created_utc": 1492469297.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]