[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recently someone suggested describing what might be the ideal sort of person I&amp;#39;m looking for and seeing how people respond. So I figured I would give it a try and see how it goes. Keep in mind, I&amp;#39;d love to see all of this in someone, but people are people, and I&amp;#39;m pretty realistic and humble with expectations. But here we go...&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d love someone that is a really good communicator. Someone that can hold a conversation, is open and honest about how they feel and what they think, and is genuinely interested in what others have to say as well. They&amp;#39;d also be a really affectionate person. Physically (&lt;em&gt;Quagmire giggity&lt;/em&gt;) and with words and actions. Spending time together regularly and for long periods would be a priority so that connecting on an emotional level could happen naturally. But they&amp;#39;d be independent; Motivated in their own life, with goals, and work to do. Whether that be schooling, a career, a passion, or all of the above. This would mean they&amp;#39;d have a passion for learning and have a realistic and informed, but empathetic and open minded, outlook on the world. To round it all off, they&amp;#39;d be clean person. In hygiene, in living space, and in body. Not in a humble brag hipster fashion, but understanding healthy limits, but still with an appetite for fun.&lt;/p&gt;\n\n&lt;p&gt;Now by this point you&amp;#39;re probably wondering if I can reciprocate on any of this. It sounds like a tall order right? But honestly, I can. I&amp;#39;ve lived a little, and learned a lot. Like I said before, I&amp;#39;m a pretty realistic person. Nobody is perfect, but you can already probably tell that I can handle communication, and while I haven&amp;#39;t mastered every other aspect, I do pretty well with them. I do have a career that is a big part of my life, and it keeps me really busy. But outside of that I&amp;#39;m a pretty nerdy guy with a love for technology and storytelling. I enjoy stories in science fiction and fantasy, but I also love a good historical fiction, drama, or period piece as well. I read pretty regularly, but I also play some video games on PC in my spare time. Musically I&amp;#39;m sort of eclectic, but I love some good old dad rock all the way up to 90&amp;#39;s alternative. I&amp;#39;ve also developed a taste for classical, especially movie and game soundtracks, and a love for trance and synthwave. I also love my car. It&amp;#39;s fast and it&amp;#39;s my baby. While I may not be an expert in the areas that I have interest or passions, I can definitely say I have diverse tastes, and I&amp;#39;m always interested in learning more about new things.&lt;/p&gt;\n\n&lt;p&gt;Well this has gone on long enough, and if you&amp;#39;ve made it this far, I thank you and commend you. I&amp;#39;ll also remind you to not let any of it intimidate you. I&amp;#39;m not perfect, and I don&amp;#39;t expect perfection from anyone else. (We all can&amp;#39;t be Seven of Nine, lol.) I also don&amp;#39;t expect someone to match what I&amp;#39;ve said perfectly either. So with that in mind, if any of this resonated with you, shoot me a message. I&amp;#39;d love to hear from you. Thanks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Recently someone suggested describing what might be the ideal sort of person I'm looking for and seeing how people respond. So I figured I would give it a try and see how it goes. Keep in mind, I'd love to see all of this in someone, but people are people, and I'm pretty realistic and humble with expectations. But here we go...\n\nI'd love someone that is a really good communicator. Someone that can hold a conversation, is open and honest about how they feel and what they think, and is genuinely interested in what others have to say as well. They'd also be a really affectionate person. Physically (*Quagmire giggity*) and with words and actions. Spending time together regularly and for long periods would be a priority so that connecting on an emotional level could happen naturally. But they'd be independent; Motivated in their own life, with goals, and work to do. Whether that be schooling, a career, a passion, or all of the above. This would mean they'd have a passion for learning and have a realistic and informed, but empathetic and open minded, outlook on the world. To round it all off, they'd be clean person. In hygiene, in living space, and in body. Not in a humble brag hipster fashion, but understanding healthy limits, but still with an appetite for fun.\n\nNow by this point you're probably wondering if I can reciprocate on any of this. It sounds like a tall order right? But honestly, I can. I've lived a little, and learned a lot. Like I said before, I'm a pretty realistic person. Nobody is perfect, but you can already probably tell that I can handle communication, and while I haven't mastered every other aspect, I do pretty well with them. I do have a career that is a big part of my life, and it keeps me really busy. But outside of that I'm a pretty nerdy guy with a love for technology and storytelling. I enjoy stories in science fiction and fantasy, but I also love a good historical fiction, drama, or period piece as well. I read pretty regularly, but I also play some video games on PC in my spare time. Musically I'm sort of eclectic, but I love some good old dad rock all the way up to 90's alternative. I've also developed a taste for classical, especially movie and game soundtracks, and a love for trance and synthwave. I also love my car. It's fast and it's my baby. While I may not be an expert in the areas that I have interest or passions, I can definitely say I have diverse tastes, and I'm always interested in learning more about new things.\n\nWell this has gone on long enough, and if you've made it this far, I thank you and commend you. I'll also remind you to not let any of it intimidate you. I'm not perfect, and I don't expect perfection from anyone else. (We all can't be Seven of Nine, lol.) I also don't expect someone to match what I've said perfectly either. So with that in mind, if any of this resonated with you, shoot me a message. I'd love to hear from you. Thanks.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "65vd03", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "Morachnus", "saved": false, "mod_reports": [], "name": "t3_65vd03", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/65vd03/27_m4f_portland_metro_or_looking_for_love_but/", "num_reports": null, "locked": false, "stickied": false, "created": 1492462376.0, "url": "https://www.reddit.com/r/r4r/comments/65vd03/27_m4f_portland_metro_or_looking_for_love_but/", "author_flair_text": null, "quarantine": false, "title": "27 [M4F] Portland Metro (OR) - Looking for love, but trying a different approach.", "created_utc": 1492433576.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]