[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;26 Male from Tennessee. I spend my days trapped behind my desk working on policies(I&amp;#39;m an insurance agent), checking emails, and making phone calls. It can get quite repetitive and boring. That&amp;#39;s where you come in! I&amp;#39;m looking for a lady friend that may want to spend some time chatting about anything and everything, clean and not so much... What aggravates you, what excites you, whats your pet peeves? You get the gist... About me: 5&amp;#39;10&amp;quot; brown hair brown eyes, average build with glasses. A bit on the nerdy side, computers/technology is my hobby. Documentaries are the best. Mystery/crime shows are my favorite. Pizza is my weekness. I love spending time in the woods hunting. I keep myself in shape. I can hold a conversation and my typing skills are on point. I have a sense of humor, I hope you do too. I&amp;#39;ve been told I&amp;#39;m quite attractive but to each their own, that would be for you to decide. If you are looking for someone to kill some time with and chat about the world feel free to message me, looking forward to it! I have snapchat, kik, text, and of course reddit if that&amp;#39;s your preference.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "26 Male from Tennessee. I spend my days trapped behind my desk working on policies(I'm an insurance agent), checking emails, and making phone calls. It can get quite repetitive and boring. That's where you come in! I'm looking for a lady friend that may want to spend some time chatting about anything and everything, clean and not so much... What aggravates you, what excites you, whats your pet peeves? You get the gist... About me: 5'10\" brown hair brown eyes, average build with glasses. A bit on the nerdy side, computers/technology is my hobby. Documentaries are the best. Mystery/crime shows are my favorite. Pizza is my weekness. I love spending time in the woods hunting. I keep myself in shape. I can hold a conversation and my typing skills are on point. I have a sense of humor, I hope you do too. I've been told I'm quite attractive but to each their own, that would be for you to decide. If you are looking for someone to kill some time with and chat about the world feel free to message me, looking forward to it! I have snapchat, kik, text, and of course reddit if that's your preference.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "65vgn8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "h33byj33by", "saved": false, "mod_reports": [], "name": "t3_65vgn8", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/65vgn8/26m4f_looking_to_chat_on_the_daily_breaking_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492463604.0, "url": "https://www.reddit.com/r/r4r/comments/65vgn8/26m4f_looking_to_chat_on_the_daily_breaking_the/", "author_flair_text": null, "quarantine": false, "title": "26[M4F] Looking to chat on the daily, breaking the wheel of monotony!", "created_utc": 1492434804.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]