[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "r4r", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;When you start to notice more and more grey hairs. I thought I had it good because I have a great head of hair (Sorry to the half of my friends already balding), but is it really time to embrace the Salt and Pepper look? &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When your instagram and facebook becomes flooded with baby pictures. It&amp;#39;s hard enough to keep up with all the last names changing, but damn I better be prepared for changing diapers and baby drool.  It was especially true yesterday on Easter... holy baby overload.  Don&amp;#39;t worry, I still want to have children.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you put money aside for things like remodeling your kitchen and bathroom. Never thought I would get excited to go to Home Depot... but yep it&amp;#39;s happened.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you realize you&amp;#39;ve already had your 10 year high school reunion and the 15 year high school reunion is on deck. At least I still won the award for... well you&amp;#39;ll have to message me to find out.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When mom and dad call and say we only have a birthday card for you this year.  Sigh... now I&amp;#39;m really adulting.  I better not break my phone because I&amp;#39;m still on the family plan (for now).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you&amp;#39;ve started to drink coffee without cream and sugar and like it. Now I really feel old.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you trade in cheap beer and mixed drinks for wine memberships and expensive scotch and whiskey.  I learned how to make a bomb Old Fashioned.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you refuse to embrace sna*chat. Sorry, I just feel too old for it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you start seeing more green (and healthy) food on your plate.  Yes, I&amp;#39;m talking to you Mr. Kale.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you are too lazy to go to the market or to pick up food and you are happy to pay for Postmates, Ubereats, Blue Apron, Sunbasket, Etc.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you feel like a failure if you aren&amp;#39;t growing professionally. Luckily I don&amp;#39;t feel this way, but I do use it as motivation since I opted not to go to graduate school.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you take a shower at the gym. I never did before (I really just like being sweaty...KIDDING), but that&amp;#39;s because I had more free time than I do now. I hated the idea of working out in the morning before work (I&amp;#39;m not a morning person), but you gotta do what you gotta do.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you no longer get carded on a regular basis.  This one bothers me a lot because everyone still thinks I look younger than I am, so why don&amp;#39;t I get carded anymore?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you barely make it to midnight on New Years Eve. First time that&amp;#39;s happened... sigh. I&amp;#39;m still fun (I Promise) and I&amp;#39;m normally a night owl.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When you&amp;#39;ve reverted back from texting friends to calling friends. We&amp;#39;ve come full circle.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Being 31 is awesome in many ways.... except for the fact you&amp;#39;re no longer 30. However, you learn more about yourself, you find an independence, you get to create your own canvas, and I guess I want to see what&amp;#39;s out there to see if anyone wants to help fill my canvas with me. If any of the above registers with you, I&amp;#39;d love to hear from you. Could just be friendly banter, could be more :)... but let&amp;#39;s find out together.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "- When you start to notice more and more grey hairs. I thought I had it good because I have a great head of hair (Sorry to the half of my friends already balding), but is it really time to embrace the Salt and Pepper look? \n\n- When your instagram and facebook becomes flooded with baby pictures. It's hard enough to keep up with all the last names changing, but damn I better be prepared for changing diapers and baby drool.  It was especially true yesterday on Easter... holy baby overload.  Don't worry, I still want to have children.\n\n- When you put money aside for things like remodeling your kitchen and bathroom. Never thought I would get excited to go to Home Depot... but yep it's happened.\n\n- When you realize you've already had your 10 year high school reunion and the 15 year high school reunion is on deck. At least I still won the award for... well you'll have to message me to find out.\n\n- When mom and dad call and say we only have a birthday card for you this year.  Sigh... now I'm really adulting.  I better not break my phone because I'm still on the family plan (for now).\n\n- When you've started to drink coffee without cream and sugar and like it. Now I really feel old.\n\n- When you trade in cheap beer and mixed drinks for wine memberships and expensive scotch and whiskey.  I learned how to make a bomb Old Fashioned.\n\n- When you refuse to embrace sna*chat. Sorry, I just feel too old for it.\n\n- When you start seeing more green (and healthy) food on your plate.  Yes, I'm talking to you Mr. Kale.\n\n- When you are too lazy to go to the market or to pick up food and you are happy to pay for Postmates, Ubereats, Blue Apron, Sunbasket, Etc.\n\n- When you feel like a failure if you aren't growing professionally. Luckily I don't feel this way, but I do use it as motivation since I opted not to go to graduate school.\n\n- When you take a shower at the gym. I never did before (I really just like being sweaty...KIDDING), but that's because I had more free time than I do now. I hated the idea of working out in the morning before work (I'm not a morning person), but you gotta do what you gotta do.\n\n- When you no longer get carded on a regular basis.  This one bothers me a lot because everyone still thinks I look younger than I am, so why don't I get carded anymore?\n\n- When you barely make it to midnight on New Years Eve. First time that's happened... sigh. I'm still fun (I Promise) and I'm normally a night owl.\n\n- When you've reverted back from texting friends to calling friends. We've come full circle.\n\nBeing 31 is awesome in many ways.... except for the fact you're no longer 30. However, you learn more about yourself, you find an independence, you get to create your own canvas, and I guess I want to see what's out there to see if anyone wants to help fill my canvas with me. If any of the above registers with you, I'd love to hear from you. Could just be friendly banter, could be more :)... but let's find out together.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M4F", "id": "65x47q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "cali_charmer", "saved": false, "mod_reports": [], "name": "t3_65x47q", "subreddit_name_prefixed": "r/r4r", "approved_by": null, "over_18": false, "domain": "self.r4r", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rn0e", "edited": false, "link_flair_css_class": "M4F", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/r4r/comments/65x47q/31_m4f_usa_today_is_my_31st_birthdayyou_know/", "num_reports": null, "locked": false, "stickied": false, "created": 1492480146.0, "url": "https://www.reddit.com/r/r4r/comments/65x47q/31_m4f_usa_today_is_my_31st_birthdayyou_know/", "author_flair_text": null, "quarantine": false, "title": "31 [M4F] USA - Today is my 31st Birthday...You know you're officially no longer 30 WHEN:", "created_utc": 1492451346.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rn0e", "removal_reason": null, "link_id": "t3_65x47q", "likes": null, "replies": "", "user_reports": [], "id": "dgenu0j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bambibaby041", "parent_id": "t3_65x47q", "subreddit_name_prefixed": "r/r4r", "controversiality": 0, "body": "Happy birthday! Hope it's your best one yet. What award did you win at the reunion?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Happy birthday! Hope it&amp;#39;s your best one yet. What award did you win at the reunion?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "r4r", "name": "t1_dgenu0j", "score_hidden": true, "stickied": false, "created": 1492516467.0, "created_utc": 1492487667.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]