[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Nootropics", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This question was previously asked, but I didn&amp;#39;t find a complete answer.\nI know that dependence on tobacco is very strong. But there are a lot of substances in the cigarette besides nicotine. Many times I met the assumption that the dependence is so strong because of other substances. Nicotine patches and nicotine gum also cause strong dependence or not?&lt;/p&gt;\n\n&lt;p&gt;For myself, I noticed that pure nicotine gives a lot of energy and treat my adhd. There are many studies and discussions about this. Many use it for the treatment of ADHD, narcolepsy, drowsiness.\nI saw a study where it was said that nicotine patches act like ritalin. Also read, many used patches for several years and do not have dependence.&lt;/p&gt;\n\n&lt;p&gt;What is known at the moment?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This question was previously asked, but I didn't find a complete answer.\nI know that dependence on tobacco is very strong. But there are a lot of substances in the cigarette besides nicotine. Many times I met the assumption that the dependence is so strong because of other substances. Nicotine patches and nicotine gum also cause strong dependence or not?\n\nFor myself, I noticed that pure nicotine gives a lot of energy and treat my adhd. There are many studies and discussions about this. Many use it for the treatment of ADHD, narcolepsy, drowsiness.\nI saw a study where it was said that nicotine patches act like ritalin. Also read, many used patches for several years and do not have dependence.\n\nWhat is known at the moment?\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65w12j", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "ansi-l", "saved": false, "mod_reports": [], "name": "t3_65w12j", "subreddit_name_prefixed": "r/Nootropics", "approved_by": null, "over_18": false, "domain": "self.Nootropics", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r81c", "edited": 1492441604.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Nootropics/comments/65w12j/pure_nicotine_not_tobacco_addictive_and_withdrawal/", "num_reports": null, "locked": false, "stickied": false, "created": 1492469836.0, "url": "https://www.reddit.com/r/Nootropics/comments/65w12j/pure_nicotine_not_tobacco_addictive_and_withdrawal/", "author_flair_text": null, "quarantine": false, "title": "Pure nicotine (not tobacco) addictive and withdrawal", "created_utc": 1492441036.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": "", "user_reports": [], "id": "dgdxmfc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ufojoe", "parent_id": "t1_dgdtw9q", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "&gt;Some people will have headaches, feel down, or tired; others will become so crippled that they can't get out of bed or get through the day without it. In either case, it's still addiction\n\nThat's not the type of addiction people are asking about in regards to nicotine. That's caffeine level addiction. And I would agree that nicotine gum is very similar to caffeine in terms of what side effects and addiction you can expect.\n\n&gt; I could be completely wrong about that survey, but I absolutely stand by the statement of nicotine being highly addictive because there are numerous medical studies to show exactly that. \n\nYea I think you are completely wrong in this case. The survey gave people different options to tell how addicted they were:\n\nEither:\n\n* I had no problems \n* I developed tolerance\n* I was addicted and it was a minor problem\n* I was addicted and it was a major problem\n\nand the survey compared different types of nicotine use. If there were under reporting of addiction, you'd expect to see it across all types of nicotine products:\n\n7% of nicotine gum users reported some level of addiction compared to 65% of cigarette smokers. Where is this under reporting with cigarette smokers?\n\nNicotine is not the same thing as tobacco. Tobacco, is inhaled, contains MAOIs and other psychoactive chemicals that make nicotine more addictive. The fact that cigarettes are much more addictive is pretty clearly confirmed by the survey. For every person that used nicotine gum exclusively and got very addicted there are 92 who didn't have any issues besides tolerance. Calling that highly addictive is very inaccurate. \n\nIt is possible that some minority of people will find any nicotine product highly addictive and there should always be that warning out there. I wouldn't recommend people using fast acting nicotine, or nicotine with other drugs that might potentiate its addictive qualities. But when you take slow acting nicotine, like nicotine gum or a nicotine patch, addiction (at least the type people are interested in) is not a concern for the vast majority of people.\n\nAlso check out gwern's write up for anyone who hasn't already - https://www.gwern.net/Nicotine#dependence\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Some people will have headaches, feel down, or tired; others will become so crippled that they can&amp;#39;t get out of bed or get through the day without it. In either case, it&amp;#39;s still addiction&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not the type of addiction people are asking about in regards to nicotine. That&amp;#39;s caffeine level addiction. And I would agree that nicotine gum is very similar to caffeine in terms of what side effects and addiction you can expect.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I could be completely wrong about that survey, but I absolutely stand by the statement of nicotine being highly addictive because there are numerous medical studies to show exactly that. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yea I think you are completely wrong in this case. The survey gave people different options to tell how addicted they were:&lt;/p&gt;\n\n&lt;p&gt;Either:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;I had no problems &lt;/li&gt;\n&lt;li&gt;I developed tolerance&lt;/li&gt;\n&lt;li&gt;I was addicted and it was a minor problem&lt;/li&gt;\n&lt;li&gt;I was addicted and it was a major problem&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;and the survey compared different types of nicotine use. If there were under reporting of addiction, you&amp;#39;d expect to see it across all types of nicotine products:&lt;/p&gt;\n\n&lt;p&gt;7% of nicotine gum users reported some level of addiction compared to 65% of cigarette smokers. Where is this under reporting with cigarette smokers?&lt;/p&gt;\n\n&lt;p&gt;Nicotine is not the same thing as tobacco. Tobacco, is inhaled, contains MAOIs and other psychoactive chemicals that make nicotine more addictive. The fact that cigarettes are much more addictive is pretty clearly confirmed by the survey. For every person that used nicotine gum exclusively and got very addicted there are 92 who didn&amp;#39;t have any issues besides tolerance. Calling that highly addictive is very inaccurate. &lt;/p&gt;\n\n&lt;p&gt;It is possible that some minority of people will find any nicotine product highly addictive and there should always be that warning out there. I wouldn&amp;#39;t recommend people using fast acting nicotine, or nicotine with other drugs that might potentiate its addictive qualities. But when you take slow acting nicotine, like nicotine gum or a nicotine patch, addiction (at least the type people are interested in) is not a concern for the vast majority of people.&lt;/p&gt;\n\n&lt;p&gt;Also check out gwern&amp;#39;s write up for anyone who hasn&amp;#39;t already - &lt;a href=\"https://www.gwern.net/Nicotine#dependence\"&gt;https://www.gwern.net/Nicotine#dependence&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdxmfc", "score_hidden": false, "stickied": false, "created": 1492484283.0, "created_utc": 1492455483.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": "", "user_reports": [], "id": "dge199i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TwinIam", "parent_id": "t1_dgdtw9q", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "&gt; nicotine being highly addictive because there are numerous medical studies to show exactly that.\n\nI think that's what the OP is trying to clarify.  There are a ton of studies demonstrating that *tobacco* is highly addictive, but no evidence to suggest that pure nicotine is nearly as habit-forming.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;nicotine being highly addictive because there are numerous medical studies to show exactly that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think that&amp;#39;s what the OP is trying to clarify.  There are a ton of studies demonstrating that &lt;em&gt;tobacco&lt;/em&gt; is highly addictive, but no evidence to suggest that pure nicotine is nearly as habit-forming.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dge199i", "score_hidden": false, "stickied": false, "created": 1492488399.0, "created_utc": 1492459599.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtw9q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Thesciencenut", "parent_id": "t1_dgdr5sw", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "It's important to note that there are different levels of addiction, when talking about being addicted to something, it does not imply that you cannot do anything without it. Some people will have headaches, feel down, or tired; others will become so crippled that they can't get out of bed or get through the day without it. In either case, it's still addiction. \n\nNicotine in itself IS highly addictive, but this does not mean that every single person will be completely crippled as soon as they stop. Lots of people misunderstand this. \n\nNow, regarding the link that you posted, I question it's accuracy because of the fact that it relied on individuals personally identifying themselves as addicted. It's also a survey, as opposed to a medical study. \nI could be completely wrong about that survey, but I absolutely stand by the statement of nicotine being highly addictive because there are numerous medical studies to show exactly that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s important to note that there are different levels of addiction, when talking about being addicted to something, it does not imply that you cannot do anything without it. Some people will have headaches, feel down, or tired; others will become so crippled that they can&amp;#39;t get out of bed or get through the day without it. In either case, it&amp;#39;s still addiction. &lt;/p&gt;\n\n&lt;p&gt;Nicotine in itself IS highly addictive, but this does not mean that every single person will be completely crippled as soon as they stop. Lots of people misunderstand this. &lt;/p&gt;\n\n&lt;p&gt;Now, regarding the link that you posted, I question it&amp;#39;s accuracy because of the fact that it relied on individuals personally identifying themselves as addicted. It&amp;#39;s also a survey, as opposed to a medical study. \nI could be completely wrong about that survey, but I absolutely stand by the statement of nicotine being highly addictive because there are numerous medical studies to show exactly that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdtw9q", "score_hidden": false, "stickied": false, "created": 1492480113.0, "created_utc": 1492451313.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdr5sw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ufojoe", "parent_id": "t1_dgdnj3v", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "&gt;  It is highly addictive to most people\n\nI don't think it's anywhere near *most* people, when you are talking about nicotine alone. I don't think there's much data on nicotine alone yet, but there was a survey of users done in 2016.\n\n&gt;Then there was nicotine. About 35% of users reported becoming addicted, but this was heavily dependent upon variety of nicotine. Among users who smoked normal tobacco cigarettes, 65% reported addiction. Among those who smoked e-cigarettes, only 25% reported addiction (and again, since there’s no time data, it’s possible these people switched to e-cigarettes because they were addicted and not vice versa). **Among users of nicotine gum and lozenges, only 7% reported addiction, and only 1% reported major addiction.** Although cigarettes are a known gigantic health/addiction risk, the nootropic community’s use of isolated nicotine as a stimulant seems from this survey (subject to the above caveat) to be comparatively but not completely safe. - http://slatestarcodex.com/2016/03/01/2016-nootropics-survey-results/\n\nFrom my understanding there are very few people who start chewing nicotine gum and become addicted to nicotine. Lots of people get addicted to cigarettes (the majority), some people get addicted to e-cigs, very few get addicted to gum or patches.\n\nWhen you're talking about nicotine gum, and other slow uptake pure forms of nicotine, addiction similar to cigarettes is not the big worry. You can become physiologically dependent, where you might withdrawal and feel bad for a few days if you stopped, but people who are addicted in the sense of they can't stop taking it are very rare.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It is highly addictive to most people&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think it&amp;#39;s anywhere near &lt;em&gt;most&lt;/em&gt; people, when you are talking about nicotine alone. I don&amp;#39;t think there&amp;#39;s much data on nicotine alone yet, but there was a survey of users done in 2016.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Then there was nicotine. About 35% of users reported becoming addicted, but this was heavily dependent upon variety of nicotine. Among users who smoked normal tobacco cigarettes, 65% reported addiction. Among those who smoked e-cigarettes, only 25% reported addiction (and again, since there’s no time data, it’s possible these people switched to e-cigarettes because they were addicted and not vice versa). &lt;strong&gt;Among users of nicotine gum and lozenges, only 7% reported addiction, and only 1% reported major addiction.&lt;/strong&gt; Although cigarettes are a known gigantic health/addiction risk, the nootropic community’s use of isolated nicotine as a stimulant seems from this survey (subject to the above caveat) to be comparatively but not completely safe. - &lt;a href=\"http://slatestarcodex.com/2016/03/01/2016-nootropics-survey-results/\"&gt;http://slatestarcodex.com/2016/03/01/2016-nootropics-survey-results/&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;From my understanding there are very few people who start chewing nicotine gum and become addicted to nicotine. Lots of people get addicted to cigarettes (the majority), some people get addicted to e-cigs, very few get addicted to gum or patches.&lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re talking about nicotine gum, and other slow uptake pure forms of nicotine, addiction similar to cigarettes is not the big worry. You can become physiologically dependent, where you might withdrawal and feel bad for a few days if you stopped, but people who are addicted in the sense of they can&amp;#39;t stop taking it are very rare.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdr5sw", "score_hidden": false, "stickied": false, "created": 1492477077.0, "created_utc": 1492448277.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": "", "user_reports": [], "id": "dgdwce9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thesciencenut", "parent_id": "t1_dgdu89y", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "That seems like a non sequitur statement. I didn't address modafinil, and from what I can tell, it's not a phenethylamine class medication like the others I listed. From what I gathered at the time of reading the original post, he was seeking treatment options for ADHD not narcolepsy. It appears that he made a comment about it later on, but I wasn't addressing that.\n\nI'm not really familiar with how modafinil works with the brain, but from what I do know from asking my own doctor and doing a bit of reading, it does not work in any similar fashion to the drugs that I listed. \n\nI can't say much regarding modafinil because I don't feel like I have done enough research on the drug, which is why I didn't directly address it. As stated previously, at the time of writing originally, it appeared as if he was asking about nicotine versus Ritelin. \n\nYou may be correct with your statement about modafinil and nicotine, but again, I can't comfortably argue about that because I haven't looked at it as much. I'll definitely do some more research in the future though, but until then, I'm going to stay away from discussing it. I would rather not put information out there that I'm not confident in.\n\nEdit: Apparently I didn't realize that you were OP so I wrote this addressing someone else. I won't change the tense, because I did fuck up, but I also still think that the information is valid enough to stay.", "edited": 1492454224.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That seems like a non sequitur statement. I didn&amp;#39;t address modafinil, and from what I can tell, it&amp;#39;s not a phenethylamine class medication like the others I listed. From what I gathered at the time of reading the original post, he was seeking treatment options for ADHD not narcolepsy. It appears that he made a comment about it later on, but I wasn&amp;#39;t addressing that.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not really familiar with how modafinil works with the brain, but from what I do know from asking my own doctor and doing a bit of reading, it does not work in any similar fashion to the drugs that I listed. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t say much regarding modafinil because I don&amp;#39;t feel like I have done enough research on the drug, which is why I didn&amp;#39;t directly address it. As stated previously, at the time of writing originally, it appeared as if he was asking about nicotine versus Ritelin. &lt;/p&gt;\n\n&lt;p&gt;You may be correct with your statement about modafinil and nicotine, but again, I can&amp;#39;t comfortably argue about that because I haven&amp;#39;t looked at it as much. I&amp;#39;ll definitely do some more research in the future though, but until then, I&amp;#39;m going to stay away from discussing it. I would rather not put information out there that I&amp;#39;m not confident in.&lt;/p&gt;\n\n&lt;p&gt;Edit: Apparently I didn&amp;#39;t realize that you were OP so I wrote this addressing someone else. I won&amp;#39;t change the tense, because I did fuck up, but I also still think that the information is valid enough to stay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdwce9", "score_hidden": false, "stickied": false, "created": 1492482835.0, "created_utc": 1492454035.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdu89y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ansi-l", "parent_id": "t1_dgdte21", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "&gt;No, nicotine is not a replacement for Ritelin, Adderall, and other medications in this class \n\nPeople with narcolepsy say that the nicotine patch works like a modafinil, but is cheaper. There is also a study where it is said that it interacts with orexin receptors. Many people replace modafinil with nicotine patches.\n\nThere are a lot of such stories on the Internet. For example:\nhttp://autoimmunepatient.com/wordpress/2013/03/07/narcolepsy-and-nicotine/ (read post and commentaries)\n\nI've also seen threads on longecity\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;No, nicotine is not a replacement for Ritelin, Adderall, and other medications in this class &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;People with narcolepsy say that the nicotine patch works like a modafinil, but is cheaper. There is also a study where it is said that it interacts with orexin receptors. Many people replace modafinil with nicotine patches.&lt;/p&gt;\n\n&lt;p&gt;There are a lot of such stories on the Internet. For example:\n&lt;a href=\"http://autoimmunepatient.com/wordpress/2013/03/07/narcolepsy-and-nicotine/\"&gt;http://autoimmunepatient.com/wordpress/2013/03/07/narcolepsy-and-nicotine/&lt;/a&gt; (read post and commentaries)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also seen threads on longecity&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdu89y", "score_hidden": false, "stickied": false, "created": 1492480478.0, "created_utc": 1492451678.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdte21", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Thesciencenut", "parent_id": "t1_dgdp90n", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "Okay, so I still don't have tons of time to give you a super detailed description of everything, but I'll take a stab at it anyway.\n\nDisclaimer: I am not a lawyer, doctor, or any other medical professional. Do not take anything that I have stated here or elsewhere as legal or medical advice. Nothing stated here or elsewhere should be considered privileged information (e.g. I am not legally protected from revealing the information to others in court). Take everything said with a grain of salt.\n\n**Yes, nicotine can help with ADHD**, and it can absolutely be life changing if you use it responsibly. The big problem is that it can be really hard to use it in a responsible fashion.\nOccasional use would probably give you the greatest benefit, but also bring a lot of the negatives up just as strongly. \nNicotine works similar to caffeine regarding withdrawal and dependence. You can probably use your body's reaction to caffeine to give you a very general idea of what your tolerance will be, but you're going to have to compare them in an apples to apples sense. Day 1 to Day 1, not 5 years to day 1. \n\n**No, nicotine is not a replacement for Ritelin, Adderall, and other medications in this class** These particular medications work by changing the activity of the dopamine and norepinephrine receptors of the brain and mimicking phenethylamine. \nNicotine functions by stimulating nicotinic receptors in the brain which then lead to changes in serotonin, dopamine, epinephrine, norepinephrine, and a ton of other hormone levels in the brain. While both are similar in certain aspects, the mechanism is very different. It's like comparing a block of plastic explosives to a shape charge. One is highly focused, and makes huge changes to a small area, while the other effects a large area, but not as much as if it was focused (This is the best analogy that I can think of).\n\n\n**Yes, nicotine is highly studied, and there is tons of credible information available.** However, there is also a lot of \"pseudoscience\" out there and tons of false data. Be careful of where you get your information. There are tons of reasons why nicotine is no longer used for treating ADHD except in rare circumstances. Having a low fatal dosage, being highly addictive, and being difficult to maintain dosing are only a few of the many reasons that it was stopped.\n\n**Being worried by the risk of dependence and addiction is not irrational, but it isn't as bad as you may think.** Having a bit of self control can help you mitigate these risks, but being addicted to nicotine is not in itself extremely detriment to your health. Many people are addicted to caffeine and cannot function throughout the day without having coffee. So long as you get your intake of nicotine through low risk mechanism (Note: the delivery mechanism is the biggest health hazard. Smoking and Vaping are both not smart), you are looking at the same type of situation. You're going to have to find your own way to maintain self-control, but I would personally recommend sticking to taking it at a very specific time during the day and not changing that time regardless of the circumstances. In doing this, you can at least help mitigate forming a psychological reliance on it, and prevent you from using it as a coping mechanism.\nDo your own research, think about it, know yourself, and be safe with it.\n\n**If you cannot get other ADHD medications in your country, consult with your doctor about all of your options** (I do not know the laws in every country, and I don't have the time to learn them) Seriously, don't self medicate and/or self diagnose. It's one thing if you've studied medicine and are a doctor (Though, based on your questions I think this is unlikely) but even then, diagnosing yourself can bring in personal bias, which isn't smart when dealing with your health. If you have talked with your doctor to discuss other options, and have found nothing else to be a viable option; then I (if it was me in your situation) would at least try it to see what happens. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, so I still don&amp;#39;t have tons of time to give you a super detailed description of everything, but I&amp;#39;ll take a stab at it anyway.&lt;/p&gt;\n\n&lt;p&gt;Disclaimer: I am not a lawyer, doctor, or any other medical professional. Do not take anything that I have stated here or elsewhere as legal or medical advice. Nothing stated here or elsewhere should be considered privileged information (e.g. I am not legally protected from revealing the information to others in court). Take everything said with a grain of salt.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Yes, nicotine can help with ADHD&lt;/strong&gt;, and it can absolutely be life changing if you use it responsibly. The big problem is that it can be really hard to use it in a responsible fashion.\nOccasional use would probably give you the greatest benefit, but also bring a lot of the negatives up just as strongly. \nNicotine works similar to caffeine regarding withdrawal and dependence. You can probably use your body&amp;#39;s reaction to caffeine to give you a very general idea of what your tolerance will be, but you&amp;#39;re going to have to compare them in an apples to apples sense. Day 1 to Day 1, not 5 years to day 1. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;No, nicotine is not a replacement for Ritelin, Adderall, and other medications in this class&lt;/strong&gt; These particular medications work by changing the activity of the dopamine and norepinephrine receptors of the brain and mimicking phenethylamine. \nNicotine functions by stimulating nicotinic receptors in the brain which then lead to changes in serotonin, dopamine, epinephrine, norepinephrine, and a ton of other hormone levels in the brain. While both are similar in certain aspects, the mechanism is very different. It&amp;#39;s like comparing a block of plastic explosives to a shape charge. One is highly focused, and makes huge changes to a small area, while the other effects a large area, but not as much as if it was focused (This is the best analogy that I can think of).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Yes, nicotine is highly studied, and there is tons of credible information available.&lt;/strong&gt; However, there is also a lot of &amp;quot;pseudoscience&amp;quot; out there and tons of false data. Be careful of where you get your information. There are tons of reasons why nicotine is no longer used for treating ADHD except in rare circumstances. Having a low fatal dosage, being highly addictive, and being difficult to maintain dosing are only a few of the many reasons that it was stopped.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Being worried by the risk of dependence and addiction is not irrational, but it isn&amp;#39;t as bad as you may think.&lt;/strong&gt; Having a bit of self control can help you mitigate these risks, but being addicted to nicotine is not in itself extremely detriment to your health. Many people are addicted to caffeine and cannot function throughout the day without having coffee. So long as you get your intake of nicotine through low risk mechanism (Note: the delivery mechanism is the biggest health hazard. Smoking and Vaping are both not smart), you are looking at the same type of situation. You&amp;#39;re going to have to find your own way to maintain self-control, but I would personally recommend sticking to taking it at a very specific time during the day and not changing that time regardless of the circumstances. In doing this, you can at least help mitigate forming a psychological reliance on it, and prevent you from using it as a coping mechanism.\nDo your own research, think about it, know yourself, and be safe with it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;If you cannot get other ADHD medications in your country, consult with your doctor about all of your options&lt;/strong&gt; (I do not know the laws in every country, and I don&amp;#39;t have the time to learn them) Seriously, don&amp;#39;t self medicate and/or self diagnose. It&amp;#39;s one thing if you&amp;#39;ve studied medicine and are a doctor (Though, based on your questions I think this is unlikely) but even then, diagnosing yourself can bring in personal bias, which isn&amp;#39;t smart when dealing with your health. If you have talked with your doctor to discuss other options, and have found nothing else to be a viable option; then I (if it was me in your situation) would at least try it to see what happens. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdte21", "score_hidden": false, "stickied": false, "created": 1492479557.0, "created_utc": 1492450757.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdp90n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ansi-l", "parent_id": "t1_dgdnj3v", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "Oh.. Big thanks for answer :)\n\nI just read a lot of threads on reddit and other forums about people that nicotine helps with adhd and drowsiness. There are also several studies. I myself used it only a few times and the effect is exactly there. But I'm afraid to continue because of the risk of dependence. In Russia, there are no stimulants available (adderall, retalin, modafinil, etc), all are banned. Therefore, I consider all options\n\n\n", "edited": 1492446719.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh.. Big thanks for answer :)&lt;/p&gt;\n\n&lt;p&gt;I just read a lot of threads on reddit and other forums about people that nicotine helps with adhd and drowsiness. There are also several studies. I myself used it only a few times and the effect is exactly there. But I&amp;#39;m afraid to continue because of the risk of dependence. In Russia, there are no stimulants available (adderall, retalin, modafinil, etc), all are banned. Therefore, I consider all options&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdp90n", "score_hidden": false, "stickied": false, "created": 1492474961.0, "created_utc": 1492446161.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": "", "user_reports": [], "id": "dgdpura", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ansi-l", "parent_id": "t1_dgdnj3v", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "It's amazing that nicotine helps even with narcolepsy. I don't have narcolepsy, but constant drowsiness. I noticed that their medications help me too.\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3311418/ \n\nI found a lot of stories through google, as well as in the adhd sub reddit", "edited": 1492447654.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s amazing that nicotine helps even with narcolepsy. I don&amp;#39;t have narcolepsy, but constant drowsiness. I noticed that their medications help me too.\n&lt;a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3311418/\"&gt;https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3311418/&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;I found a lot of stories through google, as well as in the adhd sub reddit&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdpura", "score_hidden": false, "stickied": false, "created": 1492475634.0, "created_utc": 1492446834.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnj3v", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Thesciencenut", "parent_id": "t3_65w12j", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "So, I'll do my best to summarize all of the research that I've done so far. I would gladly add links to this, but I'm on mobile at the present moment so I have to stick to memory.\n\nBasically, Nicotine is a stimulant. It is highly addictive to most people, far more so than the majority of recreational drugs most people will encounter.\n\nHowever, it should always be noted that different people will always have different reactions. Some people, like myself, have very little trouble with addiction in general, but not everyone is the same way.\n\nIn terms of adverse health effects, you have pretty similar things to other stimulants. In small quantities, the effects are barely noticeable if present at all, but at normal and high doses, you have similar risks as well. Increased heart rate, palpitations, headaches, depression (following the euphoria that sometimes occurs), and a few other things. It is very similar to caffeine, but a typical dosage of nicotine is much closer to the max tolerable dosage than caffeine. \n\nFor numbers sake (and again, I'm recalling all of this from memory, double check the accuracy of these numbers if you can), the fatal dosage of nicotine for your average adult is something like 100mg to 250mg which is actually not that hard to achieve with things like vaping (which is a whole different thing, and is not really studied enough). A typical cigarette has about 2mg of nicotine, nicotine patches are typically sold in doses of 7, 14, and 21mg. \n\n\nYou also mentioned that nicotine patches are used to treat ADHD and have a similar effect to Ritalin. This is only partially correct. It is true that nicotine patches were used at one point in time to help ease the symptoms of ADD/ADHD but that is no longer the case (except in maybe some rare circumstances) because of the health risks that can be associated with it if not used in a very specific way. It also requires a massive amount of self restraint because you are more likely to start smoking and/or take more nicotine from other sources.\n\nThat being said, individuals with ADHD have a general tendency to react favorably to stimulants. Nicotine being a stimulant, as well as having the tendency to enhance cognitive focus, is generally something that works well with these individuals, but again, everybody is different.\n\nA few other things worth noting. \nSome medications can have strange interactions with nicotine, and many of these medications are prescribed at a frequency high enough for it to be a problem. A good example would be Welbutrin which can counteract many of the positive effects without really eliminating the negative ones. \nTalk to your doctor. Seriously, do it.\n\n\nSide note: I will be more than willing to edit this when I get back to a computer and have some time given that this post has a favorable reaction. I will edit any incorrect statements when/if I catch them because I want to make sure that I'm giving you the best information that I can. Double check anything that sounds off. I had to write this from memory.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, I&amp;#39;ll do my best to summarize all of the research that I&amp;#39;ve done so far. I would gladly add links to this, but I&amp;#39;m on mobile at the present moment so I have to stick to memory.&lt;/p&gt;\n\n&lt;p&gt;Basically, Nicotine is a stimulant. It is highly addictive to most people, far more so than the majority of recreational drugs most people will encounter.&lt;/p&gt;\n\n&lt;p&gt;However, it should always be noted that different people will always have different reactions. Some people, like myself, have very little trouble with addiction in general, but not everyone is the same way.&lt;/p&gt;\n\n&lt;p&gt;In terms of adverse health effects, you have pretty similar things to other stimulants. In small quantities, the effects are barely noticeable if present at all, but at normal and high doses, you have similar risks as well. Increased heart rate, palpitations, headaches, depression (following the euphoria that sometimes occurs), and a few other things. It is very similar to caffeine, but a typical dosage of nicotine is much closer to the max tolerable dosage than caffeine. &lt;/p&gt;\n\n&lt;p&gt;For numbers sake (and again, I&amp;#39;m recalling all of this from memory, double check the accuracy of these numbers if you can), the fatal dosage of nicotine for your average adult is something like 100mg to 250mg which is actually not that hard to achieve with things like vaping (which is a whole different thing, and is not really studied enough). A typical cigarette has about 2mg of nicotine, nicotine patches are typically sold in doses of 7, 14, and 21mg. &lt;/p&gt;\n\n&lt;p&gt;You also mentioned that nicotine patches are used to treat ADHD and have a similar effect to Ritalin. This is only partially correct. It is true that nicotine patches were used at one point in time to help ease the symptoms of ADD/ADHD but that is no longer the case (except in maybe some rare circumstances) because of the health risks that can be associated with it if not used in a very specific way. It also requires a massive amount of self restraint because you are more likely to start smoking and/or take more nicotine from other sources.&lt;/p&gt;\n\n&lt;p&gt;That being said, individuals with ADHD have a general tendency to react favorably to stimulants. Nicotine being a stimulant, as well as having the tendency to enhance cognitive focus, is generally something that works well with these individuals, but again, everybody is different.&lt;/p&gt;\n\n&lt;p&gt;A few other things worth noting. \nSome medications can have strange interactions with nicotine, and many of these medications are prescribed at a frequency high enough for it to be a problem. A good example would be Welbutrin which can counteract many of the positive effects without really eliminating the negative ones. \nTalk to your doctor. Seriously, do it.&lt;/p&gt;\n\n&lt;p&gt;Side note: I will be more than willing to edit this when I get back to a computer and have some time given that this post has a favorable reaction. I will edit any incorrect statements when/if I catch them because I want to make sure that I&amp;#39;m giving you the best information that I can. Double check anything that sounds off. I had to write this from memory.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdnj3v", "score_hidden": false, "stickied": false, "created": 1492473008.0, "created_utc": 1492444208.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": "", "user_reports": [], "id": "dgevwfx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ansi-l", "parent_id": "t1_dgevmqt", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "Thanks for the feedback!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the feedback!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgevwfx", "score_hidden": false, "stickied": false, "created": 1492534058.0, "created_utc": 1492505258.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgevmqt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rcroata", "parent_id": "t1_dgdtqkz", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "I've tried both, nicotine feels nothing like modafinil.  \nI've only used modafinil for up to 3 days in a row, always increasing the dosage, otherwise the initial magic is lost; by day 3 there's no more magic for me and the lack of sleep, jaw tension and teeth licking are just not worth it.  \nModafinil feels like a watered down version of ritalin -- a lot less focus, very slight euphoria the first day, but with some motivation and allertnes boosts.  \nI've tried nicotine as a nootropic and for me, it's just not a nootropic at all -- the patch just makes me hot and sweaty, vaped e-juice has a nice buzz at first and calms me down, but I just can't put it down after I start.  \nI've also tried(got addicted to) nicorrete quick mist which provided a very strong buzz at first, but it very soon loses its magic.   \nAfter experimenting with pure nicotine I had my first cigarretes and I LOVE them, again not as a nootropic but just for the calming effect(the calming effect lasts for 5 minutes, then you're grumpy all the time until your next nicotine dose), but looking back starting nicotine as a nootropic was a bad decision.   \nI've quit pure nicotine (after throwing away countless nicorrette sprays) and I only give in and smoke a cigar once in a couple of weeks, but I always get the urge to do so when someone else smokes.  \nSo, if you must, only try nicotine in the patch form, as any quick release form of nicotine can be very addictive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve tried both, nicotine feels nothing like modafinil.&lt;br/&gt;\nI&amp;#39;ve only used modafinil for up to 3 days in a row, always increasing the dosage, otherwise the initial magic is lost; by day 3 there&amp;#39;s no more magic for me and the lack of sleep, jaw tension and teeth licking are just not worth it.&lt;br/&gt;\nModafinil feels like a watered down version of ritalin -- a lot less focus, very slight euphoria the first day, but with some motivation and allertnes boosts.&lt;br/&gt;\nI&amp;#39;ve tried nicotine as a nootropic and for me, it&amp;#39;s just not a nootropic at all -- the patch just makes me hot and sweaty, vaped e-juice has a nice buzz at first and calms me down, but I just can&amp;#39;t put it down after I start.&lt;br/&gt;\nI&amp;#39;ve also tried(got addicted to) nicorrete quick mist which provided a very strong buzz at first, but it very soon loses its magic.&lt;br/&gt;\nAfter experimenting with pure nicotine I had my first cigarretes and I LOVE them, again not as a nootropic but just for the calming effect(the calming effect lasts for 5 minutes, then you&amp;#39;re grumpy all the time until your next nicotine dose), but looking back starting nicotine as a nootropic was a bad decision.&lt;br/&gt;\nI&amp;#39;ve quit pure nicotine (after throwing away countless nicorrette sprays) and I only give in and smoke a cigar once in a couple of weeks, but I always get the urge to do so when someone else smokes.&lt;br/&gt;\nSo, if you must, only try nicotine in the patch form, as any quick release form of nicotine can be very addictive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgevmqt", "score_hidden": false, "stickied": false, "created": 1492533191.0, "created_utc": 1492504391.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r81c", "removal_reason": null, "link_id": "t3_65w12j", "likes": null, "replies": "", "user_reports": [], "id": "dgdu9ta", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ansi-l", "parent_id": "t1_dgdtxff", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "Thanks! I will wait )", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! I will wait )&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdu9ta", "score_hidden": false, "stickied": false, "created": 1492480523.0, "created_utc": 1492451723.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtxff", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thesciencenut", "parent_id": "t1_dgdtqkz", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "I'll give it a stab later on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll give it a stab later on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdtxff", "score_hidden": false, "stickied": false, "created": 1492480149.0, "created_utc": 1492451349.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtqkz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ansi-l", "parent_id": "t3_65w12j", "subreddit_name_prefixed": "r/Nootropics", "controversiality": 0, "body": "http://autoimmunepatient.com/wordpress/2013/03/07/narcolepsy-and-nicotine/\n\nHere they write that nicotine works better than modafinil (read also comments and research). There are plenty of such stories on the Internet.\nCan anyone compare? I don't have access to modafinil", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://autoimmunepatient.com/wordpress/2013/03/07/narcolepsy-and-nicotine/\"&gt;http://autoimmunepatient.com/wordpress/2013/03/07/narcolepsy-and-nicotine/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Here they write that nicotine works better than modafinil (read also comments and research). There are plenty of such stories on the Internet.\nCan anyone compare? I don&amp;#39;t have access to modafinil&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Nootropics", "name": "t1_dgdtqkz", "score_hidden": false, "stickied": false, "created": 1492479936.0, "created_utc": 1492451136.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]