[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "tifu", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h2&gt;Pens&lt;/h2&gt;\n\n&lt;p&gt;My first experience of &lt;strong&gt;Hell itch&lt;/strong&gt; was in my lower teens when my family and I spent a day fishing at a local stream without sunscreen.&lt;/p&gt;\n\n&lt;p&gt;To celebrate that milestone we go fishing again, two days later.&lt;/p&gt;\n\n&lt;p&gt;This time we decide to invest in some sunscreen, hoping to learn from our already scarlet flesh.&lt;/p&gt;\n\n&lt;p&gt;Sadly, the damage was done and on the ride home, I began to feel this terrible, ever-present&lt;strong&gt;itch&lt;/strong&gt; on my back and ask my dad to pull over. The &lt;strong&gt;itch&lt;/strong&gt;ing only grows until I pour ice-cold water over my back from a cooler, providing immediate, amazing relief... for about two minutes a splash. At the end of those two minutes, the &lt;strong&gt;itch&lt;/strong&gt; returns all the worse for the waiting. We eventually just get in the car and I white-knuckle it the hour and a half home, the &lt;strong&gt;itch&lt;/strong&gt; dragging it&amp;#39;s claws through my back more slowly and less deeply all the while.&lt;/p&gt;\n\n&lt;p&gt;Time goes on.&lt;/p&gt;\n\n&lt;h2&gt;Needles&lt;/h2&gt;\n\n&lt;p&gt;I&amp;#39;m now in my upper teens and home for summer break. Like a dutiful, capitalistic youngster, I volunteer to mow and trim the lawn (4+ acres) for a tidy sum of cash. Parents agree, and I get to mowing without a shirt, sunscreen, or care in the world.&lt;/p&gt;\n\n&lt;p&gt;Two days later, I feel &lt;strong&gt;it&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;Everything is terrible, I hate everything in life.&lt;/p&gt;\n\n&lt;p&gt;The &lt;strong&gt;itch&lt;/strong&gt; is back, I sit in my computer chair until I feel a twinge, a scratch, an ant-sized &lt;strong&gt;itch&lt;/strong&gt;. Making a terrible mistake, I decide to shower, with the thought that I might be having an allergic reaction to something and should wash it off. The shower involves water, soap, all things that can dry out skin. I try to get out of the shower several times over the next few hours, each with the &lt;strong&gt;itch&lt;/strong&gt; returning, immediate and unrelenting. Finally the water runs cold, exhaustion hits, and I retreat to my bed to restlessly toss and turn until Lucifer grows bored.&lt;/p&gt;\n\n&lt;p&gt;Time goes on.&lt;/p&gt;\n\n&lt;h2&gt;Knives&lt;/h2&gt;\n\n&lt;p&gt;I am now twenty-three and am driving back west from a funeral in the south, I am feeling grief and the certain shade of guilt you get when you leave behind someone who you loved.&lt;/p&gt;\n\n&lt;p&gt;Now, I have a personal rule to not become intoxicated while excessively sad, angry, nervous, or depressed; as I&amp;#39;m of the mindset that mind-alteration should be on occasion of celebration, not grief. However, I do hold the notion that a medicine, correctly applied, can be healing, regardless of the source. Regardless, I was past the angry stage, past the depressive state, and was beginning to accept that a figure in my childhood had moved forward.&lt;/p&gt;\n\n&lt;p&gt;All that rushes through my head as I sit in my parked car, hands still on the wheel, staring across a lush mountain stream. I sit there for a few minutes, alternatively noting the lack of passing cars and the refreshing water.&lt;/p&gt;\n\n&lt;p&gt;With my first heart-felt smile in a while, I get out of my car and quickly shuck my oxfords in favor of Chacos, my stiff slacks for six-year-old cargo shorts, and my faded tee shirt for my gleaming, pearlescent torso laid bare to the glare of god. In my right hand is my phone. In my left is my preferred method of cannabis consumption. My pockets hold my water, a kind bar, and a set of keys.&lt;/p&gt;\n\n&lt;p&gt;And so prepared, I enjoy the next several hours climbing over rocks, jumping between river islands, and photographing all that I see. Throughout, I narrate this wonderful experience to nature. I accept my past. &lt;/p&gt;\n\n&lt;p&gt;All this I dump into my verbal diary until all my words run dry and give way to three words.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&amp;quot;I CAN SWIM&amp;quot;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I threw my shirt onto a giant rock in the river and promptly jump into the silky, deliciously clean mountain water. An hour passes as I alternate between floating down the river and swimming back upstream. &lt;/p&gt;\n\n&lt;p&gt;All the while, god&amp;#39;s frown only deepened and his gaze sharpened upon my porcelain skin.&lt;/p&gt;\n\n&lt;p&gt;And so it was that I found myself finishing the day by drying off with the towel my car, Judas, had been warming up for me. My shorts were soaked, but I felt they matched the happy path this road trip had taken.&lt;/p&gt;\n\n&lt;p&gt;The next seven hours weren&amp;#39;t too remarkable, but the driving was made exceptionally pleasant from the lack of cars on the road and the warm spring air coming through Judas&amp;#39;s windows. I fell asleep almost immediately when I arrived home that night.&lt;/p&gt;\n\n&lt;p&gt;Yesterday morning was uneventful; I was laid in bed feeling the unpleasant, but manageable burn that accompanies a sunburn. The day went well and I go through another evening shift with red arms coming out of my scrubs.&lt;/p&gt;\n\n&lt;p&gt;Not remembering the past, I take my routine evening shower. Not more than five minutes following the shower, I begin to feel little tickles on my back; little pinpricks of pain. I dismissed these foolishly.&lt;/p&gt;\n\n&lt;p&gt;If only I had the foresight to bring sunscreen before the pens grew into needles and the needles grew into knives and the knives continued to stab into my flesh, repeatedly and constantly as I tried to force myself to sleep.&lt;/p&gt;\n\n&lt;p&gt;Having had enough, I forced myself to jump back into the shower and spray scolding hot water onto my already tender, painful skin. &lt;/p&gt;\n\n&lt;p&gt;There I stood, experiencing a new pain from the water. I prayed the &lt;strong&gt;itch&lt;/strong&gt; wouldn&amp;#39;t return when I the water left. I spent that shower waiting. I waited for benadryl to knock me out. I waited for the water temperature to stop the &lt;strong&gt;itch&lt;/strong&gt;, I waited for the benadryl to be expired and kill me with a heart attack - I didn&amp;#39;t care, I just waited.&lt;/p&gt;\n\n&lt;p&gt;I felt I was empty husk when I stepped from that shower, so terrified to have hope. I stepped out of the shower and had the realization that the monster on my back was calm, the hot water had sated him in a way I hadn&amp;#39;t dare hope for. I gingerly stepped into my room, crawled under the covers and felt an ember of hope begin to smolder in my trembling chest.&lt;/p&gt;\n\n&lt;p&gt;Today when I woke, I was afraid of the sensation moving might bring me. Thankfully, the morning air was kind and I began my day normally aside from than the two or three needles randomly and infrequently. My hope that I was through with the &lt;strong&gt;Itch&lt;/strong&gt; was a match light.&lt;/p&gt;\n\n&lt;p&gt;But the match flickered and those needles began to grow once again to spike my mind and muscles into action and spasm.&lt;/p&gt;\n\n&lt;p&gt;In response to with the growing pain, I grew angry, took another benadryl in defiance of my latest glass of caffeine, and I paced, running through my options, before suddenly snapping.&lt;/p&gt;\n\n&lt;p&gt;I begin doing push-ups.&lt;/p&gt;\n\n&lt;p&gt;I do bicep curls.&lt;/p&gt;\n\n&lt;p&gt;I do sit ups.&lt;/p&gt;\n\n&lt;p&gt;I defy&lt;/p&gt;\n\n&lt;p&gt;Pain.&lt;/p&gt;\n\n&lt;p&gt;I look right in it&amp;#39;s eyes and say that I&amp;#39;m tired; I accept your message and I will move past you.&lt;/p&gt;\n\n&lt;p&gt;Maybe it was the increased circulation, maybe the exercise over-road the pain from the &lt;strong&gt;itch&lt;/strong&gt;, but I don&amp;#39;t definitively know how the pain was stopped. &lt;/p&gt;\n\n&lt;p&gt;I sit here without pain, I moved past the itch.&lt;/p&gt;\n\n&lt;p&gt;But Judas is now hanging on to a bottle of spf 70.&lt;/p&gt;\n\n&lt;p&gt;TLDR; I have the most white person problem - I develop a strange reaction to over exposure to the sun. This reaction occurs most commonly in individuals of northern-european descent and remains relatively undocumented and is joyfully called Hell Itch. This post is a true retelling of my past and current experiences with Hell Itch. Google &amp;quot;Hell Itch&amp;quot; for more horror stories. Or go to the subreddit &lt;a href=\"/u/HellsItch\"&gt;/u/HellsItch&lt;/a&gt;. Thank you for reading!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "##Pens\n\nMy first experience of **Hell itch** was in my lower teens when my family and I spent a day fishing at a local stream without sunscreen.\n\nTo celebrate that milestone we go fishing again, two days later.\n\nThis time we decide to invest in some sunscreen, hoping to learn from our already scarlet flesh.\n\nSadly, the damage was done and on the ride home, I began to feel this terrible, ever-present**itch** on my back and ask my dad to pull over. The **itch**ing only grows until I pour ice-cold water over my back from a cooler, providing immediate, amazing relief... for about two minutes a splash. At the end of those two minutes, the **itch** returns all the worse for the waiting. We eventually just get in the car and I white-knuckle it the hour and a half home, the **itch** dragging it's claws through my back more slowly and less deeply all the while.\n\nTime goes on.\n\n##Needles\n\nI'm now in my upper teens and home for summer break. Like a dutiful, capitalistic youngster, I volunteer to mow and trim the lawn (4+ acres) for a tidy sum of cash. Parents agree, and I get to mowing without a shirt, sunscreen, or care in the world.\n\nTwo days later, I feel **it**.\n\nEverything is terrible, I hate everything in life.\n\nThe **itch** is back, I sit in my computer chair until I feel a twinge, a scratch, an ant-sized **itch**. Making a terrible mistake, I decide to shower, with the thought that I might be having an allergic reaction to something and should wash it off. The shower involves water, soap, all things that can dry out skin. I try to get out of the shower several times over the next few hours, each with the **itch** returning, immediate and unrelenting. Finally the water runs cold, exhaustion hits, and I retreat to my bed to restlessly toss and turn until Lucifer grows bored.\n\nTime goes on.\n\n##Knives\n\nI am now twenty-three and am driving back west from a funeral in the south, I am feeling grief and the certain shade of guilt you get when you leave behind someone who you loved.\n\nNow, I have a personal rule to not become intoxicated while excessively sad, angry, nervous, or depressed; as I'm of the mindset that mind-alteration should be on occasion of celebration, not grief. However, I do hold the notion that a medicine, correctly applied, can be healing, regardless of the source. Regardless, I was past the angry stage, past the depressive state, and was beginning to accept that a figure in my childhood had moved forward.\n\nAll that rushes through my head as I sit in my parked car, hands still on the wheel, staring across a lush mountain stream. I sit there for a few minutes, alternatively noting the lack of passing cars and the refreshing water.\n\nWith my first heart-felt smile in a while, I get out of my car and quickly shuck my oxfords in favor of Chacos, my stiff slacks for six-year-old cargo shorts, and my faded tee shirt for my gleaming, pearlescent torso laid bare to the glare of god. In my right hand is my phone. In my left is my preferred method of cannabis consumption. My pockets hold my water, a kind bar, and a set of keys.\n\nAnd so prepared, I enjoy the next several hours climbing over rocks, jumping between river islands, and photographing all that I see. Throughout, I narrate this wonderful experience to nature. I accept my past. \n\nAll this I dump into my verbal diary until all my words run dry and give way to three words.\n\n**\"I CAN SWIM\"**\n\nI threw my shirt onto a giant rock in the river and promptly jump into the silky, deliciously clean mountain water. An hour passes as I alternate between floating down the river and swimming back upstream. \n\nAll the while, god's frown only deepened and his gaze sharpened upon my porcelain skin.\n\nAnd so it was that I found myself finishing the day by drying off with the towel my car, Judas, had been warming up for me. My shorts were soaked, but I felt they matched the happy path this road trip had taken.\n\nThe next seven hours weren't too remarkable, but the driving was made exceptionally pleasant from the lack of cars on the road and the warm spring air coming through Judas's windows. I fell asleep almost immediately when I arrived home that night.\n\nYesterday morning was uneventful; I was laid in bed feeling the unpleasant, but manageable burn that accompanies a sunburn. The day went well and I go through another evening shift with red arms coming out of my scrubs.\n\nNot remembering the past, I take my routine evening shower. Not more than five minutes following the shower, I begin to feel little tickles on my back; little pinpricks of pain. I dismissed these foolishly.\n\nIf only I had the foresight to bring sunscreen before the pens grew into needles and the needles grew into knives and the knives continued to stab into my flesh, repeatedly and constantly as I tried to force myself to sleep.\n\nHaving had enough, I forced myself to jump back into the shower and spray scolding hot water onto my already tender, painful skin. \n\nThere I stood, experiencing a new pain from the water. I prayed the **itch** wouldn't return when I the water left. I spent that shower waiting. I waited for benadryl to knock me out. I waited for the water temperature to stop the **itch**, I waited for the benadryl to be expired and kill me with a heart attack - I didn't care, I just waited.\n\nI felt I was empty husk when I stepped from that shower, so terrified to have hope. I stepped out of the shower and had the realization that the monster on my back was calm, the hot water had sated him in a way I hadn't dare hope for. I gingerly stepped into my room, crawled under the covers and felt an ember of hope begin to smolder in my trembling chest.\n\nToday when I woke, I was afraid of the sensation moving might bring me. Thankfully, the morning air was kind and I began my day normally aside from than the two or three needles randomly and infrequently. My hope that I was through with the **Itch** was a match light.\n\nBut the match flickered and those needles began to grow once again to spike my mind and muscles into action and spasm.\n\nIn response to with the growing pain, I grew angry, took another benadryl in defiance of my latest glass of caffeine, and I paced, running through my options, before suddenly snapping.\n\nI begin doing push-ups.\n\nI do bicep curls.\n\nI do sit ups.\n\nI defy\n\nPain.\n\nI look right in it's eyes and say that I'm tired; I accept your message and I will move past you.\n\nMaybe it was the increased circulation, maybe the exercise over-road the pain from the **itch**, but I don't definitively know how the pain was stopped. \n\nI sit here without pain, I moved past the itch.\n\nBut Judas is now hanging on to a bottle of spf 70.\n\nTLDR; I have the most white person problem - I develop a strange reaction to over exposure to the sun. This reaction occurs most commonly in individuals of northern-european descent and remains relatively undocumented and is joyfully called Hell Itch. This post is a true retelling of my past and current experiences with Hell Itch. Google \"Hell Itch\" for more horror stories. Or go to the subreddit /u/HellsItch. Thank you for reading!\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "L", "id": "650x46", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "The_Woven_One", "saved": false, "mod_reports": [], "name": "t3_650x46", "subreddit_name_prefixed": "r/tifu", "approved_by": null, "over_18": false, "domain": "self.tifu", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2to41", "edited": 1492030431.0, "link_flair_css_class": "L", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/tifu/comments/650x46/tifu_by_getting_sunburnt_the_hell_itch_chronicles/", "num_reports": null, "locked": false, "stickied": false, "created": 1492059036.0, "url": "https://www.reddit.com/r/tifu/comments/650x46/tifu_by_getting_sunburnt_the_hell_itch_chronicles/", "author_flair_text": null, "quarantine": false, "title": "TIFU by getting sunburnt. - The Hell Itch Chronicles", "created_utc": 1492030236.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": "", "user_reports": [], "id": "dg6ow0c", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "maxi478", "parent_id": "t1_dg6kiqm", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "You can just smell the privilege my fellow white humans.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can just smell the privilege my fellow white humans.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg6ow0c", "score_hidden": false, "stickied": false, "created": 1492065572.0, "created_utc": 1492036772.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kiqm", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Katleesi717", "parent_id": "t3_650x46", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "As a fellow pasty white person, I will learn from your mistakes and banish the itchy demons with holy sunscreen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a fellow pasty white person, I will learn from your mistakes and banish the itchy demons with holy sunscreen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg6kiqm", "score_hidden": false, "stickied": false, "created": 1492060281.0, "created_utc": 1492031481.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": "", "user_reports": [], "id": "dg8u9de", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DrunkenSpoonyBard", "parent_id": "t1_dg8szk5", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Huh. Might actually be worth bringing that up; thanks mate!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Huh. Might actually be worth bringing that up; thanks mate!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg8u9de", "score_hidden": false, "stickied": false, "created": 1492178710.0, "created_utc": 1492149910.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8szk5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dimsml", "parent_id": "t1_dg7zof4", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "There is a drug that prevents motion sickness and it is actually the same as Benadryl (diphenhydramine), but with a caffeine-like stimulant to combat the drowsiness.\n\nhttps://en.wikipedia.org/wiki/Dimenhydrinate\n\nTry asking your doc if you can try it.\n\nP.S. Wiki says it has lower potency that pure Benadryl, not sure if it will work.", "edited": 1492147585.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a drug that prevents motion sickness and it is actually the same as Benadryl (diphenhydramine), but with a caffeine-like stimulant to combat the drowsiness.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Dimenhydrinate\"&gt;https://en.wikipedia.org/wiki/Dimenhydrinate&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Try asking your doc if you can try it.&lt;/p&gt;\n\n&lt;p&gt;P.S. Wiki says it has lower potency that pure Benadryl, not sure if it will work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg8szk5", "score_hidden": false, "stickied": false, "created": 1492176056.0, "created_utc": 1492147256.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7zof4", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DrunkenSpoonyBard", "parent_id": "t1_dg7kikp", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "I have! Neither one of them works on me. :\\ I react funny to medications due to genetic health issues.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have! Neither one of them works on me. :\\ I react funny to medications due to genetic health issues.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg7zof4", "score_hidden": false, "stickied": false, "created": 1492137019.0, "created_utc": 1492108219.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kikp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dimsml", "parent_id": "t1_dg74cfe", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Have you tried loratadine or levo-cetirizine? Both are OTC.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tried loratadine or levo-cetirizine? Both are OTC.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg7kikp", "score_hidden": false, "stickied": false, "created": 1492120447.0, "created_utc": 1492091647.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg74cfe", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DrunkenSpoonyBard", "parent_id": "t1_dg72dtw", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Benadryl helps...except it knocks me the fuck out so I usually just either avoid the sun or try to ignore the reaction. Easier said than done, though!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Benadryl helps...except it knocks me the fuck out so I usually just either avoid the sun or try to ignore the reaction. Easier said than done, though!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg74cfe", "score_hidden": false, "stickied": false, "created": 1492085261.0, "created_utc": 1492056461.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg72dtw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "The_Woven_One", "parent_id": "t1_dg72064", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Oh man! That sounds terrible. Anything sooth those hives?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man! That sounds terrible. Anything sooth those hives?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg72dtw", "score_hidden": false, "stickied": false, "created": 1492082382.0, "created_utc": 1492053582.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg72064", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "DrunkenSpoonyBard", "parent_id": "t3_650x46", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Sun reactions are fun, aren't they?\n\nI personally break out in painful hives from the sun if I'm out for more than maybe a minute. Makes summertime loads of fun.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sun reactions are fun, aren&amp;#39;t they?&lt;/p&gt;\n\n&lt;p&gt;I personally break out in painful hives from the sun if I&amp;#39;m out for more than maybe a minute. Makes summertime loads of fun.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg72064", "score_hidden": false, "stickied": false, "created": 1492081858.0, "created_utc": 1492053058.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": "", "user_reports": [], "id": "dg7gdgp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "michaeldorf", "parent_id": "t3_650x46", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "I think you meant /r/Hellsitch not /u/Hellsitch", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you meant &lt;a href=\"/r/Hellsitch\"&gt;/r/Hellsitch&lt;/a&gt; not &lt;a href=\"/u/Hellsitch\"&gt;/u/Hellsitch&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg7gdgp", "score_hidden": false, "stickied": false, "created": 1492114235.0, "created_utc": 1492085435.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": "", "user_reports": [], "id": "dga0cl2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ReineDeLaSeine14", "parent_id": "t1_dg7ex6d", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "I screencapped this for future reference ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I screencapped this for future reference &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dga0cl2", "score_hidden": false, "stickied": false, "created": 1492244912.0, "created_utc": 1492216112.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ex6d", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Silverleaf79", "parent_id": "t3_650x46", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "As a child my parents used to take me on holiday to Spain or Greece every year, and every single year I'd get sunburned despite sunscreen. (I'm one of those blue-eyed types that burns if I even see a *picture* of the sun.) My holidays were full of pain and itch and not being able to sleep and peeling skin after the fist couple of days. \n\nAnyway, one year an old Greek man literally stopped my parents on the street to tell them to buy tomatoes. \n\nTo put on my skin. \n\nNow if I had an eight year old daughter and an old man insisted I should rub salad on her, I'd probably call the police or something. Not so my parents! They bought tomatoes.\n\nAnd the moral of the story is, that old Greek man who sounded like a perv was absolutely *dead right* about tomatoes and sunburn. The big \"beefsteak\" tomatoes seem to be the best but any will work, and they're even better if cold from the fridge. The relief you feel when cold tomato juice meets sore hot skin is incredible. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a child my parents used to take me on holiday to Spain or Greece every year, and every single year I&amp;#39;d get sunburned despite sunscreen. (I&amp;#39;m one of those blue-eyed types that burns if I even see a &lt;em&gt;picture&lt;/em&gt; of the sun.) My holidays were full of pain and itch and not being able to sleep and peeling skin after the fist couple of days. &lt;/p&gt;\n\n&lt;p&gt;Anyway, one year an old Greek man literally stopped my parents on the street to tell them to buy tomatoes. &lt;/p&gt;\n\n&lt;p&gt;To put on my skin. &lt;/p&gt;\n\n&lt;p&gt;Now if I had an eight year old daughter and an old man insisted I should rub salad on her, I&amp;#39;d probably call the police or something. Not so my parents! They bought tomatoes.&lt;/p&gt;\n\n&lt;p&gt;And the moral of the story is, that old Greek man who sounded like a perv was absolutely &lt;em&gt;dead right&lt;/em&gt; about tomatoes and sunburn. The big &amp;quot;beefsteak&amp;quot; tomatoes seem to be the best but any will work, and they&amp;#39;re even better if cold from the fridge. The relief you feel when cold tomato juice meets sore hot skin is incredible. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg7ex6d", "score_hidden": false, "stickied": false, "created": 1492111150.0, "created_utc": 1492082350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": "", "user_reports": [], "id": "dg6x1ni", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bladedeante", "parent_id": "t3_650x46", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "I spent 2K on a 7 day trip to Fiji. I went snorkelling in the second day got \"minor\" sunburn and the spent the rest of the holiday going silently mad as my friends didn't believe the intense pain and discomfort. I never get any sun on my back, and 2 hours of snorkelling without sunscreen screwed up my amazing planned holiday. The itch only ended the day I was scheduled to fly home which was a relief because I could not consider the torture of flying 8+ hours (including stop over) with hells itch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I spent 2K on a 7 day trip to Fiji. I went snorkelling in the second day got &amp;quot;minor&amp;quot; sunburn and the spent the rest of the holiday going silently mad as my friends didn&amp;#39;t believe the intense pain and discomfort. I never get any sun on my back, and 2 hours of snorkelling without sunscreen screwed up my amazing planned holiday. The itch only ended the day I was scheduled to fly home which was a relief because I could not consider the torture of flying 8+ hours (including stop over) with hells itch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg6x1ni", "score_hidden": false, "stickied": false, "created": 1492075578.0, "created_utc": 1492046778.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": "", "user_reports": [], "id": "dg78xdr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Crafty_Chica", "parent_id": "t3_650x46", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "I've never been more grateful to not have that reaction to sun exposure. That sounds agonizing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never been more grateful to not have that reaction to sun exposure. That sounds agonizing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg78xdr", "score_hidden": false, "stickied": false, "created": 1492094009.0, "created_utc": 1492065209.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": "", "user_reports": [], "id": "dg7gvob", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dextero_Explosion", "parent_id": "t3_650x46", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "I got hell itch for the first time at age 30 despite being sunburnt many times in the past. Holy crap, the pain. It was terrifying not ever having heard of it, not knowing when it would stop. Caught an article about it about a year later. I don't do sun now without sunscreen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I got hell itch for the first time at age 30 despite being sunburnt many times in the past. Holy crap, the pain. It was terrifying not ever having heard of it, not knowing when it would stop. Caught an article about it about a year later. I don&amp;#39;t do sun now without sunscreen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg7gvob", "score_hidden": false, "stickied": false, "created": 1492115141.0, "created_utc": 1492086341.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": "", "user_reports": [], "id": "dg7v2tx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CCV21", "parent_id": "t3_650x46", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Have you tried aloe vera?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tried aloe vera?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg7v2tx", "score_hidden": false, "stickied": false, "created": 1492132135.0, "created_utc": 1492103335.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_650x46", "likes": null, "replies": "", "user_reports": [], "id": "dg854hp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "reallycertaintragedy", "parent_id": "t3_650x46", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "I'm 22 years old, and have been sunburned to the point of developing a beautiful area of flesh on my shoulders, chest and back that neither tans nor bleaches. It burns, and freckles. It is numb. I feel the pressure of objects and appendages contacting the area, but sensations are muffled, so to speak. I burn, and then tan within a day or two. \n\nI'm not sure of my ancestry, but wherever my family heils from, they were blessed to be exempt from hells itch. Though I am cursed with a general muffled sense of touch. I can't feel some things that my friends do. \n\nNerve damage? Maybe. Pros? No hells itch, high pain tolerance. Cons? Can't feel the difference between felt and velvet or different blends of fur. Mixed materials have the potential to feel exactly the same. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 22 years old, and have been sunburned to the point of developing a beautiful area of flesh on my shoulders, chest and back that neither tans nor bleaches. It burns, and freckles. It is numb. I feel the pressure of objects and appendages contacting the area, but sensations are muffled, so to speak. I burn, and then tan within a day or two. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure of my ancestry, but wherever my family heils from, they were blessed to be exempt from hells itch. Though I am cursed with a general muffled sense of touch. I can&amp;#39;t feel some things that my friends do. &lt;/p&gt;\n\n&lt;p&gt;Nerve damage? Maybe. Pros? No hells itch, high pain tolerance. Cons? Can&amp;#39;t feel the difference between felt and velvet or different blends of fur. Mixed materials have the potential to feel exactly the same. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg854hp", "score_hidden": false, "stickied": false, "created": 1492142934.0, "created_utc": 1492114134.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]
