[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "tifu", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: Got &lt;a href=\"https://youtu.be/w7wJ4l0rHzQ\"&gt;Nancy Grace&lt;/a&gt; confused with Nancy Drew in an improv acting club. Proceeded to accuse and verbally abuse a Leprechaun of a brutal triple murder and theft, while thinking I was in character. Couldn&amp;#39;t do improv in that club for the rest of the semester, probably made an 11 year old girl cry. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;So this was actually 5 years ago, back in the seventh grade. At our middle school, we had half an hour a day devoted to extracurricular stuff (each teacher created a &amp;#39;club&amp;#39;). On Mondays and Wednesdays, I was an improv actor.&lt;/p&gt;\n\n&lt;p&gt;I had actually done this club during the first term the year before, so I was quite familiar with the concept and all. Only thing was, I had a really good friend who shared my sense of humor in that class, and the teacher seemed to be on par with that and thought it was funny too, so as it went on, we pushed the envelope a little bit more each time we acted something out. &lt;/p&gt;\n\n&lt;p&gt;However, this time I was in a class with mostly 11 and 12 year old girls, and it had been a year since the last class, which had probably been plenty of time for my adolescent mind to grow into a more twisted humor. &lt;/p&gt;\n\n&lt;p&gt;So we were in class, and were finally getting past all of the introductory stuff. The time came for us to do our first improv act, which had three people, each of us assuming a random character. I volunteered, eager to hopefully get some laughs again and hopefully encourage some other people to get up as well. We went around and the characters were, a Leprechaun, a police officer, and Nancy Drew, the &lt;em&gt;beloved teen detective.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;Now, for whatever reason, I was left with Nancy Drew, despite being the only male. I was fine with this though because I thought I had such a good act planned. &lt;strong&gt;However&lt;/strong&gt; my expectations soon became an illusion, because of my mom&amp;#39;s incessant viewing of HLN when I was in middle school. My mom loved to keep up with the Jodi Arias trial, and HLN had 24/7 coverage of that shit. Nancy Grace was the prime time name, and for those who don&amp;#39;t know, she is an extremely over the top, passionate, and former prosecuting nutjob. She pretty much assumes guilt for any perpetrator in a newsworthy case, and loves to side with the victim. I would subliminally hear things from the TVs in the house talking about murder and ridiculous crimes that she just got so whipped up about, and I thought that was funny, still do.  I found this as an opportunity to satirize Nancy Grace, which again, was confused with Nancy Drew...&lt;/p&gt;\n\n&lt;p&gt;So anyways, I wait to find my way into this thing. The urge to jump out of the gate was strong, but I knew I could make it work. As the police officer&amp;#39;s gears begin to move, he says something along the lines of &amp;#39;hmmm, so you&amp;#39;re sure you haven&amp;#39;t seen the missing gold?&amp;#39; &lt;/p&gt;\n\n&lt;p&gt;This is where I let out the &amp;quot;bombshell tonight&amp;quot; performance. I start questioning this Leprechaun like he murdered Nicole Brown and Ron Goldman. Shit starts getting really heavy in the room. I start by agreeing with the cop and sternly asking where he was on the night of whatever date, and when he tried to think of an answer, I yelled &amp;quot;I KNOW YOU STOLE THAT WOMAN&amp;#39;S GOLD AND DUMPED HER AND HER CHILDREN IN THE RIVER, YOU MONSTER!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The cop and the Leprechaun just kinda stood there for a second, and then the cop finally adjusted his gaze to the Leprechaun, yearning for a response to break the fucking cloud of awkward silence. He opened his mouth and said, &amp;quot;I- I don&amp;#39;t know what you-,&amp;quot; to which I interrupt with, &amp;quot;How could you just drive her full car into those COLD UNFORGIVING waters, the kids would drown so slowly! I know you&amp;#39;re bs&amp;#39;ing me, YOU DID THIS!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;At this point, the two were just befuddled with that I was trying to do, and as I looked around, I just kinda saw everyone looking uncomfortable, staring at Nancy Drew, wondering what was up her ass. I didn&amp;#39;t really know what to do at that point, so I glanced by the teacher, who also didn&amp;#39;t look too comfortable. As we made eye contact, she kinda shut it down and said thanks for coming up, but we only have 10 minutes and more people wanna go. &lt;/p&gt;\n\n&lt;p&gt;At this point, I am confused as all hell, and then started thinking maybe people didn&amp;#39;t know who Nancy Grace was. So I asked someone if they knew who she was, to which they replied &amp;quot;you mean Nancy Drew?&amp;quot; At that moment my heart sunk in my chest, as I realized that now everyone thought I was this complete fucking psychopath. After the next act I kind of raised my hand and told her timidly about my confusion, she just kinda looked at me...and then went on to the next person. I didn&amp;#39;t get called to do improv again for the rest of the year. I was scarred from embarrassment, but I&amp;#39;m pretty sure I also made a 6th grade girl cry, so I honestly don&amp;#39;t know what I did to her...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**tl;dr**: Got [Nancy Grace](https://youtu.be/w7wJ4l0rHzQ) confused with Nancy Drew in an improv acting club. Proceeded to accuse and verbally abuse a Leprechaun of a brutal triple murder and theft, while thinking I was in character. Couldn't do improv in that club for the rest of the semester, probably made an 11 year old girl cry. \n\n\n---------------------\n\nSo this was actually 5 years ago, back in the seventh grade. At our middle school, we had half an hour a day devoted to extracurricular stuff (each teacher created a 'club'). On Mondays and Wednesdays, I was an improv actor.\n\nI had actually done this club during the first term the year before, so I was quite familiar with the concept and all. Only thing was, I had a really good friend who shared my sense of humor in that class, and the teacher seemed to be on par with that and thought it was funny too, so as it went on, we pushed the envelope a little bit more each time we acted something out. \n\nHowever, this time I was in a class with mostly 11 and 12 year old girls, and it had been a year since the last class, which had probably been plenty of time for my adolescent mind to grow into a more twisted humor. \n\nSo we were in class, and were finally getting past all of the introductory stuff. The time came for us to do our first improv act, which had three people, each of us assuming a random character. I volunteered, eager to hopefully get some laughs again and hopefully encourage some other people to get up as well. We went around and the characters were, a Leprechaun, a police officer, and Nancy Drew, the *beloved teen detective.* \n\nNow, for whatever reason, I was left with Nancy Drew, despite being the only male. I was fine with this though because I thought I had such a good act planned. **However** my expectations soon became an illusion, because of my mom's incessant viewing of HLN when I was in middle school. My mom loved to keep up with the Jodi Arias trial, and HLN had 24/7 coverage of that shit. Nancy Grace was the prime time name, and for those who don't know, she is an extremely over the top, passionate, and former prosecuting nutjob. She pretty much assumes guilt for any perpetrator in a newsworthy case, and loves to side with the victim. I would subliminally hear things from the TVs in the house talking about murder and ridiculous crimes that she just got so whipped up about, and I thought that was funny, still do.  I found this as an opportunity to satirize Nancy Grace, which again, was confused with Nancy Drew...\n\nSo anyways, I wait to find my way into this thing. The urge to jump out of the gate was strong, but I knew I could make it work. As the police officer's gears begin to move, he says something along the lines of 'hmmm, so you're sure you haven't seen the missing gold?' \n\nThis is where I let out the \"bombshell tonight\" performance. I start questioning this Leprechaun like he murdered Nicole Brown and Ron Goldman. Shit starts getting really heavy in the room. I start by agreeing with the cop and sternly asking where he was on the night of whatever date, and when he tried to think of an answer, I yelled \"I KNOW YOU STOLE THAT WOMAN'S GOLD AND DUMPED HER AND HER CHILDREN IN THE RIVER, YOU MONSTER!\" \n\nThe cop and the Leprechaun just kinda stood there for a second, and then the cop finally adjusted his gaze to the Leprechaun, yearning for a response to break the fucking cloud of awkward silence. He opened his mouth and said, \"I- I don't know what you-,\" to which I interrupt with, \"How could you just drive her full car into those COLD UNFORGIVING waters, the kids would drown so slowly! I know you're bs'ing me, YOU DID THIS!\" \n\nAt this point, the two were just befuddled with that I was trying to do, and as I looked around, I just kinda saw everyone looking uncomfortable, staring at Nancy Drew, wondering what was up her ass. I didn't really know what to do at that point, so I glanced by the teacher, who also didn't look too comfortable. As we made eye contact, she kinda shut it down and said thanks for coming up, but we only have 10 minutes and more people wanna go. \n\nAt this point, I am confused as all hell, and then started thinking maybe people didn't know who Nancy Grace was. So I asked someone if they knew who she was, to which they replied \"you mean Nancy Drew?\" At that moment my heart sunk in my chest, as I realized that now everyone thought I was this complete fucking psychopath. After the next act I kind of raised my hand and told her timidly about my confusion, she just kinda looked at me...and then went on to the next person. I didn't get called to do improv again for the rest of the year. I was scarred from embarrassment, but I'm pretty sure I also made a 6th grade girl cry, so I honestly don't know what I did to her...\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "L", "id": "652nxx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 49, "report_reasons": null, "author": "MinerDodec", "saved": false, "mod_reports": [], "name": "t3_652nxx", "subreddit_name_prefixed": "r/tifu", "approved_by": null, "over_18": false, "domain": "self.tifu", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2to41", "edited": false, "link_flair_css_class": "L", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/tifu/comments/652nxx/tifu_by_confusing_nancy_grace_with_nancy_drew/", "num_reports": null, "locked": false, "stickied": false, "created": 1492077753.0, "url": "https://www.reddit.com/r/tifu/comments/652nxx/tifu_by_confusing_nancy_grace_with_nancy_drew/", "author_flair_text": null, "quarantine": false, "title": "TIFU by confusing Nancy Grace with Nancy Drew", "created_utc": 1492048953.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 49}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_652nxx", "likes": null, "replies": "", "user_reports": [], "id": "dg763ap", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "CoopairSwoon", "parent_id": "t3_652nxx", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Maybe she was crying because she couldn't bare how good your performance was.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe she was crying because she couldn&amp;#39;t bare how good your performance was.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg763ap", "score_hidden": false, "stickied": false, "created": 1492088080.0, "created_utc": 1492059280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_652nxx", "likes": null, "replies": "", "user_reports": [], "id": "dg7tqog", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "SaintPatrice37", "parent_id": "t3_652nxx", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "It was a solid performance either way honestly. Bravo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was a solid performance either way honestly. Bravo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg7tqog", "score_hidden": false, "stickied": false, "created": 1492130722.0, "created_utc": 1492101922.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_652nxx", "likes": null, "replies": "", "user_reports": [], "id": "dg7u5x9", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Leet_Noob", "parent_id": "t3_652nxx", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Eh, sounds like a pretty strong scene opener to me. Didn't they learn to say yes and?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh, sounds like a pretty strong scene opener to me. Didn&amp;#39;t they learn to say yes and?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg7u5x9", "score_hidden": false, "stickied": false, "created": 1492131172.0, "created_utc": 1492102372.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_652nxx", "likes": null, "replies": "", "user_reports": [], "id": "dgcqwdy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShadowRose9", "parent_id": "t3_652nxx", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Haha oh my god that actually sounds pretty hilarious to me tbh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha oh my god that actually sounds pretty hilarious to me tbh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dgcqwdy", "score_hidden": false, "stickied": false, "created": 1492413852.0, "created_utc": 1492385052.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]