[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "tifu", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The building I live in is rather old and dealing with insects is a common issue especially as spring starts to warm things up. It&amp;#39;s normal that the ants start coming back when it gets warmer out, but for whatever reason, they came back with a vengeance this year. My wife was grossed out by it and so, last week, I decided to do something about it. I figured I could do some research to find effective and organic ways to get rid of these pests without having to involve an exterminator even though that route worked on and off in the past. On top of that, our new neighbors have pets and I wouldn&amp;#39;t want pesticides sprayed everywhere that could harm them. So, using my google skills, I managed to find a solution that seemed viable. I came across something called Diatomaceous Earth (DE) which is a white powder that is described as &lt;em&gt;&amp;quot;a natural pest control that is great to use around your home because it&amp;#39;s natural and safe.&amp;quot;&lt;/em&gt; Further research into this product revealed that DE is made from the fossilized remains of tiny, aquatic organisms called diatoms and is made up of their microscopic exoskeletal remains that contain silica. &lt;/p&gt;\n\n&lt;p&gt;After reading up, watching videos, and then checking reviews about DE, I opted to buy a bag for $20. Basically, my understanding was that it is a fine powder that looks like flour, but on a microscopic level, it&amp;#39;s like shards of glass. It affects insects by sticking to the waxy surface of their bodies and then enters their system through the tiny pores on their bodies and dries them out from the inside. I figured for $20, I could give it a shot, and if it worked, great! If not, oh well, I&amp;#39;ll just call the landlord and schedule something with an exterminator. &lt;/p&gt;\n\n&lt;p&gt;So, a few days after ordering a 10lb bag of DE, it arrived. This was was 2 weeks ago now. When the supplies arrived, I explained the plan to my wife my plan for getting rid of the ant problem. The agreed upon course of action was to start on Sunday night before turning in for bed. I&amp;#39;d open the bag of DE and spread the powder over all the surfaces on the first level of our place. Then, we&amp;#39;d let it sit for a day. On Tuesday, I&amp;#39;d vacuum it up and we&amp;#39;d be done. So, when Sunday night arrived, before bed I grabbed a 12oz cup and started scooping out full cups of DE and spreading it across our carpet. I must have used about 2 lbs of the stuff, and then spread it out evenly using a push broom. By the time I was finished, the carpet looked like a white sandy beach in the Carribean with little mounds of powder all over the floor. I let it sit overnight and went to bed.&lt;/p&gt;\n\n&lt;p&gt;The next day, my wife and I went to work unaware of my major fuck up. When we got home, we opted to go out for dinner to avoided dealing with the white powdery mess throughout the 1st floor of our place. We wanted to allow the DE to really settle into the carpet. When we got back from dinner, I decided I might start the cleanup that night to help mitigate the vacuuming scheduled for Tuesday evening. This is where I realized I royally screwed up. I started by going around with a broom and dustpan and scooped up the larger piles of white powder. After dumping them in the trash, I got the vacuum and started in one room. At first, the vacuum was sucking up all of the fine powder on the ground, but after the first couple of minutes, the dust it that was kicking up into the air was unbearable. The bag of DE states that Food Grade DE isn&amp;#39;t considered dangerous but you should not breathe it in as it is a lung irritant.  It also states that it is &amp;quot;food grade&amp;quot; and safe for consumption as a dietary supplement. Now I don&amp;#39;t know if I&amp;#39;d ever consume the stuff, but remembering that I shouldn&amp;#39;t breathe it in, I grabbed a dust mask and continued with the vacuum. As I attempted to clean the place, the cloud of dust turned into a thick hazy mist that you couldn&amp;#39;t clearly see through. Basically, it looked like you were walking into a cloud of fog, but it was indoors. Since I had a dusk mask on I figured I was ok, so I continued with the vacuum until it stopped. It turns out that DE is very tough on standard vacuums and the motor was caked with the powder. The filter was coated in powder as well and the unit was overheating. Basically, the vacuum shutdown before it destroyed itself. Since the DE dust was taking a toll on the vacuum and at this point, I called it a night. &lt;/p&gt;\n\n&lt;p&gt;I let the dust settle for the next 20 hours and on Tuesday night, I continued with the cleanup. Before starting, I took apart the vacuum, cleaned out the filter, the motor, etc, and got it working again. This was an unnecessary waste of time, because about 20 minutes into using the vacuum again, it started to overheat. The DE dust was overpowering the vacuum, and I really only accomplished stirring up the dust throughout the downstairs again. Knowing this was not going to work, I cleaned out the vacuum again and then put it back in storage into our utility closet. Realizing now that I needed a better solution to get the job done, I did some more research online and found out that I had made a big mistake in my approach to using DE. Apparently, a light dusting using a salt shaker would have been plenty to use, but instead, I was throwing 12oz cups of the stuff around the room. I used WAY TOO MUCH! According to some sites, the best way to get DE out of the carpet would be to rent a carpet cleaner or use a shop vac. Luckily, I have a Bissel carpet cleaner! So on Wednesday night, continuing with this saga of getting rid of ants where I inadvertently &amp;#39;bug bombed&amp;#39; my place, I broke out the Bissel and went to work. It too kicked up some dust, but with the combination of using hot water, I was able to get the DE out of all the carpets! Stupidly, I didn&amp;#39;t wear my dust mask this time around, and when I went to bed, could feel my sinuses were irritated and my throat was sore. Three days of breathing this stuff had taken a toll on me.&lt;/p&gt;\n\n&lt;p&gt;On Thursday, the rug was clean, but my throat was very sore. That and all of our belongings and furniture were coated in a fine white powder. After days of stirring up the DE powder and creating clouds of dust throughout our house, EVERYTHING was covered in it! My wife was not pleased and basically told me that I created the mess so I had to clean it. This meant that I now had to dust the entire place. Every single nicknack, shelf, piece of furniture, and crevice needed to be wiped down. Also, I had to use my air compressor to blow out my computers, refrigerator, air vents, and basically anything that had a cooling fan in it. It took hours! I can say though that our place has never been cleaner. &lt;/p&gt;\n\n&lt;p&gt;The ultimate result of this fuck up was that after all was said and done, my sinuses were so dried out, it almost hurt to breathe through my nose. Also, my throat was sore for all the dust. Even though I wore a dust mask for most of it, I definitely inhaled the stuff enough to the point that it was bothersome. So I used a Netti pot to wash out my sinuses and this is when I realized something was wrong. When I blew my nose, the mucus came out bloody. If I coughed up some mucus my body was producing as a result of the dust, there were traces of blood in it. My wife freaked out because she read up about DE and the commercial stuff is basically like asbestos and contains 30% silicate. The stuff I got was food grade and is not considered dangerous, but she insisted I see a doctor because of the blood that was in my mucus. So, I did see a doctor and the end result was that if it continued for a few more days, I should go back. Luckily it lasted for about 1-2 days and stopped. I feel much better now and the sore throat and dried out sinuses have subsided. I was advised as well that I should use a better mask if working on any project like this again in the future. All in all, a simple plan to get rid of some ants lead to me inhaling a known lung irritant causing my sinuses to bleed. The good news is we haven&amp;#39;t had any ants since I started working on this project!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR - I took it upon myself to get rid of ants using an organic product and ended up having to see a doctor becuase I inhaled too much of the &amp;#39;safe&amp;#39; pesticide.&lt;/strong&gt; &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The building I live in is rather old and dealing with insects is a common issue especially as spring starts to warm things up. It's normal that the ants start coming back when it gets warmer out, but for whatever reason, they came back with a vengeance this year. My wife was grossed out by it and so, last week, I decided to do something about it. I figured I could do some research to find effective and organic ways to get rid of these pests without having to involve an exterminator even though that route worked on and off in the past. On top of that, our new neighbors have pets and I wouldn't want pesticides sprayed everywhere that could harm them. So, using my google skills, I managed to find a solution that seemed viable. I came across something called Diatomaceous Earth (DE) which is a white powder that is described as *\"a natural pest control that is great to use around your home because it's natural and safe.\"* Further research into this product revealed that DE is made from the fossilized remains of tiny, aquatic organisms called diatoms and is made up of their microscopic exoskeletal remains that contain silica. \n\nAfter reading up, watching videos, and then checking reviews about DE, I opted to buy a bag for $20. Basically, my understanding was that it is a fine powder that looks like flour, but on a microscopic level, it's like shards of glass. It affects insects by sticking to the waxy surface of their bodies and then enters their system through the tiny pores on their bodies and dries them out from the inside. I figured for $20, I could give it a shot, and if it worked, great! If not, oh well, I'll just call the landlord and schedule something with an exterminator. \n\nSo, a few days after ordering a 10lb bag of DE, it arrived. This was was 2 weeks ago now. When the supplies arrived, I explained the plan to my wife my plan for getting rid of the ant problem. The agreed upon course of action was to start on Sunday night before turning in for bed. I'd open the bag of DE and spread the powder over all the surfaces on the first level of our place. Then, we'd let it sit for a day. On Tuesday, I'd vacuum it up and we'd be done. So, when Sunday night arrived, before bed I grabbed a 12oz cup and started scooping out full cups of DE and spreading it across our carpet. I must have used about 2 lbs of the stuff, and then spread it out evenly using a push broom. By the time I was finished, the carpet looked like a white sandy beach in the Carribean with little mounds of powder all over the floor. I let it sit overnight and went to bed.\n\nThe next day, my wife and I went to work unaware of my major fuck up. When we got home, we opted to go out for dinner to avoided dealing with the white powdery mess throughout the 1st floor of our place. We wanted to allow the DE to really settle into the carpet. When we got back from dinner, I decided I might start the cleanup that night to help mitigate the vacuuming scheduled for Tuesday evening. This is where I realized I royally screwed up. I started by going around with a broom and dustpan and scooped up the larger piles of white powder. After dumping them in the trash, I got the vacuum and started in one room. At first, the vacuum was sucking up all of the fine powder on the ground, but after the first couple of minutes, the dust it that was kicking up into the air was unbearable. The bag of DE states that Food Grade DE isn't considered dangerous but you should not breathe it in as it is a lung irritant.  It also states that it is \"food grade\" and safe for consumption as a dietary supplement. Now I don't know if I'd ever consume the stuff, but remembering that I shouldn't breathe it in, I grabbed a dust mask and continued with the vacuum. As I attempted to clean the place, the cloud of dust turned into a thick hazy mist that you couldn't clearly see through. Basically, it looked like you were walking into a cloud of fog, but it was indoors. Since I had a dusk mask on I figured I was ok, so I continued with the vacuum until it stopped. It turns out that DE is very tough on standard vacuums and the motor was caked with the powder. The filter was coated in powder as well and the unit was overheating. Basically, the vacuum shutdown before it destroyed itself. Since the DE dust was taking a toll on the vacuum and at this point, I called it a night. \n\nI let the dust settle for the next 20 hours and on Tuesday night, I continued with the cleanup. Before starting, I took apart the vacuum, cleaned out the filter, the motor, etc, and got it working again. This was an unnecessary waste of time, because about 20 minutes into using the vacuum again, it started to overheat. The DE dust was overpowering the vacuum, and I really only accomplished stirring up the dust throughout the downstairs again. Knowing this was not going to work, I cleaned out the vacuum again and then put it back in storage into our utility closet. Realizing now that I needed a better solution to get the job done, I did some more research online and found out that I had made a big mistake in my approach to using DE. Apparently, a light dusting using a salt shaker would have been plenty to use, but instead, I was throwing 12oz cups of the stuff around the room. I used WAY TOO MUCH! According to some sites, the best way to get DE out of the carpet would be to rent a carpet cleaner or use a shop vac. Luckily, I have a Bissel carpet cleaner! So on Wednesday night, continuing with this saga of getting rid of ants where I inadvertently 'bug bombed' my place, I broke out the Bissel and went to work. It too kicked up some dust, but with the combination of using hot water, I was able to get the DE out of all the carpets! Stupidly, I didn't wear my dust mask this time around, and when I went to bed, could feel my sinuses were irritated and my throat was sore. Three days of breathing this stuff had taken a toll on me.\n\nOn Thursday, the rug was clean, but my throat was very sore. That and all of our belongings and furniture were coated in a fine white powder. After days of stirring up the DE powder and creating clouds of dust throughout our house, EVERYTHING was covered in it! My wife was not pleased and basically told me that I created the mess so I had to clean it. This meant that I now had to dust the entire place. Every single nicknack, shelf, piece of furniture, and crevice needed to be wiped down. Also, I had to use my air compressor to blow out my computers, refrigerator, air vents, and basically anything that had a cooling fan in it. It took hours! I can say though that our place has never been cleaner. \n\nThe ultimate result of this fuck up was that after all was said and done, my sinuses were so dried out, it almost hurt to breathe through my nose. Also, my throat was sore for all the dust. Even though I wore a dust mask for most of it, I definitely inhaled the stuff enough to the point that it was bothersome. So I used a Netti pot to wash out my sinuses and this is when I realized something was wrong. When I blew my nose, the mucus came out bloody. If I coughed up some mucus my body was producing as a result of the dust, there were traces of blood in it. My wife freaked out because she read up about DE and the commercial stuff is basically like asbestos and contains 30% silicate. The stuff I got was food grade and is not considered dangerous, but she insisted I see a doctor because of the blood that was in my mucus. So, I did see a doctor and the end result was that if it continued for a few more days, I should go back. Luckily it lasted for about 1-2 days and stopped. I feel much better now and the sore throat and dried out sinuses have subsided. I was advised as well that I should use a better mask if working on any project like this again in the future. All in all, a simple plan to get rid of some ants lead to me inhaling a known lung irritant causing my sinuses to bleed. The good news is we haven't had any ants since I started working on this project!\n\n**TL;DR - I took it upon myself to get rid of ants using an organic product and ended up having to see a doctor becuase I inhaled too much of the 'safe' pesticide.** \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65dk41", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 25, "report_reasons": null, "author": "cswimc", "saved": false, "mod_reports": [], "name": "t3_65dk41", "subreddit_name_prefixed": "r/tifu", "approved_by": null, "over_18": false, "domain": "self.tifu", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2to41", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/tifu/comments/65dk41/tifu_by_trying_to_get_rid_of_ants_organically/", "num_reports": null, "locked": false, "stickied": false, "created": 1492216390.0, "url": "https://www.reddit.com/r/tifu/comments/65dk41/tifu_by_trying_to_get_rid_of_ants_organically/", "author_flair_text": null, "quarantine": false, "title": "TIFU by trying to get rid of ants organically", "created_utc": 1492187590.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65dk41", "likes": null, "replies": "", "user_reports": [], "id": "dg9eexc", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "_Wartoaster_", "parent_id": "t3_65dk41", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "OH man as soon as you busted out the vacuum I knew what was gonna happen. \n\nWe use DE as a pool filter supplement (it clogs the pores of the filter and makes them even finer) and I know firsthand how easily it can kill a ShopVac ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OH man as soon as you busted out the vacuum I knew what was gonna happen. &lt;/p&gt;\n\n&lt;p&gt;We use DE as a pool filter supplement (it clogs the pores of the filter and makes them even finer) and I know firsthand how easily it can kill a ShopVac &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg9eexc", "score_hidden": false, "stickied": false, "created": 1492217635.0, "created_utc": 1492188835.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65dk41", "likes": null, "replies": "", "user_reports": [], "id": "dg9mnjm", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "DrunkenSpoonyBard", "parent_id": "t3_65dk41", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "&gt;but on a microscopic level, it's like shards of glass\n\nAnd you were surprised that you were getting blood out of your sinuses?\n\nIf you don't have pets, small children, or adults who like to shove poisonous things into their faces, something else you can try for ants: put out bowls of borax mixed with powdered sugar where you tend to see them most. The ants think it's Super Delicious Food and carry it back to the nest, resulting in ant genocide. Supposedly putting a line of cinnamon powder along the thresholds of where they're coming in also works, but I can't attest to the success rate of that one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;but on a microscopic level, it&amp;#39;s like shards of glass&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And you were surprised that you were getting blood out of your sinuses?&lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t have pets, small children, or adults who like to shove poisonous things into their faces, something else you can try for ants: put out bowls of borax mixed with powdered sugar where you tend to see them most. The ants think it&amp;#39;s Super Delicious Food and carry it back to the nest, resulting in ant genocide. Supposedly putting a line of cinnamon powder along the thresholds of where they&amp;#39;re coming in also works, but I can&amp;#39;t attest to the success rate of that one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg9mnjm", "score_hidden": false, "stickied": false, "created": 1492227357.0, "created_utc": 1492198557.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65dk41", "likes": null, "replies": "", "user_reports": [], "id": "dg9hlg8", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Krytan", "parent_id": "t3_65dk41", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "You don't spread it all over your carpet. You put a small line of it where you think ants are getting in : in front of doors, on windowskills, baseboards, etc. \n\nAlso leaving it there for 1 or 2 days won't accomplish anything. \n\nInstead of DE I recommend you try using corn starch instead. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t spread it all over your carpet. You put a small line of it where you think ants are getting in : in front of doors, on windowskills, baseboards, etc. &lt;/p&gt;\n\n&lt;p&gt;Also leaving it there for 1 or 2 days won&amp;#39;t accomplish anything. &lt;/p&gt;\n\n&lt;p&gt;Instead of DE I recommend you try using corn starch instead. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg9hlg8", "score_hidden": false, "stickied": false, "created": 1492221301.0, "created_utc": 1492192501.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65dk41", "likes": null, "replies": "", "user_reports": [], "id": "dg9ngcd", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "StavTL", "parent_id": "t3_65dk41", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Also all it does is kill the ants there, if you kill 1000 the queen will just lay another 1000 eggs. Impossible to get rid of unless you kill the queen. Source - suffered them for years could never get the queen so we had building work done to knock down the pillar they were housed in, found the nest and burnt it with a blow torch... ants never came back ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also all it does is kill the ants there, if you kill 1000 the queen will just lay another 1000 eggs. Impossible to get rid of unless you kill the queen. Source - suffered them for years could never get the queen so we had building work done to knock down the pillar they were housed in, found the nest and burnt it with a blow torch... ants never came back &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg9ngcd", "score_hidden": false, "stickied": false, "created": 1492228320.0, "created_utc": 1492199520.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65dk41", "likes": null, "replies": "", "user_reports": [], "id": "dgajrzv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Enilwyn", "parent_id": "t3_65dk41", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Ants actually hate cinnamon. Spiders hate peppermint. Both smell delicious and won't kill you. Get some spice/oil dilute it in a spray bottle and hit your sills and doorways. Kid/pet/self friendly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ants actually hate cinnamon. Spiders hate peppermint. Both smell delicious and won&amp;#39;t kill you. Get some spice/oil dilute it in a spray bottle and hit your sills and doorways. Kid/pet/self friendly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dgajrzv", "score_hidden": false, "stickied": false, "created": 1492284100.0, "created_utc": 1492255300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65dk41", "likes": null, "replies": "", "user_reports": [], "id": "dgaaq8x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thebestsamoyed", "parent_id": "t3_65dk41", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Honey.....just go get baby powder. We have the same problem during the rainy season - just sprinkle baby powder where they come in and replace it once or twice a week until they go away.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honey.....just go get baby powder. We have the same problem during the rainy season - just sprinkle baby powder where they come in and replace it once or twice a week until they go away.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dgaaq8x", "score_hidden": false, "stickied": false, "created": 1492260339.0, "created_utc": 1492231539.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65dk41", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65dk41", "likes": null, "replies": "", "user_reports": [], "id": "dg9yviz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lad44", "parent_id": "t1_dg9nv2f", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "You look like you struggle with simple tasks. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You look like you struggle with simple tasks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg9yviz", "score_hidden": false, "stickied": false, "created": 1492242948.0, "created_utc": 1492214148.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9nv2f", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "LORDLRRD", "parent_id": "t3_65dk41", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "TIFU by reading a TIFU post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;TIFU by reading a TIFU post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg9nv2f", "score_hidden": false, "stickied": false, "created": 1492228808.0, "created_utc": 1492200008.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]