[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "tifu", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So today I was making dinner - a nice piece of venison with roasted potatoes, mushrooms and green beans. I cook often so I knew what I needed to do and everything was going great. After about an hour the potatoes are crunchy and golden, all the vegetables are done and the venison is resting on a plate, so it was time to start on the cranberry gravy. &lt;/p&gt;\n\n&lt;p&gt;I had some nice french brandy that I wanted to use to deglaze the pan that the venison was cooked in... perhaps you can see where this is going. I&amp;#39;ve done this hundreds of times at this point and I didn&amp;#39;t think anything of it. The one idiot mistake I made is that I turned the flames to high just before I poured in the brandy. I have no idea why I decided this was a good idea, but almost instantly the fumes ignited and an absolutely massive flame blasted up and started to lick at the top of the extractor fan filters. Now, the filter is fucking filthy with grease, so of course this also bursts into flames. Oh shit. The pan is moved out of the way as quickly as possible and the filter thrown in the sink before I see that the actual motor inside the extractor is also on fire. What the fuck.&lt;/p&gt;\n\n&lt;p&gt;Thankfully after turning off the fan the flames died fairly quickly. Both sides of the motor ended up melting, part of the wiring was burnt through and it now makes a loud clicking sound whenever it&amp;#39;s turned on. But wait, there&amp;#39;s more! I went out to the side of the house just to make sure it wasn&amp;#39;t actively on fire and I found the plastic vent panels had blasted off the wall and were completely bent and misshapen. That means a fireball literally blasted through the side of the house. I looked in the pipe that connects the vent to the fan and it was covered in grease but luckily it wasn&amp;#39;t actively on fire. The motor will have to be replaced which is a nice £150 mistake.&lt;/p&gt;\n\n&lt;p&gt;My main takeaway from this situation is to be really fucking careful when cooking with alcohol - turn the flames to low and make sure your extractor fan is cleaned regularly. Sometimes it&amp;#39;s easy to become complacent when you&amp;#39;ve done something a number of times but one tiny mistake can explode into a huge flaming problem. It&amp;#39;s genuinely lucky that the entire house didn&amp;#39;t burn down. &lt;/p&gt;\n\n&lt;p&gt;The food was delicious by the way. &lt;/p&gt;\n\n&lt;p&gt;TL;DR Alcohol make fire. Fire hot! Fire melt extractor fan motor. Fire bad! Now motor sad :( Exploding vents! This story has everything. Also, food good.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So today I was making dinner - a nice piece of venison with roasted potatoes, mushrooms and green beans. I cook often so I knew what I needed to do and everything was going great. After about an hour the potatoes are crunchy and golden, all the vegetables are done and the venison is resting on a plate, so it was time to start on the cranberry gravy. \n\nI had some nice french brandy that I wanted to use to deglaze the pan that the venison was cooked in... perhaps you can see where this is going. I've done this hundreds of times at this point and I didn't think anything of it. The one idiot mistake I made is that I turned the flames to high just before I poured in the brandy. I have no idea why I decided this was a good idea, but almost instantly the fumes ignited and an absolutely massive flame blasted up and started to lick at the top of the extractor fan filters. Now, the filter is fucking filthy with grease, so of course this also bursts into flames. Oh shit. The pan is moved out of the way as quickly as possible and the filter thrown in the sink before I see that the actual motor inside the extractor is also on fire. What the fuck.\n\nThankfully after turning off the fan the flames died fairly quickly. Both sides of the motor ended up melting, part of the wiring was burnt through and it now makes a loud clicking sound whenever it's turned on. But wait, there's more! I went out to the side of the house just to make sure it wasn't actively on fire and I found the plastic vent panels had blasted off the wall and were completely bent and misshapen. That means a fireball literally blasted through the side of the house. I looked in the pipe that connects the vent to the fan and it was covered in grease but luckily it wasn't actively on fire. The motor will have to be replaced which is a nice £150 mistake.\n\nMy main takeaway from this situation is to be really fucking careful when cooking with alcohol - turn the flames to low and make sure your extractor fan is cleaned regularly. Sometimes it's easy to become complacent when you've done something a number of times but one tiny mistake can explode into a huge flaming problem. It's genuinely lucky that the entire house didn't burn down. \n\nThe food was delicious by the way. \n\nTL;DR Alcohol make fire. Fire hot! Fire melt extractor fan motor. Fire bad! Now motor sad :( Exploding vents! This story has everything. Also, food good.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M", "id": "65frb6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 27, "report_reasons": null, "author": "49th", "saved": false, "mod_reports": [], "name": "t3_65frb6", "subreddit_name_prefixed": "r/tifu", "approved_by": null, "over_18": false, "domain": "self.tifu", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2to41", "edited": false, "link_flair_css_class": "M", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/tifu/comments/65frb6/tifu_by_almost_igniting_the_entire_kitchen_while/", "num_reports": null, "locked": false, "stickied": false, "created": 1492238653.0, "url": "https://www.reddit.com/r/tifu/comments/65frb6/tifu_by_almost_igniting_the_entire_kitchen_while/", "author_flair_text": null, "quarantine": false, "title": "TIFU by almost igniting the entire kitchen while making gravy", "created_utc": 1492209853.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65frb6", "likes": null, "replies": "", "user_reports": [], "id": "dg9wv0k", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "DrunkenSpoonyBard", "parent_id": "t3_65frb6", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "I love your tl;dr and I want your recipe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love your tl;dr and I want your recipe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dg9wv0k", "score_hidden": false, "stickied": false, "created": 1492240287.0, "created_utc": 1492211487.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}]
