[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "tifu", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I write this as a sit at my work desk, this fuck up occurring last night into this morning. &lt;/p&gt;\n\n&lt;p&gt;Last night my friend had a show at a small club that just opened up nearby campus, and he was trying to get everyone who hadn&amp;#39;t already left for Easter weekend in attendance. Having no money until my next paycheck and tax returns, I was not going to go to this event, until a friend offered to pay for me. Once he offered, I began to pregame by drinking what was left of my handle of vodka. I went to the show (which was pretty good, I&amp;#39;ve gotta give it to him) and hung out with my friends who were there. Afterward, my friend threw an after-party at his apartment. I went to that as well, which resulted in me getting moderately drunk, smoking cigarettes (I never smoke, so this is how I guage how drunk I was), and eventually doing a little blow. At the end of the night when everything was clearing out, I gathered up my friends from home who were staying at my place, a couple girls, then we left. I took a free line of blow on the way out for good measure, because why not. Back at my apartment we played cards against humanity until I said I was going to bed so I could work in the morning...I guess this is where my fuck-up happens. &lt;/p&gt;\n\n&lt;p&gt;I take the girl I was with to my room, where I set an alarm before proceeding to engage in shenanigans. Shortly after, I fall asleep. In the morning, I wake up to my friends asking if I can move my car so they can get out of the driveway. Fuck. If they&amp;#39;re up that means I&amp;#39;m late to work, since I was expecting to be up much earlier than everyone. I ask them what time it is and get the response &amp;quot;I don&amp;#39;t know...late.&amp;quot; It was nearly 10am. I was supposed to be at work by 7 to monitor the place. I apparently either never switched my loud-ass alarm to &amp;quot;on&amp;quot; or I turned it off in my half-drunken state of mind in the morning. &lt;/p&gt;\n\n&lt;p&gt;I work at a little fitness facility where individuals (mostly older) exercise to combat conditions such as hypertension, etc. I arrive and there are already members exercising since they are able to swipe in with their members card and get in the side door. I have not received any calls or texts from supervisors asking where I was, or when I&amp;#39;d be showing up. I was supoosed to be the only one working for the day. Now I don&amp;#39;t know what to do, and I&amp;#39;m sure there are a couple members who noticed the front door remained locked and there was no one working. I suspect my supervisors may hear about this oddity from a member or two when they come work on Monday, so I&amp;#39;m frantically trying to think of how to explain this to my boss before she hears it from someone else. I plan on owning up to my fuck-up, but don&amp;#39;t have many thoughts on how to approach the situation. I plan on texting her after my shift concludes, saying I was late and my that my time sheet should be adjusted accordingly (they have already been turned in). Once I leave, I will be heading home to spend the weekend with my family for the upcoming holiday. Until then, I remain here at my desk, thinking of how I&amp;#39;m going to approach the situation with my boss. &lt;/p&gt;\n\n&lt;p&gt;Side note: I wasn&amp;#39;t even supposed to have this shift, I am covering for a coworker and good friend who lives farther away and needed to be home for an early holiday dinner. &lt;/p&gt;\n\n&lt;p&gt;TL:DR\nI went to my friend&amp;#39;s show off campus, got wriggity wriggity wrecked, was 3 hours late to work the next morning.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I write this as a sit at my work desk, this fuck up occurring last night into this morning. \n\nLast night my friend had a show at a small club that just opened up nearby campus, and he was trying to get everyone who hadn't already left for Easter weekend in attendance. Having no money until my next paycheck and tax returns, I was not going to go to this event, until a friend offered to pay for me. Once he offered, I began to pregame by drinking what was left of my handle of vodka. I went to the show (which was pretty good, I've gotta give it to him) and hung out with my friends who were there. Afterward, my friend threw an after-party at his apartment. I went to that as well, which resulted in me getting moderately drunk, smoking cigarettes (I never smoke, so this is how I guage how drunk I was), and eventually doing a little blow. At the end of the night when everything was clearing out, I gathered up my friends from home who were staying at my place, a couple girls, then we left. I took a free line of blow on the way out for good measure, because why not. Back at my apartment we played cards against humanity until I said I was going to bed so I could work in the morning...I guess this is where my fuck-up happens. \n\nI take the girl I was with to my room, where I set an alarm before proceeding to engage in shenanigans. Shortly after, I fall asleep. In the morning, I wake up to my friends asking if I can move my car so they can get out of the driveway. Fuck. If they're up that means I'm late to work, since I was expecting to be up much earlier than everyone. I ask them what time it is and get the response \"I don't know...late.\" It was nearly 10am. I was supposed to be at work by 7 to monitor the place. I apparently either never switched my loud-ass alarm to \"on\" or I turned it off in my half-drunken state of mind in the morning. \n\nI work at a little fitness facility where individuals (mostly older) exercise to combat conditions such as hypertension, etc. I arrive and there are already members exercising since they are able to swipe in with their members card and get in the side door. I have not received any calls or texts from supervisors asking where I was, or when I'd be showing up. I was supoosed to be the only one working for the day. Now I don't know what to do, and I'm sure there are a couple members who noticed the front door remained locked and there was no one working. I suspect my supervisors may hear about this oddity from a member or two when they come work on Monday, so I'm frantically trying to think of how to explain this to my boss before she hears it from someone else. I plan on owning up to my fuck-up, but don't have many thoughts on how to approach the situation. I plan on texting her after my shift concludes, saying I was late and my that my time sheet should be adjusted accordingly (they have already been turned in). Once I leave, I will be heading home to spend the weekend with my family for the upcoming holiday. Until then, I remain here at my desk, thinking of how I'm going to approach the situation with my boss. \n\nSide note: I wasn't even supposed to have this shift, I am covering for a coworker and good friend who lives farther away and needed to be home for an early holiday dinner. \n\nTL:DR\nI went to my friend's show off campus, got wriggity wriggity wrecked, was 3 hours late to work the next morning.  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "M", "id": "65jk9k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 22, "report_reasons": null, "author": "KingGeorge725", "saved": false, "mod_reports": [], "name": "t3_65jk9k", "subreddit_name_prefixed": "r/tifu", "approved_by": null, "over_18": false, "domain": "self.tifu", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2to41", "edited": false, "link_flair_css_class": "M", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/tifu/comments/65jk9k/tifu_by_going_to_a_friends_concert/", "num_reports": null, "locked": false, "stickied": false, "created": 1492298136.0, "url": "https://www.reddit.com/r/tifu/comments/65jk9k/tifu_by_going_to_a_friends_concert/", "author_flair_text": null, "quarantine": false, "title": "TIFU by going to a friend's concert...", "created_utc": 1492269336.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65jk9k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65jk9k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65jk9k", "likes": null, "replies": "", "user_reports": [], "id": "dgbknm2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Darthballs42", "parent_id": "t1_dgbcv0r", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "What the fuck not the heated blanket lolololol some lessons are learned the hard way ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What the fuck not the heated blanket lolololol some lessons are learned the hard way &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dgbknm2", "score_hidden": false, "stickied": false, "created": 1492339680.0, "created_utc": 1492310880.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcv0r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "KingGeorge725", "parent_id": "t1_dgathg0", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Secondary fuck up within the original fuck up would be the fact that I was too drunk to think to do anything other than pull out and bust on my heated blanket and sheets, which I will now have to bring home and wash thoroughly", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Secondary fuck up within the original fuck up would be the fact that I was too drunk to think to do anything other than pull out and bust on my heated blanket and sheets, which I will now have to bring home and wash thoroughly&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dgbcv0r", "score_hidden": false, "stickied": false, "created": 1492328454.0, "created_utc": 1492299654.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgathg0", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Darthballs42", "parent_id": "t3_65jk9k", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Booty was worth it ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Booty was worth it &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dgathg0", "score_hidden": false, "stickied": false, "created": 1492301627.0, "created_utc": 1492272827.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65jk9k", "likes": null, "replies": "", "user_reports": [], "id": "dgatzix", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "gtaadventure", "parent_id": "t3_65jk9k", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Your mistake is when you state \"this is where my Fuck-up happens\".   It was well before that point. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your mistake is when you state &amp;quot;this is where my Fuck-up happens&amp;quot;.   It was well before that point. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dgatzix", "score_hidden": false, "stickied": false, "created": 1492302337.0, "created_utc": 1492273537.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65jk9k", "likes": null, "replies": "", "user_reports": [], "id": "dgawshe", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SecurityPanda", "parent_id": "t3_65jk9k", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Come up with a good reason for sleeping in. Don't try to lie, they'll can you for it if they catch you. Own up to it and apologize.\n\nUnless you've been an awful employee (or you have a habit of doing this) they'll appreciate your honesty and you'll probably be okay.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Come up with a good reason for sleeping in. Don&amp;#39;t try to lie, they&amp;#39;ll can you for it if they catch you. Own up to it and apologize.&lt;/p&gt;\n\n&lt;p&gt;Unless you&amp;#39;ve been an awful employee (or you have a habit of doing this) they&amp;#39;ll appreciate your honesty and you&amp;#39;ll probably be okay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dgawshe", "score_hidden": false, "stickied": false, "created": 1492306215.0, "created_utc": 1492277415.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2to41", "removal_reason": null, "link_id": "t3_65jk9k", "likes": null, "replies": "", "user_reports": [], "id": "dgau8zb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HotKnifeUpAss", "parent_id": "t3_65jk9k", "subreddit_name_prefixed": "r/tifu", "controversiality": 0, "body": "Cocaine is a helluva drug.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cocaine is a helluva drug.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "tifu", "name": "t1_dgau8zb", "score_hidden": false, "stickied": false, "created": 1492302702.0, "created_utc": 1492273902.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]
