[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "yoga", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have limited range of motion in one of my shoulder blades due to scoliosis. Because of the curve in my thoracic spine the shoulder blade can&amp;#39;t be drawn into the center as much as normal (think of how the shoulders squeeze together in back during rows). This means that if I hold my arms straight out to my side in line with my body the left arm can be healthy and safe but my right arm has to come forward about 10 or 15 degrees to avoid putting stress across the tissues in the front of the joint (where the humerus and scapula).  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been to a physical therapist who helped me understand the mechanics of whats going on and has given me exercises to build and maintain healthy function. This has helped me better know where my limits are and to find adjustments that keep the shoulder happy and building strength.&lt;/p&gt;\n\n&lt;p&gt;But there are poses that I don&amp;#39;t think I&amp;#39;ll ever be able to do safely on my right side and others that are iffy and I&amp;#39;m not sure of how best to adjust. Of the ones I can&amp;#39;t do I&amp;#39;m not entirely sure of what alternative poses to work with instead.&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t do : Wild thing and flipped dog. The arm and shoulder have to move behind the line of my body while bearing weight. I&amp;#39;ve had a teacher recommend half camel as a way to get a similar chest and lateral stretch which does help, its easier to adjust the twist in my torso to keep my shoulder at a safe orientation and I&amp;#39;m not putting weight on it. Any other suggestions?&lt;/p&gt;\n\n&lt;p&gt;Iffy : Full camel, bow pose, others that involve reaching my arms behind me in similar ways. One sided versions can usually be okay if I&amp;#39;m able to twist my torso to the right (bring the arm forward). But full versions can easily stress the right shoulder joint. Thoughts?&lt;/p&gt;\n\n&lt;p&gt;Doable but could use advice : Side plank. The others above are nice to be able to do but I can cut them out of my practice if I have to. But core strength is important and side plank is a great tool for developing it. I can handle this if I shift my torso forward a bit so that my right arm is that 10 degrees forward but that looses some of the targeted strength and balance elements of the pose. Any other adjustments I might think about? Any alternative poses that can work the same parts of the core with less strain on my shoulder?&lt;/p&gt;\n\n&lt;p&gt;Thank you for any advice you can share.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have limited range of motion in one of my shoulder blades due to scoliosis. Because of the curve in my thoracic spine the shoulder blade can't be drawn into the center as much as normal (think of how the shoulders squeeze together in back during rows). This means that if I hold my arms straight out to my side in line with my body the left arm can be healthy and safe but my right arm has to come forward about 10 or 15 degrees to avoid putting stress across the tissues in the front of the joint (where the humerus and scapula).  \n\nI've been to a physical therapist who helped me understand the mechanics of whats going on and has given me exercises to build and maintain healthy function. This has helped me better know where my limits are and to find adjustments that keep the shoulder happy and building strength.\n\nBut there are poses that I don't think I'll ever be able to do safely on my right side and others that are iffy and I'm not sure of how best to adjust. Of the ones I can't do I'm not entirely sure of what alternative poses to work with instead.\n\nI won't do : Wild thing and flipped dog. The arm and shoulder have to move behind the line of my body while bearing weight. I've had a teacher recommend half camel as a way to get a similar chest and lateral stretch which does help, its easier to adjust the twist in my torso to keep my shoulder at a safe orientation and I'm not putting weight on it. Any other suggestions?\n\nIffy : Full camel, bow pose, others that involve reaching my arms behind me in similar ways. One sided versions can usually be okay if I'm able to twist my torso to the right (bring the arm forward). But full versions can easily stress the right shoulder joint. Thoughts?\n\nDoable but could use advice : Side plank. The others above are nice to be able to do but I can cut them out of my practice if I have to. But core strength is important and side plank is a great tool for developing it. I can handle this if I shift my torso forward a bit so that my right arm is that 10 degrees forward but that looses some of the targeted strength and balance elements of the pose. Any other adjustments I might think about? Any alternative poses that can work the same parts of the core with less strain on my shoulder?\n\nThank you for any advice you can share.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "656wlr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "Odran", "saved": false, "mod_reports": [], "name": "t3_656wlr", "subreddit_name_prefixed": "r/yoga", "approved_by": null, "over_18": false, "domain": "self.yoga", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhq6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/yoga/comments/656wlr/adjustments_and_alternatives_for_limited_shoulder/", "num_reports": null, "locked": false, "stickied": false, "created": 1492133053.0, "url": "https://www.reddit.com/r/yoga/comments/656wlr/adjustments_and_alternatives_for_limited_shoulder/", "author_flair_text": null, "quarantine": false, "title": "Adjustments and alternatives for limited shoulder mobility", "created_utc": 1492104253.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]