[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "yoga", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been doing yoga in my home alone for a few years and I&amp;#39;m ready to go to a studio, but I&amp;#39;ve got some pretty terrible social anxiety that holds me back. I have so many questions about this process. Once I know what to expect I will feel more comfortable with going. I plan to register online at a studio near my house which offers Vinyasa classes. I have a mat, blocks, appropriate clothes, and so on, but then what do I do? &lt;/p&gt;\n\n&lt;p&gt;Among what seems to be a never ending list of anxious worries, here are some specific questions I have about going to a yoga studio:&lt;/p&gt;\n\n&lt;p&gt;Is there a &amp;#39;front desk&amp;#39;? Do I need to check in? Are there different rooms? How do I know where I need to be and what do I do when I get there? Do I just pick a spot next to a stranger and unroll my yoga mat? If I get there early, do I just sit and wait? Will they even let you in if you&amp;#39;re early? Personal space etiquette? What if I have to pee or take a water break? Where do you store personal items like a purse: next to you? leave it in the car? car keys? Cell phone?  Do I tip the yoga instructor like you would after a hair cut? Is there anything I might do, as a newbie to studio yoga, that others would consider rude or annoying? When it&amp;#39;s over, do I just roll up my mat and evacuate? Will someone try to socialize with me before or after the class?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt; Can someone please explain (in as much detail possible) what happens from the moment you walk in the studio to the moment you leave?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been doing yoga in my home alone for a few years and I'm ready to go to a studio, but I've got some pretty terrible social anxiety that holds me back. I have so many questions about this process. Once I know what to expect I will feel more comfortable with going. I plan to register online at a studio near my house which offers Vinyasa classes. I have a mat, blocks, appropriate clothes, and so on, but then what do I do? \n\nAmong what seems to be a never ending list of anxious worries, here are some specific questions I have about going to a yoga studio:\n\nIs there a 'front desk'? Do I need to check in? Are there different rooms? How do I know where I need to be and what do I do when I get there? Do I just pick a spot next to a stranger and unroll my yoga mat? If I get there early, do I just sit and wait? Will they even let you in if you're early? Personal space etiquette? What if I have to pee or take a water break? Where do you store personal items like a purse: next to you? leave it in the car? car keys? Cell phone?  Do I tip the yoga instructor like you would after a hair cut? Is there anything I might do, as a newbie to studio yoga, that others would consider rude or annoying? When it's over, do I just roll up my mat and evacuate? Will someone try to socialize with me before or after the class?\n\n**TL;DR** Can someone please explain (in as much detail possible) what happens from the moment you walk in the studio to the moment you leave?\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ya0t", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 35, "report_reasons": null, "author": "That_Cupcake", "saved": false, "mod_reports": [], "name": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "approved_by": null, "over_18": false, "domain": "self.yoga", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhq6", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/yoga/comments/65ya0t/studio_yoga_and_social_anxiety_what_can_i_expect/", "num_reports": null, "locked": false, "stickied": false, "created": 1492491121.0, "url": "https://www.reddit.com/r/yoga/comments/65ya0t/studio_yoga_and_social_anxiety_what_can_i_expect/", "author_flair_text": null, "quarantine": false, "title": "Studio Yoga and Social Anxiety - What can I expect?", "created_utc": 1492462321.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 35}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dgejlcx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shartattak", "parent_id": "t1_dge603t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "+1! I ended up with two different teachers with mental healthcare / social work backgrounds, which helped so so so so much!! I briefly mentioned having a rough brain time in some social settings when I first came to each of their classes and they were really helpful in making an easy transition. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;+1! I ended up with two different teachers with mental healthcare / social work backgrounds, which helped so so so so much!! I briefly mentioned having a rough brain time in some social settings when I first came to each of their classes and they were really helpful in making an easy transition. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dgejlcx", "score_hidden": false, "stickied": false, "created": 1492510913.0, "created_utc": 1492482113.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge603t", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "porkcares", "parent_id": "t1_dge5uhm", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "Also read teachers bios! My bio says that I have anxiety and depression and that's why I practice. Other teachers will say they have trauma backgrounds and will be respectful to touching if that's not your thing. Check to see their style of teaching and who they studied with. If you don't vibe with the teacher know that there are SO many awesome teachers to try. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also read teachers bios! My bio says that I have anxiety and depression and that&amp;#39;s why I practice. Other teachers will say they have trauma backgrounds and will be respectful to touching if that&amp;#39;s not your thing. Check to see their style of teaching and who they studied with. If you don&amp;#39;t vibe with the teacher know that there are SO many awesome teachers to try. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dge603t", "score_hidden": false, "stickied": false, "created": 1492493850.0, "created_utc": 1492465050.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dge7lxy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "seh_23", "parent_id": "t1_dge6nfm", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "This list is great but just something to note: some studios do not let you bring bags or any personal belongings into the room (mine does not). Check the website or call beforehand to ask this specific studio what they allow if this will be an issue for you. You can always leave a purse in your car or in the change room. My studio has no lockers and I've been going there for 10 years and have not had a single thing stolen from the change room. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This list is great but just something to note: some studios do not let you bring bags or any personal belongings into the room (mine does not). Check the website or call beforehand to ask this specific studio what they allow if this will be an issue for you. You can always leave a purse in your car or in the change room. My studio has no lockers and I&amp;#39;ve been going there for 10 years and have not had a single thing stolen from the change room. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dge7lxy", "score_hidden": false, "stickied": false, "created": 1492495847.0, "created_utc": 1492467047.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge6nfm", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "That_Cupcake", "parent_id": "t1_dge5uhm", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "Thank you so much, this is very helpful. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much, this is very helpful. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dge6nfm", "score_hidden": false, "stickied": false, "created": 1492494653.0, "created_utc": 1492465853.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dgeiv94", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "patmasana", "parent_id": "t1_dge5uhm", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "&gt;  FUCK BIKRAM YOGA. \n\nCan I upvote this a million times? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;FUCK BIKRAM YOGA. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Can I upvote this a million times? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dgeiv94", "score_hidden": false, "stickied": false, "created": 1492510075.0, "created_utc": 1492481275.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dgefx5x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "aloveablebunny", "parent_id": "t1_dge5uhm", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "As a newcomer to yoga (who had her first hot yoga class a few hours ago), this is very helpful advice. Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a newcomer to yoga (who had her first hot yoga class a few hours ago), this is very helpful advice. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dgefx5x", "score_hidden": false, "stickied": false, "created": 1492506485.0, "created_utc": 1492477685.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dge5uhm", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "porkcares", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "Hi there! Yoga teacher &amp; student here. I have taken and taught at a few hundred studios so I can give you a good break down. As someone who also has social anxiety I am more than happy to help :)\n\n-Check to see if you can sign in and pay online. Many studios give you this option. \n-Show up about 15 minutes early. This will give you time to adjust, find the location, etc. This will also give you time to adjust to the space before students arrive. Some students arrive 10 minutes early.\n*Note: some studios have a reception area for coats and shoes, while others (and this is only 2 that I have been in is just one big studio without a reception). All have had bathrooms.\n-Once you arrive to the location there will be a place to hang up your coat and take off your shoes. It's yoga etiquette to take off your shoes. \n-Now, when you get to the front desk there will be a few different ways this can go. A) Sign your name up on a sheet or ipad depending on what they have B) Pay for a drop-in class and sign up for the class meaning you will have to talk to the front desk. No matter what since you are a new student they will have you fill out a form for your emergency address. Almost every single yoga studio will ask you for that. Some people at the front desk will just say \"bathrooms to the left, studio to the right, etc.\" others will ask if you want a tour of the place which is completely up to you. You can always say no thanks! \n-*When you arrive into the studio I would recommend bringing your bag/purse into the room. I never leave anything outside the actual yoga studio. I just leave everything near my mat. \n-Notice where the teacher will go, it will usually be in the front where there's an alter. You can go anywhere you would like - back corner, front corner, etc. I always like the back corner. If the room has a few people in there already the rule of thumb is middle school gym arms distance (where you put your arms out to a T and can't touch anyone). Some studios get more packed than others so just make an estimate. \n-When you set up grab a mat, blanket, bolster, blocks, usually the teacher will tell you what you need when they walk in \n-When the teacher DOES walk in (if they're not already there) they may walk up to you and ask you if you have any injuries, requests, pregnant, etc. just for safety precautions. You can just say no. When I walk into my class people usually give me the \"fuck off I'm here to heal, relax, be alone, etc.\" and I always respect their space...because I'm one of those let me be I'm just here to yog kinda thing :) \n-When you get seated just lay down in suppta baddha konasana or whatever gets you most comfortable. You can close your eyes and wait for the teacher to start. 85% of my students do this. They just lay down and wait for me to say let's get started! Some students around you might talk to each other because people bring friends (which I have never done) and again that's like 15% of people who talk to to each other or talk non-yoga to the teacher. Again, people who go to yoga studios are most likely yogis who are looking for peace, calm, and not complete conversations \n-So now you get to practicing. You might OM in class which you are free to not participate in chanting EVER. \n-Adjustments form the teacher: If they are experienced and know you are new that might ask if you would like to be adjusted in class. You can say no. If they don't they might adjust your postures to help you get deeper or keep you from inuring yourself. The real beauty of practicing in a studio. You can whisper, no thanks I don't want to be adjusted. I have PLENTY of times to teachers and they should back off! They might adjust you in savasana to help you feel more relaxed as well. \n-If you need to use the restroom, blow your nose, take a break you can always leave. This can also go a few different ways A) If it's Bikram yoga they don't let you leave. FUCK BIKRAM YOGA. They want to keep the room hot for others blah blah blah. I've left storming out of that studio with the teacher blocking me. Never again. B) If it's a small studio without a reception area the bathroom will be in the studio that you can go into any time. C) If there is a reception you can always leave the room quietly and go to the washroom. The teacher might ask if you are o.k. you can always give a thumbs up. \n-When Savasana is over and the teacher says Namaste (again you don't have to say namaste back if you're not comfortable) you just roll up your mat, grab your belongings, and leave! It's usually quiet unless there are friends or couples who went there. Usually people in my classes have quite the yoga high and I'll get a thank you here and there. No need to acknowledge the teacher, students, front desk. Just take off. \n-Some things that are rude or annoying: cell phones! turn them off! :) Coming in late. Some teachers get annoyed during meditation when students come in late. But there are circumstances that just happen because life is life. \n\nMessage me if you have other questions. Practicing in a studio is a truly amazing experience. Finding a good teacher though is like a finding a good therapist so do your research on whose classes are good! Teachers usually have instagram/facebook so you can see what they look like when they walk in, etc. A few of my students found me through social media. \n\nHave such a great time! \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there! Yoga teacher &amp;amp; student here. I have taken and taught at a few hundred studios so I can give you a good break down. As someone who also has social anxiety I am more than happy to help :)&lt;/p&gt;\n\n&lt;p&gt;-Check to see if you can sign in and pay online. Many studios give you this option. \n-Show up about 15 minutes early. This will give you time to adjust, find the location, etc. This will also give you time to adjust to the space before students arrive. Some students arrive 10 minutes early.\n&lt;em&gt;Note: some studios have a reception area for coats and shoes, while others (and this is only 2 that I have been in is just one big studio without a reception). All have had bathrooms.\n-Once you arrive to the location there will be a place to hang up your coat and take off your shoes. It&amp;#39;s yoga etiquette to take off your shoes. \n-Now, when you get to the front desk there will be a few different ways this can go. A) Sign your name up on a sheet or ipad depending on what they have B) Pay for a drop-in class and sign up for the class meaning you will have to talk to the front desk. No matter what since you are a new student they will have you fill out a form for your emergency address. Almost every single yoga studio will ask you for that. Some people at the front desk will just say &amp;quot;bathrooms to the left, studio to the right, etc.&amp;quot; others will ask if you want a tour of the place which is completely up to you. You can always say no thanks! \n-&lt;/em&gt;When you arrive into the studio I would recommend bringing your bag/purse into the room. I never leave anything outside the actual yoga studio. I just leave everything near my mat. \n-Notice where the teacher will go, it will usually be in the front where there&amp;#39;s an alter. You can go anywhere you would like - back corner, front corner, etc. I always like the back corner. If the room has a few people in there already the rule of thumb is middle school gym arms distance (where you put your arms out to a T and can&amp;#39;t touch anyone). Some studios get more packed than others so just make an estimate. \n-When you set up grab a mat, blanket, bolster, blocks, usually the teacher will tell you what you need when they walk in \n-When the teacher DOES walk in (if they&amp;#39;re not already there) they may walk up to you and ask you if you have any injuries, requests, pregnant, etc. just for safety precautions. You can just say no. When I walk into my class people usually give me the &amp;quot;fuck off I&amp;#39;m here to heal, relax, be alone, etc.&amp;quot; and I always respect their space...because I&amp;#39;m one of those let me be I&amp;#39;m just here to yog kinda thing :) \n-When you get seated just lay down in suppta baddha konasana or whatever gets you most comfortable. You can close your eyes and wait for the teacher to start. 85% of my students do this. They just lay down and wait for me to say let&amp;#39;s get started! Some students around you might talk to each other because people bring friends (which I have never done) and again that&amp;#39;s like 15% of people who talk to to each other or talk non-yoga to the teacher. Again, people who go to yoga studios are most likely yogis who are looking for peace, calm, and not complete conversations \n-So now you get to practicing. You might OM in class which you are free to not participate in chanting EVER. \n-Adjustments form the teacher: If they are experienced and know you are new that might ask if you would like to be adjusted in class. You can say no. If they don&amp;#39;t they might adjust your postures to help you get deeper or keep you from inuring yourself. The real beauty of practicing in a studio. You can whisper, no thanks I don&amp;#39;t want to be adjusted. I have PLENTY of times to teachers and they should back off! They might adjust you in savasana to help you feel more relaxed as well. \n-If you need to use the restroom, blow your nose, take a break you can always leave. This can also go a few different ways A) If it&amp;#39;s Bikram yoga they don&amp;#39;t let you leave. FUCK BIKRAM YOGA. They want to keep the room hot for others blah blah blah. I&amp;#39;ve left storming out of that studio with the teacher blocking me. Never again. B) If it&amp;#39;s a small studio without a reception area the bathroom will be in the studio that you can go into any time. C) If there is a reception you can always leave the room quietly and go to the washroom. The teacher might ask if you are o.k. you can always give a thumbs up. \n-When Savasana is over and the teacher says Namaste (again you don&amp;#39;t have to say namaste back if you&amp;#39;re not comfortable) you just roll up your mat, grab your belongings, and leave! It&amp;#39;s usually quiet unless there are friends or couples who went there. Usually people in my classes have quite the yoga high and I&amp;#39;ll get a thank you here and there. No need to acknowledge the teacher, students, front desk. Just take off. \n-Some things that are rude or annoying: cell phones! turn them off! :) Coming in late. Some teachers get annoyed during meditation when students come in late. But there are circumstances that just happen because life is life. &lt;/p&gt;\n\n&lt;p&gt;Message me if you have other questions. Practicing in a studio is a truly amazing experience. Finding a good teacher though is like a finding a good therapist so do your research on whose classes are good! Teachers usually have instagram/facebook so you can see what they look like when they walk in, etc. A few of my students found me through social media. &lt;/p&gt;\n\n&lt;p&gt;Have such a great time! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dge5uhm", "score_hidden": false, "stickied": false, "created": 1492493658.0, "created_utc": 1492464858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 45}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dge6s8z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "That_Cupcake", "parent_id": "t1_dge6484", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "This is wonderful information! Thank you so much for taking the time to write all this out :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is wonderful information! Thank you so much for taking the time to write all this out :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dge6s8z", "score_hidden": false, "stickied": false, "created": 1492494824.0, "created_utc": 1492466024.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge6484", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "superoxide_dismutase", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "Fellow social anxiety yogi here!\n\nIs there a 'front desk'? Sometimes, but usually it's just the instructor waiting to check you in on their phone. They might be inside of the room or sitting just outside of it.\n\nDo I need to check in? Yep. Just walk up to the instructor and say hi and your name. If you are using the mindbody app to register then your instructor will need to check you off on their list on their phone. Let them know that this is your first group class but you have been practicing alone. This way they can let you know of any special rules the studio has or they can give you a general overview of how class works.\n\nAre there different rooms? Sometimes, but it is highly variable. They should have signage to say what room your class is in. \n\nHow do I know where I need to be and what do I do when I get there? Do I just pick a spot next to a stranger and unroll my yoga mat? If I get there early, do I just sit and wait? Signage should tell you what room you are in. You can be anywhere in the room, but if you are nervous put your mat down in the back. If you get there early (you should arrive at least 10 minutes before class starts, 15 if you want a good spot) you can roll out your mat and start stretching or just be still in child's or corpse. If you are feeling anxious just be still in corpse pose and try to relax.\n\nWill they even let you in if you're early? Depends on the place. Sometimes there is another class in the room or the instructor is running late and is unable to unlock the door early.\n\nPersonal space etiquette? Give about one foot between your mat on all sides and if the class is filling up make space by getting closer to your neighbors. Watch to your right and left when moving your arms to make sure you are staggered from people next to you, but if you accidentally touch it's not a big deal.\n\nWhat if I have to pee or take a water break? Make sure you pee before you go or pee at the studio. You should take a water bottle that is easy to drink from into the studio (don't bring one that requires you to unscrew the cap overytime or that makes noise/clangs). Take water breaks as you need them and then jump back into practice. \n\nWhere do you store personal items like a purse: next to you? leave it in the car? car keys? Cell phone? Leave your purse in your car. You can take your keys and cellphone in with you and have them next to your mat if you want. Your studio might have lockers too. Turn your phone off before class - not just vibration!\n\nDo I tip the yoga instructor like you would after a hair cut? No.\n\nIs there anything I might do, as a newbie to studio yoga, that others would consider rude or annoying? Until you know your studio policy, do not use your cellphone in the studio. If you need to take a break, go into child's pose, no one cares that you need a break (I always say why would I spend time thinking about what someone else cant do while I am supposed to be taking an hour to concentrate on myself and my own wellbeing - seriously, no one cares what you can and cant do). Bring a small towel to wipe your sweat. If you spray your mat down after practice, bring the bottle right back - don't spray and wipe your mat down and then bring it back so everyone has to wait for you. Again, let the instructor know this is your first class but you have been practicing at home. Come already dressed for practice as finding and using the locker rooms could bring on more anxiety. Do not chat during class or try to interact with anyone while class is happening. \n\nWhen it's over, do I just roll up my mat and evacuate? Yeah, when you are ready to leave just roll it up and leave. You can say thank you to your instructor too.\n\nWill someone try to socialize with me before or after the class? Maybe. If you close your eyes before class that is a general do not disturb sign. The instructor might check in with you to see how you thought it went.\n\nLet me know if you have any other questions, but really you just have to go. Getting there and getting the courage to go to your first class is way harder than the class. Looking back I have no idea why I was so intimidated by my studio, it's so comfortable there now!", "edited": 1492465547.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fellow social anxiety yogi here!&lt;/p&gt;\n\n&lt;p&gt;Is there a &amp;#39;front desk&amp;#39;? Sometimes, but usually it&amp;#39;s just the instructor waiting to check you in on their phone. They might be inside of the room or sitting just outside of it.&lt;/p&gt;\n\n&lt;p&gt;Do I need to check in? Yep. Just walk up to the instructor and say hi and your name. If you are using the mindbody app to register then your instructor will need to check you off on their list on their phone. Let them know that this is your first group class but you have been practicing alone. This way they can let you know of any special rules the studio has or they can give you a general overview of how class works.&lt;/p&gt;\n\n&lt;p&gt;Are there different rooms? Sometimes, but it is highly variable. They should have signage to say what room your class is in. &lt;/p&gt;\n\n&lt;p&gt;How do I know where I need to be and what do I do when I get there? Do I just pick a spot next to a stranger and unroll my yoga mat? If I get there early, do I just sit and wait? Signage should tell you what room you are in. You can be anywhere in the room, but if you are nervous put your mat down in the back. If you get there early (you should arrive at least 10 minutes before class starts, 15 if you want a good spot) you can roll out your mat and start stretching or just be still in child&amp;#39;s or corpse. If you are feeling anxious just be still in corpse pose and try to relax.&lt;/p&gt;\n\n&lt;p&gt;Will they even let you in if you&amp;#39;re early? Depends on the place. Sometimes there is another class in the room or the instructor is running late and is unable to unlock the door early.&lt;/p&gt;\n\n&lt;p&gt;Personal space etiquette? Give about one foot between your mat on all sides and if the class is filling up make space by getting closer to your neighbors. Watch to your right and left when moving your arms to make sure you are staggered from people next to you, but if you accidentally touch it&amp;#39;s not a big deal.&lt;/p&gt;\n\n&lt;p&gt;What if I have to pee or take a water break? Make sure you pee before you go or pee at the studio. You should take a water bottle that is easy to drink from into the studio (don&amp;#39;t bring one that requires you to unscrew the cap overytime or that makes noise/clangs). Take water breaks as you need them and then jump back into practice. &lt;/p&gt;\n\n&lt;p&gt;Where do you store personal items like a purse: next to you? leave it in the car? car keys? Cell phone? Leave your purse in your car. You can take your keys and cellphone in with you and have them next to your mat if you want. Your studio might have lockers too. Turn your phone off before class - not just vibration!&lt;/p&gt;\n\n&lt;p&gt;Do I tip the yoga instructor like you would after a hair cut? No.&lt;/p&gt;\n\n&lt;p&gt;Is there anything I might do, as a newbie to studio yoga, that others would consider rude or annoying? Until you know your studio policy, do not use your cellphone in the studio. If you need to take a break, go into child&amp;#39;s pose, no one cares that you need a break (I always say why would I spend time thinking about what someone else cant do while I am supposed to be taking an hour to concentrate on myself and my own wellbeing - seriously, no one cares what you can and cant do). Bring a small towel to wipe your sweat. If you spray your mat down after practice, bring the bottle right back - don&amp;#39;t spray and wipe your mat down and then bring it back so everyone has to wait for you. Again, let the instructor know this is your first class but you have been practicing at home. Come already dressed for practice as finding and using the locker rooms could bring on more anxiety. Do not chat during class or try to interact with anyone while class is happening. &lt;/p&gt;\n\n&lt;p&gt;When it&amp;#39;s over, do I just roll up my mat and evacuate? Yeah, when you are ready to leave just roll it up and leave. You can say thank you to your instructor too.&lt;/p&gt;\n\n&lt;p&gt;Will someone try to socialize with me before or after the class? Maybe. If you close your eyes before class that is a general do not disturb sign. The instructor might check in with you to see how you thought it went.&lt;/p&gt;\n\n&lt;p&gt;Let me know if you have any other questions, but really you just have to go. Getting there and getting the courage to go to your first class is way harder than the class. Looking back I have no idea why I was so intimidated by my studio, it&amp;#39;s so comfortable there now!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dge6484", "score_hidden": false, "stickied": false, "created": 1492493992.0, "created_utc": 1492465192.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dge67y3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CallMeParagon", "parent_id": "t1_dge5vfn", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "For sure!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For sure!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dge67y3", "score_hidden": false, "stickied": false, "created": 1492494120.0, "created_utc": 1492465320.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge5vfn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "That_Cupcake", "parent_id": "t1_dge5j5l", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "YES! Thank you for taking the time to write all this out. You've helped me more than you know. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;YES! Thank you for taking the time to write all this out. You&amp;#39;ve helped me more than you know. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dge5vfn", "score_hidden": false, "stickied": false, "created": 1492493690.0, "created_utc": 1492464890.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge5j5l", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "CallMeParagon", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "I can only advise you from my experience with the studio I go to and my own social anxiety:\n\nYes, there is a front desk and a general waiting area.  I try to get there early to secure a \"front of the line\" spot and before it gets crowded.  There is generally some kind of sign-in (where I go, it's an iPad).  \n\nDepending on the size of the business, there can be a few rooms.  Usually they save the largest rooms for their largest classes and smaller rooms for niche classes.  \n\n&gt;How do I know where I need to be and what do I do when I get there?\n\nIf it isn't clear, ask an employee.  It's hard to answer this better since every studio is different.  \n\nWhen you get there, go and pick a spot in the room that looks good and set your mat/towel down there.  I usually have a backpack, so I go and put it in a cubby after I put my mat and towel down.  \n\n&gt;Do I just pick a spot next to a stranger and unroll my yoga mat?\n\nIf that's what you've gotta do, well, that's what you've gotta do.  It's hard the first time, but gets easier as you do it more.  Remember, sometimes it's the other way around: you're the stranger and someone is nervous to put their mat down next to you.  I find remembering that helps reduce my anxiety.\n\n&gt;Will they even let you in if you're early?\n\nUsually, yes.  My experience is that the previous class gets out, someone goes through to clean the floor (it's a sweaty class), and you can enter pretty much as soon as the previous class leaves, just make room for the sweeper, if needed.\n\n&gt;Personal space etiquette?\n\nThe tightest class I've ever been in had mats 1-2\" apart.  Typically they are quite a bit more than that.  It's going to depend on how full your class is.\n\n&gt;What if I have to pee or take a water break?\n\nQuietly get up and leave to go pee.  Bring water with you in a bottle.  Instructors know people are going to have to use the restroom and expect it.  \n\n&gt;Where do you store personal items like a purse: next to you? leave it in the car? car keys? Cell phone? \n\nPersonally, I put this all in a backpack and the studio has cubbies everyone uses.  I also make sure my phone is on do-not-disturb.\n\n&gt;Do I tip the yoga instructor like you would after a hair cut?\n\nIs this a one-on-one special session?  I've never tipped a yoga instructor before, but I've also only ever gone to vinyasa yoga with lots of people attending.\n\n&gt;Is there anything I might do, as a newbie to studio yoga, that others would consider rude or annoying?\n\nIt's hard to say.  Your first class there is going to be a combination of learning and reconnaissance.  I'd say just make sure your phone is off.  \n\n&gt;When it's over, do I just roll up my mat and evacuate?\n\nYep!  A lot of people stay to clean their mats, but I just roll up and go home to clean my sweaty mat in peace.  \n\n&gt;Will someone try to socialize with me before or after the class?\n\nAgain, it depends on the studio and what atmosphere they have created, but my experience is that people love to chit chat.  I'm not very talkative, so I make very very small talk and will tell folks about my wife and dog.  \n\nHere's a usual visit for me:\n\nWalk in, take off flip flops (studio policy), sign in to class, wait to go in... finally get in, pick my spot, put my stuff in my cubby, stretch and just sort of... lay around until class starts.  After class ends, pack my shit up, thank the instructor, get my shoes and head out.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can only advise you from my experience with the studio I go to and my own social anxiety:&lt;/p&gt;\n\n&lt;p&gt;Yes, there is a front desk and a general waiting area.  I try to get there early to secure a &amp;quot;front of the line&amp;quot; spot and before it gets crowded.  There is generally some kind of sign-in (where I go, it&amp;#39;s an iPad).  &lt;/p&gt;\n\n&lt;p&gt;Depending on the size of the business, there can be a few rooms.  Usually they save the largest rooms for their largest classes and smaller rooms for niche classes.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;How do I know where I need to be and what do I do when I get there?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If it isn&amp;#39;t clear, ask an employee.  It&amp;#39;s hard to answer this better since every studio is different.  &lt;/p&gt;\n\n&lt;p&gt;When you get there, go and pick a spot in the room that looks good and set your mat/towel down there.  I usually have a backpack, so I go and put it in a cubby after I put my mat and towel down.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Do I just pick a spot next to a stranger and unroll my yoga mat?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If that&amp;#39;s what you&amp;#39;ve gotta do, well, that&amp;#39;s what you&amp;#39;ve gotta do.  It&amp;#39;s hard the first time, but gets easier as you do it more.  Remember, sometimes it&amp;#39;s the other way around: you&amp;#39;re the stranger and someone is nervous to put their mat down next to you.  I find remembering that helps reduce my anxiety.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Will they even let you in if you&amp;#39;re early?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Usually, yes.  My experience is that the previous class gets out, someone goes through to clean the floor (it&amp;#39;s a sweaty class), and you can enter pretty much as soon as the previous class leaves, just make room for the sweeper, if needed.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Personal space etiquette?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The tightest class I&amp;#39;ve ever been in had mats 1-2&amp;quot; apart.  Typically they are quite a bit more than that.  It&amp;#39;s going to depend on how full your class is.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What if I have to pee or take a water break?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Quietly get up and leave to go pee.  Bring water with you in a bottle.  Instructors know people are going to have to use the restroom and expect it.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Where do you store personal items like a purse: next to you? leave it in the car? car keys? Cell phone? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Personally, I put this all in a backpack and the studio has cubbies everyone uses.  I also make sure my phone is on do-not-disturb.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Do I tip the yoga instructor like you would after a hair cut?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is this a one-on-one special session?  I&amp;#39;ve never tipped a yoga instructor before, but I&amp;#39;ve also only ever gone to vinyasa yoga with lots of people attending.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Is there anything I might do, as a newbie to studio yoga, that others would consider rude or annoying?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s hard to say.  Your first class there is going to be a combination of learning and reconnaissance.  I&amp;#39;d say just make sure your phone is off.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When it&amp;#39;s over, do I just roll up my mat and evacuate?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yep!  A lot of people stay to clean their mats, but I just roll up and go home to clean my sweaty mat in peace.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Will someone try to socialize with me before or after the class?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again, it depends on the studio and what atmosphere they have created, but my experience is that people love to chit chat.  I&amp;#39;m not very talkative, so I make very very small talk and will tell folks about my wife and dog.  &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a usual visit for me:&lt;/p&gt;\n\n&lt;p&gt;Walk in, take off flip flops (studio policy), sign in to class, wait to go in... finally get in, pick my spot, put my stuff in my cubby, stretch and just sort of... lay around until class starts.  After class ends, pack my shit up, thank the instructor, get my shoes and head out.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dge5j5l", "score_hidden": false, "stickied": false, "created": 1492493277.0, "created_utc": 1492464477.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dge7n2l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "picklesandrainbows", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "You would love my studio. As an anxious person who craves organization - I love that my studio has the place marked up with tape to separate people and give people their space. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You would love my studio. As an anxious person who craves organization - I love that my studio has the place marked up with tape to separate people and give people their space. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dge7n2l", "score_hidden": false, "stickied": false, "created": 1492495888.0, "created_utc": 1492467088.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dgecfcb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Camacho1", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "Just swing by to check the place out before committing to a class. Feel it out, ask some questions and maybe sign up for a class at the end.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just swing by to check the place out before committing to a class. Feel it out, ask some questions and maybe sign up for a class at the end.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dgecfcb", "score_hidden": false, "stickied": false, "created": 1492502095.0, "created_utc": 1492473295.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dgedvw2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "emileegrace321", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "Hi! I am a practicing student but I also teach hatha yoga. I have my 200 RYT certification and normally teach beginning classes. I also have severe anxiety, so I understand how difficult it can be. But I am so glad to hear you are facing this head on and trying something new!!! Group practice can be so helpful - even after years, I sometimes still have issues with correct form and going to classes is great because a teacher can correct you and help you practice safely and effectively.\n\nFirst of all, to answer your questions... Every studio is different, but normally the check in process is fairly standard. Most places will have a desk or area where you will sign in, sign a waiver, and pay before class. I would also recommend letting that person or the teacher know that you are new to these classes. Personally, I have chronic pain, so I'm very keen on keeping my bag near my mat in case I need icyhot or medication. However, some studios are a little more picky and require you to put away your things in a cubby/locker unless you have a specific need. As far as the socialising goes.. it just depends on the place. 😀 I have been to many where people have kept to themselves, but also many where everyone is very social and enthusiastic. I also have a lot of anxiety when meeting new people - if someone does approach you, try to do some deep breathing, and think of this whole thing as a new experience to take yourself out of your comfort zone.\n\nGoing to your first class can be overwhelming so  I just wanted to share some tips with you:\n\n1) It sounds simple, but try doing some deep breathing or meditation before class. It can make a big difference on the mindset you have when you begin.\n\n2) Since you are new to group classes, I would highly recommend picking a spot in the back of the room or in a corner. It eases anxiety as no one is looking directly at you, and also gives you better insight as to what's going on. \n\n2) Try not to compare yourself to others in the class!!! It's easy to look at someone doing their flows easily or gracefully falling into advance poses and be jealous of them. Always keep in mind that your practice is your own and you are on the mat ONLY to advance YOUR practice and better YOUR health. 💓\n\n3)  Pace yourself. If you need to take things a little slower than others, please don't be afraid to. You know your body better than anyone else does.. don't put yourself in severe pain or discomfort for the sake of keeping up.\n\n4) on that same note.. if you are feeling stressed or overwhelmed, modify your poses so they are more accessible! If you don't know how to and need assistance, but don't want to draw attention to yourself.. give the teacher a wave after he/she has given instructions. Normally during this time students are given a few moments to deepen into the pose and is a perfect time to get the teachers attention without creating more anxiety for yourself.\n\n\nPlease, please, please PM me with any further questions or concerns or if there's anything you want to talk about! Broadening your practice is an amazing thing but I know it can be tough. Sending you good vibes and hoping things go smoothly!!!!\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! I am a practicing student but I also teach hatha yoga. I have my 200 RYT certification and normally teach beginning classes. I also have severe anxiety, so I understand how difficult it can be. But I am so glad to hear you are facing this head on and trying something new!!! Group practice can be so helpful - even after years, I sometimes still have issues with correct form and going to classes is great because a teacher can correct you and help you practice safely and effectively.&lt;/p&gt;\n\n&lt;p&gt;First of all, to answer your questions... Every studio is different, but normally the check in process is fairly standard. Most places will have a desk or area where you will sign in, sign a waiver, and pay before class. I would also recommend letting that person or the teacher know that you are new to these classes. Personally, I have chronic pain, so I&amp;#39;m very keen on keeping my bag near my mat in case I need icyhot or medication. However, some studios are a little more picky and require you to put away your things in a cubby/locker unless you have a specific need. As far as the socialising goes.. it just depends on the place. 😀 I have been to many where people have kept to themselves, but also many where everyone is very social and enthusiastic. I also have a lot of anxiety when meeting new people - if someone does approach you, try to do some deep breathing, and think of this whole thing as a new experience to take yourself out of your comfort zone.&lt;/p&gt;\n\n&lt;p&gt;Going to your first class can be overwhelming so  I just wanted to share some tips with you:&lt;/p&gt;\n\n&lt;p&gt;1) It sounds simple, but try doing some deep breathing or meditation before class. It can make a big difference on the mindset you have when you begin.&lt;/p&gt;\n\n&lt;p&gt;2) Since you are new to group classes, I would highly recommend picking a spot in the back of the room or in a corner. It eases anxiety as no one is looking directly at you, and also gives you better insight as to what&amp;#39;s going on. &lt;/p&gt;\n\n&lt;p&gt;2) Try not to compare yourself to others in the class!!! It&amp;#39;s easy to look at someone doing their flows easily or gracefully falling into advance poses and be jealous of them. Always keep in mind that your practice is your own and you are on the mat ONLY to advance YOUR practice and better YOUR health. 💓&lt;/p&gt;\n\n&lt;p&gt;3)  Pace yourself. If you need to take things a little slower than others, please don&amp;#39;t be afraid to. You know your body better than anyone else does.. don&amp;#39;t put yourself in severe pain or discomfort for the sake of keeping up.&lt;/p&gt;\n\n&lt;p&gt;4) on that same note.. if you are feeling stressed or overwhelmed, modify your poses so they are more accessible! If you don&amp;#39;t know how to and need assistance, but don&amp;#39;t want to draw attention to yourself.. give the teacher a wave after he/she has given instructions. Normally during this time students are given a few moments to deepen into the pose and is a perfect time to get the teachers attention without creating more anxiety for yourself.&lt;/p&gt;\n\n&lt;p&gt;Please, please, please PM me with any further questions or concerns or if there&amp;#39;s anything you want to talk about! Broadening your practice is an amazing thing but I know it can be tough. Sending you good vibes and hoping things go smoothly!!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dgedvw2", "score_hidden": false, "stickied": false, "created": 1492503964.0, "created_utc": 1492475164.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dgen3mk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ilistentodancemusic", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "People have covered most of your questions, but just to let you know you're not alone - I've been practicing at studios for 12 years (wow, that's crazy to think about) and teaching for 4, and I STILL get anxiety about practicing at new studios!\n\nStudios can be pretty different when it comes to some of those things - like whether there are different rooms or a locker room or how early they'll unlock the doors and so forth. So I usually try to show up 15 minutes early (I used to show up even earlier because anxiety made me but more than once I beat the teacher there and just had to wait in my car or outside for them to show up so now I try to show up 15 minutes early) and I explain to them it's my first time there, and they usually take it from there - giving me the waiver if there is one or having me fill out info on an ipad and explaining where the bathroom is, where I can leave my stuff, where the studio entrance is (if we're in a reception area and not in the room already that is), and all of that.\n\nAs for talking in the studio room itself, at my studio, it's a no-no, but I've actually been to more studios where it is okay to chat than ones where it isn't. So for that, I take a cue from the regulars. Although it still feels funny for me to talk in the room itself since I'm so trained by where I normally practice!\n\nAs an instructor, the only time I get frustrated with new people is when they show up like AT 5:30 for a 5:30 class. My studio has a full waiver for them to fill out, and that usually takes a couple of minutes, then our locker room is separate from our studio so once I send them there, they usually take a few minutes before strolling into the studio space itself and then they are a distraction to people who are already in their yoga zone. \n\nOther than that, most of the \"mistakes\" new people make are not annoying at all. If someone's brand new, they might try to wear their shoes inside the room or something, and I have to stop them, and I feel bad that I might be embarrassing them by correcting them, but no part of me is judging them for not knowing. How could they know something if they've never been taught it before?\n\nI understand that anxiety isn't always rational, so it can be hard to calm it down, but I do hope these answers help, and the fact that you aren't alone in your anxieties, too!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People have covered most of your questions, but just to let you know you&amp;#39;re not alone - I&amp;#39;ve been practicing at studios for 12 years (wow, that&amp;#39;s crazy to think about) and teaching for 4, and I STILL get anxiety about practicing at new studios!&lt;/p&gt;\n\n&lt;p&gt;Studios can be pretty different when it comes to some of those things - like whether there are different rooms or a locker room or how early they&amp;#39;ll unlock the doors and so forth. So I usually try to show up 15 minutes early (I used to show up even earlier because anxiety made me but more than once I beat the teacher there and just had to wait in my car or outside for them to show up so now I try to show up 15 minutes early) and I explain to them it&amp;#39;s my first time there, and they usually take it from there - giving me the waiver if there is one or having me fill out info on an ipad and explaining where the bathroom is, where I can leave my stuff, where the studio entrance is (if we&amp;#39;re in a reception area and not in the room already that is), and all of that.&lt;/p&gt;\n\n&lt;p&gt;As for talking in the studio room itself, at my studio, it&amp;#39;s a no-no, but I&amp;#39;ve actually been to more studios where it is okay to chat than ones where it isn&amp;#39;t. So for that, I take a cue from the regulars. Although it still feels funny for me to talk in the room itself since I&amp;#39;m so trained by where I normally practice!&lt;/p&gt;\n\n&lt;p&gt;As an instructor, the only time I get frustrated with new people is when they show up like AT 5:30 for a 5:30 class. My studio has a full waiver for them to fill out, and that usually takes a couple of minutes, then our locker room is separate from our studio so once I send them there, they usually take a few minutes before strolling into the studio space itself and then they are a distraction to people who are already in their yoga zone. &lt;/p&gt;\n\n&lt;p&gt;Other than that, most of the &amp;quot;mistakes&amp;quot; new people make are not annoying at all. If someone&amp;#39;s brand new, they might try to wear their shoes inside the room or something, and I have to stop them, and I feel bad that I might be embarrassing them by correcting them, but no part of me is judging them for not knowing. How could they know something if they&amp;#39;ve never been taught it before?&lt;/p&gt;\n\n&lt;p&gt;I understand that anxiety isn&amp;#39;t always rational, so it can be hard to calm it down, but I do hope these answers help, and the fact that you aren&amp;#39;t alone in your anxieties, too!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dgen3mk", "score_hidden": false, "stickied": false, "created": 1492515409.0, "created_utc": 1492486609.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dgeapp8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rathyAro", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "I'd highly recommend calling the studio you want to go to ahead of time, explaining your concerns, and asking them these questions. They may have different take on your questions than us internet strangers and you'll know for sure that you're doing everything fine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d highly recommend calling the studio you want to go to ahead of time, explaining your concerns, and asking them these questions. They may have different take on your questions than us internet strangers and you&amp;#39;ll know for sure that you&amp;#39;re doing everything fine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dgeapp8", "score_hidden": false, "stickied": false, "created": 1492499887.0, "created_utc": 1492471087.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dged9wh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BoredExNewYorker", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "Just to add: you dont have to talk or interact with anyone if you dont want to. Some people do, some dont. No one will notice or care. The instructor might say hi, or ask if you have any injuries, and you can thank him/ her at end if you like.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just to add: you dont have to talk or interact with anyone if you dont want to. Some people do, some dont. No one will notice or care. The instructor might say hi, or ask if you have any injuries, and you can thank him/ her at end if you like.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dged9wh", "score_hidden": false, "stickied": false, "created": 1492503189.0, "created_utc": 1492474389.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dgednnj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Blubtrflygrl1", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "I don't think you said but is there any way you can go with a buddy to your first class?\n\nI went with a couple of family members my first few times and it helped to take the edge off.\n\nThey had also been to the studio so helped me a lot in setting up and knowing what to expect.\n\nI always advise getting there a half hour early and just being honest about your jitters.\n\nIf there's anything I've learned teachers as well as regular students LOVE talking about what to expect and making people feel comfortable.\n\nOnce you are set up in the room you can even just sit quietly if you like.\n\nIt can feel awkward to stretch or even lay down until you are comfortable with the studio.\n\nThe only things that I regularly see that can be perceived as annoying/poor etiquette are when people bring their phone into the yoga room or talk when people around them are meditating. Surprisingly I see this more with regulars though and not newbies.\n\n\nAt end of class too it can be considered poor taste to start spraying down your mat if others are in silence around you.\n\nI always try to take care of using the bathroom before class starts because it can be considered rude or distracting to leave in the middle of class for this.\n\nA lot of people though feel it's worse if a teacher calls you out for this as you know your body and it's needs.\n\nLastly never feel bad if you feel like you need to sit out poses or lie down.\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think you said but is there any way you can go with a buddy to your first class?&lt;/p&gt;\n\n&lt;p&gt;I went with a couple of family members my first few times and it helped to take the edge off.&lt;/p&gt;\n\n&lt;p&gt;They had also been to the studio so helped me a lot in setting up and knowing what to expect.&lt;/p&gt;\n\n&lt;p&gt;I always advise getting there a half hour early and just being honest about your jitters.&lt;/p&gt;\n\n&lt;p&gt;If there&amp;#39;s anything I&amp;#39;ve learned teachers as well as regular students LOVE talking about what to expect and making people feel comfortable.&lt;/p&gt;\n\n&lt;p&gt;Once you are set up in the room you can even just sit quietly if you like.&lt;/p&gt;\n\n&lt;p&gt;It can feel awkward to stretch or even lay down until you are comfortable with the studio.&lt;/p&gt;\n\n&lt;p&gt;The only things that I regularly see that can be perceived as annoying/poor etiquette are when people bring their phone into the yoga room or talk when people around them are meditating. Surprisingly I see this more with regulars though and not newbies.&lt;/p&gt;\n\n&lt;p&gt;At end of class too it can be considered poor taste to start spraying down your mat if others are in silence around you.&lt;/p&gt;\n\n&lt;p&gt;I always try to take care of using the bathroom before class starts because it can be considered rude or distracting to leave in the middle of class for this.&lt;/p&gt;\n\n&lt;p&gt;A lot of people though feel it&amp;#39;s worse if a teacher calls you out for this as you know your body and it&amp;#39;s needs.&lt;/p&gt;\n\n&lt;p&gt;Lastly never feel bad if you feel like you need to sit out poses or lie down.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dgednnj", "score_hidden": false, "stickied": false, "created": 1492503672.0, "created_utc": 1492474872.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dgee15h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PootyT", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "Didn't see this anywhere else--as long as you don't have a \"thing\" about using shared equipment, you don't need to bring your own props (blocks etc), the studio should have plenty! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Didn&amp;#39;t see this anywhere else--as long as you don&amp;#39;t have a &amp;quot;thing&amp;quot; about using shared equipment, you don&amp;#39;t need to bring your own props (blocks etc), the studio should have plenty! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dgee15h", "score_hidden": false, "stickied": false, "created": 1492504148.0, "created_utc": 1492475348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhq6", "removal_reason": null, "link_id": "t3_65ya0t", "likes": null, "replies": "", "user_reports": [], "id": "dgeoa5t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "obviciously", "parent_id": "t3_65ya0t", "subreddit_name_prefixed": "r/yoga", "controversiality": 0, "body": "spike in anxiety and unexpected farts when doing the poses.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;spike in anxiety and unexpected farts when doing the poses.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "yoga", "name": "t1_dgeoa5t", "score_hidden": false, "stickied": false, "created": 1492517138.0, "created_utc": 1492488338.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]