[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "thalassophobia", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m more afraid of swimming in open water because of fish and other sea creatures, and because of that fear I have trouble going into lakes, oceans, and the like. &lt;/p&gt;\n\n&lt;p&gt;Does anyone know how to get over this fear? I love the look of water and the idea of going into it and swimming, but I am paralyzed by my fear of fish. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to Cuba in November and I want to be able to swim in the ocean, but I can&amp;#39;t if I still hang onto this fear.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been afraid of fish and open water since before I can remember.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm more afraid of swimming in open water because of fish and other sea creatures, and because of that fear I have trouble going into lakes, oceans, and the like. \n\nDoes anyone know how to get over this fear? I love the look of water and the idea of going into it and swimming, but I am paralyzed by my fear of fish. \n\nI'm going to Cuba in November and I want to be able to swim in the ocean, but I can't if I still hang onto this fear.\n\nI've been afraid of fish and open water since before I can remember.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65uax2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "smurfrielle", "saved": false, "mod_reports": [], "name": "t3_65uax2", "subreddit_name_prefixed": "r/thalassophobia", "approved_by": null, "over_18": false, "domain": "self.thalassophobia", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2xfs1", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/thalassophobia/comments/65uax2/facing_my_fears/", "num_reports": null, "locked": false, "stickied": false, "created": 1492444954.0, "url": "https://www.reddit.com/r/thalassophobia/comments/65uax2/facing_my_fears/", "author_flair_text": null, "quarantine": false, "title": "Facing my fears", "created_utc": 1492416154.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2xfs1", "removal_reason": null, "link_id": "t3_65uax2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2xfs1", "removal_reason": null, "link_id": "t3_65uax2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2xfs1", "removal_reason": null, "link_id": "t3_65uax2", "likes": null, "replies": "", "user_reports": [], "id": "dge8xqg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "feed_the_wolves", "parent_id": "t1_dgdq5vu", "subreddit_name_prefixed": "r/thalassophobia", "controversiality": 0, "body": "Oh those are the nastiest things ever", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh those are the nastiest things ever&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "thalassophobia", "name": "t1_dge8xqg", "score_hidden": false, "stickied": false, "created": 1492497560.0, "created_utc": 1492468760.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq5vu", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "smurfrielle", "parent_id": "t1_dgdd0r6", "subreddit_name_prefixed": "r/thalassophobia", "controversiality": 0, "body": "Funny you mention jellyfish, that's where my fear of fish began as far as I know. \n\nThanks for the advice!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Funny you mention jellyfish, that&amp;#39;s where my fear of fish began as far as I know. &lt;/p&gt;\n\n&lt;p&gt;Thanks for the advice!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "thalassophobia", "name": "t1_dgdq5vu", "score_hidden": false, "stickied": false, "created": 1492475975.0, "created_utc": 1492447175.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdd0r6", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "feed_the_wolves", "parent_id": "t3_65uax2", "subreddit_name_prefixed": "r/thalassophobia", "controversiality": 0, "body": "I don't know how the waters are in Cuba but if you go to a lake, river or ocean/sea, you very rarely will see any fish by the shore and they will swim away from you.\n\nMy advice would be to go into the shallow water few meters away from beach where you can clearly see the waters around you and stay until you are comfortable enough, or not.\n\nWhen I go swim into the sea I just swim parallel to the shore where I got enough space underneath me to not constantly hit the floor paddling but enough to be able to stand just in case. I keep on the lookout for jellyfishes though (deep phobia which I am not exactly planning to fight).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know how the waters are in Cuba but if you go to a lake, river or ocean/sea, you very rarely will see any fish by the shore and they will swim away from you.&lt;/p&gt;\n\n&lt;p&gt;My advice would be to go into the shallow water few meters away from beach where you can clearly see the waters around you and stay until you are comfortable enough, or not.&lt;/p&gt;\n\n&lt;p&gt;When I go swim into the sea I just swim parallel to the shore where I got enough space underneath me to not constantly hit the floor paddling but enough to be able to stand just in case. I keep on the lookout for jellyfishes though (deep phobia which I am not exactly planning to fight).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "thalassophobia", "name": "t1_dgdd0r6", "score_hidden": false, "stickied": false, "created": 1492456126.0, "created_utc": 1492427326.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2xfs1", "removal_reason": null, "link_id": "t3_65uax2", "likes": null, "replies": "", "user_reports": [], "id": "dgeisef", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thalasthrow", "parent_id": "t3_65uax2", "subreddit_name_prefixed": "r/thalassophobia", "controversiality": 0, "body": "edit: jesus, thats more then i meant to type - tl;dr: your best bet is to overcome your fear by swimming, look for a lake and some friends and slowly build confidence.\n\nI know very well how you feel. I've always been extremely afraid of deep water or even shallow water if I can't see the ground. To the point where I panic, too much fear to handle, and I am usually not someone who gets terrified easily.\n\nJust like you (contrary to my fear) I love water and swimming. One day I decided I will overcome my fear. goddamnit, kids are swimming in lakes, I am an adult wth.\n\nI went to a local lake where I couldn't see the bottom. I stepped in so my upper body was still outside. I felt my feet slightly sinking into the sand on the ground (where the water was still shallow enough), felt the nasty plants, dirt and small stones on my feet and between my toes. I began to feel this unsettling feeling coming up, you know what feeling I am talking about. I said to myself that's too much, I cant do it, I need to get out but I tried to fight my flight response and stayed. After a while standing in the shallow water I got used to it and decided to take on the real nightmare - swimming to the middle of the lake. Every fibre in my body said don't do it and I got one big adrenalin kick just thinking about what im going to do. I tried to clear my mind of any horror movie I've seen that involves water and focused only on good memories and dreams I have, then I took one deep breath and started to swim. The trick is to really think so hard about everything else and more importantly, every little detail, this way you prevent fear and panic.\n\nAs i was swimming I felt the cold water around my body, random stuff touching me which gave me a jolt of terror everytime it happened. The random very cold spots where god knows why it's suddenly so cold but then it crosses your mind the only reason it's so cold is because it's a very deep spot in the lake and the wall I build in my head, which was shielding me from any bad thoughts, suddenly crumbled. That was the moment I started to panic and I realized where the hell I actually am. I tried the whole time (quite successfully) so hard to distract myself not thinking about where I am and what I am doing. I have never in my life been so terrified. In the back of my head I knew I had to remain calm because drowning was a very real thing in this situation so I snapped out of it after battling my panic for a while. When I arrived at the middle I thought I am already halfway through so I might aswell finish it and swim across the whole lake, turning back would habe been the same distance but for some reason I didn't like the thought of swimming back. When I arrived at the lakeshore my fear was almost completely gone. I felt so free and standing in the shallow water again I didn't wanna get out of the water because I enjoyed not being terrified in this kinda water anymore. I still feel uneasy especially when I didn't go fora swim for a while, but this extreme fear of deep water is gone.\n\nso, what I wanna say is, your best bet will be to overcome your fear by swimming in lakes. There is a saying in my native language (don't know if it exists in english) \"ins kalte wasser springen\" which literally means to jump into cold water and overcome your fear. I strongly suggest not going alone and without safety tho, like I did.", "edited": 1492481560.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;edit: jesus, thats more then i meant to type - tl;dr: your best bet is to overcome your fear by swimming, look for a lake and some friends and slowly build confidence.&lt;/p&gt;\n\n&lt;p&gt;I know very well how you feel. I&amp;#39;ve always been extremely afraid of deep water or even shallow water if I can&amp;#39;t see the ground. To the point where I panic, too much fear to handle, and I am usually not someone who gets terrified easily.&lt;/p&gt;\n\n&lt;p&gt;Just like you (contrary to my fear) I love water and swimming. One day I decided I will overcome my fear. goddamnit, kids are swimming in lakes, I am an adult wth.&lt;/p&gt;\n\n&lt;p&gt;I went to a local lake where I couldn&amp;#39;t see the bottom. I stepped in so my upper body was still outside. I felt my feet slightly sinking into the sand on the ground (where the water was still shallow enough), felt the nasty plants, dirt and small stones on my feet and between my toes. I began to feel this unsettling feeling coming up, you know what feeling I am talking about. I said to myself that&amp;#39;s too much, I cant do it, I need to get out but I tried to fight my flight response and stayed. After a while standing in the shallow water I got used to it and decided to take on the real nightmare - swimming to the middle of the lake. Every fibre in my body said don&amp;#39;t do it and I got one big adrenalin kick just thinking about what im going to do. I tried to clear my mind of any horror movie I&amp;#39;ve seen that involves water and focused only on good memories and dreams I have, then I took one deep breath and started to swim. The trick is to really think so hard about everything else and more importantly, every little detail, this way you prevent fear and panic.&lt;/p&gt;\n\n&lt;p&gt;As i was swimming I felt the cold water around my body, random stuff touching me which gave me a jolt of terror everytime it happened. The random very cold spots where god knows why it&amp;#39;s suddenly so cold but then it crosses your mind the only reason it&amp;#39;s so cold is because it&amp;#39;s a very deep spot in the lake and the wall I build in my head, which was shielding me from any bad thoughts, suddenly crumbled. That was the moment I started to panic and I realized where the hell I actually am. I tried the whole time (quite successfully) so hard to distract myself not thinking about where I am and what I am doing. I have never in my life been so terrified. In the back of my head I knew I had to remain calm because drowning was a very real thing in this situation so I snapped out of it after battling my panic for a while. When I arrived at the middle I thought I am already halfway through so I might aswell finish it and swim across the whole lake, turning back would habe been the same distance but for some reason I didn&amp;#39;t like the thought of swimming back. When I arrived at the lakeshore my fear was almost completely gone. I felt so free and standing in the shallow water again I didn&amp;#39;t wanna get out of the water because I enjoyed not being terrified in this kinda water anymore. I still feel uneasy especially when I didn&amp;#39;t go fora swim for a while, but this extreme fear of deep water is gone.&lt;/p&gt;\n\n&lt;p&gt;so, what I wanna say is, your best bet will be to overcome your fear by swimming in lakes. There is a saying in my native language (don&amp;#39;t know if it exists in english) &amp;quot;ins kalte wasser springen&amp;quot; which literally means to jump into cold water and overcome your fear. I strongly suggest not going alone and without safety tho, like I did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "thalassophobia", "name": "t1_dgeisef", "score_hidden": false, "stickied": false, "created": 1492509981.0, "created_utc": 1492481181.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]