[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been an &amp;quot;entrepreneur&amp;quot; since I was 19. I learned web design &amp;amp; development, started doing some freelance, and did that for about two years. I realized I had no passion for the work I did, I hated it everyday, and so I created an agency around it and outsourced the work and focused on sales. That helped a little, but I wasn&amp;#39;t as &amp;quot;hands off&amp;quot; as I originally hoped. That only lasted a year. &lt;/p&gt;\n\n&lt;p&gt;The last 6 months I thought I found an answer. Ecommerce. I started with drop shipping. I made some sales, a little profit, but it didn&amp;#39;t feel right. I wanted to own my own company, a product, a brand, something I&amp;#39;m proud of. Drop shipping seems like a temporary solution, I don&amp;#39;t want to sell someone else&amp;#39;s shit, I want to sell my own shit! Therefore I tried out private labeling and sold through Amazon FBA. It&amp;#39;s been fun, I&amp;#39;m very new but I&amp;#39;ve had a little success. I really don&amp;#39;t see it being long term though (similar to drop shipping). I see more and more Chinese manufacturers cutting out the middle man (me) and selling directly to consumers on Amazon, eBay, etc. I feel like I&amp;#39;m investing all of this time and energy into something that will inevitably die out within the next couple years. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been feeling pretty hopeless and depressed lately... I turn 23 in a couple weeks and I feel like I have nothing, I want a business I can be proud of, something I&amp;#39;m passionate about... Something I can call my own, something I can focus on and put in work every day... I just haven&amp;#39;t found it yet... And that makes me feel like shit because I feel like I&amp;#39;m wasting every day. I just want to get started on something, you know?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been an \"entrepreneur\" since I was 19. I learned web design &amp; development, started doing some freelance, and did that for about two years. I realized I had no passion for the work I did, I hated it everyday, and so I created an agency around it and outsourced the work and focused on sales. That helped a little, but I wasn't as \"hands off\" as I originally hoped. That only lasted a year. \n\nThe last 6 months I thought I found an answer. Ecommerce. I started with drop shipping. I made some sales, a little profit, but it didn't feel right. I wanted to own my own company, a product, a brand, something I'm proud of. Drop shipping seems like a temporary solution, I don't want to sell someone else's shit, I want to sell my own shit! Therefore I tried out private labeling and sold through Amazon FBA. It's been fun, I'm very new but I've had a little success. I really don't see it being long term though (similar to drop shipping). I see more and more Chinese manufacturers cutting out the middle man (me) and selling directly to consumers on Amazon, eBay, etc. I feel like I'm investing all of this time and energy into something that will inevitably die out within the next couple years. \n\nI've been feeling pretty hopeless and depressed lately... I turn 23 in a couple weeks and I feel like I have nothing, I want a business I can be proud of, something I'm passionate about... Something I can call my own, something I can focus on and put in work every day... I just haven't found it yet... And that makes me feel like shit because I feel like I'm wasting every day. I just want to get started on something, you know?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64zufg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "oootime", "saved": false, "mod_reports": [], "name": "t3_64zufg", "subreddit_name_prefixed": "r/Entrepreneur", "approved_by": null, "over_18": false, "domain": "self.Entrepreneur", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qldo", "edited": 1492020419.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Entrepreneur/comments/64zufg/i_feel_like_i_need_some_guidance_right_about_now/", "num_reports": null, "locked": false, "stickied": false, "created": 1492048966.0, "url": "https://www.reddit.com/r/Entrepreneur/comments/64zufg/i_feel_like_i_need_some_guidance_right_about_now/", "author_flair_text": null, "quarantine": false, "title": "I feel like I need some guidance right about now...", "created_utc": 1492020166.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_64zufg", "likes": null, "replies": "", "user_reports": [], "id": "dg6axwq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "downvote_breitbart", "parent_id": "t3_64zufg", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "Good news is you are still young and have plenty of time. Right now you sound like a generalist. You have general knowledge of web design, a general knowledge of ecommerce. But as you found out, businesses that only require general knowledge are highly competitive and a race to the bottom. \n\nAs you begin to specialize, begin to become expert in a cutting edge field, opportunities will present themselves as your knowledge and network grows in that cutting field. \n\nMy suggestion: you sound like you've reached the end of what you can accomplish on your own gas. Go work for someone for a few years. Pick as cutting edge a field as you can find that has growth potential.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good news is you are still young and have plenty of time. Right now you sound like a generalist. You have general knowledge of web design, a general knowledge of ecommerce. But as you found out, businesses that only require general knowledge are highly competitive and a race to the bottom. &lt;/p&gt;\n\n&lt;p&gt;As you begin to specialize, begin to become expert in a cutting edge field, opportunities will present themselves as your knowledge and network grows in that cutting field. &lt;/p&gt;\n\n&lt;p&gt;My suggestion: you sound like you&amp;#39;ve reached the end of what you can accomplish on your own gas. Go work for someone for a few years. Pick as cutting edge a field as you can find that has growth potential.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dg6axwq", "score_hidden": false, "stickied": false, "created": 1492050310.0, "created_utc": 1492021510.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_64zufg", "likes": null, "replies": "", "user_reports": [], "id": "dg6b8xa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tinikan", "parent_id": "t3_64zufg", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "I think that you should keep on searching and trying new things until you feel like you have found what you're looking for. Don't lose your hope! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that you should keep on searching and trying new things until you feel like you have found what you&amp;#39;re looking for. Don&amp;#39;t lose your hope! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dg6b8xa", "score_hidden": false, "stickied": false, "created": 1492050618.0, "created_utc": 1492021818.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_64zufg", "likes": null, "replies": "", "user_reports": [], "id": "dg6ddz9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chasing-daylight", "parent_id": "t3_64zufg", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "You are young. I was the same way back then. Always dreaming of being self employed (which blurred my purpose for college)...I tried several things which never really made more than a hobby income...had to actually get a 'real job' for 20 years hating every minute of it while wanting something that I could be proud of building...you have the spirit just not the right opportunity. When the time is right, that door WILL open. It may not be what you expected, but it will open..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are young. I was the same way back then. Always dreaming of being self employed (which blurred my purpose for college)...I tried several things which never really made more than a hobby income...had to actually get a &amp;#39;real job&amp;#39; for 20 years hating every minute of it while wanting something that I could be proud of building...you have the spirit just not the right opportunity. When the time is right, that door WILL open. It may not be what you expected, but it will open..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dg6ddz9", "score_hidden": false, "stickied": false, "created": 1492052833.0, "created_utc": 1492024033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_64zufg", "likes": null, "replies": "", "user_reports": [], "id": "dg6upja", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "el_spicy", "parent_id": "t3_64zufg", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "1. No business is ever hands off, ever. You can delegate things you don't like, but you can never ignore them completely.\n\n2. People have done the exact same things you're doing, that's why your business is tough. look you're passionate about what you're winning at and making serious gains and progress at. Don't just be another web design agency - what makes you unique and who can you target? I was in a similar place to you when I was 19 and decided I was going to take my web design agency to the next level by bundling it with 10+ other digital marketing services to create a bundled zero to one single stop shop for any business that wanted to expand its marketing but knew nothing about the web. Before they'd have to consult 3+ services, we'd get them a full, bundled (therefore justifying a huge price) pack with proven results that took care of EVERYTHING. There was nothing brilliant in any of this, it was simple improvisation, but *improvise forward* and figure out new things you can do instead of doing the same old. That company ended up being very successful and I sold it for over 7 times EBITDA.\n\n3.  Finding a passion won't help you win, but winning will find you your passion. What you want is to be a successful, respected entrepreneur, so don't relish moments when you're on or off purpose, relish moments when you meet challenges and face them. You need a sickening mentality to overcome your obstacles. Chinese manufacturers cutting you out? You'll stick it to them! You'll call them somehow and persuade them otherwise, or you'll be the best damn dropshipper who contracts out all the rest that you're irreplaceable. Feeling tired? You're going to slay this feeling and leap out of bed and never think about it again all day. Meeting and beating these challenges is what makes you a winner. Entrepreneurship isn't about the idea alone but the person behind it - how successful you are is a measure of how close you are to a god. Try this: next time you feel stressed, do the first action that comes to mind to solve it without delaying or thinking about it, then keep doing that. yOu lack passion because of too much doubt, not a lack of it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;No business is ever hands off, ever. You can delegate things you don&amp;#39;t like, but you can never ignore them completely.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;People have done the exact same things you&amp;#39;re doing, that&amp;#39;s why your business is tough. look you&amp;#39;re passionate about what you&amp;#39;re winning at and making serious gains and progress at. Don&amp;#39;t just be another web design agency - what makes you unique and who can you target? I was in a similar place to you when I was 19 and decided I was going to take my web design agency to the next level by bundling it with 10+ other digital marketing services to create a bundled zero to one single stop shop for any business that wanted to expand its marketing but knew nothing about the web. Before they&amp;#39;d have to consult 3+ services, we&amp;#39;d get them a full, bundled (therefore justifying a huge price) pack with proven results that took care of EVERYTHING. There was nothing brilliant in any of this, it was simple improvisation, but &lt;em&gt;improvise forward&lt;/em&gt; and figure out new things you can do instead of doing the same old. That company ended up being very successful and I sold it for over 7 times EBITDA.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Finding a passion won&amp;#39;t help you win, but winning will find you your passion. What you want is to be a successful, respected entrepreneur, so don&amp;#39;t relish moments when you&amp;#39;re on or off purpose, relish moments when you meet challenges and face them. You need a sickening mentality to overcome your obstacles. Chinese manufacturers cutting you out? You&amp;#39;ll stick it to them! You&amp;#39;ll call them somehow and persuade them otherwise, or you&amp;#39;ll be the best damn dropshipper who contracts out all the rest that you&amp;#39;re irreplaceable. Feeling tired? You&amp;#39;re going to slay this feeling and leap out of bed and never think about it again all day. Meeting and beating these challenges is what makes you a winner. Entrepreneurship isn&amp;#39;t about the idea alone but the person behind it - how successful you are is a measure of how close you are to a god. Try this: next time you feel stressed, do the first action that comes to mind to solve it without delaying or thinking about it, then keep doing that. yOu lack passion because of too much doubt, not a lack of it.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dg6upja", "score_hidden": false, "stickied": false, "created": 1492072730.0, "created_utc": 1492043930.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_64zufg", "likes": null, "replies": "", "user_reports": [], "id": "dg6qkfh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "androidSan", "parent_id": "t3_64zufg", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "You could study something totally new and promising like AI or genetics if you are inclined that way. That could open you up to new fields in which you didn't know opportunities existed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could study something totally new and promising like AI or genetics if you are inclined that way. That could open you up to new fields in which you didn&amp;#39;t know opportunities existed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dg6qkfh", "score_hidden": false, "stickied": false, "created": 1492067659.0, "created_utc": 1492038859.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_64zufg", "likes": null, "replies": "", "user_reports": [], "id": "dg74h6h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jvtoriello", "parent_id": "t3_64zufg", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "Take a deep breath. You're very young. You need to find an idea that you're passionate about. It takes time. \n\nI'd recommend that you read the following article by Paul Graham:\nhttp://paulgraham.com/startupideas.html\n\n\"The way to get startup ideas is not to try to think of startup ideas. It's to look for problems, preferably problems you have yourself.\n\nThe very best startup ideas tend to have three things in common: they're something the founders themselves want, that they themselves can build, and that few others realize are worth doing. Microsoft, Apple, Yahoo, Google, and Facebook all began this way.\"\n\nGood luck!\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take a deep breath. You&amp;#39;re very young. You need to find an idea that you&amp;#39;re passionate about. It takes time. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d recommend that you read the following article by Paul Graham:\n&lt;a href=\"http://paulgraham.com/startupideas.html\"&gt;http://paulgraham.com/startupideas.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The way to get startup ideas is not to try to think of startup ideas. It&amp;#39;s to look for problems, preferably problems you have yourself.&lt;/p&gt;\n\n&lt;p&gt;The very best startup ideas tend to have three things in common: they&amp;#39;re something the founders themselves want, that they themselves can build, and that few others realize are worth doing. Microsoft, Apple, Yahoo, Google, and Facebook all began this way.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dg74h6h", "score_hidden": false, "stickied": false, "created": 1492085466.0, "created_utc": 1492056666.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_64zufg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_64zufg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_64zufg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_64zufg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_64zufg", "likes": null, "replies": "", "user_reports": [], "id": "dg883g5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BusinessFeed", "parent_id": "t1_dg86iqa", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "Yeah, these are all valid points. I'm 30 years old and I admittedly got a free ride to college. I can totally see how none of this advice was helpful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, these are all valid points. I&amp;#39;m 30 years old and I admittedly got a free ride to college. I can totally see how none of this advice was helpful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dg883g5", "score_hidden": false, "stickied": false, "created": 1492146278.0, "created_utc": 1492117478.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86iqa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "oootime", "parent_id": "t1_dg7f01e", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "I understand what you mean, surely college would be a fun experience, you do a lot of networking, discovery, etc. However you do miss one key point... It cost a LOT of money, and you get into a LOT of debt. I am interested in starting a business... Why would I spend over $50,000 learning how to start a business when I can learn the EXACT same information online for free (or for hundreds rather than thousands).\n\nSure I could do community college and it would be cheaper, but then I don't get any of the benefits you mentioned above. \n\nIt's simply a different path down life. I'm not sure how old you are, but I think my age group really doesn't care about college anymore... It's a thing of the past... Out of everyone I knew from high school only a couple went through with college. Most didn't go (they did short term specialized courses instead that last 1-2 years), and a couple of the ones who did go dropped out because it wasn't worthwhile. My girlfriend went to college, she actually graduates this year, and she has absolutely no idea what she wants to do with her life now... It's either go back to school again, or get a random job, because degrees are kind of useless right now... \n\nimho, specialized training &amp; life experience is better than a degree, it's a better use of money. Maybe it was different 10 years ago, when I was a kid I thought I wanted to go to college for sure, but it seems useless now and I have zero desire... I don't wanna sit in a class with a bunch of 18 year olds, listing to a guy teach us \"business\"... if he knew so much about business he wouldn't be a teacher, he'd be a successful entrepreneur...    ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand what you mean, surely college would be a fun experience, you do a lot of networking, discovery, etc. However you do miss one key point... It cost a LOT of money, and you get into a LOT of debt. I am interested in starting a business... Why would I spend over $50,000 learning how to start a business when I can learn the EXACT same information online for free (or for hundreds rather than thousands).&lt;/p&gt;\n\n&lt;p&gt;Sure I could do community college and it would be cheaper, but then I don&amp;#39;t get any of the benefits you mentioned above. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s simply a different path down life. I&amp;#39;m not sure how old you are, but I think my age group really doesn&amp;#39;t care about college anymore... It&amp;#39;s a thing of the past... Out of everyone I knew from high school only a couple went through with college. Most didn&amp;#39;t go (they did short term specialized courses instead that last 1-2 years), and a couple of the ones who did go dropped out because it wasn&amp;#39;t worthwhile. My girlfriend went to college, she actually graduates this year, and she has absolutely no idea what she wants to do with her life now... It&amp;#39;s either go back to school again, or get a random job, because degrees are kind of useless right now... &lt;/p&gt;\n\n&lt;p&gt;imho, specialized training &amp;amp; life experience is better than a degree, it&amp;#39;s a better use of money. Maybe it was different 10 years ago, when I was a kid I thought I wanted to go to college for sure, but it seems useless now and I have zero desire... I don&amp;#39;t wanna sit in a class with a bunch of 18 year olds, listing to a guy teach us &amp;quot;business&amp;quot;... if he knew so much about business he wouldn&amp;#39;t be a teacher, he&amp;#39;d be a successful entrepreneur...    &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dg86iqa", "score_hidden": false, "stickied": false, "created": 1492144483.0, "created_utc": 1492115683.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7f01e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BusinessFeed", "parent_id": "t1_dg78znu", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "I'm going to step in here, because this isn't what college did for me. I have a few degrees and I don't \"use\" them, but the exposure to things you wouldn't even think of studying forces you to get out of your narrow mind and expand.\n\nThe trend these days is \"college is a waste of time\" and it is something that I feel isn't the best mindset. On paper, this is kind of true, but it's much more abstract than hard numbers. College is a culture of almost tribal proportions and in many cases a rite of passage from adolescence that sparks a lifetime of fulfillment and purpose.\n\nFrom all the people I know who did and didn't go to college, the ones who didn't go to school are the ones who now ultimately regret it.\n\nAnd, true, you might not end up using your degrees DIRECTLY, but the experience will likely enhance your life. Sometimes, it's just exposing you to a type of person you wouldn't normally meet, or introduce you to your future business partner, or the lover that gets your through a night where you might have given up.\n\nJust remember that it will be 1000x easier to go now then trying to do it at 30, 35 or later. Also, at 23, it can be a whole lot of fun.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to step in here, because this isn&amp;#39;t what college did for me. I have a few degrees and I don&amp;#39;t &amp;quot;use&amp;quot; them, but the exposure to things you wouldn&amp;#39;t even think of studying forces you to get out of your narrow mind and expand.&lt;/p&gt;\n\n&lt;p&gt;The trend these days is &amp;quot;college is a waste of time&amp;quot; and it is something that I feel isn&amp;#39;t the best mindset. On paper, this is kind of true, but it&amp;#39;s much more abstract than hard numbers. College is a culture of almost tribal proportions and in many cases a rite of passage from adolescence that sparks a lifetime of fulfillment and purpose.&lt;/p&gt;\n\n&lt;p&gt;From all the people I know who did and didn&amp;#39;t go to college, the ones who didn&amp;#39;t go to school are the ones who now ultimately regret it.&lt;/p&gt;\n\n&lt;p&gt;And, true, you might not end up using your degrees DIRECTLY, but the experience will likely enhance your life. Sometimes, it&amp;#39;s just exposing you to a type of person you wouldn&amp;#39;t normally meet, or introduce you to your future business partner, or the lover that gets your through a night where you might have given up.&lt;/p&gt;\n\n&lt;p&gt;Just remember that it will be 1000x easier to go now then trying to do it at 30, 35 or later. Also, at 23, it can be a whole lot of fun.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dg7f01e", "score_hidden": false, "stickied": false, "created": 1492111343.0, "created_utc": 1492082543.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78znu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "oootime", "parent_id": "t1_dg6qmtb", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "You make a good point, however I don't believe college is the best way to go about it. I'm definitely learning marketing and general business, but I do online courses instead. College would be a waste of capital, I could use that money for other business ventures (and that's how you really learn business, by running a business).\n\nDegrees and certificates are useless if you want to be an entrepreneur. The knowledge is what matters. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You make a good point, however I don&amp;#39;t believe college is the best way to go about it. I&amp;#39;m definitely learning marketing and general business, but I do online courses instead. College would be a waste of capital, I could use that money for other business ventures (and that&amp;#39;s how you really learn business, by running a business).&lt;/p&gt;\n\n&lt;p&gt;Degrees and certificates are useless if you want to be an entrepreneur. The knowledge is what matters. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dg78znu", "score_hidden": false, "stickied": false, "created": 1492094172.0, "created_utc": 1492065372.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qmtb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64zufg", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "I think you should go to college and take classes on business, marketing, finances, etc. until you figure out what to do. This way you come up with new ideas and find paths to go on. It can help you realize how to go about handling your own business. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should go to college and take classes on business, marketing, finances, etc. until you figure out what to do. This way you come up with new ideas and find paths to go on. It can help you realize how to go about handling your own business. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dg6qmtb", "score_hidden": false, "stickied": false, "created": 1492067738.0, "created_utc": 1492038938.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]