[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Long story short, a while back I was applying for marketing jobs, but neither would take me for the lack of experience, so I thought I&amp;#39;d just open my own advertising agency. Later on I figured the revenue options are kind of limited for this and creative projects can always be a hit or miss (hard to convince people to pay you thousands of dollars when they don&amp;#39;t know what they&amp;#39;re going to get and I don&amp;#39;t have a bazillion years of experience to back it up).&lt;br/&gt;\nLuckily, through that I was able to find a very cheap printing company (almost rivals Vista print, definitely cheaper than Moo or Staples), very good quality. They have broker&amp;#39;s program where they give you a website layout with all the printing products catalog and I get to set the prices, but it will be available sometime in mid May, so I figured there&amp;#39;s no point making my own website for the moment, I can just manually fullfill orders in unmarked shipments. The thing I&amp;#39;m having trouble with is how do I get clients? Do I call them, do I walk into the business? If so, which business I should be targeting, from your experience, which ones need printing products the most? Please help, I&amp;#39;m very new to entrepreneurship and I have no one to ask for advice. Thank you in advance!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Long story short, a while back I was applying for marketing jobs, but neither would take me for the lack of experience, so I thought I'd just open my own advertising agency. Later on I figured the revenue options are kind of limited for this and creative projects can always be a hit or miss (hard to convince people to pay you thousands of dollars when they don't know what they're going to get and I don't have a bazillion years of experience to back it up).   \nLuckily, through that I was able to find a very cheap printing company (almost rivals Vista print, definitely cheaper than Moo or Staples), very good quality. They have broker's program where they give you a website layout with all the printing products catalog and I get to set the prices, but it will be available sometime in mid May, so I figured there's no point making my own website for the moment, I can just manually fullfill orders in unmarked shipments. The thing I'm having trouble with is how do I get clients? Do I call them, do I walk into the business? If so, which business I should be targeting, from your experience, which ones need printing products the most? Please help, I'm very new to entrepreneurship and I have no one to ask for advice. Thank you in advance!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Startup Help", "id": "65k7h2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "lavtxa1", "saved": false, "mod_reports": [], "name": "t3_65k7h2", "subreddit_name_prefixed": "r/Entrepreneur", "approved_by": null, "over_18": false, "domain": "self.Entrepreneur", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": "blacknwhitesmall", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Entrepreneur/comments/65k7h2/found_a_cheap_printing_company_but_cant_figure/", "num_reports": null, "locked": false, "stickied": false, "created": 1492305339.0, "url": "https://www.reddit.com/r/Entrepreneur/comments/65k7h2/found_a_cheap_printing_company_but_cant_figure/", "author_flair_text": null, "quarantine": false, "title": "Found a cheap printing company, but cant figure out how to reach clients, I could really use some help, please", "created_utc": 1492276539.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_65k7h2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_65k7h2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_65k7h2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_65k7h2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_65k7h2", "likes": null, "replies": "", "user_reports": [], "id": "dgbnlat", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MaxPrints", "parent_id": "t1_dgbndg9", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "Agreed. Lining up vendors both local and out of state was the first thing I did. Mostly because my competitors all use the same vendors.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed. Lining up vendors both local and out of state was the first thing I did. Mostly because my competitors all use the same vendors.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dgbnlat", "score_hidden": false, "stickied": false, "created": 1492344170.0, "created_utc": 1492315370.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_65k7h2", "likes": null, "replies": "", "user_reports": [], "id": "dgbo4lc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lavtxa1", "parent_id": "t1_dgbndg9", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "You're definitely right, I keep thinking about clients who might need something printed the next day or some customers order that my current vendor will quote me too high for. It seems like the key here is being really good at connecting people, as in having a large network where you can act as a middleman, something I'm yet to acquire and learn unfortunately. Thank you for the advice!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re definitely right, I keep thinking about clients who might need something printed the next day or some customers order that my current vendor will quote me too high for. It seems like the key here is being really good at connecting people, as in having a large network where you can act as a middleman, something I&amp;#39;m yet to acquire and learn unfortunately. Thank you for the advice!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dgbo4lc", "score_hidden": false, "stickied": false, "created": 1492345082.0, "created_utc": 1492316282.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbndg9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "otisday", "parent_id": "t1_dgb3rj5", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "One thing you guys seem to be missing - and its an important thing - a print broker needs to understand different printers have different niches. You'll never survive just using instaprint. \nYou need to know who does multiple part forms at a great price? Where to go for Variable Data printing? Who does ink jet posters same day? Who does foil embossing at a good price. Where can you get color flyers done fast and cheap etc.  Where's a graphic artist who can drop everything to make a logo for business cards this afternoon? All printers aren't the same - you need a network\n\n Any business owner will give you aggressive pricing so you can resell at a profit. You are a great asset - owner has no salary, no insurance or taxes etc related expenses brokering with you.. Kids there's alot of money to be made\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing you guys seem to be missing - and its an important thing - a print broker needs to understand different printers have different niches. You&amp;#39;ll never survive just using instaprint. \nYou need to know who does multiple part forms at a great price? Where to go for Variable Data printing? Who does ink jet posters same day? Who does foil embossing at a good price. Where can you get color flyers done fast and cheap etc.  Where&amp;#39;s a graphic artist who can drop everything to make a logo for business cards this afternoon? All printers aren&amp;#39;t the same - you need a network&lt;/p&gt;\n\n&lt;p&gt;Any business owner will give you aggressive pricing so you can resell at a profit. You are a great asset - owner has no salary, no insurance or taxes etc related expenses brokering with you.. Kids there&amp;#39;s alot of money to be made&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dgbndg9", "score_hidden": false, "stickied": false, "created": 1492343819.0, "created_utc": 1492315019.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3rj5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MaxPrints", "parent_id": "t1_dgb3eah", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "Feel free to msg me if you have any other questions. Print brokering is a decent biz once you get some regulars. LA is a promising area as far as leads, but it also brings about heavy competition. Build those relationships with clients to keep that client lifespan as long as possible ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Feel free to msg me if you have any other questions. Print brokering is a decent biz once you get some regulars. LA is a promising area as far as leads, but it also brings about heavy competition. Build those relationships with clients to keep that client lifespan as long as possible &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dgb3rj5", "score_hidden": false, "stickied": false, "created": 1492315658.0, "created_utc": 1492286858.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3eah", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lavtxa1", "parent_id": "t1_dgb2x8c", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "I do have ancillary services, leftover skills of my time learning what makes a good logo or a poster. The thing is, warm leads haven't lead to any referrals, maybe one or two. I haven't done anything like this before, my previous job was a desk analytics job, so sales is something very foreign to me. I was thinking explore the local market first (I live in the LA area, plenty of opportunities) if I don't beat Vista print price, I'll beat them on customer service (personal delivery, managing the printing process, etc).  \n  \nThank you for the reply, I really appreciate it. I just found myself very discouraged recently, but your post gave me a little hope.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do have ancillary services, leftover skills of my time learning what makes a good logo or a poster. The thing is, warm leads haven&amp;#39;t lead to any referrals, maybe one or two. I haven&amp;#39;t done anything like this before, my previous job was a desk analytics job, so sales is something very foreign to me. I was thinking explore the local market first (I live in the LA area, plenty of opportunities) if I don&amp;#39;t beat Vista print price, I&amp;#39;ll beat them on customer service (personal delivery, managing the printing process, etc).  &lt;/p&gt;\n\n&lt;p&gt;Thank you for the reply, I really appreciate it. I just found myself very discouraged recently, but your post gave me a little hope.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dgb3eah", "score_hidden": false, "stickied": false, "created": 1492315139.0, "created_utc": 1492286339.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2x8c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MaxPrints", "parent_id": "t3_65k7h2", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "I'm in this field, about three years now. Honestly, you need to beat Vistaprint pricing handily, as that's going to be your profit margin. From there, look at your immediate network of friends and acquaintances for leads. It also helps if you have ancillary services, such as design, distribution, etc.\n\nAs for finding clients outside of your network, look around you. I pitched places that I frequented that used print products. I'd make sure I knew what they had, and what I could use as an in, usually a mix of better price and quality. Sometimes they \"have a guy\". When that happens, I usually back off but let them know that if they ever have any doubts about how much they're paying for something, to let me know and I'd be glad to give them a free estimate. If my price is in the same ballpark, now they know that they are getting good prices from their guy. But if not... well, you know the rest.\n\nThere's no rhyme or rule to this. Do good work. Make sure to deliver what you promised. Expect competition. Find good clients, and make sure to build a good relationship with them. Figure out what they value in a print broker, and give them that. It's not always about price or quality or speed, but those are the big ones. Sometimes it's about being able to do anything and everything. I literally try never to say no when asked \"can you print this?\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in this field, about three years now. Honestly, you need to beat Vistaprint pricing handily, as that&amp;#39;s going to be your profit margin. From there, look at your immediate network of friends and acquaintances for leads. It also helps if you have ancillary services, such as design, distribution, etc.&lt;/p&gt;\n\n&lt;p&gt;As for finding clients outside of your network, look around you. I pitched places that I frequented that used print products. I&amp;#39;d make sure I knew what they had, and what I could use as an in, usually a mix of better price and quality. Sometimes they &amp;quot;have a guy&amp;quot;. When that happens, I usually back off but let them know that if they ever have any doubts about how much they&amp;#39;re paying for something, to let me know and I&amp;#39;d be glad to give them a free estimate. If my price is in the same ballpark, now they know that they are getting good prices from their guy. But if not... well, you know the rest.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s no rhyme or rule to this. Do good work. Make sure to deliver what you promised. Expect competition. Find good clients, and make sure to build a good relationship with them. Figure out what they value in a print broker, and give them that. It&amp;#39;s not always about price or quality or speed, but those are the big ones. Sometimes it&amp;#39;s about being able to do anything and everything. I literally try never to say no when asked &amp;quot;can you print this?&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dgb2x8c", "score_hidden": false, "stickied": false, "created": 1492314497.0, "created_utc": 1492285697.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_65k7h2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_65k7h2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_65k7h2", "likes": null, "replies": "", "user_reports": [], "id": "dgcxhaj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "arkofjoy", "parent_id": "t1_dgcdez8", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "Yes, that exactly. He actively works to help others grow their business. \n\nAs for the graphic designer, if she can't meet deadlines, you are going to have to replace her. Your business depends on that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, that exactly. He actively works to help others grow their business. &lt;/p&gt;\n\n&lt;p&gt;As for the graphic designer, if she can&amp;#39;t meet deadlines, you are going to have to replace her. Your business depends on that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dgcxhaj", "score_hidden": false, "stickied": false, "created": 1492422637.0, "created_utc": 1492393837.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdez8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lavtxa1", "parent_id": "t1_dgc2mwm", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "I do have a graphic designer, she's really good, but I need to talk to her seriously in terms of getting work done on a tight deadline.\n\nThat's a good view of things! He sends leads to people as in hears what one guy wants and what the other offers, then connects them to each other? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do have a graphic designer, she&amp;#39;s really good, but I need to talk to her seriously in terms of getting work done on a tight deadline.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s a good view of things! He sends leads to people as in hears what one guy wants and what the other offers, then connects them to each other? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dgcdez8", "score_hidden": false, "stickied": false, "created": 1492395961.0, "created_utc": 1492367161.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc2mwm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "arkofjoy", "parent_id": "t3_65k7h2", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "I have a friend who does this. Two important things he has done to be very successful. He has hired a really good graphic designer. For yourself, you could simply partner with one. Basically say, \"I will send all my graphic design work to you\" but you will be paid on a contract basis. \n\nThe next thing is to network like your life depends on it. He attends 6 different networking groups. And he works really hard to send leads to people. His view is that if his clients businesses grow, they will need more printing done. He also assumes that for every 10 leads he sends to other people, he will get 5 in return.  BUT his goal is always helping other businesses grow. \n\nYou can do this too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a friend who does this. Two important things he has done to be very successful. He has hired a really good graphic designer. For yourself, you could simply partner with one. Basically say, &amp;quot;I will send all my graphic design work to you&amp;quot; but you will be paid on a contract basis. &lt;/p&gt;\n\n&lt;p&gt;The next thing is to network like your life depends on it. He attends 6 different networking groups. And he works really hard to send leads to people. His view is that if his clients businesses grow, they will need more printing done. He also assumes that for every 10 leads he sends to other people, he will get 5 in return.  BUT his goal is always helping other businesses grow. &lt;/p&gt;\n\n&lt;p&gt;You can do this too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dgc2mwm", "score_hidden": false, "stickied": false, "created": 1492381201.0, "created_utc": 1492352401.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qldo", "removal_reason": null, "link_id": "t3_65k7h2", "likes": null, "replies": "", "user_reports": [], "id": "dgbn7ow", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "otisday", "parent_id": "t3_65k7h2", "subreddit_name_prefixed": "r/Entrepreneur", "controversiality": 0, "body": "pretty much every business with a door needs things copied and printed. Open doors and ask. If you are polite, presentable, and maybe a little bit funny someone will buy from you. Do it again and again and again .... then you will have clients\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;pretty much every business with a door needs things copied and printed. Open doors and ask. If you are polite, presentable, and maybe a little bit funny someone will buy from you. Do it again and again and again .... then you will have clients&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Entrepreneur", "name": "t1_dgbn7ow", "score_hidden": false, "stickied": false, "created": 1492343559.0, "created_utc": 1492314759.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]