[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "confession", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;[Remorse] It&amp;#39;s a super long story.&lt;/p&gt;\n\n&lt;p&gt;Imagine this. Me, 24, college drop out, shitty retail job, still living at home. Relatively in shape (I spent most mornings in the gym), pretty fun to be around I guess, into nerdy stuff like video games and anime, but assumed the whole &amp;quot;girlfriend&amp;quot; thing had passed me by in high school. I thought I&amp;#39;d essentially be a virgin forever. &lt;/p&gt;\n\n&lt;p&gt;Cute manager at work named K, a year younger than me suggests we get some food after work. One thing leads to another and after three such &amp;quot;dates&amp;quot; where I fail to get the picture, she kisses me. I feel amazing for two months and we have a blast. I realize I LOVE having sex. How close it makes you feel to your partner. She tells me she is leaving for school two hours away, and I tell her I want to come with her. She agrees and we pick up both our lives and move 5 hours away into a one bedroom.&lt;/p&gt;\n\n&lt;p&gt;When we move in together, she instantly starts having all these huge trust issues. It starts with the idea of polyamory. She wants to go out and date other guys/girls. Essentially a &amp;quot;committed non-monogamous&amp;quot; relationship. Not really what I wanted (I am a one woman man, I told myself) but I&amp;#39;d do it if it meant not hindering her sexuality. I wanted her to be happy.&lt;/p&gt;\n\n&lt;p&gt;However, it wasn&amp;#39;t long after that that all sexual things between us stopped. We stopped having sex, no cuddling, no kissing more than a peck on the lips each morning when I left for work. She explained she had been sexually molested/raped in her past, and doing those things with &amp;quot;someone she trusted&amp;quot; was impossible for her. She was mostly staying home from and playing video games or going to class. I worked two jobs to pay rent and food, sometimes 50 or 60 hours a week. I cooked and cleaned and was &amp;quot;the best boyfriend.&amp;quot; Brutally exhausted, and incredibly sexually frustrated. I begged her for even a handjob, or just a shower together. No dice. I lurked &lt;a href=\"/r/deadbedrooms\"&gt;/r/deadbedrooms&lt;/a&gt; every day, and read books like &amp;quot;No More Mister Nice Guy&amp;quot;. I felt disgusting and starved for physical touch. I went to a really dark place and even considered hurting myself once.&lt;/p&gt;\n\n&lt;p&gt;I reached my limit. Fast forward 7 months, 7 long tense, entirely sexless months. I was on my way to another long day at work and she texts me asking to call. Apparently an emergency. She was just letting me know she was going over to some guy&amp;#39;s house (on a first date, a person she had met on Tinder) and was going to probably be back late. I was dumbstruck. She knew she was going to sex, after months of withholding from me. I told her not to go, and when I got home I broke up with her. She cried for the first time ever in front of me, and even though I&amp;#39;d cried more times than I can count in front of her out of anger or frustration, my eyes were dry. It was like a weight lifted off my chest.&lt;/p&gt;\n\n&lt;p&gt;We continued to live together. I didn&amp;#39;t really have a choice, money-wise. Her parents were paying for half my freedom. I was mostly at work, but I saw the change in her. No more dates, no more class. She sat at home and cried. She barely ate. Depression. It was awful and I felt guilty, but she did it to herself. I gave her every opportunity to just be kind or loving to me, and she never even tried.&lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t long before I found someone else, A, on OKCupid. I can&amp;#39;t even describe in words how nice it was to find someone who actually wanted to be with me. Who WANTS to touch me, kiss me, hold me, etc. We have similar interests. She&amp;#39;s great. Before we had sex, I made it a point to sit down and tell her my living situation. I ended up telling her we probably shouldn&amp;#39;t be together and it sucked, but she understood why I did it, and appreciated it. We went our separate ways without anything happening, but continued to talk via text. I thought we&amp;#39;d be good as just friends. &lt;/p&gt;\n\n&lt;p&gt;Meanwhile, K admitted she wanted back in with me. She told me we would be monogamous this time. She would go to counseling. She would make every effort to make me happy. She kissed me and we had sex because I&amp;#39;m weak and whatever. We got back together. It felt right, at the time. We are practically best friends, after all.&lt;/p&gt;\n\n&lt;p&gt;Already it&amp;#39;s waning again though. A week between sex turned into two. Now it&amp;#39;s been about 18 days since we even slept together. She still spends most nights on the couch. I&amp;#39;m not allowed to bring it up, because it &amp;quot;resets the timer&amp;quot; in her head. I&amp;#39;m supposed to just be patient. Even her therapist suggested we have more sex.&lt;/p&gt;\n\n&lt;p&gt;Yesterday she had to work in the evening, and for once I had it off. My friends were busy. I was lonely. I texted A and asked if she wanted to go out for a friendly bike ride. Sure. We headed out and biked past all these unintentionally romantic places. We got off and chatted and she stood close to me and I could smell her perfume and she looked amazing in the setting sun. I kissed her and she kissed back. I apologized and she said I had nothing to apologize for. She knows about K and still wants to be with me! It feels so so sooo amazing to have someone want to touch you. Put their hands around your neck, their fingers through your hair. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a terrible person. I know this. I never wanted to cheat on anyone. I&amp;#39;m supposed to be a harmless video game nerd. Why do I have to be in this ridiculous situation? Make this choice? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Remorse] It's a super long story.\n\nImagine this. Me, 24, college drop out, shitty retail job, still living at home. Relatively in shape (I spent most mornings in the gym), pretty fun to be around I guess, into nerdy stuff like video games and anime, but assumed the whole \"girlfriend\" thing had passed me by in high school. I thought I'd essentially be a virgin forever. \n\nCute manager at work named K, a year younger than me suggests we get some food after work. One thing leads to another and after three such \"dates\" where I fail to get the picture, she kisses me. I feel amazing for two months and we have a blast. I realize I LOVE having sex. How close it makes you feel to your partner. She tells me she is leaving for school two hours away, and I tell her I want to come with her. She agrees and we pick up both our lives and move 5 hours away into a one bedroom.\n\nWhen we move in together, she instantly starts having all these huge trust issues. It starts with the idea of polyamory. She wants to go out and date other guys/girls. Essentially a \"committed non-monogamous\" relationship. Not really what I wanted (I am a one woman man, I told myself) but I'd do it if it meant not hindering her sexuality. I wanted her to be happy.\n\nHowever, it wasn't long after that that all sexual things between us stopped. We stopped having sex, no cuddling, no kissing more than a peck on the lips each morning when I left for work. She explained she had been sexually molested/raped in her past, and doing those things with \"someone she trusted\" was impossible for her. She was mostly staying home from and playing video games or going to class. I worked two jobs to pay rent and food, sometimes 50 or 60 hours a week. I cooked and cleaned and was \"the best boyfriend.\" Brutally exhausted, and incredibly sexually frustrated. I begged her for even a handjob, or just a shower together. No dice. I lurked /r/deadbedrooms every day, and read books like \"No More Mister Nice Guy\". I felt disgusting and starved for physical touch. I went to a really dark place and even considered hurting myself once.\n\nI reached my limit. Fast forward 7 months, 7 long tense, entirely sexless months. I was on my way to another long day at work and she texts me asking to call. Apparently an emergency. She was just letting me know she was going over to some guy's house (on a first date, a person she had met on Tinder) and was going to probably be back late. I was dumbstruck. She knew she was going to sex, after months of withholding from me. I told her not to go, and when I got home I broke up with her. She cried for the first time ever in front of me, and even though I'd cried more times than I can count in front of her out of anger or frustration, my eyes were dry. It was like a weight lifted off my chest.\n\nWe continued to live together. I didn't really have a choice, money-wise. Her parents were paying for half my freedom. I was mostly at work, but I saw the change in her. No more dates, no more class. She sat at home and cried. She barely ate. Depression. It was awful and I felt guilty, but she did it to herself. I gave her every opportunity to just be kind or loving to me, and she never even tried.\n\nIt wasn't long before I found someone else, A, on OKCupid. I can't even describe in words how nice it was to find someone who actually wanted to be with me. Who WANTS to touch me, kiss me, hold me, etc. We have similar interests. She's great. Before we had sex, I made it a point to sit down and tell her my living situation. I ended up telling her we probably shouldn't be together and it sucked, but she understood why I did it, and appreciated it. We went our separate ways without anything happening, but continued to talk via text. I thought we'd be good as just friends. \n\nMeanwhile, K admitted she wanted back in with me. She told me we would be monogamous this time. She would go to counseling. She would make every effort to make me happy. She kissed me and we had sex because I'm weak and whatever. We got back together. It felt right, at the time. We are practically best friends, after all.\n\nAlready it's waning again though. A week between sex turned into two. Now it's been about 18 days since we even slept together. She still spends most nights on the couch. I'm not allowed to bring it up, because it \"resets the timer\" in her head. I'm supposed to just be patient. Even her therapist suggested we have more sex.\n\nYesterday she had to work in the evening, and for once I had it off. My friends were busy. I was lonely. I texted A and asked if she wanted to go out for a friendly bike ride. Sure. We headed out and biked past all these unintentionally romantic places. We got off and chatted and she stood close to me and I could smell her perfume and she looked amazing in the setting sun. I kissed her and she kissed back. I apologized and she said I had nothing to apologize for. She knows about K and still wants to be with me! It feels so so sooo amazing to have someone want to touch you. Put their hands around your neck, their fingers through your hair. \n\nI'm a terrible person. I know this. I never wanted to cheat on anyone. I'm supposed to be a harmless video game nerd. Why do I have to be in this ridiculous situation? Make this choice? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Remorse", "id": "64qop3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "Whythisdotjpg", "saved": false, "mod_reports": [], "name": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "approved_by": null, "over_18": false, "domain": "self.confession", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qo2a", "edited": 1491916211.0, "link_flair_css_class": "Remorse", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/confession/comments/64qop3/well_im_really_fucking_up_now_cheating_on_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1491944718.0, "url": "https://www.reddit.com/r/confession/comments/64qop3/well_im_really_fucking_up_now_cheating_on_my/", "author_flair_text": null, "quarantine": false, "title": "Well, I'm really fucking up now. Cheating on my girlfriend. [Tough Love]", "created_utc": 1491915918.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 34, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg4af65", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "biggestsexorgan", "parent_id": "t1_dg48pau", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Past time. As someone who is becoming an expert in \"staying too long\" ... OP, you have stayed too long.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Past time. As someone who is becoming an expert in &amp;quot;staying too long&amp;quot; ... OP, you have stayed too long.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg4af65", "score_hidden": false, "stickied": false, "created": 1491948163.0, "created_utc": 1491919363.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5t3mu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SpiritOfSpite", "parent_id": "t1_dg5bty2", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Sooo\n\n\nmoney.\n\"I've already invested so much\"\nAnd \"I can't turn off my feelings\" \n\nDo what you do man. But sounds to me like you're comfortable and making excuses. I bet she tries to change for a month, realizes how hard it is, and nothing changes. She might go see a therapist, she needs to, but she will quit that too. Good luck brother.\n\n\nEdit: and you will be right where you are now. When you are ready, move on", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sooo&lt;/p&gt;\n\n&lt;p&gt;money.\n&amp;quot;I&amp;#39;ve already invested so much&amp;quot;\nAnd &amp;quot;I can&amp;#39;t turn off my feelings&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Do what you do man. But sounds to me like you&amp;#39;re comfortable and making excuses. I bet she tries to change for a month, realizes how hard it is, and nothing changes. She might go see a therapist, she needs to, but she will quit that too. Good luck brother.&lt;/p&gt;\n\n&lt;p&gt;Edit: and you will be right where you are now. When you are ready, move on&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5t3mu", "score_hidden": false, "stickied": false, "created": 1492029973.0, "created_utc": 1492001173.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5bty2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Whythisdotjpg", "parent_id": "t1_dg48pau", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I know. I know it probably is. 3 big problems:\n\n-The obvious one. We still live together. She makes a good roommate. Her parents take care of half the rent. I could move somewhere cheaper, but it'd be tough. Really tough.\n-She said she'd change, and in her long line of boyfriends I'd be the first one she'd do that for. I can't have worked this hard for nothing right? I want to be there for when that change pays off.\n-I still obviously have feelings for her. It's not so easy to just completely walk away?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know. I know it probably is. 3 big problems:&lt;/p&gt;\n\n&lt;p&gt;-The obvious one. We still live together. She makes a good roommate. Her parents take care of half the rent. I could move somewhere cheaper, but it&amp;#39;d be tough. Really tough.\n-She said she&amp;#39;d change, and in her long line of boyfriends I&amp;#39;d be the first one she&amp;#39;d do that for. I can&amp;#39;t have worked this hard for nothing right? I want to be there for when that change pays off.\n-I still obviously have feelings for her. It&amp;#39;s not so easy to just completely walk away?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5bty2", "score_hidden": false, "stickied": false, "created": 1491992427.0, "created_utc": 1491963627.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48pau", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "SpiritOfSpite", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Time to move on my friend. She won't deal with the issues if she doesn't have to, as long as you are there, she doesn't have to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Time to move on my friend. She won&amp;#39;t deal with the issues if she doesn&amp;#39;t have to, as long as you are there, she doesn&amp;#39;t have to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg48pau", "score_hidden": false, "stickied": false, "created": 1491945866.0, "created_utc": 1491917066.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5chrn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Whythisdotjpg", "parent_id": "t1_dg4ejuc", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I do. I want many more like it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do. I want many more like it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5chrn", "score_hidden": false, "stickied": false, "created": 1491993341.0, "created_utc": 1491964541.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ejuc", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "BunnyPerson", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "You're probably going to remember that bike ride forever. Don't let guilt in. Enjoy it and remember it fondly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re probably going to remember that bike ride forever. Don&amp;#39;t let guilt in. Enjoy it and remember it fondly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg4ejuc", "score_hidden": false, "stickied": false, "created": 1491953032.0, "created_utc": 1491924232.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5d4gg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Jaquestrap", "parent_id": "t1_dg5cdyr", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Nah man, you need to tell her that she's just a terrible person, her shitty excuses are her just trying to get you to be her emotional support network while she goes and fucks random guys. She is literally the fucking worst, fuck her issues and fuck her depression--you can't be expected to deal with all of this insufferable shit because she wants to feel good. Tell her to get the hell out of your life--if she's so fucking twisted she deserves any unhappiness she feels. She put you through the most pathetic, unendurable bullshit. Go screw A's brains out, and literally never talk to your toxic ex ever again. \n\nYou don't owe your ex a single fucking thing, fuck her. Tough love dude. The fact that you're still with her is so ridiculous I couldn't even imagine it if I hadn't read it just now. The fact that you feel *any* guilt, that just makes it feel like some sureal fucked up joke. Value yourself dammit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah man, you need to tell her that she&amp;#39;s just a terrible person, her shitty excuses are her just trying to get you to be her emotional support network while she goes and fucks random guys. She is literally the fucking worst, fuck her issues and fuck her depression--you can&amp;#39;t be expected to deal with all of this insufferable shit because she wants to feel good. Tell her to get the hell out of your life--if she&amp;#39;s so fucking twisted she deserves any unhappiness she feels. She put you through the most pathetic, unendurable bullshit. Go screw A&amp;#39;s brains out, and literally never talk to your toxic ex ever again. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t owe your ex a single fucking thing, fuck her. Tough love dude. The fact that you&amp;#39;re still with her is so ridiculous I couldn&amp;#39;t even imagine it if I hadn&amp;#39;t read it just now. The fact that you feel &lt;em&gt;any&lt;/em&gt; guilt, that just makes it feel like some sureal fucked up joke. Value yourself dammit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5d4gg", "score_hidden": false, "stickied": false, "created": 1491994221.0, "created_utc": 1491965421.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5cdyr", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Whythisdotjpg", "parent_id": "t1_dg4ikin", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "&gt;  If she was truly into polyamory she would still be having sex with you, someone she supposedly cares about\n\nI know. When she first told me about \"polyamory\" I was confused and hurt and lost. I found a book on /r/polyamory called \"More than One\" and read the whole thing. I used a lot of the methods inside to deal with jealousy and other negative feelings and hold out as long as I could. But over time it just wore me down. I thought about the guy (I even met him, shook his hand) who fucked her on the couch where we'd hang out and play video games or sleep sometimes. I payed for the couch damn it all. I wanted to do that on it. Me. And I never have. It hurts. It hurts how she to this day won't let me kiss her in public. How she gets upset if I try to grab her butt at home or something. \nThat's why I broke up with her the first time.\n\nYesterday I did all of that with A. On a busy bike path in front of a ton of students!! Neither of us cared who saw, and it felt so good. Amaaaazing. \n\nShe is great. She likes video games like me. I sneakily helped her buy a switch (I work at a game store occasionally) and Zelda, so we're are playing that now. I would really love to sleep with her. Not even sex (yes, that too) but just sleep. Experience what it's like to sleep next to someone who doesn't get upset if part of me is touching her on accident. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If she was truly into polyamory she would still be having sex with you, someone she supposedly cares about&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I know. When she first told me about &amp;quot;polyamory&amp;quot; I was confused and hurt and lost. I found a book on &lt;a href=\"/r/polyamory\"&gt;/r/polyamory&lt;/a&gt; called &amp;quot;More than One&amp;quot; and read the whole thing. I used a lot of the methods inside to deal with jealousy and other negative feelings and hold out as long as I could. But over time it just wore me down. I thought about the guy (I even met him, shook his hand) who fucked her on the couch where we&amp;#39;d hang out and play video games or sleep sometimes. I payed for the couch damn it all. I wanted to do that on it. Me. And I never have. It hurts. It hurts how she to this day won&amp;#39;t let me kiss her in public. How she gets upset if I try to grab her butt at home or something. \nThat&amp;#39;s why I broke up with her the first time.&lt;/p&gt;\n\n&lt;p&gt;Yesterday I did all of that with A. On a busy bike path in front of a ton of students!! Neither of us cared who saw, and it felt so good. Amaaaazing. &lt;/p&gt;\n\n&lt;p&gt;She is great. She likes video games like me. I sneakily helped her buy a switch (I work at a game store occasionally) and Zelda, so we&amp;#39;re are playing that now. I would really love to sleep with her. Not even sex (yes, that too) but just sleep. Experience what it&amp;#39;s like to sleep next to someone who doesn&amp;#39;t get upset if part of me is touching her on accident. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5cdyr", "score_hidden": false, "stickied": false, "created": 1491993194.0, "created_utc": 1491964394.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ikin", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "logician9000", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Sooo let's see .... she wants to screw around with everyone except you and you are supposed to wait for her?  She is totally unsuited to you and sounds like an incredibly selfish person.  If she was truly into polyamory she would still be having sex with you, someone she supposedly cares about.\n\nIf she's depressed, problems in her past etc - that's hers to deal with. You shouldn't be getting this stuff so early in a relationship.\n\nThe other girl sounds great - go out with her!!!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sooo let&amp;#39;s see .... she wants to screw around with everyone except you and you are supposed to wait for her?  She is totally unsuited to you and sounds like an incredibly selfish person.  If she was truly into polyamory she would still be having sex with you, someone she supposedly cares about.&lt;/p&gt;\n\n&lt;p&gt;If she&amp;#39;s depressed, problems in her past etc - that&amp;#39;s hers to deal with. You shouldn&amp;#39;t be getting this stuff so early in a relationship.&lt;/p&gt;\n\n&lt;p&gt;The other girl sounds great - go out with her!!!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg4ikin", "score_hidden": false, "stickied": false, "created": 1491957456.0, "created_utc": 1491928656.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5rg35", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PanzerBear88", "parent_id": "t1_dg5bz2l", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "That means I am not getting it as much as I'd like. Either my wife is not in the mood, or I am not in the mood, or too busy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That means I am not getting it as much as I&amp;#39;d like. Either my wife is not in the mood, or I am not in the mood, or too busy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5rg35", "score_hidden": false, "stickied": false, "created": 1492026936.0, "created_utc": 1491998136.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5bz2l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Whythisdotjpg", "parent_id": "t1_dg4chii", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "&gt; Hey I get it, I am married\n\nWhat does that mean? Pardon my inexperience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Hey I get it, I am married&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What does that mean? Pardon my inexperience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5bz2l", "score_hidden": false, "stickied": false, "created": 1491992624.0, "created_utc": 1491963824.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4chii", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "PanzerBear88", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "OP you need to move out and move on! Also, she is largely to blame for her own feelings. She was going on a date with another dude and said she was going to have sex with him. Who does that if they are in a relationship with some else?! She also wasn't intimate. Hey I get it, I am married, but when you are that young and you both expect certain things out of the relationship, you need to go after what you want and not settle. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP you need to move out and move on! Also, she is largely to blame for her own feelings. She was going on a date with another dude and said she was going to have sex with him. Who does that if they are in a relationship with some else?! She also wasn&amp;#39;t intimate. Hey I get it, I am married, but when you are that young and you both expect certain things out of the relationship, you need to go after what you want and not settle. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg4chii", "score_hidden": false, "stickied": false, "created": 1491950693.0, "created_utc": 1491921893.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg4fflr", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ABalrog", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Please just break things off with the girl you're living with. Don't be weak, she's the one that needs the tough love. If your life situation requires you to continue living together, do so until you can move out but don't let her pull you back in. It's clear she used sex etc. to get you back with her, and in reality she just needs a friend. Be her friend if you like, but be clear you're no longer in a relationship together.\n\nIf you're then not in a relationship with her and \"A\" understands the situation, you should definitely explore your options with A. Go on more dates with her, have a relationship. Hopefully you can go to her place for the sex part, and just avoid taking her back to the place you live with K. Sounds like you're both really into each other and that's worth pursuing but not whilst you're still in a relationship with K.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please just break things off with the girl you&amp;#39;re living with. Don&amp;#39;t be weak, she&amp;#39;s the one that needs the tough love. If your life situation requires you to continue living together, do so until you can move out but don&amp;#39;t let her pull you back in. It&amp;#39;s clear she used sex etc. to get you back with her, and in reality she just needs a friend. Be her friend if you like, but be clear you&amp;#39;re no longer in a relationship together.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re then not in a relationship with her and &amp;quot;A&amp;quot; understands the situation, you should definitely explore your options with A. Go on more dates with her, have a relationship. Hopefully you can go to her place for the sex part, and just avoid taking her back to the place you live with K. Sounds like you&amp;#39;re both really into each other and that&amp;#39;s worth pursuing but not whilst you&amp;#39;re still in a relationship with K.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg4fflr", "score_hidden": false, "stickied": false, "created": 1491954015.0, "created_utc": 1491925215.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg4q9hg", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Itsbilloreilly", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "&gt;She kissed me and we had sex because im weak and whatever\n\nMan, if i had a nickel...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She kissed me and we had sex because im weak and whatever&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Man, if i had a nickel...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg4q9hg", "score_hidden": false, "stickied": false, "created": 1491965837.0, "created_utc": 1491937037.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg4noeo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Artipelago", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "If her will to have sex isn't as high as yours, then why are you still with her if sex is so important to you? Just break it off before it gets ugly and then fuck whoever you want. A lot of her inner conflicts are her fault if she refuses to seek proper help, but cheating on her isn't going to make anything better, so if you really cared for her, you'd leave her before you decide to make stupid decision and just stay as her friend. Move out and move on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If her will to have sex isn&amp;#39;t as high as yours, then why are you still with her if sex is so important to you? Just break it off before it gets ugly and then fuck whoever you want. A lot of her inner conflicts are her fault if she refuses to seek proper help, but cheating on her isn&amp;#39;t going to make anything better, so if you really cared for her, you&amp;#39;d leave her before you decide to make stupid decision and just stay as her friend. Move out and move on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg4noeo", "score_hidden": false, "stickied": false, "created": 1491963037.0, "created_utc": 1491934237.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ckgp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Whythisdotjpg", "parent_id": "t1_dg4sdri", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I know. I realized I hated myself and that's why I left her the first time. I can't even explain why I went back properly. Weakness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know. I realized I hated myself and that&amp;#39;s why I left her the first time. I can&amp;#39;t even explain why I went back properly. Weakness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5ckgp", "score_hidden": false, "stickied": false, "created": 1491993446.0, "created_utc": 1491964646.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4sdri", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bigbobjunk", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Rotflmao, what is there even to consider? If this was a movie you'd hate your character for being such a pushover and putting up with this girl's madness. Imagine the story: really \"nice guy's\" gf doesn't have sex with him, but is actively hooking up with other dudes, while he works hard and tries to make her happy. Wtf! Just step back, and think about how stupid this is - you're better than that man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rotflmao, what is there even to consider? If this was a movie you&amp;#39;d hate your character for being such a pushover and putting up with this girl&amp;#39;s madness. Imagine the story: really &amp;quot;nice guy&amp;#39;s&amp;quot; gf doesn&amp;#39;t have sex with him, but is actively hooking up with other dudes, while he works hard and tries to make her happy. Wtf! Just step back, and think about how stupid this is - you&amp;#39;re better than that man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg4sdri", "score_hidden": false, "stickied": false, "created": 1491968104.0, "created_utc": 1491939304.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5dhbq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jaquestrap", "parent_id": "t1_dg5cm3a", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Jesus Christ dude. You want tough love? Here's some tough love: quit being SO god damn pathetic. Quit thinking about all of this shit and realize that right now you are basically the human equivalent of...I don't even know what, a slug?\n\nGO JUMP A AND SCREW HER LIGHTS OUT. Quit thinking, because apparently your judgement is so terrible I'd be given to think that you get off on treating yourself like rancid shit. Move out, take ALL of your shit, and then literally never think about your ex ever again, let alone contact her. Quit asking stupid questions, quit destroying yourself with your toxic mental gymnastics, hell quit *thinking* and just do what I tell you. If you dont, then you deserve every bit of unhappiness you let yourself wallow in. \n\nI swear, if you can't just do the obvious shit you need to do here, then message me your God damn skype or Facebook or whatever and I will fucking coach you through it. Quit being the world's biggest pussy and man the fuck up. ", "edited": 1492007357.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus Christ dude. You want tough love? Here&amp;#39;s some tough love: quit being SO god damn pathetic. Quit thinking about all of this shit and realize that right now you are basically the human equivalent of...I don&amp;#39;t even know what, a slug?&lt;/p&gt;\n\n&lt;p&gt;GO JUMP A AND SCREW HER LIGHTS OUT. Quit thinking, because apparently your judgement is so terrible I&amp;#39;d be given to think that you get off on treating yourself like rancid shit. Move out, take ALL of your shit, and then literally never think about your ex ever again, let alone contact her. Quit asking stupid questions, quit destroying yourself with your toxic mental gymnastics, hell quit &lt;em&gt;thinking&lt;/em&gt; and just do what I tell you. If you dont, then you deserve every bit of unhappiness you let yourself wallow in. &lt;/p&gt;\n\n&lt;p&gt;I swear, if you can&amp;#39;t just do the obvious shit you need to do here, then message me your God damn skype or Facebook or whatever and I will fucking coach you through it. Quit being the world&amp;#39;s biggest pussy and man the fuck up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5dhbq", "score_hidden": false, "stickied": false, "created": 1491994720.0, "created_utc": 1491965920.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5g37z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ex_plane", "parent_id": "t1_dg5cm3a", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "&gt;Is that really sustainable though? Long-term? \n\nThe question you need to be asking is why on god's earth are you still with your gf. No one can promise you a blissful life, but using common sense will save you a lot of grief. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Is that really sustainable though? Long-term? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The question you need to be asking is why on god&amp;#39;s earth are you still with your gf. No one can promise you a blissful life, but using common sense will save you a lot of grief. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5g37z", "score_hidden": false, "stickied": false, "created": 1491998705.0, "created_utc": 1491969905.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5cm3a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Whythisdotjpg", "parent_id": "t1_dg4t7h4", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "&gt; Ya...it's called a girlfriend. Make her into that. And then do the \"thing\" with her at night until happy enough to sleep.\n\nIs that really sustainable though? Long-term? Is it possible to find someone who wants to do that forever? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Ya...it&amp;#39;s called a girlfriend. Make her into that. And then do the &amp;quot;thing&amp;quot; with her at night until happy enough to sleep.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is that really sustainable though? Long-term? Is it possible to find someone who wants to do that forever? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5cm3a", "score_hidden": false, "stickied": false, "created": 1491993509.0, "created_utc": 1491964709.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4t7h4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ex_plane", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "This is going to sound asshole-like, maybe even misogynistic, but trust me it's not intended to; it's coming with good intentions. \n\n&gt;When we move in together, she instantly starts having all these huge trust issues. It starts with the idea of polyamory. She wants to go out and date other guys/girls. \n\nShe has already cheated on you, which is why she has trust issues.\n\n&gt;Not really what I wanted (I am a one woman man, I told myself) but I'd do it if it meant not hindering her sexuality. I wanted her to be happy.\n\nI'm sure you think this sounds cute and endearing, but it's not. It's this type of weak, \"Chandler Bing\" attitude that even gave her the gall to bring this up to you.\n\n&gt;We stopped having sex, no cuddling, no kissing more than a peck on the lips each morning when I left for work. She explained she had been sexually molested/raped in her past, and doing those things with \"someone she trusted\" was impossible for her\n \nThe things people believe when they're in love. Can't even fault you, I've been that stupid before.\n\n&gt;I worked two jobs to pay rent and food, sometimes 50 or 60 hours a week. I cooked and cleaned and was \"the best boyfriend.\"\n\nIronically, for a girl like this, that's exactly why she doesn't care about you like that. She's just messed up and lonely - that's not love, it's dependency.  \n\n&gt;She was just letting me know she was going over to some guy's house (on a first date, a person she had met on Tinder) and was going to probably be back late.\n\nAgain, when we're in love we choose not to see certain things. This is the clearest sign of \"she doesn't love you, she's just lonely and depends on you\" I've ever seen. Who knows if she even really finds you attractive. You don't. \n\n&gt; I told her not to go, and when I got home I broke up with her.\n\nGood job.\n\n&gt;It wasn't long before I found someone else, A, on OKCupid. \n\nWay to go!\n\n&gt;I ended up telling her we probably shouldn't be together and it sucked, but she understood why I did it, and appreciated it.\n\nwait...what are you doing?\n\n&gt;Meanwhile, K admitted she wanted back in with me. \n\nOh God...stahp\n\n&gt;She told me we would be monogamous this time. She would go to counseling. She would make every effort to make me happy. \n\nBecause she couldn't find anyone else, not because she loves you!\n\n&gt;She kissed me and we had sex because I'm weak and whatever. We got back together.\n\nJesus Christ of Latter Day Saints...\n\n&gt;It felt right, at the time. We are practically best friends, after all.\n\nNo. The words you're looking for is Host and Symbiont.\n\n&gt;Already it's waning again though. A week between sex turned into two. Now it's been about 18 days since we even slept together.\n\nWhoa! That's surprising!\n\n&gt;I texted A and asked if she wanted to go out for a friendly bike ride.\n\n*Mischievous grin..\n\n&gt; I kissed her and she kissed back.\n\nYes...let the lust (I mean love) grow within you.\n\n&gt;It feels so so sooo amazing to have someone want to touch you. Put their hands around your neck, their fingers through your hair.\n \nYa...it's called a girlfriend. Make her into that. And then do the \"thing\" with her at night until happy enough to sleep. \n\n&gt;I'm a terrible person.\n\nNo you're not. you're a weak person that's been tricked into a relationship with a user. Save your youth. Leave her. Do it for her as well as you. \n\n*end \n\n", "edited": 1491941376.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is going to sound asshole-like, maybe even misogynistic, but trust me it&amp;#39;s not intended to; it&amp;#39;s coming with good intentions. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When we move in together, she instantly starts having all these huge trust issues. It starts with the idea of polyamory. She wants to go out and date other guys/girls. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She has already cheated on you, which is why she has trust issues.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Not really what I wanted (I am a one woman man, I told myself) but I&amp;#39;d do it if it meant not hindering her sexuality. I wanted her to be happy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m sure you think this sounds cute and endearing, but it&amp;#39;s not. It&amp;#39;s this type of weak, &amp;quot;Chandler Bing&amp;quot; attitude that even gave her the gall to bring this up to you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We stopped having sex, no cuddling, no kissing more than a peck on the lips each morning when I left for work. She explained she had been sexually molested/raped in her past, and doing those things with &amp;quot;someone she trusted&amp;quot; was impossible for her&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The things people believe when they&amp;#39;re in love. Can&amp;#39;t even fault you, I&amp;#39;ve been that stupid before.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I worked two jobs to pay rent and food, sometimes 50 or 60 hours a week. I cooked and cleaned and was &amp;quot;the best boyfriend.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ironically, for a girl like this, that&amp;#39;s exactly why she doesn&amp;#39;t care about you like that. She&amp;#39;s just messed up and lonely - that&amp;#39;s not love, it&amp;#39;s dependency.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She was just letting me know she was going over to some guy&amp;#39;s house (on a first date, a person she had met on Tinder) and was going to probably be back late.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again, when we&amp;#39;re in love we choose not to see certain things. This is the clearest sign of &amp;quot;she doesn&amp;#39;t love you, she&amp;#39;s just lonely and depends on you&amp;quot; I&amp;#39;ve ever seen. Who knows if she even really finds you attractive. You don&amp;#39;t. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I told her not to go, and when I got home I broke up with her.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Good job.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It wasn&amp;#39;t long before I found someone else, A, on OKCupid. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Way to go!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I ended up telling her we probably shouldn&amp;#39;t be together and it sucked, but she understood why I did it, and appreciated it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;wait...what are you doing?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Meanwhile, K admitted she wanted back in with me. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Oh God...stahp&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She told me we would be monogamous this time. She would go to counseling. She would make every effort to make me happy. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because she couldn&amp;#39;t find anyone else, not because she loves you!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She kissed me and we had sex because I&amp;#39;m weak and whatever. We got back together.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Jesus Christ of Latter Day Saints...&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It felt right, at the time. We are practically best friends, after all.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No. The words you&amp;#39;re looking for is Host and Symbiont.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Already it&amp;#39;s waning again though. A week between sex turned into two. Now it&amp;#39;s been about 18 days since we even slept together.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Whoa! That&amp;#39;s surprising!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I texted A and asked if she wanted to go out for a friendly bike ride.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;*Mischievous grin..&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I kissed her and she kissed back.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes...let the lust (I mean love) grow within you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It feels so so sooo amazing to have someone want to touch you. Put their hands around your neck, their fingers through your hair.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ya...it&amp;#39;s called a girlfriend. Make her into that. And then do the &amp;quot;thing&amp;quot; with her at night until happy enough to sleep. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m a terrible person.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No you&amp;#39;re not. you&amp;#39;re a weak person that&amp;#39;s been tricked into a relationship with a user. Save your youth. Leave her. Do it for her as well as you. &lt;/p&gt;\n\n&lt;p&gt;*end &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg4t7h4", "score_hidden": false, "stickied": false, "created": 1491968983.0, "created_utc": 1491940183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5icg9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mjayybb", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Run. No happiness will come from that. It isn't you dude, it's her. I'm so sorry you are dealing with that. You absolutely deserve physical touch, humans crave interaction with other humans. It's a basic need. \n\nEdited to specify run from K", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Run. No happiness will come from that. It isn&amp;#39;t you dude, it&amp;#39;s her. I&amp;#39;m so sorry you are dealing with that. You absolutely deserve physical touch, humans crave interaction with other humans. It&amp;#39;s a basic need. &lt;/p&gt;\n\n&lt;p&gt;Edited to specify run from K&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5icg9", "score_hidden": false, "stickied": false, "created": 1492002763.0, "created_utc": 1491973963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5cmji", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Whythisdotjpg", "parent_id": "t1_dg4tbuv", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Thank you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5cmji", "score_hidden": false, "stickied": false, "created": 1491993526.0, "created_utc": 1491964726.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4tbuv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mayafoe", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "You're fine.  Not a terrible person.  Get out and let this weird girl live her life....and you go live yours.  You sound like a decent guy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re fine.  Not a terrible person.  Get out and let this weird girl live her life....and you go live yours.  You sound like a decent guy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg4tbuv", "score_hidden": false, "stickied": false, "created": 1491969117.0, "created_utc": 1491940317.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5pkjv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Macncheesedip", "parent_id": "t1_dg5cq4c", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I didn't mean to imply sex and cheating, I kept it open and vague because your \"others\" that you'd look towards can be pretty much anyone you have some kind of relationship with. \nWith my experience, my ex would always complain about me going out with friends or going out without him. Keep in mind we lived in the same city, he'd text me every hour during the day, Skype me after classes for a good 5 more hours, be the last person I talk to when I sleep and the first when I wake up. That for me is too much. With my current SO our conversations last (in total for the day) 4 hours over text, see each other 2-3 times a week, and I like that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t mean to imply sex and cheating, I kept it open and vague because your &amp;quot;others&amp;quot; that you&amp;#39;d look towards can be pretty much anyone you have some kind of relationship with. \nWith my experience, my ex would always complain about me going out with friends or going out without him. Keep in mind we lived in the same city, he&amp;#39;d text me every hour during the day, Skype me after classes for a good 5 more hours, be the last person I talk to when I sleep and the first when I wake up. That for me is too much. With my current SO our conversations last (in total for the day) 4 hours over text, see each other 2-3 times a week, and I like that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5pkjv", "score_hidden": false, "stickied": false, "created": 1492022408.0, "created_utc": 1491993608.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5mk3f", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ABalrog", "parent_id": "t1_dg5cq4c", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Because she wants to shag another guy or guys, and is trying desperately to justify it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because she wants to shag another guy or guys, and is trying desperately to justify it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5mk3f", "score_hidden": false, "stickied": false, "created": 1492013060.0, "created_utc": 1491984260.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5cq4c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Whythisdotjpg", "parent_id": "t1_dg59ili", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I kind of see what you're saying, but what I don't understand is this: why in the scenario does \"looking to other people\" have to mean cheating/sexual relationships? Can't you just spend more time with platonic friends/family?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I kind of see what you&amp;#39;re saying, but what I don&amp;#39;t understand is this: why in the scenario does &amp;quot;looking to other people&amp;quot; have to mean cheating/sexual relationships? Can&amp;#39;t you just spend more time with platonic friends/family?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5cq4c", "score_hidden": false, "stickied": false, "created": 1491993667.0, "created_utc": 1491964867.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg59ili", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Macncheesedip", "parent_id": "t1_dg58j2i", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I learned this in one of my classes but it never really made sense to me either when I heard it. It seems weird until I had an experience like that. One way I can describe it would be saying a swear word or phrase so many times it just loses meaning. I'm not saying you crave attention from others you look to others because you just feel so clustered by your SO. Perhaps clingy and cold would be another way. I'm not a professional so I can't give you a lesson on this but it's better to understand through experience. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I learned this in one of my classes but it never really made sense to me either when I heard it. It seems weird until I had an experience like that. One way I can describe it would be saying a swear word or phrase so many times it just loses meaning. I&amp;#39;m not saying you crave attention from others you look to others because you just feel so clustered by your SO. Perhaps clingy and cold would be another way. I&amp;#39;m not a professional so I can&amp;#39;t give you a lesson on this but it&amp;#39;s better to understand through experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg59ili", "score_hidden": false, "stickied": false, "created": 1491989342.0, "created_utc": 1491960542.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58j2i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ex_plane", "parent_id": "t1_dg57jrc", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Not offense but that doesn't make any sense. If your SO loves you and you crave attention from other people, the fault is on you...  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not offense but that doesn&amp;#39;t make any sense. If your SO loves you and you crave attention from other people, the fault is on you...  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg58j2i", "score_hidden": false, "stickied": false, "created": 1491988091.0, "created_utc": 1491959291.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg57jrc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Macncheesedip", "parent_id": "t1_dg577pf", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "With an ex of mine all he'd say is \"I love you, you're so cute omg\" that stuff \nYou want to have a sense of freedom compared to feeling owned or just surrounded by your SO. If you were too close you'd want some way to prove to yourself that you and your actions aren't by your SO. You'd want to feel like you're still wanted by others. \nI'll change appreciate to closeness and distance ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;With an ex of mine all he&amp;#39;d say is &amp;quot;I love you, you&amp;#39;re so cute omg&amp;quot; that stuff \nYou want to have a sense of freedom compared to feeling owned or just surrounded by your SO. If you were too close you&amp;#39;d want some way to prove to yourself that you and your actions aren&amp;#39;t by your SO. You&amp;#39;d want to feel like you&amp;#39;re still wanted by others. \nI&amp;#39;ll change appreciate to closeness and distance &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg57jrc", "score_hidden": false, "stickied": false, "created": 1491986806.0, "created_utc": 1491958006.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg577pf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ex_plane", "parent_id": "t1_dg52eok", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "&gt;  Most people don't cheat because they're too horny but rather they feel over or under appreciated.\n\nExplain the \"over\" part. That's an interesting take.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Most people don&amp;#39;t cheat because they&amp;#39;re too horny but rather they feel over or under appreciated.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Explain the &amp;quot;over&amp;quot; part. That&amp;#39;s an interesting take.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg577pf", "score_hidden": false, "stickied": false, "created": 1491986372.0, "created_utc": 1491957572.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52eok", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Macncheesedip", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Jesus Christ that's a hell of a roller coaster man \nLet me first reassure you about you cheating. I've been cheated on before and I'm thinking of cheating on my SO. Most people don't cheat because they're too horny but rather they feel too distant or too close to their SO. This can be related to being touchy or cold, sex, behaviour, you have to find a balance. \nI feel like you should still stay friend with A get to know her more. I feel like that's a mistake most people make including me. You know someone for like 4 months, find them really attractive, go into a relationship, 3 months in you're not sure if you made the right choice. \nPerhaps you can see K's therapist as well because for me telling my SO things that I want from them is pretty scary. I had the same sort of past like her but all those things are kept in the back of my head. I can keep a relationship that touchy without having a problem. (Maybe it's just me) \nIn point, get to know A, talk to K about what you want (give and take), if things don't go great then that's the jerk life is.\n\nEDIT: change in words ", "edited": 1491958072.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus Christ that&amp;#39;s a hell of a roller coaster man \nLet me first reassure you about you cheating. I&amp;#39;ve been cheated on before and I&amp;#39;m thinking of cheating on my SO. Most people don&amp;#39;t cheat because they&amp;#39;re too horny but rather they feel too distant or too close to their SO. This can be related to being touchy or cold, sex, behaviour, you have to find a balance. \nI feel like you should still stay friend with A get to know her more. I feel like that&amp;#39;s a mistake most people make including me. You know someone for like 4 months, find them really attractive, go into a relationship, 3 months in you&amp;#39;re not sure if you made the right choice. \nPerhaps you can see K&amp;#39;s therapist as well because for me telling my SO things that I want from them is pretty scary. I had the same sort of past like her but all those things are kept in the back of my head. I can keep a relationship that touchy without having a problem. (Maybe it&amp;#39;s just me) \nIn point, get to know A, talk to K about what you want (give and take), if things don&amp;#39;t go great then that&amp;#39;s the jerk life is.&lt;/p&gt;\n\n&lt;p&gt;EDIT: change in words &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg52eok", "score_hidden": false, "stickied": false, "created": 1491979918.0, "created_utc": 1491951118.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg5kt6p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "usernamerefrain", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Run. Run like the wind, Bullseye! The first gal has a long road ahead of her that you can't fix. It will not end well for you regardless of another love interest. \n\nSounds like you're afraid to let go and want some assurance of something to grab onto. \n\nJust get out of the first relationship.  And develop your sex technique. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Run. Run like the wind, Bullseye! The first gal has a long road ahead of her that you can&amp;#39;t fix. It will not end well for you regardless of another love interest. &lt;/p&gt;\n\n&lt;p&gt;Sounds like you&amp;#39;re afraid to let go and want some assurance of something to grab onto. &lt;/p&gt;\n\n&lt;p&gt;Just get out of the first relationship.  And develop your sex technique. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5kt6p", "score_hidden": false, "stickied": false, "created": 1492008223.0, "created_utc": 1491979423.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64qop3", "likes": null, "replies": "", "user_reports": [], "id": "dg47xcz", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_64qop3", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "The original poster has indicated that this is a tough love thread. Please remember to abide by all rules found in the sidebar with the exception that you can be more blunt.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/confession) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The original poster has indicated that this is a tough love thread. Please remember to abide by all rules found in the sidebar with the exception that you can be more blunt.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/confession\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg47xcz", "score_hidden": false, "stickied": false, "created": 1491944718.0, "created_utc": 1491915918.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]