[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "confession", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;[No Regrets]\nPretty much what the title says.  I have no interest in suicide, I&amp;#39;m not going to engage in risky behavior or do something stupid so I &amp;#39;accidentily&amp;#39; die, I just wish I was already dead.\nI&amp;#39;m a late 30s male on antidepressants that, aside from this glaring inconsistency, are doing pretty well.  If I was to say this to anyone who knows me they would be shocked. I have a good group of friends, some married, some with kids, some single, I&amp;#39;m close with my family.\nI don&amp;#39;t believe that feeling like this is wrong but I will never act on this feeling for many reasons, not the least of which is how it would effect my friends and family.\nI&amp;#39;m not looking for someone to talk me out of doing something I&amp;#39;m not going to do anyway, I&amp;#39;m just curious how others have lived with this feeling.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[No Regrets]\nPretty much what the title says.  I have no interest in suicide, I'm not going to engage in risky behavior or do something stupid so I 'accidentily' die, I just wish I was already dead.\nI'm a late 30s male on antidepressants that, aside from this glaring inconsistency, are doing pretty well.  If I was to say this to anyone who knows me they would be shocked. I have a good group of friends, some married, some with kids, some single, I'm close with my family.\nI don't believe that feeling like this is wrong but I will never act on this feeling for many reasons, not the least of which is how it would effect my friends and family.\nI'm not looking for someone to talk me out of doing something I'm not going to do anyway, I'm just curious how others have lived with this feeling.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "noregrets", "id": "64w420", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "ObviousBurnerName", "saved": false, "mod_reports": [], "name": "t3_64w420", "subreddit_name_prefixed": "r/confession", "approved_by": null, "over_18": false, "domain": "self.confession", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qo2a", "edited": false, "link_flair_css_class": "No Regrets", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/confession/comments/64w420/i_want_to_be_dead/", "num_reports": null, "locked": false, "stickied": false, "created": 1492000897.0, "url": "https://www.reddit.com/r/confession/comments/64w420/i_want_to_be_dead/", "author_flair_text": null, "quarantine": false, "title": "I want to be dead", "created_utc": 1491972097.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64w420", "likes": null, "replies": "", "user_reports": [], "id": "dg5hmls", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "justanotherbetty", "parent_id": "t3_64w420", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I live with this &amp; have lived with this feeling for 30+ years. It sucks &amp; I'm medicated to high hell to keep me feeling \"normal\" I'm 43f BTW. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I live with this &amp;amp; have lived with this feeling for 30+ years. It sucks &amp;amp; I&amp;#39;m medicated to high hell to keep me feeling &amp;quot;normal&amp;quot; I&amp;#39;m 43f BTW. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5hmls", "score_hidden": false, "stickied": false, "created": 1492001406.0, "created_utc": 1491972606.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64w420", "likes": null, "replies": "", "user_reports": [], "id": "dg5i40j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Mjayybb", "parent_id": "t3_64w420", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "25f lots of meds have felt this way my whole life. I swear if there's an afterlife I'll have to off myself there, one life is enough for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;25f lots of meds have felt this way my whole life. I swear if there&amp;#39;s an afterlife I&amp;#39;ll have to off myself there, one life is enough for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg5i40j", "score_hidden": false, "stickied": false, "created": 1492002317.0, "created_utc": 1491973517.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64w420", "likes": null, "replies": "", "user_reports": [], "id": "dg67q2f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bigbillyjoe123", "parent_id": "t3_64w420", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Same here, don't know what drives these thoughts ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same here, don&amp;#39;t know what drives these thoughts &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg67q2f", "score_hidden": false, "stickied": false, "created": 1492047038.0, "created_utc": 1492018238.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64w420", "likes": null, "replies": "", "user_reports": [], "id": "dg6ao3l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Moomooprophet", "parent_id": "t3_64w420", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "\nEverything I speak of are ways to improve your inner self. Even big gym rats with great bodies have depression, depression is a multilayered problem, but more so most of these problems are from the lack of people's innerselves.\n\nEating good effects your daily energy levels + mentality+ physical. Exercising will build your responsibility and your discipline. The most hard to get sought after virtue to have when fighting depression is discipline and consistency. \n\nYou can do everything I said and if you don't actually go exercise in your home check out youtube for home exercises that are free or even walks, if you don't nail down that routine or discipline then you may or may not cure depression. Still I have a hard time with going to the gym or working out but thats just personally my hurdle right now.\n\nEating+journal+meditation (ever small to start out, just keep doing it no matter how long or how short, just do it) will help with confidence into nailing down those routines and good habits in place.\n\nWithout the power of mind which is happening right now with everyone being so convoluted with the society and world they live in they run on habits good and bad. Your job is do nail down these good habits and get rid of the bad ones by building will power.\n\nIf you have a mental illness and you go to the doctor and get medication and take it don't expect it to solve it, no medication can do that right now, fight the illness by speaking to yourself in a better man, treat yourself better with respect and dignity. Learn these routines even from the first step when you don't believe you can do it and you will eventually find yourself telling yourself you can do things and you'll get through the fears.\n\nStart saying yes to new experiences, if a friend invites you to hang outside go for it. If your isolating yourself from people in your house and not leaving it your doing it wrong, if you want isolation then go drive to a national park, make it a routine every month or every few weeks or a close by place to go see the nature and spend your day walking in the woods to isolate. Go isolate yourself from your fellow man by going into nature away from the city.\n\nAnd get off your damn phone, I don't own a cell phone I know I'm weird but it's taught me to take everything at face value. It's a bad habit and addiction, spikes your dopamine levels like sugar when you find out something new. You have the worlds entire information in the palm of you hand, treat it with respect or it will grab your entire waking life with its bedazzling treats and tricks. Use it to improve yourself not distracting, if your not responsible enough stop using it unless you need to. \n\nLast note: Remember I said I didn't cure depression but no doubt do I believe specially from some of the books by leading psychologists that there is a cure right now, but you need to do the work. If your finding yourself all overhwleming just listen to those self development speakers and start a journal first. spend 30 days of conscious planning setting aside time in the day to write in a journal, actually hand write. If you want to chat I don't get on reddit much but when I do just send me messages. I'm improving, I know now when I'm doing negative things that will affect me and what I can do to improve.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything I speak of are ways to improve your inner self. Even big gym rats with great bodies have depression, depression is a multilayered problem, but more so most of these problems are from the lack of people&amp;#39;s innerselves.&lt;/p&gt;\n\n&lt;p&gt;Eating good effects your daily energy levels + mentality+ physical. Exercising will build your responsibility and your discipline. The most hard to get sought after virtue to have when fighting depression is discipline and consistency. &lt;/p&gt;\n\n&lt;p&gt;You can do everything I said and if you don&amp;#39;t actually go exercise in your home check out youtube for home exercises that are free or even walks, if you don&amp;#39;t nail down that routine or discipline then you may or may not cure depression. Still I have a hard time with going to the gym or working out but thats just personally my hurdle right now.&lt;/p&gt;\n\n&lt;p&gt;Eating+journal+meditation (ever small to start out, just keep doing it no matter how long or how short, just do it) will help with confidence into nailing down those routines and good habits in place.&lt;/p&gt;\n\n&lt;p&gt;Without the power of mind which is happening right now with everyone being so convoluted with the society and world they live in they run on habits good and bad. Your job is do nail down these good habits and get rid of the bad ones by building will power.&lt;/p&gt;\n\n&lt;p&gt;If you have a mental illness and you go to the doctor and get medication and take it don&amp;#39;t expect it to solve it, no medication can do that right now, fight the illness by speaking to yourself in a better man, treat yourself better with respect and dignity. Learn these routines even from the first step when you don&amp;#39;t believe you can do it and you will eventually find yourself telling yourself you can do things and you&amp;#39;ll get through the fears.&lt;/p&gt;\n\n&lt;p&gt;Start saying yes to new experiences, if a friend invites you to hang outside go for it. If your isolating yourself from people in your house and not leaving it your doing it wrong, if you want isolation then go drive to a national park, make it a routine every month or every few weeks or a close by place to go see the nature and spend your day walking in the woods to isolate. Go isolate yourself from your fellow man by going into nature away from the city.&lt;/p&gt;\n\n&lt;p&gt;And get off your damn phone, I don&amp;#39;t own a cell phone I know I&amp;#39;m weird but it&amp;#39;s taught me to take everything at face value. It&amp;#39;s a bad habit and addiction, spikes your dopamine levels like sugar when you find out something new. You have the worlds entire information in the palm of you hand, treat it with respect or it will grab your entire waking life with its bedazzling treats and tricks. Use it to improve yourself not distracting, if your not responsible enough stop using it unless you need to. &lt;/p&gt;\n\n&lt;p&gt;Last note: Remember I said I didn&amp;#39;t cure depression but no doubt do I believe specially from some of the books by leading psychologists that there is a cure right now, but you need to do the work. If your finding yourself all overhwleming just listen to those self development speakers and start a journal first. spend 30 days of conscious planning setting aside time in the day to write in a journal, actually hand write. If you want to chat I don&amp;#39;t get on reddit much but when I do just send me messages. I&amp;#39;m improving, I know now when I&amp;#39;m doing negative things that will affect me and what I can do to improve.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg6ao3l", "score_hidden": false, "stickied": false, "created": 1492050037.0, "created_utc": 1492021237.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_64w420", "likes": null, "replies": "", "user_reports": [], "id": "dg6aqir", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Moomooprophet", "parent_id": "t3_64w420", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I've dealt with depression for over 15+ years. 28/m. I do not condone the following way I'm about to describe to you how to cure depression, in fact without incredible amount of research I would suggest you do not do what I am doing because everyone is different.\n\nI'm recovering from depression slowly and it's an uphill battle. I tried to commit suicide a couple years back but ever since then I've most passed that stage and will not go back to it. Suicidal thoughts and ideas no longer occur in my head and now I'm just depressed partially, not as much as I used to be so I'm seeing progress. I have only taken medication 1 week and got off it as soon as possible.\n\nWhat I've come to believe is depression isn't an illness but a false construct you made in your brain yourself by exercising bad and self-harmful mindsets so frequently that it's stapled that in your mind as an automatic habit.\n\nThere are a few books talking about the cure of depression. Theres a new drug coming out that's claiming the burden has been finally lifted -- testimonials. The cure for depression and other books talk about that medication can help and is encouraged but is a small part of it.  Other principles must be exercised such as healthy diet and exercise. Physical activities and outside activities whether its walk in your local or provincial parks. if you have no parks even 30 mins 2x a week to start is good exercise.\n\nDepression is fought every day by doing things you don't want to do, go out, go for walk, talk to your friends don't isolate, forcefully pry yourself open instead of building walls. Do this every day and write about your progress in a journal go buy one its $15 dollars. Start with a routine and every time your bastard self tells you to stay in and stay in bed you need to take control of that voice and say \" I'm going for a walk\". That demeaning voice is not you but your mind doing a routine thats been engrained in your mind by your younger stupid self that sabotaged you by listening to it far to long.\n\nTake back control of your mind with healthy eating, eat fruits,veggies only 1 hand palm full of meat each day, grains, seeds,legumes. I'm going vegetarian/vegan. Stopped eating fastfood and sodas and have more daily energy in my body. I've lost over 40 pounds since i stopped with soda and juice (sugar filled) just by diet alone. \n\nI love philosophy and meditation, inspiration is good to. I will go to inspiration and motivation reddits and listen to them over and over and over, it helps building confidence. If your dealing with depression the best two words you need to know before anything else is \"Self-Development\" look up series by Jim Rohn, listen to Tony Robbins ( he's good), Les Brown, surround your information pallet with improvement instead of negative things. Go on a media cleansing diet and social media diet (everything you consume will have an effect on the way you view the world and you need to see a positive world ahead of you somewhat to help with your improvement. You need to work on yourself before you should be concerned in whats happening in politics or in the world. If your concerned because you care rest assured the best way you can change the world is by improving your life first, become strong and live life with purpose day by day and others will look at how you are doing and be inspired.\n\nBe the change you want to see in the world. Take meditation for a sense of self, focus on breathing closed eyes cross legs spine straight and curl tongue to top of your mouth and vibrate \"Ohm\" Always focus breathing for 40 mins a day multiple times a week. by 3 weeks hopefully you will fall into a meditative state you can drift to your problems and think on them. The fact with why people are continuously sick in their own minds is because the world dumps mind pollution on us through experiences, thoughts ideas or incidences. You need to guard your mind and dust it off and clean it. dust it off with mediation and then clean it with meditation. Journalling your day every day is a form of meditation. Jordan Peterson talks about self-authoring its his program but the art of journalism and the practicing of daily logging actually is very very good.\n\nBy journalling your thoughts and observations every day you give yourself the sight to see and read what you really thought of something and why, you can always go back to it. Take the problems each day you had a problem with and write them down on the bottom of the page to continue to think about, make progress and form your own opinions about these. Journalling and giving time to do so gives you time in your own day to question and ask yourself whats going on. You can observe yourself improve yourself, analyze yourself and correct yourself.\n\nEdit:Typos", "edited": 1492021681.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve dealt with depression for over 15+ years. 28/m. I do not condone the following way I&amp;#39;m about to describe to you how to cure depression, in fact without incredible amount of research I would suggest you do not do what I am doing because everyone is different.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m recovering from depression slowly and it&amp;#39;s an uphill battle. I tried to commit suicide a couple years back but ever since then I&amp;#39;ve most passed that stage and will not go back to it. Suicidal thoughts and ideas no longer occur in my head and now I&amp;#39;m just depressed partially, not as much as I used to be so I&amp;#39;m seeing progress. I have only taken medication 1 week and got off it as soon as possible.&lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;ve come to believe is depression isn&amp;#39;t an illness but a false construct you made in your brain yourself by exercising bad and self-harmful mindsets so frequently that it&amp;#39;s stapled that in your mind as an automatic habit.&lt;/p&gt;\n\n&lt;p&gt;There are a few books talking about the cure of depression. Theres a new drug coming out that&amp;#39;s claiming the burden has been finally lifted -- testimonials. The cure for depression and other books talk about that medication can help and is encouraged but is a small part of it.  Other principles must be exercised such as healthy diet and exercise. Physical activities and outside activities whether its walk in your local or provincial parks. if you have no parks even 30 mins 2x a week to start is good exercise.&lt;/p&gt;\n\n&lt;p&gt;Depression is fought every day by doing things you don&amp;#39;t want to do, go out, go for walk, talk to your friends don&amp;#39;t isolate, forcefully pry yourself open instead of building walls. Do this every day and write about your progress in a journal go buy one its $15 dollars. Start with a routine and every time your bastard self tells you to stay in and stay in bed you need to take control of that voice and say &amp;quot; I&amp;#39;m going for a walk&amp;quot;. That demeaning voice is not you but your mind doing a routine thats been engrained in your mind by your younger stupid self that sabotaged you by listening to it far to long.&lt;/p&gt;\n\n&lt;p&gt;Take back control of your mind with healthy eating, eat fruits,veggies only 1 hand palm full of meat each day, grains, seeds,legumes. I&amp;#39;m going vegetarian/vegan. Stopped eating fastfood and sodas and have more daily energy in my body. I&amp;#39;ve lost over 40 pounds since i stopped with soda and juice (sugar filled) just by diet alone. &lt;/p&gt;\n\n&lt;p&gt;I love philosophy and meditation, inspiration is good to. I will go to inspiration and motivation reddits and listen to them over and over and over, it helps building confidence. If your dealing with depression the best two words you need to know before anything else is &amp;quot;Self-Development&amp;quot; look up series by Jim Rohn, listen to Tony Robbins ( he&amp;#39;s good), Les Brown, surround your information pallet with improvement instead of negative things. Go on a media cleansing diet and social media diet (everything you consume will have an effect on the way you view the world and you need to see a positive world ahead of you somewhat to help with your improvement. You need to work on yourself before you should be concerned in whats happening in politics or in the world. If your concerned because you care rest assured the best way you can change the world is by improving your life first, become strong and live life with purpose day by day and others will look at how you are doing and be inspired.&lt;/p&gt;\n\n&lt;p&gt;Be the change you want to see in the world. Take meditation for a sense of self, focus on breathing closed eyes cross legs spine straight and curl tongue to top of your mouth and vibrate &amp;quot;Ohm&amp;quot; Always focus breathing for 40 mins a day multiple times a week. by 3 weeks hopefully you will fall into a meditative state you can drift to your problems and think on them. The fact with why people are continuously sick in their own minds is because the world dumps mind pollution on us through experiences, thoughts ideas or incidences. You need to guard your mind and dust it off and clean it. dust it off with mediation and then clean it with meditation. Journalling your day every day is a form of meditation. Jordan Peterson talks about self-authoring its his program but the art of journalism and the practicing of daily logging actually is very very good.&lt;/p&gt;\n\n&lt;p&gt;By journalling your thoughts and observations every day you give yourself the sight to see and read what you really thought of something and why, you can always go back to it. Take the problems each day you had a problem with and write them down on the bottom of the page to continue to think about, make progress and form your own opinions about these. Journalling and giving time to do so gives you time in your own day to question and ask yourself whats going on. You can observe yourself improve yourself, analyze yourself and correct yourself.&lt;/p&gt;\n\n&lt;p&gt;Edit:Typos&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg6aqir", "score_hidden": false, "stickied": false, "created": 1492050108.0, "created_utc": 1492021308.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]