[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "confession", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ever since I&amp;#39;ve found out, I have never told a soul. Until now. This is going to be long, so I thank everyone for fully reading and I apologize for the typos. &lt;/p&gt;\n\n&lt;p&gt;While I was growing up, all 3 of my brothers have met their fathers and also know who they are, but me. Growing up, I didn&amp;#39;t understand why I didn&amp;#39;t know my father. All that I was told that my father was white and he was in prison. I was a kid, so I believed it. &lt;/p&gt;\n\n&lt;p&gt;Before I went to middle school, my mother went to jail. While she was in there, she did a paternity test. They all are correct, but mine. I remember her crying to me saying that she didn&amp;#39;t know who he was and how sorry she was. I didn&amp;#39;t fully grasp it because I didn&amp;#39;t have a male figure in my life to begin with, so I was ok. &lt;/p&gt;\n\n&lt;p&gt;In high school, this situation crossed my mind more often than usual. That&amp;#39;s when I realized that when my mother had me, she literally just turned 16. Which meant that she was pregnant while she was 15. Being a teenager myself was rough, but having to imagine being pregnant on top of that is something that I would NOT want to be. But at the same time I became more and more angry at the guy that did this to my mom. How can someone pry themselves into a young female, knock them up, and then leave?! But then again, I remember my mother saying that she didn&amp;#39;t remember who he was... So how can a young female pry herself open to so many people that she doesn&amp;#39;t know who her first child&amp;#39;s father was?! HOW CAN YOU NOT KNOW?! This is when my anger towards her progressed more. &lt;/p&gt;\n\n&lt;p&gt;Now, I&amp;#39;m in college. I moved 1,300 miles away from home to make a name for myself, to start fresh. This missing thing of who my father is is still eating me alive. It&amp;#39;s time for me figure out myself. All of these years that I have been in existence and he has never looked for me?! This is bullshit! So I started my research but where to begin...&lt;/p&gt;\n\n&lt;p&gt;Two years ago I started asking around. But they all got pissed at me for asking about my father or they would say that they will talk to me later about it and i wouldn&amp;#39;t hear from them for the next week.  I was over this shit, I called my mom finally and told hr that I demanded to know. I was told that she would tell me when I came home for thanksgiving. FINALLY! Some results. &lt;/p&gt;\n\n&lt;p&gt;When I made it back home, the first thing I did was ask about who my sperm donor was. But once again, my answer was blown off... something was fishy... the way that they keep blowing me off on a simple answer... When my mother drove me back to the airport, I finally got the courage to ask her again, but this time as a different question. Was this man Right under my nose this whole time? She said yes. I asked her who it was. She told me that it was our uncle. Her mothers brother did this to her. And with the most saddest look on her face, she said sorry. There was nothing else for me to say, but how it was ok. As soon as she dropped me off and left, I started bawling my eyes out and I quite haven&amp;#39;t stopped. &lt;/p&gt;\n\n&lt;p&gt;My uncle climbed on top of my 15 year old girl, HIS 15 YEAR OLD NIECE, and got her pregnant. Not only that, everyone in my family KNEW, AND she was forced to keep me! FUCKING DISGUSTING! Here I am, going through my life wondering, while literally EVERYONE knew this secret! Not only that, but my mother had to bring him into our house to live with us for a year. No fucking way! I give her props for this because that is something that I would NEVER do! I completely get it now... the way my family members would look at me growing up.... how they would ask my grandmother if there was something wrong with me... always having the &amp;quot;good touch, bad touch&amp;quot; conversation, but my none of my other cousins or brothers having the same conversation...&lt;/p&gt;\n\n&lt;p&gt;What if they are right? What if there is something wrong with me? I&amp;#39;ve done some research on kids who were born out of incest, majority of the aren&amp;#39;t all mentally or aesthetically normal. On top of that, what about the future of my children? What if I find a man who is somehow crazy about me, we have kids, and I end up giving them my fucked up genes? Can I even have kids? How can someone even love me after hearing who my father is or why I can&amp;#39;t have kids?! If I could go back in time and take my mother to get an abortion in order to take this nightmare of staring  and taking care of her rapist&amp;#39;s child everyday, I would do it so fucking fast. &lt;/p&gt;\n\n&lt;p&gt;My whole entire family ain&amp;#39;t shit for letting this carry on, ruining the life of a 15 year old girl, and NOT REPORTING THIS TO THE POLICE! This pain is constant and it doesn&amp;#39;t go away. Every waking moment of my existence I wish that I was fucking dead. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ever since I've found out, I have never told a soul. Until now. This is going to be long, so I thank everyone for fully reading and I apologize for the typos. \n\nWhile I was growing up, all 3 of my brothers have met their fathers and also know who they are, but me. Growing up, I didn't understand why I didn't know my father. All that I was told that my father was white and he was in prison. I was a kid, so I believed it. \n\nBefore I went to middle school, my mother went to jail. While she was in there, she did a paternity test. They all are correct, but mine. I remember her crying to me saying that she didn't know who he was and how sorry she was. I didn't fully grasp it because I didn't have a male figure in my life to begin with, so I was ok. \n\nIn high school, this situation crossed my mind more often than usual. That's when I realized that when my mother had me, she literally just turned 16. Which meant that she was pregnant while she was 15. Being a teenager myself was rough, but having to imagine being pregnant on top of that is something that I would NOT want to be. But at the same time I became more and more angry at the guy that did this to my mom. How can someone pry themselves into a young female, knock them up, and then leave?! But then again, I remember my mother saying that she didn't remember who he was... So how can a young female pry herself open to so many people that she doesn't know who her first child's father was?! HOW CAN YOU NOT KNOW?! This is when my anger towards her progressed more. \n\nNow, I'm in college. I moved 1,300 miles away from home to make a name for myself, to start fresh. This missing thing of who my father is is still eating me alive. It's time for me figure out myself. All of these years that I have been in existence and he has never looked for me?! This is bullshit! So I started my research but where to begin...\n\nTwo years ago I started asking around. But they all got pissed at me for asking about my father or they would say that they will talk to me later about it and i wouldn't hear from them for the next week.  I was over this shit, I called my mom finally and told hr that I demanded to know. I was told that she would tell me when I came home for thanksgiving. FINALLY! Some results. \n\nWhen I made it back home, the first thing I did was ask about who my sperm donor was. But once again, my answer was blown off... something was fishy... the way that they keep blowing me off on a simple answer... When my mother drove me back to the airport, I finally got the courage to ask her again, but this time as a different question. Was this man Right under my nose this whole time? She said yes. I asked her who it was. She told me that it was our uncle. Her mothers brother did this to her. And with the most saddest look on her face, she said sorry. There was nothing else for me to say, but how it was ok. As soon as she dropped me off and left, I started bawling my eyes out and I quite haven't stopped. \n\nMy uncle climbed on top of my 15 year old girl, HIS 15 YEAR OLD NIECE, and got her pregnant. Not only that, everyone in my family KNEW, AND she was forced to keep me! FUCKING DISGUSTING! Here I am, going through my life wondering, while literally EVERYONE knew this secret! Not only that, but my mother had to bring him into our house to live with us for a year. No fucking way! I give her props for this because that is something that I would NEVER do! I completely get it now... the way my family members would look at me growing up.... how they would ask my grandmother if there was something wrong with me... always having the \"good touch, bad touch\" conversation, but my none of my other cousins or brothers having the same conversation...\n\nWhat if they are right? What if there is something wrong with me? I've done some research on kids who were born out of incest, majority of the aren't all mentally or aesthetically normal. On top of that, what about the future of my children? What if I find a man who is somehow crazy about me, we have kids, and I end up giving them my fucked up genes? Can I even have kids? How can someone even love me after hearing who my father is or why I can't have kids?! If I could go back in time and take my mother to get an abortion in order to take this nightmare of staring  and taking care of her rapist's child everyday, I would do it so fucking fast. \n\nMy whole entire family ain't shit for letting this carry on, ruining the life of a 15 year old girl, and NOT REPORTING THIS TO THE POLICE! This pain is constant and it doesn't go away. Every waking moment of my existence I wish that I was fucking dead. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Conflicted", "id": "65az99", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 31, "report_reasons": null, "author": "B3ar_Fight", "saved": false, "mod_reports": [], "name": "t3_65az99", "subreddit_name_prefixed": "r/confession", "approved_by": null, "over_18": false, "domain": "self.confession", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qo2a", "edited": false, "link_flair_css_class": "Conflicted", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/confession/comments/65az99/conflicted_i_am_the_product_of_underage_incest/", "num_reports": null, "locked": false, "stickied": false, "created": 1492179484.0, "url": "https://www.reddit.com/r/confession/comments/65az99/conflicted_i_am_the_product_of_underage_incest/", "author_flair_text": null, "quarantine": false, "title": "[Conflicted] I am the product of underage incest rape.", "created_utc": 1492150684.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 31}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": "", "user_reports": [], "id": "dg9dk6v", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "vizsla_velcro", "parent_id": "t3_65az99", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Woah. The inescapable fucked-upped-ness aside,  you can rest easy if you decide to have kids. The genetic dangers of incest are mostly based on ending up with TWO copies of a rare trait. You only pass one set of genes to your kids. The other parent provides the second set to make a pair. In the population at large,  finding two people with the same undesirable trait is extremely rare. Within a family,  however,  it's much more common. The 2 takeaway points of this are:\n\n1) There may be literally no overt negative *genetic* effects of your parentage.\n\n2) Even if you do have an unwanted genetic trait as a result, your chances of passing it on are no greater than your other siblings had. The chances of you finding a non-related partner with a similar \"bad\" version of a gene is astronomical. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Woah. The inescapable fucked-upped-ness aside,  you can rest easy if you decide to have kids. The genetic dangers of incest are mostly based on ending up with TWO copies of a rare trait. You only pass one set of genes to your kids. The other parent provides the second set to make a pair. In the population at large,  finding two people with the same undesirable trait is extremely rare. Within a family,  however,  it&amp;#39;s much more common. The 2 takeaway points of this are:&lt;/p&gt;\n\n&lt;p&gt;1) There may be literally no overt negative &lt;em&gt;genetic&lt;/em&gt; effects of your parentage.&lt;/p&gt;\n\n&lt;p&gt;2) Even if you do have an unwanted genetic trait as a result, your chances of passing it on are no greater than your other siblings had. The chances of you finding a non-related partner with a similar &amp;quot;bad&amp;quot; version of a gene is astronomical. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg9dk6v", "score_hidden": false, "stickied": false, "created": 1492216676.0, "created_utc": 1492187876.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": "", "user_reports": [], "id": "dg9kjn0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "OneAutumnLeaff", "parent_id": "t3_65az99", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Im sorry for that. But for me, i dont mind a girl that i will marry is a product of incest, because that was already in the past. And that information doesnt change the way how the particular girl loves me. So i hope you dont think that way..  if your boyfriend treat you badly because of that information, i recommend you to leave him.. because loving someone for who they are is what matters not who they came from....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im sorry for that. But for me, i dont mind a girl that i will marry is a product of incest, because that was already in the past. And that information doesnt change the way how the particular girl loves me. So i hope you dont think that way..  if your boyfriend treat you badly because of that information, i recommend you to leave him.. because loving someone for who they are is what matters not who they came from....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg9kjn0", "score_hidden": false, "stickied": false, "created": 1492224813.0, "created_utc": 1492196013.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": "", "user_reports": [], "id": "dga6i44", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "logicfordays", "parent_id": "t3_65az99", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "There was an ask reddit thread about children of incest. You should check it out. It actually was really uplifting in that many people were able to go on to live normal happy lives through therapy and time. Best of luck to you in all that you do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There was an ask reddit thread about children of incest. You should check it out. It actually was really uplifting in that many people were able to go on to live normal happy lives through therapy and time. Best of luck to you in all that you do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dga6i44", "score_hidden": false, "stickied": false, "created": 1492253481.0, "created_utc": 1492224681.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": "", "user_reports": [], "id": "dg9aq5k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "B3ar_Fight", "parent_id": "t1_dg8v916", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "The mods deleted it. It should come back soon. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The mods deleted it. It should come back soon. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg9aq5k", "score_hidden": false, "stickied": false, "created": 1492213497.0, "created_utc": 1492184697.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8v916", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HerefortheWildCat", "parent_id": "t1_dg8v1v8", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "No, it's ok. I'm not really that invested. I hope that you were able to offer some sage advice or at least an attentive fingertip. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, it&amp;#39;s ok. I&amp;#39;m not really that invested. I hope that you were able to offer some sage advice or at least an attentive fingertip. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg8v916", "score_hidden": false, "stickied": false, "created": 1492181086.0, "created_utc": 1492152286.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8v1v8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iThinkiThink2Much", "parent_id": "t1_dg8v039", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I'm sorry but... if the OP  deleted it, it's because she doesn't want this info out. Send her a dm. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry but... if the OP  deleted it, it&amp;#39;s because she doesn&amp;#39;t want this info out. Send her a dm. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg8v1v8", "score_hidden": false, "stickied": false, "created": 1492180590.0, "created_utc": 1492151790.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8v039", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HerefortheWildCat", "parent_id": "t1_dg8uwdo", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "What'd it say? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;d it say? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg8v039", "score_hidden": false, "stickied": false, "created": 1492180466.0, "created_utc": 1492151666.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8uwdo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iThinkiThink2Much", "parent_id": "t3_65az99", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I read it before you deleted it. I'm sorry.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read it before you deleted it. I&amp;#39;m sorry.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg8uwdo", "score_hidden": false, "stickied": false, "created": 1492180220.0, "created_utc": 1492151420.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": "", "user_reports": [], "id": "dg9m8zd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "prak_12", "parent_id": "t3_65az99", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I am so sorry this happened to you. You are perfectly normal to have such a response and I think there shouldnt be any complications in future for you. If anything you should minimize contact with your relatives and get therapy. Talk to your mom about it. I think you are perfectly fine and normal girl. Do what you wanted to. That is make a name for yourself. Best of luck", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so sorry this happened to you. You are perfectly normal to have such a response and I think there shouldnt be any complications in future for you. If anything you should minimize contact with your relatives and get therapy. Talk to your mom about it. I think you are perfectly fine and normal girl. Do what you wanted to. That is make a name for yourself. Best of luck&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dg9m8zd", "score_hidden": false, "stickied": false, "created": 1492226876.0, "created_utc": 1492198076.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": "", "user_reports": [], "id": "dga0f4w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DragonSeniorita_009", "parent_id": "t3_65az99", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I'm\nSorry this happened to you and to your mother. Please give her a big hug and tell her you love her; I know it must be hard for you, but imagine the hell She was put through. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m\nSorry this happened to you and to your mother. Please give her a big hug and tell her you love her; I know it must be hard for you, but imagine the hell She was put through. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dga0f4w", "score_hidden": false, "stickied": false, "created": 1492245004.0, "created_utc": 1492216204.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": "", "user_reports": [], "id": "dgacjgu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "soundsdistilled", "parent_id": "t3_65az99", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I really don't have anything to add however here is a hug from me amd good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really don&amp;#39;t have anything to add however here is a hug from me amd good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dgacjgu", "score_hidden": false, "stickied": false, "created": 1492263807.0, "created_utc": 1492235007.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": "", "user_reports": [], "id": "dgalx8u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "watch7maker", "parent_id": "t3_65az99", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I have 3 cousins (all siblings) that their parents are cousins. Their dad is my mom's brother. And their mom is my mom's 2nd cousin. Basically, my cousins parent's parents are second cousins, their dads are first cousins, and their dads are siblings. Not very close, but all the kids are 100% normal. No visual deformities nor any major medical issues ever. Also, one has a kid, and he's fine.\n\nTo optimize your chances of having a healthy offspring, I would recommend breeding with someone of a completely different race than you or from a different continent at least.\n\nThis is because the issue with incest babies is that recessive genes that shouldn't be expressed end up linking up and there's no dominant gene to control for this defect. You don't seem to have hit any of these bad genes, but in order to avoid this, you want a completely brand new set of genes and the best way to do this is to have a mixed race baby. Most people from the same race as you have very similar genes and genetic disorders tend to pass down more in people that date within their race.\n\nSorry this happened to you but there's some hope that you can have kids!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have 3 cousins (all siblings) that their parents are cousins. Their dad is my mom&amp;#39;s brother. And their mom is my mom&amp;#39;s 2nd cousin. Basically, my cousins parent&amp;#39;s parents are second cousins, their dads are first cousins, and their dads are siblings. Not very close, but all the kids are 100% normal. No visual deformities nor any major medical issues ever. Also, one has a kid, and he&amp;#39;s fine.&lt;/p&gt;\n\n&lt;p&gt;To optimize your chances of having a healthy offspring, I would recommend breeding with someone of a completely different race than you or from a different continent at least.&lt;/p&gt;\n\n&lt;p&gt;This is because the issue with incest babies is that recessive genes that shouldn&amp;#39;t be expressed end up linking up and there&amp;#39;s no dominant gene to control for this defect. You don&amp;#39;t seem to have hit any of these bad genes, but in order to avoid this, you want a completely brand new set of genes and the best way to do this is to have a mixed race baby. Most people from the same race as you have very similar genes and genetic disorders tend to pass down more in people that date within their race.&lt;/p&gt;\n\n&lt;p&gt;Sorry this happened to you but there&amp;#39;s some hope that you can have kids!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dgalx8u", "score_hidden": false, "stickied": false, "created": 1492289399.0, "created_utc": 1492260599.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65az99", "likes": null, "replies": "", "user_reports": [], "id": "dgbqn5b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eeek124", "parent_id": "t3_65az99", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "You are not your uncle and you are not unworthy of love. Its not your fault you were the product of that. If you are afraid of passing on certain traits to your future children you can get genetically tested or adopt.  Most likely your children will probably be healthy. If you are not already, I would suggest seeing a therapist. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are not your uncle and you are not unworthy of love. Its not your fault you were the product of that. If you are afraid of passing on certain traits to your future children you can get genetically tested or adopt.  Most likely your children will probably be healthy. If you are not already, I would suggest seeing a therapist. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dgbqn5b", "score_hidden": false, "stickied": false, "created": 1492349654.0, "created_utc": 1492320854.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]