[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "confession", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It pains me more than it does for my son. My sister and I don&amp;#39;t get along at all. She married a rich asshole actor and lives in a million dollar house and is a stay-at-home-mom who spends her mornings at Orangetheory Fitness. I do well, but not making millions a yearl. I opted to have a child out of surrogacy (I am a single dad) and is a very happy kid. He is aware that his aunt thinks less of him. His birthday is two days after his cousin and it was his aunt who decline to have joint birthdays. He really wanted to have a sibling relationship with his cousins, but my sister and her husband aren&amp;#39;t interested. It makes him feel like there is something wrong with him. The worst part is how my parents go well out their way to support her kids at school performances or sport games but claim they are too tired to do the same for my kid. It&amp;#39;s difficult explaining why his grandparents can go to my sister&amp;#39;s kids soccer game 20 miles away but can&amp;#39;t do the same for my kid&amp;#39;s game 3 miles away. They will drop everything for them. Again, my kid is not a bad kid. I would understand if that were the situation, but I think my parents feel more important around my sister&amp;#39;s elitism.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It pains me more than it does for my son. My sister and I don't get along at all. She married a rich asshole actor and lives in a million dollar house and is a stay-at-home-mom who spends her mornings at Orangetheory Fitness. I do well, but not making millions a yearl. I opted to have a child out of surrogacy (I am a single dad) and is a very happy kid. He is aware that his aunt thinks less of him. His birthday is two days after his cousin and it was his aunt who decline to have joint birthdays. He really wanted to have a sibling relationship with his cousins, but my sister and her husband aren't interested. It makes him feel like there is something wrong with him. The worst part is how my parents go well out their way to support her kids at school performances or sport games but claim they are too tired to do the same for my kid. It's difficult explaining why his grandparents can go to my sister's kids soccer game 20 miles away but can't do the same for my kid's game 3 miles away. They will drop everything for them. Again, my kid is not a bad kid. I would understand if that were the situation, but I think my parents feel more important around my sister's elitism.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Remorse", "id": "65gxpa", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 35, "report_reasons": null, "author": "pogej", "saved": false, "mod_reports": [], "name": "t3_65gxpa", "subreddit_name_prefixed": "r/confession", "approved_by": null, "over_18": false, "domain": "self.confession", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qo2a", "edited": 1492225035.0, "link_flair_css_class": "Remorse", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/confession/comments/65gxpa/remorse_i_hate_my_parents_because_they_clearly/", "num_reports": null, "locked": false, "stickied": false, "created": 1492253637.0, "url": "https://www.reddit.com/r/confession/comments/65gxpa/remorse_i_hate_my_parents_because_they_clearly/", "author_flair_text": null, "quarantine": false, "title": "[remorse] I hate my parents because they clearly favor my sisters' kids over my kid", "created_utc": 1492224837.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 35}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65gxpa", "likes": null, "replies": "", "user_reports": [], "id": "dga7p9i", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "secretivedamsel", "parent_id": "t3_65gxpa", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I'm the kid who's grandparents clearly never favoured, but I grew up and I'm fine with it. What's going to matter most to your child is your presence as a parent. Grandparents will normally have favourites when it comes to grandchildren. Encourage your kid to be great and to dream big because the future is unknown and the wheel may always turn your way and your kids' way in the future, and by then, at least your child will know who has always been there and that's you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m the kid who&amp;#39;s grandparents clearly never favoured, but I grew up and I&amp;#39;m fine with it. What&amp;#39;s going to matter most to your child is your presence as a parent. Grandparents will normally have favourites when it comes to grandchildren. Encourage your kid to be great and to dream big because the future is unknown and the wheel may always turn your way and your kids&amp;#39; way in the future, and by then, at least your child will know who has always been there and that&amp;#39;s you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dga7p9i", "score_hidden": false, "stickied": false, "created": 1492255278.0, "created_utc": 1492226478.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65gxpa", "likes": null, "replies": "", "user_reports": [], "id": "dgakx60", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "watch7maker", "parent_id": "t3_65gxpa", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "I'm sorry this is happening because your little one doesn't deserve it. I honestly would back away from any contact with them to not expose him to that toxic environment. Make it seem like \"it's not that they don't want to see you, it's that I don't want to see them\" because I'd much rather my kid blame me for not being around family than feel as if it's something internal wrong with him as to why his family doesn't see him.\n\nAs a side note, can you explain more how you went about having a kid as a single dad? Considering it here", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry this is happening because your little one doesn&amp;#39;t deserve it. I honestly would back away from any contact with them to not expose him to that toxic environment. Make it seem like &amp;quot;it&amp;#39;s not that they don&amp;#39;t want to see you, it&amp;#39;s that I don&amp;#39;t want to see them&amp;quot; because I&amp;#39;d much rather my kid blame me for not being around family than feel as if it&amp;#39;s something internal wrong with him as to why his family doesn&amp;#39;t see him.&lt;/p&gt;\n\n&lt;p&gt;As a side note, can you explain more how you went about having a kid as a single dad? Considering it here&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dgakx60", "score_hidden": false, "stickied": false, "created": 1492287117.0, "created_utc": 1492258317.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65gxpa", "likes": null, "replies": "", "user_reports": [], "id": "dgah9uj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Ex_plane", "parent_id": "t3_65gxpa", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "You're better than me. I'd drift so damn hard away from my family if I thought for a second this was happening. What's the point of family if they treat you like this? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re better than me. I&amp;#39;d drift so damn hard away from my family if I thought for a second this was happening. What&amp;#39;s the point of family if they treat you like this? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dgah9uj", "score_hidden": false, "stickied": false, "created": 1492276200.0, "created_utc": 1492247400.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65gxpa", "likes": null, "replies": "", "user_reports": [], "id": "dga7f6q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gracebatmonkey", "parent_id": "t3_65gxpa", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "My little is in a similar situation with her Grandma and cousins. They're much older and part of a family that my mother enjoys being considered an extended member of even though they're now ex-in-laws, so she'll go out of her way for them and reaches out to them before anyone else. It's really difficult to explain to a little kid. I have legitimate reasons to despise my mom beyond this, so this is mostly just disappointing. We fill the gap with older friends from my \"home\" convention and a retirement/care home her Kinder teacher established a relationship with. It's not the same, but it does put some drops in that bucket. I hope you guys figure out something similar to at least smooth the edges of this mistreatment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My little is in a similar situation with her Grandma and cousins. They&amp;#39;re much older and part of a family that my mother enjoys being considered an extended member of even though they&amp;#39;re now ex-in-laws, so she&amp;#39;ll go out of her way for them and reaches out to them before anyone else. It&amp;#39;s really difficult to explain to a little kid. I have legitimate reasons to despise my mom beyond this, so this is mostly just disappointing. We fill the gap with older friends from my &amp;quot;home&amp;quot; convention and a retirement/care home her Kinder teacher established a relationship with. It&amp;#39;s not the same, but it does put some drops in that bucket. I hope you guys figure out something similar to at least smooth the edges of this mistreatment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dga7f6q", "score_hidden": false, "stickied": false, "created": 1492254842.0, "created_utc": 1492226042.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65gxpa", "likes": null, "replies": "", "user_reports": [], "id": "dgavhan", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sekai-31", "parent_id": "t3_65gxpa", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Have your son sign their next birthday card with this: 'Congrats on getting one year closer to death.'", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have your son sign their next birthday card with this: &amp;#39;Congrats on getting one year closer to death.&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dgavhan", "score_hidden": false, "stickied": false, "created": 1492304432.0, "created_utc": 1492275632.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]