[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "confession", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work in a field that is very tough and has a high turnover rate and somehow I managed to stick through it for the last 10 and a half years. Within the last two years I was promoted to management and it&amp;#39;s HARD. I take my job seriously and do the best I can and go above and beyond. What I have a hard time with is when my superiors talk highly of me to other agencies. I get very nervous and put a lot of pressure on myself to not mess up. I get so scared that I&amp;#39;m going to mess up really bad.  Is it wrong to just want to be praised for a good job privately? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I work in a field that is very tough and has a high turnover rate and somehow I managed to stick through it for the last 10 and a half years. Within the last two years I was promoted to management and it's HARD. I take my job seriously and do the best I can and go above and beyond. What I have a hard time with is when my superiors talk highly of me to other agencies. I get very nervous and put a lot of pressure on myself to not mess up. I get so scared that I'm going to mess up really bad.  Is it wrong to just want to be praised for a good job privately? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Light", "id": "65tdxn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "voodoo85", "saved": false, "mod_reports": [], "name": "t3_65tdxn", "subreddit_name_prefixed": "r/confession", "approved_by": null, "over_18": false, "domain": "self.confession", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qo2a", "edited": false, "link_flair_css_class": "Light", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/confession/comments/65tdxn/i_have_an_irrational_fear_of_screwing_up_at_work/", "num_reports": null, "locked": false, "stickied": false, "created": 1492430027.0, "url": "https://www.reddit.com/r/confession/comments/65tdxn/i_have_an_irrational_fear_of_screwing_up_at_work/", "author_flair_text": null, "quarantine": false, "title": "I have an irrational fear of screwing up at work", "created_utc": 1492401227.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qo2a", "removal_reason": null, "link_id": "t3_65tdxn", "likes": null, "replies": "", "user_reports": [], "id": "dgdb554", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Normessca", "parent_id": "t3_65tdxn", "subreddit_name_prefixed": "r/confession", "controversiality": 0, "body": "Something like that happened to me 15 years ago. I suddenly got a promotion. Now my boss was only the owner of the company. I was a young guy and wanted to prove that I can do it. We always say that workers must be autonomous and have an initiative. But I know that this is bullshit. The worker must be like a soldier and follow orders. But in this case, his boss have to work really hard. You need to prepare a job for him and check it all the time. My people didn't  want and resisted. Some had to be let go. These changes took a year. But I got incredible results. I saved a lot of money for the company. But my salary  hasn't changed. In addition, the my boss wasn't happy. He always pushed and pushed. He wanted more and more.  To maintain such a rhythm, I had to work for 14-16 hours and 24 hours a day on the phone. I couln't leave, because I was dependent on the salary of the manager. My wife said that he would kill me and I knew that I will die if I continue. In the end I had to go to another country. I was young and stupid. Now I understand it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something like that happened to me 15 years ago. I suddenly got a promotion. Now my boss was only the owner of the company. I was a young guy and wanted to prove that I can do it. We always say that workers must be autonomous and have an initiative. But I know that this is bullshit. The worker must be like a soldier and follow orders. But in this case, his boss have to work really hard. You need to prepare a job for him and check it all the time. My people didn&amp;#39;t  want and resisted. Some had to be let go. These changes took a year. But I got incredible results. I saved a lot of money for the company. But my salary  hasn&amp;#39;t changed. In addition, the my boss wasn&amp;#39;t happy. He always pushed and pushed. He wanted more and more.  To maintain such a rhythm, I had to work for 14-16 hours and 24 hours a day on the phone. I couln&amp;#39;t leave, because I was dependent on the salary of the manager. My wife said that he would kill me and I knew that I will die if I continue. In the end I had to go to another country. I was young and stupid. Now I understand it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "confession", "name": "t1_dgdb554", "score_hidden": false, "stickied": false, "created": 1492450074.0, "created_utc": 1492421274.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]