[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So this theory is pretty likely in my opinion  and gives away a major party of the season to come if correct, but it relies on the story of the death of c-137&amp;#39;s family being true. C-137 rick was willing to say no to the portal gun because he loved his family so much and so probably would&amp;#39;ve never got into the dimension hopping like the other ricks. But the bomb killing his family spurred him into. So then that leads to the present c-137, now I think that at the end of season 3 c-137 will save the universe or something else of an immense scale. But only the c-137 rick can do it, so the person that blew up his family is actually present c-137 traveling back in time to kill his own family for the greater good. I know the writers have said they won&amp;#39;t get into time travel but I think they&amp;#39;re just tricking us so that this event will be a surprise and incredibly shocking to the veiwer as the only rick that cares enough about his family to say no to the portal gun is the one that has to kill his wife and child for the greater good. Almost a cruel ploy by the universe to make the rickest rick have to kill his own family to ensure he gets into dimension traveling and therefor eventually save the universe. It would be a magic trick and a half for the writers to work out that timeline but they&amp;#39;ve never failed to amaze us. When this is all true in a few months I can say I you told so.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So this theory is pretty likely in my opinion  and gives away a major party of the season to come if correct, but it relies on the story of the death of c-137's family being true. C-137 rick was willing to say no to the portal gun because he loved his family so much and so probably would've never got into the dimension hopping like the other ricks. But the bomb killing his family spurred him into. So then that leads to the present c-137, now I think that at the end of season 3 c-137 will save the universe or something else of an immense scale. But only the c-137 rick can do it, so the person that blew up his family is actually present c-137 traveling back in time to kill his own family for the greater good. I know the writers have said they won't get into time travel but I think they're just tricking us so that this event will be a surprise and incredibly shocking to the veiwer as the only rick that cares enough about his family to say no to the portal gun is the one that has to kill his wife and child for the greater good. Almost a cruel ploy by the universe to make the rickest rick have to kill his own family to ensure he gets into dimension traveling and therefor eventually save the universe. It would be a magic trick and a half for the writers to work out that timeline but they've never failed to amaze us. When this is all true in a few months I can say I you told so.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qct7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "Heathhallmuir", "saved": false, "mod_reports": [], "name": "t3_64qct7", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/64qct7/rick_and_morty_season_3_arc/", "num_reports": null, "locked": false, "stickied": false, "created": 1491940571.0, "url": "https://www.reddit.com/r/FanTheories/comments/64qct7/rick_and_morty_season_3_arc/", "author_flair_text": null, "quarantine": false, "title": "Rick and Morty season 3 arc", "created_utc": 1491911771.0, "distinguished": null, "media": null, "upvote_ratio": 0.45, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_64qct7", "likes": null, "replies": "", "user_reports": [], "id": "dg56sx5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AndIntroducing", "parent_id": "t3_64qct7", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Genuis", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Genuis&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg56sx5", "score_hidden": false, "stickied": false, "created": 1491985825.0, "created_utc": 1491957025.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]