[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, people spout Illuminati stuff and Satanic things. I don&amp;#39;t think this is the case, but rather the opposite purpose. So first, this goes farther then just Starboy, but begins in I Cant Feel My Face.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;In I Can&amp;#39;t Feel My Face, The Weeknd is seen singing and no one really cares, until this man notices him, then proceeds to light a match and then set Abel on fire. Suddenly everyone loves him and the music. The man is implied as the Devil.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In The Hills, he is seen going into a house, where in the room, there are two girls, and the same man.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Later in Tell Your Friends, he kills this man. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In Starboy, he kills the old Abel, and has new hair. There is a painting of Daft Punk with a panther. He walks around and then chooses to mention his cars, possessions, and mentions his girl cleaning ivory with her face. The fame did all this to him, and he&amp;#39;s addicted. &lt;strong&gt;He&amp;#39;s killed his old self to move on.&lt;/strong&gt; He says &lt;em&gt;&amp;#39;House so empty need a centerpiece.&amp;#39;&lt;/em&gt; saying that with all these things, none of it fills him. He tries to do it but material isn&amp;#39;t anything. When he sees the Cross, it&amp;#39;s in his eyes. It&amp;#39;s red and glowing signifying anger. Now he grabs it and holds it like a weapon, then uses it to break the awards, albums, whatever he got from fame as he&amp;#39;s too angry at his ways and just hates this lifestyle. At a certain point of the video he puts his hands out in a horn and holds the cross up to him while doing it. He continues to say &lt;em&gt;&amp;#39;Look what you&amp;#39;ve done, I&amp;#39;m a motherfucking Starboy.&amp;#39;&lt;/em&gt; because now he&amp;#39;s got all this materialistic wealth and success, yet he is not happy. He drives off with the black cat which would be viewed as bad luck, though it becomes a Panther, which means rebirth. He drives off without the Cross. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I believe this means The Weeknd is trying to get away from his life, and become a better man. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;In M A N I A he drives to a party, and is seen by another man when he enters the bathroom. He tries to attack, and blood is all over Abel and the room. The man is dead, with a girl next to him, the girl stopped him before too much happened. The girl is also bloody. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In Party Monster, he is seen partying, with odd visuals that seem similar to a trip. It&amp;#39;s implied he&amp;#39;s definitely done drugs. &lt;em&gt;&amp;#39;I woke up by a girl I don&amp;#39;t even know her name&amp;#39;&lt;/em&gt;  so he&amp;#39;s basically saying that he is having one night stands. &lt;em&gt;&amp;#39;I just need a girl who gon&amp;#39; really understand&amp;#39;&lt;/em&gt; so he wants a girl in his life, and he thinks it&amp;#39;s right each time but it is not. &lt;em&gt;&amp;#39;Got up thanked the Lord for the day&amp;#39;&lt;/em&gt; thanking God he has a chance to start over. He&amp;#39;s too addicted to Starboy ways that he has trouble getting off, maybe signifying that leaving the Cross behind, he&amp;#39;s not gone back to God since, but thanking God for another chance is him wanting God again. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Finally, in I Feel It Coming he is seen in a weird alien planet, dancing and singing about how &lt;em&gt;&amp;#39;I feel it coming&amp;#39;&lt;/em&gt; to a girl. He finds a girl, and dances with her, but when an eclipse occurs, the clouds start, she becomes stone, and falls. Abel is slowly turning into stone, and kneels down reaching for her, and a snake comes out of her.   He was betrayed by the girl, as she&amp;#39;s basically evil and it goes with the story of Adam and Eve of how the snake had deceived them. He is frozen eventually and the place shows, when Daft Punk later come in and find a spot of the snow with a glow. Thomas wipes it away, and finds the Cross from Starboy. Guy and Thomas look at each other, and Guy is seen holding something. The Starboy beginning is played from the Cross. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Conclusion:&lt;/strong&gt; Basically, I feel this mirrors with what The Weeknd is trying to convey as reality. He&amp;#39;s trying to say that signing with the industry felt just like he lost his soul to the Devil, and he got awards from it, but drugs, sex, nothing made him pleased. &lt;/p&gt;\n\n&lt;p&gt;The Devil/industry reminds him not to drift away, but he killed his deal of the Devil, and then kills the sinful old Abel, or him trying to appeal for money. He uses the Cross to destroy what he has, and he uses the Cross to represent with God as he used it to destroy his awards the Devil earned for Abel. He drives off transformed, and the Devil/Industry tries to get him back but a girl saves him. &lt;/p&gt;\n\n&lt;p&gt;He goes back to the addictive lifestyle, and wants out. When he dances in I Feel It Coming, and the snake crawls from the girl, he&amp;#39;s betrayed by a girl. God is his only way to get out of this spiral. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s saying he doesn&amp;#39;t like how the record companies, music companies, whatever did this and now he&amp;#39;s not happy. He wants off, and this is him saying he has his style now, he isn&amp;#39;t selling out, he&amp;#39;s making his music how he wants, and possibly he&amp;#39;s putting God as a way to find faith. It&amp;#39;s why the Cross is everywhere on the videos and his album, the album and story leads to him getting away from the life he hates.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt; The Weeknd&amp;#39;s album Starboy is about him disliking he signed with the music industry and now he&amp;#39;s putting God first because it messed him up&lt;/p&gt;\n\n&lt;p&gt;This is just my take on it, but I feel this is what he&amp;#39;s trying to convey in Starboy.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, people spout Illuminati stuff and Satanic things. I don't think this is the case, but rather the opposite purpose. So first, this goes farther then just Starboy, but begins in I Cant Feel My Face.\n\n* In I Can't Feel My Face, The Weeknd is seen singing and no one really cares, until this man notices him, then proceeds to light a match and then set Abel on fire. Suddenly everyone loves him and the music. The man is implied as the Devil.\n\n* In The Hills, he is seen going into a house, where in the room, there are two girls, and the same man.\n\n* Later in Tell Your Friends, he kills this man. \n\n* In Starboy, he kills the old Abel, and has new hair. There is a painting of Daft Punk with a panther. He walks around and then chooses to mention his cars, possessions, and mentions his girl cleaning ivory with her face. The fame did all this to him, and he's addicted. **He's killed his old self to move on.** He says *'House so empty need a centerpiece.'* saying that with all these things, none of it fills him. He tries to do it but material isn't anything. When he sees the Cross, it's in his eyes. It's red and glowing signifying anger. Now he grabs it and holds it like a weapon, then uses it to break the awards, albums, whatever he got from fame as he's too angry at his ways and just hates this lifestyle. At a certain point of the video he puts his hands out in a horn and holds the cross up to him while doing it. He continues to say *'Look what you've done, I'm a motherfucking Starboy.'* because now he's got all this materialistic wealth and success, yet he is not happy. He drives off with the black cat which would be viewed as bad luck, though it becomes a Panther, which means rebirth. He drives off without the Cross. \n\nI believe this means The Weeknd is trying to get away from his life, and become a better man. \n\n* In M A N I A he drives to a party, and is seen by another man when he enters the bathroom. He tries to attack, and blood is all over Abel and the room. The man is dead, with a girl next to him, the girl stopped him before too much happened. The girl is also bloody. \n\n* In Party Monster, he is seen partying, with odd visuals that seem similar to a trip. It's implied he's definitely done drugs. *'I woke up by a girl I don't even know her name'*  so he's basically saying that he is having one night stands. *'I just need a girl who gon' really understand'* so he wants a girl in his life, and he thinks it's right each time but it is not. *'Got up thanked the Lord for the day'* thanking God he has a chance to start over. He's too addicted to Starboy ways that he has trouble getting off, maybe signifying that leaving the Cross behind, he's not gone back to God since, but thanking God for another chance is him wanting God again. \n\n* Finally, in I Feel It Coming he is seen in a weird alien planet, dancing and singing about how *'I feel it coming'* to a girl. He finds a girl, and dances with her, but when an eclipse occurs, the clouds start, she becomes stone, and falls. Abel is slowly turning into stone, and kneels down reaching for her, and a snake comes out of her.   He was betrayed by the girl, as she's basically evil and it goes with the story of Adam and Eve of how the snake had deceived them. He is frozen eventually and the place shows, when Daft Punk later come in and find a spot of the snow with a glow. Thomas wipes it away, and finds the Cross from Starboy. Guy and Thomas look at each other, and Guy is seen holding something. The Starboy beginning is played from the Cross. \n\n**Conclusion:** Basically, I feel this mirrors with what The Weeknd is trying to convey as reality. He's trying to say that signing with the industry felt just like he lost his soul to the Devil, and he got awards from it, but drugs, sex, nothing made him pleased. \n\nThe Devil/industry reminds him not to drift away, but he killed his deal of the Devil, and then kills the sinful old Abel, or him trying to appeal for money. He uses the Cross to destroy what he has, and he uses the Cross to represent with God as he used it to destroy his awards the Devil earned for Abel. He drives off transformed, and the Devil/Industry tries to get him back but a girl saves him. \n\nHe goes back to the addictive lifestyle, and wants out. When he dances in I Feel It Coming, and the snake crawls from the girl, he's betrayed by a girl. God is his only way to get out of this spiral. \n\nHe's saying he doesn't like how the record companies, music companies, whatever did this and now he's not happy. He wants off, and this is him saying he has his style now, he isn't selling out, he's making his music how he wants, and possibly he's putting God as a way to find faith. It's why the Cross is everywhere on the videos and his album, the album and story leads to him getting away from the life he hates.\n\n**TL;DR** The Weeknd's album Starboy is about him disliking he signed with the music industry and now he's putting God first because it messed him up\n\nThis is just my take on it, but I feel this is what he's trying to convey in Starboy.  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64si0s", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "Retic", "saved": false, "mod_reports": [], "name": "t3_64si0s", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": 1491934588.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/64si0s/the_weeknd_abel_is_trying_to_show_hes_sick_of_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1491962388.0, "url": "https://www.reddit.com/r/FanTheories/comments/64si0s/the_weeknd_abel_is_trying_to_show_hes_sick_of_the/", "author_flair_text": null, "quarantine": false, "title": "[The Weeknd] Abel is trying to show he's sick of the Starboy lifestyle by contrasting signing the contract with the industry to selling his soul", "created_utc": 1491933588.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_64si0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_64si0s", "likes": null, "replies": "", "user_reports": [], "id": "dg7m32a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Retic", "parent_id": "t1_dg79kcc", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I feel Daft Punk comes in and saves the new Weeknd perhaps. I'm assuming it may just be their featuring in the track as to why they are in said videos, but it could be more. I Feel It Coming probably comes first ahead of Starboy. Perhaps I Feel It Coming is where our first view of the new Weeknd comes from, and Daft Punk 'saves' him to fix himself, and this leads to Starboy. Might be something like they showed him to be himself and not this industry-inspired person, but I figure it's just their music in the track as to their showing, again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel Daft Punk comes in and saves the new Weeknd perhaps. I&amp;#39;m assuming it may just be their featuring in the track as to why they are in said videos, but it could be more. I Feel It Coming probably comes first ahead of Starboy. Perhaps I Feel It Coming is where our first view of the new Weeknd comes from, and Daft Punk &amp;#39;saves&amp;#39; him to fix himself, and this leads to Starboy. Might be something like they showed him to be himself and not this industry-inspired person, but I figure it&amp;#39;s just their music in the track as to their showing, again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg7m32a", "score_hidden": false, "stickied": false, "created": 1492122374.0, "created_utc": 1492093574.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79kcc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JavierEsq22", "parent_id": "t3_64si0s", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I like this. What role would Daft Punk take on it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like this. What role would Daft Punk take on it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg79kcc", "score_hidden": false, "stickied": false, "created": 1492095661.0, "created_utc": 1492066861.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]