[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Norman Bates is possessed. He&amp;#39;s not consumed by a mental illness or even by the spirit of his deceased mother. He is possessed by a demon taking the form of Norma. &lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s start at the beginning of Normans life; in his childhood Norman witnessed his mother being beaten by his father. Obviously traumatized by the constant stress and violence in his house, Normans psyche began to crack, leading to Norman killing his father. In many Christian circles, trauma can open a door to demonic influence in an individuals life. There&amp;#39;s also an idea of generational curses, which is a rampant line of sin which jumps from generation to generation, usually started by some unchecked, major sin, embraced by a family member in the past (note: I&amp;#39;m not sure about this belief in Orthodox Christianity). Norma and Caleb grew up in an extremely abusive household, where their only source of comfort was each other. This lead to an incestuous affair between the two of them (which led to Dylan being born) that Norma denied for years, claiming Caleb had raped her, which was untrue. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So what, Norma and Norman had traumatic pasts, that doesn&amp;#39;t make Norman possessed!&amp;quot; You shout. Well, let&amp;#39;s look at the stages of possession; &lt;/p&gt;\n\n&lt;p&gt;Possession, in which Satan or some demon(s) takes full possession of a person&amp;#39;s body without their knowledge or consent, so the victim is therefore morally blameless.\nNorman kills his father while he is a child. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Obsession, which includes sudden attacks of irrationally obsessive thoughts, typically influences dreams&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Norman becomes obsessed with Norma&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Oppression, in which there is no loss of consciousness or involuntary action.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Norman is plagued by constant fear and anger in his young life (leading to issues in school and trouble making friends, he is constantly anxious&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;External physical pain caused by Satan or some demon(s).&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Norman is rarely bruised or cut by his possession, though he does physically struggle with &amp;quot;Norma&amp;quot; multiple times (she even knocks him unconscious once) he&amp;#39;s also constantly plagued by dreams, huting his psyche and personal life.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Infestation, which affects houses, things, or animals;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Normans possession gains momentum when they move to the hotel&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Subjugation, in which a person voluntarily submits to Satan or some demon(s).&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;In season 5 episode 7, Norman rejects Norma&amp;#39;s advice of &amp;quot;handling things&amp;quot; for him. He now knows of the possession, and the demon is unable to take control like it used to.&lt;/p&gt;\n\n&lt;p&gt;In Hostage To The Devil, Malachi Martin also mentions a type of demonic attack called &amp;quot;familiarization&amp;quot;. He writes:&lt;/p&gt;\n\n&lt;p&gt;“ The possessing spirit in &amp;quot;familiarization&amp;quot; is seeking to &amp;quot;come and live with&amp;quot; the subject. If accepted, the spirit becomes the constant and continuously present companion of the possessed. The two &amp;quot;persons&amp;quot;, the &amp;quot;familiar&amp;quot; and the &amp;quot;possessed&amp;quot;, remain separate and distinct. The &amp;quot;possessed&amp;quot; is aware of his &amp;quot;familiar&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Norman is aware that his &amp;quot;mother&amp;quot; overtakes him at certain points, leading to blackouts.&lt;/p&gt;\n\n&lt;p&gt;Norman also began seeing his long dead dog in visions. &lt;/p&gt;\n\n&lt;p&gt;Demons can possess animals as seen in the exorcism of the Gerasene demoniac:&lt;/p&gt;\n\n&lt;p&gt;“&lt;/p&gt;\n\n&lt;p&gt;When Jesus stepped ashore, he was met by a demon-possessed man from the town. For a long time this man had not worn clothes or lived in a house, but had lived in the tombs. 28 When he saw Jesus, he cried out and fell at his feet, shouting at the top of his voice, “What do you want with me, Jesus, Son of the Most High God? I beg you, don’t torture me!” 29 For Jesus had commanded the impure spirit to come out of the man. Many times it had seized him, and though he was chained hand and foot and kept under guard, he had broken his chains and had been driven by the demon into solitary places. 30 Jesus asked him, &amp;quot;What is your name?&amp;quot; “Legion,” he replied, because many demons had gone into him. 31 And they begged Jesus repeatedly not to order them to go into the Abyss. 32 A large herd of pigs was feeding there on the hillside. The demons begged Jesus to let them go into the pigs, and he gave them permission. 33 When the demons came out of the man, they went into the pigs, and the herd rushed down the steep bank into the lakeand was drowned. (Luke 8:27-33 NIV)&lt;/p&gt;\n\n&lt;p&gt;In season 5 episode 6 Norma confesses to Norman her true intentions, including telling Norman that he is &amp;quot;like Adam, eating the Apple of knowledge&amp;quot; (which as far as I can remember is the first biblical reference that &amp;quot;Norma&amp;quot; has made.)&lt;/p&gt;\n\n&lt;p&gt;Norma admits to Norman that she&amp;#39;s in control, but Norman needs to consent to it, to embrace it. &lt;/p&gt;\n\n&lt;p&gt;Norma also shows knowledge of a well that Norman has never seen, something perfect to hide Sam Loomis&amp;#39; body in. Norman asks Norma how she knows this, and Norma replies that &amp;quot;she has eyes&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;This is evidence of possession, in which the demon has knowledge of things the possessed does not. &lt;/p&gt;\n\n&lt;p&gt;Finally, there are things in Christian Theology called familiar spirits:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Leviticus 19:31; 20:6, 27; and Deuteronomy 18:9-14 refer to “mediums and familiar spirits” and forbids being involved with them, as they are an abomination to the Lord. A medium is one who acts as a liaison to supposedly contact or communicate with the dead on behalf of the living. In reality mediums are contacting demons who convince the mediums that they are “familiar” and can be trusted and believed. The practices associated with mediums and familiar spirits were banned in Israel, and the punishment for practicing such things was death.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Norman Bates has been possessed for a number of years by a demon taking the form of his deceased mother. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Norman Bates is possessed. He's not consumed by a mental illness or even by the spirit of his deceased mother. He is possessed by a demon taking the form of Norma. \n\nLet's start at the beginning of Normans life; in his childhood Norman witnessed his mother being beaten by his father. Obviously traumatized by the constant stress and violence in his house, Normans psyche began to crack, leading to Norman killing his father. In many Christian circles, trauma can open a door to demonic influence in an individuals life. There's also an idea of generational curses, which is a rampant line of sin which jumps from generation to generation, usually started by some unchecked, major sin, embraced by a family member in the past (note: I'm not sure about this belief in Orthodox Christianity). Norma and Caleb grew up in an extremely abusive household, where their only source of comfort was each other. This lead to an incestuous affair between the two of them (which led to Dylan being born) that Norma denied for years, claiming Caleb had raped her, which was untrue. \n\n\"So what, Norma and Norman had traumatic pasts, that doesn't make Norman possessed!\" You shout. Well, let's look at the stages of possession; \n\nPossession, in which Satan or some demon(s) takes full possession of a person's body without their knowledge or consent, so the victim is therefore morally blameless.\nNorman kills his father while he is a child. \n\n2. Obsession, which includes sudden attacks of irrationally obsessive thoughts, typically influences dreams\n\nNorman becomes obsessed with Norma\n\n3. Oppression, in which there is no loss of consciousness or involuntary action.\n\nNorman is plagued by constant fear and anger in his young life (leading to issues in school and trouble making friends, he is constantly anxious\n\n4. External physical pain caused by Satan or some demon(s).\n\nNorman is rarely bruised or cut by his possession, though he does physically struggle with \"Norma\" multiple times (she even knocks him unconscious once) he's also constantly plagued by dreams, huting his psyche and personal life.\n\n5. Infestation, which affects houses, things, or animals;\n\nNormans possession gains momentum when they move to the hotel\n\n6. Subjugation, in which a person voluntarily submits to Satan or some demon(s).\n\nIn season 5 episode 7, Norman rejects Norma's advice of \"handling things\" for him. He now knows of the possession, and the demon is unable to take control like it used to.\n\nIn Hostage To The Devil, Malachi Martin also mentions a type of demonic attack called \"familiarization\". He writes:\n\n“\tThe possessing spirit in \"familiarization\" is seeking to \"come and live with\" the subject. If accepted, the spirit becomes the constant and continuously present companion of the possessed. The two \"persons\", the \"familiar\" and the \"possessed\", remain separate and distinct. The \"possessed\" is aware of his \"familiar\".\n\n\n\nNorman is aware that his \"mother\" overtakes him at certain points, leading to blackouts.\n\n\nNorman also began seeing his long dead dog in visions. \n\nDemons can possess animals as seen in the exorcism of the Gerasene demoniac:\n\n“\n\nWhen Jesus stepped ashore, he was met by a demon-possessed man from the town. For a long time this man had not worn clothes or lived in a house, but had lived in the tombs. 28 When he saw Jesus, he cried out and fell at his feet, shouting at the top of his voice, “What do you want with me, Jesus, Son of the Most High God? I beg you, don’t torture me!” 29 For Jesus had commanded the impure spirit to come out of the man. Many times it had seized him, and though he was chained hand and foot and kept under guard, he had broken his chains and had been driven by the demon into solitary places. 30 Jesus asked him, \"What is your name?\" “Legion,” he replied, because many demons had gone into him. 31 And they begged Jesus repeatedly not to order them to go into the Abyss. 32 A large herd of pigs was feeding there on the hillside. The demons begged Jesus to let them go into the pigs, and he gave them permission. 33 When the demons came out of the man, they went into the pigs, and the herd rushed down the steep bank into the lakeand was drowned. (Luke 8:27-33 NIV)\n\nIn season 5 episode 6 Norma confesses to Norman her true intentions, including telling Norman that he is \"like Adam, eating the Apple of knowledge\" (which as far as I can remember is the first biblical reference that \"Norma\" has made.)\n\nNorma admits to Norman that she's in control, but Norman needs to consent to it, to embrace it. \n\nNorma also shows knowledge of a well that Norman has never seen, something perfect to hide Sam Loomis' body in. Norman asks Norma how she knows this, and Norma replies that \"she has eyes\". \n\nThis is evidence of possession, in which the demon has knowledge of things the possessed does not. \n\nFinally, there are things in Christian Theology called familiar spirits:\n\n\"Leviticus 19:31; 20:6, 27; and Deuteronomy 18:9-14 refer to “mediums and familiar spirits” and forbids being involved with them, as they are an abomination to the Lord. A medium is one who acts as a liaison to supposedly contact or communicate with the dead on behalf of the living. In reality mediums are contacting demons who convince the mediums that they are “familiar” and can be trusted and believed. The practices associated with mediums and familiar spirits were banned in Israel, and the punishment for practicing such things was death.\"\n\nNorman Bates has been possessed for a number of years by a demon taking the form of his deceased mother. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64uou9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "SilentRansom", "saved": false, "mod_reports": [], "name": "t3_64uou9", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/64uou9/bates_motel_norman_in_possessed/", "num_reports": null, "locked": false, "stickied": false, "created": 1491983610.0, "url": "https://www.reddit.com/r/FanTheories/comments/64uou9/bates_motel_norman_in_possessed/", "author_flair_text": null, "quarantine": false, "title": "[Bates Motel] Norman in possessed", "created_utc": 1491954810.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]