[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Of course the world has only just seen the teaser so it&amp;#39;s still early days but after watching the trailer a few times and NOT LOOKING AT ANY POSTS, VIDEOS,  ARTICLES ETC, I think I have a rough idea of the basic plot.&lt;/p&gt;\n\n&lt;p&gt;As we know already, Thor and Loki (with the help of Doctor Strange) will spend some of the movie searching for Odin. I believe they&amp;#39;ll be in New York (based on the background when Hela first appears in trailer) when Hela appears and tells them that she knows where their father is and that they can have him back (at a price). Thor sacrifices his life (the start of the trailer when he is wrapped in chains in what looks like hell) and Loki is left alone (Strange probably just leaves with a &amp;quot;you&amp;#39;ve found your father. My work here is done&amp;quot;).&lt;/p&gt;\n\n&lt;p&gt;Hela then tells Thor he can win his father back in a contest. Thor accepts and is transported to another realm. He is greeted by strange looks before being captured by Valkyrie (as seen in trailer). She takes him to wherever he needs to be to prepare for the contest. She then goes to tell the grand master about his new competitor. &lt;/p&gt;\n\n&lt;p&gt;With Thor gone, Hela travels to Asgard (presumably without using the Bifröst). She then unleashes whatever enormous power and destroys most of Asgard and enslaving the survivors. Heimdall however feels so angered by not seeing Hela&amp;#39;s attack coming and so upset by the deaths that he abandons his post and leaves to find Thor (possibly with the warriors three). &lt;/p&gt;\n\n&lt;p&gt;Loki, being the god of mischief (although not actually a god), finds his own way into where Thor is and as seen in the trailer watch the tournament (he could already be connected to the grand master). &lt;/p&gt;\n\n&lt;p&gt;So Thor fights several enemies and during an interval or something catches up with his friend the Hulk and the grandmaster&amp;#39;s other competitors. They all reveal that they were brought here after dying to try and win back a loved one and return the living world with them. Hulk could speak of Betty Ross or someone like that. Valkyrie tells Thor that she was told Hela had Odin in hell and so went with the Valkyrior to retrieve him (female warriors on Pegasus in trailer). She then admits she was killed and is working for the grandmaster to earn back her friends who are being held captive by the grandmasters brother the collector. When Thor asks who told Valkyrie that Hela had Odin, she replied...Loki.&lt;/p&gt;\n\n&lt;p&gt;The friends then form a plan to escape bring down Loki, the grandmaster and Hela. After breaking out of the arena, defeating grandmaster and battling Loki, Thor&amp;#39;s brother reveals his long plan that involved faking his death, surprising everyone on earth, losing to the avengers so he could go back to Asgard, faking his death again, killing Odin, send the Valkyrior to Hela who ended up killing their leader, Thor giving his life to save Odin so he&amp;#39;d be sent to the grandmaster&amp;#39;s tournament where he&amp;#39;d die, tell Hela to take over Asgard so she could rule by Loki&amp;#39;s side, kill Hela and be king of Asgard after all. &lt;/p&gt;\n\n&lt;p&gt;Sparing no expense, Thor kills Loki for real (finally) and our heroes set off to save Asgard from Hela. On the way they are stopped by Heimdall and the warriors three. The warriors three seek Thor&amp;#39;s help but Heimdall reveals he came to kill Thor for his crimes. He says that Thor endangered Asgard and caused countless casualties and deaths by stealing the soul stone which will be revealed to be the source of Heimdall&amp;#39;s power. Thor&amp;#39;s friends will deny it but Thor will open a small magical container with the stone inside. Thor will explain that could have been the only way to revive his father if they found his body. The friends must stop Heimdall from murdering Thor and despite their differences and arguments they will save Asgard together. &lt;/p&gt;\n\n&lt;p&gt;They succeed and Hela is defeated. The soul stone is used to save Odin, Betty (or whoever) and the Valkyrior (who murdered and not captured) before being out in a safe place forever. The sixth and final infinity stone has been found.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Of course the world has only just seen the teaser so it's still early days but after watching the trailer a few times and NOT LOOKING AT ANY POSTS, VIDEOS,  ARTICLES ETC, I think I have a rough idea of the basic plot.\n\nAs we know already, Thor and Loki (with the help of Doctor Strange) will spend some of the movie searching for Odin. I believe they'll be in New York (based on the background when Hela first appears in trailer) when Hela appears and tells them that she knows where their father is and that they can have him back (at a price). Thor sacrifices his life (the start of the trailer when he is wrapped in chains in what looks like hell) and Loki is left alone (Strange probably just leaves with a \"you've found your father. My work here is done\").\n\nHela then tells Thor he can win his father back in a contest. Thor accepts and is transported to another realm. He is greeted by strange looks before being captured by Valkyrie (as seen in trailer). She takes him to wherever he needs to be to prepare for the contest. She then goes to tell the grand master about his new competitor. \n\nWith Thor gone, Hela travels to Asgard (presumably without using the Bifröst). She then unleashes whatever enormous power and destroys most of Asgard and enslaving the survivors. Heimdall however feels so angered by not seeing Hela's attack coming and so upset by the deaths that he abandons his post and leaves to find Thor (possibly with the warriors three). \n\nLoki, being the god of mischief (although not actually a god), finds his own way into where Thor is and as seen in the trailer watch the tournament (he could already be connected to the grand master). \n\nSo Thor fights several enemies and during an interval or something catches up with his friend the Hulk and the grandmaster's other competitors. They all reveal that they were brought here after dying to try and win back a loved one and return the living world with them. Hulk could speak of Betty Ross or someone like that. Valkyrie tells Thor that she was told Hela had Odin in hell and so went with the Valkyrior to retrieve him (female warriors on Pegasus in trailer). She then admits she was killed and is working for the grandmaster to earn back her friends who are being held captive by the grandmasters brother the collector. When Thor asks who told Valkyrie that Hela had Odin, she replied...Loki.\n\nThe friends then form a plan to escape bring down Loki, the grandmaster and Hela. After breaking out of the arena, defeating grandmaster and battling Loki, Thor's brother reveals his long plan that involved faking his death, surprising everyone on earth, losing to the avengers so he could go back to Asgard, faking his death again, killing Odin, send the Valkyrior to Hela who ended up killing their leader, Thor giving his life to save Odin so he'd be sent to the grandmaster's tournament where he'd die, tell Hela to take over Asgard so she could rule by Loki's side, kill Hela and be king of Asgard after all. \n\nSparing no expense, Thor kills Loki for real (finally) and our heroes set off to save Asgard from Hela. On the way they are stopped by Heimdall and the warriors three. The warriors three seek Thor's help but Heimdall reveals he came to kill Thor for his crimes. He says that Thor endangered Asgard and caused countless casualties and deaths by stealing the soul stone which will be revealed to be the source of Heimdall's power. Thor's friends will deny it but Thor will open a small magical container with the stone inside. Thor will explain that could have been the only way to revive his father if they found his body. The friends must stop Heimdall from murdering Thor and despite their differences and arguments they will save Asgard together. \n\nThey succeed and Hela is defeated. The soul stone is used to save Odin, Betty (or whoever) and the Valkyrior (who murdered and not captured) before being out in a safe place forever. The sixth and final infinity stone has been found.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64uwd4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "Cwade03", "saved": false, "mod_reports": [], "name": "t3_64uwd4", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": 1491987656.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/64uwd4/thorragnarok/", "num_reports": null, "locked": false, "stickied": false, "created": 1491985965.0, "url": "https://www.reddit.com/r/FanTheories/comments/64uwd4/thorragnarok/", "author_flair_text": null, "quarantine": false, "title": "Thor:Ragnarok", "created_utc": 1491957165.0, "distinguished": null, "media": null, "upvote_ratio": 0.48, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_64uwd4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_64uwd4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_64uwd4", "likes": null, "replies": "", "user_reports": [], "id": "dg6h5n3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Horus_P_Krishna_7", "parent_id": "t1_dg5k06f", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "that canon proof!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;that canon proof!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg6h5n3", "score_hidden": false, "stickied": false, "created": 1492056696.0, "created_utc": 1492027896.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5k06f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cwade03", "parent_id": "t1_dg5hrwe", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Because the mid-credits scene in Doctor Strange says what Thor and Loki are looking for Odin ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because the mid-credits scene in Doctor Strange says what Thor and Loki are looking for Odin &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg5k06f", "score_hidden": false, "stickied": false, "created": 1492006251.0, "created_utc": 1491977451.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5hrwe", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mfsupreme", "parent_id": "t3_64uwd4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Took me for a turn st the end with heimdall wanting to kill Thor.  I'm curious though, why would Loki be with Thor and strange to find Odin if Thor thinks Loki is dead.  Didn't the last movie end with Loki being \"dead\" but really being Odin ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Took me for a turn st the end with heimdall wanting to kill Thor.  I&amp;#39;m curious though, why would Loki be with Thor and strange to find Odin if Thor thinks Loki is dead.  Didn&amp;#39;t the last movie end with Loki being &amp;quot;dead&amp;quot; but really being Odin &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg5hrwe", "score_hidden": false, "stickied": false, "created": 1492001683.0, "created_utc": 1491972883.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]