[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;ET is one of the greatest films about childhood ever made. But on this most recent viewing I noticed that the main NASA scientist, Keys, the one who allows Elliot to say goodbye to E.T., looks eerily similar to the boy himself. Almost as if he were the grown-up version of Elliot. He even says &amp;quot;Elliott, he came to me, too. I&amp;#39;ve been wishing for this since I was 10 years old,&amp;quot; and then later says &amp;quot;I&amp;#39;m so glad he came to you first&amp;quot; (re: ET choosing Elliot). &lt;/p&gt;\n\n&lt;p&gt;So, here&amp;#39;s the story: 10 year old Elliot (in the first timeline)  had a life-changing encounter with ET, the world&amp;#39;s first known alien encounter, but it went wrong. The authorities weren&amp;#39;t aware of ET&amp;#39;s presence, and the kids, being kids, weren&amp;#39;t able to save the alien from dying before he could re-animate through Elliot&amp;#39;s love. This haunted Elliot as he grew up, and he went on to study physics, space, and extraterrestrial biology in college and graduate school, eventually rising through the ranks at NASA. Knowing that he already made Earth&amp;#39;s first contact with extraterrestrial life, but unable to prove it or find ET&amp;#39;s lifeless corpse, adult Elliot used his connections and clout  to enter into an experimental time-travel program. Able to prove the existence of ET through exploratory trips to his own past, Elliot was able to convince NASA to send their 1982 grounds crew to track down the alien and pull him from childhood Elliot before it was too late. Blinded by the scientific possibilities, adult Elliot forgot his connection with ET, and tracked the alien with the purpose of conducting experiments.  Adult Elliot (in this second timeline) is successful in co-opting the Thomas home in time to medically intervene on ET. This is the greatest moment of his life, and he&amp;#39;s been waiting for it since he was 10 years old, hence the line &amp;quot;Elliott, he came to me, too. I&amp;#39;ve been wishing for this since I was 10 years old.&amp;quot;.   But once adult Elliot is reminded of the innocence and love of ET, and of the innocence of his lost childhood, he begins to return to his more sentimental state, allowing kid Elliot to be alone with his alien friend to say goodbye, a moment adult Elliot never had in his own timeline. He realizes that there&amp;#39;s more to ET than scientific and career advancement, and is glad, for once, that his contact with alien life came when he was a child, not as an adult -- hence the line &amp;quot;i&amp;#39;m so glad he found you first.&amp;quot; Adult Elliot fulfills his childhood dream -- of ET living -- when ET rises from the dead fueled by kid Elliot&amp;#39;s love, hence why he seems happy -- not frustrated -- when ET finally goes &amp;quot;home&amp;quot; in his spaceship. &lt;/p&gt;\n\n&lt;p&gt;TLDR: Elliot and Keys are the same person. Elliot grows up and time travels back to 1982 to save his alien friend. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "ET is one of the greatest films about childhood ever made. But on this most recent viewing I noticed that the main NASA scientist, Keys, the one who allows Elliot to say goodbye to E.T., looks eerily similar to the boy himself. Almost as if he were the grown-up version of Elliot. He even says \"Elliott, he came to me, too. I've been wishing for this since I was 10 years old,\" and then later says \"I'm so glad he came to you first\" (re: ET choosing Elliot). \n\nSo, here's the story: 10 year old Elliot (in the first timeline)  had a life-changing encounter with ET, the world's first known alien encounter, but it went wrong. The authorities weren't aware of ET's presence, and the kids, being kids, weren't able to save the alien from dying before he could re-animate through Elliot's love. This haunted Elliot as he grew up, and he went on to study physics, space, and extraterrestrial biology in college and graduate school, eventually rising through the ranks at NASA. Knowing that he already made Earth's first contact with extraterrestrial life, but unable to prove it or find ET's lifeless corpse, adult Elliot used his connections and clout  to enter into an experimental time-travel program. Able to prove the existence of ET through exploratory trips to his own past, Elliot was able to convince NASA to send their 1982 grounds crew to track down the alien and pull him from childhood Elliot before it was too late. Blinded by the scientific possibilities, adult Elliot forgot his connection with ET, and tracked the alien with the purpose of conducting experiments.  Adult Elliot (in this second timeline) is successful in co-opting the Thomas home in time to medically intervene on ET. This is the greatest moment of his life, and he's been waiting for it since he was 10 years old, hence the line \"Elliott, he came to me, too. I've been wishing for this since I was 10 years old.\".   But once adult Elliot is reminded of the innocence and love of ET, and of the innocence of his lost childhood, he begins to return to his more sentimental state, allowing kid Elliot to be alone with his alien friend to say goodbye, a moment adult Elliot never had in his own timeline. He realizes that there's more to ET than scientific and career advancement, and is glad, for once, that his contact with alien life came when he was a child, not as an adult -- hence the line \"i'm so glad he found you first.\" Adult Elliot fulfills his childhood dream -- of ET living -- when ET rises from the dead fueled by kid Elliot's love, hence why he seems happy -- not frustrated -- when ET finally goes \"home\" in his spaceship. \n\nTLDR: Elliot and Keys are the same person. Elliot grows up and time travels back to 1982 to save his alien friend. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64z24b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "Jedisheep", "saved": false, "mod_reports": [], "name": "t3_64z24b", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/64z24b/et_keys_the_scientist_is_elliot_as_an_adult/", "num_reports": null, "locked": false, "stickied": false, "created": 1492041703.0, "url": "https://www.reddit.com/r/FanTheories/comments/64z24b/et_keys_the_scientist_is_elliot_as_an_adult/", "author_flair_text": null, "quarantine": false, "title": "[E.T.] Keys (the scientist) is Elliot as an adult", "created_utc": 1492012903.0, "distinguished": null, "media": null, "upvote_ratio": 0.69, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_64z24b", "likes": null, "replies": "", "user_reports": [], "id": "dg66mxu", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Mandalorianfist", "parent_id": "t3_64z24b", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This seems more like fan fiction than a theory. There is no basis for a time travel theory or any experimental program. Cool idea though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This seems more like fan fiction than a theory. There is no basis for a time travel theory or any experimental program. Cool idea though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg66mxu", "score_hidden": false, "stickied": false, "created": 1492045950.0, "created_utc": 1492017150.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}]