[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The Federation is a militant totalitarian society, but by the events of the film they simply have no external threats upon which to blame their problems. Without such an enemy, the society would undergo a revolution. To maintain their power base, the elites created the Bugs - an utterly alien but easily containable enemy - and manufactured a war with them.&lt;/p&gt;\n\n&lt;p&gt;First, we have the &amp;quot;Bug meteors.&amp;quot; The Bugs have no means of propelling a large asteroid &lt;em&gt;at all&lt;/em&gt;, let alone aiming it precisely at Earth from millions of light years away. Humanity didn&amp;#39;t even exist when it was supposedly sent towards our home planet. The asteroid was either directed at Earth by the Federation, or was a completely natural disaster that they used as a pretext for war.&lt;/p&gt;\n\n&lt;p&gt;Second, everything about the Arachnids screams &amp;quot;bio-weapon.&amp;quot; The different species/sub-species which make up the Bugs all conveniently fill a different battlefield role; the warriors are infantry, the tankers are artillery, the hoppers are skirmishes/scouts, and they&amp;#39;re all commanded by an intelligent psychic that can issue orders at will to the entire brood on the planet. That such a species would come about by chance seems highly unlikely; they were clearly made for war, not  survival on a barren planet.&lt;/p&gt;\n\n&lt;p&gt;Third, the Bugs need to be something which doesn&amp;#39;t ultimately pose a threat to the Federation but can &lt;em&gt;seem&lt;/em&gt; to. The Arachnids have no way to travel interstellar distances; the claim that they can colonize other planets by hurling their spore into space is absurd. By the time the spore reached a livable planet millions of years of evolution would have diverged the species. Thus the Bugs can be easily contained. Yet, they need to be an apparent threat. To this end, the first major engagement with the Arachnids (Klendathu) was set up to be a complete disaster. Rather than using bombing runs or orbital bombardment, assets were intentionally put into harm&amp;#39;s way. The capital ships were put in extremely close proximity to each other and told to ignore the anti-aircraft fire being hurled their way. Mobile infantry were sent in swarms at superior numbers without any apparent armor or air support. The result was a complete slaughter, which the media was able to spin into the prospect of humanity&amp;#39;s extinction.&lt;/p&gt;\n\n&lt;p&gt;In short, the Federation could completely obliterate the Arachnids at will. They don&amp;#39;t, however, because they &lt;em&gt;created&lt;/em&gt; them. Now they use them to create a protracted, bloody war to stabilize their society.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The Federation is a militant totalitarian society, but by the events of the film they simply have no external threats upon which to blame their problems. Without such an enemy, the society would undergo a revolution. To maintain their power base, the elites created the Bugs - an utterly alien but easily containable enemy - and manufactured a war with them.\n\nFirst, we have the \"Bug meteors.\" The Bugs have no means of propelling a large asteroid *at all*, let alone aiming it precisely at Earth from millions of light years away. Humanity didn't even exist when it was supposedly sent towards our home planet. The asteroid was either directed at Earth by the Federation, or was a completely natural disaster that they used as a pretext for war.\n\nSecond, everything about the Arachnids screams \"bio-weapon.\" The different species/sub-species which make up the Bugs all conveniently fill a different battlefield role; the warriors are infantry, the tankers are artillery, the hoppers are skirmishes/scouts, and they're all commanded by an intelligent psychic that can issue orders at will to the entire brood on the planet. That such a species would come about by chance seems highly unlikely; they were clearly made for war, not  survival on a barren planet.\n\nThird, the Bugs need to be something which doesn't ultimately pose a threat to the Federation but can *seem* to. The Arachnids have no way to travel interstellar distances; the claim that they can colonize other planets by hurling their spore into space is absurd. By the time the spore reached a livable planet millions of years of evolution would have diverged the species. Thus the Bugs can be easily contained. Yet, they need to be an apparent threat. To this end, the first major engagement with the Arachnids (Klendathu) was set up to be a complete disaster. Rather than using bombing runs or orbital bombardment, assets were intentionally put into harm's way. The capital ships were put in extremely close proximity to each other and told to ignore the anti-aircraft fire being hurled their way. Mobile infantry were sent in swarms at superior numbers without any apparent armor or air support. The result was a complete slaughter, which the media was able to spin into the prospect of humanity's extinction.\n\nIn short, the Federation could completely obliterate the Arachnids at will. They don't, however, because they *created* them. Now they use them to create a protracted, bloody war to stabilize their society.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "652fn6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 48, "report_reasons": null, "author": "SamuraiSpaceSquid", "saved": false, "mod_reports": [], "name": "t3_652fn6", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/652fn6/starship_troopers_the_federation_engineered_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492075091.0, "url": "https://www.reddit.com/r/FanTheories/comments/652fn6/starship_troopers_the_federation_engineered_the/", "author_flair_text": null, "quarantine": false, "title": "[Starship Troopers] The Federation engineered the Arachnids so that they could have an external threat", "created_utc": 1492046291.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 48}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": "", "user_reports": [], "id": "dg8q8jx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "alsorobots", "parent_id": "t1_dg8koow", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "From what I can tell, the strategy was to cause as many members of infantry to get taken away, injured, it would draw out the Brain Bug and they could also track the drones back to the nest.\n\nYes, they were being used as bait.  Note that NONE of the ruling class lost their lives during that conflict, and yet people had their lives thrown to the wolves every day just to draw out more Brain Bugs (I assume).  \n\nIt really was a huge morality tale about how fascism can turn a whole planet into a reactionary tool to get anything through fear and xenophobia.  It reminds me of the US government locking away the Ark of the Covenant at the end of Raiders.  They don't really know exactly what to do with the Brain Bug, but it's important they spent that many lives to get it! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From what I can tell, the strategy was to cause as many members of infantry to get taken away, injured, it would draw out the Brain Bug and they could also track the drones back to the nest.&lt;/p&gt;\n\n&lt;p&gt;Yes, they were being used as bait.  Note that NONE of the ruling class lost their lives during that conflict, and yet people had their lives thrown to the wolves every day just to draw out more Brain Bugs (I assume).  &lt;/p&gt;\n\n&lt;p&gt;It really was a huge morality tale about how fascism can turn a whole planet into a reactionary tool to get anything through fear and xenophobia.  It reminds me of the US government locking away the Ark of the Covenant at the end of Raiders.  They don&amp;#39;t really know exactly what to do with the Brain Bug, but it&amp;#39;s important they spent that many lives to get it! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg8q8jx", "score_hidden": false, "stickied": false, "created": 1492171158.0, "created_utc": 1492142358.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8koow", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SamuraiSpaceSquid", "parent_id": "t1_dg7spvr", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yes! \n\nI especially agree about the lack of air support and nukes at K... Why don't they just do a series of bombing runs with the fighter-bombers we see at P? Why don't they equip gunships with the missile-guided nukes that we later see, and have them obliterate the bugs down to their subterranean nests? It just makes no sense unless they were *deliberately* trying to create a bloodbath.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes! &lt;/p&gt;\n\n&lt;p&gt;I especially agree about the lack of air support and nukes at K... Why don&amp;#39;t they just do a series of bombing runs with the fighter-bombers we see at P? Why don&amp;#39;t they equip gunships with the missile-guided nukes that we later see, and have them obliterate the bugs down to their subterranean nests? It just makes no sense unless they were &lt;em&gt;deliberately&lt;/em&gt; trying to create a bloodbath.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg8koow", "score_hidden": false, "stickied": false, "created": 1492162933.0, "created_utc": 1492134133.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": "", "user_reports": [], "id": "dg8tnfq", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Kaminohanshin", "parent_id": "t1_dg7spvr", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Interesting stuff, but you kind of lost me at the end there with the whole 'replace white dude with black woman' and the brain bug being probed by phallic objects and stuff. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting stuff, but you kind of lost me at the end there with the whole &amp;#39;replace white dude with black woman&amp;#39; and the brain bug being probed by phallic objects and stuff. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg8tnfq", "score_hidden": false, "stickied": false, "created": 1492177374.0, "created_utc": 1492148574.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7spvr", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "alsorobots", "parent_id": "t1_dg7876j", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "If I may, the movie heavily implies that the asteroid that impacted Brazil was a \"wag the dog\" to consolidate power in the government and distract the populace from the fascism creeping into society.\n\nPaul Verhoeven uses the theme of violence to consolidate fascism quite often.  We see the exact same thing happen in Robocop.  A society that should be progressing towards democracy instead sees an orchestrated \"war\" overshadow the real problem, the people in power.\n\nThe book is fairly explicit that the meteor was sent to Earth by the bugs via a huge conspiracy spanning millions of years.  I believe in the book the bugs even had motivation for the war against humanity as we were creeping into their territory, violently setting up bases.\n\nHowever, in the film, the director asks the audience to consider that it's all a conspiracy.  Note what happens.  At the beginning of the film we see that society seems to be in a perpetual state of war.  Adults are either wealthy, or missing limbs.  The few affluent rich people that can afford to opt out are living in the lap of luxury while everyone else finds their only option to join the military.\n\nThe problem is, most of society seems to be joining the military.  \n\nSo the numbers need to be thinned out.\n\nWhy do I think the bug attack was staged?\n\nNote the bizarre propaganda sprinkled throughout the beginning of the film.  \n\nEven before the attack on Rio and \"Big K\" goes down, we see the characters strangely already being groomed to form a casual crust of racism against these creatures.  As subtle as it seems, these kids are dissecting these things in high school in highly graphic ways.  The teacher seems dismissive, almost Nazi-like in the way she dismisses the very humanity of what they're cutting apart.  It's more of an analysis on the bugs weaknesses than an actual dissection to learn their anatomy.  \n\nWe see that humanity is beginning to explore ESP and psychic phenomena, oddly, right as the \"brain bug\" becomes the target of the very government psychics that we see Neil Patrick Harris join in the film.  \"Military Intelligence\" indeed.\n\nSubtly, we even get a casual hint of a racial slur as NPH is playing with his ferret.  \"Go bug mom\", and he imprints the impression in the creatures mind that an insect is attacking the mother by crawling up her leg.  Don't think the casual use of \"bug\" in that line was a coincidence.\n\nSo the meteor hits (like a bullet, hitting another bullet, shot across a galaxy that's spinning...not the most efficient attack).\n\nAnd what do we see?  INSTANTLY we see propaganda created by the government.  Kids are stepping on roaches...squishing them with glee, the mother watching in an almost orgasmic rapture of joy.  We see that they've already analyzed the weaknesses of the bugs.\n\nAnd we see the failure at Klendathu.  Why did that happen?  Why were they misinformed about the plasma discharges?  Military intelligence?  The film clearly shows that human ships are in the area of the bugs, so it shouldn't be a surprise that these discharges are dangerous.  It doesn't take a genius to see that they're deliberately being aimed at ships in orbit.  Any moron could tell you that's anti-orbital aircraft fire.  \n\nThe invasion is sloppy, poorly supplied.  Infantry is sent in first, which makes no sense.  Only later is air support even considered.  Why?  This is the opposite of how battles are fought.  We see the soldiers firing automatic weapons that don't seem much more advanced than what our soldiers have NOW.  Yet, only a few months after Klendathu, we see them using MUCH more advanced weaponry.  Where did these advanced weapons come from?  Why weren't they given to the first wave of troops?\n\nThen, what happens?  We see a stereotypical commander, Caucasian, white as Wonder Bread, square jawed and buzz cutted have to step down due to the failure and who takes his place?  A black...woman.  Interesting.  Suddenly she changes the tune of the strategy.  \"We have to think like the bugs.\"\n\nWhy?  You have nuclear weapons.  \n\nYet at the end of the film, we see exactly why.  They're hunting for a \"brain bug\".  This isn't some sort of end game.  The war continues on after they capture it and horribly torture it using the most phallic means possible.  It's no accident that the Brain Bug looks very much like certain female body parts.  \n\nThe movie heavily implies that this was the reason for the attack in the first place, to give society enough anger and rage and racism against these bugs that they will go in, on the ground, on their feet, not driving huge tanks or anything...and crawl into the holes and offer their sweet, vulnerable brains...and find the Brain Bug.\n\nThe whole war was so humanity could further find ways of controlling people's minds.  That's the reason the asteroid was sent towards Earth.  Note we see perimeter defenses in our own Solar system in the film EASILY take our an asteroid.  Why was the first one allowed through?  \n\nBecause they wanted an excuse to find a way to consolidate more power at the very top of society.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I may, the movie heavily implies that the asteroid that impacted Brazil was a &amp;quot;wag the dog&amp;quot; to consolidate power in the government and distract the populace from the fascism creeping into society.&lt;/p&gt;\n\n&lt;p&gt;Paul Verhoeven uses the theme of violence to consolidate fascism quite often.  We see the exact same thing happen in Robocop.  A society that should be progressing towards democracy instead sees an orchestrated &amp;quot;war&amp;quot; overshadow the real problem, the people in power.&lt;/p&gt;\n\n&lt;p&gt;The book is fairly explicit that the meteor was sent to Earth by the bugs via a huge conspiracy spanning millions of years.  I believe in the book the bugs even had motivation for the war against humanity as we were creeping into their territory, violently setting up bases.&lt;/p&gt;\n\n&lt;p&gt;However, in the film, the director asks the audience to consider that it&amp;#39;s all a conspiracy.  Note what happens.  At the beginning of the film we see that society seems to be in a perpetual state of war.  Adults are either wealthy, or missing limbs.  The few affluent rich people that can afford to opt out are living in the lap of luxury while everyone else finds their only option to join the military.&lt;/p&gt;\n\n&lt;p&gt;The problem is, most of society seems to be joining the military.  &lt;/p&gt;\n\n&lt;p&gt;So the numbers need to be thinned out.&lt;/p&gt;\n\n&lt;p&gt;Why do I think the bug attack was staged?&lt;/p&gt;\n\n&lt;p&gt;Note the bizarre propaganda sprinkled throughout the beginning of the film.  &lt;/p&gt;\n\n&lt;p&gt;Even before the attack on Rio and &amp;quot;Big K&amp;quot; goes down, we see the characters strangely already being groomed to form a casual crust of racism against these creatures.  As subtle as it seems, these kids are dissecting these things in high school in highly graphic ways.  The teacher seems dismissive, almost Nazi-like in the way she dismisses the very humanity of what they&amp;#39;re cutting apart.  It&amp;#39;s more of an analysis on the bugs weaknesses than an actual dissection to learn their anatomy.  &lt;/p&gt;\n\n&lt;p&gt;We see that humanity is beginning to explore ESP and psychic phenomena, oddly, right as the &amp;quot;brain bug&amp;quot; becomes the target of the very government psychics that we see Neil Patrick Harris join in the film.  &amp;quot;Military Intelligence&amp;quot; indeed.&lt;/p&gt;\n\n&lt;p&gt;Subtly, we even get a casual hint of a racial slur as NPH is playing with his ferret.  &amp;quot;Go bug mom&amp;quot;, and he imprints the impression in the creatures mind that an insect is attacking the mother by crawling up her leg.  Don&amp;#39;t think the casual use of &amp;quot;bug&amp;quot; in that line was a coincidence.&lt;/p&gt;\n\n&lt;p&gt;So the meteor hits (like a bullet, hitting another bullet, shot across a galaxy that&amp;#39;s spinning...not the most efficient attack).&lt;/p&gt;\n\n&lt;p&gt;And what do we see?  INSTANTLY we see propaganda created by the government.  Kids are stepping on roaches...squishing them with glee, the mother watching in an almost orgasmic rapture of joy.  We see that they&amp;#39;ve already analyzed the weaknesses of the bugs.&lt;/p&gt;\n\n&lt;p&gt;And we see the failure at Klendathu.  Why did that happen?  Why were they misinformed about the plasma discharges?  Military intelligence?  The film clearly shows that human ships are in the area of the bugs, so it shouldn&amp;#39;t be a surprise that these discharges are dangerous.  It doesn&amp;#39;t take a genius to see that they&amp;#39;re deliberately being aimed at ships in orbit.  Any moron could tell you that&amp;#39;s anti-orbital aircraft fire.  &lt;/p&gt;\n\n&lt;p&gt;The invasion is sloppy, poorly supplied.  Infantry is sent in first, which makes no sense.  Only later is air support even considered.  Why?  This is the opposite of how battles are fought.  We see the soldiers firing automatic weapons that don&amp;#39;t seem much more advanced than what our soldiers have NOW.  Yet, only a few months after Klendathu, we see them using MUCH more advanced weaponry.  Where did these advanced weapons come from?  Why weren&amp;#39;t they given to the first wave of troops?&lt;/p&gt;\n\n&lt;p&gt;Then, what happens?  We see a stereotypical commander, Caucasian, white as Wonder Bread, square jawed and buzz cutted have to step down due to the failure and who takes his place?  A black...woman.  Interesting.  Suddenly she changes the tune of the strategy.  &amp;quot;We have to think like the bugs.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Why?  You have nuclear weapons.  &lt;/p&gt;\n\n&lt;p&gt;Yet at the end of the film, we see exactly why.  They&amp;#39;re hunting for a &amp;quot;brain bug&amp;quot;.  This isn&amp;#39;t some sort of end game.  The war continues on after they capture it and horribly torture it using the most phallic means possible.  It&amp;#39;s no accident that the Brain Bug looks very much like certain female body parts.  &lt;/p&gt;\n\n&lt;p&gt;The movie heavily implies that this was the reason for the attack in the first place, to give society enough anger and rage and racism against these bugs that they will go in, on the ground, on their feet, not driving huge tanks or anything...and crawl into the holes and offer their sweet, vulnerable brains...and find the Brain Bug.&lt;/p&gt;\n\n&lt;p&gt;The whole war was so humanity could further find ways of controlling people&amp;#39;s minds.  That&amp;#39;s the reason the asteroid was sent towards Earth.  Note we see perimeter defenses in our own Solar system in the film EASILY take our an asteroid.  Why was the first one allowed through?  &lt;/p&gt;\n\n&lt;p&gt;Because they wanted an excuse to find a way to consolidate more power at the very top of society.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg7spvr", "score_hidden": false, "stickied": false, "created": 1492129619.0, "created_utc": 1492100819.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7876j", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Elegios", "parent_id": "t1_dg77xd8", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I mean, again, this is a sci-fi universe where bugs can communicate via telepathy and mankind has the technology to somehow conduct a war on the opposite side of the galaxy without any real trouble.\n\nIt's certainly plausible to assume that the Bugs can use their collective psi-energy and open a wormhole or some shit, it's hardly anything weirder than psychic brain bugs learning by sucking out someone's brains, bugs somehow generating plasma bolts capable of breaking out of gravity into space, and that's not even mentioning the even more ridiculous stuff in the later films!\n\nIn the context of this universe, Bugs simply must have some form of biological FTL (Zerg from Starcraft, for example). Likewise, humans have somehow magically solved FTL as well. There just isn't any explanation in the films as to how its done.\n\nThe best point you have is that it's mentioned off-hand that the bugs shoot meteors from Klendathu to Earth (which is patently ridiculous unless they mean they shoot the meteor, open a wormhole, and propel it via that way to Earth). Then again, it's from a Federation newscast, which is hardly going to be a trustworthy source of information. I'll go with the unreliable narrator here. I think it's far more likely that both Bugs and humans have waved a magic wand of biological FTL and technological FTL and conveniently solved that problem.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, again, this is a sci-fi universe where bugs can communicate via telepathy and mankind has the technology to somehow conduct a war on the opposite side of the galaxy without any real trouble.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s certainly plausible to assume that the Bugs can use their collective psi-energy and open a wormhole or some shit, it&amp;#39;s hardly anything weirder than psychic brain bugs learning by sucking out someone&amp;#39;s brains, bugs somehow generating plasma bolts capable of breaking out of gravity into space, and that&amp;#39;s not even mentioning the even more ridiculous stuff in the later films!&lt;/p&gt;\n\n&lt;p&gt;In the context of this universe, Bugs simply must have some form of biological FTL (Zerg from Starcraft, for example). Likewise, humans have somehow magically solved FTL as well. There just isn&amp;#39;t any explanation in the films as to how its done.&lt;/p&gt;\n\n&lt;p&gt;The best point you have is that it&amp;#39;s mentioned off-hand that the bugs shoot meteors from Klendathu to Earth (which is patently ridiculous unless they mean they shoot the meteor, open a wormhole, and propel it via that way to Earth). Then again, it&amp;#39;s from a Federation newscast, which is hardly going to be a trustworthy source of information. I&amp;#39;ll go with the unreliable narrator here. I think it&amp;#39;s far more likely that both Bugs and humans have waved a magic wand of biological FTL and technological FTL and conveniently solved that problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg7876j", "score_hidden": false, "stickied": false, "created": 1492092274.0, "created_utc": 1492063474.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77xd8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "SamuraiSpaceSquid", "parent_id": "t1_dg777i5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; If they have Bugs capable of firing plasma at a velocity capable of breaking orbit... it's certainly possible they have other bio-tech capable of firing spores/queens/colonizers to other planets.\n\nEven if the spore is going at the speed of light, it's not getting anywhere anytime soon. The species that shot the spore is going to be something else entirely by the time it gets there.\n\n&gt; it's hardly a stretch to assume that a psychically-linked and controlled Bug species wouldn't be able to figure out at way to propel a big rock somewhere it wants to go.\n\nThey hit a planet on the other side of the galaxy with a meteor. That would require aiming the rock at where Earth would be in millions of years, accounting for the locations and movements of all obstacles in between. And they did it with *zero technology.* It's not just a stretch, it's Mr. Fantastic being tortured on the rack next to a black hole.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If they have Bugs capable of firing plasma at a velocity capable of breaking orbit... it&amp;#39;s certainly possible they have other bio-tech capable of firing spores/queens/colonizers to other planets.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Even if the spore is going at the speed of light, it&amp;#39;s not getting anywhere anytime soon. The species that shot the spore is going to be something else entirely by the time it gets there.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;it&amp;#39;s hardly a stretch to assume that a psychically-linked and controlled Bug species wouldn&amp;#39;t be able to figure out at way to propel a big rock somewhere it wants to go.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They hit a planet on the other side of the galaxy with a meteor. That would require aiming the rock at where Earth would be in millions of years, accounting for the locations and movements of all obstacles in between. And they did it with &lt;em&gt;zero technology.&lt;/em&gt; It&amp;#39;s not just a stretch, it&amp;#39;s Mr. Fantastic being tortured on the rack next to a black hole.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg77xd8", "score_hidden": false, "stickied": false, "created": 1492091653.0, "created_utc": 1492062853.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg777i5", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Elegios", "parent_id": "t3_652fn6", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Assuming this is only from the film:\n\nTo address a few of your points, we see that, at the battle of Big K, the Bugs are able to launch volatile plasma capable of shearing through presumably heavily armoured Federation ships in orbit around the planet. If they have Bugs capable of firing plasma at a velocity capable of breaking orbit (look at the scene, the shots are going wicked fast), it's certainly possible they have other bio-tech capable of firing spores/queens/colonizers to other planets. \n\nThis is a sci-fi universe where there is telepathy, psychic powers, mind control, and other forms of what we would think of as pure magic/science fiction ...it's hardly a stretch to assume that a psychically-linked and controlled Bug species wouldn't be able to figure out at way to propel a big rock somewhere it wants to go.\n\nAs for the actual military tactics, sure, the movie is ludicrous in that regard. I would argue that it's a hold-over from a world that has long since forgotten how to fight an actual war (the Federation was established many years before the Bugs) and, moreover, is a society that places military service, *not military proficiency*, at the pinnacle of human virtues. A few generations or decades of constant propaganda and self-delusion about the invincible nature of the Federation archetype (citizen with a gun, defending his own against the Enemy) could very well lead to a military situation where self-confidence and an inability to acknowledge the danger of their foes culminates in something like Big K.\n\nLastly, the asteroid proves that the Bugs are a threat. You don't need to massacre 100,000 men in the first hour of a battle to drive the point home, the destruction of an entire city does that enough. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Assuming this is only from the film:&lt;/p&gt;\n\n&lt;p&gt;To address a few of your points, we see that, at the battle of Big K, the Bugs are able to launch volatile plasma capable of shearing through presumably heavily armoured Federation ships in orbit around the planet. If they have Bugs capable of firing plasma at a velocity capable of breaking orbit (look at the scene, the shots are going wicked fast), it&amp;#39;s certainly possible they have other bio-tech capable of firing spores/queens/colonizers to other planets. &lt;/p&gt;\n\n&lt;p&gt;This is a sci-fi universe where there is telepathy, psychic powers, mind control, and other forms of what we would think of as pure magic/science fiction ...it&amp;#39;s hardly a stretch to assume that a psychically-linked and controlled Bug species wouldn&amp;#39;t be able to figure out at way to propel a big rock somewhere it wants to go.&lt;/p&gt;\n\n&lt;p&gt;As for the actual military tactics, sure, the movie is ludicrous in that regard. I would argue that it&amp;#39;s a hold-over from a world that has long since forgotten how to fight an actual war (the Federation was established many years before the Bugs) and, moreover, is a society that places military service, &lt;em&gt;not military proficiency&lt;/em&gt;, at the pinnacle of human virtues. A few generations or decades of constant propaganda and self-delusion about the invincible nature of the Federation archetype (citizen with a gun, defending his own against the Enemy) could very well lead to a military situation where self-confidence and an inability to acknowledge the danger of their foes culminates in something like Big K.&lt;/p&gt;\n\n&lt;p&gt;Lastly, the asteroid proves that the Bugs are a threat. You don&amp;#39;t need to massacre 100,000 men in the first hour of a battle to drive the point home, the destruction of an entire city does that enough. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg777i5", "score_hidden": false, "stickied": false, "created": 1492090114.0, "created_utc": 1492061314.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": "", "user_reports": [], "id": "dg6zf9k", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "dr69ons6mur6i", "parent_id": "t1_dg6yu1l", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I agree that we could enjoy it better if we didn't judge it on the fact that it doesn't match up to the book. But they decided to use the same name and characters and everything so of course we are going to judge it.\n\nEspecially for not giving me those sweet sweet power armor suits they had in the book. Those were fucking awesome.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that we could enjoy it better if we didn&amp;#39;t judge it on the fact that it doesn&amp;#39;t match up to the book. But they decided to use the same name and characters and everything so of course we are going to judge it.&lt;/p&gt;\n\n&lt;p&gt;Especially for not giving me those sweet sweet power armor suits they had in the book. Those were fucking awesome.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg6zf9k", "score_hidden": false, "stickied": false, "created": 1492078527.0, "created_utc": 1492049727.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6yu1l", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "SamuraiSpaceSquid", "parent_id": "t1_dg6yhhw", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Because it was made with significant, intentional divergences from the source material in order to express a completely different worldview. I choose to take it as its own original work rather than a live-action version of the book. We can enjoy it more if we don't judge it based on how much it reflects the novel.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because it was made with significant, intentional divergences from the source material in order to express a completely different worldview. I choose to take it as its own original work rather than a live-action version of the book. We can enjoy it more if we don&amp;#39;t judge it based on how much it reflects the novel.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg6yu1l", "score_hidden": false, "stickied": false, "created": 1492077798.0, "created_utc": 1492048998.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": "", "user_reports": [], "id": "dg7h5vp", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "WadeWilsonforPope", "parent_id": "t1_dg6yhhw", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt;  same story.\n\nDid... did we read the same book? The two are related but tell entirely different stories. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;same story.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Did... did we read the same book? The two are related but tell entirely different stories. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg7h5vp", "score_hidden": false, "stickied": false, "created": 1492115622.0, "created_utc": 1492086822.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6yhhw", "gilded": 0, "archived": false, "score": -14, "report_reasons": null, "author": "dr69ons6mur6i", "parent_id": "t1_dg6xqv9", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Of course it's an adaptation of the book. Same title, same characters, same story. How can you possibly classify it as anything other than an adaptation?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course it&amp;#39;s an adaptation of the book. Same title, same characters, same story. How can you possibly classify it as anything other than an adaptation?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg6yhhw", "score_hidden": false, "stickied": false, "created": 1492077357.0, "created_utc": 1492048557.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xqv9", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "SamuraiSpaceSquid", "parent_id": "t1_dg6xdvw", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This is based on the first movie. I haven't read the book; I understand it's quite different. Whether the first movie is \"shitty\" or a satire is up to interpretation, mainly depending on whether you consider it to be an adaptation of the book or not. I for one don't.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is based on the first movie. I haven&amp;#39;t read the book; I understand it&amp;#39;s quite different. Whether the first movie is &amp;quot;shitty&amp;quot; or a satire is up to interpretation, mainly depending on whether you consider it to be an adaptation of the book or not. I for one don&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg6xqv9", "score_hidden": false, "stickied": false, "created": 1492076440.0, "created_utc": 1492047640.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xdvw", "gilded": 0, "archived": false, "score": -10, "report_reasons": null, "author": "dr69ons6mur6i", "parent_id": "t3_652fn6", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Have you read the book? Or are you just going off the shitty movies?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you read the book? Or are you just going off the shitty movies?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg6xdvw", "score_hidden": false, "stickied": false, "created": 1492075992.0, "created_utc": 1492047192.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_652fn6", "likes": null, "replies": "", "user_reports": [], "id": "dg7hyq0", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "zodberg", "parent_id": "t3_652fn6", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Bug planet might be a different speed of existence than earth, or quadrillions of years older and their bio-system might have a stronger inclination towards random mutation than ours, so after a relative infinity of dominating the planet without opposition, the inevitability of change meant eventually fluctuation in the system would allow bugs to influence off-planet events. Organic orbital defense proves beneficial to a colony, so it spreads and after another infinity it's refined.\n\nThis isn't like Earth's genetic process where primordial genetic process started when it did and we've all grown from that. Their primordial genetic life could have happened before our sun existed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bug planet might be a different speed of existence than earth, or quadrillions of years older and their bio-system might have a stronger inclination towards random mutation than ours, so after a relative infinity of dominating the planet without opposition, the inevitability of change meant eventually fluctuation in the system would allow bugs to influence off-planet events. Organic orbital defense proves beneficial to a colony, so it spreads and after another infinity it&amp;#39;s refined.&lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t like Earth&amp;#39;s genetic process where primordial genetic process started when it did and we&amp;#39;ve all grown from that. Their primordial genetic life could have happened before our sun existed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg7hyq0", "score_hidden": false, "stickied": false, "created": 1492116903.0, "created_utc": 1492088103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]