[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;One of the more enduring mysteries of the show is Rick&amp;#39;s past. First I&amp;#39;ll go ahead and lay out what we do know. Rick was gone for all of Morty&amp;#39;s life. Rick was some form of rebel freedom fighter with Birdperson, Gearhead, Squanchy and possibly others. Lastly, whatever he was doing made him a direct and top priority enemy of the Galactic Federation. My theory goes that Rick was trying to protect his family, and by proxy all of Earth, from coming under the rule of the Galactic Federation. &lt;/p&gt;\n\n&lt;p&gt;This can help explain why the aliens don&amp;#39;t just come to Earth to capture Rick. They know that&amp;#39;s where he&amp;#39;s from and that it&amp;#39;s his home base, so you would think they&amp;#39;d show up at Earth to get him. I believe they don&amp;#39;t because they can&amp;#39;t. Rick spent years battling them to keep them away and at this point they know that if Rick is in play, Earth is off limits. This is also why they immediately take over Earth once Rick is captured. He was the only one keeping them away. &lt;/p&gt;\n\n&lt;p&gt;This can also add some extra emotion to when Rick is shown to remember Morty as a child. I imagine that he probably snuck into the house at some point to see baby Morty to remind himself why he&amp;#39;s fighting. He didn&amp;#39;t want to see Beth of Jerry or Summer since they would get mad and try to convince him to stay, and it would cause heartbreak all around. But he needed inspiration. Him seeing baby Morty is for him what the classic &amp;quot;do it for her&amp;quot; poster is to Homer Simpson. &lt;/p&gt;\n\n&lt;p&gt;Now why does he need to fight off the Federation? Well, as we see, they aren&amp;#39;t so great. They force everyone to consume pills, for some reason they forced Morty&amp;#39;s math teacher and other people to live underground in hiding, and for God&amp;#39;s sake if they&amp;#39;re the kind of society where Jerry gets awards all the time and is super successful, they gotta suck. Also, from what we learn when aliens want Jerry&amp;#39;s penis to save the life of a famous alien who fights for peace, apparently there have been several genocides and massive wars between Federation species that the government didn&amp;#39;t stop. Earth would get destroyed if they didn&amp;#39;t have Rick keeping the aliens at bay. &lt;/p&gt;\n\n&lt;p&gt;Tl;dr: Rick&amp;#39;s past as a freedom fighter was to keep aliens away from Earth to protect his family&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "One of the more enduring mysteries of the show is Rick's past. First I'll go ahead and lay out what we do know. Rick was gone for all of Morty's life. Rick was some form of rebel freedom fighter with Birdperson, Gearhead, Squanchy and possibly others. Lastly, whatever he was doing made him a direct and top priority enemy of the Galactic Federation. My theory goes that Rick was trying to protect his family, and by proxy all of Earth, from coming under the rule of the Galactic Federation. \n\nThis can help explain why the aliens don't just come to Earth to capture Rick. They know that's where he's from and that it's his home base, so you would think they'd show up at Earth to get him. I believe they don't because they can't. Rick spent years battling them to keep them away and at this point they know that if Rick is in play, Earth is off limits. This is also why they immediately take over Earth once Rick is captured. He was the only one keeping them away. \n\nThis can also add some extra emotion to when Rick is shown to remember Morty as a child. I imagine that he probably snuck into the house at some point to see baby Morty to remind himself why he's fighting. He didn't want to see Beth of Jerry or Summer since they would get mad and try to convince him to stay, and it would cause heartbreak all around. But he needed inspiration. Him seeing baby Morty is for him what the classic \"do it for her\" poster is to Homer Simpson. \n\nNow why does he need to fight off the Federation? Well, as we see, they aren't so great. They force everyone to consume pills, for some reason they forced Morty's math teacher and other people to live underground in hiding, and for God's sake if they're the kind of society where Jerry gets awards all the time and is super successful, they gotta suck. Also, from what we learn when aliens want Jerry's penis to save the life of a famous alien who fights for peace, apparently there have been several genocides and massive wars between Federation species that the government didn't stop. Earth would get destroyed if they didn't have Rick keeping the aliens at bay. \n\nTl;dr: Rick's past as a freedom fighter was to keep aliens away from Earth to protect his family", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "658ln2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "fantheories101", "saved": false, "mod_reports": [], "name": "t3_658ln2", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "spoiler", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": true, "permalink": "/r/FanTheories/comments/658ln2/rick_and_morty_what_rick_was_doing_all_that_time/", "num_reports": null, "locked": false, "stickied": false, "created": 1492149355.0, "url": "https://www.reddit.com/r/FanTheories/comments/658ln2/rick_and_morty_what_rick_was_doing_all_that_time/", "author_flair_text": null, "quarantine": false, "title": "[Rick and Morty] What Rick was doing all that time he was gone in the past [spoiler]", "created_utc": 1492120555.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_658ln2", "likes": null, "replies": "", "user_reports": [], "id": "dg8c1ll", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sc00terTHEshelt", "parent_id": "t3_658ln2", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Maybe the Federation is still in the process of taking control of planets. We can see this based on Unity's meeting with the Federation. This would explain why they are just now taking control of Earth. Also, not all planets are taken over by the Federation, as we see when Rick looks for more \"Earth-like\" planets to relocate to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe the Federation is still in the process of taking control of planets. We can see this based on Unity&amp;#39;s meeting with the Federation. This would explain why they are just now taking control of Earth. Also, not all planets are taken over by the Federation, as we see when Rick looks for more &amp;quot;Earth-like&amp;quot; planets to relocate to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg8c1ll", "score_hidden": false, "stickied": false, "created": 1492151228.0, "created_utc": 1492122428.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_658ln2", "likes": null, "replies": "", "user_reports": [], "id": "dg95r2j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "malibuflex", "parent_id": "t3_658ln2", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I thought they were underground as a resistance force. Which adds to what your saying. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought they were underground as a resistance force. Which adds to what your saying. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg95r2j", "score_hidden": false, "stickied": false, "created": 1492207181.0, "created_utc": 1492178381.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]