[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen a few midi-chlorian fixing theories on here, and my theory hopes to re-explain it with my own twist on it.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/FanTheories/comments/114sig/star_wars_midichlorians_are_a_symptom_of_the/\"&gt;First, read this two-sentence theory.&lt;/a&gt; If for some reason you want to stay on this page instead, it basically proposes that midi-chlorians are NOT where the Force comes from. Instead, they are attracted to Force users&amp;#39; auras and can be used to gauge someone&amp;#39;s Force potential, like Anakin Skywalker who had a midi-chlorian count of over 20,000. It would then stand to reason that midi-chlorians can also use the Force, or at least manipulate it through their host.&lt;/p&gt;\n\n&lt;p&gt;I propose that the midi-chlorians came into being relatively soon before the events of the Phantom Menace. The Jedi didn&amp;#39;t know much about them at this time, but knew they are present in greater quantities in more skilled Force users, and consequently believe they are the source of the Force. For a time, anyway; they are never mentioned in Episode II and are only talked about by Palpatine and Anakin in Episode III, and are mentioned in only three episodes of The Clone Wars. Before the events of Episode II, the Jedi discovered that midi-chlorians were not in fact the cause of the Force, but rather a side effect. From that point forward they are only talked about as an instrument of the Force by Palpatine and Anakin, and Qui-Gonn Jinn&amp;#39;s ghost, all of whom are in some way rebellious towards the Jedi Order.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s become a running joke among fans that throughout the TV shows and movies Stormtroopers can never seem to land a good shot. It&amp;#39;s a well-known theory now that the Stormtroopers were under orders to let Luke and the gang go from the first Death Star to track them to the rebel base, but even in later movies and in the TV shows whenever they fire a shot at a Jedi they just... miss. But it wasn&amp;#39;t their fault. The \nmidi-chlorians have continually been evolving to keep their hosts alive, so they redirected the shots through the Force. Between the \nevents of Episode IV (0 years before the Battle of Yavin) and Episode VII (34 years after the Battle of Yavin) Kylo Ren was able manipulate his midi-chlorians to the point of being able to completely stop the momentum of a blaster shot.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've seen a few midi-chlorian fixing theories on here, and my theory hopes to re-explain it with my own twist on it.\n\n[First, read this two-sentence theory.](https://www.reddit.com/r/FanTheories/comments/114sig/star_wars_midichlorians_are_a_symptom_of_the/) If for some reason you want to stay on this page instead, it basically proposes that midi-chlorians are NOT where the Force comes from. Instead, they are attracted to Force users' auras and can be used to gauge someone's Force potential, like Anakin Skywalker who had a midi-chlorian count of over 20,000. It would then stand to reason that midi-chlorians can also use the Force, or at least manipulate it through their host.\n\nI propose that the midi-chlorians came into being relatively soon before the events of the Phantom Menace. The Jedi didn't know much about them at this time, but knew they are present in greater quantities in more skilled Force users, and consequently believe they are the source of the Force. For a time, anyway; they are never mentioned in Episode II and are only talked about by Palpatine and Anakin in Episode III, and are mentioned in only three episodes of The Clone Wars. Before the events of Episode II, the Jedi discovered that midi-chlorians were not in fact the cause of the Force, but rather a side effect. From that point forward they are only talked about as an instrument of the Force by Palpatine and Anakin, and Qui-Gonn Jinn's ghost, all of whom are in some way rebellious towards the Jedi Order.\n\nIt's become a running joke among fans that throughout the TV shows and movies Stormtroopers can never seem to land a good shot. It's a well-known theory now that the Stormtroopers were under orders to let Luke and the gang go from the first Death Star to track them to the rebel base, but even in later movies and in the TV shows whenever they fire a shot at a Jedi they just... miss. But it wasn't their fault. The \nmidi-chlorians have continually been evolving to keep their hosts alive, so they redirected the shots through the Force. Between the \nevents of Episode IV (0 years before the Battle of Yavin) and Episode VII (34 years after the Battle of Yavin) Kylo Ren was able manipulate his midi-chlorians to the point of being able to completely stop the momentum of a blaster shot.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65a6dd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "Kickin_Hawk", "saved": false, "mod_reports": [], "name": "t3_65a6dd", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65a6dd/star_wars_evolving_midichlorians/", "num_reports": null, "locked": false, "stickied": false, "created": 1492167861.0, "url": "https://www.reddit.com/r/FanTheories/comments/65a6dd/star_wars_evolving_midichlorians/", "author_flair_text": null, "quarantine": false, "title": "[Star Wars] Evolving Midi-Chlorians", "created_utc": 1492139061.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65a6dd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65a6dd", "likes": null, "replies": "", "user_reports": [], "id": "dgabt63", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Chimneyfoot", "parent_id": "t1_dg9kiok", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Maybe force users have latent force ability that's activated when midichlorians \"eat\" the force aura. Kinda like how a lot of your digestive process is done by gut flora.\n\nThe midichlorians turn latent force ability into force power as a kind of byproduct (think trees making oxygen), and force users are able to use that force power.\n\nSorta makes sense if you think of it in terms of a long-established parasite that's evolved to help its host live longer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe force users have latent force ability that&amp;#39;s activated when midichlorians &amp;quot;eat&amp;quot; the force aura. Kinda like how a lot of your digestive process is done by gut flora.&lt;/p&gt;\n\n&lt;p&gt;The midichlorians turn latent force ability into force power as a kind of byproduct (think trees making oxygen), and force users are able to use that force power.&lt;/p&gt;\n\n&lt;p&gt;Sorta makes sense if you think of it in terms of a long-established parasite that&amp;#39;s evolved to help its host live longer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgabt63", "score_hidden": false, "stickied": false, "created": 1492262317.0, "created_utc": 1492233517.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9kiok", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "genericusername212", "parent_id": "t3_65a6dd", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I like the idea that they're a kind of parasite on force-users.\n\n\n\n\n\n\n\n\nBut if they are, how does manipulating them make you better at using the force? When ~~the senate~~ Palpatine is talking about them, he says that you can use them to evade death, I don't see how that fits..?\n\n\n\n\n\n\n\nThe only idea I can think of is a bit odd. You know how if you squash a mosquito that just bit you you can see your blood? Maybe the midi-chlorians feed off the force and digest it. A talented enough force-user could use the midi-chlorians as an external storage of power.... maybe...\n\n\n\n\nI don't know, what do you think?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like the idea that they&amp;#39;re a kind of parasite on force-users.&lt;/p&gt;\n\n&lt;p&gt;But if they are, how does manipulating them make you better at using the force? When &lt;del&gt;the senate&lt;/del&gt; Palpatine is talking about them, he says that you can use them to evade death, I don&amp;#39;t see how that fits..?&lt;/p&gt;\n\n&lt;p&gt;The only idea I can think of is a bit odd. You know how if you squash a mosquito that just bit you you can see your blood? Maybe the midi-chlorians feed off the force and digest it. A talented enough force-user could use the midi-chlorians as an external storage of power.... maybe...&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know, what do you think?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9kiok", "score_hidden": false, "stickied": false, "created": 1492224780.0, "created_utc": 1492195980.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]