[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Jack has helped so many people during his wanderings across Aku&amp;#39;s land. Now maybe this is already obvious to observant fans but I believe Jack will gather his allies and fight against Aku. &lt;/p&gt;\n\n&lt;p&gt;My first bit of evidence is canon the other is not. In the 32nd episode we see the guardian open a portal that displayed a vision of Jack. He&amp;#39;s wearing different clothes with a cape, a beard and a crown. This itself isn&amp;#39;t evidence of Jack defeating Aku or raising an army. &lt;/p&gt;\n\n&lt;p&gt;In my other piece of non canon evidence I will be talking about the samurai jack comics specifically issue 20. When a historian records the truth about Jack. Jack is seen with his allies including an aged Scotsman (I&amp;#39;ll get back to that). He explains how he abandoned his futile quest to go back in time. He continues on about how his allies are unified against Aku. This Jack believes that trying to recapture the past is foolish and that we must learn from it not be controlled by it. (Understandable assuming this takes place after/during season 5. His appearance in the comic is identical to the image in the portal. Now this doesn&amp;#39;t mean anything is a certainty, but the similarities are too great to ignore. In season 5 Jack seems to feel like Sisyphus constantly trying to push a boulder up a hill only for it to roll down time and time again. Except with time portals. Perhaps Jack will have a revelation and gather his allies. In the latest preview of the next episode we see an older Scotsman in what appears to be a wheelchair. This is where my theory would&amp;#39;ve fallen short because the Scotsman is walking on two legs in the comic. &lt;/p&gt;\n\n&lt;p&gt;Now the next part is where things get confusing. I&amp;#39;ve always wondered how time travel worked in the samurai jack universe. I&amp;#39;m not an expert on this topic so I may be wrong. I&amp;#39;ve noticed that whenever samurai jack misses a time portal it&amp;#39;s usually for doing a righteous selfless act. Why would morality still be applicable if he&amp;#39;s going to change the past? For example when those two monks were outnumbered Jack stopped let the time portal disappear while he saved them. Why would any of this matter if that future would never exist in the first place. One could argue that three things could&amp;#39;ve prevented him from going to the past. His honor which is strict and unwavering at least seasons 1-4. His empathy seeing innocent people suffer just so he could finish his quest. Finally he just can&amp;#39;t seem to understand how Aku&amp;#39;s time travel works or a combination of the three. Why would he understand how Aku&amp;#39;s power works? To my knowledge it&amp;#39;s not formally explained. If Jack went back in time then wouldn&amp;#39;t that mean every single person he has saved and every good thing he did was for nothing? &lt;/p&gt;\n\n&lt;p&gt;The guardian I previously mentioned said Jack was not yet ready for the time portal. Now this is another weak spot in my old theory. If Jack was never meant to go back in time then why would he need it? &lt;/p&gt;\n\n&lt;p&gt;My original theory: Jack will never go back in time&lt;/p&gt;\n\n&lt;p&gt;Evidence in favor of\n-Season 5 Jack is realizing how unrealistic returning home is.\n-He cannot age and is beginning to resemble himself in both the comic and portal. Although his beard is more disheveled. (Not really evidence but worth mentioning)\n- Jack may be undoing everything that he has accomplished in the future. Including losing all of his friends and allies. &lt;/p&gt;\n\n&lt;p&gt;Evidence against\n-The comics aren&amp;#39;t canon. I&amp;#39;m playing devils advocate despite the similarities. \n-The guardian believes it&amp;#39;s jacks destiny to one day be worthy of the time portal. \n-If the comics were canon and valid evidence wouldn&amp;#39;t the Scotsman be able to walk?&lt;/p&gt;\n\n&lt;p&gt;There is too much evidence to the contrary to accept this so I revised my theory. At first this theory was going to be that Jack would never return to the past. After much thought I have decided it will be that Jack will never fully undo the evil that is Aku.&lt;/p&gt;\n\n&lt;p&gt;If Jack is indeed destined to become this champion of the world then I think there must be alternate timelines. As I&amp;#39;ve mentioned I do have a limited grasp on this topic. Jack primary goal isn&amp;#39;t to kill Aku. It&amp;#39;s to return to the past and then stop him. For arguments sake let&amp;#39;s again acknowledge the possibility that the comics may have truth in them. What if Jack is meant to defeat Aku in the future and past? He realizes he can never reclaim his old life. Everyone he wants to save died horribly long ago and in the process raises an army against Aku defeating him. Then somehow he encounters the guardian that explains he is worthy of the portal and perhaps in the idea of alternate timelines. He returns to the past knowing he can&amp;#39;t undo the future he was in and kills Aku before he can spread his evil in this now diverging timeline he interfered in. Probably as soon as he crashes on Earth. Jack knows that although he could stay it&amp;#39;s not his time anymore. His family and friends they are meant to be with another Jack. Everyone he cares about and known for 50+ years is in the future he reclaimed. So now there is at least one timeline where Aku never corrupted and controlled the planet. Jack returns to his future and helps rebuild society after Aku&amp;#39;s defeat. Which is why my current theory is he can never fully undo what Aku did. &lt;/p&gt;\n\n&lt;p&gt;The most well known example of alternate timelines I can think of is DBZ the cell saga with future Trunks. If you have anything to contribute or flaws you want to point out I encourage you to comment.&lt;/p&gt;\n\n&lt;p&gt;TL;DR: Jack can&amp;#39;t undo Aku&amp;#39;s evil if time travel involves alternate timelines. Jack will defeat Aku in the past and future but will remain in the future because that is where everyone he cares about is. &lt;/p&gt;\n\n&lt;p&gt;Believe it or not this is only my second theory about samurai Jack&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "\nJack has helped so many people during his wanderings across Aku's land. Now maybe this is already obvious to observant fans but I believe Jack will gather his allies and fight against Aku. \n\nMy first bit of evidence is canon the other is not. In the 32nd episode we see the guardian open a portal that displayed a vision of Jack. He's wearing different clothes with a cape, a beard and a crown. This itself isn't evidence of Jack defeating Aku or raising an army. \n\nIn my other piece of non canon evidence I will be talking about the samurai jack comics specifically issue 20. When a historian records the truth about Jack. Jack is seen with his allies including an aged Scotsman (I'll get back to that). He explains how he abandoned his futile quest to go back in time. He continues on about how his allies are unified against Aku. This Jack believes that trying to recapture the past is foolish and that we must learn from it not be controlled by it. (Understandable assuming this takes place after/during season 5. His appearance in the comic is identical to the image in the portal. Now this doesn't mean anything is a certainty, but the similarities are too great to ignore. In season 5 Jack seems to feel like Sisyphus constantly trying to push a boulder up a hill only for it to roll down time and time again. Except with time portals. Perhaps Jack will have a revelation and gather his allies. In the latest preview of the next episode we see an older Scotsman in what appears to be a wheelchair. This is where my theory would've fallen short because the Scotsman is walking on two legs in the comic. \n\nNow the next part is where things get confusing. I've always wondered how time travel worked in the samurai jack universe. I'm not an expert on this topic so I may be wrong. I've noticed that whenever samurai jack misses a time portal it's usually for doing a righteous selfless act. Why would morality still be applicable if he's going to change the past? For example when those two monks were outnumbered Jack stopped let the time portal disappear while he saved them. Why would any of this matter if that future would never exist in the first place. One could argue that three things could've prevented him from going to the past. His honor which is strict and unwavering at least seasons 1-4. His empathy seeing innocent people suffer just so he could finish his quest. Finally he just can't seem to understand how Aku's time travel works or a combination of the three. Why would he understand how Aku's power works? To my knowledge it's not formally explained. If Jack went back in time then wouldn't that mean every single person he has saved and every good thing he did was for nothing? \n\nThe guardian I previously mentioned said Jack was not yet ready for the time portal. Now this is another weak spot in my old theory. If Jack was never meant to go back in time then why would he need it? \n\nMy original theory: Jack will never go back in time\n\nEvidence in favor of\n-Season 5 Jack is realizing how unrealistic returning home is.\n-He cannot age and is beginning to resemble himself in both the comic and portal. Although his beard is more disheveled. (Not really evidence but worth mentioning)\n- Jack may be undoing everything that he has accomplished in the future. Including losing all of his friends and allies. \n\nEvidence against\n-The comics aren't canon. I'm playing devils advocate despite the similarities. \n-The guardian believes it's jacks destiny to one day be worthy of the time portal. \n-If the comics were canon and valid evidence wouldn't the Scotsman be able to walk?\n\nThere is too much evidence to the contrary to accept this so I revised my theory. At first this theory was going to be that Jack would never return to the past. After much thought I have decided it will be that Jack will never fully undo the evil that is Aku.\n\nIf Jack is indeed destined to become this champion of the world then I think there must be alternate timelines. As I've mentioned I do have a limited grasp on this topic. Jack primary goal isn't to kill Aku. It's to return to the past and then stop him. For arguments sake let's again acknowledge the possibility that the comics may have truth in them. What if Jack is meant to defeat Aku in the future and past? He realizes he can never reclaim his old life. Everyone he wants to save died horribly long ago and in the process raises an army against Aku defeating him. Then somehow he encounters the guardian that explains he is worthy of the portal and perhaps in the idea of alternate timelines. He returns to the past knowing he can't undo the future he was in and kills Aku before he can spread his evil in this now diverging timeline he interfered in. Probably as soon as he crashes on Earth. Jack knows that although he could stay it's not his time anymore. His family and friends they are meant to be with another Jack. Everyone he cares about and known for 50+ years is in the future he reclaimed. So now there is at least one timeline where Aku never corrupted and controlled the planet. Jack returns to his future and helps rebuild society after Aku's defeat. Which is why my current theory is he can never fully undo what Aku did. \n\nThe most well known example of alternate timelines I can think of is DBZ the cell saga with future Trunks. If you have anything to contribute or flaws you want to point out I encourage you to comment.\n\n\nTL;DR: Jack can't undo Aku's evil if time travel involves alternate timelines. Jack will defeat Aku in the past and future but will remain in the future because that is where everyone he cares about is. \n\nBelieve it or not this is only my second theory about samurai Jack", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65a9w6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 26, "report_reasons": null, "author": "R0GUEA55A55IN", "saved": false, "mod_reports": [], "name": "t3_65a9w6", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65a9w6/samurai_jack_can_never_fully_undo_the_evil_that/", "num_reports": null, "locked": false, "stickied": false, "created": 1492169158.0, "url": "https://www.reddit.com/r/FanTheories/comments/65a9w6/samurai_jack_can_never_fully_undo_the_evil_that/", "author_flair_text": null, "quarantine": false, "title": "Samurai Jack can never fully undo the evil that is Aku", "created_utc": 1492140358.0, "distinguished": null, "media": null, "upvote_ratio": 0.8, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65a9w6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65a9w6", "likes": null, "replies": "", "user_reports": [], "id": "dgces4h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "R0GUEA55A55IN", "parent_id": "t1_dgc52iz", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "That's a good point", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a good point&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgces4h", "score_hidden": false, "stickied": false, "created": 1492397806.0, "created_utc": 1492369006.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc52iz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mbdnr", "parent_id": "t3_65a9w6", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "'Samurai Jack' is about journey not about destination.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#39;Samurai Jack&amp;#39; is about journey not about destination.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc52iz", "score_hidden": false, "stickied": false, "created": 1492384859.0, "created_utc": 1492356059.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]