[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Or, in a process similar having to sacrifice a physical body part in attempting human transmutation in the &lt;em&gt;Fullmetal Alchemist&lt;/em&gt; franchise, the Horcrux&amp;#39;s creator must physically &amp;quot;sacrifice&amp;quot; part of his/her body to create a Horcrux.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dnr:&lt;/strong&gt; What it says in the title. Horcruxes involve a form of alchemy mixed with the Dark Arts, involving permanent removal of part of the physical body as well as the soul, in order to create a &amp;quot;vessel for the soul&amp;quot;. (One must sacrifice one separate part of the body for each Horcrux.) This results, naturally, in a disfigured appearance, loss of organs / limbs / etc., and other negative effects, which we see with Lord Voldemort. (Full explanation below.) &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;As such, I would posit, too, that the &amp;quot;Horcrux ritual&amp;quot; found in &lt;em&gt;Secrets of the Darkest Art&lt;/em&gt;, also involves the branch of alchemy (also studied as a 6th-year-and up elective at Hogwarts), paired with the Dark Arts, as invented by the dark wizard Herpo the Foul.&lt;/p&gt;\n\n&lt;p&gt;Once, it is said that J.K. Rowling was asked by her editor how one can make a Horcrux. After hearing the explanation, the editor was physically sickened / &amp;quot;looked like throwing up / nauseated / horrified&amp;quot;. I believe that JK detailing the process as &amp;quot;ripping out one&amp;#39;s eyes&amp;quot;, &amp;quot;cutting off one&amp;#39;s tongue&amp;quot;, etc...to complete the process of making a Horcrux would definitely cause that sort of response.&lt;/p&gt;\n\n&lt;p&gt;Likewise, Rowling also stated, &amp;quot;I couldn&amp;#39;t possibly tell you [the full process or ritual of creating a Horcrux]...Some things are better left unsaid.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Let me explain as to why I think the process involves such &amp;quot;personal sacrifice&amp;quot;. They involve two examples involving Lord Voldemort&amp;#39;s Horcruxes: one being the Diary, and the other being the Locket.&lt;/p&gt;\n\n&lt;p&gt;Namely, the Diary is important, as it was Tom Riddle / Lord Voldemort&amp;#39;s first Horcrux. According to Rowling, Riddle used the death of Moaning Myrtle in order to create it — namely, he created the &amp;quot;supreme act&amp;quot; of murder. However, while other theories allege that creating a Horcrux involves necrophilia, or dismemberment of the murdered victim, the &amp;quot;untouched&amp;quot; state of Riddle&amp;#39;s victims, such as the Riddle family&amp;#39;s bodies (and Myrtle&amp;#39;s body) indicates this isn&amp;#39;t the case.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The maid had run screaming down the hill into the village and roused as many people as she could.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Lying there with their eyes wide open! Cold as ice! Still in their dinner things!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;[...] Then, just when things were looking very serious for Frank, the report on the Riddle&amp;#39; bodies came back and changed everything.&lt;/p&gt;\n\n&lt;p&gt;The police had never read an odder report. A team of doctors had examined the bodies and had concluded that none of the Riddles had been poisoned, stabbed, shot, strangles, suffocated, &lt;strong&gt;or (as far as they could tell) harmed at all&lt;/strong&gt;. In fact (the report continued, in a tone of unmistakable bewilderment), &lt;strong&gt;the Riddles all appeared to be in perfect health&lt;/strong&gt; -- apart from the fact that they were all dead. The doctors did note (as though determined to find something wrong with the bodies) that &lt;strong&gt;each of the Riddles had a look of terror upon his or her face&lt;/strong&gt; -- but as the frustrated police said, whoever heard of three people being frightened to death? (&lt;em&gt;Goblet of Fire&lt;/em&gt;)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;However, I believe that, instead of doing something to defile his victim&amp;#39;s bodies (which I believe that Riddle himself would find a &amp;quot;disgusting concept&amp;quot; in itself), Riddle disfigured / did harm to his &lt;em&gt;own&lt;/em&gt; body in order to create his Horcrux(es), the Diary included. If the soul, in &lt;em&gt;Harry Potter&lt;/em&gt;, is, indeed, tied to the body, then &amp;quot;ripping out a piece of one&amp;#39;s soul&amp;quot; would also mean one would have to &amp;quot;rip out of piece of one&amp;#39;s body&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;So what, exactly, did Riddle sacrifice for the Diary? I believe that, for this, Riddle carved out some of his own memories — sacrificing part of &amp;quot;himself&amp;quot; (figuratively) for the Diary&amp;#39;s existence. This could also mean that the &lt;em&gt;real&lt;/em&gt; Voldemort / Riddle, after the act, had permanent semi-amnesia, and no longer remembered some of his childhood or teenage years at all, missing them entirely from his memories. (Sort of like the effects of a powerful Memory Charm / &lt;em&gt;Obliviate&lt;/em&gt; on Gilderoy Lockhart.)&lt;/p&gt;\n\n&lt;p&gt;As for the Locket, when I was reading &lt;em&gt;Deathly Hallows&lt;/em&gt;, something stood out to me: Riddle&amp;#39;s &amp;quot;dark and handsome&amp;quot; eyes are mentioned as being contained &amp;quot;behind the two glass panes&amp;quot; of Slytherin&amp;#39;s Locket, when the Locket is opened with Parseltongue. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;The golden doors of the locket swung wide with a little click. Behind both of the glass windows within blinked a living eye, dark and handsome as Tom Riddle&amp;#39;s eyes had been before he turned them scarlet and slit-pupiled...&amp;quot; (&lt;em&gt;Half-Blood Prince&lt;/em&gt;)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It should be noted, interestingly, that it says that Riddle &amp;quot;turned&amp;quot; his eyes scarlet and slit-pupiled. What if he didn&amp;#39;t just &amp;quot;turn&amp;quot; them &amp;quot;scarlet&amp;quot;? What if he &lt;em&gt;replaced&lt;/em&gt; his original eyes with new, &amp;quot;scarlet and slit-pupiled&amp;quot; ones?&lt;/p&gt;\n\n&lt;p&gt;Likewise, we don&amp;#39;t know exactly when Voldemort made the Locket. However, if he sacrificed his own eyes to create it, he must have done so around the time of his meeting with Dumbledore to apply for the DADA position:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Voldemort had entered the room. His features were not those Harry had seen emerge from the great stone cauldron almost two years ago: They were not as snake-like, &lt;strong&gt;the eyes were not yet scarlet&lt;/strong&gt;, the face not yet masklike, and yet he was no longer handsome Tom Riddle.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yet, however, it should be noted that, through the creation of some of his Horcruxes, that Voldemort&amp;#39;s physical body &lt;em&gt;does&lt;/em&gt; appear much different, even grotesque:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;It was as though his features had been burned and blurred; they were waxy and oddly distorted, and the whites of the eyes now had a permanently bloody look, though the pupils were not yet the slits that Harry knew they would become.&lt;/strong&gt; He was wearing a long black cloak, and his face was as pale as the snow glistening on his shoulders...&amp;quot; (&lt;em&gt;Half-Blood Prince&lt;/em&gt;)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;His &amp;quot;white, waxy skin&amp;quot;? Could&amp;#39;ve been Voldemort sacrificing his own, human skin for a Horcrux, which would&amp;#39;ve been...particularly nasty / bloody / horrifying to witness. His &amp;quot;bloody&amp;quot; eyes? Could be from Voldemort sacrificing his eyes / most of his eyes to create a different Horcrux. His &amp;quot;high and cold&amp;quot; voice? Again, another replacement, likely for sacrificing his original voice / voice box.&lt;/p&gt;\n\n&lt;p&gt;We also know that Voldemort can, and has, created replacement body parts - and even sacrificed body parts - in Dark rituals related to Horcruxes before. Namely, &amp;quot;bone of the father, flesh of the servant, and blood of the enemy&amp;quot; to create a new, resurrected physical form for himself, with the help of Peter Pettigrew, towards the end of &lt;em&gt;Goblet of Fire&lt;/em&gt;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And now Wormtail was whimpering. He pulled a long, thin, shining silver dagger from inside his cloak. His voice broke into petrified sobs.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Flesh - of the servant - w-willingly given - you will - revive - your master.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He stretched his right hand out in front of him - the hand with the missing finger. He gripped the dagger very tightly in his left hand and swung it upward.&lt;/p&gt;\n\n&lt;p&gt;Harry realized what Wormtail was about to do a second before it happened - he closed his eyes as tightly as he could, but he could not block the scream that pierced the night, that went through Harry as though he had been stabbed with the dagger too. &lt;/p&gt;\n\n&lt;p&gt;He heard something fall to the ground, heard Wormtail&amp;#39;s anguished panting, then a sickening splash, as something was dropped into the cauldron.&lt;/p&gt;\n\n&lt;p&gt;Harry couldn&amp;#39;t stand to look...but the potion had turned a burning red; the light of it shone through Harry&amp;#39;s closed eyelids...&lt;/p&gt;\n\n&lt;p&gt;[...] Wormtail&amp;#39;s robes were shining with blood now; he had wrapped the stump of his arm in them... (&lt;em&gt;Goblet of Fire&lt;/em&gt;)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Namely, and, even to Harry&amp;#39;s own horror, Voldemort has Pettigrew &lt;em&gt;willingly slice off his own hand&lt;/em&gt; for his &amp;quot;rebirthing potion&amp;quot;. However, upon Voldemort&amp;#39;s resurrection in his new body, he is &amp;quot;merciful&amp;quot;, and, with a mere wave of his wand, gives Pettigrew a new, magical, &amp;quot;glove-like&amp;quot;, shining and silver artificial hand to replace the one he cut off for the ritual. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;[Voldemort] looked down at Wormtail, who continued to sob.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You returned to me, not out of loyalty, but out of fear of your old friends. You deserve this pain, Wormtail. You know that, don&amp;#39;t you?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes, Master,&amp;quot; moaned Wormtail, &amp;quot;please. Master...please...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yet you helped return me to my body,&amp;quot; said Voldemort coolly, watching Wormtail sob on the ground. &amp;quot;Worthless and traitorous as you are, you helped me...and Lord Voldemort rewards his helpers...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Voldemort raised his wand again and whirled it through the air. A streak of what looked like molten silver hung shining in the wand&amp;#39;s wake. Momentarily shapeless, it writhed and then formed itself into a gleaming replica of a human hand, bright as moonlight, which soared downward and fixed itself upon Wormtail&amp;#39;s bleeding wrist.&lt;/p&gt;\n\n&lt;p&gt;Wormtail&amp;#39;s sobbing stopped abruptly. His breathing harsh and ragged, he raised his head and stared in disbelief at the silver hand, now attached seamlessly to his arm, as though he were wearing a dazzling glove. He flexed the shining fingers, then, trembling, picked up a small twig on the ground and crushed it into powder. (&lt;em&gt;Goblet of Fire&lt;/em&gt;)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As we found out later, Voldemort even used what must&amp;#39;ve been a spell of his own creation, because later on, the hand could also immediately sense when Pettigrew had a moment of hesitation / doubt in his loyalty to the Dark Lord in &lt;em&gt;Deathly Hallows&lt;/em&gt;...and it proceeded to immediately strangle Pettigrew, presumably suffocating him until he died.&lt;/p&gt;\n\n&lt;p&gt;It stands to reason that, if Voldemort could create a new hand for Pettigrew out of magic with just a wave of his wand, and quite &amp;quot;lazily&amp;quot;, as if he were doing it from years or decades of experiece, he likely not only had practice doing so, becoming a master at replacing such lost limbs...but that he had used &lt;em&gt;himself&lt;/em&gt; as a test subject / guinea pig, for when he made his Horcruxes. &lt;/p&gt;\n\n&lt;p&gt;Likewise, it&amp;#39;s interesting that Voldemort seems to see no issue with letting Pettigrew basically bleed out from his severed arm for as long as he pleases. This may point to Voldemort being well-aware that Pettigrew&amp;#39;s wound isn&amp;#39;t fatal; or, if it is, then he waits a little while, letting Pettigrew suffer in pain and from blood loss, until he decides to ultimately replace the limb. This could point to Voldemort himself, at points in his past, subjecting himself to such terrible pain / blood loss, as possibly related to his &amp;quot;changed&amp;quot; appearance and his Horcruxes.&lt;/p&gt;\n\n&lt;p&gt;I also believe that the concept of creating a Horcrux, through using a mix of alchemy (namely, human / soul transmutation) and dark magic, shares much in-common with how the topic of human transmutation itself is treated in &lt;em&gt;Fullmetal Alchemist&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Namely, in the &lt;em&gt;Harry Potter&lt;/em&gt; books, according to Adalbert Waffling&amp;#39;s &lt;em&gt;Fundamental Laws of Magic&lt;/em&gt;:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;[To] tamper with the deepest mysteries — the source of life, the essence of self — only if prepared for consequences of the most extreme and dangerous kind.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;According to the textbook &lt;em&gt;Magick Moste Evile&lt;/em&gt; within the books:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Of the Horcrux, wickedest of magical inventions, we shall not speak nor give direction —&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;According to the HP Wiki:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;To create a Horcrux is to divide one&amp;#39;s soul — the &amp;quot;essence of self&amp;quot; — and it is therefore in the creation of a Horcrux that one falls prey to Adalbert Waffling&amp;#39;s first Fundamental Laws of Magic, which essentially states that tampering with one&amp;#39;s soul inevitably results in grave side effects.&lt;/p&gt;\n\n&lt;p&gt;[...] The nature and concepts of Horcruxes were so terrible, they were kept secret from most of the wizarding world, and very few people were ever made aware of their nature. Hogwarts banned any study of the subject of Horcruxes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This seems very similar to how human transmutation is seen, and treated, in &lt;em&gt;Fullmetal Alchemist&lt;/em&gt;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Unfortunately, these experiments have given birth to a dark and sinister side of alchemy. Whether out of despair, malice or inquisitive hubris, several alchemists have been known to attempt the application of transmutation to human bodies and souls, in essence, playing god with human lives. But, just as the Law of Equivalent Exchange applies to the transmutation of non-living matter, devastating rebounds can occur in Human Transmutation because human lives and souls are priceless according to the flow of the world.&lt;/p&gt;\n\n&lt;p&gt;[...] Using various experimental theories and methods, multiple alchemists in the manga and anime have endeavored to resurrect dead loved ones, but such pursuits are always failures, forbidden by the flow of the universe and alchemy itself.&lt;/p&gt;\n\n&lt;p&gt;In the manga, it is determined that resurrective Human Transmutation is impossible because a soul that has left the mortal coil has passed on into the afterlife and can never be called back by human means. The attempt will cause a rebound due to both the inherent lack of any particular substance able to match a human soul in value and the fact that the initiated transmutation is reaching for an unattainable goal. &lt;/p&gt;\n\n&lt;p&gt;Of the known attempted Human Transmutations, &lt;strong&gt;the rebound has been the &amp;quot;taking&amp;quot; of parts of the initiator&amp;#39;s body out of the living world and into the void of the flow&lt;/strong&gt; (in the case of the Elric brothers&amp;#39; attempted transmutation of their mother, Edward&amp;#39;s left leg and Alphonse&amp;#39;s entire body were taken and in the case of Izumi Curtis&amp;#39; attempt to revive her dead child, several of her internal organs were taken). It should be noted that the size of the body parts taken are generally equal to the size of the human being transmuted, in accordance with the law of Equivalent Exchange.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And, particularly interesting, especially given Voldemort&amp;#39;s desire to possess the Philosopher&amp;#39;s Stone in &lt;em&gt;Harry Potter in the Philosopher&amp;#39;s Stone&lt;/em&gt;:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In the 2003 [&lt;em&gt;Fullmetal Alchemist&lt;/em&gt;] anime, the results of resurrective Human Transmutation are different. The anime declares that it is possible to bring dead humans back into the living world, but upon being revived, they generally become inhuman Homunculi with the physical appearance and memories of the humans they used to be. Using the Philosopher&amp;#39;s Stone or a human life as the material to recall the soul, it is possible to bring back a human as a complete human.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The above explanation would also work to explain why Voldemort wanted the Philosopher&amp;#39;s Stone to begin with, in order to bring himself back (from his shadow-form after his original body was destroyed) as a &amp;quot;complete human&amp;quot;. He wanted the Philosopher&amp;#39;s Stone in order to give himself a new, &amp;quot;complete&amp;quot; human body, rather than having to &amp;quot;possess&amp;quot; other creatures and hosts, Quirrell included.&lt;/p&gt;\n\n&lt;p&gt;And, pertaining to the Horcruxes as well; why Lily&amp;#39;s protection remains &amp;quot;bound to Harry&amp;#39;s blood&amp;quot;; and why Voldemort wants Harry&amp;#39;s blood specifically in his resurrection:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Another terrible form of Human Transmutation is the manipulation of human souls. Though appearing on no official records, there have been experiments with Human Transmutation involving the extraction of souls from human bodies and the alchemical binding of said souls to inanimate objects...[usually by way of a rune drawn in blood on the object itself].&lt;/p&gt;\n\n&lt;p&gt;[...] In essence, these souls exist in the mortal plane without their bodies, are able to manipulate the objects to which they are bound and communicate verbally with beings around them but, of course, there are caveats.&lt;/p&gt;\n\n&lt;p&gt;[...] Though not all the specifics of soul binding have been made clear, it has been explained that the iron in the blood bonds alchemically with the iron in the object (as most instances of soul binding has used metal armor as a vessel) and the blood itself remains bound to the soul of the person from which it was taken.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;While, at first glance, this explanation does not seem to explain all of Voldemort&amp;#39;s Horcruxes, there is the possibility that it does. For example, it&amp;#39;s quite likely that Voldemort / Tom Riddle used his own blood to bind his Horcruxes to him, in order to &amp;quot;tether&amp;quot; his physical body (most of which is made up of blood) to the mortal plane of existence. &lt;/p&gt;\n\n&lt;p&gt;This means that Riddle could&amp;#39;ve easily used his blood in creating the Diary Horcrux, which which is shown to absorb liquids such as ink; the Ring, Cup, Locket, and Diadem, all of which are made out of metal, likely with some form of iron for a successful &amp;quot;blood binding&amp;quot;; and, of course, Harry and Nagini, both of which contain blood themselves, and thus, the iron required for a &amp;quot;blood / soul binding&amp;quot;. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;For additional resources on potential materials for the ritual, especially as related to traditional alchemy, you can read more &lt;a href=\"https://rurushu.wordpress.com/2010/09/02/alchemy-indepth-the-human-transmutation-circle/\"&gt;here&lt;/a&gt;, as cited from &lt;a href=\"https://en.wikipedia.org/wiki/George_Ripley_(alchemist\"&gt;Sir George Ripley&lt;/a&gt;&amp;#39;s &lt;em&gt;Recapitulation: Being A Paraphrastical Epitome of the Twelve Gates&lt;/em&gt; (sp?).&lt;/p&gt;\n\n&lt;p&gt;According to Wikipedia:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;George Ripley was one of England&amp;#39;s most famous alchemists. His alchemical writings attracted attention not only when they were published in the 15th century (1400&amp;#39;s), but also later in the 16th and 17th centuries (1500&amp;#39;s-1600&amp;#39;s). His writings were studied by noted figures such as the alchemist John Dee, Robert Boyle (who is considered to be the first modern chemist), and even Isaac Newton.&lt;/p&gt;\n\n&lt;p&gt;A great deal of myth has grown up around Ripley, such as that he studied in Italy for twenty years and became a favorite of Pope Innocent VIII. He did, however, spend a number of years on the continent, and after his return to England he wrote his work &lt;em&gt;The Compound of Alchymy; or, the Twelve Gates leading to the Discovery of the Philosopher&amp;#39;s Stone (Liber Duodecim Portarum)&lt;/em&gt; in 1471. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;The Cantilena Riplaei&lt;/em&gt; is one of the very first poetic composition on the subject of alchemy. Most of Ripley&amp;#39;s work is based on the work of pseudo-Ramon Lull, although &lt;em&gt;The Compound of Alchemy&lt;/em&gt; is based largely on the work of a little-known alchemist of the 15th century, named Guido de Montanor.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Within the canon of &lt;em&gt;Harry Potter&lt;/em&gt;, is it quite possible - even likely - that Sir George Ripley was, in fact, an alias of none other than Nicholas Flamel (1330 – 1418), after Flamel created the Philosopher&amp;#39;s Stone.&lt;/p&gt;\n\n&lt;p&gt;This is because not only do Ripley&amp;#39;s work almost exclusively feature on the process of creating the Stone itself, but Flamel was noted by Rowling as &amp;quot;going undercover / in-disguise&amp;quot; throughout the subsequent centuries.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;There are mentions of sightings of [Flamel] through the centuries because he was supposed to have gained immortality. There are still streets named after Flamel and his wife, Perenelle, in Paris.&amp;quot; - J.K. Rowling&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This would also explain why Flamel, despite being a French wizard who previously lived in Paris, &amp;quot;enjoyed his later years living a quiet life in Devon&amp;quot;. After Flamel&amp;#39;s apparent &amp;quot;death&amp;quot;, he moved to England under the guise of &amp;quot;Sir George Ripley&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Likewise, Ripley&amp;#39;s generous nature also matches that of Flamel, according to Rowling.&lt;/p&gt;\n\n&lt;p&gt;As reported by Thomas Fuller in his &lt;em&gt;Worthies of England&lt;/em&gt;, he describes &amp;quot;Ripley&amp;quot; as &amp;quot;a reputable English gentleman, who reported having seen a record in the island of Malta, which stated that Ripley gave the enormous sum of 100,000 pounds sterling annually to the Knights of that island and of Rhodes to support their war against the Turks&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;From the HP Wiki on Flamel:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In his youth, Nicolas attended Beauxbatons Academy of Magic in the Pyrenees Mountains of France, and it was at Beauxbatons that he met Perenelle, his future wife. It is said that he later funded both the castle and the grounds, and a fountain on the grounds was named after the couple.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Of course, seeing as how the Philosopher&amp;#39;s Stone can turn &amp;quot;lead into gold&amp;quot;, and Flamel (&amp;quot;Ripley&amp;quot;) being extremely wealthy, both &amp;quot;having said to have created a Philosopher&amp;#39;s Stone&amp;quot;, it stands to reason that the two are one and the same.&lt;/p&gt;\n\n&lt;p&gt;And, as such, Ripley / Flamel&amp;#39;s alchemical work (which is more likely than not probably included in the process of creating a Horcrux, as first devised by Herpo the Foul) may hint to Tom Riddle / Lord Voldemort having known of, and even planned to rob, Flamel / the Philosopher&amp;#39;s Stone years prior to &lt;em&gt;Harry Potter and the Philosopher&amp;#39;s Stone&lt;/em&gt;.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The &lt;em&gt;Fullmetal Alchemist&lt;/em&gt; explanations in block quotes came from the Wiki for the show / manga. &lt;/p&gt;\n\n&lt;p&gt;The reason why I use the explanation from &lt;em&gt;Fullmetal Alchemist&lt;/em&gt; as likely having relevance to &lt;em&gt;Harry Potter&lt;/em&gt; is because both franchises based their alchemy in their series off of real-life alchemical works and research, namely off of Sir George Ripley, and, of course, Nicholas Flamel.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Or, in a process similar having to sacrifice a physical body part in attempting human transmutation in the *Fullmetal Alchemist* franchise, the Horcrux's creator must physically \"sacrifice\" part of his/her body to create a Horcrux.\n\n------------------------------\n\n**tl;dnr:** What it says in the title. Horcruxes involve a form of alchemy mixed with the Dark Arts, involving permanent removal of part of the physical body as well as the soul, in order to create a \"vessel for the soul\". (One must sacrifice one separate part of the body for each Horcrux.) This results, naturally, in a disfigured appearance, loss of organs / limbs / etc., and other negative effects, which we see with Lord Voldemort. (Full explanation below.) \n\n-------------------------------\n\nAs such, I would posit, too, that the \"Horcrux ritual\" found in *Secrets of the Darkest Art*, also involves the branch of alchemy (also studied as a 6th-year-and up elective at Hogwarts), paired with the Dark Arts, as invented by the dark wizard Herpo the Foul.\n\nOnce, it is said that J.K. Rowling was asked by her editor how one can make a Horcrux. After hearing the explanation, the editor was physically sickened / \"looked like throwing up / nauseated / horrified\". I believe that JK detailing the process as \"ripping out one's eyes\", \"cutting off one's tongue\", etc...to complete the process of making a Horcrux would definitely cause that sort of response.\n\nLikewise, Rowling also stated, \"I couldn't possibly tell you [the full process or ritual of creating a Horcrux]...Some things are better left unsaid.\"\n\nLet me explain as to why I think the process involves such \"personal sacrifice\". They involve two examples involving Lord Voldemort's Horcruxes: one being the Diary, and the other being the Locket.\n\nNamely, the Diary is important, as it was Tom Riddle / Lord Voldemort's first Horcrux. According to Rowling, Riddle used the death of Moaning Myrtle in order to create it — namely, he created the \"supreme act\" of murder. However, while other theories allege that creating a Horcrux involves necrophilia, or dismemberment of the murdered victim, the \"untouched\" state of Riddle's victims, such as the Riddle family's bodies (and Myrtle's body) indicates this isn't the case.\n\n&gt; The maid had run screaming down the hill into the village and roused as many people as she could.\n\n&gt; \"Lying there with their eyes wide open! Cold as ice! Still in their dinner things!\"\n\n&gt; [...] Then, just when things were looking very serious for Frank, the report on the Riddle' bodies came back and changed everything.\n\n&gt; The police had never read an odder report. A team of doctors had examined the bodies and had concluded that none of the Riddles had been poisoned, stabbed, shot, strangles, suffocated, **or (as far as they could tell) harmed at all**. In fact (the report continued, in a tone of unmistakable bewilderment), **the Riddles all appeared to be in perfect health** -- apart from the fact that they were all dead. The doctors did note (as though determined to find something wrong with the bodies) that **each of the Riddles had a look of terror upon his or her face** -- but as the frustrated police said, whoever heard of three people being frightened to death? (*Goblet of Fire*)\n\nHowever, I believe that, instead of doing something to defile his victim's bodies (which I believe that Riddle himself would find a \"disgusting concept\" in itself), Riddle disfigured / did harm to his *own* body in order to create his Horcrux(es), the Diary included. If the soul, in *Harry Potter*, is, indeed, tied to the body, then \"ripping out a piece of one's soul\" would also mean one would have to \"rip out of piece of one's body\".\n\nSo what, exactly, did Riddle sacrifice for the Diary? I believe that, for this, Riddle carved out some of his own memories — sacrificing part of \"himself\" (figuratively) for the Diary's existence. This could also mean that the *real* Voldemort / Riddle, after the act, had permanent semi-amnesia, and no longer remembered some of his childhood or teenage years at all, missing them entirely from his memories. (Sort of like the effects of a powerful Memory Charm / *Obliviate* on Gilderoy Lockhart.)\n\nAs for the Locket, when I was reading *Deathly Hallows*, something stood out to me: Riddle's \"dark and handsome\" eyes are mentioned as being contained \"behind the two glass panes\" of Slytherin's Locket, when the Locket is opened with Parseltongue. \n\n&gt; \"The golden doors of the locket swung wide with a little click. Behind both of the glass windows within blinked a living eye, dark and handsome as Tom Riddle's eyes had been before he turned them scarlet and slit-pupiled...\" (*Half-Blood Prince*)\n\nIt should be noted, interestingly, that it says that Riddle \"turned\" his eyes scarlet and slit-pupiled. What if he didn't just \"turn\" them \"scarlet\"? What if he *replaced* his original eyes with new, \"scarlet and slit-pupiled\" ones?\n\nLikewise, we don't know exactly when Voldemort made the Locket. However, if he sacrificed his own eyes to create it, he must have done so around the time of his meeting with Dumbledore to apply for the DADA position:\n\n&gt; \"Voldemort had entered the room. His features were not those Harry had seen emerge from the great stone cauldron almost two years ago: They were not as snake-like, **the eyes were not yet scarlet**, the face not yet masklike, and yet he was no longer handsome Tom Riddle.\"\n\nYet, however, it should be noted that, through the creation of some of his Horcruxes, that Voldemort's physical body *does* appear much different, even grotesque:\n\n&gt; **It was as though his features had been burned and blurred; they were waxy and oddly distorted, and the whites of the eyes now had a permanently bloody look, though the pupils were not yet the slits that Harry knew they would become.** He was wearing a long black cloak, and his face was as pale as the snow glistening on his shoulders...\" (*Half-Blood Prince*)\n\nHis \"white, waxy skin\"? Could've been Voldemort sacrificing his own, human skin for a Horcrux, which would've been...particularly nasty / bloody / horrifying to witness. His \"bloody\" eyes? Could be from Voldemort sacrificing his eyes / most of his eyes to create a different Horcrux. His \"high and cold\" voice? Again, another replacement, likely for sacrificing his original voice / voice box.\n\nWe also know that Voldemort can, and has, created replacement body parts - and even sacrificed body parts - in Dark rituals related to Horcruxes before. Namely, \"bone of the father, flesh of the servant, and blood of the enemy\" to create a new, resurrected physical form for himself, with the help of Peter Pettigrew, towards the end of *Goblet of Fire*.\n\n&gt; And now Wormtail was whimpering. He pulled a long, thin, shining silver dagger from inside his cloak. His voice broke into petrified sobs.\n\n&gt; \"Flesh - of the servant - w-willingly given - you will - revive - your master.\"\n\n&gt; He stretched his right hand out in front of him - the hand with the missing finger. He gripped the dagger very tightly in his left hand and swung it upward.\n\n&gt; Harry realized what Wormtail was about to do a second before it happened - he closed his eyes as tightly as he could, but he could not block the scream that pierced the night, that went through Harry as though he had been stabbed with the dagger too. \n\n&gt; He heard something fall to the ground, heard Wormtail's anguished panting, then a sickening splash, as something was dropped into the cauldron.\n\n&gt; Harry couldn't stand to look...but the potion had turned a burning red; the light of it shone through Harry's closed eyelids...\n\n&gt; [...] Wormtail's robes were shining with blood now; he had wrapped the stump of his arm in them... (*Goblet of Fire*)\n\nNamely, and, even to Harry's own horror, Voldemort has Pettigrew *willingly slice off his own hand* for his \"rebirthing potion\". However, upon Voldemort's resurrection in his new body, he is \"merciful\", and, with a mere wave of his wand, gives Pettigrew a new, magical, \"glove-like\", shining and silver artificial hand to replace the one he cut off for the ritual. \n\n&gt; [Voldemort] looked down at Wormtail, who continued to sob.\n\n&gt; \"You returned to me, not out of loyalty, but out of fear of your old friends. You deserve this pain, Wormtail. You know that, don't you?\"\n\n&gt; \"Yes, Master,\" moaned Wormtail, \"please. Master...please...\"\n\n&gt; \"Yet you helped return me to my body,\" said Voldemort coolly, watching Wormtail sob on the ground. \"Worthless and traitorous as you are, you helped me...and Lord Voldemort rewards his helpers...\"\n\n&gt; Voldemort raised his wand again and whirled it through the air. A streak of what looked like molten silver hung shining in the wand's wake. Momentarily shapeless, it writhed and then formed itself into a gleaming replica of a human hand, bright as moonlight, which soared downward and fixed itself upon Wormtail's bleeding wrist.\n\n&gt; Wormtail's sobbing stopped abruptly. His breathing harsh and ragged, he raised his head and stared in disbelief at the silver hand, now attached seamlessly to his arm, as though he were wearing a dazzling glove. He flexed the shining fingers, then, trembling, picked up a small twig on the ground and crushed it into powder. (*Goblet of Fire*)\n\nAs we found out later, Voldemort even used what must've been a spell of his own creation, because later on, the hand could also immediately sense when Pettigrew had a moment of hesitation / doubt in his loyalty to the Dark Lord in *Deathly Hallows*...and it proceeded to immediately strangle Pettigrew, presumably suffocating him until he died.\n\nIt stands to reason that, if Voldemort could create a new hand for Pettigrew out of magic with just a wave of his wand, and quite \"lazily\", as if he were doing it from years or decades of experiece, he likely not only had practice doing so, becoming a master at replacing such lost limbs...but that he had used *himself* as a test subject / guinea pig, for when he made his Horcruxes. \n\nLikewise, it's interesting that Voldemort seems to see no issue with letting Pettigrew basically bleed out from his severed arm for as long as he pleases. This may point to Voldemort being well-aware that Pettigrew's wound isn't fatal; or, if it is, then he waits a little while, letting Pettigrew suffer in pain and from blood loss, until he decides to ultimately replace the limb. This could point to Voldemort himself, at points in his past, subjecting himself to such terrible pain / blood loss, as possibly related to his \"changed\" appearance and his Horcruxes.\n\nI also believe that the concept of creating a Horcrux, through using a mix of alchemy (namely, human / soul transmutation) and dark magic, shares much in-common with how the topic of human transmutation itself is treated in *Fullmetal Alchemist*.\n\nNamely, in the *Harry Potter* books, according to Adalbert Waffling's *Fundamental Laws of Magic*:\n\n&gt; \"[To] tamper with the deepest mysteries — the source of life, the essence of self — only if prepared for consequences of the most extreme and dangerous kind.\"\n\nAccording to the textbook *Magick Moste Evile* within the books:\n\n&gt; \"Of the Horcrux, wickedest of magical inventions, we shall not speak nor give direction —\"\n\nAccording to the HP Wiki:\n\n&gt; To create a Horcrux is to divide one's soul — the \"essence of self\" — and it is therefore in the creation of a Horcrux that one falls prey to Adalbert Waffling's first Fundamental Laws of Magic, which essentially states that tampering with one's soul inevitably results in grave side effects.\n\n&gt; [...] The nature and concepts of Horcruxes were so terrible, they were kept secret from most of the wizarding world, and very few people were ever made aware of their nature. Hogwarts banned any study of the subject of Horcruxes.\n\nThis seems very similar to how human transmutation is seen, and treated, in *Fullmetal Alchemist*.\n\n&gt; Unfortunately, these experiments have given birth to a dark and sinister side of alchemy. Whether out of despair, malice or inquisitive hubris, several alchemists have been known to attempt the application of transmutation to human bodies and souls, in essence, playing god with human lives. But, just as the Law of Equivalent Exchange applies to the transmutation of non-living matter, devastating rebounds can occur in Human Transmutation because human lives and souls are priceless according to the flow of the world.\n\n&gt; [...] Using various experimental theories and methods, multiple alchemists in the manga and anime have endeavored to resurrect dead loved ones, but such pursuits are always failures, forbidden by the flow of the universe and alchemy itself.\n\n&gt; In the manga, it is determined that resurrective Human Transmutation is impossible because a soul that has left the mortal coil has passed on into the afterlife and can never be called back by human means. The attempt will cause a rebound due to both the inherent lack of any particular substance able to match a human soul in value and the fact that the initiated transmutation is reaching for an unattainable goal. \n\n&gt; Of the known attempted Human Transmutations, **the rebound has been the \"taking\" of parts of the initiator's body out of the living world and into the void of the flow** (in the case of the Elric brothers' attempted transmutation of their mother, Edward's left leg and Alphonse's entire body were taken and in the case of Izumi Curtis' attempt to revive her dead child, several of her internal organs were taken). It should be noted that the size of the body parts taken are generally equal to the size of the human being transmuted, in accordance with the law of Equivalent Exchange.\n\nAnd, particularly interesting, especially given Voldemort's desire to possess the Philosopher's Stone in *Harry Potter in the Philosopher's Stone*:\n\n&gt; In the 2003 [*Fullmetal Alchemist*] anime, the results of resurrective Human Transmutation are different. The anime declares that it is possible to bring dead humans back into the living world, but upon being revived, they generally become inhuman Homunculi with the physical appearance and memories of the humans they used to be. Using the Philosopher's Stone or a human life as the material to recall the soul, it is possible to bring back a human as a complete human.\n\nThe above explanation would also work to explain why Voldemort wanted the Philosopher's Stone to begin with, in order to bring himself back (from his shadow-form after his original body was destroyed) as a \"complete human\". He wanted the Philosopher's Stone in order to give himself a new, \"complete\" human body, rather than having to \"possess\" other creatures and hosts, Quirrell included.\n\nAnd, pertaining to the Horcruxes as well; why Lily's protection remains \"bound to Harry's blood\"; and why Voldemort wants Harry's blood specifically in his resurrection:\n\n&gt; Another terrible form of Human Transmutation is the manipulation of human souls. Though appearing on no official records, there have been experiments with Human Transmutation involving the extraction of souls from human bodies and the alchemical binding of said souls to inanimate objects...[usually by way of a rune drawn in blood on the object itself].\n\n&gt; [...] In essence, these souls exist in the mortal plane without their bodies, are able to manipulate the objects to which they are bound and communicate verbally with beings around them but, of course, there are caveats.\n\n&gt; [...] Though not all the specifics of soul binding have been made clear, it has been explained that the iron in the blood bonds alchemically with the iron in the object (as most instances of soul binding has used metal armor as a vessel) and the blood itself remains bound to the soul of the person from which it was taken.\n\nWhile, at first glance, this explanation does not seem to explain all of Voldemort's Horcruxes, there is the possibility that it does. For example, it's quite likely that Voldemort / Tom Riddle used his own blood to bind his Horcruxes to him, in order to \"tether\" his physical body (most of which is made up of blood) to the mortal plane of existence. \n\nThis means that Riddle could've easily used his blood in creating the Diary Horcrux, which which is shown to absorb liquids such as ink; the Ring, Cup, Locket, and Diadem, all of which are made out of metal, likely with some form of iron for a successful \"blood binding\"; and, of course, Harry and Nagini, both of which contain blood themselves, and thus, the iron required for a \"blood / soul binding\". \n\n---------------------\n\nFor additional resources on potential materials for the ritual, especially as related to traditional alchemy, you can read more [here](https://rurushu.wordpress.com/2010/09/02/alchemy-indepth-the-human-transmutation-circle/), as cited from [Sir George Ripley](https://en.wikipedia.org/wiki/George_Ripley_(alchemist)'s *Recapitulation: Being A Paraphrastical Epitome of the Twelve Gates* (sp?).\n\nAccording to Wikipedia:\n\n&gt; George Ripley was one of England's most famous alchemists. His alchemical writings attracted attention not only when they were published in the 15th century (1400's), but also later in the 16th and 17th centuries (1500's-1600's). His writings were studied by noted figures such as the alchemist John Dee, Robert Boyle (who is considered to be the first modern chemist), and even Isaac Newton.\n\n&gt; A great deal of myth has grown up around Ripley, such as that he studied in Italy for twenty years and became a favorite of Pope Innocent VIII. He did, however, spend a number of years on the continent, and after his return to England he wrote his work *The Compound of Alchymy; or, the Twelve Gates leading to the Discovery of the Philosopher's Stone (Liber Duodecim Portarum)* in 1471. \n\n&gt; *The Cantilena Riplaei* is one of the very first poetic composition on the subject of alchemy. Most of Ripley's work is based on the work of pseudo-Ramon Lull, although *The Compound of Alchemy* is based largely on the work of a little-known alchemist of the 15th century, named Guido de Montanor.\n\nWithin the canon of *Harry Potter*, is it quite possible - even likely - that Sir George Ripley was, in fact, an alias of none other than Nicholas Flamel (1330 – 1418), after Flamel created the Philosopher's Stone.\n\nThis is because not only do Ripley's work almost exclusively feature on the process of creating the Stone itself, but Flamel was noted by Rowling as \"going undercover / in-disguise\" throughout the subsequent centuries.\n\n&gt; \"There are mentions of sightings of [Flamel] through the centuries because he was supposed to have gained immortality. There are still streets named after Flamel and his wife, Perenelle, in Paris.\" - J.K. Rowling\n\nThis would also explain why Flamel, despite being a French wizard who previously lived in Paris, \"enjoyed his later years living a quiet life in Devon\". After Flamel's apparent \"death\", he moved to England under the guise of \"Sir George Ripley\".\n\nLikewise, Ripley's generous nature also matches that of Flamel, according to Rowling.\n\nAs reported by Thomas Fuller in his *Worthies of England*, he describes \"Ripley\" as \"a reputable English gentleman, who reported having seen a record in the island of Malta, which stated that Ripley gave the enormous sum of 100,000 pounds sterling annually to the Knights of that island and of Rhodes to support their war against the Turks\".\n\nFrom the HP Wiki on Flamel:\n\n&gt; In his youth, Nicolas attended Beauxbatons Academy of Magic in the Pyrenees Mountains of France, and it was at Beauxbatons that he met Perenelle, his future wife. It is said that he later funded both the castle and the grounds, and a fountain on the grounds was named after the couple.\n\nOf course, seeing as how the Philosopher's Stone can turn \"lead into gold\", and Flamel (\"Ripley\") being extremely wealthy, both \"having said to have created a Philosopher's Stone\", it stands to reason that the two are one and the same.\n\nAnd, as such, Ripley / Flamel's alchemical work (which is more likely than not probably included in the process of creating a Horcrux, as first devised by Herpo the Foul) may hint to Tom Riddle / Lord Voldemort having known of, and even planned to rob, Flamel / the Philosopher's Stone years prior to *Harry Potter and the Philosopher's Stone*.\n\n------------\n\nThe *Fullmetal Alchemist* explanations in block quotes came from the Wiki for the show / manga. \n\nThe reason why I use the explanation from *Fullmetal Alchemist* as likely having relevance to *Harry Potter* is because both franchises based their alchemy in their series off of real-life alchemical works and research, namely off of Sir George Ripley, and, of course, Nicholas Flamel.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65b4dj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 661, "report_reasons": null, "author": "Obversa", "saved": false, "mod_reports": [], "name": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/veO3cw4rFyrtu0YAHBC10BQn_K7rdKmPr0A07HqnL0c.jpg?s=046e8fe46bb4ea32224a3b5c3cbed0d1", "width": 451, "height": 477}, "resolutions": [{"url": "https://i.redditmedia.com/veO3cw4rFyrtu0YAHBC10BQn_K7rdKmPr0A07HqnL0c.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=3be2520e52138a6d29091853b2b59f38", "width": 108, "height": 114}, {"url": "https://i.redditmedia.com/veO3cw4rFyrtu0YAHBC10BQn_K7rdKmPr0A07HqnL0c.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=c5be7a2e3c221e71b2163b908674e31b", "width": 216, "height": 228}, {"url": "https://i.redditmedia.com/veO3cw4rFyrtu0YAHBC10BQn_K7rdKmPr0A07HqnL0c.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=f4edafb5d19071f13c2c61ef8bae162d", "width": 320, "height": 338}], "variants": {}, "id": "9LBNRZZcdUMFJXoSrpEyYJMyZygzi6UucPlFXnIReYA"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": 1492154423.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65b4dj/harry_potter_horcruxes_are_created_by_the_creator/", "num_reports": null, "locked": false, "stickied": false, "created": 1492182006.0, "url": "https://www.reddit.com/r/FanTheories/comments/65b4dj/harry_potter_horcruxes_are_created_by_the_creator/", "author_flair_text": null, "quarantine": false, "title": "[Harry Potter] Horcruxes are created by the creator removing his/her own physical (body) parts with dark magic.", "created_utc": 1492153206.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 105, "visited": false, "subreddit_type": "public", "ups": 661}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgbez0j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "standish_", "parent_id": "t1_dgbaor6", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I agree that that theory is too complicated, but I'm not the one who posted it.\n\nAs for the regeneration ritual, you're confusing the ritual that restored Voldemort's body and the ritual which allowed him to retake physical form. Voldemort is already in the \"infant\" form when Harry sees him. The ritual Harry watches is the regeneration ritual that takes his poor physical form and turns it into the body he had during his prime. \n\nThe ritual that allowed Voldemort to move from disembodied to bodied is the one I was speculating about. That's the one I suspect involved necromancy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that that theory is too complicated, but I&amp;#39;m not the one who posted it.&lt;/p&gt;\n\n&lt;p&gt;As for the regeneration ritual, you&amp;#39;re confusing the ritual that restored Voldemort&amp;#39;s body and the ritual which allowed him to retake physical form. Voldemort is already in the &amp;quot;infant&amp;quot; form when Harry sees him. The ritual Harry watches is the regeneration ritual that takes his poor physical form and turns it into the body he had during his prime. &lt;/p&gt;\n\n&lt;p&gt;The ritual that allowed Voldemort to move from disembodied to bodied is the one I was speculating about. That&amp;#39;s the one I suspect involved necromancy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbez0j", "score_hidden": false, "stickied": false, "created": 1492331431.0, "created_utc": 1492302631.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbaor6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dgb966v", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Well, that's not entirely true. She might not discuss it, but in order for it to be more of a theory, there has to be evidence that backs up the claim. I say this because, frequently, this is a criticism that others have brought up for some of my own theories in the past, that they seemed to \"headcanon-y\" or \"unsubstantiated\" to be believable.\n\nIn this case, I am going to follow others' advice and question / test the soundness of the proffered idea.\n\nFor the claim \"Voldemort had Pettigrew rape and impregnate Bertha Jorkins to sacrifice a baby\", which I see passed around by word-of-mouth on the Internet a lot, well, that was just basically something that one fan pulled out of nowhere. It then \"made the rounds\". However, when we look at it, it doesn't really make sense that this would happen. There's no evidence for it, and it seems overly complicated.\n\nLikewise, it poses the question of, \"They have magic, and Voldemort can use his wand and has all of his magical capabilities. Why didn't they just sneak into a Muggle hospital and steal an infant to kill? Why go through all this trouble to have Pettigrew rape and impregnate Bertha Jorkins, when it's really needless?\" Or, really, just...\"they have *magic*\".\n\nOn top of this, Pettigrew is an Animagus who can easily slip in and out of places undetected, even in the presence of other witches and wizards. Voldemort could've easily just had Pettigrew go to steal a baby / infant to murder for the ritual in question.\n\nThat being said, Harry notes nothing remotely resembling a baby in the ritual scene, so if anything, Harry's existing POV from the books automatically disproves the idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, that&amp;#39;s not entirely true. She might not discuss it, but in order for it to be more of a theory, there has to be evidence that backs up the claim. I say this because, frequently, this is a criticism that others have brought up for some of my own theories in the past, that they seemed to &amp;quot;headcanon-y&amp;quot; or &amp;quot;unsubstantiated&amp;quot; to be believable.&lt;/p&gt;\n\n&lt;p&gt;In this case, I am going to follow others&amp;#39; advice and question / test the soundness of the proffered idea.&lt;/p&gt;\n\n&lt;p&gt;For the claim &amp;quot;Voldemort had Pettigrew rape and impregnate Bertha Jorkins to sacrifice a baby&amp;quot;, which I see passed around by word-of-mouth on the Internet a lot, well, that was just basically something that one fan pulled out of nowhere. It then &amp;quot;made the rounds&amp;quot;. However, when we look at it, it doesn&amp;#39;t really make sense that this would happen. There&amp;#39;s no evidence for it, and it seems overly complicated.&lt;/p&gt;\n\n&lt;p&gt;Likewise, it poses the question of, &amp;quot;They have magic, and Voldemort can use his wand and has all of his magical capabilities. Why didn&amp;#39;t they just sneak into a Muggle hospital and steal an infant to kill? Why go through all this trouble to have Pettigrew rape and impregnate Bertha Jorkins, when it&amp;#39;s really needless?&amp;quot; Or, really, just...&amp;quot;they have &lt;em&gt;magic&lt;/em&gt;&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;On top of this, Pettigrew is an Animagus who can easily slip in and out of places undetected, even in the presence of other witches and wizards. Voldemort could&amp;#39;ve easily just had Pettigrew go to steal a baby / infant to murder for the ritual in question.&lt;/p&gt;\n\n&lt;p&gt;That being said, Harry notes nothing remotely resembling a baby in the ritual scene, so if anything, Harry&amp;#39;s existing POV from the books automatically disproves the idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbaor6", "score_hidden": false, "stickied": false, "created": 1492325306.0, "created_utc": 1492296506.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb966v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "standish_", "parent_id": "t1_dgb4lkt", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Of course it is, we have to speculate because Rowling won't discuss it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course it is, we have to speculate because Rowling won&amp;#39;t discuss it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb966v", "score_hidden": false, "stickied": false, "created": 1492323107.0, "created_utc": 1492294307.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgcynbt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Democrab", "parent_id": "t1_dgcszek", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "It's a fan theory. There's conjecture involved. You're saying that because we don't specifically get told it happens in the book, it doesn't happen...By that logic, your own theory doesn't work because while there's a lot of supporting evidence for it, we aren't specifically told that Voldemorts physical changes were due to self-mutilation let alone specifically for use in a Horcrux.\n\nWe know Bertha went missing for quite some time before we see Voldemort has a new, rudimentary body, Voldemort had the shape of a human child, but \"thin and feeble\" looking, seeming \"almost helpless\". Wormtail had to tend to him constantly (Much like parents do to an infant) even \"milking Nagini\" to feed him and we know what I said in my previous post. It's enough to see why plenty of people can see it as true...Rowling is known for trying to put specific images in your mind when describing something for a reason, and she's clearly trying to portray Voldemort as alive, but in a body that is clearly unnatural and completely unable to fend for himself. \n\nYour theory only has Voldemorts appearance changing to an extreme level and somewhat matching the very rough timeline we've been given for his Horcrux creation, Voldemort clearly being good at creating magical limbs and a bunch of stuff from FMA that somewhat applies to HP because they've used similar real life sources..You really don't have much to actually go on past your own conjecture on points left open by the Author and the theory I'm saying does the exact same thing...We'll likely never get proof of either because Rowling isn't the kind of person to talk about that but going from what we do know, it's very likely that Voldemorts rudimentary body was originally an unborn fetus and that he required a Witch/Wizard to help him create said body (Whether it was in order to literally get Bertha pregnant or to kill her for something else) and it's very likely the changes in his body have something to do with Horcruxes, probably the missing/replaced bits literally being in those horcruxes..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a fan theory. There&amp;#39;s conjecture involved. You&amp;#39;re saying that because we don&amp;#39;t specifically get told it happens in the book, it doesn&amp;#39;t happen...By that logic, your own theory doesn&amp;#39;t work because while there&amp;#39;s a lot of supporting evidence for it, we aren&amp;#39;t specifically told that Voldemorts physical changes were due to self-mutilation let alone specifically for use in a Horcrux.&lt;/p&gt;\n\n&lt;p&gt;We know Bertha went missing for quite some time before we see Voldemort has a new, rudimentary body, Voldemort had the shape of a human child, but &amp;quot;thin and feeble&amp;quot; looking, seeming &amp;quot;almost helpless&amp;quot;. Wormtail had to tend to him constantly (Much like parents do to an infant) even &amp;quot;milking Nagini&amp;quot; to feed him and we know what I said in my previous post. It&amp;#39;s enough to see why plenty of people can see it as true...Rowling is known for trying to put specific images in your mind when describing something for a reason, and she&amp;#39;s clearly trying to portray Voldemort as alive, but in a body that is clearly unnatural and completely unable to fend for himself. &lt;/p&gt;\n\n&lt;p&gt;Your theory only has Voldemorts appearance changing to an extreme level and somewhat matching the very rough timeline we&amp;#39;ve been given for his Horcrux creation, Voldemort clearly being good at creating magical limbs and a bunch of stuff from FMA that somewhat applies to HP because they&amp;#39;ve used similar real life sources..You really don&amp;#39;t have much to actually go on past your own conjecture on points left open by the Author and the theory I&amp;#39;m saying does the exact same thing...We&amp;#39;ll likely never get proof of either because Rowling isn&amp;#39;t the kind of person to talk about that but going from what we do know, it&amp;#39;s very likely that Voldemorts rudimentary body was originally an unborn fetus and that he required a Witch/Wizard to help him create said body (Whether it was in order to literally get Bertha pregnant or to kill her for something else) and it&amp;#39;s very likely the changes in his body have something to do with Horcruxes, probably the missing/replaced bits literally being in those horcruxes..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcynbt", "score_hidden": false, "stickied": false, "created": 1492424271.0, "created_utc": 1492395471.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcszek", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dgbm3xo", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; A lot of black magic involves unborn babies.\n\nWhile a lot of black magic may involve this, there is no evidence that Rowling's version of magic does. Black magic in general involving unborn babies does not mean that Rowling's version of it does. To me, the theory claiming this is an example of false equivalence, a common logical fallacy. As such, the logic involved is unsound.\n\ni.e. \"A (black magic) involves B (unborn babies). C (Harry Potter) has A. Therefore, C has A that involves B.\" The logic here isn't really sound. Likewise, this statement doesn't make sense.\n\n&gt; we do know what happened was disgusting and that fits the bill perfectly.\n\nNo, it doesn't. As I said, there's literally no evidence for it, no evidence that Bertha Jorkins was even pregnant at all. \"Something disgusting\" happening does not equate to the outlandish explanation that many have been passing around. ", "edited": 1492388067.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;A lot of black magic involves unborn babies.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;While a lot of black magic may involve this, there is no evidence that Rowling&amp;#39;s version of magic does. Black magic in general involving unborn babies does not mean that Rowling&amp;#39;s version of it does. To me, the theory claiming this is an example of false equivalence, a common logical fallacy. As such, the logic involved is unsound.&lt;/p&gt;\n\n&lt;p&gt;i.e. &amp;quot;A (black magic) involves B (unborn babies). C (Harry Potter) has A. Therefore, C has A that involves B.&amp;quot; The logic here isn&amp;#39;t really sound. Likewise, this statement doesn&amp;#39;t make sense.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;we do know what happened was disgusting and that fits the bill perfectly.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, it doesn&amp;#39;t. As I said, there&amp;#39;s literally no evidence for it, no evidence that Bertha Jorkins was even pregnant at all. &amp;quot;Something disgusting&amp;quot; happening does not equate to the outlandish explanation that many have been passing around. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcszek", "score_hidden": false, "stickied": false, "created": 1492416682.0, "created_utc": 1492387882.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbm3xo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Democrab", "parent_id": "t1_dgb4lkt", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Actually, there is. We know that Rowling bases a lot of the magic lore off of old writings, languages, ideas, etc relating to the subject. A lot of black magic involves unborn babies. We also know Voldemort valued blood purity, I could see him waiting until he can at least get a rudimentary body with magical blood rather deface his spirit with a mudblood body. \n\nRape isn't necessarily part of it, she may have already been pregnant but we do know what happened was disgusting and that fits the bill perfectly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually, there is. We know that Rowling bases a lot of the magic lore off of old writings, languages, ideas, etc relating to the subject. A lot of black magic involves unborn babies. We also know Voldemort valued blood purity, I could see him waiting until he can at least get a rudimentary body with magical blood rather deface his spirit with a mudblood body. &lt;/p&gt;\n\n&lt;p&gt;Rape isn&amp;#39;t necessarily part of it, she may have already been pregnant but we do know what happened was disgusting and that fits the bill perfectly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbm3xo", "score_hidden": false, "stickied": false, "created": 1492341851.0, "created_utc": 1492313051.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4lkt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dgah9ta", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The thing is, though, /u/standish_ and /u/Gigantonigro mentioned what are, essentially, headcanons. There's no evidence within the books to suggest either possibility is the case, and as such, it's based purely on personal belief and speculation. (I bring this up because I've seen the same theory being passed around a lot in the *Harry Potter* fandom whenever Horcrux creation is brought up.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is, though, &lt;a href=\"/u/standish_\"&gt;/u/standish_&lt;/a&gt; and &lt;a href=\"/u/Gigantonigro\"&gt;/u/Gigantonigro&lt;/a&gt; mentioned what are, essentially, headcanons. There&amp;#39;s no evidence within the books to suggest either possibility is the case, and as such, it&amp;#39;s based purely on personal belief and speculation. (I bring this up because I&amp;#39;ve seen the same theory being passed around a lot in the &lt;em&gt;Harry Potter&lt;/em&gt; fandom whenever Horcrux creation is brought up.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb4lkt", "score_hidden": false, "stickied": false, "created": 1492316801.0, "created_utc": 1492288001.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgah9ta", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Democrab", "parent_id": "t1_dg9zfmu", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Bertha Jorkins. \n\nEither that or you literally use dark magic to reshape some form of creature, literally hand creating the rudimentary body. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bertha Jorkins. &lt;/p&gt;\n\n&lt;p&gt;Either that or you literally use dark magic to reshape some form of creature, literally hand creating the rudimentary body. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgah9ta", "score_hidden": false, "stickied": false, "created": 1492276197.0, "created_utc": 1492247397.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9zfmu", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "Gigantonigro", "parent_id": "t1_dg9hdr2", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Makes sense. Another Theory is, that Bertha whats-her-name was pregnant or impregnated by Pettigrew and Voldemort possessed the Newborn.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Makes sense. Another Theory is, that Bertha whats-her-name was pregnant or impregnated by Pettigrew and Voldemort possessed the Newborn.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9zfmu", "score_hidden": false, "stickied": false, "created": 1492243701.0, "created_utc": 1492214901.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9hdr2", "gilded": 0, "archived": false, "score": 71, "report_reasons": null, "author": "standish_", "parent_id": "t1_dg994st", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "My personal theory on that act is that it requires you kill an unborn child and use it's corpse to \"birth\" a new body for the lost soul.\n\nA really vile necromantic ritual.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My personal theory on that act is that it requires you kill an unborn child and use it&amp;#39;s corpse to &amp;quot;birth&amp;quot; a new body for the lost soul.&lt;/p&gt;\n\n&lt;p&gt;A really vile necromantic ritual.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9hdr2", "score_hidden": false, "stickied": false, "created": 1492221053.0, "created_utc": 1492192253.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 71}}], "after": null, "before": null}}, "user_reports": [], "id": "dg994st", "gilded": 0, "archived": false, "score": 74, "report_reasons": null, "author": "IamCarbonMan", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "There's one thing that everybody always gets wrong in these Horcrux ritual theories (although you've somewhat avoided this pitfall):\n\n&gt; JKR: I see it as a series of things you would have to do. So you would have to perform a spell. But you would also-- I don't even know if I want to say it out loud, I know that sounds funny. But I did really think it through. There are two things that I think are too horrible, actually, to go into detail about. One of them is how Pettigrew brought Voldemort back into a rudimentary body. 'Cause I told my editor what I thought happened there, and she looked as though she was gonna vomit. And then-- and the other thing is, how you make a Horcrux. And I don't even like-- I don't know. Will it be in the Encyclopedia? I don't know if I can bring myself to, ummm... I don't know.\n\nIt wasn't the Horcrux ritual that made the editor sick, it was whatever process allowed Voldemort to become an infant again in Goblet of Fire.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s one thing that everybody always gets wrong in these Horcrux ritual theories (although you&amp;#39;ve somewhat avoided this pitfall):&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;JKR: I see it as a series of things you would have to do. So you would have to perform a spell. But you would also-- I don&amp;#39;t even know if I want to say it out loud, I know that sounds funny. But I did really think it through. There are two things that I think are too horrible, actually, to go into detail about. One of them is how Pettigrew brought Voldemort back into a rudimentary body. &amp;#39;Cause I told my editor what I thought happened there, and she looked as though she was gonna vomit. And then-- and the other thing is, how you make a Horcrux. And I don&amp;#39;t even like-- I don&amp;#39;t know. Will it be in the Encyclopedia? I don&amp;#39;t know if I can bring myself to, ummm... I don&amp;#39;t know.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It wasn&amp;#39;t the Horcrux ritual that made the editor sick, it was whatever process allowed Voldemort to become an infant again in Goblet of Fire.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg994st", "score_hidden": false, "stickied": false, "created": 1492211609.0, "created_utc": 1492182809.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 74}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dga3mzi", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SangersSequence", "parent_id": "t1_dg9y2d5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "That's what it takes to make one horcrux. Slughorn couldn't even comprehend the idea of making more than one. I think the theory holds water that it would take something even more extreme to make a second, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what it takes to make one horcrux. Slughorn couldn&amp;#39;t even comprehend the idea of making more than one. I think the theory holds water that it would take something even more extreme to make a second, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dga3mzi", "score_hidden": false, "stickied": false, "created": 1492249391.0, "created_utc": 1492220591.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbl53", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dgba900", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; There's no question that what happened with Dumbledore wasn't murder. \n\nThis might seem pedantic, but what Snape did would actually be classified as [\"consensual homicide\"](https://en.wikipedia.org/wiki/Consensual_homicide), or \"consensual murder\". Assisted suicide also falls under this classification. \n\nConsensual homicide also remains controversial because of the legal, ethical and practical issues it raises, even within the medical field. Opposition to assisted suicide [legalization] has also come from a wide range of organizations, including the California Medical Association, disability rights organizations, faith-based organizations, and Latino and civil rights groups. Most of these groups view it as \"murder\".\n\nIn this case, to some, they wouldn't see Snape's actions as murder, while others would. I think, however, that Snape's actions could definitely be seen as \"murder\", and could've served to tear his (already probably-not-as-impeccable-as-people-seem-to-think) soul. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There&amp;#39;s no question that what happened with Dumbledore wasn&amp;#39;t murder. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This might seem pedantic, but what Snape did would actually be classified as &lt;a href=\"https://en.wikipedia.org/wiki/Consensual_homicide\"&gt;&amp;quot;consensual homicide&amp;quot;&lt;/a&gt;, or &amp;quot;consensual murder&amp;quot;. Assisted suicide also falls under this classification. &lt;/p&gt;\n\n&lt;p&gt;Consensual homicide also remains controversial because of the legal, ethical and practical issues it raises, even within the medical field. Opposition to assisted suicide [legalization] has also come from a wide range of organizations, including the California Medical Association, disability rights organizations, faith-based organizations, and Latino and civil rights groups. Most of these groups view it as &amp;quot;murder&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;In this case, to some, they wouldn&amp;#39;t see Snape&amp;#39;s actions as murder, while others would. I think, however, that Snape&amp;#39;s actions could definitely be seen as &amp;quot;murder&amp;quot;, and could&amp;#39;ve served to tear his (already probably-not-as-impeccable-as-people-seem-to-think) soul. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbbl53", "score_hidden": false, "stickied": false, "created": 1492326629.0, "created_utc": 1492297829.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgba900", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "honestysrevival", "parent_id": "t1_dgba4l9", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The difference being, he never murdered Dumbledore. It's specifically murder that does it, so yes, the perception of the crime matters - to the people involved. There's no question that what happened with Dumbledore wasn't murder. It's not that the person themselves has to think it's evil, necessarily. \n\nIs it a possibility? Yes, but it's by no means guaranteed. The criteria for murder are far too vague. Does it matter if the other person wanted to be killed? What if someone committed suicide by provoking a defensive spell? What if a child wizard accidentally kills someone with a wand when their power was out of control? Would that count as a murder, an accident?", "edited": 1492297147.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The difference being, he never murdered Dumbledore. It&amp;#39;s specifically murder that does it, so yes, the perception of the crime matters - to the people involved. There&amp;#39;s no question that what happened with Dumbledore wasn&amp;#39;t murder. It&amp;#39;s not that the person themselves has to think it&amp;#39;s evil, necessarily. &lt;/p&gt;\n\n&lt;p&gt;Is it a possibility? Yes, but it&amp;#39;s by no means guaranteed. The criteria for murder are far too vague. Does it matter if the other person wanted to be killed? What if someone committed suicide by provoking a defensive spell? What if a child wizard accidentally kills someone with a wand when their power was out of control? Would that count as a murder, an accident?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgba900", "score_hidden": false, "stickied": false, "created": 1492324664.0, "created_utc": 1492295864.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgba4l9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "explain_that_shit", "parent_id": "t1_dgacspe", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Right, exactly what I'm saying. The implication is that it is not the taking of a life which damages a soul but the intention to do so maliciously rather than mercifully. \n\nHello fantastic lesson about euthanasia and the lack of complex consideration of what it means, morally and spiritually, to take a life by those who consider it murder.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right, exactly what I&amp;#39;m saying. The implication is that it is not the taking of a life which damages a soul but the intention to do so maliciously rather than mercifully. &lt;/p&gt;\n\n&lt;p&gt;Hello fantastic lesson about euthanasia and the lack of complex consideration of what it means, morally and spiritually, to take a life by those who consider it murder.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgba4l9", "score_hidden": false, "stickied": false, "created": 1492324477.0, "created_utc": 1492295677.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgacspe", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "honestysrevival", "parent_id": "t1_dga6szp", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "That wasn't a murder. It was arranged beforehand between the two of them, as you see in Snape's memories in Deathly Hallows. He was only granting Dumbledore a peaceful death, instead of allowing him to suffer either at the hands of his curse, the Death Eaters, or Voldemort himself.\n\nIt wasn't murder in any sense of the word. It wouldn't have split his soul.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That wasn&amp;#39;t a murder. It was arranged beforehand between the two of them, as you see in Snape&amp;#39;s memories in Deathly Hallows. He was only granting Dumbledore a peaceful death, instead of allowing him to suffer either at the hands of his curse, the Death Eaters, or Voldemort himself.&lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t murder in any sense of the word. It wouldn&amp;#39;t have split his soul.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgacspe", "score_hidden": false, "stickied": false, "created": 1492264368.0, "created_utc": 1492235568.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6szp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "explain_that_shit", "parent_id": "t1_dg9y2d5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Except the idea that the murderer must feel as though they are taking something away is supported in HBP when Snape kills Dumbledore, and in DH when Snape asks dumbledore about what will happen to his soul if he kills Dumbledore to which Dumbledore answers something along the lines \"decide for yourself whether giving an old dying man some peace is merciful or evil\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Except the idea that the murderer must feel as though they are taking something away is supported in HBP when Snape kills Dumbledore, and in DH when Snape asks dumbledore about what will happen to his soul if he kills Dumbledore to which Dumbledore answers something along the lines &amp;quot;decide for yourself whether giving an old dying man some peace is merciful or evil&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dga6szp", "score_hidden": false, "stickied": false, "created": 1492253915.0, "created_utc": 1492225115.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9yxwo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Xattm15", "parent_id": "t1_dg9y2d5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Really? Maybe I'll have to reread Half-blood prince", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really? Maybe I&amp;#39;ll have to reread Half-blood prince&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9yxwo", "score_hidden": false, "stickied": false, "created": 1492243040.0, "created_utc": 1492214240.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9y2d5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "honestysrevival", "parent_id": "t1_dg9xn9h", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "No, it just says that murder is the act of ultimate evil and that simply committing the act fragments your soul. I believe it's in the Slughorn memory.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, it just says that murder is the act of ultimate evil and that simply committing the act fragments your soul. I believe it&amp;#39;s in the Slughorn memory.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9y2d5", "score_hidden": false, "stickied": false, "created": 1492241870.0, "created_utc": 1492213070.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgay1g8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Xattm15", "parent_id": "t1_dgawl8i", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Oh no doubt.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh no doubt.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgay1g8", "score_hidden": false, "stickied": false, "created": 1492307913.0, "created_utc": 1492279113.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgbb7kr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dgawl8i", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Eh, Grindelwald, I think, is inferred to be more \"wizard Hitler\" than Voldemort is / was. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh, Grindelwald, I think, is inferred to be more &amp;quot;wizard Hitler&amp;quot; than Voldemort is / was. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbb7kr", "score_hidden": false, "stickied": false, "created": 1492326079.0, "created_utc": 1492297279.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawl8i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rigatony96", "parent_id": "t1_dgavspx", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I mean I'm sure some of his bad shot was for horcruxes but he was also wizard hitler \nEdit: like him murdering his father was the act that shattered his soul, patricide ain't no joke ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean I&amp;#39;m sure some of his bad shot was for horcruxes but he was also wizard hitler \nEdit: like him murdering his father was the act that shattered his soul, patricide ain&amp;#39;t no joke &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgawl8i", "score_hidden": false, "stickied": false, "created": 1492305939.0, "created_utc": 1492277139.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgavspx", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Xattm15", "parent_id": "t1_dgavj3v", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Exactly. This explains why he committed so many horrible acts... It wasn't mindless slaughter... It was all so he could produce Horcruxes...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly. This explains why he committed so many horrible acts... It wasn&amp;#39;t mindless slaughter... It was all so he could produce Horcruxes...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgavspx", "score_hidden": false, "stickied": false, "created": 1492304871.0, "created_utc": 1492276071.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgavj3v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rigatony96", "parent_id": "t1_dg9xn9h", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Like murdering your own father 🤔", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like murdering your own father 🤔&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgavj3v", "score_hidden": false, "stickied": false, "created": 1492304500.0, "created_utc": 1492275700.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xn9h", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Xattm15", "parent_id": "t1_dg9xiq8", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I'm pretty certain it says that it has to be bad enough of an act to shatter your soul. The only way to do that is to do something that unspeakable, something you would never do... something soul-breaking so to speak... Or at least that's my belief", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty certain it says that it has to be bad enough of an act to shatter your soul. The only way to do that is to do something that unspeakable, something you would never do... something soul-breaking so to speak... Or at least that&amp;#39;s my belief&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9xn9h", "score_hidden": false, "stickied": false, "created": 1492241327.0, "created_utc": 1492212527.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xiq8", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "honestysrevival", "parent_id": "t1_dg9ohid", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "It wasn't required that he find it bad.\nMurder was just acknowledged as an inherently evil act.", "edited": 1492215359.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It wasn&amp;#39;t required that he find it bad.\nMurder was just acknowledged as an inherently evil act.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9xiq8", "score_hidden": false, "stickied": false, "created": 1492241163.0, "created_utc": 1492212363.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ohid", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Xattm15", "parent_id": "t1_dg92cee", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "He already needed to fragment his soul by doing something so terrible that even he thought it was bad", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He already needed to fragment his soul by doing something so terrible that even he thought it was bad&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9ohid", "score_hidden": false, "stickied": false, "created": 1492229561.0, "created_utc": 1492200761.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgczrlf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ninjacobra5", "parent_id": "t1_dgbultt", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I wasn't suggesting horcruxes are created just by murder alone. Even without the small details that we get from Slughorn, it's clear that the creation of a horcrux is the darkest form of magic discussed in the books. Riddle isn't able to find anything about them even in the restricted section of the Hogwarts library which we have seen stores some fairly dark shit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wasn&amp;#39;t suggesting horcruxes are created just by murder alone. Even without the small details that we get from Slughorn, it&amp;#39;s clear that the creation of a horcrux is the darkest form of magic discussed in the books. Riddle isn&amp;#39;t able to find anything about them even in the restricted section of the Hogwarts library which we have seen stores some fairly dark shit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgczrlf", "score_hidden": false, "stickied": false, "created": 1492425839.0, "created_utc": 1492397039.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbultt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pufflehuffy", "parent_id": "t1_dg92cee", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "It's clearly more than murder or there would be a lot of accidental horcruxes out there. There's a process, probably a few complicated spells, and maybe what OP is suggesting. This theory is dark enough, I'd say, to support the reference to Rowling's telling and shocking/disgusting her editor. It's also supported by the increasingly inhuman appearance Voldemort has, which seems to be linked to his evilness and his loss of humanity through progressively making more horcruxes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s clearly more than murder or there would be a lot of accidental horcruxes out there. There&amp;#39;s a process, probably a few complicated spells, and maybe what OP is suggesting. This theory is dark enough, I&amp;#39;d say, to support the reference to Rowling&amp;#39;s telling and shocking/disgusting her editor. It&amp;#39;s also supported by the increasingly inhuman appearance Voldemort has, which seems to be linked to his evilness and his loss of humanity through progressively making more horcruxes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbultt", "score_hidden": false, "stickied": false, "created": 1492359944.0, "created_utc": 1492331144.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92cee", "gilded": 0, "archived": false, "score": 99, "report_reasons": null, "author": "Ninjacobra5", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Interesting. That would certainly make the process darker, which I always thought it should be. If I remember correctly, in the books the only thing we know about the creation of Horcruxs is that creating one requires you to murder someone. I always thought that was a little weak, like don't dark wizards murder people all the time? Why is that even such a big deal? I always thought it would have been had more impact if you had to murder an entirely innocent person. That makes it harder in that first how do you even know if someone is really innocent, so it would almost certainly have to be a child and the murder of a child is one of the most vile things I can think of. That's always been my head cannon, but there isn't really any proof of that.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting. That would certainly make the process darker, which I always thought it should be. If I remember correctly, in the books the only thing we know about the creation of Horcruxs is that creating one requires you to murder someone. I always thought that was a little weak, like don&amp;#39;t dark wizards murder people all the time? Why is that even such a big deal? I always thought it would have been had more impact if you had to murder an entirely innocent person. That makes it harder in that first how do you even know if someone is really innocent, so it would almost certainly have to be a child and the murder of a child is one of the most vile things I can think of. That&amp;#39;s always been my head cannon, but there isn&amp;#39;t really any proof of that.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg92cee", "score_hidden": false, "stickied": false, "created": 1492201493.0, "created_utc": 1492172693.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 99}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgcubv1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-Mountain-King-", "parent_id": "t1_dgctkwi", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "He could have lose his nose either against Harry or with a horcrux between that interview and Harry - I see no reason to believe one over the other.\n\nThe nightmares quote is from Goblet of Fire and is a reference to nightmares about Voldemort's appearance on Quirrell's head. He wasn't plagued by nightmares of Voldemort before that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He could have lose his nose either against Harry or with a horcrux between that interview and Harry - I see no reason to believe one over the other.&lt;/p&gt;\n\n&lt;p&gt;The nightmares quote is from Goblet of Fire and is a reference to nightmares about Voldemort&amp;#39;s appearance on Quirrell&amp;#39;s head. He wasn&amp;#39;t plagued by nightmares of Voldemort before that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcubv1", "score_hidden": false, "stickied": false, "created": 1492418494.0, "created_utc": 1492389694.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctkwi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dgbi8wu", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "If you're talking about Voldemort's nose, it's mainly because Harry did not note lack of a nose in Dumbledore's DADA memory of an older Riddle. I think I mentioned the passage further up in the thread, but I feel that Riddle lacking a nose at that point would certainly have *not* gone unnoticed by Harry. It is a very important feature of Voldemort's that is usually mentioned whenever he makes a physical appearance in the books, and the \"nose\" bit was lacking in that particular scene.\n\nLikewise, in the case of the \"nightmares\" quote from *Philosopher's Stone*, we have to recall that Harry also shared a telepathic link to Voldemort, created when the \"Horcrux\" in Harry was placed. The \"Horcrux\" was placed when Voldemort lost his original body from attempting to kill Harry. The mental link was formed at that point, after the original body had been obliterated, including Voldy's nose. The \"thing\" in Voldemort (the mangled, incomplete soul) was released from its mortal coil, taking on the \"noseless\" (skeletal?) appearance we first see in *Philosopher's Stone*.\n\nThis is mainly why I think that Voldemort lost his nose when he lost his body. Harry was \"plagued\" with nightmares of a noseless Voldemort due to his mental link to the \"Horcrux\" in him, formed at that point in time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re talking about Voldemort&amp;#39;s nose, it&amp;#39;s mainly because Harry did not note lack of a nose in Dumbledore&amp;#39;s DADA memory of an older Riddle. I think I mentioned the passage further up in the thread, but I feel that Riddle lacking a nose at that point would certainly have &lt;em&gt;not&lt;/em&gt; gone unnoticed by Harry. It is a very important feature of Voldemort&amp;#39;s that is usually mentioned whenever he makes a physical appearance in the books, and the &amp;quot;nose&amp;quot; bit was lacking in that particular scene.&lt;/p&gt;\n\n&lt;p&gt;Likewise, in the case of the &amp;quot;nightmares&amp;quot; quote from &lt;em&gt;Philosopher&amp;#39;s Stone&lt;/em&gt;, we have to recall that Harry also shared a telepathic link to Voldemort, created when the &amp;quot;Horcrux&amp;quot; in Harry was placed. The &amp;quot;Horcrux&amp;quot; was placed when Voldemort lost his original body from attempting to kill Harry. The mental link was formed at that point, after the original body had been obliterated, including Voldy&amp;#39;s nose. The &amp;quot;thing&amp;quot; in Voldemort (the mangled, incomplete soul) was released from its mortal coil, taking on the &amp;quot;noseless&amp;quot; (skeletal?) appearance we first see in &lt;em&gt;Philosopher&amp;#39;s Stone&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;This is mainly why I think that Voldemort lost his nose when he lost his body. Harry was &amp;quot;plagued&amp;quot; with nightmares of a noseless Voldemort due to his mental link to the &amp;quot;Horcrux&amp;quot; in him, formed at that point in time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgctkwi", "score_hidden": false, "stickied": false, "created": 1492417474.0, "created_utc": 1492388674.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbi8wu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-Mountain-King-", "parent_id": "t1_dgbbphy", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Why do you think that the most likely point for him to have lost it was with Harry? I don't see any reason to think he lost it there instead of elsewhere.\n\nFrom your quite well-put together theory, I can think of things that Voldemort likely sacrificed to make his horcruxes. His skin, voice, and eyes, as you mentioned - his hair is also a possibility, and his nose seems likely as well. That's five, matching to how many horcruxes he had made before attacking Harry. Another part must have been sacrificed for Nagini, but it can't have been his skin, voice, eyes, or nose, since he had definitely lost those before book one.\n\nI suggest that Voldemort created the diary with one or more memories (explaining why the diary describes itself as a memory and has access to at least one of Voldemkrt's, the ring with blood, the locket with his eyes, and the diadem and cup with his skin and nose respectively (since as I recall he had both a nose and hair in his interview with Dumbledore. He would have made the cup after depositing the diadem). That leaves him with hair when he goes for Harry, accidentally deposits a piece of his soul (but not intentionally and thus not as a true horcrux). Creating Harry takes his bones, I would guess, and then he drops his hair to create nagini.\n\nWhy do I think he lost his bones to Harry? Because the ritual which resurrects him takes blood, flesh, and bone to recreate him. It could also have taken his flesh, but it seems that his flesh is divided more granularly than that for the purposes of dark rituals, since he was able to give up eyes, nose, and other such stuff piecemeal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why do you think that the most likely point for him to have lost it was with Harry? I don&amp;#39;t see any reason to think he lost it there instead of elsewhere.&lt;/p&gt;\n\n&lt;p&gt;From your quite well-put together theory, I can think of things that Voldemort likely sacrificed to make his horcruxes. His skin, voice, and eyes, as you mentioned - his hair is also a possibility, and his nose seems likely as well. That&amp;#39;s five, matching to how many horcruxes he had made before attacking Harry. Another part must have been sacrificed for Nagini, but it can&amp;#39;t have been his skin, voice, eyes, or nose, since he had definitely lost those before book one.&lt;/p&gt;\n\n&lt;p&gt;I suggest that Voldemort created the diary with one or more memories (explaining why the diary describes itself as a memory and has access to at least one of Voldemkrt&amp;#39;s, the ring with blood, the locket with his eyes, and the diadem and cup with his skin and nose respectively (since as I recall he had both a nose and hair in his interview with Dumbledore. He would have made the cup after depositing the diadem). That leaves him with hair when he goes for Harry, accidentally deposits a piece of his soul (but not intentionally and thus not as a true horcrux). Creating Harry takes his bones, I would guess, and then he drops his hair to create nagini.&lt;/p&gt;\n\n&lt;p&gt;Why do I think he lost his bones to Harry? Because the ritual which resurrects him takes blood, flesh, and bone to recreate him. It could also have taken his flesh, but it seems that his flesh is divided more granularly than that for the purposes of dark rituals, since he was able to give up eyes, nose, and other such stuff piecemeal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbi8wu", "score_hidden": false, "stickied": false, "created": 1492336118.0, "created_utc": 1492307318.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbphy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg97t8s", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; These descriptions are essentially identical, so his loss of a nose occurred at some time before the series begins.\n\nWhile this is true, this doesn't mean that Voldemort was necessarily always without a nose. Based on those passages, it seems that the loss of said nose was, as I originally speculated, most likely when Voldemort lost his body from his rebounded Killing Curse, the Halloween night when he tried to kill Harry as a toddler. For me, it seems the body crafted in the resurrection ritual in *Goblet of Fire* reflected the physical manifestation of the \"ugliness\" within Tom Riddle's marred soul, as seen in *Philosopher's Stone*. The latter would've been released from Riddle's first body when it was destroyed, as his resulting form was previously noted (by Voldemort himself, post-Halloween) as being \"a shadow\" or \"shadow-like\".\n\n--------------------\n\nPinging /u/Ninjacobra5 to avoid reposting.", "edited": 1492298434.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;These descriptions are essentially identical, so his loss of a nose occurred at some time before the series begins.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;While this is true, this doesn&amp;#39;t mean that Voldemort was necessarily always without a nose. Based on those passages, it seems that the loss of said nose was, as I originally speculated, most likely when Voldemort lost his body from his rebounded Killing Curse, the Halloween night when he tried to kill Harry as a toddler. For me, it seems the body crafted in the resurrection ritual in &lt;em&gt;Goblet of Fire&lt;/em&gt; reflected the physical manifestation of the &amp;quot;ugliness&amp;quot; within Tom Riddle&amp;#39;s marred soul, as seen in &lt;em&gt;Philosopher&amp;#39;s Stone&lt;/em&gt;. The latter would&amp;#39;ve been released from Riddle&amp;#39;s first body when it was destroyed, as his resulting form was previously noted (by Voldemort himself, post-Halloween) as being &amp;quot;a shadow&amp;quot; or &amp;quot;shadow-like&amp;quot;.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Pinging &lt;a href=\"/u/Ninjacobra5\"&gt;/u/Ninjacobra5&lt;/a&gt; to avoid reposting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbbphy", "score_hidden": false, "stickied": false, "created": 1492326803.0, "created_utc": 1492298003.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97t8s", "gilded": 0, "archived": false, "score": 66, "report_reasons": null, "author": "-Mountain-King-", "parent_id": "t1_dg8w32h", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "When resurrected in *Goblet of Fire*, his face is described as \"Whiter than a skull, with wide, livid scarlet eyes and a nose that was flat as a snakes with slits for nostrils . . . \" but also as \"the face that had haunted his nightmares for three years\" (since the end of *Philosopher's Stone* three years prior). And in Philosopher's Stone, Voldemort's face on the back of Quirrell's head is described as \"a face, the most terrible face Harry had ever seen. It was chalk white with glaring red eyes and slits for nostrils, like a snake\". These descriptions are essentially identical, so his loss of a nose occurred at some time before the series begins.\n\nI think the reason many people forget that he never had a nose is because [he was shown with a nose in *Sorcerer's Stone*,](http://aroundmovies.com/wp-content/uploads/2014/11/LordVoldemort_IanHart_2001_007.jpg) as the effect was apparently done by someone who either didn't know or didn't care about the actual description of Voldemort in the book.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When resurrected in &lt;em&gt;Goblet of Fire&lt;/em&gt;, his face is described as &amp;quot;Whiter than a skull, with wide, livid scarlet eyes and a nose that was flat as a snakes with slits for nostrils . . . &amp;quot; but also as &amp;quot;the face that had haunted his nightmares for three years&amp;quot; (since the end of &lt;em&gt;Philosopher&amp;#39;s Stone&lt;/em&gt; three years prior). And in Philosopher&amp;#39;s Stone, Voldemort&amp;#39;s face on the back of Quirrell&amp;#39;s head is described as &amp;quot;a face, the most terrible face Harry had ever seen. It was chalk white with glaring red eyes and slits for nostrils, like a snake&amp;quot;. These descriptions are essentially identical, so his loss of a nose occurred at some time before the series begins.&lt;/p&gt;\n\n&lt;p&gt;I think the reason many people forget that he never had a nose is because &lt;a href=\"http://aroundmovies.com/wp-content/uploads/2014/11/LordVoldemort_IanHart_2001_007.jpg\"&gt;he was shown with a nose in &lt;em&gt;Sorcerer&amp;#39;s Stone&lt;/em&gt;,&lt;/a&gt; as the effect was apparently done by someone who either didn&amp;#39;t know or didn&amp;#39;t care about the actual description of Voldemort in the book.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg97t8s", "score_hidden": false, "stickied": false, "created": 1492209956.0, "created_utc": 1492181156.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 66}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg99f57", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "tf2hipster", "parent_id": "t1_dg8w32h", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "In Dumbledore's memory of Voldemort revisiting the school to ask about the Defense Against the Dark Arts job, it's mentioned that Voldemort's appearance had already started to change significantly:\n\n&gt; It was as though his features had been burned and blurred; they were waxy and oddly distorted, and the whites of the eyes now had a permanently bloody look\n\nAnd Voldemort's appearance on the back of Quirrell's head already had the appearance of a snake\n\n&gt; Harry would have screamed, but he couldn’t make a sound. Where there should have been a back to Quirrell’s head, there was a face, the most terrible face Harry had ever seen. It was chalk white with glaring red eyes and slits for nostrils, like a snake\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In Dumbledore&amp;#39;s memory of Voldemort revisiting the school to ask about the Defense Against the Dark Arts job, it&amp;#39;s mentioned that Voldemort&amp;#39;s appearance had already started to change significantly:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It was as though his features had been burned and blurred; they were waxy and oddly distorted, and the whites of the eyes now had a permanently bloody look&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And Voldemort&amp;#39;s appearance on the back of Quirrell&amp;#39;s head already had the appearance of a snake&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Harry would have screamed, but he couldn’t make a sound. Where there should have been a back to Quirrell’s head, there was a face, the most terrible face Harry had ever seen. It was chalk white with glaring red eyes and slits for nostrils, like a snake&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg99f57", "score_hidden": false, "stickied": false, "created": 1492211956.0, "created_utc": 1492183156.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgamray", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "joej13527", "parent_id": "t1_dg93r3s", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yea this is true. We never see voldemorts face again until the cemetery in goblet of fire so I guess we couldn't know if it disappeared when harry was a baby or when he was resurrected. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea this is true. We never see voldemorts face again until the cemetery in goblet of fire so I guess we couldn&amp;#39;t know if it disappeared when harry was a baby or when he was resurrected. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgamray", "score_hidden": false, "stickied": false, "created": 1492291130.0, "created_utc": 1492262330.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93r3s", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Pidgey_OP", "parent_id": "t1_dg93dm3", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I thought the Harry horcrux was created when Harry was a baby and then just strengthened as a connection in Goblet of Fire", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought the Harry horcrux was created when Harry was a baby and then just strengthened as a connection in Goblet of Fire&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg93r3s", "score_hidden": false, "stickied": false, "created": 1492204116.0, "created_utc": 1492175316.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9atsw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "imBobertRobert", "parent_id": "t1_dg93dm3", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "That's what he gets for *nose*ing around in the Potter house. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what he gets for &lt;em&gt;nose&lt;/em&gt;ing around in the Potter house. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9atsw", "score_hidden": false, "stickied": false, "created": 1492213615.0, "created_utc": 1492184815.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9scct", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Asiriya", "parent_id": "t1_dg93dm3", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Lost his whole body that night.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lost his whole body that night.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9scct", "score_hidden": false, "stickied": false, "created": 1492234310.0, "created_utc": 1492205510.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93dm3", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "joej13527", "parent_id": "t1_dg8w32h", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "If this is the case then he could have very well \"lost\" it when he accidentally created the hot crux in harry. \n\nI like this theory a lot. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If this is the case then he could have very well &amp;quot;lost&amp;quot; it when he accidentally created the hot crux in harry. &lt;/p&gt;\n\n&lt;p&gt;I like this theory a lot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg93dm3", "score_hidden": false, "stickied": false, "created": 1492203453.0, "created_utc": 1492174653.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9o29q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg9nz0g", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think that's the most likely case, yes. Voldemort was having Pettigrew \"milk\" Nagini for her venom in *Goblet of Fire* in order to keep his grotesque, baby-like form alive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s the most likely case, yes. Voldemort was having Pettigrew &amp;quot;milk&amp;quot; Nagini for her venom in &lt;em&gt;Goblet of Fire&lt;/em&gt; in order to keep his grotesque, baby-like form alive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9o29q", "score_hidden": false, "stickied": false, "created": 1492229049.0, "created_utc": 1492200249.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9nz0g", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Daforce1", "parent_id": "t1_dg8w32h", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Wasn't Nagini's venom or blood also used to keep him alive and in the resurrection potion. If so maybe her snake essence had some effect on him having a snake like nose.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wasn&amp;#39;t Nagini&amp;#39;s venom or blood also used to keep him alive and in the resurrection potion. If so maybe her snake essence had some effect on him having a snake like nose.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9nz0g", "score_hidden": false, "stickied": false, "created": 1492228939.0, "created_utc": 1492200139.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dga38w4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bassinastor", "parent_id": "t1_dga22g5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Lol, I feel ya. I just thought it was funny. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol, I feel ya. I just thought it was funny. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dga38w4", "score_hidden": false, "stickied": false, "created": 1492248854.0, "created_utc": 1492220054.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga22g5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "dangshnizzle", "parent_id": "t1_dg99hfp", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I wrote that drunk lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wrote that drunk lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dga22g5", "score_hidden": false, "stickied": false, "created": 1492247214.0, "created_utc": 1492218414.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99hfp", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "bassinastor", "parent_id": "t1_dg97ma0", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "\"The more reptilian he got, the more reptilian he got\"\n\nA+ explanation", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;The more reptilian he got, the more reptilian he got&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;A+ explanation&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg99hfp", "score_hidden": false, "stickied": false, "created": 1492212033.0, "created_utc": 1492183233.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 33}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97ma0", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "dangshnizzle", "parent_id": "t1_dg8w32h", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The more reptilian he got, the more he resembled one. Eyes, nose, lips, scalp. Everything", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The more reptilian he got, the more he resembled one. Eyes, nose, lips, scalp. Everything&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg97ma0", "score_hidden": false, "stickied": false, "created": 1492209710.0, "created_utc": 1492180910.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8w32h", "gilded": 0, "archived": false, "score": 73, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg8vxm7", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think Voldemort only lost his nose after he was resurrected in *Goblet of Fire*. Harry doesn't really note him lacking one when he sees an older Riddle in Dumbledore's memory. \n\nThank you so much!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think Voldemort only lost his nose after he was resurrected in &lt;em&gt;Goblet of Fire&lt;/em&gt;. Harry doesn&amp;#39;t really note him lacking one when he sees an older Riddle in Dumbledore&amp;#39;s memory. &lt;/p&gt;\n\n&lt;p&gt;Thank you so much!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg8w32h", "score_hidden": false, "stickied": false, "created": 1492183291.0, "created_utc": 1492154491.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 73}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg97v2o", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "-Mountain-King-", "parent_id": "t1_dg8vxm7", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "When resurrected in *Goblet of Fire*, his face is described as \"Whiter than a skull, with wide, livid scarlet eyes and a nose that was flat as a snakes with slits for nostrils . . . \" but also as \"the face that had haunted his nightmares for three years\" (since the end of *Philosopher's Stone* three years prior). And in Philosopher's Stone, Voldemort's face on the back of Quirrell's head is described as \"a face, the most terrible face Harry had ever seen. It was chalk white with glaring red eyes and slits for nostrils, like a snake\". He never had a nose, in either the books or movies (although in *Sorcerer's Stone* he is actually shown with a nose, that effect is incorrect to what is described in the books).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When resurrected in &lt;em&gt;Goblet of Fire&lt;/em&gt;, his face is described as &amp;quot;Whiter than a skull, with wide, livid scarlet eyes and a nose that was flat as a snakes with slits for nostrils . . . &amp;quot; but also as &amp;quot;the face that had haunted his nightmares for three years&amp;quot; (since the end of &lt;em&gt;Philosopher&amp;#39;s Stone&lt;/em&gt; three years prior). And in Philosopher&amp;#39;s Stone, Voldemort&amp;#39;s face on the back of Quirrell&amp;#39;s head is described as &amp;quot;a face, the most terrible face Harry had ever seen. It was chalk white with glaring red eyes and slits for nostrils, like a snake&amp;quot;. He never had a nose, in either the books or movies (although in &lt;em&gt;Sorcerer&amp;#39;s Stone&lt;/em&gt; he is actually shown with a nose, that effect is incorrect to what is described in the books).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg97v2o", "score_hidden": false, "stickied": false, "created": 1492210022.0, "created_utc": 1492181222.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8vxm7", "gilded": 0, "archived": false, "score": 131, "report_reasons": null, "author": "Zorak6", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Ctrl+F...  n.o.s.e.  ..No results!?  I'd think him not having a nose would be a major point.  Of course, that IS just the movies so I guess it doesn't count, but still..\n\nIn fairness though, I did read some of this and it's pretty interesting.  +1", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ctrl+F...  n.o.s.e.  ..No results!?  I&amp;#39;d think him not having a nose would be a major point.  Of course, that IS just the movies so I guess it doesn&amp;#39;t count, but still..&lt;/p&gt;\n\n&lt;p&gt;In fairness though, I did read some of this and it&amp;#39;s pretty interesting.  +1&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg8vxm7", "score_hidden": false, "stickied": false, "created": 1492182884.0, "created_utc": 1492154084.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 131}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9qqy2", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "standish_", "parent_id": "t1_dg9k2uv", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "If his entire body was magically created and held together it could explain why he really was afraid of Dumbledore. \n\nDumbledore, as one of the most powerful and knowledgeable wizards of the age, figured out Voldemort's body was magical and sought after spells that could destroy it outright. If there was anyone to find such a spell it would be Dumbledore and Voldemort wouldn't know until it was used on him. I'd run from every battle too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If his entire body was magically created and held together it could explain why he really was afraid of Dumbledore. &lt;/p&gt;\n\n&lt;p&gt;Dumbledore, as one of the most powerful and knowledgeable wizards of the age, figured out Voldemort&amp;#39;s body was magical and sought after spells that could destroy it outright. If there was anyone to find such a spell it would be Dumbledore and Voldemort wouldn&amp;#39;t know until it was used on him. I&amp;#39;d run from every battle too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9qqy2", "score_hidden": false, "stickied": false, "created": 1492232296.0, "created_utc": 1492203496.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9ru4a", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "jomangojo", "parent_id": "t1_dg9r64w", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Also read a different comment mentioning his \"cold, high voice\" suggesting that in giving himself the chop at 15 his voice remained unbroken. I like this more than blood tbh:)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also read a different comment mentioning his &amp;quot;cold, high voice&amp;quot; suggesting that in giving himself the chop at 15 his voice remained unbroken. I like this more than blood tbh:)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9ru4a", "score_hidden": false, "stickied": false, "created": 1492233664.0, "created_utc": 1492204864.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9r64w", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "hallways", "parent_id": "t1_dg9qre3", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Ah see I don't think even teenage Tom Riddle would have considered his genitals to be very important, while all his classmates were thinking about sex and girls etc he was already planning murder and immortality. \n\n\nBlood does make sense too though, as somebody else mentioned blood is a pretty classic magical sacrifice so it makes sense that that's the one you start with (and work your way up to eyes/noses).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah see I don&amp;#39;t think even teenage Tom Riddle would have considered his genitals to be very important, while all his classmates were thinking about sex and girls etc he was already planning murder and immortality. &lt;/p&gt;\n\n&lt;p&gt;Blood does make sense too though, as somebody else mentioned blood is a pretty classic magical sacrifice so it makes sense that that&amp;#39;s the one you start with (and work your way up to eyes/noses).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9r64w", "score_hidden": false, "stickied": false, "created": 1492232825.0, "created_utc": 1492204025.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9qre3", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "jomangojo", "parent_id": "t1_dg9k2uv", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think perhaps the cup could be genitals after his charming Hephzibah? Maybe then blood for his diary - if he made it during school i doubt he'd be chopping off anything important...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think perhaps the cup could be genitals after his charming Hephzibah? Maybe then blood for his diary - if he made it during school i doubt he&amp;#39;d be chopping off anything important...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9qre3", "score_hidden": false, "stickied": false, "created": 1492232312.0, "created_utc": 1492203512.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgafank", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hallways", "parent_id": "t1_dga4jaa", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Ooh hands is a good one, maybe hands were for the ring?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ooh hands is a good one, maybe hands were for the ring?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgafank", "score_hidden": false, "stickied": false, "created": 1492270338.0, "created_utc": 1492241538.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga4jaa", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Guernica27", "parent_id": "t1_dg9k2uv", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I've always wondered if his hands were something he used for a horcrux. Several times his fingers are described as being long and \"spidery\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always wondered if his hands were something he used for a horcrux. Several times his fingers are described as being long and &amp;quot;spidery&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dga4jaa", "score_hidden": false, "stickied": false, "created": 1492250635.0, "created_utc": 1492221835.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9k2uv", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "hallways", "parent_id": "t1_dg9hmnn", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Maybe he sacrificed some of his skin to make Gaunt's ring into a Horcrux, could be why Dumbledore loses the skin from his hand/arm when he puts it on. And he could have given up his nose when he made Nagini, as that seems to have occurred later on in his life. \n\nEdit: had a think, here's what I got for each one \n\nDiary - genitals (someone mentioned self castration in another comment)\n\nRing - skin\n\nLocket - eyes \n\nCup - hair? (Can't remember the scene exactly but I belive he charms Hepzibah with his good looks, could be that he sacrifices his looks/hair and doesn't need it again after getting the cup from her) \n\nDiadem - voice\n\nNagini - nose \n\nHarry Potter - whole body? (kind of explains why there wasn't a body to find in Godric's Hollow, it got consumed by the Horcrux spell/process)  ", "edited": 1492196258.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe he sacrificed some of his skin to make Gaunt&amp;#39;s ring into a Horcrux, could be why Dumbledore loses the skin from his hand/arm when he puts it on. And he could have given up his nose when he made Nagini, as that seems to have occurred later on in his life. &lt;/p&gt;\n\n&lt;p&gt;Edit: had a think, here&amp;#39;s what I got for each one &lt;/p&gt;\n\n&lt;p&gt;Diary - genitals (someone mentioned self castration in another comment)&lt;/p&gt;\n\n&lt;p&gt;Ring - skin&lt;/p&gt;\n\n&lt;p&gt;Locket - eyes &lt;/p&gt;\n\n&lt;p&gt;Cup - hair? (Can&amp;#39;t remember the scene exactly but I belive he charms Hepzibah with his good looks, could be that he sacrifices his looks/hair and doesn&amp;#39;t need it again after getting the cup from her) &lt;/p&gt;\n\n&lt;p&gt;Diadem - voice&lt;/p&gt;\n\n&lt;p&gt;Nagini - nose &lt;/p&gt;\n\n&lt;p&gt;Harry Potter - whole body? (kind of explains why there wasn&amp;#39;t a body to find in Godric&amp;#39;s Hollow, it got consumed by the Horcrux spell/process)  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9k2uv", "score_hidden": false, "stickied": false, "created": 1492224252.0, "created_utc": 1492195452.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9hmnn", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "standish_", "parent_id": "t1_dg97lv5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I wonder if there's a clear trait for every horocrux.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder if there&amp;#39;s a clear trait for every horocrux.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9hmnn", "score_hidden": false, "stickied": false, "created": 1492221339.0, "created_utc": 1492192539.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97lv5", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "Guernica27", "parent_id": "t1_dg93i0e", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yep, this has always been my theory as well. Also the diadem screams after it breaks apart, which always made me think that was the one for his voice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, this has always been my theory as well. Also the diadem screams after it breaks apart, which always made me think that was the one for his voice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg97lv5", "score_hidden": false, "stickied": false, "created": 1492209695.0, "created_utc": 1492180895.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 34}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93i0e", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "ButtRain", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I've always had the same theory. It's clear that at least for Slytherin's locket, Voldemort mutilated his eyes to make the horcrux. Needing to give up part of yourself to make a horcrux explains Voldemort's appearance and the nature of the horcruxes we saw in the books. ", "edited": 1492181553.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always had the same theory. It&amp;#39;s clear that at least for Slytherin&amp;#39;s locket, Voldemort mutilated his eyes to make the horcrux. Needing to give up part of yourself to make a horcrux explains Voldemort&amp;#39;s appearance and the nature of the horcruxes we saw in the books. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg93i0e", "score_hidden": false, "stickied": false, "created": 1492203677.0, "created_utc": 1492174877.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 46}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg97odc", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Jimm607", "parent_id": "t1_dg903b6", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "voldemort is a kraken confirmed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;voldemort is a kraken confirmed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg97odc", "score_hidden": false, "stickied": false, "created": 1492209784.0, "created_utc": 1492180984.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9kk2q", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "msgrammarnazi", "parent_id": "t1_dg903b6", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Didn't it scream too? I have a vague memory of that..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Didn&amp;#39;t it scream too? I have a vague memory of that..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9kk2q", "score_hidden": false, "stickied": false, "created": 1492224827.0, "created_utc": 1492196027.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg903b6", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "snitchnipple", "parent_id": "t1_dg8zleo", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "It is actually described as bleeding, but it was ink that bled out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is actually described as bleeding, but it was ink that bled out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg903b6", "score_hidden": false, "stickied": false, "created": 1492195903.0, "created_utc": 1492167103.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 46}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zleo", "gilded": 0, "archived": false, "score": 43, "report_reasons": null, "author": "DavidAtWork17", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Did the diary bleed after being stabbed?  Maybe blood was the first sacrifice (it's been about 15 years since I read the 2nd book).  Plus there would be the sinister overtones of a diary 'written in blood'.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did the diary bleed after being stabbed?  Maybe blood was the first sacrifice (it&amp;#39;s been about 15 years since I read the 2nd book).  Plus there would be the sinister overtones of a diary &amp;#39;written in blood&amp;#39;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg8zleo", "score_hidden": false, "stickied": false, "created": 1492194374.0, "created_utc": 1492165574.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 43}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg91nk4", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "LuneMoth", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Wow this is really good and interesting! I'm not sure there's much evidence for Flamel to have made a horcrux but it's very interesting nonetheless!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow this is really good and interesting! I&amp;#39;m not sure there&amp;#39;s much evidence for Flamel to have made a horcrux but it&amp;#39;s very interesting nonetheless!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg91nk4", "score_hidden": false, "stickied": false, "created": 1492200000.0, "created_utc": 1492171200.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg97e74", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "theotherghostgirl", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "That's an interesting idea, and it explains why he looks like a Michael Jackson vampire even in flashbacks to the night Harry's parents were murdered. \n\nI had always chalked it up to it being a production error on the side of the movies, who would have wanted Voldy to still be recognizable in the flashbacks. \n\nI'd also assumed that part of the reason for Voldemort's odd appearance was due to the fact that he'd possessed some sort of magical creature at the time they did the ritual to give him a human(ish) body. It had been mentioned that before finding Quirrel he had been latching onto snakes and other animals, which was also kinda what I had thought had happened with the weird baby critter they tossed into the pot. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s an interesting idea, and it explains why he looks like a Michael Jackson vampire even in flashbacks to the night Harry&amp;#39;s parents were murdered. &lt;/p&gt;\n\n&lt;p&gt;I had always chalked it up to it being a production error on the side of the movies, who would have wanted Voldy to still be recognizable in the flashbacks. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d also assumed that part of the reason for Voldemort&amp;#39;s odd appearance was due to the fact that he&amp;#39;d possessed some sort of magical creature at the time they did the ritual to give him a human(ish) body. It had been mentioned that before finding Quirrel he had been latching onto snakes and other animals, which was also kinda what I had thought had happened with the weird baby critter they tossed into the pot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg97e74", "score_hidden": false, "stickied": false, "created": 1492209416.0, "created_utc": 1492180616.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9q022", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg9btyz", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Thank you so much! \n\nHaha, sorry about that...I'm just glad I was able to write a theory halfway decent, and somewhat condensed [for Reddit], especially given how much alchemical material / evidence is referenced (indrectly) in the *Harry Potter* series as a whole.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much! &lt;/p&gt;\n\n&lt;p&gt;Haha, sorry about that...I&amp;#39;m just glad I was able to write a theory halfway decent, and somewhat condensed [for Reddit], especially given how much alchemical material / evidence is referenced (indrectly) in the &lt;em&gt;Harry Potter&lt;/em&gt; series as a whole.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9q022", "score_hidden": false, "stickied": false, "created": 1492231387.0, "created_utc": 1492202587.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9btyz", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Haymus", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Damn you obversa ! You beat me to writing out the theory of Tom sacrificing his body parts for the horcruxes haha I'm actually glad you did though. This was a good read", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn you obversa ! You beat me to writing out the theory of Tom sacrificing his body parts for the horcruxes haha I&amp;#39;m actually glad you did though. This was a good read&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9btyz", "score_hidden": false, "stickied": false, "created": 1492214767.0, "created_utc": 1492185967.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgb51xd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg8ynt9", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Thank you so much!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb51xd", "score_hidden": false, "stickied": false, "created": 1492317416.0, "created_utc": 1492288616.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ynt9", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Alsmalkthe", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This is really well thought​ out!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is really well thought​ out!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg8ynt9", "score_hidden": false, "stickied": false, "created": 1492191298.0, "created_utc": 1492162498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9k69y", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "hallways", "parent_id": "t1_dg94zuo", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Maybe that was the body part he sacrificed when he murdered Myrtle to make the diary Horcrux, kind of freezing himself as a 15/16 year old forever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe that was the body part he sacrificed when he murdered Myrtle to make the diary Horcrux, kind of freezing himself as a 15/16 year old forever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9k69y", "score_hidden": false, "stickied": false, "created": 1492224365.0, "created_utc": 1492195565.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9co99", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Laureltess", "parent_id": "t1_dg99jtc", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Hormones can only deepen a voice- you can't lighten a voice without vocal coaching or surgery :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hormones can only deepen a voice- you can&amp;#39;t lighten a voice without vocal coaching or surgery :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9co99", "score_hidden": false, "stickied": false, "created": 1492215681.0, "created_utc": 1492186881.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99jtc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Ermahgerdrerdert", "parent_id": "t1_dg94zuo", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think it still has some impact though? Maybe... I remember a trans woman talking about how she liked oestrogen because it made her voice and skin softer, and I was also of the understanding that Castro had more oestrogen in their bodies as a result but I guess it might have been psychosomatic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it still has some impact though? Maybe... I remember a trans woman talking about how she liked oestrogen because it made her voice and skin softer, and I was also of the understanding that Castro had more oestrogen in their bodies as a result but I guess it might have been psychosomatic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg99jtc", "score_hidden": false, "stickied": false, "created": 1492212113.0, "created_utc": 1492183313.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg94zuo", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "Bakitus", "parent_id": "t1_dg93gb4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "But castration after puberty would have little to no impact on the voice. Castrato were castrated before puberty to prevent their voices deepening; once it does, it isn't made higher by removing the testes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But castration after puberty would have little to no impact on the voice. Castrato were castrated before puberty to prevent their voices deepening; once it does, it isn&amp;#39;t made higher by removing the testes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg94zuo", "score_hidden": false, "stickied": false, "created": 1492206088.0, "created_utc": 1492177288.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9qyms", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg93gb4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "What /u/Bakitus said is spot-on. I've studied castratos somewhat in-depth before, and Tom Riddle was definitely at the point where castration alone would not change his voice. His puberty had already passed, and he was already well into adulthood by the point his voice changed. So the voice change had to have been caused by something else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What &lt;a href=\"/u/Bakitus\"&gt;/u/Bakitus&lt;/a&gt; said is spot-on. I&amp;#39;ve studied castratos somewhat in-depth before, and Tom Riddle was definitely at the point where castration alone would not change his voice. His puberty had already passed, and he was already well into adulthood by the point his voice changed. So the voice change had to have been caused by something else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9qyms", "score_hidden": false, "stickied": false, "created": 1492232562.0, "created_utc": 1492203762.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93gb4", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Bhima", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Surely what is suggested by his sudden manifestation of a \"high and cold\" voice is self castration.  If you've never heard the sole extant recording of the last Castrato and feel like getting thoroughly creeped out, check it out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Surely what is suggested by his sudden manifestation of a &amp;quot;high and cold&amp;quot; voice is self castration.  If you&amp;#39;ve never heard the sole extant recording of the last Castrato and feel like getting thoroughly creeped out, check it out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg93gb4", "score_hidden": false, "stickied": false, "created": 1492203590.0, "created_utc": 1492174790.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgb55nr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg95p45", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "We also see this with Salazar Slytherin's wand, which Rowling mentions on Pottermore. Slytherin made it so his wand could only respond to direct commands in Parseltongue, and thus, keyed it so only he (or one of his descendants) could wield it. Blood magic may have also been performed on the wand, so that only a blood descendant of Slytherin himself could wield it. Likewise, it's said that wands with snake cores (basilisk / horned serpent horn or bones being the canon one) respond to Parseltongue as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We also see this with Salazar Slytherin&amp;#39;s wand, which Rowling mentions on Pottermore. Slytherin made it so his wand could only respond to direct commands in Parseltongue, and thus, keyed it so only he (or one of his descendants) could wield it. Blood magic may have also been performed on the wand, so that only a blood descendant of Slytherin himself could wield it. Likewise, it&amp;#39;s said that wands with snake cores (basilisk / horned serpent horn or bones being the canon one) respond to Parseltongue as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb55nr", "score_hidden": false, "stickied": false, "created": 1492317559.0, "created_utc": 1492288759.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95p45", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "nmagod", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "There are many many rituals in folklore requiring the blood of the person performing it; it's not outside of possibility that Voldemort would have acted to increase his wand's strength in such a ritual, and further, perhaps interfered with wandmakers' processes to cause a drop of his own blood to be introduced to every new wand in the event that some future person would attempt to use magic against him.\n\nAnd blood calls to blood, as they say, so a bit of his blood could have easily ended up in Harry, etc etc", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are many many rituals in folklore requiring the blood of the person performing it; it&amp;#39;s not outside of possibility that Voldemort would have acted to increase his wand&amp;#39;s strength in such a ritual, and further, perhaps interfered with wandmakers&amp;#39; processes to cause a drop of his own blood to be introduced to every new wand in the event that some future person would attempt to use magic against him.&lt;/p&gt;\n\n&lt;p&gt;And blood calls to blood, as they say, so a bit of his blood could have easily ended up in Harry, etc etc&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg95p45", "score_hidden": false, "stickied": false, "created": 1492207104.0, "created_utc": 1492178304.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgb578d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg9naui", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Thank you so much, and you're welcome!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much, and you&amp;#39;re welcome!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb578d", "score_hidden": false, "stickied": false, "created": 1492317614.0, "created_utc": 1492288814.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9naui", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "I_MUST_COMMIT_HAIKU", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This is really cool\n\nYou did a lot of research\n\nThank you for sharing", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is really cool&lt;/p&gt;\n\n&lt;p&gt;You did a lot of research&lt;/p&gt;\n\n&lt;p&gt;Thank you for sharing&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9naui", "score_hidden": false, "stickied": false, "created": 1492228137.0, "created_utc": 1492199337.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9ohdl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JEFLIV", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "N O   N O S E", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;N O   N O S E&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9ohdl", "score_hidden": false, "stickied": false, "created": 1492229557.0, "created_utc": 1492200757.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgbfcn4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg9vv2w", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Thank you so much! \n\nTo answer your question, others have speculated on this thread that Voldemort sacrificed his entire body to make the \"Horcrux\" in Harry. This would explain why his first body seemingly vanished, or was destroyed, from a rebounded Killing Curse, when the Killing Curse is shown not to cause any damage to the bodies of its victims.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much! &lt;/p&gt;\n\n&lt;p&gt;To answer your question, others have speculated on this thread that Voldemort sacrificed his entire body to make the &amp;quot;Horcrux&amp;quot; in Harry. This would explain why his first body seemingly vanished, or was destroyed, from a rebounded Killing Curse, when the Killing Curse is shown not to cause any damage to the bodies of its victims.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbfcn4", "score_hidden": false, "stickied": false, "created": 1492331980.0, "created_utc": 1492303180.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9vv2w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Asiriya", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I really like this. From the state of V's body, clearly something has happened to him. At first it seems like something he chose to do, emulating snakes. Then we learn about Horcruxes and I assumed it was a side effect of fragmenting his soul - but to actively be investing parts of himself into each Horcrux makes a lot of sense. It explains why the knowledge would be hidden, why the practice is considered abhorrent, why he's so deformed, why so few others would take things as far as Voldemort (what kind of life is an eternity with a broken body?) \n\nOne thing to consider - the other horcruxes might have something of the physical essence preserved, so what was put into Harry?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really like this. From the state of V&amp;#39;s body, clearly something has happened to him. At first it seems like something he chose to do, emulating snakes. Then we learn about Horcruxes and I assumed it was a side effect of fragmenting his soul - but to actively be investing parts of himself into each Horcrux makes a lot of sense. It explains why the knowledge would be hidden, why the practice is considered abhorrent, why he&amp;#39;s so deformed, why so few others would take things as far as Voldemort (what kind of life is an eternity with a broken body?) &lt;/p&gt;\n\n&lt;p&gt;One thing to consider - the other horcruxes might have something of the physical essence preserved, so what was put into Harry?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9vv2w", "score_hidden": false, "stickied": false, "created": 1492238949.0, "created_utc": 1492210149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgbcdvj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg9vxqs", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Thank you so much!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbcdvj", "score_hidden": false, "stickied": false, "created": 1492327786.0, "created_utc": 1492298986.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9vxqs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sharltocopes", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Now *this* is a damn decent and well thought-out fan theory that I could see as legitimately bolstering what was already put in place without contradicting it. Well done! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Now &lt;em&gt;this&lt;/em&gt; is a damn decent and well thought-out fan theory that I could see as legitimately bolstering what was already put in place without contradicting it. Well done! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9vxqs", "score_hidden": false, "stickied": false, "created": 1492239048.0, "created_utc": 1492210248.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9wutv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Asiriya", "parent_id": "t1_dg9wgqb", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yes, and I think Wormtail losing his hand is shocking too, though less so, possibly due to time's dilution, and that he gets it back so quickly.\n\nVoldemort gives up more though, and is altered into something very different.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, and I think Wormtail losing his hand is shocking too, though less so, possibly due to time&amp;#39;s dilution, and that he gets it back so quickly.&lt;/p&gt;\n\n&lt;p&gt;Voldemort gives up more though, and is altered into something very different.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9wutv", "score_hidden": false, "stickied": false, "created": 1492240280.0, "created_utc": 1492211480.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9wgqb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AWeepingAngelsThesis", "parent_id": "t1_dg9v4ae", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Wormtail gave up his own hand.\n\nEDIT: Also, on the topic of giving up your own body parts...there's \"The Warlock's Hairy Heart\" in *The Tales of Beedle the Bard*. And on a similar note, although far less gory, Harry was forced to slice open his hand and write in blood in *Harry Potter and the Order of the Phoenix*. Bottom line is, Rowling's written some pretty graphic shit.\n\nEDIT 2: Grammar", "edited": 1492211316.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wormtail gave up his own hand.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Also, on the topic of giving up your own body parts...there&amp;#39;s &amp;quot;The Warlock&amp;#39;s Hairy Heart&amp;quot; in &lt;em&gt;The Tales of Beedle the Bard&lt;/em&gt;. And on a similar note, although far less gory, Harry was forced to slice open his hand and write in blood in &lt;em&gt;Harry Potter and the Order of the Phoenix&lt;/em&gt;. Bottom line is, Rowling&amp;#39;s written some pretty graphic shit.&lt;/p&gt;\n\n&lt;p&gt;EDIT 2: Grammar&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9wgqb", "score_hidden": false, "stickied": false, "created": 1492239756.0, "created_utc": 1492210956.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9v4ae", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Asiriya", "parent_id": "t1_dg9oui2", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I don't know, voluntarily giving up chunks of your body is pretty dark to me. Losing body parts in battle is decidedly less gruesome than giving up your own eyes and, potentially, genitals. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know, voluntarily giving up chunks of your body is pretty dark to me. Losing body parts in battle is decidedly less gruesome than giving up your own eyes and, potentially, genitals. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9v4ae", "score_hidden": false, "stickied": false, "created": 1492237944.0, "created_utc": 1492209144.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9oui2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AWeepingAngelsThesis", "parent_id": "t1_dg9ogfc", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yeah, OP's theory is no worse than what Rowling already showed onscreen. For example, Peter Pettigrew and George Weasley both lost body parts rather gruesomely. And Rowling wouldn't have even needed to show Voldemort lopping off body parts; she could've just gone the Mad-Eye route and introduced him with a lot of body parts already missing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, OP&amp;#39;s theory is no worse than what Rowling already showed onscreen. For example, Peter Pettigrew and George Weasley both lost body parts rather gruesomely. And Rowling wouldn&amp;#39;t have even needed to show Voldemort lopping off body parts; she could&amp;#39;ve just gone the Mad-Eye route and introduced him with a lot of body parts already missing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9oui2", "score_hidden": false, "stickied": false, "created": 1492229994.0, "created_utc": 1492201194.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ogfc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bassinastor", "parent_id": "t1_dg9muxe", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yeah, that's exactly it. Because nothing happens to the bodies we know it is either a mental thing or it's done with Voldemort's own body. Those things can only get so gruesome and people have considered just about every possible act, so I *strongly* doubt Rowling's stories about how bad the ritual is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, that&amp;#39;s exactly it. Because nothing happens to the bodies we know it is either a mental thing or it&amp;#39;s done with Voldemort&amp;#39;s own body. Those things can only get so gruesome and people have considered just about every possible act, so I &lt;em&gt;strongly&lt;/em&gt; doubt Rowling&amp;#39;s stories about how bad the ritual is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9ogfc", "score_hidden": false, "stickied": false, "created": 1492229525.0, "created_utc": 1492200725.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9muxe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AWeepingAngelsThesis", "parent_id": "t1_dg9bd57", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The most gruesome theory *I've* heard is that making a Horcrux involves cannibalism. We already know that you have to kill someone to make a Horcrux, so maybe you have to eat the corpse afterwards.\n\nEDIT: But that probably wouldn't jive with the untarnished state in which the corpses of Voldemort's victims were found.", "edited": 1492199667.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The most gruesome theory &lt;em&gt;I&amp;#39;ve&lt;/em&gt; heard is that making a Horcrux involves cannibalism. We already know that you have to kill someone to make a Horcrux, so maybe you have to eat the corpse afterwards.&lt;/p&gt;\n\n&lt;p&gt;EDIT: But that probably wouldn&amp;#39;t jive with the untarnished state in which the corpses of Voldemort&amp;#39;s victims were found.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9muxe", "score_hidden": false, "stickied": false, "created": 1492227604.0, "created_utc": 1492198804.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9q9iu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg9bd57", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Thank you so much!\n\nTo be fair, I think the process would be a lot more gruesome to witness in-person. Harry even states he \"couldn't look\" at Pettigrew when, and after, Pettigrew chopped off his hand. *Fullmetal Alchemist* does an excellent job of showing the sheer [body] horror of losing a limb due to alchemy, and for me, seeing that on-screen always made my stomach twist horribly. You can watch one such scene [here](https://www.youtube.com/watch?v=bvpJjbphJWQ), obvious warning for disturbing themes / blood / gore.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much!&lt;/p&gt;\n\n&lt;p&gt;To be fair, I think the process would be a lot more gruesome to witness in-person. Harry even states he &amp;quot;couldn&amp;#39;t look&amp;quot; at Pettigrew when, and after, Pettigrew chopped off his hand. &lt;em&gt;Fullmetal Alchemist&lt;/em&gt; does an excellent job of showing the sheer [body] horror of losing a limb due to alchemy, and for me, seeing that on-screen always made my stomach twist horribly. You can watch one such scene &lt;a href=\"https://www.youtube.com/watch?v=bvpJjbphJWQ\"&gt;here&lt;/a&gt;, obvious warning for disturbing themes / blood / gore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9q9iu", "score_hidden": false, "stickied": false, "created": 1492231704.0, "created_utc": 1492202904.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9bd57", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "bassinastor", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Really great theory, definitely the best horcrux theory I've read. The only problem is with Rowling's comments about how apparently gruesome the process should be. While it's definitely a disturbing concept, it's not much worse than other things that were described in the books. However, I think it's likely that Rowling made up that story. This is one of the more gruesome theories out there, but I'm pretty sure no one has been close to throwing up from reading it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really great theory, definitely the best horcrux theory I&amp;#39;ve read. The only problem is with Rowling&amp;#39;s comments about how apparently gruesome the process should be. While it&amp;#39;s definitely a disturbing concept, it&amp;#39;s not much worse than other things that were described in the books. However, I think it&amp;#39;s likely that Rowling made up that story. This is one of the more gruesome theories out there, but I&amp;#39;m pretty sure no one has been close to throwing up from reading it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9bd57", "score_hidden": false, "stickied": false, "created": 1492214234.0, "created_utc": 1492185434.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9okzh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg9lqw8", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "It wasn't in the books. J.K. Rowling answered the question in an interview. More specifically, it was the death of Tom Riddle Sr. that allowed his son to create the Ring Horcrux.\n\n&gt; Lady Bella: Whose murders did voldemor use to create each of the horcruxes\n\n&gt; J.K. Rowling: The diary – Moaning Myrtle. The cup – Hepzibah Smith, the previous owner. The locket – a Muggle tramp. Nagini – Bertha Jorkins (Voldemort could use a wand once he regained a rudimentary body, as long as the victim was subdued).\n\n&gt; J.K. Rowling: The diadem – an Albanian peasant. The ring – Tom Riddle Sr. [(Source)](http://www.the-leaky-cauldron.org/2007/07/30/j-k-rowling-web-chat-transcript/)\n\nThose aren't in order, because the Ring was probably the next Horcrux created after the Diary, according to the timeline of the books.\n\nAs for the body parts, it is likely that, because Pettigrew did not use dark magic but a mere knife to cut off his hand (albeit probably with magical force to cut through bone), Voldemort was able to easily replace his missing hand with a magical one.\n\nHowever, for severings made through Dark magic, as seen with George Weasley's missing ear and Mad-Eye Moody's grotesque and heavily scarred appearance, Marietta Edgecombe's facial scars, and even Lupin's magical scars from self-inflicted werewolf wounds (in addition to Bill Weasley's werewolf attack scars), the body part cannot be replaced; the scars cannot be removed, nor altered. They are mentioned to be \"ugly-looking\" and permanent.\n\nA movie-only example is also the word \"Mudblood\" that Bellatrix Lestrange carves into Hermione's arm in *Deathly Hallows*, which many fans have taken to be from a blade enchanted with Dark magic. This would mean that Bellatrix purposefully \"scarred\" Hermione, in the films, with Dark magic.\n\nThis would also be the case for Voldemort, hence why, likely, his \"new form\" is missing quite a few physical features, and why he doesn't just replace them.\n\nThank you so much!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It wasn&amp;#39;t in the books. J.K. Rowling answered the question in an interview. More specifically, it was the death of Tom Riddle Sr. that allowed his son to create the Ring Horcrux.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Lady Bella: Whose murders did voldemor use to create each of the horcruxes&lt;/p&gt;\n\n&lt;p&gt;J.K. Rowling: The diary – Moaning Myrtle. The cup – Hepzibah Smith, the previous owner. The locket – a Muggle tramp. Nagini – Bertha Jorkins (Voldemort could use a wand once he regained a rudimentary body, as long as the victim was subdued).&lt;/p&gt;\n\n&lt;p&gt;J.K. Rowling: The diadem – an Albanian peasant. The ring – Tom Riddle Sr. &lt;a href=\"http://www.the-leaky-cauldron.org/2007/07/30/j-k-rowling-web-chat-transcript/\"&gt;(Source)&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Those aren&amp;#39;t in order, because the Ring was probably the next Horcrux created after the Diary, according to the timeline of the books.&lt;/p&gt;\n\n&lt;p&gt;As for the body parts, it is likely that, because Pettigrew did not use dark magic but a mere knife to cut off his hand (albeit probably with magical force to cut through bone), Voldemort was able to easily replace his missing hand with a magical one.&lt;/p&gt;\n\n&lt;p&gt;However, for severings made through Dark magic, as seen with George Weasley&amp;#39;s missing ear and Mad-Eye Moody&amp;#39;s grotesque and heavily scarred appearance, Marietta Edgecombe&amp;#39;s facial scars, and even Lupin&amp;#39;s magical scars from self-inflicted werewolf wounds (in addition to Bill Weasley&amp;#39;s werewolf attack scars), the body part cannot be replaced; the scars cannot be removed, nor altered. They are mentioned to be &amp;quot;ugly-looking&amp;quot; and permanent.&lt;/p&gt;\n\n&lt;p&gt;A movie-only example is also the word &amp;quot;Mudblood&amp;quot; that Bellatrix Lestrange carves into Hermione&amp;#39;s arm in &lt;em&gt;Deathly Hallows&lt;/em&gt;, which many fans have taken to be from a blade enchanted with Dark magic. This would mean that Bellatrix purposefully &amp;quot;scarred&amp;quot; Hermione, in the films, with Dark magic.&lt;/p&gt;\n\n&lt;p&gt;This would also be the case for Voldemort, hence why, likely, his &amp;quot;new form&amp;quot; is missing quite a few physical features, and why he doesn&amp;#39;t just replace them.&lt;/p&gt;\n\n&lt;p&gt;Thank you so much!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9okzh", "score_hidden": false, "stickied": false, "created": 1492229677.0, "created_utc": 1492200877.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9lqw8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "damn_this_is_hard", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Where do the books say that the Riddle Family was killed to make horcruxes? Your point being that the body of the victims were not messed with. But I am fairly certain Voldy just killed the Riddles to end the line, not to make more Horcruxes.\n\nAlso, you mention Voldy can make new body parts, using Wormtail as an example. His hand was silver, not flesh or blood or anything human, so this example as proof is also coming short.\n\nGreat write up overall though. Not sure I agree, I sit more in the camp of Horcrux creation requiring some kind of cannibalistic measure, being that it was sooo disgusting ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where do the books say that the Riddle Family was killed to make horcruxes? Your point being that the body of the victims were not messed with. But I am fairly certain Voldy just killed the Riddles to end the line, not to make more Horcruxes.&lt;/p&gt;\n\n&lt;p&gt;Also, you mention Voldy can make new body parts, using Wormtail as an example. His hand was silver, not flesh or blood or anything human, so this example as proof is also coming short.&lt;/p&gt;\n\n&lt;p&gt;Great write up overall though. Not sure I agree, I sit more in the camp of Horcrux creation requiring some kind of cannibalistic measure, being that it was sooo disgusting &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9lqw8", "score_hidden": false, "stickied": false, "created": 1492226265.0, "created_utc": 1492197465.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dg9nrih", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AWeepingAngelsThesis", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "My theory is that one body part that Voldemort gave up was his pigment, essentially turning himself albino. It'd explain the chalky skin and red eyes. It's also pretty obvious that he gave up his nose, ears, lips, and hair at some point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My theory is that one body part that Voldemort gave up was his pigment, essentially turning himself albino. It&amp;#39;d explain the chalky skin and red eyes. It&amp;#39;s also pretty obvious that he gave up his nose, ears, lips, and hair at some point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9nrih", "score_hidden": false, "stickied": false, "created": 1492228692.0, "created_utc": 1492199892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgbgf4m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg9qj3v", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Thank you so much! As per your edit, that is also definitely true!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much! As per your edit, that is also definitely true!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbgf4m", "score_hidden": false, "stickied": false, "created": 1492333478.0, "created_utc": 1492304678.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9qj3v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Shadow_Jedi", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I like this a lot. The parallels are definitely there....even Voldemort's rudimentary body in GoF is basically a homunculous. \n\nMajor edit: this also potentially solves a big plot hole in the series! The Killing Curse is supposed to leave a body, but it didn't leave Voldemort's body when it rebounded (like it does in DH). It could be that, in his surprise at what was happening, Voldemort sacrificed his entire body to make one more Horcrux. Even if it was unintentional. ", "edited": 1492208059.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like this a lot. The parallels are definitely there....even Voldemort&amp;#39;s rudimentary body in GoF is basically a homunculous. &lt;/p&gt;\n\n&lt;p&gt;Major edit: this also potentially solves a big plot hole in the series! The Killing Curse is supposed to leave a body, but it didn&amp;#39;t leave Voldemort&amp;#39;s body when it rebounded (like it does in DH). It could be that, in his surprise at what was happening, Voldemort sacrificed his entire body to make one more Horcrux. Even if it was unintentional. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9qj3v", "score_hidden": false, "stickied": false, "created": 1492232027.0, "created_utc": 1492203227.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgbfhh8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg9xojz", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Thank you so much!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbfhh8", "score_hidden": false, "stickied": false, "created": 1492332175.0, "created_utc": 1492303375.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xojz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PG-Noob", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Wow this is so amazing and dark. Good work!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow this is so amazing and dark. Good work!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9xojz", "score_hidden": false, "stickied": false, "created": 1492241374.0, "created_utc": 1492212574.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dgbh0sy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg9xw1z", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Is that so? I don't really recall what happened, or when. However, I apologize if I came off as uncivil, sometimes some of the (ignorant) replies from this subreddit in general makes me aggravated or moody. i.e. usually stupid comments like, \"your post is too long\", \"tl;dnr\", or other unrelated comments that don't add to the discussion.\n\nAnyways, thank you so much!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is that so? I don&amp;#39;t really recall what happened, or when. However, I apologize if I came off as uncivil, sometimes some of the (ignorant) replies from this subreddit in general makes me aggravated or moody. i.e. usually stupid comments like, &amp;quot;your post is too long&amp;quot;, &amp;quot;tl;dnr&amp;quot;, or other unrelated comments that don&amp;#39;t add to the discussion.&lt;/p&gt;\n\n&lt;p&gt;Anyways, thank you so much!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbh0sy", "score_hidden": false, "stickied": false, "created": 1492334339.0, "created_utc": 1492305539.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xw1z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BigOzzie", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "So I know the last time you posted a theory we butted heads a bit, but I'm gonna offer feedback again anyway.\n\nThis is phenomenal!  Lots of solid evidence coupled with staying consistent with what we know about the characters and world make this so believable.  It even fills in knowledge gaps by answering questions I didn't even know I had (like why Voldemort's eyes changed so drastically?).   Fantastic work!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I know the last time you posted a theory we butted heads a bit, but I&amp;#39;m gonna offer feedback again anyway.&lt;/p&gt;\n\n&lt;p&gt;This is phenomenal!  Lots of solid evidence coupled with staying consistent with what we know about the characters and world make this so believable.  It even fills in knowledge gaps by answering questions I didn&amp;#39;t even know I had (like why Voldemort&amp;#39;s eyes changed so drastically?).   Fantastic work!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9xw1z", "score_hidden": false, "stickied": false, "created": 1492241647.0, "created_utc": 1492212847.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65b4dj", "likes": null, "replies": "", "user_reports": [], "id": "dga912h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dg9xybw", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Others on this thread have speculated that he unwittingly sacrificed his entire body, especially since the spell he used, the Killing Curse, doesn't destroy the body. But an unwitting Horcrux-making would.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Others on this thread have speculated that he unwittingly sacrificed his entire body, especially since the spell he used, the Killing Curse, doesn&amp;#39;t destroy the body. But an unwitting Horcrux-making would.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dga912h", "score_hidden": false, "stickied": false, "created": 1492257417.0, "created_utc": 1492228617.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xybw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The_Potato_God99", "parent_id": "t3_65b4dj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "then what did he sacrifice when he accidentally made harry into a horcrux?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;then what did he sacrifice when he accidentally made harry into a horcrux?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dg9xybw", "score_hidden": false, "stickied": false, "created": 1492241730.0, "created_utc": 1492212930.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]