[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For those of you who have not seen this film the lovable red monster, Elmo wakes up one morning to have some fun with his anthropomorphic blanket. After some dancing and trying to do the right thing he has lost his beloved blanket inside of Oscar the Grouch&amp;#39;s can. Elmo then accidentally opens a portal that takes him to the land of the Grouches. &lt;/p&gt;\n\n&lt;p&gt;In this land Elmo loses sight of his blanket as the portal splits and sends him in one direction while his blanket goes in another. Elmo lands in a large pile of trash in Grouchland and then the locals begin to sing a song to him about where he is. &lt;/p&gt;\n\n&lt;p&gt;The song ends and we are introduced to the villain of the story, Huxley. (Portrayed by Mandy Patinkin) Huxley is introduced by name and what makes him villainous when a panicked Grouch exclaims, &amp;quot;It&amp;#39;s Huxley! He&amp;#39;ll take anything!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;As Huxley flies into town in a helicopter wielding a giant vacuum to take things from the citizens, Elmo sees he is trying to take the doll of a little girl Grouch. Elmo screams for him to stop. Upon hearing that someone is questioning him Huxley lands and exits to find out who is questioning his taking of what is &amp;quot;Mine.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It is during this exchange that Huxley reveals that he has claimed a blanket as &amp;quot;Mine.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Now to compare the blanket that Huxley holds up to show Elmo to the one we see flying Elmo around his room, there are major differences, not in look, but in personality. It is obvious in the beginning the blanket has very humanistic qualities, it is shown wearing spring eyed glasses to cheer Elmo up, picking Elmo up and flying around the room, dancing, playing hide and seek, etc.&lt;/p&gt;\n\n&lt;p&gt;So already the first part of my theory is that Elmo only thinks this is his blanket, but is in actuality not. By the end of the film Elmo makes it home with the blanket that Huxley had and is still not seen doing anything humanistic as was shown in the beginning.&lt;/p&gt;\n\n&lt;p&gt;The second part of my theory is the major one. Throughout the film Huxley is the taker of things, even sings a song about how &amp;quot;I see it, take it and I make it mine.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My theory first began when he says the same exact line at two seperate points in the film. &amp;quot;GET BACK TO WORK!&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;It has the same inflection both times so when I heard it a second time, with it came a sort of deja vu, which is why it stood out to me.&lt;/p&gt;\n\n&lt;p&gt;In the first instance Huxley screams this, it is when viewing his henchman, Bug, through a video monitor and sees that he is eating instead of trying to stop Elmo from getting to the castle. &lt;/p&gt;\n\n&lt;p&gt;The second instance is when Huxley is storming through his castle after Elmo escapes a trap meant to halt his progress and Huxley is angry. He happens upon two other nameless henchmen who are sitting on a girder suspended by a rope and the two are eating lunch.&lt;/p&gt;\n\n&lt;p&gt;Then after paying close attention, I see that Huxley doesn&amp;#39;t eat any food throughout the entire film. Huxley is greedy and angry, because he&amp;#39;s hungry. Irrationally angry at those that have food. &lt;/p&gt;\n\n&lt;p&gt;Just an eye opener for you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "For those of you who have not seen this film the lovable red monster, Elmo wakes up one morning to have some fun with his anthropomorphic blanket. After some dancing and trying to do the right thing he has lost his beloved blanket inside of Oscar the Grouch's can. Elmo then accidentally opens a portal that takes him to the land of the Grouches. \n\nIn this land Elmo loses sight of his blanket as the portal splits and sends him in one direction while his blanket goes in another. Elmo lands in a large pile of trash in Grouchland and then the locals begin to sing a song to him about where he is. \n\nThe song ends and we are introduced to the villain of the story, Huxley. (Portrayed by Mandy Patinkin) Huxley is introduced by name and what makes him villainous when a panicked Grouch exclaims, \"It's Huxley! He'll take anything!\"\n\nAs Huxley flies into town in a helicopter wielding a giant vacuum to take things from the citizens, Elmo sees he is trying to take the doll of a little girl Grouch. Elmo screams for him to stop. Upon hearing that someone is questioning him Huxley lands and exits to find out who is questioning his taking of what is \"Mine.\"\n\nIt is during this exchange that Huxley reveals that he has claimed a blanket as \"Mine.\"\n\nNow to compare the blanket that Huxley holds up to show Elmo to the one we see flying Elmo around his room, there are major differences, not in look, but in personality. It is obvious in the beginning the blanket has very humanistic qualities, it is shown wearing spring eyed glasses to cheer Elmo up, picking Elmo up and flying around the room, dancing, playing hide and seek, etc.\n\nSo already the first part of my theory is that Elmo only thinks this is his blanket, but is in actuality not. By the end of the film Elmo makes it home with the blanket that Huxley had and is still not seen doing anything humanistic as was shown in the beginning.\n\nThe second part of my theory is the major one. Throughout the film Huxley is the taker of things, even sings a song about how \"I see it, take it and I make it mine.\"\n\nMy theory first began when he says the same exact line at two seperate points in the film. \"GET BACK TO WORK!\"  \n\nIt has the same inflection both times so when I heard it a second time, with it came a sort of deja vu, which is why it stood out to me.\n\nIn the first instance Huxley screams this, it is when viewing his henchman, Bug, through a video monitor and sees that he is eating instead of trying to stop Elmo from getting to the castle. \n\nThe second instance is when Huxley is storming through his castle after Elmo escapes a trap meant to halt his progress and Huxley is angry. He happens upon two other nameless henchmen who are sitting on a girder suspended by a rope and the two are eating lunch.\n\nThen after paying close attention, I see that Huxley doesn't eat any food throughout the entire film. Huxley is greedy and angry, because he's hungry. Irrationally angry at those that have food. \n\nJust an eye opener for you.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65bqn2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "Remotefeatures", "saved": false, "mod_reports": [], "name": "t3_65bqn2", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65bqn2/the_adventures_of_elmo_in_grouchland/", "num_reports": null, "locked": false, "stickied": false, "created": 1492193739.0, "url": "https://www.reddit.com/r/FanTheories/comments/65bqn2/the_adventures_of_elmo_in_grouchland/", "author_flair_text": null, "quarantine": false, "title": "The Adventures of Elmo in Grouchland", "created_utc": 1492164939.0, "distinguished": null, "media": null, "upvote_ratio": 0.63, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]