[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There was a &lt;a href=\"https://www.reddit.com/r/FanTheories/comments/1bp3bg/willy_wonka_is_the_final_regeneration_of_the/\"&gt;great post a couple years ago&lt;/a&gt; which details exactly how Willy Wonka acts, sounds, and behaves pretty much like a Time Lord and how in &amp;quot;The Great Glass Elevator&amp;quot; we see evidence that he&amp;#39;s traveled the length and breadth of the galaxy on less that 40 Altairian Dollars a day.  This is not a recap of that post.  &lt;/p&gt;\n\n&lt;p&gt;This post focuses on the events of the film Willy Wonka and the Chocolate Factory because my youngest son is obsessed with it and I&amp;#39;ve probably seen it 12 times in the last week.&lt;/p&gt;\n\n&lt;p&gt;So, a brief recap: WWCF takes place in a European town wherein Willy Wonka owns and operates a vast chocolate factory.  Because inheritance law is apparently less complex than windfall taxes, Wonka decides to give his factory to some kid and, in order to arrange for a suitable pool of choices, distributes 5 Golden Tickets in Wonka bars all over the world.  He arranges for his personal assistant, Mr Wilkinson to play the role of an industrial rival &amp;quot;Arthur Slugworth&amp;quot; to recruit the children to spy on Wonka.  The film follows the group&amp;#39;s adventures in the chocolate factory, ending with Charlie&amp;#39;s eventual choosing of Wonka over &amp;quot;Slugworth&amp;quot; and thus his winning of the &amp;quot;grand and glorious prize.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And none of this is possible unless Wonka is a time-lord.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s start from the end of the film and work our way backwards, as that sort of flow seems completely reasonable in this context.  &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Wonka and Charlie exit the factory, and the film, in a &amp;quot;Great Glass Elevator&amp;quot; a flying box of unspecified properties which can travel arbitrarily in space.  Now if that doesn&amp;#39;t scream &amp;quot;TARDIS&amp;quot; I don&amp;#39;t know what does but that&amp;#39;s not enough to warrant a theory, so lets go further back.&lt;/li&gt;\n&lt;li&gt;Wonka knows &lt;strong&gt;every detail&lt;/strong&gt; of Charlie and Grandpa Joe&amp;#39;s time in the Fizzy Lifting Drinks room despite the fact they were alone there and despite the near impossibility of video monitoring in a time when television is as primitive as what we see Mike TV watching.  The Doctor has displayed this kind of omniscience before.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Wonka seems pretty broken up about the whole attempt to hand off the factory.  This, despite his previous omniscience.  Note that we repeatedly see The Doctor avoid &amp;quot;spoilers&amp;quot; of his own life; even though the Doctor knows of moments and facts that are immutable in time, he deliberately avoids knowledge of his own timeline.  Wonka knew Charlie would steel the drinks and the details of the theft, but he was still disappointed at the apparent failure of his plan to pass on his factory.&lt;/li&gt;\n&lt;li&gt;Speaking of omniscience, Wonka is &lt;strong&gt;awfully&lt;/strong&gt; cavalier about the lives of the children in his care.  Augustus nearly drowns, Veruca has coin-flip odds of being burned alive, Violet experiences the worst case of anaphylaxis in medical history, and Mike is literally sent to be stretched on the rack... yet Wonka treats the horror they and their parents experience as a minor inconvenience.  There are a lot of fan theories about this but the idea that Wonka is a time lord and therefore knows their fate (and that they&amp;#39;re all ok... it&amp;#39;s a kids movie) is the most elegant.&lt;br/&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;That takes us to the moment the kids enter the factory.  As the factory is the least interesting part of the story for this theory I&amp;#39;m going to pivot here and tackle the second act of the film -- the finding of the tickets -- in chronological order.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;The first ticket is found by Augustus Gloop in Dusselheim Germany.  As the story is always following Charlie, we learn about this via television news.  At Gloop&amp;#39;s side during the announcement of the ticket&amp;#39;s discovery is Slugworth/Wilkinson.  This is our first real hint of Wonka&amp;#39;s powers -- Slugworth is able to cover the distance between the Wonka factory and Augustus in astonishing time.  Even if the news of the find traveled instantly and Slugworth could be dispatched immediately, he still manages to arrive on sight, assess Augustus, and appears by his side during what seems to be the family&amp;#39;s first press interview with sausages in hand.  That&amp;#39;s amazing turnaround time.&lt;/li&gt;\n&lt;li&gt;The second ticket is found by Violet Beauregarde in the United States.  Like Gloop, we see Violet&amp;#39;s ticket covered in the media.  Like Gloop, Slugworth is on the scene during the initial interview.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;The third ticket is found in the UK by Veruca Salt, or rather one of her father&amp;#39;s employers.  Here we really see the extent of Slugworth&amp;#39;s abilities.  Not only does he beat local media to the punch, he is actually physically present when the ticket is placed in Salt&amp;#39;s hands.  Now, yes, Wonka might have caught wind of Salt&amp;#39;s massive chocolate shucking operation and positioned Slugworth out of a respect for simple statistical probability but for Slugworth to be &lt;strong&gt;inside the factory&lt;/strong&gt; is quite unusual.  We&amp;#39;ll return to this later.&lt;/li&gt;\n&lt;li&gt;The fourth ticket is found by Mike Teavee, again in the USA  Mike is similarly interviewed with Slugworth in the crush of reporters.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;No matter where Slugworth&amp;#39;s base of operations is, if we assume he is traveling from the base to each find he can not manage to be on-scene for all of them in less than 6 hours if traveling by the fastest means of period transportation.  Trans-dimensional travel would make this easier but the real tell is Veruca Salt.  The notion that Slugworth is just sitting about on the factory floor unchallenged by the deeply paranoid Veruca is too much of a stretch.  If Slugworth is to intercept her so close to the ticket&amp;#39;s discovery and in a nominally secure area, he must have both foreknowledge of the ticket and extraordinary ability to travel.  Indeed, foreknowledge is the best explanation of all of these interceptions, especially Charlie&amp;#39;s.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;The fifth ticket is bought by Charlie.  Even if Wonka was cheating and directing tickets to specific municipalities, the exact distribution of both boxes and individual Wonka Bars is out of his control.  He has no way to know if Charlie bought the chocolate bar containing the ticket or not and Charlie takes off at a dead run away from the only people &lt;strong&gt;in the whole world&lt;/strong&gt; who know he&amp;#39;s found it.  Now, here in the 21st century news travels fast but even today you&amp;#39;d be hard-pressed to put together the geolocation of a bunch of people tweeting about &amp;quot;some kid found the last golden ticket,&amp;quot; identify the child from his photo, work out where he lives, and arrange to dramatically intercept him on his way home.  Slugworth not only does that, he knows which buttons to push for Charlie.  He knows Charlie better than his (admittedly stupid) teacher --  who spends hours a day with him and is yet shocked to learn that Charlie doesn&amp;#39;t have money for chocolate --does.&lt;br/&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Finally Act I -- the setup of the film.  Charlie is poor, Wonka runs a chocolate factory, etc.  This is where we&amp;#39;re told &amp;quot;no one ever goes in and no one ever comes out.&amp;quot;  It&amp;#39;s where we learn about the Wonka mystery which is spun out across the rest of the film and provides the most compelling evidence of all.  Because, honestly, without a TARDIS or something else capable of doing some pretty fancy tricks with space, how do you get thousands of bright orange people into a factory in a small town in Europe somewhere without anyone noticing?  &lt;/p&gt;\n\n&lt;p&gt;TL;DR: Wonka has to be a time lord: he and his employees react to things before they can know about them, go places they shouldn&amp;#39;t be able to go, and know supposedly random people in sufficient enough detail to offer them pretty personalized temptation.  Wonka has what is clearly a TARDIS, and managed to smuggle an entire race of aliens into his factory without alerting the small European hamlett in which it sits.  He&amp;#39;s clearly a Time Lord.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "There was a [great post a couple years ago](https://www.reddit.com/r/FanTheories/comments/1bp3bg/willy_wonka_is_the_final_regeneration_of_the/) which details exactly how Willy Wonka acts, sounds, and behaves pretty much like a Time Lord and how in \"The Great Glass Elevator\" we see evidence that he's traveled the length and breadth of the galaxy on less that 40 Altairian Dollars a day.  This is not a recap of that post.  \n\nThis post focuses on the events of the film Willy Wonka and the Chocolate Factory because my youngest son is obsessed with it and I've probably seen it 12 times in the last week.\n\nSo, a brief recap: WWCF takes place in a European town wherein Willy Wonka owns and operates a vast chocolate factory.  Because inheritance law is apparently less complex than windfall taxes, Wonka decides to give his factory to some kid and, in order to arrange for a suitable pool of choices, distributes 5 Golden Tickets in Wonka bars all over the world.  He arranges for his personal assistant, Mr Wilkinson to play the role of an industrial rival \"Arthur Slugworth\" to recruit the children to spy on Wonka.  The film follows the group's adventures in the chocolate factory, ending with Charlie's eventual choosing of Wonka over \"Slugworth\" and thus his winning of the \"grand and glorious prize.\"\n\nAnd none of this is possible unless Wonka is a time-lord.\n\nLet's start from the end of the film and work our way backwards, as that sort of flow seems completely reasonable in this context.  \n\n1. Wonka and Charlie exit the factory, and the film, in a \"Great Glass Elevator\" a flying box of unspecified properties which can travel arbitrarily in space.  Now if that doesn't scream \"TARDIS\" I don't know what does but that's not enough to warrant a theory, so lets go further back.\n2. Wonka knows **every detail** of Charlie and Grandpa Joe's time in the Fizzy Lifting Drinks room despite the fact they were alone there and despite the near impossibility of video monitoring in a time when television is as primitive as what we see Mike TV watching.  The Doctor has displayed this kind of omniscience before.  \n3. Wonka seems pretty broken up about the whole attempt to hand off the factory.  This, despite his previous omniscience.  Note that we repeatedly see The Doctor avoid \"spoilers\" of his own life; even though the Doctor knows of moments and facts that are immutable in time, he deliberately avoids knowledge of his own timeline.  Wonka knew Charlie would steel the drinks and the details of the theft, but he was still disappointed at the apparent failure of his plan to pass on his factory.\n4. Speaking of omniscience, Wonka is **awfully** cavalier about the lives of the children in his care.  Augustus nearly drowns, Veruca has coin-flip odds of being burned alive, Violet experiences the worst case of anaphylaxis in medical history, and Mike is literally sent to be stretched on the rack... yet Wonka treats the horror they and their parents experience as a minor inconvenience.  There are a lot of fan theories about this but the idea that Wonka is a time lord and therefore knows their fate (and that they're all ok... it's a kids movie) is the most elegant.  \n\nThat takes us to the moment the kids enter the factory.  As the factory is the least interesting part of the story for this theory I'm going to pivot here and tackle the second act of the film -- the finding of the tickets -- in chronological order.\n\n1. The first ticket is found by Augustus Gloop in Dusselheim Germany.  As the story is always following Charlie, we learn about this via television news.  At Gloop's side during the announcement of the ticket's discovery is Slugworth/Wilkinson.  This is our first real hint of Wonka's powers -- Slugworth is able to cover the distance between the Wonka factory and Augustus in astonishing time.  Even if the news of the find traveled instantly and Slugworth could be dispatched immediately, he still manages to arrive on sight, assess Augustus, and appears by his side during what seems to be the family's first press interview with sausages in hand.  That's amazing turnaround time.\n3. The second ticket is found by Violet Beauregarde in the United States.  Like Gloop, we see Violet's ticket covered in the media.  Like Gloop, Slugworth is on the scene during the initial interview.   \n3. The third ticket is found in the UK by Veruca Salt, or rather one of her father's employers.  Here we really see the extent of Slugworth's abilities.  Not only does he beat local media to the punch, he is actually physically present when the ticket is placed in Salt's hands.  Now, yes, Wonka might have caught wind of Salt's massive chocolate shucking operation and positioned Slugworth out of a respect for simple statistical probability but for Slugworth to be **inside the factory** is quite unusual.  We'll return to this later.\n4. The fourth ticket is found by Mike Teavee, again in the USA  Mike is similarly interviewed with Slugworth in the crush of reporters.\n\nNo matter where Slugworth's base of operations is, if we assume he is traveling from the base to each find he can not manage to be on-scene for all of them in less than 6 hours if traveling by the fastest means of period transportation.  Trans-dimensional travel would make this easier but the real tell is Veruca Salt.  The notion that Slugworth is just sitting about on the factory floor unchallenged by the deeply paranoid Veruca is too much of a stretch.  If Slugworth is to intercept her so close to the ticket's discovery and in a nominally secure area, he must have both foreknowledge of the ticket and extraordinary ability to travel.  Indeed, foreknowledge is the best explanation of all of these interceptions, especially Charlie's.\n\n5. The fifth ticket is bought by Charlie.  Even if Wonka was cheating and directing tickets to specific municipalities, the exact distribution of both boxes and individual Wonka Bars is out of his control.  He has no way to know if Charlie bought the chocolate bar containing the ticket or not and Charlie takes off at a dead run away from the only people **in the whole world** who know he's found it.  Now, here in the 21st century news travels fast but even today you'd be hard-pressed to put together the geolocation of a bunch of people tweeting about \"some kid found the last golden ticket,\" identify the child from his photo, work out where he lives, and arrange to dramatically intercept him on his way home.  Slugworth not only does that, he knows which buttons to push for Charlie.  He knows Charlie better than his (admittedly stupid) teacher --  who spends hours a day with him and is yet shocked to learn that Charlie doesn't have money for chocolate --does.  \n\nFinally Act I -- the setup of the film.  Charlie is poor, Wonka runs a chocolate factory, etc.  This is where we're told \"no one ever goes in and no one ever comes out.\"  It's where we learn about the Wonka mystery which is spun out across the rest of the film and provides the most compelling evidence of all.  Because, honestly, without a TARDIS or something else capable of doing some pretty fancy tricks with space, how do you get thousands of bright orange people into a factory in a small town in Europe somewhere without anyone noticing?  \n\nTL;DR: Wonka has to be a time lord: he and his employees react to things before they can know about them, go places they shouldn't be able to go, and know supposedly random people in sufficient enough detail to offer them pretty personalized temptation.  Wonka has what is clearly a TARDIS, and managed to smuggle an entire race of aliens into his factory without alerting the small European hamlett in which it sits.  He's clearly a Time Lord.\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65gue5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "Killfile", "saved": false, "mod_reports": [], "name": "t3_65gue5", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65gue5/willy_wonka_is_a_time_lord_part_ii/", "num_reports": null, "locked": false, "stickied": false, "created": 1492252351.0, "url": "https://www.reddit.com/r/FanTheories/comments/65gue5/willy_wonka_is_a_time_lord_part_ii/", "author_flair_text": null, "quarantine": false, "title": "Willy Wonka is a Time Lord (Part II)", "created_utc": 1492223551.0, "distinguished": null, "media": null, "upvote_ratio": 0.69, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65gue5", "likes": null, "replies": "", "user_reports": [], "id": "dgb9ql7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PYROcytle", "parent_id": "t3_65gue5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "What am I doing with my life", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What am I doing with my life&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb9ql7", "score_hidden": false, "stickied": false, "created": 1492323914.0, "created_utc": 1492295114.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]