[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;(EDIT: &amp;quot;Watched the Prequels&amp;quot; is a figure of speech. As far as I know, Luke Skywalker doesn&amp;#39;t have access to DVD box-sets. Cheers!)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In the teaser for &lt;em&gt;The Last Jedi&lt;/em&gt;, Luke states with clear conviction that “it is time for the Jedi to end.” There are a million ways to interpret this. Is Luke turning to the Dark Side? Are the Jedi no more? Where’s Jar-Jar in all this? And while there are multiple theories floating around, only one stands out as particularly compelling: &lt;strong&gt;Luke Skywalker killed Rey’s father.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Also, he &lt;strong&gt;totally watched the prequels.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;At the end of &lt;em&gt;Return of the Jedi&lt;/em&gt;, we see Luke resist the temptation to turn to the dark side – by rejecting fury and embracing composure, Skywalker musters the fortitude to rebuke the Emperor, redeem his father, and catalyze the collapse of the Galactic Empire. And while this attitude wins the day and cements Luke’s status as a true Jedi Knight, it is the same attitude that led to the Order’s collapse in the Prequel Trilogy. &lt;/p&gt;\n\n&lt;p&gt;As we saw in &lt;em&gt;Revenge of the Sith&lt;/em&gt;, a taciturn, emotionless outlook will eventually create outliers (Anakin, Dooku, and, to an extent, Qui-Gon Jinn) who resort to extreme and sometimes violent means to reprimand that outlook for personal gain. Say what you will about the Prequel Trilogy, but Lucas had a clear design in portraying the Jedi as staunch, out-of-touch monks – what many saw as poor writing was an admittedly flawed articulation of the notion that Jedi ideals were incompatible with human nature. The Jedi didn’t fail because of Palpatine; they failed because they’d grown beholden to archaic notions of good and evil.&lt;/p&gt;\n\n&lt;p&gt;We’ll get back to this is a minute. Right now, let’s focus on Rey.&lt;/p&gt;\n\n&lt;p&gt;Fast-forward to a Post-&lt;em&gt;Jedi&lt;/em&gt; world. Together with the Alliance, Luke helps sweep the galaxy for remnants of the Galactic Empire. He’s a badass Jedi, doing what badass Jedi do: punishing evil and restoring order. In &lt;em&gt;Jedi&lt;/em&gt;, we saw him carve through Jabba’s henchman like paper – here, he’s a young, Force-wielding knight at the peak of his power. Topple one dictator and the whole thing goes right to your head, so it’s easy to imagine Luke becoming just a mite sanctimonious.&lt;/p&gt;\n\n&lt;p&gt;But that self-righteous attitude blows up in his face when, at some point, he kills an Imperial. The Imperial himself doesn’t really matter. All that matters is that he has a baby, and that baby is now an orphan. Rather than leave this child to a life of poverty and sunset-staring, Luke does what any reasonable, guilt-stricken person would do: he adopts this baby as his own, names it Rey, and says, “You will be better than me.” And together with Rey, Luke Skywalker retires from war and starts a brand-new Jedi academy.&lt;/p&gt;\n\n&lt;p&gt;As he watches the child grow, he realizes that every Imperial he’s ever killed was a person – he hasn’t been cutting through heartless meat, he’s been slaughtering either drafted soldiers or conscripted orphans. People with homes, histories, families. People with stories. This forces him to question the binary ideals of good and evil as taught by the Jedi. For the first time, Luke Skywalker starts to wonder if he is, in fact, the asshole.&lt;/p&gt;\n\n&lt;p&gt;Take Finn. A bumbling, generally well-meaning kid who was conscripted into the First Order at a young age. Regarding Finn’s opinion of Luke, Boyega flat-out says that someone like Skywalker would be seen as a terrorist from Finn’s perspective: “For Finn, he’s been raised from the ashes of the Empire. He’s been taught about Luke Skywalker, he knows about his history. For him it’s like joining the army and then learning about one of the great enemies of your country.” Having blown up two Death Stars &lt;em&gt;filled with people like Finn&lt;/em&gt;, Luke is admittedly upset with the notion of moral relativism. The seeds have been planted. In killing Rey’s father, Luke has opened a door inside his head: a door marked &lt;strong&gt;Maybe the Jedi had it wrong.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;But this soul-searching comes too late, and the rigid code of the Jedi good-and-evil binary bites him in the ass when his nephew, Ben, hits puberty. All his life, Ben has heard nothing but “there is Good and there is Evil and never the twain shall meet.” So rather than dealing with his darker instincts like a mentally healthy person would do, he decides to go all-in and embrace them. He becomes Kylo Ren, an embodiment of rage, anger, and blind destruction – he’s a &lt;em&gt;Weird Al&lt;/em&gt; parody of the Sith, mimicking the boogeymen his uncle warned him about. Here, we have another Anakin: someone so fed up with the restrictive dogma of the Jedi that he embraces their ideological opposite in the worst possible way.&lt;/p&gt;\n\n&lt;p&gt;So Kylo slaughters his Jedi classmates, as one does. While &lt;em&gt;Star Wars&lt;/em&gt; isn’t exactly the appropriate venue for a school shooting metaphor, this is exactly how it plays out in the flashback as depicted in &lt;em&gt;The Force Awakens&lt;/em&gt; - a handful of black-clad outcasts carving through their peers as &lt;em&gt;The Darth Plagueis Mixtape&lt;/em&gt; blares over the intercom. Kylo Ren’s Vader-like outfit isn’t just a sign of reverence to his fallen grandfather – it’s a symbol that the cycle has repeated and the Jedi’s staunch ideology has once again produced unspeakable violence.&lt;/p&gt;\n\n&lt;p&gt;But then Kylo happens upon Rey – a child, a friend, his cousin in all but name. And rather than kill her, Kylo holds his nose and does the unthinkable: he compromises. He wipes her mind and drops her off on Jakku. Remember the flashback in &lt;em&gt;The Force Awakens&lt;/em&gt;? Even as Rey screams “Come back!” to the fleeing starship, Kylo Ren sits onboard and facetimes Snoke about how he &lt;em&gt;totally&lt;/em&gt; slaughtered his cousin and how it was “so fucking badass and evil, I swear.” This momentary indiscretion eats at him, and it’s why he’s so eager to impale his father the first chance he gets – remember, he’s embraced the idea that you must be either entirely good or entirely evil. Saving a little girl from the pale space-scrotum (Snoke) is decidedly not-evil, so Kylo has been longing for a way to balance to scales.&lt;/p&gt;\n\n&lt;p&gt;And so Rey, blind to her abilities, spends ten years screwing around on Jakku as her Jedi powers lie dormant, waiting to be unleashed. By chance, she happens upon a BB-8 unit carrying vital information, and the subsequent events made $2 billion at the box office.&lt;/p&gt;\n\n&lt;p&gt;Luke, meanwhile, realizes that adhering to the dogmatic principles of the Jedi has created catastrophe yet again. Worst of all, he was in the perfect position to stop it, and failed. So he retreats, in exile and in shame, to die alone as the last of the Jedi. And after spending ten-or-so years jerking off to erotically-shaped rocks, imagine Luke’s surprise when his long-dead-not-daughter shows up and hands him his father’s lightsaber.&lt;/p&gt;\n\n&lt;p&gt;Luke has a miracle on hands: one last chance to get it right. So what’s the first lesson for Rey? &lt;strong&gt;“It is time for the Jedi to end”&lt;/strong&gt; – and, by extension, their archaic conception of good and evil. Luke is one-hundred percent done with this shit, and his design for Rey is imperative: in order to amend the mistakes of the past, he must teach her to look beyond the Jedi code and carve out a new path for future generations. To do that, he has to tell her the truth about her past – he must dash her hopes against the rocks and make her hate him.&lt;/p&gt;\n\n&lt;p&gt;The revelation in &lt;em&gt;The Empire Strikes Back&lt;/em&gt; turned the Original Trilogy on its head – it flipped the narrative from “Darth Vader must be destroyed” to “Darth Vader must be saved.” It opened doors previously unthinkable, and &lt;em&gt;The Last Jedi&lt;/em&gt; might just pull off the same trick. Here, the revelation is infinitely more complicated – we learn that Luke’s relationship with Rey is not one of love and fatherhood, but of murder and guilt. Rey will have to wrestle with the complexity of that relationship and the complexity within herself if she is to become the first in a new generation of Force-wielders: a generation that is not beholden to the rage of the Sith or the staunchness of the Jedi, but rather to a serenity that arises only from embracing the intricacy of human emotion and acknowledging the fundamental truth that we are all composed of instincts both dark and benevolent. &lt;/p&gt;\n\n&lt;p&gt;It is time for the Jedi to end – and something new, led by Rey, to begin.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; Luke killed Rey’s father and felt guilty about it. Also, the series is taking a step away from the black-and-white morality of the original trilogy and embracing a more complex evaluation of human emotion. The Prequels are still bad.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**(EDIT: \"Watched the Prequels\" is a figure of speech. As far as I know, Luke Skywalker doesn't have access to DVD box-sets. Cheers!)**\n\nIn the teaser for *The Last Jedi*, Luke states with clear conviction that “it is time for the Jedi to end.” There are a million ways to interpret this. Is Luke turning to the Dark Side? Are the Jedi no more? Where’s Jar-Jar in all this? And while there are multiple theories floating around, only one stands out as particularly compelling: **Luke Skywalker killed Rey’s father.**\n\nAlso, he **totally watched the prequels.**\n\nAt the end of *Return of the Jedi*, we see Luke resist the temptation to turn to the dark side – by rejecting fury and embracing composure, Skywalker musters the fortitude to rebuke the Emperor, redeem his father, and catalyze the collapse of the Galactic Empire. And while this attitude wins the day and cements Luke’s status as a true Jedi Knight, it is the same attitude that led to the Order’s collapse in the Prequel Trilogy. \n\nAs we saw in *Revenge of the Sith*, a taciturn, emotionless outlook will eventually create outliers (Anakin, Dooku, and, to an extent, Qui-Gon Jinn) who resort to extreme and sometimes violent means to reprimand that outlook for personal gain. Say what you will about the Prequel Trilogy, but Lucas had a clear design in portraying the Jedi as staunch, out-of-touch monks – what many saw as poor writing was an admittedly flawed articulation of the notion that Jedi ideals were incompatible with human nature. The Jedi didn’t fail because of Palpatine; they failed because they’d grown beholden to archaic notions of good and evil.\n\nWe’ll get back to this is a minute. Right now, let’s focus on Rey.\n\nFast-forward to a Post-*Jedi* world. Together with the Alliance, Luke helps sweep the galaxy for remnants of the Galactic Empire. He’s a badass Jedi, doing what badass Jedi do: punishing evil and restoring order. In *Jedi*, we saw him carve through Jabba’s henchman like paper – here, he’s a young, Force-wielding knight at the peak of his power. Topple one dictator and the whole thing goes right to your head, so it’s easy to imagine Luke becoming just a mite sanctimonious.\n\nBut that self-righteous attitude blows up in his face when, at some point, he kills an Imperial. The Imperial himself doesn’t really matter. All that matters is that he has a baby, and that baby is now an orphan. Rather than leave this child to a life of poverty and sunset-staring, Luke does what any reasonable, guilt-stricken person would do: he adopts this baby as his own, names it Rey, and says, “You will be better than me.” And together with Rey, Luke Skywalker retires from war and starts a brand-new Jedi academy.\n\nAs he watches the child grow, he realizes that every Imperial he’s ever killed was a person – he hasn’t been cutting through heartless meat, he’s been slaughtering either drafted soldiers or conscripted orphans. People with homes, histories, families. People with stories. This forces him to question the binary ideals of good and evil as taught by the Jedi. For the first time, Luke Skywalker starts to wonder if he is, in fact, the asshole.\n\nTake Finn. A bumbling, generally well-meaning kid who was conscripted into the First Order at a young age. Regarding Finn’s opinion of Luke, Boyega flat-out says that someone like Skywalker would be seen as a terrorist from Finn’s perspective: “For Finn, he’s been raised from the ashes of the Empire. He’s been taught about Luke Skywalker, he knows about his history. For him it’s like joining the army and then learning about one of the great enemies of your country.” Having blown up two Death Stars *filled with people like Finn*, Luke is admittedly upset with the notion of moral relativism. The seeds have been planted. In killing Rey’s father, Luke has opened a door inside his head: a door marked **Maybe the Jedi had it wrong.**\n\nBut this soul-searching comes too late, and the rigid code of the Jedi good-and-evil binary bites him in the ass when his nephew, Ben, hits puberty. All his life, Ben has heard nothing but “there is Good and there is Evil and never the twain shall meet.” So rather than dealing with his darker instincts like a mentally healthy person would do, he decides to go all-in and embrace them. He becomes Kylo Ren, an embodiment of rage, anger, and blind destruction – he’s a *Weird Al* parody of the Sith, mimicking the boogeymen his uncle warned him about. Here, we have another Anakin: someone so fed up with the restrictive dogma of the Jedi that he embraces their ideological opposite in the worst possible way.\n\nSo Kylo slaughters his Jedi classmates, as one does. While *Star Wars* isn’t exactly the appropriate venue for a school shooting metaphor, this is exactly how it plays out in the flashback as depicted in *The Force Awakens* - a handful of black-clad outcasts carving through their peers as *The Darth Plagueis Mixtape* blares over the intercom. Kylo Ren’s Vader-like outfit isn’t just a sign of reverence to his fallen grandfather – it’s a symbol that the cycle has repeated and the Jedi’s staunch ideology has once again produced unspeakable violence.\n\nBut then Kylo happens upon Rey – a child, a friend, his cousin in all but name. And rather than kill her, Kylo holds his nose and does the unthinkable: he compromises. He wipes her mind and drops her off on Jakku. Remember the flashback in *The Force Awakens*? Even as Rey screams “Come back!” to the fleeing starship, Kylo Ren sits onboard and facetimes Snoke about how he *totally* slaughtered his cousin and how it was “so fucking badass and evil, I swear.” This momentary indiscretion eats at him, and it’s why he’s so eager to impale his father the first chance he gets – remember, he’s embraced the idea that you must be either entirely good or entirely evil. Saving a little girl from the pale space-scrotum (Snoke) is decidedly not-evil, so Kylo has been longing for a way to balance to scales.\n\nAnd so Rey, blind to her abilities, spends ten years screwing around on Jakku as her Jedi powers lie dormant, waiting to be unleashed. By chance, she happens upon a BB-8 unit carrying vital information, and the subsequent events made $2 billion at the box office.\n\nLuke, meanwhile, realizes that adhering to the dogmatic principles of the Jedi has created catastrophe yet again. Worst of all, he was in the perfect position to stop it, and failed. So he retreats, in exile and in shame, to die alone as the last of the Jedi. And after spending ten-or-so years jerking off to erotically-shaped rocks, imagine Luke’s surprise when his long-dead-not-daughter shows up and hands him his father’s lightsaber.\n\nLuke has a miracle on hands: one last chance to get it right. So what’s the first lesson for Rey? **“It is time for the Jedi to end”** – and, by extension, their archaic conception of good and evil. Luke is one-hundred percent done with this shit, and his design for Rey is imperative: in order to amend the mistakes of the past, he must teach her to look beyond the Jedi code and carve out a new path for future generations. To do that, he has to tell her the truth about her past – he must dash her hopes against the rocks and make her hate him.\n\nThe revelation in *The Empire Strikes Back* turned the Original Trilogy on its head – it flipped the narrative from “Darth Vader must be destroyed” to “Darth Vader must be saved.” It opened doors previously unthinkable, and *The Last Jedi* might just pull off the same trick. Here, the revelation is infinitely more complicated – we learn that Luke’s relationship with Rey is not one of love and fatherhood, but of murder and guilt. Rey will have to wrestle with the complexity of that relationship and the complexity within herself if she is to become the first in a new generation of Force-wielders: a generation that is not beholden to the rage of the Sith or the staunchness of the Jedi, but rather to a serenity that arises only from embracing the intricacy of human emotion and acknowledging the fundamental truth that we are all composed of instincts both dark and benevolent. \n\nIt is time for the Jedi to end – and something new, led by Rey, to begin.\n\n**TL;DR:** Luke killed Rey’s father and felt guilty about it. Also, the series is taking a step away from the black-and-white morality of the original trilogy and embracing a more complex evaluation of human emotion. The Prequels are still bad.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65iyjh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1524, "report_reasons": null, "author": "The_Jedi_Hunter", "saved": false, "mod_reports": [], "name": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": 1492277892.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65iyjh/luke_killed_reys_father_watched_the_prequels_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492290069.0, "url": "https://www.reddit.com/r/FanTheories/comments/65iyjh/luke_killed_reys_father_watched_the_prequels_and/", "author_flair_text": null, "quarantine": false, "title": "Luke killed Rey’s father, watched the Prequels, and decided that it is time for the Jedi to end", "created_utc": 1492261269.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 163, "visited": false, "subreddit_type": "public", "ups": 1524}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbujj4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Blandon_So_Cool", "parent_id": "t1_dgbnclj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Who's fucking with my medicine!?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who&amp;#39;s fucking with my medicine!?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbujj4", "score_hidden": false, "stickied": false, "created": 1492359746.0, "created_utc": 1492330946.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnclj", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "waywardwoodwork", "parent_id": "t1_dgaxne0", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Where's my pizza rooolllll??", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where&amp;#39;s my pizza rooolllll??&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbnclj", "score_hidden": false, "stickied": false, "created": 1492343779.0, "created_utc": 1492314979.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxne0", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "Heelincal", "parent_id": "t1_dgawawm", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "What's wrong with your faaaaaaaaaceee", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s wrong with your faaaaaaaaaceee&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgaxne0", "score_hidden": false, "stickied": false, "created": 1492307379.0, "created_utc": 1492278579.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgawvwv", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "blueheeler", "parent_id": "t1_dgawawm", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "OMG are you TS Eliot? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OMG are you TS Eliot? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgawvwv", "score_hidden": false, "stickied": false, "created": 1492306344.0, "created_utc": 1492277544.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbfg0u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "IcyLemonZ", "parent_id": "t1_dgawawm", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Gungas", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gungas&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbfg0u", "score_hidden": false, "stickied": false, "created": 1492332118.0, "created_utc": 1492303318.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawawm", "gilded": 0, "archived": false, "score": 60, "report_reasons": null, "author": "underthegod", "parent_id": "t1_dgas9tq", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Goongas.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Goongas.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgawawm", "score_hidden": false, "stickied": false, "created": 1492305551.0, "created_utc": 1492276751.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 60}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb8tyl", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "SyncProgram", "parent_id": "t1_dgas9tq", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "It rhymes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It rhymes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb8tyl", "score_hidden": false, "stickied": false, "created": 1492322632.0, "created_utc": 1492293832.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgas9tq", "gilded": 0, "archived": false, "score": 194, "report_reasons": null, "author": "blueheeler", "parent_id": "t1_dgarqdx", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "It's like poetry. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s like poetry. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgas9tq", "score_hidden": false, "stickied": false, "created": 1492299947.0, "created_utc": 1492271147.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 194}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgdzlfl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheFriffin", "parent_id": "t1_dgcok3j", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "\"And Finn is your brother!\"\n\n\"That's... improbable?\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;And Finn is your brother!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;That&amp;#39;s... improbable?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdzlfl", "score_hidden": false, "stickied": false, "created": 1492486529.0, "created_utc": 1492457729.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcok3j", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "humblevladimirthegr8", "parent_id": "t1_dgb81e8", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Nooooooooooooooo! That's impoosssibllle!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nooooooooooooooo! That&amp;#39;s impoosssibllle!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcok3j", "score_hidden": false, "stickied": false, "created": 1492410615.0, "created_utc": 1492381815.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb81e8", "gilded": 0, "archived": false, "score": 88, "report_reasons": null, "author": "sexyBobaFett", "parent_id": "t1_dgarqdx", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Han Solo never told you what happened to your father. \n\nHe told me enough. He told me it was you. \n\nNo. I killed your father. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Han Solo never told you what happened to your father. &lt;/p&gt;\n\n&lt;p&gt;He told me enough. He told me it was you. &lt;/p&gt;\n\n&lt;p&gt;No. I killed your father. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb81e8", "score_hidden": false, "stickied": false, "created": 1492321529.0, "created_utc": 1492292729.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 88}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgc3ias", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Wanntanamo", "parent_id": "t1_dgbqiat", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Obviously, but the idea of the toughest boss duo from Dark Souls randomly dropping in is hilarious. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Obviously, but the idea of the toughest boss duo from Dark Souls randomly dropping in is hilarious. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc3ias", "score_hidden": false, "stickied": false, "created": 1492382553.0, "created_utc": 1492353753.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbqiat", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MinodRP", "parent_id": "t1_dgb9337", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think it's a Princess Bride reference. \n\n\"My name is Inigo Montoya, you killed my father, prepare to die.\"\n\nThough I like the way you think. *Praise the fucking sun*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s a Princess Bride reference. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;My name is Inigo Montoya, you killed my father, prepare to die.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Though I like the way you think. &lt;em&gt;Praise the fucking sun&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbqiat", "score_hidden": false, "stickied": false, "created": 1492349393.0, "created_utc": 1492320593.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb9337", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Scantcobra", "parent_id": "t1_dgat21i", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Ornstein and Smough out of nowhere.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ornstein and Smough out of nowhere.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb9337", "score_hidden": false, "stickied": false, "created": 1492322989.0, "created_utc": 1492294189.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgat21i", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "Fortanono", "parent_id": "t1_dgarqdx", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Prepare to die.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Prepare to die.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgat21i", "score_hidden": false, "stickied": false, "created": 1492301039.0, "created_utc": 1492272239.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbt7gu", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "HORSEBLUES", "parent_id": "t1_dgbsuer", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yeah fair enough.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah fair enough.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbt7gu", "score_hidden": false, "stickied": false, "created": 1492355831.0, "created_utc": 1492327031.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgcg0fj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TeutonJon78", "parent_id": "t1_dgcfyvd", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Sure, but they put him under full face make-up. No so much with Obi-Wan/Anakin.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure, but they put him under full face make-up. No so much with Obi-Wan/Anakin.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcg0fj", "score_hidden": false, "stickied": false, "created": 1492399433.0, "created_utc": 1492370633.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfyvd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "coollia", "parent_id": "t1_dgc8spo", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The Emperor's actor, Ian McDiarmid, was in his thirties when ROTJ was filmed. His *thirties*.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Emperor&amp;#39;s actor, Ian McDiarmid, was in his thirties when ROTJ was filmed. His &lt;em&gt;thirties&lt;/em&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcfyvd", "score_hidden": false, "stickied": false, "created": 1492399375.0, "created_utc": 1492370575.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8spo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TeutonJon78", "parent_id": "t1_dgc6zla", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yeah, I wish Lucas could have kept up with his timeline a little better. Although it would make Luke a little more problematic being 19 with an implied much older father. Making Obi-Wan and Anakin much younger in the prequels makes them both seem WAY too old in the OT then.\n\nI mean Vader is supposed to be like 46 or something in ROTJ, but they had like a 77-78 year old actor playing him. Alec Guinness was  9 years younger than Sebastian Shaw, so the actual ages are just WAY WAY off from the characters' ret-conned ages.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I wish Lucas could have kept up with his timeline a little better. Although it would make Luke a little more problematic being 19 with an implied much older father. Making Obi-Wan and Anakin much younger in the prequels makes them both seem WAY too old in the OT then.&lt;/p&gt;\n\n&lt;p&gt;I mean Vader is supposed to be like 46 or something in ROTJ, but they had like a 77-78 year old actor playing him. Alec Guinness was  9 years younger than Sebastian Shaw, so the actual ages are just WAY WAY off from the characters&amp;#39; ret-conned ages.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc8spo", "score_hidden": false, "stickied": false, "created": 1492389894.0, "created_utc": 1492361094.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6zla", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "InconsiderateBastard", "parent_id": "t1_dgbsuer", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "And obi wan looked REALLY old for his age. The guy read supposed to be 56? \n\nOr at least they retconned him to be 56.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And obi wan looked REALLY old for his age. The guy read supposed to be 56? &lt;/p&gt;\n\n&lt;p&gt;Or at least they retconned him to be 56.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc6zla", "score_hidden": false, "stickied": false, "created": 1492387490.0, "created_utc": 1492358690.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbsuer", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "TeutonJon78", "parent_id": "t1_dgberje", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think part of it is that Alec Guiness also looked old for his age.", "edited": 1492360655.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think part of it is that Alec Guiness also looked old for his age.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbsuer", "score_hidden": false, "stickied": false, "created": 1492354839.0, "created_utc": 1492326039.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgberje", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "HORSEBLUES", "parent_id": "t1_dgb8hyd", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Holy shit, Mark Hamill looks really good for his age.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit, Mark Hamill looks really good for his age.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgberje", "score_hidden": false, "stickied": false, "created": 1492331121.0, "created_utc": 1492302321.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb8hyd", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "InconsiderateBastard", "parent_id": "t1_dgb5y0j", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Luke is older than obi wan was. And Mark Hamill is older than Alec Guinness was.   \n\nEdit: My mistake. Luke is a couple years younger than obi wan was. But he's close. And Mark Hamill is older than Alec Guinness was.", "edited": 1492293563.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Luke is older than obi wan was. And Mark Hamill is older than Alec Guinness was.   &lt;/p&gt;\n\n&lt;p&gt;Edit: My mistake. Luke is a couple years younger than obi wan was. But he&amp;#39;s close. And Mark Hamill is older than Alec Guinness was.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb8hyd", "score_hidden": false, "stickied": false, "created": 1492322161.0, "created_utc": 1492293361.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbfql8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Rootbeer128", "parent_id": "t1_dgb5y0j", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt;He snot ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;He snot &lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbfql8", "score_hidden": false, "stickied": false, "created": 1492332524.0, "created_utc": 1492303724.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5y0j", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "mybustersword", "parent_id": "t1_dgarqdx", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I still think Luke has to die and will sacrifice himself the same way Obi Wan did, or die the way Yoda did. Hesnot that old tho", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I still think Luke has to die and will sacrifice himself the same way Obi Wan did, or die the way Yoda did. Hesnot that old tho&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb5y0j", "score_hidden": false, "stickied": false, "created": 1492318624.0, "created_utc": 1492289824.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgaxinv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aqua_zesty_man", "parent_id": "t1_dgarqdx", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "After he betrayed him...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;After he betrayed him...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgaxinv", "score_hidden": false, "stickied": false, "created": 1492307201.0, "created_utc": 1492278401.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgarqdx", "gilded": 0, "archived": false, "score": 783, "report_reasons": null, "author": "Grantixtechno", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Rey will ask \"Are you my father?\"\n\nAnd Luke will say, \"No, I killed your father.\"\n\nIn a poetic reversal of Empire.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rey will ask &amp;quot;Are you my father?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And Luke will say, &amp;quot;No, I killed your father.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;In a poetic reversal of Empire.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgarqdx", "score_hidden": false, "stickied": false, "created": 1492299184.0, "created_utc": 1492270384.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 783}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbf8kh", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "_YouDontKnowMe_", "parent_id": "t1_dgbbztq", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "https://media.makeameme.org/created/r2d2-you-da.jpg", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://media.makeameme.org/created/r2d2-you-da.jpg\"&gt;https://media.makeameme.org/created/r2d2-you-da.jpg&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbf8kh", "score_hidden": false, "stickied": false, "created": 1492331820.0, "created_utc": 1492303020.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbztq", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "omgdude29", "parent_id": "t1_dgb35re", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "R2 is the real MVP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;R2 is the real MVP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbbztq", "score_hidden": false, "stickied": false, "created": 1492327220.0, "created_utc": 1492298420.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbnh7d", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "waywardwoodwork", "parent_id": "t1_dgb35re", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Hey R2, what happened after order 66? \n\n\"Beep boop beep beep booop\"\n\nYou're a real asshole, R2.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey R2, what happened after order 66? &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Beep boop beep beep booop&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re a real asshole, R2.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbnh7d", "score_hidden": false, "stickied": false, "created": 1492343992.0, "created_utc": 1492315192.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb35re", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "Errk_fu", "parent_id": "t1_dgau9f1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Or he just asked R2 ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or he just asked R2 &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb35re", "score_hidden": false, "stickied": false, "created": 1492314813.0, "created_utc": 1492286013.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 58}}], "after": null, "before": null}}, "user_reports": [], "id": "dgau9f1", "gilded": 0, "archived": false, "score": 79, "report_reasons": null, "author": "cartelstre", "parent_id": "t1_dgatv9d", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Jedi Temples, archives, talking creatures? Hell Star Wars Rebels has all of these. Showing they exist after order 66.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jedi Temples, archives, talking creatures? Hell Star Wars Rebels has all of these. Showing they exist after order 66.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgau9f1", "score_hidden": false, "stickied": false, "created": 1492302720.0, "created_utc": 1492273920.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 79}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbldho", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "girlsgoneoscarwilde", "parent_id": "t1_dgbi574", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "*shakes head, laughing*\n\n*etches one more point in the \"Notches\" Bracket*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;shakes head, laughing&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;etches one more point in the &amp;quot;Notches&amp;quot; Bracket&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbldho", "score_hidden": false, "stickied": false, "created": 1492340728.0, "created_utc": 1492311928.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbnirg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "waywardwoodwork", "parent_id": "t1_dgbi574", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "And if you don't use it you're streets behind!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And if you don&amp;#39;t use it you&amp;#39;re streets behind!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbnirg", "score_hidden": false, "stickied": false, "created": 1492344060.0, "created_utc": 1492315260.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgcc6os", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TronZbot", "parent_id": "t1_dgc0pq3", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "You people make no cents.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You people make no cents.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcc6os", "score_hidden": false, "stickied": false, "created": 1492394318.0, "created_utc": 1492365518.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0pq3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nykoload", "parent_id": "t1_dgbzux8", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Trying? Haha. Coined and minted. Been there coined that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trying? Haha. Coined and minted. Been there coined that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc0pq3", "score_hidden": false, "stickied": false, "created": 1492377794.0, "created_utc": 1492348994.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbzux8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "grevemoeskr", "parent_id": "t1_dgbi574", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Stop trying to coin \"streets ahead\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop trying to coin &amp;quot;streets ahead&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbzux8", "score_hidden": false, "stickied": false, "created": 1492376048.0, "created_utc": 1492347248.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbi574", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Nykoload", "parent_id": "t1_dgb41kx", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "And it's streets ahead!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And it&amp;#39;s streets ahead!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbi574", "score_hidden": false, "stickied": false, "created": 1492335973.0, "created_utc": 1492307173.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbmnx7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "JawnZ", "parent_id": "t1_dgbmg4y", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I need to find a way to use this argument on a daily basis...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I need to find a way to use this argument on a daily basis...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbmnx7", "score_hidden": false, "stickied": false, "created": 1492342703.0, "created_utc": 1492313903.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbmg4y", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Sturgeon_Genital", "parent_id": "t1_dgb41kx", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": " The guy who invented the GIF pronounces it JIF, and he's wrong. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The guy who invented the GIF pronounces it JIF, and he&amp;#39;s wrong. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbmg4y", "score_hidden": false, "stickied": false, "created": 1492342379.0, "created_utc": 1492313579.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbyjr6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "schmuck-in-plaid", "parent_id": "t1_dgb41kx", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "At least it's not nickelback", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At least it&amp;#39;s not nickelback&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbyjr6", "score_hidden": false, "stickied": false, "created": 1492372842.0, "created_utc": 1492344042.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb41kx", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "JawnZ", "parent_id": "t1_dgb17ue", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The producers call it that, they coined the phrase", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The producers call it that, they coined the phrase&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb41kx", "score_hidden": false, "stickied": false, "created": 1492316043.0, "created_utc": 1492287243.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb44fb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "megatom0", "parent_id": "t1_dgb17ue", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I believe that is the accepted name for it, I didn't come up with it, I'm not trying to push it, it's just what people have called it since the film came out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe that is the accepted name for it, I didn&amp;#39;t come up with it, I&amp;#39;m not trying to push it, it&amp;#39;s just what people have called it since the film came out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb44fb", "score_hidden": false, "stickied": false, "created": 1492316149.0, "created_utc": 1492287349.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb17ue", "gilded": 0, "archived": false, "score": -18, "report_reasons": null, "author": "Sturgeon_Genital", "parent_id": "t1_dgawkm3", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Stop trying to make \"forceback\" a thing", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop trying to make &amp;quot;forceback&amp;quot; a thing&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb17ue", "score_hidden": false, "stickied": false, "created": 1492312224.0, "created_utc": 1492283424.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -18}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawkm3", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "megatom0", "parent_id": "t1_dgatv9d", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think OP is right he actually watched the prequels. Rey watched a part of Empire Strikes Back in her forceback, so its possible baby. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think OP is right he actually watched the prequels. Rey watched a part of Empire Strikes Back in her forceback, so its possible baby. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgawkm3", "score_hidden": false, "stickied": false, "created": 1492305918.0, "created_utc": 1492277118.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgaxmzk", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "aqua_zesty_man", "parent_id": "t1_dgatv9d", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yoda says in ESB that the Force can be used to remote view the past and old friends, long gone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yoda says in ESB that the Force can be used to remote view the past and old friends, long gone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgaxmzk", "score_hidden": false, "stickied": false, "created": 1492307364.0, "created_utc": 1492278564.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgatv9d", "gilded": 0, "archived": false, "score": 224, "report_reasons": null, "author": "AntAir267", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Everyone's getting caught up on the phrasing \"watching the prequels,\" but OP definitely means Luke learned the history and downfall of the Jedi, probably through force ghosts or other means.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone&amp;#39;s getting caught up on the phrasing &amp;quot;watching the prequels,&amp;quot; but OP definitely means Luke learned the history and downfall of the Jedi, probably through force ghosts or other means.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgatv9d", "score_hidden": false, "stickied": false, "created": 1492302173.0, "created_utc": 1492273373.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 224}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbjade", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "RationalMango", "parent_id": "t1_dgb54lh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Everything changed when the Droid army attacked. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything changed when the Droid army attacked. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbjade", "score_hidden": false, "stickied": false, "created": 1492337661.0, "created_utc": 1492308861.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb54lh", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "boojieboy", "parent_id": "t1_dgawhxo", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Don't go there. You will unleash unspeakable shitposts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t go there. You will unleash unspeakable shitposts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb54lh", "score_hidden": false, "stickied": false, "created": 1492317518.0, "created_utc": 1492288718.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgccbtf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TronZbot", "parent_id": "t1_dgb7ml2", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Sometimes its better to just walk away.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes its better to just walk away.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgccbtf", "score_hidden": false, "stickied": false, "created": 1492394505.0, "created_utc": 1492365705.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7ml2", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "snowman92", "parent_id": "t1_dgawhxo", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Is this what makes a man choose neutral?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is this what makes a man choose neutral?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb7ml2", "score_hidden": false, "stickied": false, "created": 1492320961.0, "created_utc": 1492292161.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawhxo", "gilded": 0, "archived": false, "score": 82, "report_reasons": null, "author": "GrooveCity", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "So Rey must become the Avatar, master of all 2 sides of the force! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So Rey must become the Avatar, master of all 2 sides of the force! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgawhxo", "score_hidden": false, "stickied": false, "created": 1492305821.0, "created_utc": 1492277021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 82}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb208w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AlvinBlah", "parent_id": "t1_dgb0tgw", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "If the Foundation, and Galactica could find Earth...Why not Luke?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the Foundation, and Galactica could find Earth...Why not Luke?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb208w", "score_hidden": false, "stickied": false, "created": 1492313269.0, "created_utc": 1492284469.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb1nmj", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "bobthegoon89", "parent_id": "t1_dgb0tgw", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "And surely it would take him a long time to get here", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And surely it would take him a long time to get here&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb1nmj", "score_hidden": false, "stickied": false, "created": 1492312801.0, "created_utc": 1492284001.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb0tgw", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "JD-King", "parent_id": "t1_dgaui5p", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "But its so far far away", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But its so far far away&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb0tgw", "score_hidden": false, "stickied": false, "created": 1492311704.0, "created_utc": 1492282904.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb6o55", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "LeakyLycanthrope", "parent_id": "t1_dgaui5p", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Here it is, sir! Spaceballs: The Movie!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here it is, sir! Spaceballs: The Movie!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb6o55", "score_hidden": false, "stickied": false, "created": 1492319644.0, "created_utc": 1492290844.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaui5p", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "generalecchi", "parent_id": "t1_dgas1zi", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I'm pretty sure he just need to swing by on Earth and get some copy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty sure he just need to swing by on Earth and get some copy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgaui5p", "score_hidden": false, "stickied": false, "created": 1492303068.0, "created_utc": 1492274268.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb4gr8", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "schloopers", "parent_id": "t1_dgb30jf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Not R2, only C3PO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not R2, only C3PO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb4gr8", "score_hidden": false, "stickied": false, "created": 1492316613.0, "created_utc": 1492287813.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb30jf", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Fuzzy-Hat", "parent_id": "t1_dgay0to", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think R2 and 3PO were memory wiped at the end of Episode III", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think R2 and 3PO were memory wiped at the end of Episode III&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb30jf", "score_hidden": false, "stickied": false, "created": 1492314616.0, "created_utc": 1492285816.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgay0to", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "speedyrgon", "parent_id": "t1_dgas1zi", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I mean R2 was also there for a large amount of it and probably has recordings in his databanks.  Plus R2 feeling guilty for showing him that before he disappears could explain his odd shutdown in Force Awakens.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean R2 was also there for a large amount of it and probably has recordings in his databanks.  Plus R2 feeling guilty for showing him that before he disappears could explain his odd shutdown in Force Awakens.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgay0to", "score_hidden": false, "stickied": false, "created": 1492307891.0, "created_utc": 1492279091.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbx1z6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lord_Blathoxi", "parent_id": "t1_dgbulvd", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I only saw it once. Forgive me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I only saw it once. Forgive me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbx1z6", "score_hidden": false, "stickied": false, "created": 1492368305.0, "created_utc": 1492339505.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbulvd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Blandon_So_Cool", "parent_id": "t1_dgb20yo", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "He talked to Dexter Jettster\n\n&gt;the most memorable character in the whole franchise", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He talked to Dexter Jettster&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;the most memorable character in the whole franchise&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbulvd", "score_hidden": false, "stickied": false, "created": 1492359948.0, "created_utc": 1492331148.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb20yo", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Lord_Blathoxi", "parent_id": "t1_dgas1zi", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "He talked to the turtle lady in the bar who can see the past and the future.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He talked to the turtle lady in the bar who can see the past and the future.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb20yo", "score_hidden": false, "stickied": false, "created": 1492313295.0, "created_utc": 1492284495.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgas1zi", "gilded": 0, "archived": false, "score": 51, "report_reasons": null, "author": "Zaziel", "parent_id": "t1_dgammj1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think he might have read journals and accounts and talked to more people who knew what happened from personal experience.\n\nMaybe he had more time to talk to his father as a force ghost after ROTJ?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think he might have read journals and accounts and talked to more people who knew what happened from personal experience.&lt;/p&gt;\n\n&lt;p&gt;Maybe he had more time to talk to his father as a force ghost after ROTJ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgas1zi", "score_hidden": false, "stickied": false, "created": 1492299645.0, "created_utc": 1492270845.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 51}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbyzk8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TreefingerX", "parent_id": "t1_dgb6ppm", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "But we are not as strong in the force as he is", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But we are not as strong in the force as he is&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbyzk8", "score_hidden": false, "stickied": false, "created": 1492374001.0, "created_utc": 1492345201.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb6ppm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LeakyLycanthrope", "parent_id": "t1_dgax7fk", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "If we had to, so does he!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If we had to, so does he!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb6ppm", "score_hidden": false, "stickied": false, "created": 1492319707.0, "created_utc": 1492290907.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgax7fk", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "kinyutaka", "parent_id": "t1_dgax2lw", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "In that case, he might have gone insane at seeing Jar Jar.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In that case, he might have gone insane at seeing Jar Jar.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgax7fk", "score_hidden": false, "stickied": false, "created": 1492306780.0, "created_utc": 1492277980.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgax2lw", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "aqua_zesty_man", "parent_id": "t1_dgammj1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The Force can be used to view other times and other places; when Luke 'watched the prequels,' it means he viewed the history of his father, Old Ben, Yoda, and the other Jedi of old and how the Empire arose and exterminated them.\n\n*Concentrate... feel the Force flow. Yes. Good. Calm, yes. Through the Force, things you will see. Other places. The future... the past. Old friends long gone.* -Yoda, ESB", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Force can be used to view other times and other places; when Luke &amp;#39;watched the prequels,&amp;#39; it means he viewed the history of his father, Old Ben, Yoda, and the other Jedi of old and how the Empire arose and exterminated them.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Concentrate... feel the Force flow. Yes. Good. Calm, yes. Through the Force, things you will see. Other places. The future... the past. Old friends long gone.&lt;/em&gt; -Yoda, ESB&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgax2lw", "score_hidden": false, "stickied": false, "created": 1492306596.0, "created_utc": 1492277796.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb0glr", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "ManchurianCandycane", "parent_id": "t1_dgasgnd", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I'd say he was a classical Jedi in denial. \n\nIt is made clear through Qui Gon that Jedi with actual 'grey beliefs' don't get admitted to the council.\n\nTo me even with Anakin some of that is evident. At least in some part he was rejected because he didn't hold to the dogma for dear life like the rest of the council.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say he was a classical Jedi in denial. &lt;/p&gt;\n\n&lt;p&gt;It is made clear through Qui Gon that Jedi with actual &amp;#39;grey beliefs&amp;#39; don&amp;#39;t get admitted to the council.&lt;/p&gt;\n\n&lt;p&gt;To me even with Anakin some of that is evident. At least in some part he was rejected because he didn&amp;#39;t hold to the dogma for dear life like the rest of the council.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb0glr", "score_hidden": false, "stickied": false, "created": 1492311227.0, "created_utc": 1492282427.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgccgvf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TronZbot", "parent_id": "t1_dgasgnd", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Mace Windu was a Bad Motherfucker...........and mmmhmm, this is a tasty burger!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mace Windu was a Bad Motherfucker...........and mmmhmm, this is a tasty burger!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgccgvf", "score_hidden": false, "stickied": false, "created": 1492394692.0, "created_utc": 1492365892.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgasgnd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BLADES4HIRRE", "parent_id": "t1_dgammj1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "So then in a way mace windu was a actually a grey Jedi, because of his fighting form. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So then in a way mace windu was a actually a grey Jedi, because of his fighting form. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgasgnd", "score_hidden": false, "stickied": false, "created": 1492300216.0, "created_utc": 1492271416.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgazmpl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "kinyutaka", "parent_id": "t1_dgazed4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "A hybrid Force User would know when to use the Force to save a life and when to allow death with dignity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A hybrid Force User would know when to use the Force to save a life and when to allow death with dignity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgazmpl", "score_hidden": false, "stickied": false, "created": 1492310091.0, "created_utc": 1492281291.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgazed4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Narradisall", "parent_id": "t1_dgammj1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Wield the power of life? Did you ever hear the tragedy of Darth Plagueis the wise....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wield the power of life? Did you ever hear the tragedy of Darth Plagueis the wise....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgazed4", "score_hidden": false, "stickied": false, "created": 1492309769.0, "created_utc": 1492280969.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgc4cyj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kinyutaka", "parent_id": "t1_dgc3tb6", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "If I am right, then the fact that we figured it out months ahead of time with only a couple of trailers would say that it was indeed obvious.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I am right, then the fact that we figured it out months ahead of time with only a couple of trailers would say that it was indeed obvious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc4cyj", "score_hidden": false, "stickied": false, "created": 1492383842.0, "created_utc": 1492355042.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3tb6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Wanntanamo", "parent_id": "t1_dgbxqgu", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "That was his/her point?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was his/her point?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc3tb6", "score_hidden": false, "stickied": false, "created": 1492383022.0, "created_utc": 1492354222.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxqgu", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "kinyutaka", "parent_id": "t1_dgbx5v8", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "We will see when the movie comes out, won't we?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We will see when the movie comes out, won&amp;#39;t we?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbxqgu", "score_hidden": false, "stickied": false, "created": 1492370505.0, "created_utc": 1492341705.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbx5v8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fax-on-fax-off", "parent_id": "t1_dgammj1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "\"But, at this point in time, it is obvious that Luke spent that time trying to rectify the Force, to bring true balance, not by evening out the numbers but by combining the disciplines.\"\n\nHow on earth is this \"obvious\"? \n\nWe know 3 things about Luke for an absolute fact:\n\n1. Luke started a new order.\n2. The order was betrayed.\n3. Luke then went on a quest to find the first Jedi temple but left a clue in where that was. \n4. A **single** out-of-context quote from an early trailer to a movie that comes out in eight months.\n\nI love this sub, but it sometimes forgets that it can be an echo chamber of assumptions.\n\n**Nothing is obvious yet.**", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;But, at this point in time, it is obvious that Luke spent that time trying to rectify the Force, to bring true balance, not by evening out the numbers but by combining the disciplines.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;How on earth is this &amp;quot;obvious&amp;quot;? &lt;/p&gt;\n\n&lt;p&gt;We know 3 things about Luke for an absolute fact:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Luke started a new order.&lt;/li&gt;\n&lt;li&gt;The order was betrayed.&lt;/li&gt;\n&lt;li&gt;Luke then went on a quest to find the first Jedi temple but left a clue in where that was. &lt;/li&gt;\n&lt;li&gt;A &lt;strong&gt;single&lt;/strong&gt; out-of-context quote from an early trailer to a movie that comes out in eight months.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I love this sub, but it sometimes forgets that it can be an echo chamber of assumptions.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Nothing is obvious yet.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbx5v8", "score_hidden": false, "stickied": false, "created": 1492368659.0, "created_utc": 1492339859.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb62qq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Jcit878", "parent_id": "t1_dgammj1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "he has the Blue Rey edition.. wait wrong trilogy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;he has the Blue Rey edition.. wait wrong trilogy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb62qq", "score_hidden": false, "stickied": false, "created": 1492318811.0, "created_utc": 1492290011.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgaw6xs", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "megatom0", "parent_id": "t1_dgammj1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I mean Rey watched part of ESB in her forceback. I'm sure Luke with control of the force could watch the prequels. Come on with these simple questions. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean Rey watched part of ESB in her forceback. I&amp;#39;m sure Luke with control of the force could watch the prequels. Come on with these simple questions. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgaw6xs", "score_hidden": false, "stickied": false, "created": 1492305403.0, "created_utc": 1492276603.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbmjxp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CosmicPenguin", "parent_id": "t1_dgammj1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Holocrons.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holocrons.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbmjxp", "score_hidden": false, "stickied": false, "created": 1492342547.0, "created_utc": 1492313747.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgammj1", "gilded": 0, "archived": false, "score": 100, "report_reasons": null, "author": "kinyutaka", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Where do you get that he watched the prequels?\n\nBut, at this point in time, it is obvious that Luke spent that time trying to rectify the Force, to bring true balance, not by evening out the numbers but by combining the disciplines.\n\nThe Force is wielded both by the hotly passionate and the coldly calculating. But overreaching to one extreme or another leads to death.\n\nBeing able to embrace even your hatred, but at the same time knowing when it should be held at bay, is the secret to true power. The power of Life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where do you get that he watched the prequels?&lt;/p&gt;\n\n&lt;p&gt;But, at this point in time, it is obvious that Luke spent that time trying to rectify the Force, to bring true balance, not by evening out the numbers but by combining the disciplines.&lt;/p&gt;\n\n&lt;p&gt;The Force is wielded both by the hotly passionate and the coldly calculating. But overreaching to one extreme or another leads to death.&lt;/p&gt;\n\n&lt;p&gt;Being able to embrace even your hatred, but at the same time knowing when it should be held at bay, is the secret to true power. The power of Life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgammj1", "score_hidden": false, "stickied": false, "created": 1492290862.0, "created_utc": 1492262062.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 100}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbcnwi", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "smarthvader", "parent_id": "t1_dgawfdi", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "But wouldn't Luke know better as to lie to Rey or avoid answering her questions as Yoda and Old Ben avoided telling him about Anakin. If he doesn't tell her the truth, he'd be more stupid than wise, knowing well that the lies are what skewed his path to being a Jedi originally. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But wouldn&amp;#39;t Luke know better as to lie to Rey or avoid answering her questions as Yoda and Old Ben avoided telling him about Anakin. If he doesn&amp;#39;t tell her the truth, he&amp;#39;d be more stupid than wise, knowing well that the lies are what skewed his path to being a Jedi originally. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbcnwi", "score_hidden": false, "stickied": false, "created": 1492328176.0, "created_utc": 1492299376.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb6won", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "LeakyLycanthrope", "parent_id": "t1_dgawfdi", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "So...100% this, except for all these major differences from what OP said?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So...100% this, except for all these major differences from what OP said?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb6won", "score_hidden": false, "stickied": false, "created": 1492319975.0, "created_utc": 1492291175.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawfdi", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "megatom0", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "100% this. That look Luke gives Rey is the look of guilt. I'd also throw in the idea that when the \"No I am your father line\" was done during filming, they changed the line so very few people would know the truth of the matter I think Kershner, Hamill, Kasdan and Lucas were the only ones who knew proper on set. The line spoken by David Prowse on set was \"No Obi-wan killed your father\". I think we will get Kylo telling her \"No Luke killed your father\". I think that this is what will turn her more towards the darkside as well, and that the end of this movie will have her end up with Kylo. I also think that Rey's parents were some of the Knights of Ren who helped kill Luke's students. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;100% this. That look Luke gives Rey is the look of guilt. I&amp;#39;d also throw in the idea that when the &amp;quot;No I am your father line&amp;quot; was done during filming, they changed the line so very few people would know the truth of the matter I think Kershner, Hamill, Kasdan and Lucas were the only ones who knew proper on set. The line spoken by David Prowse on set was &amp;quot;No Obi-wan killed your father&amp;quot;. I think we will get Kylo telling her &amp;quot;No Luke killed your father&amp;quot;. I think that this is what will turn her more towards the darkside as well, and that the end of this movie will have her end up with Kylo. I also think that Rey&amp;#39;s parents were some of the Knights of Ren who helped kill Luke&amp;#39;s students. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgawfdi", "score_hidden": false, "stickied": false, "created": 1492305722.0, "created_utc": 1492276922.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgblb4v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ahuxley2012", "parent_id": "t1_dgb1v93", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Years ago there was a website that someone set up, I think it was called Star Wars Episode 7 The Balance of the Force. The person running it has synopsis for episodes 7,8 and 9. He even had interviews with George Lucas, which were fake. I can't remember who did it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Years ago there was a website that someone set up, I think it was called Star Wars Episode 7 The Balance of the Force. The person running it has synopsis for episodes 7,8 and 9. He even had interviews with George Lucas, which were fake. I can&amp;#39;t remember who did it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgblb4v", "score_hidden": false, "stickied": false, "created": 1492340629.0, "created_utc": 1492311829.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1v93", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "marsmedia", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Amazing write-up - among the best this sub has seen. I think you nailed it. It's not about *embracing* the dark with the light, it's about finding balance in The Force without surrendering your soul and your self to the extremes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Amazing write-up - among the best this sub has seen. I think you nailed it. It&amp;#39;s not about &lt;em&gt;embracing&lt;/em&gt; the dark with the light, it&amp;#39;s about finding balance in The Force without surrendering your soul and your self to the extremes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb1v93", "score_hidden": false, "stickied": false, "created": 1492313080.0, "created_utc": 1492284280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgblyrs", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "PM_ME_YOUR_GSDs", "parent_id": "t1_dgb2ne2", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "And then they'll have a balance baby", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And then they&amp;#39;ll have a balance baby&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgblyrs", "score_hidden": false, "stickied": false, "created": 1492341624.0, "created_utc": 1492312824.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2ne2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "brown_cake", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I really love this idea that Luke is ending the notion of the jedi because adhering to the jedi code is problematic. Same thing with embracing all of the tenants of the sith.\n\nhttps://youtu.be/zB4I68XVPzQ?t=45\n\nWhen Luke asked what Rey sees she says \"light...darkness...**the balance**\"\n\nI think we will see the last Jedi and the last Sith. It will end with one school of thought with Rey and Kylo embracing the balance between the two.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really love this idea that Luke is ending the notion of the jedi because adhering to the jedi code is problematic. Same thing with embracing all of the tenants of the sith.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://youtu.be/zB4I68XVPzQ?t=45\"&gt;https://youtu.be/zB4I68XVPzQ?t=45&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;When Luke asked what Rey sees she says &amp;quot;light...darkness...&lt;strong&gt;the balance&lt;/strong&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I think we will see the last Jedi and the last Sith. It will end with one school of thought with Rey and Kylo embracing the balance between the two.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb2ne2", "score_hidden": false, "stickied": false, "created": 1492314131.0, "created_utc": 1492285331.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgawleo", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "megatom0", "parent_id": "t1_dgauf40", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Snoke is obviously a clone of Luke. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Snoke is obviously a clone of Luke. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgawleo", "score_hidden": false, "stickied": false, "created": 1492305945.0, "created_utc": 1492277145.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgauf40", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "yendrush", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I love this theory. How does snoke fit into all of this?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this theory. How does snoke fit into all of this?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgauf40", "score_hidden": false, "stickied": false, "created": 1492302945.0, "created_utc": 1492274145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbej5z", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "straight_gay", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": " Like this theory. It helps support the fact that the chosen one is supposed to \"bring balance to the force\". All good isn't balance, and neither is all bad. If Luke helps Rey embrace some Dark side Force magic and some light side Force magic it'll be all balanced", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like this theory. It helps support the fact that the chosen one is supposed to &amp;quot;bring balance to the force&amp;quot;. All good isn&amp;#39;t balance, and neither is all bad. If Luke helps Rey embrace some Dark side Force magic and some light side Force magic it&amp;#39;ll be all balanced&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbej5z", "score_hidden": false, "stickied": false, "created": 1492330784.0, "created_utc": 1492301984.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgdpcx4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ZOOTV83", "parent_id": "t1_dgbd898", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "We will watch OP's posting career with great interest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We will watch OP&amp;#39;s posting career with great interest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdpcx4", "score_hidden": false, "stickied": false, "created": 1492475083.0, "created_utc": 1492446283.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbd898", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "BaronVonSlapNuts", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "A long read, to be sure. But a welcome one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A long read, to be sure. But a welcome one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbd898", "score_hidden": false, "stickied": false, "created": 1492328962.0, "created_utc": 1492300162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbfcwq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FortheLoveofUsAll", "parent_id": "t1_dgb5vc1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This was also my theory. When I heard that quote that is exactly how I took it. But I like what some other posters have written about combining the disciplines into one school of thought, especially knowing Luke's history between RoJ and TFA. Also the part in the trailer where Rey says she sees light and dark could represent her being drawn to both sides. It will be interesting to see how this plays out but I truly think one of these 2 theories will be correct. Either way it seems bringing the Jedi to an end will also end the sith", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was also my theory. When I heard that quote that is exactly how I took it. But I like what some other posters have written about combining the disciplines into one school of thought, especially knowing Luke&amp;#39;s history between RoJ and TFA. Also the part in the trailer where Rey says she sees light and dark could represent her being drawn to both sides. It will be interesting to see how this plays out but I truly think one of these 2 theories will be correct. Either way it seems bringing the Jedi to an end will also end the sith&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbfcwq", "score_hidden": false, "stickied": false, "created": 1492331990.0, "created_utc": 1492303190.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5vc1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Stephen1985", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Maybe he's figured out that the force will always be in balance. There are 2 jedi there will be 2 sith. So the only way to truly end the sith is to also end the jedi.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe he&amp;#39;s figured out that the force will always be in balance. There are 2 jedi there will be 2 sith. So the only way to truly end the sith is to also end the jedi.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb5vc1", "score_hidden": false, "stickied": false, "created": 1492318521.0, "created_utc": 1492289721.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbe4f5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "LJawesome", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "\"Taking a step away from the black-and-white morality\" got me thinking about the trailer that just came out, and Luke saying there's more to the force than darkness and light. I could definitely see this theory working.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Taking a step away from the black-and-white morality&amp;quot; got me thinking about the trailer that just came out, and Luke saying there&amp;#39;s more to the force than darkness and light. I could definitely see this theory working.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbe4f5", "score_hidden": false, "stickied": false, "created": 1492330184.0, "created_utc": 1492301384.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbe8yv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "hargleblargle", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I recently came to a similar, but more Skywalker centric conclusion based on a thread from The Clone Wars that carries all the way to Luke and Rey. It's a little out of context of the conversation I was having, but I'm just going to copy/paste the relevant comment from my Facebook. I don't have any speculation about Rey's parentage, but that would be a nice detail.\n\n&gt;I think the Jedi should not exist anymore, and I'm pretty sure the Force is on my side here. \n\n&gt;Think about it -- we know the Force has a will behind it.  On Mortis, that will is personified as three entities. The Daughter, the Son, and the Father. The Light, the Dark, and the one who keeps them in Balance. Although these three entities seemed to die on Mortis, there is no reason to believe they were the source of the Force's will. Rather, I think they were just manifestations. \n\n&gt;Since Anakin visited Mortis and refused to take on the role of the Balance, the Jedi have fallen to ruin not once, but twice. The first was when Anakin Skywalker betrayed and helped destroy them. It is at least strongly implied that the second was when Kylo Ren (his grandson) did the same thing to Luke's Jedi Order.\n\n&gt;I think Anakin set off a cycle when he refused the call of the Force on Mortis. Or maybe he just perpetuated one that he could have ended. As I said earlier, I believe those entities were just manifestations of the will of the Force. By refusing to stay behind and become the Balance, he triggered a symbolic chain of events meant to show him that his choice would bring everything he cared about to ruin. So, the Son killed the Daughter, Anakin killed the Son, and the Father killed himself. The Dark destroyed the Light, Anakin stepped down a dark path to destroy the Dark, and the Balance died along with them.\n\n&gt;Everything that happens to the Skywalkers afterward is the Force playing out a cycle of which it tried to warn Anakin. Anakin walks down an ever darker path trying to destroy the Separatists and Dooku. He becomes corrupted by the darkness and, as the Son did to the Daughter, destroys the Light in the form of the Jedi Order. As he does this, the Balance dies.\n\n&gt;In comes Luke, who tries to embody the Light, but does not have any inkling of what it means to bring Balance to the Force. After all, that's not his place and it was never supposed to be. In the course of battling the Dark, he brings Anakin back to the Light and Anakin does the opposite of what he did when he killed the Jedi, this time destroying the Dark in the form of Emperor Palpatine.\n\n&gt;Luke then builds a New Jedi Order (RIP expanded universe) and it becomes a bastion of the Light. But there is no Balance. So, the Dark returns, cruelly in the form of Luke's nephew Ben. It destroys the Light once again, this time in the form of Luke's Jedi. \n\n&gt;I think Luke realizes what's going on. He knows that if he destroys the Dark and replaces it with the Light once again, it will only be destroyed again in the future (probably by one of his descendents). Instead, I believe he is trying to break the cycle by training not another Jedi, but rather a new Balance. That's right, Luke is the Last Jedi. He wants Rey to be something different. Something that can do what his father refused to do.\n\n&gt;TLDR: The Force lost its Balance because of Anakin and the Skywalkers are doomed to keep knocking it over every time it tries to get up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I recently came to a similar, but more Skywalker centric conclusion based on a thread from The Clone Wars that carries all the way to Luke and Rey. It&amp;#39;s a little out of context of the conversation I was having, but I&amp;#39;m just going to copy/paste the relevant comment from my Facebook. I don&amp;#39;t have any speculation about Rey&amp;#39;s parentage, but that would be a nice detail.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I think the Jedi should not exist anymore, and I&amp;#39;m pretty sure the Force is on my side here. &lt;/p&gt;\n\n&lt;p&gt;Think about it -- we know the Force has a will behind it.  On Mortis, that will is personified as three entities. The Daughter, the Son, and the Father. The Light, the Dark, and the one who keeps them in Balance. Although these three entities seemed to die on Mortis, there is no reason to believe they were the source of the Force&amp;#39;s will. Rather, I think they were just manifestations. &lt;/p&gt;\n\n&lt;p&gt;Since Anakin visited Mortis and refused to take on the role of the Balance, the Jedi have fallen to ruin not once, but twice. The first was when Anakin Skywalker betrayed and helped destroy them. It is at least strongly implied that the second was when Kylo Ren (his grandson) did the same thing to Luke&amp;#39;s Jedi Order.&lt;/p&gt;\n\n&lt;p&gt;I think Anakin set off a cycle when he refused the call of the Force on Mortis. Or maybe he just perpetuated one that he could have ended. As I said earlier, I believe those entities were just manifestations of the will of the Force. By refusing to stay behind and become the Balance, he triggered a symbolic chain of events meant to show him that his choice would bring everything he cared about to ruin. So, the Son killed the Daughter, Anakin killed the Son, and the Father killed himself. The Dark destroyed the Light, Anakin stepped down a dark path to destroy the Dark, and the Balance died along with them.&lt;/p&gt;\n\n&lt;p&gt;Everything that happens to the Skywalkers afterward is the Force playing out a cycle of which it tried to warn Anakin. Anakin walks down an ever darker path trying to destroy the Separatists and Dooku. He becomes corrupted by the darkness and, as the Son did to the Daughter, destroys the Light in the form of the Jedi Order. As he does this, the Balance dies.&lt;/p&gt;\n\n&lt;p&gt;In comes Luke, who tries to embody the Light, but does not have any inkling of what it means to bring Balance to the Force. After all, that&amp;#39;s not his place and it was never supposed to be. In the course of battling the Dark, he brings Anakin back to the Light and Anakin does the opposite of what he did when he killed the Jedi, this time destroying the Dark in the form of Emperor Palpatine.&lt;/p&gt;\n\n&lt;p&gt;Luke then builds a New Jedi Order (RIP expanded universe) and it becomes a bastion of the Light. But there is no Balance. So, the Dark returns, cruelly in the form of Luke&amp;#39;s nephew Ben. It destroys the Light once again, this time in the form of Luke&amp;#39;s Jedi. &lt;/p&gt;\n\n&lt;p&gt;I think Luke realizes what&amp;#39;s going on. He knows that if he destroys the Dark and replaces it with the Light once again, it will only be destroyed again in the future (probably by one of his descendents). Instead, I believe he is trying to break the cycle by training not another Jedi, but rather a new Balance. That&amp;#39;s right, Luke is the Last Jedi. He wants Rey to be something different. Something that can do what his father refused to do.&lt;/p&gt;\n\n&lt;p&gt;TLDR: The Force lost its Balance because of Anakin and the Skywalkers are doomed to keep knocking it over every time it tries to get up.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbe8yv", "score_hidden": false, "stickied": false, "created": 1492330371.0, "created_utc": 1492301571.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbcgap", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "SadaoMaou", "parent_id": "t1_dgb0ce1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "He'd have to be her grandpa for the timeline to work.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;d have to be her grandpa for the timeline to work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbcgap", "score_hidden": false, "stickied": false, "created": 1492327880.0, "created_utc": 1492299080.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbzwbf", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "BaryonicM", "parent_id": "t1_dgbz1j1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Obi Wan died approximately 35 years before the events of The Force Awakens. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Obi Wan died approximately 35 years before the events of The Force Awakens. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbzwbf", "score_hidden": false, "stickied": false, "created": 1492376131.0, "created_utc": 1492347331.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbz1j1", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgbxjtq", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbz1j1", "score_hidden": false, "stickied": false, "created": 1492374140.0, "created_utc": 1492345340.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxjtq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "thisrockismyboone", "parent_id": "t1_dgb0ce1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Obiwan died long before she was born ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Obiwan died long before she was born &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbxjtq", "score_hidden": false, "stickied": false, "created": 1492369925.0, "created_utc": 1492341125.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbx8ls", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fax-on-fax-off", "parent_id": "t1_dgb0ce1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yup. It's the sad reality of early predictions in media: a million fans will collectively put out better ideas than a high paid team of writers ever could. Happened in Lost, happened during the prequels, happened to the 4400, happened to most Dr. Who season endings. \n\n(Which is not to say the fans are better at writing, there are just so many more of them and good ideas rise to the top of the community while bad ideas sink. Also we have the benefit of tweaking these ideas other people come up with while writers have to think of everything themselves.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup. It&amp;#39;s the sad reality of early predictions in media: a million fans will collectively put out better ideas than a high paid team of writers ever could. Happened in Lost, happened during the prequels, happened to the 4400, happened to most Dr. Who season endings. &lt;/p&gt;\n\n&lt;p&gt;(Which is not to say the fans are better at writing, there are just so many more of them and good ideas rise to the top of the community while bad ideas sink. Also we have the benefit of tweaking these ideas other people come up with while writers have to think of everything themselves.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbx8ls", "score_hidden": false, "stickied": false, "created": 1492368908.0, "created_utc": 1492340108.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb0ce1", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "blaintopel", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "this is one of those theories that sounds better than what will actually happen. they're just going to have obi wan be rey's father or something, watch", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this is one of those theories that sounds better than what will actually happen. they&amp;#39;re just going to have obi wan be rey&amp;#39;s father or something, watch&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb0ce1", "score_hidden": false, "stickied": false, "created": 1492311073.0, "created_utc": 1492282273.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbunra", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Blandon_So_Cool", "parent_id": "t1_dgayqfh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt;something about poetry...\n\n&gt;rhyming something or other...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;something about poetry...&lt;/p&gt;\n\n&lt;p&gt;rhyming something or other...&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbunra", "score_hidden": false, "stickied": false, "created": 1492360119.0, "created_utc": 1492331319.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgayqfh", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ilcorvomuerto", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Building off of this, maybe the cycle of good and evil between the Jedi and Sith is part of the reason that The Force Awakens and A New Hope were so incredibly similar to each other. In the sense of history repeating itself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Building off of this, maybe the cycle of good and evil between the Jedi and Sith is part of the reason that The Force Awakens and A New Hope were so incredibly similar to each other. In the sense of history repeating itself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgayqfh", "score_hidden": false, "stickied": false, "created": 1492308843.0, "created_utc": 1492280043.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgaozb5", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "Sickmonkey3", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "[Nice](http://i.imgur.com/CvMqd12.jpg)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://i.imgur.com/CvMqd12.jpg\"&gt;Nice&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgaozb5", "score_hidden": false, "stickied": false, "created": 1492295078.0, "created_utc": 1492266278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgap739", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "jdmgf5", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "It's treason then.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s treason then.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgap739", "score_hidden": false, "stickied": false, "created": 1492295430.0, "created_utc": 1492266630.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgeadbw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JangoCodigo", "parent_id": "t1_dgbqo06", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Good point. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good point. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgeadbw", "score_hidden": false, "stickied": false, "created": 1492499442.0, "created_utc": 1492470642.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbqo06", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "laughterwithans", "parent_id": "t1_dgbq5fr", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "\"It's not Kahn\" - also J.J. Abrams", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;It&amp;#39;s not Kahn&amp;quot; - also J.J. Abrams&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbqo06", "score_hidden": false, "stickied": false, "created": 1492349703.0, "created_utc": 1492320903.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgc2bvk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "s52e358", "parent_id": "t1_dgbq5fr", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The Star Wars movie mythos has always revolved around the f-ed up Skywalker family struggle that plays out on a galactic scale. I wouldn't put it past J.J. for just saying that to throw fans off. Just as u/laughterwithans pointed out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Star Wars movie mythos has always revolved around the f-ed up Skywalker family struggle that plays out on a galactic scale. I wouldn&amp;#39;t put it past J.J. for just saying that to throw fans off. Just as &lt;a href=\"/u/laughterwithans\"&gt;u/laughterwithans&lt;/a&gt; pointed out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc2bvk", "score_hidden": false, "stickied": false, "created": 1492380709.0, "created_utc": 1492351909.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgeaokn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MellowGorilla", "parent_id": "t1_dgeafds", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I only happened to run across it myself a few weeks ago", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I only happened to run across it myself a few weeks ago&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgeaokn", "score_hidden": false, "stickied": false, "created": 1492499845.0, "created_utc": 1492471045.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeafds", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JangoCodigo", "parent_id": "t1_dgdsdrs", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I didn't know about this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t know about this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgeafds", "score_hidden": false, "stickied": false, "created": 1492499516.0, "created_utc": 1492470716.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdsdrs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MellowGorilla", "parent_id": "t1_dgbq5fr", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "\"Rey does not discover who her parents are in Force Awakens.\" J.J. Abrams, clarifying original statement.\n\nhttp://www.cinemablend.com/new/Star-Wars-J-J-Abrams-Backtracks-Statement-About-Rey-Parents-125157.html", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Rey does not discover who her parents are in Force Awakens.&amp;quot; J.J. Abrams, clarifying original statement.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.cinemablend.com/new/Star-Wars-J-J-Abrams-Backtracks-Statement-About-Rey-Parents-125157.html\"&gt;http://www.cinemablend.com/new/Star-Wars-J-J-Abrams-Backtracks-Statement-About-Rey-Parents-125157.html&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdsdrs", "score_hidden": false, "stickied": false, "created": 1492478439.0, "created_utc": 1492449639.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbq5fr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JangoCodigo", "parent_id": "t1_dgb0ucn", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "\"Rey's parents are not in Force Awakens\" - J.J. Abrams\n\nNot Luke. Not Leia. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Rey&amp;#39;s parents are not in Force Awakens&amp;quot; - J.J. Abrams&lt;/p&gt;\n\n&lt;p&gt;Not Luke. Not Leia. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbq5fr", "score_hidden": false, "stickied": false, "created": 1492348708.0, "created_utc": 1492319908.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb0ucn", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "s52e358", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I'm curious if Darth Maul killed Qui-Gon Jinn knowing that Anakin could be turned to the Dark Side if he was trained by a \"true beliver\" in the Jedi order rather than a \"Gray Jedi\" like Qui-Gon. If Anakin was taught to show and use his emotion by someone like Qui-Gon rather than Obi-Wan, would he have been turned so easily?\n\nI think Rey IS Lukes or Leighas daughter though. Anakin was prophesied as someone who would bring balance to the force. The Jedi had reigned supreme for many years. When Anakin switched to the dark side, he did indead bring the force back into balance. His son, Luke was on the light side so his nephew Kylo Ren went dark causing him to abandon the Jedi order and his niece/daughter. If Luke has spent many years examining history and realized the folly of the Jedi/Sith, it would stand that he would realize that the best path for Rey is both light and dark, bringing an end to the Jedi and the Sith.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious if Darth Maul killed Qui-Gon Jinn knowing that Anakin could be turned to the Dark Side if he was trained by a &amp;quot;true beliver&amp;quot; in the Jedi order rather than a &amp;quot;Gray Jedi&amp;quot; like Qui-Gon. If Anakin was taught to show and use his emotion by someone like Qui-Gon rather than Obi-Wan, would he have been turned so easily?&lt;/p&gt;\n\n&lt;p&gt;I think Rey IS Lukes or Leighas daughter though. Anakin was prophesied as someone who would bring balance to the force. The Jedi had reigned supreme for many years. When Anakin switched to the dark side, he did indead bring the force back into balance. His son, Luke was on the light side so his nephew Kylo Ren went dark causing him to abandon the Jedi order and his niece/daughter. If Luke has spent many years examining history and realized the folly of the Jedi/Sith, it would stand that he would realize that the best path for Rey is both light and dark, bringing an end to the Jedi and the Sith.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb0ucn", "score_hidden": false, "stickied": false, "created": 1492311735.0, "created_utc": 1492282935.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb02ux", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "takeshisilver", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Amazing theory Jedi Hunter", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Amazing theory Jedi Hunter&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb02ux", "score_hidden": false, "stickied": false, "created": 1492310711.0, "created_utc": 1492281911.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb0dx2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BASS_Cowboy", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Something something sand gets everywherrreeeee", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something something sand gets everywherrreeeee&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb0dx2", "score_hidden": false, "stickied": false, "created": 1492311127.0, "created_utc": 1492282327.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbg53f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "davy51x", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Grown on me, The Prequels have. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Grown on me, The Prequels have. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbg53f", "score_hidden": false, "stickied": false, "created": 1492333094.0, "created_utc": 1492304294.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbgnib", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gtr06", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I wonder if she could be the Emperor's secret relative or child.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder if she could be the Emperor&amp;#39;s secret relative or child.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbgnib", "score_hidden": false, "stickied": false, "created": 1492333803.0, "created_utc": 1492305003.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbho65", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MFToes2", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Star wars lore dictates that there will always be balance, and the eldest of beings knowing and using the force are neutral, luke having come to the same conclusion knows the darkside will never give their power up, therefore luke is saying with no more jedi also means no more sith, not killing but by submission", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Star wars lore dictates that there will always be balance, and the eldest of beings knowing and using the force are neutral, luke having come to the same conclusion knows the darkside will never give their power up, therefore luke is saying with no more jedi also means no more sith, not killing but by submission&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbho65", "score_hidden": false, "stickied": false, "created": 1492335287.0, "created_utc": 1492306487.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbivbe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sincerely_ignatius", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Reading this theory, it dawned on me how awesome it would have been if kylo ren wasnt an annoying 30 year old lookin guy, but an annoying late teens kid. Easily manipulated. Naive maybe. Just went through puberty. Would have been visually telling the story of youthful rebelliousness, confusion, anger, so much. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading this theory, it dawned on me how awesome it would have been if kylo ren wasnt an annoying 30 year old lookin guy, but an annoying late teens kid. Easily manipulated. Naive maybe. Just went through puberty. Would have been visually telling the story of youthful rebelliousness, confusion, anger, so much. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbivbe", "score_hidden": false, "stickied": false, "created": 1492337044.0, "created_utc": 1492308244.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbm444", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jimmyjah", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "dude... I love your writing style.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dude... I love your writing style.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbm444", "score_hidden": false, "stickied": false, "created": 1492341858.0, "created_utc": 1492313058.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbqkue", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MurderousPaper", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I don't necessarily agree with your theory, but it was very well-written and well-supported. Fun read!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t necessarily agree with your theory, but it was very well-written and well-supported. Fun read!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbqkue", "score_hidden": false, "stickied": false, "created": 1492349527.0, "created_utc": 1492320727.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbqr9l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ramblingnonsense", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Luke's mind was opened up to the Jedi creed being wrong the moment his father saved him from Palpatine. He *knows* that the one \"inviolable\" tenet he was taught is dead wrong: \"Once you start down the dark path, forever will it dominate your destiny.\" Turns out... not so much. It's possible to come back; he's proved it. And his first thoughts, once all the excitement died down, should have been... what *else* did they have wrong for thousands of years?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Luke&amp;#39;s mind was opened up to the Jedi creed being wrong the moment his father saved him from Palpatine. He &lt;em&gt;knows&lt;/em&gt; that the one &amp;quot;inviolable&amp;quot; tenet he was taught is dead wrong: &amp;quot;Once you start down the dark path, forever will it dominate your destiny.&amp;quot; Turns out... not so much. It&amp;#39;s possible to come back; he&amp;#39;s proved it. And his first thoughts, once all the excitement died down, should have been... what &lt;em&gt;else&lt;/em&gt; did they have wrong for thousands of years?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbqr9l", "score_hidden": false, "stickied": false, "created": 1492349896.0, "created_utc": 1492321096.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbr7s2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "M8asonmiller", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "As much as I love this theory (I think one of the RLM guys brought it up), I get a terrible feeling in my gut like they're gonna do something dumb and predictable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As much as I love this theory (I think one of the RLM guys brought it up), I get a terrible feeling in my gut like they&amp;#39;re gonna do something dumb and predictable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbr7s2", "score_hidden": false, "stickied": false, "created": 1492350894.0, "created_utc": 1492322094.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgaq2lt", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "PixelDemon", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I enjoyed that and while you're being a little silly I reckon that's pretty close to what the film will show ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I enjoyed that and while you&amp;#39;re being a little silly I reckon that&amp;#39;s pretty close to what the film will show &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgaq2lt", "score_hidden": false, "stickied": false, "created": 1492296779.0, "created_utc": 1492267979.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb2ay6", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "AlvinBlah", "parent_id": "t1_dgav4x4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "They were terrible in writing and missed a great opportunity for the story of Darth Vader to be seen entirely through Obi-Wan instead of Anakin...but that said, it was impressive technological feats for 1999 and on, more physical models for ships than OT, and pioneering use of face capture and face morphing that is commonplace in CGI filming today. \n\nClone Wars cartoons also built on The PT and did a *ton* of repair work to balance out characters, flaws and narrative intent. \n\nYou're not likely to get me to ever watch those films again...but I think that broader story universe chapter received enough attention and care to allow the PT to be bad but that era of the Republic/Empire to be rich and meaningful. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They were terrible in writing and missed a great opportunity for the story of Darth Vader to be seen entirely through Obi-Wan instead of Anakin...but that said, it was impressive technological feats for 1999 and on, more physical models for ships than OT, and pioneering use of face capture and face morphing that is commonplace in CGI filming today. &lt;/p&gt;\n\n&lt;p&gt;Clone Wars cartoons also built on The PT and did a &lt;em&gt;ton&lt;/em&gt; of repair work to balance out characters, flaws and narrative intent. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re not likely to get me to ever watch those films again...but I think that broader story universe chapter received enough attention and care to allow the PT to be bad but that era of the Republic/Empire to be rich and meaningful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb2ay6", "score_hidden": false, "stickied": false, "created": 1492313665.0, "created_utc": 1492284865.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgaweux", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Davidc4ke", "parent_id": "t1_dgav4x4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yeh your right sorry, just nostalgia speaking ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeh your right sorry, just nostalgia speaking &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgaweux", "score_hidden": false, "stickied": false, "created": 1492305702.0, "created_utc": 1492276902.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgcjp7v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dragontology", "parent_id": "t1_dgchrfa", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Jar Jar is shit and so is the development of Anakin's and Padme's relationship, and Anakin's acting is a little wooden, but coming from the original (which remains my favorite movie) I don't expect much, but fun. The last two just weren't that fun. Attack of the Clones in particular, and parts of Phantom Menace were a lot of fun. \n\nIf I want serious sci-fi, I go to a lot of places before Star Wars. Battlestar Galactica for one. Babylon 5. Star Trek (pre-Abrams, particularly TOS and TNG-DS9). The Expanse was pretty good, for a more recent one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jar Jar is shit and so is the development of Anakin&amp;#39;s and Padme&amp;#39;s relationship, and Anakin&amp;#39;s acting is a little wooden, but coming from the original (which remains my favorite movie) I don&amp;#39;t expect much, but fun. The last two just weren&amp;#39;t that fun. Attack of the Clones in particular, and parts of Phantom Menace were a lot of fun. &lt;/p&gt;\n\n&lt;p&gt;If I want serious sci-fi, I go to a lot of places before Star Wars. Battlestar Galactica for one. Babylon 5. Star Trek (pre-Abrams, particularly TOS and TNG-DS9). The Expanse was pretty good, for a more recent one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcjp7v", "score_hidden": false, "stickied": false, "created": 1492404215.0, "created_utc": 1492375415.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchrfa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HyliaSymphonic", "parent_id": "t1_dgbvlyv", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The last two are cetianlu better than the prequels if thsys what you mean. I mean their better in literally every aspect plot characters dialogue story technique cinematography effects acting. I encourage you to actually try and watch the prequels and listen to the words people are saying and how the plot moves. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The last two are cetianlu better than the prequels if thsys what you mean. I mean their better in literally every aspect plot characters dialogue story technique cinematography effects acting. I encourage you to actually try and watch the prequels and listen to the words people are saying and how the plot moves. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgchrfa", "score_hidden": false, "stickied": false, "created": 1492401717.0, "created_utc": 1492372917.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbvlyv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dragontology", "parent_id": "t1_dgb0v75", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I don't talk to a lot of Star Wars fans online so I really don't know, but I see I triggered a few people. So maybe not? Anyway, what I put is just the personal opinion of one fan, nothing more or less. \n\nWith the prequels I was like, \"These are a bit juveniles but then again I was a little kid when the first three came out so... It's all Star Wars so I guess it's alright.\"\n\nDo people actually think the last couple held up to the ones that came before? Marvel has more or less thrived under Disney, so it's not about the new owners. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t talk to a lot of Star Wars fans online so I really don&amp;#39;t know, but I see I triggered a few people. So maybe not? Anyway, what I put is just the personal opinion of one fan, nothing more or less. &lt;/p&gt;\n\n&lt;p&gt;With the prequels I was like, &amp;quot;These are a bit juveniles but then again I was a little kid when the first three came out so... It&amp;#39;s all Star Wars so I guess it&amp;#39;s alright.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Do people actually think the last couple held up to the ones that came before? Marvel has more or less thrived under Disney, so it&amp;#39;s not about the new owners. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbvlyv", "score_hidden": false, "stickied": false, "created": 1492363295.0, "created_utc": 1492334495.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb0v75", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "HyliaSymphonic", "parent_id": "t1_dgawha4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "DO people actually believe this or are you just being contrarian? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;DO people actually believe this or are you just being contrarian? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb0v75", "score_hidden": false, "stickied": false, "created": 1492311766.0, "created_utc": 1492282966.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb7rn7", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "barjam", "parent_id": "t1_dgawha4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 1, "body": "Lol, no. Prequels were absolute crap. Rogue one and the Force Awakens were better movies in every conceivable way.\n\nIt is a shame. There is a good story to be told in the prequels but execution was terrible. In the hands of a more capable writing/directing team they could have been great.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol, no. Prequels were absolute crap. Rogue one and the Force Awakens were better movies in every conceivable way.&lt;/p&gt;\n\n&lt;p&gt;It is a shame. There is a good story to be told in the prequels but execution was terrible. In the hands of a more capable writing/directing team they could have been great.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb7rn7", "score_hidden": false, "stickied": false, "created": 1492321149.0, "created_utc": 1492292349.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawha4", "gilded": 0, "archived": false, "score": -10, "report_reasons": null, "author": "dragontology", "parent_id": "t1_dgav4x4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "And yet, they start to look good now that we have The Force Awakens and Rogue One, both of which are lesser than The Phantom Menace. The Last Jedi has potential, but under Disney, the last two films have come across as slightly above average fan fiction. Just enough elements of what made Star Wars great, with fan service characters and contrived plots. I don't hate it like Jar Jar, I'm just disappointed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And yet, they start to look good now that we have The Force Awakens and Rogue One, both of which are lesser than The Phantom Menace. The Last Jedi has potential, but under Disney, the last two films have come across as slightly above average fan fiction. Just enough elements of what made Star Wars great, with fan service characters and contrived plots. I don&amp;#39;t hate it like Jar Jar, I&amp;#39;m just disappointed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgawha4", "score_hidden": false, "stickied": false, "created": 1492305795.0, "created_utc": 1492276995.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgav4x4", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Honkadoo", "parent_id": "t1_dgauwpp", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "But... They kinda were.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But... They kinda were.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgav4x4", "score_hidden": false, "stickied": false, "created": 1492303963.0, "created_utc": 1492275163.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbgbe9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "davy51x", "parent_id": "t1_dgauwpp", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Kinda agree with you, the prequels were the first Star Wars movies I saw. I wasn't born until 1991 so I never saw the original trilogy until afterwards. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kinda agree with you, the prequels were the first Star Wars movies I saw. I wasn&amp;#39;t born until 1991 so I never saw the original trilogy until afterwards. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbgbe9", "score_hidden": false, "stickied": false, "created": 1492333344.0, "created_utc": 1492304544.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgauwpp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Davidc4ke", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 1, "body": "Liked your story and it was funny till your said the prequels were bad", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Liked your story and it was funny till your said the prequels were bad&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgauwpp", "score_hidden": false, "stickied": false, "created": 1492303646.0, "created_utc": 1492274846.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgblj39", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ResolverOshawott", "parent_id": "t1_dgbkfpj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Geez why are his hears such a big problem to you ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Geez why are his hears such a big problem to you &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgblj39", "score_hidden": false, "stickied": false, "created": 1492340960.0, "created_utc": 1492312160.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbkfpj", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "DeltaBravo831", "parent_id": "t1_dgbk2d5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "whatever he is, someone better needs to coup his ass, cut off his ears, and give us a badass evil guy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;whatever he is, someone better needs to coup his ass, cut off his ears, and give us a badass evil guy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbkfpj", "score_hidden": false, "stickied": false, "created": 1492339364.0, "created_utc": 1492310564.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbk2d5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ResolverOshawott", "parent_id": "t1_dgax4gk", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Kylo is not a Darth, darths aren't a thing anymore in TFA ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kylo is not a Darth, darths aren&amp;#39;t a thing anymore in TFA &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbk2d5", "score_hidden": false, "stickied": false, "created": 1492338816.0, "created_utc": 1492310016.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgax4gk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DeltaBravo831", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 1, "body": "I really hope he turns out to be a bad guy so we can get rid of Darth Teen Angst.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really hope he turns out to be a bad guy so we can get rid of Darth Teen Angst.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgax4gk", "score_hidden": false, "stickied": false, "created": 1492306667.0, "created_utc": 1492277867.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb226y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ghost-from-tomorrow", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Good theory, and parts of it are likely right, bit I don't think Luke had anything to do with Rey. \n\nWe know from Bloodlines that as of five years before TFA Ben and Luke are still together and Ben hasn't fallen (or if he had, it was so recent news hadn't yet reached momma Leia). This removes the whole Kylo Ren / Rey history some have suspected. Supposedly the two had never met before TFA.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good theory, and parts of it are likely right, bit I don&amp;#39;t think Luke had anything to do with Rey. &lt;/p&gt;\n\n&lt;p&gt;We know from Bloodlines that as of five years before TFA Ben and Luke are still together and Ben hasn&amp;#39;t fallen (or if he had, it was so recent news hadn&amp;#39;t yet reached momma Leia). This removes the whole Kylo Ren / Rey history some have suspected. Supposedly the two had never met before TFA.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb226y", "score_hidden": false, "stickied": false, "created": 1492313343.0, "created_utc": 1492284543.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbamfv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zentaurion", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "At first I was like http://i.imgur.com/5Eu93B7.jpg, but then I was like http://i.imgur.com/tXcwQM0.gif. I'm only saddened that you didn't have anything to support the idea of Rey's father having been an Imperial and of Luke having killed him, but never mind that. I really hope that Episode VIII has a straightforward theme like you've described here.\n\nI can kind of see similarities with the recent Logan in some respects. Luke is also tired and worn down from fighting only to see things nevertheless go horribly wrong. But unlike old man Wolverine, old man Luke can do more than save \"his daughter\"'s life, he can teach her to find a better path and along the way undo the damage done by him and his forebears.\n\nHopefully there's a bit more to it than that, but not *too much* more than that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At first I was like &lt;a href=\"http://i.imgur.com/5Eu93B7.jpg\"&gt;http://i.imgur.com/5Eu93B7.jpg&lt;/a&gt;, but then I was like &lt;a href=\"http://i.imgur.com/tXcwQM0.gif\"&gt;http://i.imgur.com/tXcwQM0.gif&lt;/a&gt;. I&amp;#39;m only saddened that you didn&amp;#39;t have anything to support the idea of Rey&amp;#39;s father having been an Imperial and of Luke having killed him, but never mind that. I really hope that Episode VIII has a straightforward theme like you&amp;#39;ve described here.&lt;/p&gt;\n\n&lt;p&gt;I can kind of see similarities with the recent Logan in some respects. Luke is also tired and worn down from fighting only to see things nevertheless go horribly wrong. But unlike old man Wolverine, old man Luke can do more than save &amp;quot;his daughter&amp;quot;&amp;#39;s life, he can teach her to find a better path and along the way undo the damage done by him and his forebears.&lt;/p&gt;\n\n&lt;p&gt;Hopefully there&amp;#39;s a bit more to it than that, but not &lt;em&gt;too much&lt;/em&gt; more than that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbamfv", "score_hidden": false, "stickied": false, "created": 1492325210.0, "created_utc": 1492296410.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbkeq7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The_Iron_Zeppelin", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "My own personal belief is that the Jedi represent a repression of emotion.  The Sith/Darkside represents  the complete lack of control of emotion so much that it consumes you.  If you use normal analogy, when you bottle up emotion eventually you're going to \"blow up\" when you can't take anymore.  This is what happened to Anakin and why he was so easily consumed by the darkside/his emotions.  I think Luke recognizes that true balance of the force comes from mastery of emotion without repression, hence why he feels the Jedi way must end because for most people who try to repress that emotion it only leads to loss of control or a corruption by the darkside.  There needs to be a union of light and dark to have true balance.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My own personal belief is that the Jedi represent a repression of emotion.  The Sith/Darkside represents  the complete lack of control of emotion so much that it consumes you.  If you use normal analogy, when you bottle up emotion eventually you&amp;#39;re going to &amp;quot;blow up&amp;quot; when you can&amp;#39;t take anymore.  This is what happened to Anakin and why he was so easily consumed by the darkside/his emotions.  I think Luke recognizes that true balance of the force comes from mastery of emotion without repression, hence why he feels the Jedi way must end because for most people who try to repress that emotion it only leads to loss of control or a corruption by the darkside.  There needs to be a union of light and dark to have true balance.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbkeq7", "score_hidden": false, "stickied": false, "created": 1492339319.0, "created_utc": 1492310519.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbmag2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bfett81", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This jives well with Mark Hamill saying he didn't agree with what Rian Johnson had planned for Luke Skywalker at all when he was first told...before it grew on him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This jives well with Mark Hamill saying he didn&amp;#39;t agree with what Rian Johnson had planned for Luke Skywalker at all when he was first told...before it grew on him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbmag2", "score_hidden": false, "stickied": false, "created": 1492342129.0, "created_utc": 1492313329.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbp214", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Miniminotaur", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "?? I thought it was a given that Luke is her father?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;?? I thought it was a given that Luke is her father?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbp214", "score_hidden": false, "stickied": false, "created": 1492346705.0, "created_utc": 1492317905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbr8nn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JangoCodigo", "parent_id": "t1_dgbqgrg", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "He totally could be. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He totally could be. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbr8nn", "score_hidden": false, "stickied": false, "created": 1492350951.0, "created_utc": 1492322151.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbqgrg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bfett81", "parent_id": "t1_dgbqfp3", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I really think JJ is lying.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really think JJ is lying.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbqgrg", "score_hidden": false, "stickied": false, "created": 1492349308.0, "created_utc": 1492320508.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbqfp3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JangoCodigo", "parent_id": "t1_dgbq55m", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Rey is not related to Luke nor the Solos. Rey's parents are [not in the Force Awakens. ](https://youtu.be/paSJk793gWU) . And I'm not quite sure how \"oh no the bad guy I was trying to kill the whole time is actually related to me! My mentor must have lied!\" is original when that is exactly what happened in the first trilogy. One of the most consistent and popular criticisms of Force Awakens was how close it was to the plot of the original. If they double down and make this plot the same as episode 5 I will be surprised. I know they follow the whole \"it rhymes\" thing but I think that reveal would be lazy. It would entertain me either way though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rey is not related to Luke nor the Solos. Rey&amp;#39;s parents are &lt;a href=\"https://youtu.be/paSJk793gWU\"&gt;not in the Force Awakens. &lt;/a&gt; . And I&amp;#39;m not quite sure how &amp;quot;oh no the bad guy I was trying to kill the whole time is actually related to me! My mentor must have lied!&amp;quot; is original when that is exactly what happened in the first trilogy. One of the most consistent and popular criticisms of Force Awakens was how close it was to the plot of the original. If they double down and make this plot the same as episode 5 I will be surprised. I know they follow the whole &amp;quot;it rhymes&amp;quot; thing but I think that reveal would be lazy. It would entertain me either way though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbqfp3", "score_hidden": false, "stickied": false, "created": 1492349252.0, "created_utc": 1492320452.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbq55m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bfett81", "parent_id": "t1_dgbpzee", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "nah, it's a little too on the nose\n\ni think it will be more of a brother reveal...luke will lie to rey because he wants her to kill kylo...kylo will tell her they're blood...causing her to turn\n\nthere's not going to be a father/offspring twist/conflict because they've already done that (TWICE, no less)....instead it will be conflict between siblings...which is more original", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;nah, it&amp;#39;s a little too on the nose&lt;/p&gt;\n\n&lt;p&gt;i think it will be more of a brother reveal...luke will lie to rey because he wants her to kill kylo...kylo will tell her they&amp;#39;re blood...causing her to turn&lt;/p&gt;\n\n&lt;p&gt;there&amp;#39;s not going to be a father/offspring twist/conflict because they&amp;#39;ve already done that (TWICE, no less)....instead it will be conflict between siblings...which is more original&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbq55m", "score_hidden": false, "stickied": false, "created": 1492348693.0, "created_utc": 1492319893.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbpzee", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JangoCodigo", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This theory is so good that I regret reading it. It's so spot on. I am willing to bet this will happen. Instead of \"I *am* your father.\" It's \"I *killed* your father\". I am curious as to who Rey's family *really* is. I feel like Rey *has* to have blood at least familiar to us. I doubt it was a nobody but the idea that we was part of the empire/first order would make sense. \n\nBefore, Darth Vader was redeemed from the dark side. Now, Luke will be redeemed from the light side. \n\nThere isn't good people and bad people. There is good and bad in all of us and we must be responsible for our actions not just what team we're on. A powerful lesson I would love Star Wars to touch on. \n\nI would love to see our heroes use force lighting or other tricks once exclusive to one \"team\" when they realize the greater balance of the force. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This theory is so good that I regret reading it. It&amp;#39;s so spot on. I am willing to bet this will happen. Instead of &amp;quot;I &lt;em&gt;am&lt;/em&gt; your father.&amp;quot; It&amp;#39;s &amp;quot;I &lt;em&gt;killed&lt;/em&gt; your father&amp;quot;. I am curious as to who Rey&amp;#39;s family &lt;em&gt;really&lt;/em&gt; is. I feel like Rey &lt;em&gt;has&lt;/em&gt; to have blood at least familiar to us. I doubt it was a nobody but the idea that we was part of the empire/first order would make sense. &lt;/p&gt;\n\n&lt;p&gt;Before, Darth Vader was redeemed from the dark side. Now, Luke will be redeemed from the light side. &lt;/p&gt;\n\n&lt;p&gt;There isn&amp;#39;t good people and bad people. There is good and bad in all of us and we must be responsible for our actions not just what team we&amp;#39;re on. A powerful lesson I would love Star Wars to touch on. &lt;/p&gt;\n\n&lt;p&gt;I would love to see our heroes use force lighting or other tricks once exclusive to one &amp;quot;team&amp;quot; when they realize the greater balance of the force. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbpzee", "score_hidden": false, "stickied": false, "created": 1492348392.0, "created_utc": 1492319592.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbv3ol", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Scherazade", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I hope so. Removing the Jedi and replacing them with a better, wiser Force philosophy means they can stop hogging the screentime in this universe and we can have more focus on the people of this universe and their stories.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope so. Removing the Jedi and replacing them with a better, wiser Force philosophy means they can stop hogging the screentime in this universe and we can have more focus on the people of this universe and their stories.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbv3ol", "score_hidden": false, "stickied": false, "created": 1492361575.0, "created_utc": 1492332775.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbx79f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "could-of-bot", "parent_id": "t1_dgbx78v", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "It's either should **HAVE** or should**'VE**, but never should **OF**. \n\n See [Grammar Errors](http://www.grammarerrors.com/grammar/could-of-would-of-should-of/) for more information.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s either should &lt;strong&gt;HAVE&lt;/strong&gt; or should&lt;strong&gt;&amp;#39;VE&lt;/strong&gt;, but never should &lt;strong&gt;OF&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;See &lt;a href=\"http://www.grammarerrors.com/grammar/could-of-would-of-should-of/\"&gt;Grammar Errors&lt;/a&gt; for more information.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbx79f", "score_hidden": false, "stickied": false, "created": 1492368788.0, "created_utc": 1492339988.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbx78v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mrbeefcake90", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Jedi where allowed feelings I.e compassion and unconditional love and hope and faith, they just didn't want to turn to anger or hatred for the use of the dark side as it is a corruption of the force it knocks it out of balance. Lot of bad things get said about the jedi and that certain things where there fault and they should of stopped palpatine but bloody hell they weren't the ones who started a galactic civil war they didn't instigate a genocide of an entire religion and they sure as hell didn't put palpatine in charge.... so cmon guys do a Chris crocker and leave the jedi alone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jedi where allowed feelings I.e compassion and unconditional love and hope and faith, they just didn&amp;#39;t want to turn to anger or hatred for the use of the dark side as it is a corruption of the force it knocks it out of balance. Lot of bad things get said about the jedi and that certain things where there fault and they should of stopped palpatine but bloody hell they weren&amp;#39;t the ones who started a galactic civil war they didn&amp;#39;t instigate a genocide of an entire religion and they sure as hell didn&amp;#39;t put palpatine in charge.... so cmon guys do a Chris crocker and leave the jedi alone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbx78v", "score_hidden": false, "stickied": false, "created": 1492368786.0, "created_utc": 1492339986.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgc2ieb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "averageschmuck", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I remember that Rey's parentage was revealed already (Kenobi, I think)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember that Rey&amp;#39;s parentage was revealed already (Kenobi, I think)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc2ieb", "score_hidden": false, "stickied": false, "created": 1492381004.0, "created_utc": 1492352204.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgcj6f5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theotherghostgirl", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I'm sticking to my theory that Rey is actually Kylo's sister. \n\nWhile Kylo did wipe her memory, everyone else is pretty sure she is dead, save maybe for his master. \n\nThis is part of the reason \nHan and Leia sort of split after Kylo went darkside. Han didn't think he could be saved, but Leia still had hope. \n\nIt's also part of the reason Han was willing to approach and basically sacrifice himself to try to bring Kylo back to the light, as he was starting to suspect who Rey really was. \n\nHell maybe Chewbacca even pulled him aside and mentioned who Rey smelled like. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sticking to my theory that Rey is actually Kylo&amp;#39;s sister. &lt;/p&gt;\n\n&lt;p&gt;While Kylo did wipe her memory, everyone else is pretty sure she is dead, save maybe for his master. &lt;/p&gt;\n\n&lt;p&gt;This is part of the reason \nHan and Leia sort of split after Kylo went darkside. Han didn&amp;#39;t think he could be saved, but Leia still had hope. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also part of the reason Han was willing to approach and basically sacrifice himself to try to bring Kylo back to the light, as he was starting to suspect who Rey really was. &lt;/p&gt;\n\n&lt;p&gt;Hell maybe Chewbacca even pulled him aside and mentioned who Rey smelled like. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcj6f5", "score_hidden": false, "stickied": false, "created": 1492403539.0, "created_utc": 1492374739.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgaq7dn", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "Flippity_Flappity", "parent_id": "t1_dgap6y8", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think they were just trying to be funny.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think they were just trying to be funny.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgaq7dn", "score_hidden": false, "stickied": false, "created": 1492296982.0, "created_utc": 1492268182.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgb6y0g", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "LeakyLycanthrope", "parent_id": "t1_dgap6y8", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Dear God, man, he didn't mean it literally.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dear God, man, he didn&amp;#39;t mean it literally.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgb6y0g", "score_hidden": false, "stickied": false, "created": 1492320027.0, "created_utc": 1492291227.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgawj3l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "megatom0", "parent_id": "t1_dgap6y8", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Explain how he couldn't watch the prequels? Rey actually sees some of the Empire Strikes Back, she even sees some of the later events of TFA (ala SpaceBalls) in he forceback scene. If someone who had control of the force tried to see past events I'm sure they could. Especially given the history of the light saber if it holds on to events like that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Explain how he couldn&amp;#39;t watch the prequels? Rey actually sees some of the Empire Strikes Back, she even sees some of the later events of TFA (ala SpaceBalls) in he forceback scene. If someone who had control of the force tried to see past events I&amp;#39;m sure they could. Especially given the history of the light saber if it holds on to events like that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgawj3l", "score_hidden": false, "stickied": false, "created": 1492305864.0, "created_utc": 1492277064.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbv49b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Scherazade", "parent_id": "t1_dgap6y8", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Also there were likely tons of holovids of Anakin Skywalker in his Hero Of The Republic days during the Clone Wars, lying about.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also there were likely tons of holovids of Anakin Skywalker in his Hero Of The Republic days during the Clone Wars, lying about.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbv49b", "score_hidden": false, "stickied": false, "created": 1492361627.0, "created_utc": 1492332827.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgap6y8", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "NerdWithoutPlan", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 1, "body": "The watching the prequels bit weakens your overall argument. Even though he was not alive for the prequels, he does potentially have a way to know what happened during that time, The ghosts of Obi Wan, Anakin and Yoda (potentially even Qui Gon).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The watching the prequels bit weakens your overall argument. Even though he was not alive for the prequels, he does potentially have a way to know what happened during that time, The ghosts of Obi Wan, Anakin and Yoda (potentially even Qui Gon).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgap6y8", "score_hidden": false, "stickied": false, "created": 1492295424.0, "created_utc": 1492266624.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgarl11", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "btharp50", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 1, "body": "Or...\n\nMaybe Luke is starting a new order not known as the Jedi due to the corruption and balance issues he's witnessed", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or...&lt;/p&gt;\n\n&lt;p&gt;Maybe Luke is starting a new order not known as the Jedi due to the corruption and balance issues he&amp;#39;s witnessed&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgarl11", "score_hidden": false, "stickied": false, "created": 1492298976.0, "created_utc": 1492270176.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgbfajq", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "CarnifexMagnus", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Guys. Spoiler tags please. I keep reading things everywhere, little things that reference the preview. Some of us haven't seen it yet. I get that this is a shitpost, but the whole \"the Jedi must end\" thing I only know about cause of Reddit and honestly it pisses me off a little", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Guys. Spoiler tags please. I keep reading things everywhere, little things that reference the preview. Some of us haven&amp;#39;t seen it yet. I get that this is a shitpost, but the whole &amp;quot;the Jedi must end&amp;quot; thing I only know about cause of Reddit and honestly it pisses me off a little&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbfajq", "score_hidden": false, "stickied": false, "created": 1492331897.0, "created_utc": 1492303097.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65iyjh", "likes": null, "replies": "", "user_reports": [], "id": "dgaysdx", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "ArrrGaming", "parent_id": "t3_65iyjh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "No thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgaysdx", "score_hidden": false, "stickied": false, "created": 1492308916.0, "created_utc": 1492280116.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]