[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Oh no, the elves are wrong.  There had to have been gods.  Foolish to think that there aren&amp;#39;t, actually.  This is supported by a few points.  How in the world did the races come up with the names of the gods?  I mean sure maybe their language created that name, but maybe they were taught a fake name for their gods and goddesses.  The real name (I don&amp;#39;t want to say true, necessarily) is only said in the ancient language, for when you read (or may not have read) Brisingr (watch out, this may get ahead of your reading if you didn&amp;#39;t read it!), the dwarf magicians chant in the ancient language, and summon a likeness of Guntera for Orik&amp;#39;s coronation to become the next grimznborith (or however you spell the dwarf word for king of the dwarves), and Eragon wonders if it actually was Guntera who participates in the coronation.  Later, Eragon leaves the Beors in Brisingr and Saphira hits a mighty headwind that tires her significantly.  Eragon, feeling slightly foolish, prays to Guntera to abate the wind and increase their progress.  The wind does go down a bit, but you can argue that it was his destiny to get there.  But at the same time, did Guntera listen?  Hard to say, could go either way.&lt;/p&gt;\n\n&lt;p&gt;The strongest point that supports my theory is found in the last book, Inheritance.  The Word is the most powerful sound that can be uttered in all of Paolini&amp;#39;s world, Alagaesia and beyond, because it has the property to undo oaths, undo spells cast, stop any spells from being cast, and more without the use of any energy whatsoever.  Even better, it has the power to assign sounds to items, organisms, and actions.  There is only proof of that it assigns names to organisms, when at the last leg of the book Eragon travels to Vroengard and uses the name of names to assign the shadow birds and the &amp;quot;agario grubs&amp;quot; (the grub that can split into tiny caterpillars and eats flesh, in which the pain caused cannot be healed properly, hence my dubbing of agario within its nickname), in which the name I think would stay for all time unless somebody utters the name of the ancient language and changes it, but I am not sure that is actually possible.  The point is, where did the name come from?  There is only one legitimate possibility -- the name was passed down from the gods, and the gods stamp the rules of the Earth through the Grey folk -- all-knowing philosophers that used eons and eons to create a global nervous system that understands the gist of what people are trying to say, like when they want to turn dirt into water (nice try, Eragon!) or when they want to accidentally set their sword on fire, stuff like that.  So the Grey folk learned the name from the gods and assigned names to millions and millions of things -- but just gosh darn forgot (or did on purpose) to allow people to come back to life, and other impossibilities of Alagaesia.  Perhaps the Grey Folk were still existent at the time of the Inheritance cycle, and were still constantly processing requests of magic spells, oaths, and names that people say in the ancient language.  They don&amp;#39;t give a darn that Galbatorix was a pain in the arse to the Varden -- they are just doing their own thing and processing requests from people that use the ancient language.  However, the gods care because they have emotion -- for example allowing Saphira to charge through the headwind with just a bit of delay.&lt;/p&gt;\n\n&lt;p&gt;Note how little to no quotes are used above, but pretty much anyone that has read and remembered the Inheritance cycle can relate to this..&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Oh no, the elves are wrong.  There had to have been gods.  Foolish to think that there aren't, actually.  This is supported by a few points.  How in the world did the races come up with the names of the gods?  I mean sure maybe their language created that name, but maybe they were taught a fake name for their gods and goddesses.  The real name (I don't want to say true, necessarily) is only said in the ancient language, for when you read (or may not have read) Brisingr (watch out, this may get ahead of your reading if you didn't read it!), the dwarf magicians chant in the ancient language, and summon a likeness of Guntera for Orik's coronation to become the next grimznborith (or however you spell the dwarf word for king of the dwarves), and Eragon wonders if it actually was Guntera who participates in the coronation.  Later, Eragon leaves the Beors in Brisingr and Saphira hits a mighty headwind that tires her significantly.  Eragon, feeling slightly foolish, prays to Guntera to abate the wind and increase their progress.  The wind does go down a bit, but you can argue that it was his destiny to get there.  But at the same time, did Guntera listen?  Hard to say, could go either way.\n\nThe strongest point that supports my theory is found in the last book, Inheritance.  The Word is the most powerful sound that can be uttered in all of Paolini's world, Alagaesia and beyond, because it has the property to undo oaths, undo spells cast, stop any spells from being cast, and more without the use of any energy whatsoever.  Even better, it has the power to assign sounds to items, organisms, and actions.  There is only proof of that it assigns names to organisms, when at the last leg of the book Eragon travels to Vroengard and uses the name of names to assign the shadow birds and the \"agario grubs\" (the grub that can split into tiny caterpillars and eats flesh, in which the pain caused cannot be healed properly, hence my dubbing of agario within its nickname), in which the name I think would stay for all time unless somebody utters the name of the ancient language and changes it, but I am not sure that is actually possible.  The point is, where did the name come from?  There is only one legitimate possibility -- the name was passed down from the gods, and the gods stamp the rules of the Earth through the Grey folk -- all-knowing philosophers that used eons and eons to create a global nervous system that understands the gist of what people are trying to say, like when they want to turn dirt into water (nice try, Eragon!) or when they want to accidentally set their sword on fire, stuff like that.  So the Grey folk learned the name from the gods and assigned names to millions and millions of things -- but just gosh darn forgot (or did on purpose) to allow people to come back to life, and other impossibilities of Alagaesia.  Perhaps the Grey Folk were still existent at the time of the Inheritance cycle, and were still constantly processing requests of magic spells, oaths, and names that people say in the ancient language.  They don't give a darn that Galbatorix was a pain in the arse to the Varden -- they are just doing their own thing and processing requests from people that use the ancient language.  However, the gods care because they have emotion -- for example allowing Saphira to charge through the headwind with just a bit of delay.\n\nNote how little to no quotes are used above, but pretty much anyone that has read and remembered the Inheritance cycle can relate to this..", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65jda6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "SJ_the_changer", "saved": false, "mod_reports": [], "name": "t3_65jda6", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65jda6/inheritance_the_grey_folks_created_the_world_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492295828.0, "url": "https://www.reddit.com/r/FanTheories/comments/65jda6/inheritance_the_grey_folks_created_the_world_and/", "author_flair_text": null, "quarantine": false, "title": "[Inheritance] The Grey folks created the world and were taught the name of the ancient language by the gods, whoever they are.", "created_utc": 1492267028.0, "distinguished": null, "media": null, "upvote_ratio": 0.5, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65jda6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65jda6", "likes": null, "replies": "", "user_reports": [], "id": "dgcliv8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SJ_the_changer", "parent_id": "t1_dgbppzx", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I don't think tinkledeath was elven, that sword is way too OP, otherwise the elves would be carrying around swords that slices rocks like cheese, and since there is no mention of that, I think maybe that sword came from Tenga or something, who knows a whole bunch of stuff about random things that may or may not be useful.  They just were humans in disguise, I am guessing.  I think when they mean mooneater, Angela actually traveled to the moon and ate a piece off of it or something like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think tinkledeath was elven, that sword is way too OP, otherwise the elves would be carrying around swords that slices rocks like cheese, and since there is no mention of that, I think maybe that sword came from Tenga or something, who knows a whole bunch of stuff about random things that may or may not be useful.  They just were humans in disguise, I am guessing.  I think when they mean mooneater, Angela actually traveled to the moon and ate a piece off of it or something like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcliv8", "score_hidden": false, "stickied": false, "created": 1492406586.0, "created_utc": 1492377786.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbppzx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kratosbeatsbatman", "parent_id": "t3_65jda6", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I always likes to think Angela and her mentor, the hermit, were two of the last gray folk alive. She's op and old as hell to have known the elves before galbatorix came to power. ( tingle death was elven i belive) pulse she ate the fucking moon", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always likes to think Angela and her mentor, the hermit, were two of the last gray folk alive. She&amp;#39;s op and old as hell to have known the elves before galbatorix came to power. ( tingle death was elven i belive) pulse she ate the fucking moon&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbppzx", "score_hidden": false, "stickied": false, "created": 1492347930.0, "created_utc": 1492319130.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]