[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So after watching the trailer, I was slightly disappointed because I thought there was nothing much revealed and was still completely in the dark. Then I watched it again, and again, and again and I started to notice things that I&amp;#39;ve put together into this little theory.&lt;/p&gt;\n\n&lt;p&gt;So the main thing that we all got from the trailer is Luke&amp;#39;s line &amp;quot;Its time for the Jedi to end.&amp;quot; Originally I thought this was Luke giving up on the Jedi/Force after his colossal failure in Ben (Kylo) which was probably emphasised when he felt Han die. However, that just didn&amp;#39;t sit right with me. This is Luke Skywalker - he brought Darth Vader back to the light - there is no way he would just give up on the light completely.&lt;/p&gt;\n\n&lt;p&gt;As I watched more, I started to see a possible bigger picture with the pieces they had put in the trailer. I believe that The Last Jedi refers to Luke (and Rey) leaving behind the title of Jedi - and adopting the title of Jedi-Bendu or simply Bendu.&lt;/p&gt;\n\n&lt;p&gt;For those of you who are unaware, the original concept for Star Wars was an extract from The Journal of the Whills (which we&amp;#39;ll come back to) following the story of Mace Windy, the famed Jedi-Bendu. Its no secret that the story group has been grabbing ideas from very early on in Star Wars&amp;#39; development for use in the sequels, and even re-canonised Whills in Rogue One (possibly setting up for more Whills involvement?)\nSo what does this have to do with Luke and his path in TLJ?&lt;/p&gt;\n\n&lt;p&gt;Well there are 2 characters that may reflect Luke&amp;#39;s path, and stick with me, because they may not sound right at first. These characters are Mace Windu and Bendu.&lt;/p&gt;\n\n&lt;p&gt;While the relationship seems odd, it has to be noted that Mace Windu (Windy originally) was the original protagonist for Star Wars, who then became Luke Starkiller, who then became Luke Skywalker. So its not a stretch to think Mace and Luke may be alike. Mace Windu was known for walking the edge between light and dark sides of the force, even developing a lightsaber style, Vapaad, that relied on channelling the opponents anger through the user, and was described as &amp;quot;a state of mind that led through the penumbra of the dark side&amp;quot;. This seems to be the direction Luke was already headed in Episode 6 (using force choke and dressing in black) before overcoming the dark side. It is very possible that Luke is gliding on the edge much like Mace did. Having said this, I don&amp;#39;t think he did it in the same way as Mace - that is, not using both light and dark, rather, something in between.&lt;/p&gt;\n\n&lt;p&gt;Thats where Bendu, a recently introduced character into Star Wars Rebels, comes in. Bendu describes himself as the centre of the force, and as a personification of the force that lies neither on the light (Ashla) or dark (Bogan) sides. Bendu makes it very clear that he is not a force wielder, rather that he is literally the force that lies in the centre. This is a massive shake up to the Star Wars canon (that there are literally 3 &amp;quot;sides&amp;quot; to the force, rather than just 2. Seems like a pretty good setup for things to come...&lt;/p&gt;\n\n&lt;p&gt;Finally, the key that ties it all together. The bookshelf and Book shown in the trailer. I think that this book is the Journal of the Whills, which Luke found at the very first Jedi Temple. I believe that in the Journal Luke has found the key to true balance, in the form of Bendu - the one in the middle. By wielding Bendu (balance), rather than Ashla (light) or Bogan (dark), Luke will finally find true balance in the force.&lt;/p&gt;\n\n&lt;p&gt;Not only does this make sense of the concept of balance in Star Wars, but it will also brings George&amp;#39;s original concept of Jedi-Bendu and the Journal of the Whills to fruition.&lt;/p&gt;\n\n&lt;p&gt;TLDR: I think The Last Jedi refers to Luke and Rey leaving the title of Jedi as well as exclusive use of the light side, for the title of Jedi-Bendu (or Bendu) and use of the centre of the force, leading to true balance. I think Luke&amp;#39;s knowledge of the Bendu will come from the Journal of the Whills which was pictured in the trailer.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So after watching the trailer, I was slightly disappointed because I thought there was nothing much revealed and was still completely in the dark. Then I watched it again, and again, and again and I started to notice things that I've put together into this little theory.\n\nSo the main thing that we all got from the trailer is Luke's line \"Its time for the Jedi to end.\" Originally I thought this was Luke giving up on the Jedi/Force after his colossal failure in Ben (Kylo) which was probably emphasised when he felt Han die. However, that just didn't sit right with me. This is Luke Skywalker - he brought Darth Vader back to the light - there is no way he would just give up on the light completely.\n\nAs I watched more, I started to see a possible bigger picture with the pieces they had put in the trailer. I believe that The Last Jedi refers to Luke (and Rey) leaving behind the title of Jedi - and adopting the title of Jedi-Bendu or simply Bendu.\n\nFor those of you who are unaware, the original concept for Star Wars was an extract from The Journal of the Whills (which we'll come back to) following the story of Mace Windy, the famed Jedi-Bendu. Its no secret that the story group has been grabbing ideas from very early on in Star Wars' development for use in the sequels, and even re-canonised Whills in Rogue One (possibly setting up for more Whills involvement?)\nSo what does this have to do with Luke and his path in TLJ?\n\n\nWell there are 2 characters that may reflect Luke's path, and stick with me, because they may not sound right at first. These characters are Mace Windu and Bendu.\n\n\nWhile the relationship seems odd, it has to be noted that Mace Windu (Windy originally) was the original protagonist for Star Wars, who then became Luke Starkiller, who then became Luke Skywalker. So its not a stretch to think Mace and Luke may be alike. Mace Windu was known for walking the edge between light and dark sides of the force, even developing a lightsaber style, Vapaad, that relied on channelling the opponents anger through the user, and was described as \"a state of mind that led through the penumbra of the dark side\". This seems to be the direction Luke was already headed in Episode 6 (using force choke and dressing in black) before overcoming the dark side. It is very possible that Luke is gliding on the edge much like Mace did. Having said this, I don't think he did it in the same way as Mace - that is, not using both light and dark, rather, something in between.\n\n\nThats where Bendu, a recently introduced character into Star Wars Rebels, comes in. Bendu describes himself as the centre of the force, and as a personification of the force that lies neither on the light (Ashla) or dark (Bogan) sides. Bendu makes it very clear that he is not a force wielder, rather that he is literally the force that lies in the centre. This is a massive shake up to the Star Wars canon (that there are literally 3 \"sides\" to the force, rather than just 2. Seems like a pretty good setup for things to come...\n\n\nFinally, the key that ties it all together. The bookshelf and Book shown in the trailer. I think that this book is the Journal of the Whills, which Luke found at the very first Jedi Temple. I believe that in the Journal Luke has found the key to true balance, in the form of Bendu - the one in the middle. By wielding Bendu (balance), rather than Ashla (light) or Bogan (dark), Luke will finally find true balance in the force.\n\n\nNot only does this make sense of the concept of balance in Star Wars, but it will also brings George's original concept of Jedi-Bendu and the Journal of the Whills to fruition.\n\n\nTLDR: I think The Last Jedi refers to Luke and Rey leaving the title of Jedi as well as exclusive use of the light side, for the title of Jedi-Bendu (or Bendu) and use of the centre of the force, leading to true balance. I think Luke's knowledge of the Bendu will come from the Journal of the Whills which was pictured in the trailer.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65k060", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "MrFinigen", "saved": false, "mod_reports": [], "name": "t3_65k060", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65k060/the_last_jedi_theory_an_explanation_of_lukes_path/", "num_reports": null, "locked": false, "stickied": false, "created": 1492303151.0, "url": "https://www.reddit.com/r/FanTheories/comments/65k060/the_last_jedi_theory_an_explanation_of_lukes_path/", "author_flair_text": null, "quarantine": false, "title": "The Last Jedi Theory - An Explanation of Luke's path going forward and the possible reasons for it.", "created_utc": 1492274351.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65k060", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65k060", "likes": null, "replies": "", "user_reports": [], "id": "dgavjzu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MrFinigen", "parent_id": "t1_dgavc6x", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yeah, seems like a great way to end it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, seems like a great way to end it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgavjzu", "score_hidden": false, "stickied": false, "created": 1492304535.0, "created_utc": 1492275735.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgavc6x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FearLeadsToAnger", "parent_id": "t3_65k060", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I'm also thinking that he will teach this to Kylo at some point and Kylo will complete the representation of how both the Light and the Dark can reach Bendu, therefore reinforcing Lukes theory here.\n\nPicturing an imagine of the 3 aligned with Luke in the Grey centre. Rey on the right having come from the Light to the Grey and Kylo on the left having come from the darkness into the Grey.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m also thinking that he will teach this to Kylo at some point and Kylo will complete the representation of how both the Light and the Dark can reach Bendu, therefore reinforcing Lukes theory here.&lt;/p&gt;\n\n&lt;p&gt;Picturing an imagine of the 3 aligned with Luke in the Grey centre. Rey on the right having come from the Light to the Grey and Kylo on the left having come from the darkness into the Grey.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgavc6x", "score_hidden": false, "stickied": false, "created": 1492304240.0, "created_utc": 1492275440.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]