[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Well, has been 7 years since the movie release but anyway, i haven&amp;#39;t seen anyone pointing this out yet so i thought about sharing my theory about the spinning totem.\nIt is really simple actually. Ariadne (Ellen Page) she&amp;#39;s the one who designs the dream like creating the background and environments. Inside the briefcase they all connect to, there are already several already designed environments, like stages on a pc game for example. The beach that Cobb (DiCaprio) is found by the guards for example is the same &amp;quot;stage&amp;quot; he tries to pull up the first hijack on Saito (ken Watanabe) at the beginning of the movie, the place he spends 50 years with his wife Mal (Marion Cotillard) is the same place he goes in the end where the buildings are collapsing, is like if the the briefcase has a hard drive with the environments saved in it. Aridane (Ellen Page) could easily build up an airport to fool Cobb (DiCaprio) &amp;quot;as she&amp;#39;s the only one who builds&amp;quot; but she would never be able to build a perfect replica of Coob&amp;#39;s house ( where he meets his kids in the end) as she has never been there so that scene has to be real and the totem will eventually stop spinning at some point.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Well, has been 7 years since the movie release but anyway, i haven't seen anyone pointing this out yet so i thought about sharing my theory about the spinning totem.\nIt is really simple actually. Ariadne (Ellen Page) she's the one who designs the dream like creating the background and environments. Inside the briefcase they all connect to, there are already several already designed environments, like stages on a pc game for example. The beach that Cobb (DiCaprio) is found by the guards for example is the same \"stage\" he tries to pull up the first hijack on Saito (ken Watanabe) at the beginning of the movie, the place he spends 50 years with his wife Mal (Marion Cotillard) is the same place he goes in the end where the buildings are collapsing, is like if the the briefcase has a hard drive with the environments saved in it. Aridane (Ellen Page) could easily build up an airport to fool Cobb (DiCaprio) \"as she's the only one who builds\" but she would never be able to build a perfect replica of Coob's house ( where he meets his kids in the end) as she has never been there so that scene has to be real and the totem will eventually stop spinning at some point.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65m58o", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "gatozangado", "saved": false, "mod_reports": [], "name": "t3_65m58o", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65m58o/inception_2010_ending_explained/", "num_reports": null, "locked": false, "stickied": false, "created": 1492327824.0, "url": "https://www.reddit.com/r/FanTheories/comments/65m58o/inception_2010_ending_explained/", "author_flair_text": null, "quarantine": false, "title": "Inception (2010) ending explained.", "created_utc": 1492299024.0, "distinguished": null, "media": null, "upvote_ratio": 0.33, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65m58o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65m58o", "likes": null, "replies": "", "user_reports": [], "id": "dgbi8q6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gatozangado", "parent_id": "t1_dgbgr69", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yeah you're totally right, they left us with this huge question about it but i only had that thought as everyone has a different role on the game and i thought that Cobb could only add people to the environment  ( or somehow be tricked by his own mind but only with the \"clearance\" let's say, he has in the program) anyway it is an amazing movie that raised multiple questions and now that you pointed that out it raised even more questions in my head haha.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah you&amp;#39;re totally right, they left us with this huge question about it but i only had that thought as everyone has a different role on the game and i thought that Cobb could only add people to the environment  ( or somehow be tricked by his own mind but only with the &amp;quot;clearance&amp;quot; let&amp;#39;s say, he has in the program) anyway it is an amazing movie that raised multiple questions and now that you pointed that out it raised even more questions in my head haha.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbi8q6", "score_hidden": false, "stickied": false, "created": 1492336111.0, "created_utc": 1492307311.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbgr69", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chancellortobyiii", "parent_id": "t3_65m58o", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Well, as was said in the movie, sometimes strong memories of a person of a group going inside a dream, can manifest themselves. Ariadne was the one really responsible for creating the environment but Cobb's memories seeps through. The parts where we are transported to places that was clearly from Cobb's experiences is where Cobb's memories have mingled with Ariadne's architecture. But it can also be that what you're saying is true, that all of what Ariadne was trying to construct was in fact a product of Cobb's own mind hence the mingling of his own memories to the environments in the first place. Cobb just fooled himself that there were other minds/people in his dream, he fooled himself into thinking that it was Ariadne that constructed the environments. Just like that if we dream, we don't really know what the other characters in our dreams are thinking or are gonna do, right? It's like in our dreams there are independent thinking minds interacting with our own character.\n\nI really like your idea, this seems really to lean the conversation more to all of the events in the movie being just played out in the dream of a sleeping Cobb.", "edited": 1492307626.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, as was said in the movie, sometimes strong memories of a person of a group going inside a dream, can manifest themselves. Ariadne was the one really responsible for creating the environment but Cobb&amp;#39;s memories seeps through. The parts where we are transported to places that was clearly from Cobb&amp;#39;s experiences is where Cobb&amp;#39;s memories have mingled with Ariadne&amp;#39;s architecture. But it can also be that what you&amp;#39;re saying is true, that all of what Ariadne was trying to construct was in fact a product of Cobb&amp;#39;s own mind hence the mingling of his own memories to the environments in the first place. Cobb just fooled himself that there were other minds/people in his dream, he fooled himself into thinking that it was Ariadne that constructed the environments. Just like that if we dream, we don&amp;#39;t really know what the other characters in our dreams are thinking or are gonna do, right? It&amp;#39;s like in our dreams there are independent thinking minds interacting with our own character.&lt;/p&gt;\n\n&lt;p&gt;I really like your idea, this seems really to lean the conversation more to all of the events in the movie being just played out in the dream of a sleeping Cobb.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbgr69", "score_hidden": false, "stickied": false, "created": 1492333949.0, "created_utc": 1492305149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65m58o", "likes": null, "replies": "", "user_reports": [], "id": "dge124v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "One_Winged_Rook", "parent_id": "t3_65m58o", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Didn't arieande visit a bunch of Cobb's memories at one point? \n\nIt's possible she saw the house there? I can't remember if she explicitly sees that scene or not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Didn&amp;#39;t arieande visit a bunch of Cobb&amp;#39;s memories at one point? &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s possible she saw the house there? I can&amp;#39;t remember if she explicitly sees that scene or not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dge124v", "score_hidden": false, "stickied": false, "created": 1492488174.0, "created_utc": 1492459374.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]