[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Since the moment I saw Episode 7 when it premiered, I have been trying to figure out what will happen in 8 and 9. And I think I&amp;#39;ve come up with a theory that makes sense (and the Ep.8 Teaser Trailer helps), so I want to put it into writing and make it official before Episode 8 comes out. That way, just in case I am write by some crazy stroke of luck, I&amp;#39;ll have proof. So here goes (and I know my theory is far fetched and it&amp;#39;s all just for fun, but please don&amp;#39;t count it out until you&amp;#39;ve read it all. You might just agree with me).&lt;/p&gt;\n\n&lt;p&gt;Luke is training Rey to defeat Kylo and Snoke because he cannot do it alone. Once, they defeat them, Luke will turn on Rey and reveal that he has fallen to the Dark side.&lt;/p&gt;\n\n&lt;p&gt;This matchup, Luke vs. Rey will be the final epic battle of Ep.9.&lt;/p&gt;\n\n&lt;p&gt;Walking out of the theatre, the most pressing matter on my mind was Rey. Who is she? How does she know the Force? How can she all of a sudden &amp;quot;out-Force&amp;quot; Kylo Ren, who was trained by Luke Skywalker? How come she has flashbacks and visions when she found Anakin&amp;#39;s lightsaber in Maz Kanata&amp;#39;s basement on Takodana? One answer that I came up with seems to answer all of these questions. Rey is Anakin reincarnated. I know, it sounds crazy, but think about it. Anakin&amp;#39;s creation was halfway explained to us in Episode 1. According to his mother, Shmi Skywalker, there is no father. Later, Qui Gon Jinn tests a young Anakin&amp;#39;s blood to find an extraordinary amount of midichlorians. This discovery hints that Anakin was conceived through the Force. So without getting too deep into the religious aspect of things (because that would lengthen this theory even more), Anakin&amp;#39;s inception in Shmi is similar to Jesus&amp;#39;s inception in Mary. Because of this, the writers may have pulled some from Christianity from their story, making Anakin the only character we know about to be born without a father, like Jesus. I do not think it is too much to think that the writers may have pulled from another religion, such as Hinduism or Buddhism, to convey Anakin&amp;#39;s power and meaning to the story. If Anakin is Rey reincarnated, then that explains the visions she has when she touches Anakin&amp;#39;s lightsabers. Touching the saber, an item that was so crucial to Anakin throughout his life, provoked visions in Rey that were brought on by Anakin&amp;#39;s reincarnated presence. But how come some of the visions were of the future? Like Rey facing off against Kylo and the Knights in the rain. Well, if I had to explain it, it&amp;#39;d be that Anakin always had a strong gift of foresight, like when he could sense and dream that his mom was in danger in Episode 2, and that this gift of foresight has found Rey because, well, she&amp;#39;s Anakin.&lt;/p&gt;\n\n&lt;p&gt;Look, I&amp;#39;m not admitting to knowing everything about reincarnation and how it works, but if Anakin is simply a creation of the Force, I think it&amp;#39;s reasonable to think that when he died at the end of Episode 6, his Force being chose another body to inhabit.&lt;/p&gt;\n\n&lt;p&gt;Also, throughout the prequels it is made clear to the audience that Anakin is the chosen one to bring balance to the Force. When he falls to the Dark side and later dies, he seemingly fails this monumental task. Or did he? At the end of Episode 6, Darth Vader apparently comes to terms with his past as he looks at and talks to Luke. I think that seeing Luke care so much (or appear to care so much) about defeating the Empire made Vader realize that his true destiny was not with the Dark side. And, since he died with unfinished business (to be the one to restore balance to the force) his insanely powerful Force abilities lived on and found an unsuspecting host.&lt;/p&gt;\n\n&lt;p&gt;Next, why has Luke been hiding for most of the time between Episode 6 and Episode 7? I believe that Luke gave in to the Dark side at the end of Episode 6. When Yoda trains Luke on Dagobah, Luke senses that his friends are in trouble and leaves to go save them. However, when contemplating leaving, Yoda tells Luke, &amp;quot;Only a fully trained Jedi Knight, with the Force as his ally, will conquer Vader and his emperor. If you end your training now... if you choose the quick and easy path as Vader did... you will become an agent of evil.&amp;quot; Luke left. Then in Episode 6, when facing Sidious and Vader on Death Star II, Luke affirms Yoda&amp;#39;s prediction and gives in to the Dark side. Before the final battle between Luke and Vader, Sidious says, &amp;quot;Take your weapon. Strike me down with all of your hatred and your journey towards the Dark side will be complete.&amp;quot; And what does Luke do? He tries to strike Sidious down! And if that&amp;#39;s not enough, let&amp;#39;s talk about Luke&amp;#39;s character in the original trilogy, specifically Return of the Jedi.&lt;/p&gt;\n\n&lt;p&gt;In the third installment of the original trilogy, Luke is a pretty menacing character. Even the way he dressed is suspicious to me. Throughout the movie, he is dressed in all black, a color typically warn by Siths of the Dark side -- even in the prequel trilogy, this is the case. Jedi usually dress in brown and tan clothes. However, another aspiring Jedi master donned the black clothing before Luke did. Anakin. And we all know his story. So is the clothing a hint into Luke&amp;#39;s newfound, evil path? I think so. Even when he showed up to Jabba&amp;#39;s Palace to rescue his friends, Luke looked identical to a cloaked Sith Lord.&lt;/p&gt;\n\n&lt;p&gt;Also, I want to note the similarities between the scene in Revenge of the Sith where Mace Windu reverses Sidious&amp;#39;s Force Lightning back on to him and the scene in Return of the Jedi when Sidious casts the Force Lightning onto Luke. The two scenes can be watched below:&lt;/p&gt;\n\n&lt;p&gt;[youtube &lt;a href=\"https://www.youtube.com/watch?v=ZavPBSTDxBc&amp;amp;w=560&amp;amp;h=315\"&gt;https://www.youtube.com/watch?v=ZavPBSTDxBc&amp;amp;w=560&amp;amp;h=315&lt;/a&gt;]&lt;/p&gt;\n\n&lt;p&gt;[youtube &lt;a href=\"https://www.youtube.com/watch?v=lbbG02LB7g0&amp;amp;w=560&amp;amp;h=315\"&gt;https://www.youtube.com/watch?v=lbbG02LB7g0&amp;amp;w=560&amp;amp;h=315&lt;/a&gt;]&lt;/p&gt;\n\n&lt;p&gt;In ROTS, Palpatine is the one begging for mercy and asking Anakin to help. In ROTJ, Luke is the one being helplessly electrocuted, begging for help from Darth Vader (Anakin). In ROTS, Palpatine&amp;#39;s begging pushes Anakin to cut off Windu&amp;#39;s arm, giving Palpatine the upper hand once again (no pun intended), resulting in the death of Mace Windu. In ROTJ, Luke&amp;#39;s pleading persuaded Vader to pick up the Emperor and throw him into a seemingly endless pit to his death. When Palpatine is being electrocuted by Mace Windu, you can&amp;#39;t help but notice his sly remarks about being &amp;quot;too weak&amp;quot; or &amp;quot;too old&amp;quot;, an attempt to garner the sympathy of Anakin in a deceitful manner. However, I feel as though Luke does the same thing when writhing in agony. His attempt to sway his father to come to aid is successful and Vader has done Luke&amp;#39;s job for him (killing the Emperor). It&amp;#39;s also hard not to notice how quickly Luke recovered from the lightning shocks. It was immediate. Luke played the whole thing like a true Sith Lord. To end and move on, I&amp;#39;ll raise my last suspicion, Return of the Jedi was originally titled Revenge of the Jedi. Isn&amp;#39;t revenge a little sinister for a Jedi?&lt;/p&gt;\n\n&lt;p&gt;From Episode 7, we know that Luke trained a group of young Jedi, but things went awry when Kylo turned to the Dark side. But is that the actual story? I choose to think not. I think that Luke, having followed Anakin&amp;#39;s path of giving in to the Dark side, taught the ways of the Dark to Kylo, his most promising apprentice. Then together, they killed the others, Luke stayed behind, went into hiding, and Kylo went to become Snoke&amp;#39;s &amp;quot;apprentice&amp;quot;. This brings into question the &amp;quot;Rule of Two&amp;quot;. This rule is a philosophy created by Darth Bane that says only two Siths can exist at any given time. Throughout Episodes 4-6, Vader and Sidious were the 2. So who are the two in Episodes 7-9?&lt;/p&gt;\n\n&lt;p&gt;Most people think Snoke and Kylo fit the Rule of Two. I don&amp;#39;t think so. I have never felt that Kylo is a true Sith. He seems too weak, weaker than Darth Maul, Dooku, or Vader ever were, all of whom were apprentices to Darth Sidious. To me, Kylo seems to be too timid, to unwilling to commit to the Dark side. He just seems to have a complex, I don&amp;#39;t know. Additionally, to become a Sith, one must kill a loved one, broadly known as &amp;quot;the sacrifice.&amp;quot; one might argue that Kylo killing Han Solo is his sacrifice. But if Kylo resented his parents so heavily, then could the father he hates be counted as a &amp;quot;loved one&amp;quot;? I think it was a failed attempt at his sacrifice. Because of this though, he&amp;#39;s out of the running to complete the Rule of Two. Also, keep in mind that the sacrifice does not have to be a direct murder. It can also be an action done deliberately that causes the death of someone -- Like in Anakin&amp;#39;s case, his sacrifice came when he cut off Windu&amp;#39;s arm in Revenge of the Sith, resulting in Palpatine hurling Windu to his death. This will come into play with Luke&amp;#39;s sacrifice to becoming to a Sith. &lt;/p&gt;\n\n&lt;p&gt;So, again, who are the two? Darth Plagueis and Luke Skywalker. Plagueis was first introduced to us in Revenge of the Sith when Sidious tells Anakin about a powerful Sith Lord who learned to use the Force to prevent loved ones from dying. Now, Sidious tells Anakin that his apprentice killed him in his sleep, yes. But if Plagueis mastered a power to revive people, couldn&amp;#39;t he have revived himself? So, his apprentice (who is assumed to be Sidious) thinks he is dead when he actually may have just been weakened and went into hiding for some time to regain his power. And now he&amp;#39;s returned under the moniker of Supreme Leader Snoke, leader of the First Order. And I&amp;#39;ve already discussed most of my reasoning as to why Luke is a Sith. But still one question remains, who was his sacrifice? Simple, his father. As mentioned above, the sacrifice does not have to be a direct murder. When Luke deviously persuades his father to rescue him from the Emperor&amp;#39;s lightning, the lightning consequently kills Vader. &lt;/p&gt;\n\n&lt;p&gt;My last point is centered around the Episode 8 teaser trailer, which I feel has further reinforced my theory. At the end of the trailer, Luke is seen in an ominously dark setting, and he says, &amp;quot;I only know one truth. It&amp;#39;s time for the Jedi to end.&amp;quot; Why would he say that if he is not plotting to end the personally end the Jedi and take over the galaxy? I guess we will have to wait to find out. Check out the official teaser trailer below. &lt;/p&gt;\n\n&lt;p&gt;[youtube &lt;a href=\"https://www.youtube.com/watch?v=Gn0WzX3OcAU&amp;amp;w=560&amp;amp;h=315\"&gt;https://www.youtube.com/watch?v=Gn0WzX3OcAU&amp;amp;w=560&amp;amp;h=315&lt;/a&gt;]&lt;/p&gt;\n\n&lt;p&gt;So, with all of this laid out, what will happen in Episodes 8 and 9?&lt;/p&gt;\n\n&lt;p&gt;In Episode 8, Luke will finish training Rey and they will work together to defeat Kylo, Snoke, and the First Order. At the end of the movie, Luke will reveal his true intent, ruling the galaxy as the most powerful Sith Lord ever. Then in Episode 9, the movie will revolve around a final battle between Rey and Luke. And if my theory holds true, Rey vs. Luke will actually be Anakin vs. Luke again. Rey will win and fulfill the prophecy that Anakin is the chosen one to restore balance to the Force and all will be well in the &amp;quot;galaxy far, far away.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I know this whole thing is far-fetched and of course, all speculative, but I also think it&amp;#39;s somewhat reasonable. But only time will tell if my theory is correct. Thanks for reading!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Since the moment I saw Episode 7 when it premiered, I have been trying to figure out what will happen in 8 and 9. And I think I've come up with a theory that makes sense (and the Ep.8 Teaser Trailer helps), so I want to put it into writing and make it official before Episode 8 comes out. That way, just in case I am write by some crazy stroke of luck, I'll have proof. So here goes (and I know my theory is far fetched and it's all just for fun, but please don't count it out until you've read it all. You might just agree with me).\n\nLuke is training Rey to defeat Kylo and Snoke because he cannot do it alone. Once, they defeat them, Luke will turn on Rey and reveal that he has fallen to the Dark side.\n\nThis matchup, Luke vs. Rey will be the final epic battle of Ep.9.\n\nWalking out of the theatre, the most pressing matter on my mind was Rey. Who is she? How does she know the Force? How can she all of a sudden \"out-Force\" Kylo Ren, who was trained by Luke Skywalker? How come she has flashbacks and visions when she found Anakin's lightsaber in Maz Kanata's basement on Takodana? One answer that I came up with seems to answer all of these questions. Rey is Anakin reincarnated. I know, it sounds crazy, but think about it. Anakin's creation was halfway explained to us in Episode 1. According to his mother, Shmi Skywalker, there is no father. Later, Qui Gon Jinn tests a young Anakin's blood to find an extraordinary amount of midichlorians. This discovery hints that Anakin was conceived through the Force. So without getting too deep into the religious aspect of things (because that would lengthen this theory even more), Anakin's inception in Shmi is similar to Jesus's inception in Mary. Because of this, the writers may have pulled some from Christianity from their story, making Anakin the only character we know about to be born without a father, like Jesus. I do not think it is too much to think that the writers may have pulled from another religion, such as Hinduism or Buddhism, to convey Anakin's power and meaning to the story. If Anakin is Rey reincarnated, then that explains the visions she has when she touches Anakin's lightsabers. Touching the saber, an item that was so crucial to Anakin throughout his life, provoked visions in Rey that were brought on by Anakin's reincarnated presence. But how come some of the visions were of the future? Like Rey facing off against Kylo and the Knights in the rain. Well, if I had to explain it, it'd be that Anakin always had a strong gift of foresight, like when he could sense and dream that his mom was in danger in Episode 2, and that this gift of foresight has found Rey because, well, she's Anakin.\n\nLook, I'm not admitting to knowing everything about reincarnation and how it works, but if Anakin is simply a creation of the Force, I think it's reasonable to think that when he died at the end of Episode 6, his Force being chose another body to inhabit.\n\nAlso, throughout the prequels it is made clear to the audience that Anakin is the chosen one to bring balance to the Force. When he falls to the Dark side and later dies, he seemingly fails this monumental task. Or did he? At the end of Episode 6, Darth Vader apparently comes to terms with his past as he looks at and talks to Luke. I think that seeing Luke care so much (or appear to care so much) about defeating the Empire made Vader realize that his true destiny was not with the Dark side. And, since he died with unfinished business (to be the one to restore balance to the force) his insanely powerful Force abilities lived on and found an unsuspecting host.\n\nNext, why has Luke been hiding for most of the time between Episode 6 and Episode 7? I believe that Luke gave in to the Dark side at the end of Episode 6. When Yoda trains Luke on Dagobah, Luke senses that his friends are in trouble and leaves to go save them. However, when contemplating leaving, Yoda tells Luke, \"Only a fully trained Jedi Knight, with the Force as his ally, will conquer Vader and his emperor. If you end your training now... if you choose the quick and easy path as Vader did... you will become an agent of evil.\" Luke left. Then in Episode 6, when facing Sidious and Vader on Death Star II, Luke affirms Yoda's prediction and gives in to the Dark side. Before the final battle between Luke and Vader, Sidious says, \"Take your weapon. Strike me down with all of your hatred and your journey towards the Dark side will be complete.\" And what does Luke do? He tries to strike Sidious down! And if that's not enough, let's talk about Luke's character in the original trilogy, specifically Return of the Jedi.\n\nIn the third installment of the original trilogy, Luke is a pretty menacing character. Even the way he dressed is suspicious to me. Throughout the movie, he is dressed in all black, a color typically warn by Siths of the Dark side -- even in the prequel trilogy, this is the case. Jedi usually dress in brown and tan clothes. However, another aspiring Jedi master donned the black clothing before Luke did. Anakin. And we all know his story. So is the clothing a hint into Luke's newfound, evil path? I think so. Even when he showed up to Jabba's Palace to rescue his friends, Luke looked identical to a cloaked Sith Lord.\n\nAlso, I want to note the similarities between the scene in Revenge of the Sith where Mace Windu reverses Sidious's Force Lightning back on to him and the scene in Return of the Jedi when Sidious casts the Force Lightning onto Luke. The two scenes can be watched below:\n\n[youtube https://www.youtube.com/watch?v=ZavPBSTDxBc&amp;w=560&amp;h=315]\n\n[youtube https://www.youtube.com/watch?v=lbbG02LB7g0&amp;w=560&amp;h=315]\n\nIn ROTS, Palpatine is the one begging for mercy and asking Anakin to help. In ROTJ, Luke is the one being helplessly electrocuted, begging for help from Darth Vader (Anakin). In ROTS, Palpatine's begging pushes Anakin to cut off Windu's arm, giving Palpatine the upper hand once again (no pun intended), resulting in the death of Mace Windu. In ROTJ, Luke's pleading persuaded Vader to pick up the Emperor and throw him into a seemingly endless pit to his death. When Palpatine is being electrocuted by Mace Windu, you can't help but notice his sly remarks about being \"too weak\" or \"too old\", an attempt to garner the sympathy of Anakin in a deceitful manner. However, I feel as though Luke does the same thing when writhing in agony. His attempt to sway his father to come to aid is successful and Vader has done Luke's job for him (killing the Emperor). It's also hard not to notice how quickly Luke recovered from the lightning shocks. It was immediate. Luke played the whole thing like a true Sith Lord. To end and move on, I'll raise my last suspicion, Return of the Jedi was originally titled Revenge of the Jedi. Isn't revenge a little sinister for a Jedi?\n\nFrom Episode 7, we know that Luke trained a group of young Jedi, but things went awry when Kylo turned to the Dark side. But is that the actual story? I choose to think not. I think that Luke, having followed Anakin's path of giving in to the Dark side, taught the ways of the Dark to Kylo, his most promising apprentice. Then together, they killed the others, Luke stayed behind, went into hiding, and Kylo went to become Snoke's \"apprentice\". This brings into question the \"Rule of Two\". This rule is a philosophy created by Darth Bane that says only two Siths can exist at any given time. Throughout Episodes 4-6, Vader and Sidious were the 2. So who are the two in Episodes 7-9?\n\nMost people think Snoke and Kylo fit the Rule of Two. I don't think so. I have never felt that Kylo is a true Sith. He seems too weak, weaker than Darth Maul, Dooku, or Vader ever were, all of whom were apprentices to Darth Sidious. To me, Kylo seems to be too timid, to unwilling to commit to the Dark side. He just seems to have a complex, I don't know. Additionally, to become a Sith, one must kill a loved one, broadly known as \"the sacrifice.\" one might argue that Kylo killing Han Solo is his sacrifice. But if Kylo resented his parents so heavily, then could the father he hates be counted as a \"loved one\"? I think it was a failed attempt at his sacrifice. Because of this though, he's out of the running to complete the Rule of Two. Also, keep in mind that the sacrifice does not have to be a direct murder. It can also be an action done deliberately that causes the death of someone -- Like in Anakin's case, his sacrifice came when he cut off Windu's arm in Revenge of the Sith, resulting in Palpatine hurling Windu to his death. This will come into play with Luke's sacrifice to becoming to a Sith. \n\nSo, again, who are the two? Darth Plagueis and Luke Skywalker. Plagueis was first introduced to us in Revenge of the Sith when Sidious tells Anakin about a powerful Sith Lord who learned to use the Force to prevent loved ones from dying. Now, Sidious tells Anakin that his apprentice killed him in his sleep, yes. But if Plagueis mastered a power to revive people, couldn't he have revived himself? So, his apprentice (who is assumed to be Sidious) thinks he is dead when he actually may have just been weakened and went into hiding for some time to regain his power. And now he's returned under the moniker of Supreme Leader Snoke, leader of the First Order. And I've already discussed most of my reasoning as to why Luke is a Sith. But still one question remains, who was his sacrifice? Simple, his father. As mentioned above, the sacrifice does not have to be a direct murder. When Luke deviously persuades his father to rescue him from the Emperor's lightning, the lightning consequently kills Vader. \n\nMy last point is centered around the Episode 8 teaser trailer, which I feel has further reinforced my theory. At the end of the trailer, Luke is seen in an ominously dark setting, and he says, \"I only know one truth. It's time for the Jedi to end.\" Why would he say that if he is not plotting to end the personally end the Jedi and take over the galaxy? I guess we will have to wait to find out. Check out the official teaser trailer below. \n\n[youtube https://www.youtube.com/watch?v=Gn0WzX3OcAU&amp;w=560&amp;h=315]\n\nSo, with all of this laid out, what will happen in Episodes 8 and 9?\n\nIn Episode 8, Luke will finish training Rey and they will work together to defeat Kylo, Snoke, and the First Order. At the end of the movie, Luke will reveal his true intent, ruling the galaxy as the most powerful Sith Lord ever. Then in Episode 9, the movie will revolve around a final battle between Rey and Luke. And if my theory holds true, Rey vs. Luke will actually be Anakin vs. Luke again. Rey will win and fulfill the prophecy that Anakin is the chosen one to restore balance to the Force and all will be well in the \"galaxy far, far away.\"\n\nI know this whole thing is far-fetched and of course, all speculative, but I also think it's somewhat reasonable. But only time will tell if my theory is correct. Thanks for reading!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65n06j", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "A5APLuigi", "saved": false, "mod_reports": [], "name": "t3_65n06j", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/sfc9EsisL841whWGfRRpPVKmrmNYA9aaunfgb70Z0g8.jpg?s=7c492f777bf08bf613185625c726bc5f", "width": 480, "height": 360}, "resolutions": [{"url": "https://i.redditmedia.com/sfc9EsisL841whWGfRRpPVKmrmNYA9aaunfgb70Z0g8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=bb283fa5a72219eb4a92b06d86612916", "width": 108, "height": 81}, {"url": "https://i.redditmedia.com/sfc9EsisL841whWGfRRpPVKmrmNYA9aaunfgb70Z0g8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=221858b3272ec4245fd27191225d3b32", "width": 216, "height": 162}, {"url": "https://i.redditmedia.com/sfc9EsisL841whWGfRRpPVKmrmNYA9aaunfgb70Z0g8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=a424c7c2a19e01a7e0a1b08b4c078d79", "width": 320, "height": 240}], "variants": {}, "id": "BchCOXmGnuwMjXG4jWZRkZL-EHe_ZM4pFXjoKI_VCOs"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65n06j/star_wars_8_and_9_theory_luke_is_a_sith_and_rey/", "num_reports": null, "locked": false, "stickied": false, "created": 1492339386.0, "url": "https://www.reddit.com/r/FanTheories/comments/65n06j/star_wars_8_and_9_theory_luke_is_a_sith_and_rey/", "author_flair_text": null, "quarantine": false, "title": "Star Wars 8 and 9 Theory: Luke is a Sith and Rey is Anakin", "created_utc": 1492310586.0, "distinguished": null, "media": null, "upvote_ratio": 0.46, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65n06j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65n06j", "likes": null, "replies": "", "user_reports": [], "id": "dge0sbd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "One_Winged_Rook", "parent_id": "t1_dgbod8k", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Marvel (a Disney owned company) just made the decision not too long ago that Captain America had been Hydra *the whole time*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Marvel (a Disney owned company) just made the decision not too long ago that Captain America had been Hydra &lt;em&gt;the whole time&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dge0sbd", "score_hidden": false, "stickied": false, "created": 1492487864.0, "created_utc": 1492459064.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65n06j", "likes": null, "replies": "", "user_reports": [], "id": "dgclvj8", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "rednblue525252", "parent_id": "t1_dgbod8k", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "k", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;k&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgclvj8", "score_hidden": false, "stickied": false, "created": 1492407049.0, "created_utc": 1492378249.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbod8k", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "chancellortobyiii", "parent_id": "t3_65n06j", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "No, I don't think Disney, the producers, writers, and directors would want to endure the shit storm from fans and nerds when they make Luke, the linchpin of the beloved original trilogy, a Sith of all things. I don't think George Lucas would condone such a development as well. Just imagine how Catholics would react if the Catholic Church came out and said Jesus was Satan all along.", "edited": 1492316941.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, I don&amp;#39;t think Disney, the producers, writers, and directors would want to endure the shit storm from fans and nerds when they make Luke, the linchpin of the beloved original trilogy, a Sith of all things. I don&amp;#39;t think George Lucas would condone such a development as well. Just imagine how Catholics would react if the Catholic Church came out and said Jesus was Satan all along.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgbod8k", "score_hidden": false, "stickied": false, "created": 1492345500.0, "created_utc": 1492316700.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]