[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TL:DR VERSION&lt;/strong&gt; - &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Batman uses fear tactics, intimidation and superstition to scare criminals to stop them from committing crimes but research on criminal psychology says that such tactics may not always be effective and can have a backlash and criminals are more likely to commit crimes again. Is Batman actually aware that he is a criminal, just like the monsters that he fights against?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;While it may be a necessary approach to target corrupt criminals and for those who willingly commit crimes because they want to, what about people who commit crimes because they have to or because they have no other choice? Research says that those who commit crimes are not as &amp;quot;evil&amp;quot; as they are portrayed and sometimes, they are people with a tragic background or commit crimes to survive.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;And what about the issue regarding Arkham Asylum? Is it meant to help and rehabilitate these criminals to reduce the chances to commit crimes in the future or is it just another &amp;quot;loony bin for the evil ones and the crazies&amp;quot; which is very similar to a setting of that from a psychological horror film? Does Arkham Asylum exist just to let them rot and not meant to help them at all? Research says that it is is not the most effective approach to &amp;quot;bring justice&amp;quot; to these criminals as it gives this black and white mentality and sees the mentally ill as evil people and cannot be cured or rehabilitated in any way and more likely to be ostracised from the rest of society and commit crimes in the future.&lt;/em&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Just to clarify, I am a Batman fan, meaning I have nothing against him and I am not trying to criticise against the lore and mentality of Batman but through my years of reading comics and watching other media related to the lore of Batman, I do often find dilemmas and ironies that do not really make much sense.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;(and also, I am pretty much aware that different interpretations of Batman vary from writer to writer)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Apart from the fact that he is human and has no superpowers which make him more relatable, he has three things that make him unique: the persistence and indomitable willpower, his incredible amount of wealth which gives him an endless arsenal of tools and equipment to use, and this extremely logical, tactical, and scientific mind since he is a thinker, planner and a detective.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I do understand for sure that he has a huge grudge against crime and he promised to avenge his parents’ deaths against all criminals after having to suffer that horrible trauma at a very young age, so I can understand why he is willing to punish all criminals and why he was willing to go all out to even become a persona of intimidation and superstition to make criminals shit their pants before committing a crime. Though his main motivation is his will to avenge his parents, he took a logical choice to commit to the “no kill” rule because he didn’t want to be at the same level of his enemies as he said once in Batman Year One “scum maybe. But even scum have &lt;a href=\"http://www.readcomics.tv/batman-year-one-special-edition/chapter-1/single\"&gt;families&lt;/a&gt;” (pg. 16)and as a true personification of justice, not vengeance &lt;em&gt;(even though it shows that he doesn’t like the justice system or how it works because if he did, he would have probably become a police officer or a lawyer)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Plus, he wants to fight crime ... by becoming a criminal &lt;em&gt;(obviously, since he is a vigilante)&lt;/em&gt; though he once said to Robin in the DC Animated Movie “Son of Batman”, &lt;a href=\"https://www.youtube.com/watch?v=b2W4RVpj9A8\"&gt;“You cannot fight crime by becoming a criminal”&lt;/a&gt;. Right, because vigilantism is not illegal at all, right? But in the &lt;a href=\"https://www.youtube.com/watch?v=_KfsAK3fIQo\"&gt;“Dark Knight Returns”&lt;/a&gt; animated movie and in the latest movie &lt;a href=\"https://www.youtube.com/watch?v=XwiNzV6QMog\"&gt;“Batman v Superman”&lt;/a&gt;, Batman himself acknowledged that he is actually a criminal. So is he aware that he is a technically a criminal because his actions do not actually make him a law abiding citizen or not? Does he actually see himself in a black and white or me vs them mentality?&lt;/p&gt;\n\n&lt;p&gt;But even though he will willing to induce fear in the hearts of all criminals in Gotham and since Batman is more or less a thinker, isn’t he aware that his actions of being Batman are making things worse?&lt;/p&gt;\n\n&lt;p&gt;Since Batman is pretty much a brains-kind of hero as one of his many fields that he learned during his training was &lt;a href=\"http://vignette4.wikia.nocookie.net/batman/images/9/93/Batman_biography_Arkham_City.jpg/revision/latest?cb=20150717063603\"&gt;criminal psychology&lt;/a&gt; &lt;em&gt;(among many other fields of knowledge)&lt;/em&gt;, shouldn’t Batman be aware that not all criminals, especially people who do petty crimes like pickpocketing, are not actually bad people but people who were in bad situations like &lt;a href=\"https://www.psychologytoday.com/blog/inside-the-criminal-mind/201412/crime-causes-poverty\"&gt;poverty&lt;/a&gt; which one of the common factors of crime? &lt;em&gt;(of course, that does not mean that the crime is justified because some form of discipline and justice is still required before things get worse)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Like Mr. Freeze has a motivation that we can sympathise with because he found out that his wife is terminally ill and commits crime &lt;a href=\"http://batman.wikia.com/wiki/Victor_Fries\"&gt;to find the cure for his wife&lt;/a&gt; or in the last few pages of The Killing Joke, Batman was willing to sympathise with the Joker and offer him to chance &lt;a href=\"http://imgur.com/gallery/R7UDF\"&gt;to help or rehabilitate him&lt;/a&gt; to stop their long fight before one of them kills the other.&lt;/p&gt;\n\n&lt;p&gt;Plus, as such as I do agree that some criminals deserve to have a taste of their own medicine and show the meaning of fear &lt;em&gt;(like Black Mask, the Penguin and the Joker)&lt;/em&gt; because before Bruce Wayne took the persona of Batman, Gotham is incredibly corrupt from both criminals and people who work with the law. &lt;/p&gt;\n\n&lt;p&gt;But shouldn’t Batman know that this action makes people more likely to go back and commit crimes in the future? There is this phenomenon in psychology known as &lt;a href=\"http://www.apa.org/news/press/releases/2015/10/fear-based-appeals.aspx\"&gt;fear appeal&lt;/a&gt; where people use fear tactics to motivate people to avoid doing a behaviour once that fear was induced &lt;em&gt;(for example, to avoid smokers from smoking, you show them explicit pictures from what a smoker’s lung is like)&lt;/em&gt;. It sounds good on paper but there is a catch – too much fear will backfire and the whole phenomenon goes backwards, what is known as the &lt;a href=\"https://www.ohpe.ca/node/113\"&gt;boomerang effect&lt;/a&gt; and knowing how Batman behaves and treats his enemies, he intentionally wants to traumatise them and scar them for life. The more you treat them as criminals, the more they will start thinking of themselves as criminals, the more likely it will turn into a &lt;a href=\"https://books.google.com.mt/books?id=jvAQ4Bhm5FIC&amp;amp;pg=PA57&amp;amp;lpg=PA57&amp;amp;dq=boomerang+effect+self+fulfilling+prophecy&amp;amp;source=bl&amp;amp;ots=ssO7FHuQbn&amp;amp;sig=p-n2FElx22v82TahkPRAxbaS9VM&amp;amp;hl=en&amp;amp;sa=X&amp;amp;ved=0ahUKEwj-5YD6iqDTAhUBmxQKHUvGA-AQ6AEIJDAB#v=onepage&amp;amp;q=boomerang%20effect%20self%20fulfilling%20prophecy&amp;amp;f=false\"&gt;self-fulfilling prophecy&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Plus, not to mention of how many of his enemies broke out of Arkham Asylum or Blackgate to commit crimes again just so that they would get their revenge or cause havoc because ... why not?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Speaking of Arhkam Asylum ... it is not really the most helpful of places to help rehabilitate the criminally insane. \nFor starters, it has “Asylum” in its name, not “hospital” or “clinic”, it’s a name spells out “home for the insane and the freaks”. Now even though most of Batman’s enemies go there in hopes of being rehabilitated and hopefully law abiding citizens, that place doesn’t really look so ... hopeful. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://ell.stackexchange.com/questions/8024/what-is-the-word-that-is-used-nowadays-to-mean-asylum\"&gt;Out of mind and out of sight&lt;/a&gt; to further distance these criminals from everyone else, making them feel more isolated and feel that they are different than everyone else. Feeling that they deserve that kind of “punishment” because they are too inhuman and dangerous &lt;em&gt;(which they are in some way)&lt;/em&gt; to be in a “hospital” that is specially designed to care for patients/clients like them which is built in within the city. It gives out this us vs them mentality&lt;/p&gt;\n\n&lt;p&gt;I mean, comic book interpretations of that place and even in the Arkham Asylum game, you can clearly see that Arkham Asylum is nothing more but an asylum straight from a &lt;a href=\"http://batman.wikia.com/wiki/Arkham_Asylum\"&gt;psychological horror movie&lt;/a&gt; of an old Victorian era design &lt;/p&gt;\n\n&lt;p&gt;Imagine those mentally ill patients who are dangerous and violent and commit crimes without their intention or awareness &lt;em&gt;(such as a very hostile schizophrenic or a guy with multiple personality disorder with an abusive past and one of his personalities is his physically abusive reckless parent)&lt;/em&gt;, imagine the fear and anxiety that the setting provokes to those patients.&lt;/p&gt;\n\n&lt;p&gt;So if you want to rehabilitate and treat these patients who are taken there, you are already not doing a very good job with the setting &lt;em&gt;(not to mention the chances of being discriminated and de-individualised from staff and other people who work there)&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;Plus, some of the staff there are not really there to help people. Some of them are .. well, criminally insane as the criminals who are put there such as &lt;a href=\"http://dc.wikia.com/wiki/Hugo_Strange_(New_Earth\"&gt;Hugo Strange&lt;/a&gt;). So if you know someone who even looks like a mentally deranged person or you have a hunch that he or she is so mentally out of touch with reality and is prone or wants to do horrible things to you or to someone else &lt;em&gt;(whether it was done intentionally/consciously or not, which contract to popular belief, most people who are diagnosed with a mental illness are not actually “crazy” or deranged or even dangerous)&lt;/em&gt;, you can just dump them in Arkham Asylum and throw the key and let them rot &lt;em&gt;(and then these criminals are do feel criminalised and dehumanised and their view as a criminal who does not deserve to be a normal, functioning person slowly diminishes and it becomes a self-fulfilling prophecy)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;So, if Batman’ aim is to treat his enemies and all other criminals who are taken to Arkham Asylum, he is not doing a very good job either and is making things worse. Is Arkham Asylum meant to be a hospital to treat the criminally insane and the mentally ill or is it just another prison where you can dump these criminals and let them rot like Blackgate?&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t managed to see Batman or even Bruce Wayne put much emphasis on making Arkham Asylum a much better while simultaneously keeping the streets of Gotham in check.&lt;/p&gt;\n\n&lt;p&gt;Again, there are plenty of bad criminals in Gotham like Black Mask and the Penguin and they do deserve justice &lt;em&gt;(not punishment)&lt;/em&gt; but we slowly learned that not all of Batman&amp;#39;s enemies are as villainous or as evil as we thought.&lt;/p&gt;\n\n&lt;p&gt;Most of them are physical representations of Batman&amp;#39;s personality &lt;em&gt;(like Bane is Batman&amp;#39;s rage and anger who also lost his own mother but he lived his entire life as a criminal. Or Scarecrow is a physical representation of Batman&amp;#39;s fear tactic but he was a nerdy boy who was physically bullied throughout his childhood and he was unfortunate enough to be a test subject of the fear toxin which violates a lot of ethical issues)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;So, it is quite strange that while Batman took the logical choice to not kill because he sees criminals as people deep down but not invest on rehabilitation or some form of psychological help to these people who help prevent them from committing more crimes.&lt;/p&gt;\n\n&lt;p&gt;Again, the fear tactic has its own benefits and sometimes, it is indeed effective &lt;em&gt;(after all, it is how the legal department and the justice system works to keep law abiding citizens in check though it can sometimes be abused like North Korea&amp;#39;s system is to worship Kim Jung Un or suffer the most horrible tortures)&lt;/em&gt; but too much is still too much and has a lot of consequences&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Again, I love Batman. I love his stories. I love his bravery and his willpower. I love seeing some new plan that he makes out of the whim that I was not aware of and I love the villains because they are very memorable and interesting but taking from a critical and analytical setting and looking through the mind of Batman, if Batman really is a thinker as we think he is, then I guess he has not been doing a very good job to eliminate crime in Gotham and help those who commit crimes because as far as we are aware, Batman realises that his enemies are damaged in some way much like he is, then he may not be doing a very good job to eliminate crime altogether or minimise it at a controllable level. In fact, it would seem that his actions are making things worse.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**TL:DR VERSION** - \n\n*Batman uses fear tactics, intimidation and superstition to scare criminals to stop them from committing crimes but research on criminal psychology says that such tactics may not always be effective and can have a backlash and criminals are more likely to commit crimes again. Is Batman actually aware that he is a criminal, just like the monsters that he fights against?*\n\n*While it may be a necessary approach to target corrupt criminals and for those who willingly commit crimes because they want to, what about people who commit crimes because they have to or because they have no other choice? Research says that those who commit crimes are not as \"evil\" as they are portrayed and sometimes, they are people with a tragic background or commit crimes to survive.*\n\n*And what about the issue regarding Arkham Asylum? Is it meant to help and rehabilitate these criminals to reduce the chances to commit crimes in the future or is it just another \"loony bin for the evil ones and the crazies\" which is very similar to a setting of that from a psychological horror film? Does Arkham Asylum exist just to let them rot and not meant to help them at all? Research says that it is is not the most effective approach to \"bring justice\" to these criminals as it gives this black and white mentality and sees the mentally ill as evil people and cannot be cured or rehabilitated in any way and more likely to be ostracised from the rest of society and commit crimes in the future.*\n\n_________________________________________________________________\n\n________________________________________________\n\nJust to clarify, I am a Batman fan, meaning I have nothing against him and I am not trying to criticise against the lore and mentality of Batman but through my years of reading comics and watching other media related to the lore of Batman, I do often find dilemmas and ironies that do not really make much sense.\n\n*(and also, I am pretty much aware that different interpretations of Batman vary from writer to writer)*\n\nApart from the fact that he is human and has no superpowers which make him more relatable, he has three things that make him unique: the persistence and indomitable willpower, his incredible amount of wealth which gives him an endless arsenal of tools and equipment to use, and this extremely logical, tactical, and scientific mind since he is a thinker, planner and a detective.\n\n____________________________________________________\n\nI do understand for sure that he has a huge grudge against crime and he promised to avenge his parents’ deaths against all criminals after having to suffer that horrible trauma at a very young age, so I can understand why he is willing to punish all criminals and why he was willing to go all out to even become a persona of intimidation and superstition to make criminals shit their pants before committing a crime. Though his main motivation is his will to avenge his parents, he took a logical choice to commit to the “no kill” rule because he didn’t want to be at the same level of his enemies as he said once in Batman Year One “scum maybe. But even scum have [families]( http://www.readcomics.tv/batman-year-one-special-edition/chapter-1/single)” (pg. 16)and as a true personification of justice, not vengeance *(even though it shows that he doesn’t like the justice system or how it works because if he did, he would have probably become a police officer or a lawyer)*\n\nPlus, he wants to fight crime ... by becoming a criminal *(obviously, since he is a vigilante)* though he once said to Robin in the DC Animated Movie “Son of Batman”, [“You cannot fight crime by becoming a criminal”](https://www.youtube.com/watch?v=b2W4RVpj9A8). Right, because vigilantism is not illegal at all, right? But in the [“Dark Knight Returns”](https://www.youtube.com/watch?v=_KfsAK3fIQo) animated movie and in the latest movie [“Batman v Superman”](https://www.youtube.com/watch?v=XwiNzV6QMog), Batman himself acknowledged that he is actually a criminal. So is he aware that he is a technically a criminal because his actions do not actually make him a law abiding citizen or not? Does he actually see himself in a black and white or me vs them mentality?\n\nBut even though he will willing to induce fear in the hearts of all criminals in Gotham and since Batman is more or less a thinker, isn’t he aware that his actions of being Batman are making things worse?\n\nSince Batman is pretty much a brains-kind of hero as one of his many fields that he learned during his training was [criminal psychology](http://vignette4.wikia.nocookie.net/batman/images/9/93/Batman_biography_Arkham_City.jpg/revision/latest?cb=20150717063603) *(among many other fields of knowledge)*, shouldn’t Batman be aware that not all criminals, especially people who do petty crimes like pickpocketing, are not actually bad people but people who were in bad situations like [poverty]( https://www.psychologytoday.com/blog/inside-the-criminal-mind/201412/crime-causes-poverty) which one of the common factors of crime? *(of course, that does not mean that the crime is justified because some form of discipline and justice is still required before things get worse)*\n\nLike Mr. Freeze has a motivation that we can sympathise with because he found out that his wife is terminally ill and commits crime [to find the cure for his wife](http://batman.wikia.com/wiki/Victor_Fries) or in the last few pages of The Killing Joke, Batman was willing to sympathise with the Joker and offer him to chance [to help or rehabilitate him](http://imgur.com/gallery/R7UDF) to stop their long fight before one of them kills the other.\n\nPlus, as such as I do agree that some criminals deserve to have a taste of their own medicine and show the meaning of fear *(like Black Mask, the Penguin and the Joker)* because before Bruce Wayne took the persona of Batman, Gotham is incredibly corrupt from both criminals and people who work with the law. \n\nBut shouldn’t Batman know that this action makes people more likely to go back and commit crimes in the future? There is this phenomenon in psychology known as [fear appeal](http://www.apa.org/news/press/releases/2015/10/fear-based-appeals.aspx) where people use fear tactics to motivate people to avoid doing a behaviour once that fear was induced *(for example, to avoid smokers from smoking, you show them explicit pictures from what a smoker’s lung is like)*. It sounds good on paper but there is a catch – too much fear will backfire and the whole phenomenon goes backwards, what is known as the [boomerang effect](https://www.ohpe.ca/node/113) and knowing how Batman behaves and treats his enemies, he intentionally wants to traumatise them and scar them for life. The more you treat them as criminals, the more they will start thinking of themselves as criminals, the more likely it will turn into a [self-fulfilling prophecy](https://books.google.com.mt/books?id=jvAQ4Bhm5FIC&amp;pg=PA57&amp;lpg=PA57&amp;dq=boomerang+effect+self+fulfilling+prophecy&amp;source=bl&amp;ots=ssO7FHuQbn&amp;sig=p-n2FElx22v82TahkPRAxbaS9VM&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwj-5YD6iqDTAhUBmxQKHUvGA-AQ6AEIJDAB#v=onepage&amp;q=boomerang%20effect%20self%20fulfilling%20prophecy&amp;f=false)\n\nPlus, not to mention of how many of his enemies broke out of Arkham Asylum or Blackgate to commit crimes again just so that they would get their revenge or cause havoc because ... why not?\n\n_________________________________________________________________\n\nSpeaking of Arhkam Asylum ... it is not really the most helpful of places to help rehabilitate the criminally insane. \nFor starters, it has “Asylum” in its name, not “hospital” or “clinic”, it’s a name spells out “home for the insane and the freaks”. Now even though most of Batman’s enemies go there in hopes of being rehabilitated and hopefully law abiding citizens, that place doesn’t really look so ... hopeful. \n\n[Out of mind and out of sight](http://ell.stackexchange.com/questions/8024/what-is-the-word-that-is-used-nowadays-to-mean-asylum) to further distance these criminals from everyone else, making them feel more isolated and feel that they are different than everyone else. Feeling that they deserve that kind of “punishment” because they are too inhuman and dangerous *(which they are in some way)* to be in a “hospital” that is specially designed to care for patients/clients like them which is built in within the city. It gives out this us vs them mentality\n\n\nI mean, comic book interpretations of that place and even in the Arkham Asylum game, you can clearly see that Arkham Asylum is nothing more but an asylum straight from a [psychological horror movie](http://batman.wikia.com/wiki/Arkham_Asylum) of an old Victorian era design \n\nImagine those mentally ill patients who are dangerous and violent and commit crimes without their intention or awareness *(such as a very hostile schizophrenic or a guy with multiple personality disorder with an abusive past and one of his personalities is his physically abusive reckless parent)*, imagine the fear and anxiety that the setting provokes to those patients.\n\nSo if you want to rehabilitate and treat these patients who are taken there, you are already not doing a very good job with the setting *(not to mention the chances of being discriminated and de-individualised from staff and other people who work there)*. \n\nPlus, some of the staff there are not really there to help people. Some of them are .. well, criminally insane as the criminals who are put there such as [Hugo Strange](http://dc.wikia.com/wiki/Hugo_Strange_(New_Earth)). So if you know someone who even looks like a mentally deranged person or you have a hunch that he or she is so mentally out of touch with reality and is prone or wants to do horrible things to you or to someone else *(whether it was done intentionally/consciously or not, which contract to popular belief, most people who are diagnosed with a mental illness are not actually “crazy” or deranged or even dangerous)*, you can just dump them in Arkham Asylum and throw the key and let them rot *(and then these criminals are do feel criminalised and dehumanised and their view as a criminal who does not deserve to be a normal, functioning person slowly diminishes and it becomes a self-fulfilling prophecy)*\n\nSo, if Batman’ aim is to treat his enemies and all other criminals who are taken to Arkham Asylum, he is not doing a very good job either and is making things worse. Is Arkham Asylum meant to be a hospital to treat the criminally insane and the mentally ill or is it just another prison where you can dump these criminals and let them rot like Blackgate?\n\nI haven't managed to see Batman or even Bruce Wayne put much emphasis on making Arkham Asylum a much better while simultaneously keeping the streets of Gotham in check.\n\nAgain, there are plenty of bad criminals in Gotham like Black Mask and the Penguin and they do deserve justice *(not punishment)* but we slowly learned that not all of Batman's enemies are as villainous or as evil as we thought.\n\nMost of them are physical representations of Batman's personality *(like Bane is Batman's rage and anger who also lost his own mother but he lived his entire life as a criminal. Or Scarecrow is a physical representation of Batman's fear tactic but he was a nerdy boy who was physically bullied throughout his childhood and he was unfortunate enough to be a test subject of the fear toxin which violates a lot of ethical issues)*\n\nSo, it is quite strange that while Batman took the logical choice to not kill because he sees criminals as people deep down but not invest on rehabilitation or some form of psychological help to these people who help prevent them from committing more crimes.\n\nAgain, the fear tactic has its own benefits and sometimes, it is indeed effective *(after all, it is how the legal department and the justice system works to keep law abiding citizens in check though it can sometimes be abused like North Korea's system is to worship Kim Jung Un or suffer the most horrible tortures)* but too much is still too much and has a lot of consequences\n\n___________________________________________________________\n\n\n\nAgain, I love Batman. I love his stories. I love his bravery and his willpower. I love seeing some new plan that he makes out of the whim that I was not aware of and I love the villains because they are very memorable and interesting but taking from a critical and analytical setting and looking through the mind of Batman, if Batman really is a thinker as we think he is, then I guess he has not been doing a very good job to eliminate crime in Gotham and help those who commit crimes because as far as we are aware, Batman realises that his enemies are damaged in some way much like he is, then he may not be doing a very good job to eliminate crime altogether or minimise it at a controllable level. In fact, it would seem that his actions are making things worse.\n\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65p1bf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 544, "report_reasons": null, "author": "sammyjamez", "saved": false, "mod_reports": [], "name": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/BcECqv3WhW1gBgbO6VDw3yoK3oLHnopzvJVjn-8n2dU.jpg?s=8a4e1f2ab6fa47da3bd157405c049e38", "width": 1280, "height": 1927}, "resolutions": [{"url": "https://i.redditmedia.com/BcECqv3WhW1gBgbO6VDw3yoK3oLHnopzvJVjn-8n2dU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=42d600fbebc86be290668a362021df6c", "width": 108, "height": 162}, {"url": "https://i.redditmedia.com/BcECqv3WhW1gBgbO6VDw3yoK3oLHnopzvJVjn-8n2dU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=b50b598858bbe5767e40e39fd29628aa", "width": 216, "height": 325}, {"url": "https://i.redditmedia.com/BcECqv3WhW1gBgbO6VDw3yoK3oLHnopzvJVjn-8n2dU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=de1ca730d788ce7bc4f24877628f0e20", "width": 320, "height": 481}, {"url": "https://i.redditmedia.com/BcECqv3WhW1gBgbO6VDw3yoK3oLHnopzvJVjn-8n2dU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=38b63fb6baf54c33267d9bcdea9bbe9f", "width": 640, "height": 963}, {"url": "https://i.redditmedia.com/BcECqv3WhW1gBgbO6VDw3yoK3oLHnopzvJVjn-8n2dU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=c7a80bd5f33cb2ad334cfabc22aa8885", "width": 960, "height": 1445}, {"url": "https://i.redditmedia.com/BcECqv3WhW1gBgbO6VDw3yoK3oLHnopzvJVjn-8n2dU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=245c55f52d00a04521e2a7c70fd1665d", "width": 1080, "height": 1625}], "variants": {}, "id": "UG5rbz6YJ8yo7TKpbhs3e4OoCjG36I_UxqWzNaY2nxU"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": 1492348583.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65p1bf/batman_is_batman_actually_helping_fight_crime_in/", "num_reports": null, "locked": false, "stickied": false, "created": 1492377173.0, "url": "https://www.reddit.com/r/FanTheories/comments/65p1bf/batman_is_batman_actually_helping_fight_crime_in/", "author_flair_text": null, "quarantine": false, "title": "[Batman] Is Batman actually helping fight crime in Gotham or is he actually making it worse?", "created_utc": 1492348373.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 92, "visited": false, "subreddit_type": "public", "ups": 544}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcfdjk", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "fax-on-fax-off", "parent_id": "t1_dgc72i2", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "To be fair that was partially out of guilt.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be fair that was partially out of guilt.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcfdjk", "score_hidden": false, "stickied": false, "created": 1492398593.0, "created_utc": 1492369793.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc72i2", "gilded": 0, "archived": false, "score": 138, "report_reasons": null, "author": "Nerrolken", "parent_id": "t1_dgc6afk", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "There's also a whole episode of TAS where Batman is checking in on Harley during her therapy, and when she gets out she struggles to adjust to \"normal\" life and he keeps trying to help her get on her feet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s also a whole episode of TAS where Batman is checking in on Harley during her therapy, and when she gets out she struggles to adjust to &amp;quot;normal&amp;quot; life and he keeps trying to help her get on her feet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc72i2", "score_hidden": false, "stickied": false, "created": 1492387602.0, "created_utc": 1492358802.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 138}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgd9mhy", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Bane047", "parent_id": "t1_dgd1wuw", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Maybe someone should just tell Freeze that anyone who has been completely frozen for that long is definitely brain dead.", "edited": 1492424766.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe someone should just tell Freeze that anyone who has been completely frozen for that long is definitely brain dead.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd9mhy", "score_hidden": false, "stickied": false, "created": 1492444876.0, "created_utc": 1492416076.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd1wuw", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Zykium", "parent_id": "t1_dgc6afk", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Doesn't he also make sure Mr. Freeze has access to a lab for research when he captures him?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doesn&amp;#39;t he also make sure Mr. Freeze has access to a lab for research when he captures him?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd1wuw", "score_hidden": false, "stickied": false, "created": 1492428905.0, "created_utc": 1492400105.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6afk", "gilded": 0, "archived": false, "score": 187, "report_reasons": null, "author": "Evadson", "parent_id": "t1_dgc61uy", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "That's correct.  There's a scene in the Animated Series where Batman beats up a random thug in front of his family, but later it's revealed he also got the guy a job at Wayne Enterprises and he left crime behind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s correct.  There&amp;#39;s a scene in the Animated Series where Batman beats up a random thug in front of his family, but later it&amp;#39;s revealed he also got the guy a job at Wayne Enterprises and he left crime behind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc6afk", "score_hidden": false, "stickied": false, "created": 1492386537.0, "created_utc": 1492357737.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 187}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcmc53", "gilded": 0, "archived": false, "score": 43, "report_reasons": null, "author": "silverbean", "parent_id": "t1_dgc61uy", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Bruce has spent years trying to rehabilitate Harvey. Two-Face is one of his biggest failures. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bruce has spent years trying to rehabilitate Harvey. Two-Face is one of his biggest failures. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcmc53", "score_hidden": false, "stickied": false, "created": 1492407656.0, "created_utc": 1492378856.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 43}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcviyp", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "TownsUnderground", "parent_id": "t1_dgcneu5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Got me again flash!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Got me again flash!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcviyp", "score_hidden": false, "stickied": false, "created": 1492420074.0, "created_utc": 1492391274.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcneu5", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Redhavok", "parent_id": "t1_dgcc4t5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Sort of related, one of my favorite moments in JLA was when they go into a villains bar and Flash just has a casual conversation with Trickster to make sure he is doing ok", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sort of related, one of my favorite moments in JLA was when they go into a villains bar and Flash just has a casual conversation with Trickster to make sure he is doing ok&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcneu5", "score_hidden": false, "stickied": false, "created": 1492409076.0, "created_utc": 1492380276.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcfbq9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sammyjamez", "parent_id": "t1_dgcerdw", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "So in the end, it is an inevitable piece of the puzzle and it is also a double-edged sword. I guess, it is necessary for Batman to be there or else, the criminal activity in Gotham will continue to escalate and go out of control but even Batman should be aware of his actions. For example, he gives this monstriousity of a persona who is there for revenge and to keep crime in Gotham in check but Batman has to be aware to never truly become the monster that he created *(like in the latest Arkham game, which I won't spoil if nobody played it yet, focuses a lot on this)*, and also making sure that he does not replace the police or the justice system. He is not someone who is above the justice system but he is around it. More like another person who is not the justice department's side but is not really a fan of it either so he has own way to handle crime but of course, like every other thing in life, it has its own consequences.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So in the end, it is an inevitable piece of the puzzle and it is also a double-edged sword. I guess, it is necessary for Batman to be there or else, the criminal activity in Gotham will continue to escalate and go out of control but even Batman should be aware of his actions. For example, he gives this monstriousity of a persona who is there for revenge and to keep crime in Gotham in check but Batman has to be aware to never truly become the monster that he created &lt;em&gt;(like in the latest Arkham game, which I won&amp;#39;t spoil if nobody played it yet, focuses a lot on this)&lt;/em&gt;, and also making sure that he does not replace the police or the justice system. He is not someone who is above the justice system but he is around it. More like another person who is not the justice department&amp;#39;s side but is not really a fan of it either so he has own way to handle crime but of course, like every other thing in life, it has its own consequences.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcfbq9", "score_hidden": false, "stickied": false, "created": 1492398526.0, "created_utc": 1492369726.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcerdw", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Mtt30", "parent_id": "t1_dgcei5p", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I'm pretty sure the trades of the first volumes have been released for Batman and maybe even Detective Comics. Those shouldn't be sold out and you can read the first story arc for both runs. The Batman series is I am Gotham and deals with two new superheroes coming to Gotham while Detective Comics is called Rise of The Batmen, you really just have to read that, you can't describe it without spoilers. It has the Clayface redemption bit in it. Also, the Batman, Detective Comics, and Nightwing cross over event Night of the Monster Men is out, also worth a check. Night of the Monster Men shows just how badly Gotham can need Batman and just how much Batman can harm Gotham. It's the kind of duality that could make even Two Face's head spin.", "edited": 1492378289.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty sure the trades of the first volumes have been released for Batman and maybe even Detective Comics. Those shouldn&amp;#39;t be sold out and you can read the first story arc for both runs. The Batman series is I am Gotham and deals with two new superheroes coming to Gotham while Detective Comics is called Rise of The Batmen, you really just have to read that, you can&amp;#39;t describe it without spoilers. It has the Clayface redemption bit in it. Also, the Batman, Detective Comics, and Nightwing cross over event Night of the Monster Men is out, also worth a check. Night of the Monster Men shows just how badly Gotham can need Batman and just how much Batman can harm Gotham. It&amp;#39;s the kind of duality that could make even Two Face&amp;#39;s head spin.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcerdw", "score_hidden": false, "stickied": false, "created": 1492397779.0, "created_utc": 1492368979.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcei5p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sammyjamez", "parent_id": "t1_dgce7ne", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yeah, I know. They must have been already sold out in the bookstore that I was in", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I know. They must have been already sold out in the bookstore that I was in&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcei5p", "score_hidden": false, "stickied": false, "created": 1492397436.0, "created_utc": 1492368636.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgce7ne", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "Mtt30", "parent_id": "t1_dgce0cv", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "That's the current Batman run. Batman series and The Detective Comic series are both biweekly and release every other week. One week is Batman, the next is Detective Comics. For the most part they probably sell out pretty quickly.", "edited": 1492368591.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the current Batman run. Batman series and The Detective Comic series are both biweekly and release every other week. One week is Batman, the next is Detective Comics. For the most part they probably sell out pretty quickly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgce7ne", "score_hidden": false, "stickied": false, "created": 1492397037.0, "created_utc": 1492368237.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, "user_reports": [], "id": "dgce0cv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sammyjamez", "parent_id": "t1_dgcc4t5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I read a Batman comic last week where Batman is fighting against Bane because he wants the Psycho-Pirate from Blackgate to the point that Batman had to hide the Bat Family in the Fortress of Solitude after they were attacked by Bane\n\nIt was the only Batman comic that I found available on shelves in the bookstore that I found nearby", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read a Batman comic last week where Batman is fighting against Bane because he wants the Psycho-Pirate from Blackgate to the point that Batman had to hide the Bat Family in the Fortress of Solitude after they were attacked by Bane&lt;/p&gt;\n\n&lt;p&gt;It was the only Batman comic that I found available on shelves in the bookstore that I found nearby&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgce0cv", "score_hidden": false, "stickied": false, "created": 1492396768.0, "created_utc": 1492367968.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc4t5", "gilded": 0, "archived": false, "score": 88, "report_reasons": null, "author": "Laragon", "parent_id": "t1_dgc6ixf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Are you currently reading Batman comics? He's legitimately trying to help Clayface turn over a new leaf in Detective Comics. For the other point, reference the Batman: War on Crime graphic novel. These aren't obscure stories from a single issue from long ago. The Detective storyline is running monthly *right now* - you can go out and buy the issues at a comics shop. The graphic novel was a big budget Alex Ross production. You say you love Batman and his stories, but have a glaring lack of knowledge about one of the most important OGNs and the current series.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you currently reading Batman comics? He&amp;#39;s legitimately trying to help Clayface turn over a new leaf in Detective Comics. For the other point, reference the Batman: War on Crime graphic novel. These aren&amp;#39;t obscure stories from a single issue from long ago. The Detective storyline is running monthly &lt;em&gt;right now&lt;/em&gt; - you can go out and buy the issues at a comics shop. The graphic novel was a big budget Alex Ross production. You say you love Batman and his stories, but have a glaring lack of knowledge about one of the most important OGNs and the current series.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcc4t5", "score_hidden": false, "stickied": false, "created": 1492394248.0, "created_utc": 1492365448.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 88}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgc84jk", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "boveah", "parent_id": "t1_dgc6ixf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "There's a lot of stuff just in the new 52 with Bruce planning on rebuilding various parts of Gotham", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a lot of stuff just in the new 52 with Bruce planning on rebuilding various parts of Gotham&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc84jk", "score_hidden": false, "stickied": false, "created": 1492389009.0, "created_utc": 1492360209.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcb8w4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Orange-V-Apple", "parent_id": "t1_dgc6ixf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Under the Red Hood had a little bit of that, too, IIRC", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Under the Red Hood had a little bit of that, too, IIRC&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcb8w4", "score_hidden": false, "stickied": false, "created": 1492393090.0, "created_utc": 1492364290.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgd69sz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DaleGribble88", "parent_id": "t1_dgc6ixf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The was pretty long story ark during the end of the New 52 run where Bruce volunteered at a day care center, and would spend his breaks walking around feeding homeless people, one of whom was most probably the joker. He was totally cool sharing a sandwich the joker on a park bench, feeding ducks or whatever the scene was.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The was pretty long story ark during the end of the New 52 run where Bruce volunteered at a day care center, and would spend his breaks walking around feeding homeless people, one of whom was most probably the joker. He was totally cool sharing a sandwich the joker on a park bench, feeding ducks or whatever the scene was.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd69sz", "score_hidden": false, "stickied": false, "created": 1492436698.0, "created_utc": 1492407898.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6ixf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sammyjamez", "parent_id": "t1_dgc61uy", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 1, "body": "really? somehow I didn't find any comics showing that", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;really? somehow I didn&amp;#39;t find any comics showing that&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc6ixf", "score_hidden": false, "stickied": false, "created": 1492386854.0, "created_utc": 1492358054.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc61uy", "gilded": 0, "archived": false, "score": 274, "report_reasons": null, "author": "Cranyx", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This is  common complaint made by a lot of people who haven't read a lot of Batman comics. There are a ton examples of Bruce Wayne helping rebuild Gotham and legitimate attempts to reform villains.", "edited": 1492357774.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is  common complaint made by a lot of people who haven&amp;#39;t read a lot of Batman comics. There are a ton examples of Bruce Wayne helping rebuild Gotham and legitimate attempts to reform villains.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc61uy", "score_hidden": false, "stickied": false, "created": 1492386212.0, "created_utc": 1492357412.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 274}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgc84kr", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "AgentSkidMarks", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This was essentially the argument of the joker in The Dark Knight. Batman puts a strain on the criminal underground and they turn to absurd tactics and bizarre personalities to accomplish their goals and fight Batman.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was essentially the argument of the joker in The Dark Knight. Batman puts a strain on the criminal underground and they turn to absurd tactics and bizarre personalities to accomplish their goals and fight Batman.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc84kr", "score_hidden": false, "stickied": false, "created": 1492389011.0, "created_utc": 1492360211.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgd6vlu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DaleGribble88", "parent_id": "t1_dgd0kwa", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I feel there is also an argument for the Riddler through Tim Drake. It is important to remember that Tim is an excellent detective, depending on who you ask, on par with or better than Bruce himself. Even if Batman did not exist, Tim's curiosity and sense of justice would. While Tim might not have become the superhero Red Robin, he still would have most likely become a detective, at the very least as a hobby. The Riddler lives to taunt, and this is something Tim would simply not be able to ignore.  \nThis might be considered a bad augment because it feels like I'm implying a world without Batman would just create a different Batman, which isn't what I'm trying to say. The closest parallel I can think of, which isn't great I know, but it is the best I can think of on the spot is like L and Kira from Death Note.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel there is also an argument for the Riddler through Tim Drake. It is important to remember that Tim is an excellent detective, depending on who you ask, on par with or better than Bruce himself. Even if Batman did not exist, Tim&amp;#39;s curiosity and sense of justice would. While Tim might not have become the superhero Red Robin, he still would have most likely become a detective, at the very least as a hobby. The Riddler lives to taunt, and this is something Tim would simply not be able to ignore.&lt;br/&gt;\nThis might be considered a bad augment because it feels like I&amp;#39;m implying a world without Batman would just create a different Batman, which isn&amp;#39;t what I&amp;#39;m trying to say. The closest parallel I can think of, which isn&amp;#39;t great I know, but it is the best I can think of on the spot is like L and Kira from Death Note.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd6vlu", "score_hidden": false, "stickied": false, "created": 1492437979.0, "created_utc": 1492409179.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0kwa", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Afalstein", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "A common theory, and compelling, but wrong.  BTAS dealt with this a lot. There was a particular episode which had a new DA, Janet Van Dyne, who was gunning hard for Batman.  She was kidnapped and force to advocate him before a jury of Arkham inmates.  What the episode brought out beautifully is that plenty of the criminals are horrible for completely personal reasons that have nothing to do with Batman.  Mad Hatter, for instance, is a pervert mind controller.  Zasz is a serial killer, plain and simple.  Poison Ivy would be an environmental terrorist with or without Batman.  Ra's didn't appear in the episode, but he was a psycho long before Bruce put on the cape.\n\nReally, the only one you could say this of might be Joker and the Riddler, who are obsessed with Batman and always trying to defeat him.  But even there, Joker is a terrible person--if he wasn't obsessed with Bats, he'd be obsessed with Gordon or something.\n\nEnd of the episode, Janet has come around on Batman, but she says, \"I'm still going to fight for a city without a Batman.\"\n\nAnd Batman says: \"Me too.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A common theory, and compelling, but wrong.  BTAS dealt with this a lot. There was a particular episode which had a new DA, Janet Van Dyne, who was gunning hard for Batman.  She was kidnapped and force to advocate him before a jury of Arkham inmates.  What the episode brought out beautifully is that plenty of the criminals are horrible for completely personal reasons that have nothing to do with Batman.  Mad Hatter, for instance, is a pervert mind controller.  Zasz is a serial killer, plain and simple.  Poison Ivy would be an environmental terrorist with or without Batman.  Ra&amp;#39;s didn&amp;#39;t appear in the episode, but he was a psycho long before Bruce put on the cape.&lt;/p&gt;\n\n&lt;p&gt;Really, the only one you could say this of might be Joker and the Riddler, who are obsessed with Batman and always trying to defeat him.  But even there, Joker is a terrible person--if he wasn&amp;#39;t obsessed with Bats, he&amp;#39;d be obsessed with Gordon or something.&lt;/p&gt;\n\n&lt;p&gt;End of the episode, Janet has come around on Batman, but she says, &amp;quot;I&amp;#39;m still going to fight for a city without a Batman.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And Batman says: &amp;quot;Me too.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd0kwa", "score_hidden": false, "stickied": false, "created": 1492426969.0, "created_utc": 1492398169.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgdboax", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sammyjamez", "parent_id": "t1_dgcr1q1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "dw, dude. it's cool \n\n\nand btw, I am open to criticism.\n\nheck, I may be the most wrong Batman fan ever", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dw, dude. it&amp;#39;s cool &lt;/p&gt;\n\n&lt;p&gt;and btw, I am open to criticism.&lt;/p&gt;\n\n&lt;p&gt;heck, I may be the most wrong Batman fan ever&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdboax", "score_hidden": false, "stickied": false, "created": 1492451906.0, "created_utc": 1492423106.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcr1q1", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "deadbydurden", "parent_id": "t1_dgcba0p", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Sorry for giving you that impression. I really don't. I just don't believe that arguing against you will help to change your opinion for the better. Your current opinion is as valid as mine. It's a glass half full / half empty situation.    \n\nI think you'll like Gotham Central though. Try it out, it's a great run from the perspective of the Gotham PD. It shows how Batman is seen as a vigilante (and kind of a criminal) by the cops, but they still understand how he's necessary for the greater good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for giving you that impression. I really don&amp;#39;t. I just don&amp;#39;t believe that arguing against you will help to change your opinion for the better. Your current opinion is as valid as mine. It&amp;#39;s a glass half full / half empty situation.    &lt;/p&gt;\n\n&lt;p&gt;I think you&amp;#39;ll like Gotham Central though. Try it out, it&amp;#39;s a great run from the perspective of the Gotham PD. It shows how Batman is seen as a vigilante (and kind of a criminal) by the cops, but they still understand how he&amp;#39;s necessary for the greater good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcr1q1", "score_hidden": false, "stickied": false, "created": 1492414054.0, "created_utc": 1492385254.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcjbhs", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "noryu", "parent_id": "t1_dgcba0p", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I don't think there is a right or wrong, u/deadbydurden is right in the sense that canonically batman has changed a lot, just like all fictional characters do over time, while I chose to respond earlier in the context I view the current Batman perspective. Of which, I am a fan :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think there is a right or wrong, &lt;a href=\"/u/deadbydurden\"&gt;u/deadbydurden&lt;/a&gt; is right in the sense that canonically batman has changed a lot, just like all fictional characters do over time, while I chose to respond earlier in the context I view the current Batman perspective. Of which, I am a fan :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcjbhs", "score_hidden": false, "stickied": false, "created": 1492403722.0, "created_utc": 1492374922.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgd7ws4", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "myriiad", "parent_id": "t1_dgcba0p", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "He literally spent his entire post explaining why he thinks its pointless to fight about it. \n\nYou are the one coming off as wanting to start a fight. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He literally spent his entire post explaining why he thinks its pointless to fight about it. &lt;/p&gt;\n\n&lt;p&gt;You are the one coming off as wanting to start a fight. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd7ws4", "score_hidden": false, "stickied": false, "created": 1492440319.0, "created_utc": 1492411519.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcba0p", "gilded": 0, "archived": false, "score": -58, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgc842n", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcba0p", "score_hidden": false, "stickied": false, "created": 1492393131.0, "created_utc": 1492364331.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -58}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc842n", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "deadbydurden", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Two things:   \n1. It depends on what you take as canon  \n2. Your own personal pre-conceived opinion. \n\nTruth is, after Frank Miller and Alan Moore basically gave birth to the Modern \"Dark\" age of batman comics, it has become popular to think of batman in 'edgy' terms, like he's making Gotham worse, he and the Joker are two sides of the same coin, etc. etc. Those are ideas that were created more or less in a vacuum, as are many ideas and iterations of comic book heroes. It ignores alot of legitimate canonical evidence, such as Bruce's charity work, him helping people not just through violence, etc. Real comic book readers know this, and therefore pick and choose areas of the Batman canon that they prefer and are self-aware of their selectivity. They can argue which runs are better or worse, but for the most part, everyone respects each other's preferences. It's only the less dedicated or read fans that are unaware of this and take any recent interpretation or run as gospel, and hence try to come to concrete conclusions.     \n\nPersonally, I think you're welcome to your own opinion. If I really wanted to, I could drag up tons of evidence against you, but I think that's not the point, because I don't think there's one conclusion at all anyway--yours or mine. I'd just advise you to realise that there's no one right opinion, and you don't actually have to believe that Batman makes Gotham worse if you don't want to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Two things:&lt;br/&gt;\n1. It depends on what you take as canon&lt;br/&gt;\n2. Your own personal pre-conceived opinion. &lt;/p&gt;\n\n&lt;p&gt;Truth is, after Frank Miller and Alan Moore basically gave birth to the Modern &amp;quot;Dark&amp;quot; age of batman comics, it has become popular to think of batman in &amp;#39;edgy&amp;#39; terms, like he&amp;#39;s making Gotham worse, he and the Joker are two sides of the same coin, etc. etc. Those are ideas that were created more or less in a vacuum, as are many ideas and iterations of comic book heroes. It ignores alot of legitimate canonical evidence, such as Bruce&amp;#39;s charity work, him helping people not just through violence, etc. Real comic book readers know this, and therefore pick and choose areas of the Batman canon that they prefer and are self-aware of their selectivity. They can argue which runs are better or worse, but for the most part, everyone respects each other&amp;#39;s preferences. It&amp;#39;s only the less dedicated or read fans that are unaware of this and take any recent interpretation or run as gospel, and hence try to come to concrete conclusions.     &lt;/p&gt;\n\n&lt;p&gt;Personally, I think you&amp;#39;re welcome to your own opinion. If I really wanted to, I could drag up tons of evidence against you, but I think that&amp;#39;s not the point, because I don&amp;#39;t think there&amp;#39;s one conclusion at all anyway--yours or mine. I&amp;#39;d just advise you to realise that there&amp;#39;s no one right opinion, and you don&amp;#39;t actually have to believe that Batman makes Gotham worse if you don&amp;#39;t want to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc842n", "score_hidden": false, "stickied": false, "created": 1492388994.0, "created_utc": 1492360194.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcfc7r", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "fax-on-fax-off", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Here's the absolute bottom line: there have been villains completely unrelated to Batman who have attempted to destroy Gotham and were foiled by Bats.\n\nAll other arguments take a backseat to this: without Batman, Gotham is a crater.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s the absolute bottom line: there have been villains completely unrelated to Batman who have attempted to destroy Gotham and were foiled by Bats.&lt;/p&gt;\n\n&lt;p&gt;All other arguments take a backseat to this: without Batman, Gotham is a crater.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcfc7r", "score_hidden": false, "stickied": false, "created": 1492398543.0, "created_utc": 1492369743.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcbq48", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Cranyx", "parent_id": "t1_dgcbc6y", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; The joker is evidence for this\n\nThe existence of Joker is not evidence that his actions caused the escalation in violence from the other villains\n\n&gt;as well as all the examples I have given that you're choosing to ignore.\n\nNone of your examples back up the assertion that the Joker caused a rise in theatricality from other villains\n\n&gt;Even if I agree for arguments sake that joker is the only villain that is a result of batman, he's the worst of them, with a kill count of potentially 3,000.\n\nOk, but going back to the original post everyone else would still be around and would have succeeded if Batman weren't around. Do you know how many times Gotham was almost destroyed?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The joker is evidence for this&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The existence of Joker is not evidence that his actions caused the escalation in violence from the other villains&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;as well as all the examples I have given that you&amp;#39;re choosing to ignore.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;None of your examples back up the assertion that the Joker caused a rise in theatricality from other villains&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Even if I agree for arguments sake that joker is the only villain that is a result of batman, he&amp;#39;s the worst of them, with a kill count of potentially 3,000.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ok, but going back to the original post everyone else would still be around and would have succeeded if Batman weren&amp;#39;t around. Do you know how many times Gotham was almost destroyed?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcbq48", "score_hidden": false, "stickied": false, "created": 1492393715.0, "created_utc": 1492364915.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbv5i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MargotRobbieRotten", "parent_id": "t1_dgcbo58", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "You can't just deny jokers existence being dependent on batman. He shows up as a result of batman, in some instances because batman was the one to knock him into the chemicals in the first place, most of his actions are specifically done to fuck with batman, and when batman retires the joker just gives up being a supervillain.\n\nIt's a fundamental part of his character, you can't just sweep it away.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can&amp;#39;t just deny jokers existence being dependent on batman. He shows up as a result of batman, in some instances because batman was the one to knock him into the chemicals in the first place, most of his actions are specifically done to fuck with batman, and when batman retires the joker just gives up being a supervillain.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a fundamental part of his character, you can&amp;#39;t just sweep it away.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcbv5i", "score_hidden": false, "stickied": false, "created": 1492393896.0, "created_utc": 1492365096.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbo58", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "chancellortobyiii", "parent_id": "t1_dgcbc6y", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Again, Gotham's way to a good life always includes a run-in with a Joker.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Again, Gotham&amp;#39;s way to a good life always includes a run-in with a Joker.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcbo58", "score_hidden": false, "stickied": false, "created": 1492393644.0, "created_utc": 1492364844.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbc6y", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "MargotRobbieRotten", "parent_id": "t1_dgcb0i0", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 1, "body": "&gt;  There isn't any evidence for this\n\n\nThe joker is evidence for this, as well as all the examples I have given that you're choosing to ignore.\n\n\nEven if I agree for arguments sake that joker is the only villain that is a result of batman, he's the worst of them, with a kill count of potentially 3,000.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There isn&amp;#39;t any evidence for this&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The joker is evidence for this, as well as all the examples I have given that you&amp;#39;re choosing to ignore.&lt;/p&gt;\n\n&lt;p&gt;Even if I agree for arguments sake that joker is the only villain that is a result of batman, he&amp;#39;s the worst of them, with a kill count of potentially 3,000.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcbc6y", "score_hidden": false, "stickied": false, "created": 1492393211.0, "created_utc": 1492364411.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcb0i0", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Cranyx", "parent_id": "t1_dgcam6s", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Well firstly I wouldn't call Red Hood a villain, and Poison Ivy would still be doing her thing without Batman ever being there. \n\n&gt; But even then, batman is likely why they're so theatrical with it. Sure scarecrow would likely still be using his fear toxin on people, but would he dress up in costume and publicly challenge the entire city? Would two face have his henchmen dress up like him and terrorise the city?\n\nTheir origin stories say you're wrong. Two Face's insistence on his henchman gang wearing costumes comes from his psychosis and perceived mockery of the legal system. Crane uses the suit as a tool to scare people because he naturally looks very non threatening.\n\n&gt;and it's the two of them who push the other supervillains to escalate.\n\nThere isn't any evidence for this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well firstly I wouldn&amp;#39;t call Red Hood a villain, and Poison Ivy would still be doing her thing without Batman ever being there. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But even then, batman is likely why they&amp;#39;re so theatrical with it. Sure scarecrow would likely still be using his fear toxin on people, but would he dress up in costume and publicly challenge the entire city? Would two face have his henchmen dress up like him and terrorise the city?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Their origin stories say you&amp;#39;re wrong. Two Face&amp;#39;s insistence on his henchman gang wearing costumes comes from his psychosis and perceived mockery of the legal system. Crane uses the suit as a tool to scare people because he naturally looks very non threatening.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;and it&amp;#39;s the two of them who push the other supervillains to escalate.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There isn&amp;#39;t any evidence for this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcb0i0", "score_hidden": false, "stickied": false, "created": 1492392781.0, "created_utc": 1492363981.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcam6s", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MargotRobbieRotten", "parent_id": "t1_dgc9rw0", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I just picked the first couple to spring to mind. Obviously varied with continuity, but Poison Ivy resorted to supervillainy specifically to stop batman, Hush has a personal vendetta against batman, Red Hood is a result of failing as batman's sidekick.\n\n\nThere are of course villains who would exist without batman, Scarecrow is a result of his father, Zsasz was always gonna be a serial killer, black mask would've been the head of a crime family. But even then, batman is likely why they're so theatrical with it. Sure scarecrow would likely still be using his fear toxin on people, but would he dress up in costume and publicly challenge the entire city? Would two face have his henchmen dress up like him and terrorise the city?\n\n\nBatman is responsible for the joker, and it's the two of them who push the other supervillains to escalate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just picked the first couple to spring to mind. Obviously varied with continuity, but Poison Ivy resorted to supervillainy specifically to stop batman, Hush has a personal vendetta against batman, Red Hood is a result of failing as batman&amp;#39;s sidekick.&lt;/p&gt;\n\n&lt;p&gt;There are of course villains who would exist without batman, Scarecrow is a result of his father, Zsasz was always gonna be a serial killer, black mask would&amp;#39;ve been the head of a crime family. But even then, batman is likely why they&amp;#39;re so theatrical with it. Sure scarecrow would likely still be using his fear toxin on people, but would he dress up in costume and publicly challenge the entire city? Would two face have his henchmen dress up like him and terrorise the city?&lt;/p&gt;\n\n&lt;p&gt;Batman is responsible for the joker, and it&amp;#39;s the two of them who push the other supervillains to escalate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcam6s", "score_hidden": false, "stickied": false, "created": 1492392250.0, "created_utc": 1492363450.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgd88xf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jimm607", "parent_id": "t1_dgc9rw0", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Also, they're both people who were already criminals, batman inspired their fancy dress but they were already established villains, without batman they'd just be a riddle obsessed criminal and a cat burglar who didn't wear costumes", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, they&amp;#39;re both people who were already criminals, batman inspired their fancy dress but they were already established villains, without batman they&amp;#39;d just be a riddle obsessed criminal and a cat burglar who didn&amp;#39;t wear costumes&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd88xf", "score_hidden": false, "stickied": false, "created": 1492441113.0, "created_utc": 1492412313.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9rw0", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Cranyx", "parent_id": "t1_dgc7mms", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; Selina Kyle sees batman on the news so creates a cat costume, Nygma is stopped by the batman so he dons the riddler persona. \n\nI like that your other two examples are two of Batman's most harmless rogues and have even been good guys.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Selina Kyle sees batman on the news so creates a cat costume, Nygma is stopped by the batman so he dons the riddler persona. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I like that your other two examples are two of Batman&amp;#39;s most harmless rogues and have even been good guys.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc9rw0", "score_hidden": false, "stickied": false, "created": 1492391140.0, "created_utc": 1492362340.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgc9b5c", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "chancellortobyiii", "parent_id": "t1_dgc7mms", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The only thing we can be sure of is that the Joker came out as a response to Batman, but that doesn't mean that the reverse is true as well, that if Batman wasn't there, the Joker would 100% not exist. If Batman wasn't in the picture we can only speculate about the possibility of Joker's existence or non-existence. The only sample we have is Batman being in the picture.\n\nAlso the Joker is not a response to Batman per se but a response to Batman's ideals. Batman is just the personification of an ideal he is a champion of. Saying that the Joker is a response to the person called Batman, rather than the position he is maintaining is sort of an ad hominem attack. \n\nLet's say Batman's ideal is justice, then if most of the people of Gotham subscribed to the ideals of justice then surely a Joker would still rise, even with the absence of a Batman. So what then should Gotham do, in order to stop the rise of a Joker? Embody the ideals of injustice? Then of course the Joker, the very opposite of Batman, won't be needed, because the people of Gotham is already subscribing to that ideal the Joker wants to impart to Gotham.... injustice. For a Joker to rise from a Gotham that is already the embodiment of injustice is like a murderer stabbing an already decaying corpse. Gotham, if she wants to be good, *must* confront  its supervillains, its Joker.", "edited": 1492403889.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only thing we can be sure of is that the Joker came out as a response to Batman, but that doesn&amp;#39;t mean that the reverse is true as well, that if Batman wasn&amp;#39;t there, the Joker would 100% not exist. If Batman wasn&amp;#39;t in the picture we can only speculate about the possibility of Joker&amp;#39;s existence or non-existence. The only sample we have is Batman being in the picture.&lt;/p&gt;\n\n&lt;p&gt;Also the Joker is not a response to Batman per se but a response to Batman&amp;#39;s ideals. Batman is just the personification of an ideal he is a champion of. Saying that the Joker is a response to the person called Batman, rather than the position he is maintaining is sort of an ad hominem attack. &lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s say Batman&amp;#39;s ideal is justice, then if most of the people of Gotham subscribed to the ideals of justice then surely a Joker would still rise, even with the absence of a Batman. So what then should Gotham do, in order to stop the rise of a Joker? Embody the ideals of injustice? Then of course the Joker, the very opposite of Batman, won&amp;#39;t be needed, because the people of Gotham is already subscribing to that ideal the Joker wants to impart to Gotham.... injustice. For a Joker to rise from a Gotham that is already the embodiment of injustice is like a murderer stabbing an already decaying corpse. Gotham, if she wants to be good, &lt;em&gt;must&lt;/em&gt; confront  its supervillains, its Joker.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc9b5c", "score_hidden": false, "stickied": false, "created": 1492390543.0, "created_utc": 1492361743.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7mms", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "MargotRobbieRotten", "parent_id": "t1_dgc6pc3", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; even if you say that Batman created Joker, it's not like he's to blame for what the Joker does.\n\n\nNo but the question is whether Gotham is better off, no batman = no Joker so in that regard Gotham would be better off without him\n\n&gt; people seeing that Batman \"created\" the Joker and then extrapolating that onto every other villain of his\n\nIt's been suggested by characters in-universe many times, and even confirmed as several other characters' motivations (depending on continuity). Selina Kyle sees batman on the news so creates a cat costume, Nygma is stopped by the batman so he dons the riddler persona. Plus there's the supervillains acquiring more advanced weapons specifically to combat the batman, similar to how Captain Cold's ice gun is intended to stop speedsters.\n\n\nThere's also Barbatos, the bat demon that supposedly is responsible for all the villains as attempts to create the perfect batman and joker, but that whole thing is a little messy and weird.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;even if you say that Batman created Joker, it&amp;#39;s not like he&amp;#39;s to blame for what the Joker does.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No but the question is whether Gotham is better off, no batman = no Joker so in that regard Gotham would be better off without him&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;people seeing that Batman &amp;quot;created&amp;quot; the Joker and then extrapolating that onto every other villain of his&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s been suggested by characters in-universe many times, and even confirmed as several other characters&amp;#39; motivations (depending on continuity). Selina Kyle sees batman on the news so creates a cat costume, Nygma is stopped by the batman so he dons the riddler persona. Plus there&amp;#39;s the supervillains acquiring more advanced weapons specifically to combat the batman, similar to how Captain Cold&amp;#39;s ice gun is intended to stop speedsters.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also Barbatos, the bat demon that supposedly is responsible for all the villains as attempts to create the perfect batman and joker, but that whole thing is a little messy and weird.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc7mms", "score_hidden": false, "stickied": false, "created": 1492388347.0, "created_utc": 1492359547.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6pc3", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Cranyx", "parent_id": "t1_dgc6ao8", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; Yeah but a common point made in a lot of Batman stuff is that the crazies came out of the woodwork because of batman. Obviously it depends on which continuity you look at, but for instance in year one the joker shows up as a response to batman. Batman creates a supervillain arms race.\n\nI hate this argument, I really do. It comes from people seeing that Batman \"created\" the Joker and then extrapolating that onto every other villain of his. Almost no one else is his fault. Two Face went mad because he's always had a repressed personality and the attack by the mob pushed him over the edge, Ra's has been a super criminal for literally hundreds of years, etc. \n\nAlso even if you say that Batman created Joker, it's not like he's to blame for what the Joker does. That's like arguing that the wife is to blame if a husband goes mental and decides she needs to die.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Yeah but a common point made in a lot of Batman stuff is that the crazies came out of the woodwork because of batman. Obviously it depends on which continuity you look at, but for instance in year one the joker shows up as a response to batman. Batman creates a supervillain arms race.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I hate this argument, I really do. It comes from people seeing that Batman &amp;quot;created&amp;quot; the Joker and then extrapolating that onto every other villain of his. Almost no one else is his fault. Two Face went mad because he&amp;#39;s always had a repressed personality and the attack by the mob pushed him over the edge, Ra&amp;#39;s has been a super criminal for literally hundreds of years, etc. &lt;/p&gt;\n\n&lt;p&gt;Also even if you say that Batman created Joker, it&amp;#39;s not like he&amp;#39;s to blame for what the Joker does. That&amp;#39;s like arguing that the wife is to blame if a husband goes mental and decides she needs to die.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc6pc3", "score_hidden": false, "stickied": false, "created": 1492387092.0, "created_utc": 1492358292.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6ao8", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "MargotRobbieRotten", "parent_id": "t1_dgc1k7o", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yeah but a common point made in a lot of Batman stuff is that the crazies came out of the woodwork because of batman. Obviously it depends on which continuity you look at, but for instance in year one the joker shows up as a response to batman. Batman creates a supervillain arms race.\n\n\nIf you take that approach, without batman there's no Joker, no riddler, no Two-face etc. Those people would still exist, but they'd be less supervillainy. For instance the Edward Nygma would likely be assisting criminals, Oswald Cobblepot would be an arms dealer, and so on.\n\n\n\nBut ignoring the supercriminals. There's the corrupt GCPD, a lot of petty crime going on, and organised crime controlling a lot of the city. All of which batman and his sidekicks can be thanked for fixing (to an extent).\n\n\n\nOverall, I think they're better with batman. The big supercriminals tend not to kill except their henchmen, sure there's a serial killer like Zsasz every now and then but they'd likely exist without batman. It's said a few times in comics that the supervillains don't just go around killing innocent civilians out of fear that it would push batman to kill them.\n\n\nOnly caveat that you sort of have to pin on batman is the joker. There's lots of muggings being stopped, a lot of human traffickers and a few serial killer a being put away, but the joker exists because batman exists. I think confirmed kills in comics adds up to something like 600, but he's claimed as high as 3,000. \n\n\nI guess the question is whether having the joker exist cancels out the rest of the crime batman stops.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah but a common point made in a lot of Batman stuff is that the crazies came out of the woodwork because of batman. Obviously it depends on which continuity you look at, but for instance in year one the joker shows up as a response to batman. Batman creates a supervillain arms race.&lt;/p&gt;\n\n&lt;p&gt;If you take that approach, without batman there&amp;#39;s no Joker, no riddler, no Two-face etc. Those people would still exist, but they&amp;#39;d be less supervillainy. For instance the Edward Nygma would likely be assisting criminals, Oswald Cobblepot would be an arms dealer, and so on.&lt;/p&gt;\n\n&lt;p&gt;But ignoring the supercriminals. There&amp;#39;s the corrupt GCPD, a lot of petty crime going on, and organised crime controlling a lot of the city. All of which batman and his sidekicks can be thanked for fixing (to an extent).&lt;/p&gt;\n\n&lt;p&gt;Overall, I think they&amp;#39;re better with batman. The big supercriminals tend not to kill except their henchmen, sure there&amp;#39;s a serial killer like Zsasz every now and then but they&amp;#39;d likely exist without batman. It&amp;#39;s said a few times in comics that the supervillains don&amp;#39;t just go around killing innocent civilians out of fear that it would push batman to kill them.&lt;/p&gt;\n\n&lt;p&gt;Only caveat that you sort of have to pin on batman is the joker. There&amp;#39;s lots of muggings being stopped, a lot of human traffickers and a few serial killer a being put away, but the joker exists because batman exists. I think confirmed kills in comics adds up to something like 600, but he&amp;#39;s claimed as high as 3,000. &lt;/p&gt;\n\n&lt;p&gt;I guess the question is whether having the joker exist cancels out the rest of the crime batman stops.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc6ao8", "score_hidden": false, "stickied": false, "created": 1492386547.0, "created_utc": 1492357747.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgd3nz5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TacticusThrowaway", "parent_id": "t1_dgd27bd", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I know. It's just a funny coincidence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know. It&amp;#39;s just a funny coincidence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd3nz5", "score_hidden": false, "stickied": false, "created": 1492431709.0, "created_utc": 1492402909.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd27bd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chancellortobyiii", "parent_id": "t1_dgcvfzm", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "To be fair, I wasn't alluding to the novel. I haven't even read it....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be fair, I wasn&amp;#39;t alluding to the novel. I haven&amp;#39;t even read it....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd27bd", "score_hidden": false, "stickied": false, "created": 1492429337.0, "created_utc": 1492400537.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcvfzm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TacticusThrowaway", "parent_id": "t1_dgc1k7o", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; If you think Batman is evil, then he is a necessary evil.\n\nFunny. In the Knightfall novel, Gordon thinks that almost word for word.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you think Batman is evil, then he is a necessary evil.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Funny. In the Knightfall novel, Gordon thinks that almost word for word.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcvfzm", "score_hidden": false, "stickied": false, "created": 1492419969.0, "created_utc": 1492391169.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgd9rlr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "netherlanddwarf", "parent_id": "t1_dgc1k7o", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This is a great point!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a great point!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd9rlr", "score_hidden": false, "stickied": false, "created": 1492445340.0, "created_utc": 1492416540.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgc9d1z", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "chancellortobyiii", "parent_id": "t1_dgc7lm5", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "You don't need things to be exactly 100% alike to compare them. The point I'm trying to drive home is that if Batman was indeed evil, then he is a necessary evil. If you think the US is bad, or whatever country your from is bad then go live in North Korea. You paint the picture that the US, specifically the US government is this singular malignant entity. You forget that the US government is composed of individual people that the electorate elects. If it hasn't dawned on you, there is no such place as a Utopia on earth, compromises are inevitable. Be happy with what you have, and if not... dare I say it... CHANGE THE WORLD!", "edited": 1492362905.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t need things to be exactly 100% alike to compare them. The point I&amp;#39;m trying to drive home is that if Batman was indeed evil, then he is a necessary evil. If you think the US is bad, or whatever country your from is bad then go live in North Korea. You paint the picture that the US, specifically the US government is this singular malignant entity. You forget that the US government is composed of individual people that the electorate elects. If it hasn&amp;#39;t dawned on you, there is no such place as a Utopia on earth, compromises are inevitable. Be happy with what you have, and if not... dare I say it... CHANGE THE WORLD!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc9d1z", "score_hidden": false, "stickied": false, "created": 1492390609.0, "created_utc": 1492361809.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7lm5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TronZbot", "parent_id": "t1_dgc1k7o", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "You can't compare the US to Batman. The US creates its own enemies for reasons that benefit the elite. Why do you think Captain America has been an enemy of the state?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can&amp;#39;t compare the US to Batman. The US creates its own enemies for reasons that benefit the elite. Why do you think Captain America has been an enemy of the state?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc7lm5", "score_hidden": false, "stickied": false, "created": 1492388307.0, "created_utc": 1492359507.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1k7o", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "chancellortobyiii", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Who would you rather have? Batman or the plethora of villains and their schemes to end Gotham i.e. Penguin, Joker, Bane, Mr. Freeze. You choose either getting Batman or the whole ensemble of evil. Fighting crime will always get messy, there's no way for it to be squeaky clean. If you think Batman is evil, then he is a necessary evil. In the end its about thinking what will give the best outcome.\n\nIt can be likened to the US government and all its international enemies that wants to topple it down. Who would you want, the US government that guards you while you sleep or ISIS, North Korea, Russia, Al Qaeda  etc etc. Yes the US government might infringe on your liberties, bomb the wrong people, act too late, be a moron once in a while or maybe more frequently than comfortable, but what's the alternative? Unconditional submission to the divine Kim Jong-un?", "edited": 1492362813.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who would you rather have? Batman or the plethora of villains and their schemes to end Gotham i.e. Penguin, Joker, Bane, Mr. Freeze. You choose either getting Batman or the whole ensemble of evil. Fighting crime will always get messy, there&amp;#39;s no way for it to be squeaky clean. If you think Batman is evil, then he is a necessary evil. In the end its about thinking what will give the best outcome.&lt;/p&gt;\n\n&lt;p&gt;It can be likened to the US government and all its international enemies that wants to topple it down. Who would you want, the US government that guards you while you sleep or ISIS, North Korea, Russia, Al Qaeda  etc etc. Yes the US government might infringe on your liberties, bomb the wrong people, act too late, be a moron once in a while or maybe more frequently than comfortable, but what&amp;#39;s the alternative? Unconditional submission to the divine Kim Jong-un?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc1k7o", "score_hidden": false, "stickied": false, "created": 1492379386.0, "created_utc": 1492350586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcfwyj", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Lycaron", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This is somewhat the argument that Ras al Ghul has made in both 'Batman Begins', and somewhat less so in the Arkham series of video games. While Batman works as a fear based deterrent, he is somewhat responsible for the escalation of criminals in Gotham. He has led to the creation of the supervillains that now plague the city. However, the logic he follows is that if Batman were to go one step further, and take the lives of those who commit crimes, this would heighten the fear to a much more effective level. In turn though, this seems like it would suffer the same drawback in the long run, either due to public uprising against the executioner figure, or whether criminals would again heighten their plans to combat this is an interesting idea. But I think there is still enough argument in comics that Bruce Wayne helps to balance the issues that Batman could be seen to cause, by taking action to protect more vulnerable groups and rebuild the city as his parents had done before him", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is somewhat the argument that Ras al Ghul has made in both &amp;#39;Batman Begins&amp;#39;, and somewhat less so in the Arkham series of video games. While Batman works as a fear based deterrent, he is somewhat responsible for the escalation of criminals in Gotham. He has led to the creation of the supervillains that now plague the city. However, the logic he follows is that if Batman were to go one step further, and take the lives of those who commit crimes, this would heighten the fear to a much more effective level. In turn though, this seems like it would suffer the same drawback in the long run, either due to public uprising against the executioner figure, or whether criminals would again heighten their plans to combat this is an interesting idea. But I think there is still enough argument in comics that Bruce Wayne helps to balance the issues that Batman could be seen to cause, by taking action to protect more vulnerable groups and rebuild the city as his parents had done before him&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcfwyj", "score_hidden": false, "stickied": false, "created": 1492399305.0, "created_utc": 1492370505.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcxrkd", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "reddittechnica", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "\"And I am reminded, on this holy day, of the sad story of Kitty Genovese. As you all may remember, a long time ago, almost thirty years ago, this poor soul cried out for help time and time again, but no person answered her calls. Though many saw, no one so much as called the police. They all just watched as Kitty was being stabbed to death in broad daylight. They watched as her assailant walked away. Now, we must all fear evil men. But there is another kind of evil which we must fear most, and that is the indifference of good men.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;And I am reminded, on this holy day, of the sad story of Kitty Genovese. As you all may remember, a long time ago, almost thirty years ago, this poor soul cried out for help time and time again, but no person answered her calls. Though many saw, no one so much as called the police. They all just watched as Kitty was being stabbed to death in broad daylight. They watched as her assailant walked away. Now, we must all fear evil men. But there is another kind of evil which we must fear most, and that is the indifference of good men.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcxrkd", "score_hidden": false, "stickied": false, "created": 1492423039.0, "created_utc": 1492394239.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcg05p", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Jopthebass", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Animated series Batman actively tried to help criminals recover and regain a normal life. \n\nThe Snyder/Capullo Zero Year had penguin and Red Hood gang active before Bruce returned to begin a life of heroics. \n\nI think the common denominator in the Batman stories is that crime was a wave that was about to crest and crash on Gotham so he upped his game against them and used guerilla tactics to weaken them enough for honest cops to handle crime. He does what they can't until the battle can be fought honestly and without his intervention. \n\n\nI also just prefer a Batman that is willing to exist beyond crime fighting and is a good hearted man. The idea that insane crime and corruption are the reasons he got hands on. The whole paranoid obsessed Wayne never really tickled my fancy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Animated series Batman actively tried to help criminals recover and regain a normal life. &lt;/p&gt;\n\n&lt;p&gt;The Snyder/Capullo Zero Year had penguin and Red Hood gang active before Bruce returned to begin a life of heroics. &lt;/p&gt;\n\n&lt;p&gt;I think the common denominator in the Batman stories is that crime was a wave that was about to crest and crash on Gotham so he upped his game against them and used guerilla tactics to weaken them enough for honest cops to handle crime. He does what they can&amp;#39;t until the battle can be fought honestly and without his intervention. &lt;/p&gt;\n\n&lt;p&gt;I also just prefer a Batman that is willing to exist beyond crime fighting and is a good hearted man. The idea that insane crime and corruption are the reasons he got hands on. The whole paranoid obsessed Wayne never really tickled my fancy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcg05p", "score_hidden": false, "stickied": false, "created": 1492399423.0, "created_utc": 1492370623.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcvspk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PixelPhase", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "nah", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;nah&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcvspk", "score_hidden": false, "stickied": false, "created": 1492420427.0, "created_utc": 1492391627.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgdr60k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DaleGribble88", "parent_id": "t1_dgdo3td", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "No problem. Quick note about Endgame, is that it isn't totally related to the theme of \"Gotham without Batman\" like volumes 8 and 9. However, you'll need to read it in order to understand anything that is happening in volume 8. So if you start reading that one and feel like I lied a bit - well I kinda did ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem. Quick note about Endgame, is that it isn&amp;#39;t totally related to the theme of &amp;quot;Gotham without Batman&amp;quot; like volumes 8 and 9. However, you&amp;#39;ll need to read it in order to understand anything that is happening in volume 8. So if you start reading that one and feel like I lied a bit - well I kinda did ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdr60k", "score_hidden": false, "stickied": false, "created": 1492477083.0, "created_utc": 1492448283.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdo3td", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RevengeWalrus", "parent_id": "t1_dgdnbgg", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Oh, I thought you were disagreeing. Thanks for the recommendation! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, I thought you were disagreeing. Thanks for the recommendation! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdo3td", "score_hidden": false, "stickied": false, "created": 1492473664.0, "created_utc": 1492444864.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnbgg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DaleGribble88", "parent_id": "t1_dgdfqb6", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Doesn't contradict your opinion one bit, actually supports it without going into spoilers. It just deals with similar themes and I thought you might enjoy reading a story about that situation because of your opinion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doesn&amp;#39;t contradict your opinion one bit, actually supports it without going into spoilers. It just deals with similar themes and I thought you might enjoy reading a story about that situation because of your opinion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdnbgg", "score_hidden": false, "stickied": false, "created": 1492472761.0, "created_utc": 1492443961.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfqb6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RevengeWalrus", "parent_id": "t1_dgd6ztq", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I've read bits and pieces, and it's very good! Does it contradict my opinion in any way? If I recall, Batman comes back at the end because Gotham is basically burning to the ground, right? \n\nFor me, Batman's relationship with Gotham needs to have an end date, otherwise it becomes deeply unethical. He makes sense as an emergency wartime measure, to make up for police corruption and entrenched crime. But once he becomes the status quo, an ongoing guardian, I think you run into some very real issues like what OP laid out here. Batman makes sense as an agent of change, not protection. After a certain point Gotham needs to be actually saved, or the idea of Batman is a failure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read bits and pieces, and it&amp;#39;s very good! Does it contradict my opinion in any way? If I recall, Batman comes back at the end because Gotham is basically burning to the ground, right? &lt;/p&gt;\n\n&lt;p&gt;For me, Batman&amp;#39;s relationship with Gotham needs to have an end date, otherwise it becomes deeply unethical. He makes sense as an emergency wartime measure, to make up for police corruption and entrenched crime. But once he becomes the status quo, an ongoing guardian, I think you run into some very real issues like what OP laid out here. Batman makes sense as an agent of change, not protection. After a certain point Gotham needs to be actually saved, or the idea of Batman is a failure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdfqb6", "score_hidden": false, "stickied": false, "created": 1492462220.0, "created_utc": 1492433420.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd6ztq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DaleGribble88", "parent_id": "t1_dgcgrdi", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "You should totally read Batman New 52 starting at vol. 7, EndGame, through Vol. 9, Bloom. (Assuming you haven't already) It deals with the thought of Batman being unavailable for an extended amount of time, and what effect it would have on the city.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should totally read Batman New 52 starting at vol. 7, EndGame, through Vol. 9, Bloom. (Assuming you haven&amp;#39;t already) It deals with the thought of Batman being unavailable for an extended amount of time, and what effect it would have on the city.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd6ztq", "score_hidden": false, "stickied": false, "created": 1492438238.0, "created_utc": 1492409438.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcgrdi", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "RevengeWalrus", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Batman isn't the problem, Gotham is. The city depends on a single heavily armed vigilante to survive terrorist attacks, break up organized crime, and resolve case by case felonies. The city is completely dependant on a single person breaking the law, like a drug addiction. \n\nIf a city is that fundamentally broken, the national guard and federal government should be involved. Batman is a completely inadequate solution thats probably exacerbating more problems than he solves. ", "edited": 1492374282.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Batman isn&amp;#39;t the problem, Gotham is. The city depends on a single heavily armed vigilante to survive terrorist attacks, break up organized crime, and resolve case by case felonies. The city is completely dependant on a single person breaking the law, like a drug addiction. &lt;/p&gt;\n\n&lt;p&gt;If a city is that fundamentally broken, the national guard and federal government should be involved. Batman is a completely inadequate solution thats probably exacerbating more problems than he solves. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcgrdi", "score_hidden": false, "stickied": false, "created": 1492400413.0, "created_utc": 1492371613.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcejoh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mydarkesthour24", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I like your analysis and think it's a very good argument. My rebuttal is that the difference between Batman and the villains within the Gotham universe would be motive and law. The law can be very subjective in that what may lawfully good wouldn't necessarily be morally good. Batman fills that role where he fills in what the law can't. His motives are always for the greater good at the expense of his own safety and life. These super villains, whether their motives are good or not are at the expense of the safety and lives of others. \n\nI agree that Batman may bring out the worst of a lot of these criminals, but as lawfully gray as Batman is, the politics and corruption within Gotham have to take some of the blame for that as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like your analysis and think it&amp;#39;s a very good argument. My rebuttal is that the difference between Batman and the villains within the Gotham universe would be motive and law. The law can be very subjective in that what may lawfully good wouldn&amp;#39;t necessarily be morally good. Batman fills that role where he fills in what the law can&amp;#39;t. His motives are always for the greater good at the expense of his own safety and life. These super villains, whether their motives are good or not are at the expense of the safety and lives of others. &lt;/p&gt;\n\n&lt;p&gt;I agree that Batman may bring out the worst of a lot of these criminals, but as lawfully gray as Batman is, the politics and corruption within Gotham have to take some of the blame for that as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcejoh", "score_hidden": false, "stickied": false, "created": 1492397494.0, "created_utc": 1492368694.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcfnkp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fax-on-fax-off", "parent_id": "t1_dgcf5z1", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yes because character statements do not trump actions. You take away Batman and Gotham is a crater in a few years. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes because character statements do not trump actions. You take away Batman and Gotham is a crater in a few years. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcfnkp", "score_hidden": false, "stickied": false, "created": 1492398961.0, "created_utc": 1492370161.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcf5z1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "crumbete", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Is something that's been pointed out in dozens of actual Batman stories across multiple forms of media really a fan theory?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is something that&amp;#39;s been pointed out in dozens of actual Batman stories across multiple forms of media really a fan theory?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcf5z1", "score_hidden": false, "stickied": false, "created": 1492398317.0, "created_utc": 1492369517.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcqnv0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "draw_it_now", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "(I went a bit off-topic towards the end, sorry for that!)  \n  \nI've always been a fan of the theory that Batman skirts dangerously close to Fascism, without ever actively becoming one - now, don't get me wrong, I'm sure Bruce Wayne isn't about to click his heels and Heil Hitler - but he may have the mindset of someone predisposed to Fascism, similar to how a well-off person may be more likely to be a Capitalist, or a poor person may identify with Collectivism.  \n  \nThis is somewhat backed up by psychology - Fascist organisations tend to target people who are struggling with self-hatred. I've even heard that members of Fascist organisations have similar psychological profiles to the victims of the Catholic Priest molestation cases.  \n  \nEven if Wayne doesn't declare himself a Fascist, he may still have a Fascist-y worldview, caused by his trauma.  \nHe takes his self-contempt, and converts it into cold hatred for those he blames for his parents' deaths: Criminals.  \nHe may have a degree in criminal psychology, but he ignores the parts that don't fit with his worldview.  \n  \nHow does this make him a Fascist? His views on how to deal with his chosen enemy, is that **violence is the only answer**. If crime is chaos, then order must be put in place by all means necessary - that is, through violence and hierarchy. Furthermore, he distances himself from these accusations by putting resources to criminal reformation - yet he never fully gives up on his bloodlust, always back every night to enact further rage-filled revenge fantasies.  \n  \nAt this point you may be thinking that Batman works outside of the law, so how can he possibly be a symbol of hierarchy? Well that's where the Joker comes in.  \n  \nThe Joker has always had an oddly deep understanding of Batman's motives. He always seems to be egging him on, trying to convince him to laugh or kill.  \nIf we take the Fascist theory as a given, then maybe the Joker isn't merely trying to prove a point - it's possible he wants Batman to become Gotham's dictator. He knows how close Batman is to falling off that cliff, that his rules stop him just short of becoming an actual Fascist, but the Joker wants to see him fall into that pit.", "edited": 1492384957.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(I went a bit off-topic towards the end, sorry for that!)  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always been a fan of the theory that Batman skirts dangerously close to Fascism, without ever actively becoming one - now, don&amp;#39;t get me wrong, I&amp;#39;m sure Bruce Wayne isn&amp;#39;t about to click his heels and Heil Hitler - but he may have the mindset of someone predisposed to Fascism, similar to how a well-off person may be more likely to be a Capitalist, or a poor person may identify with Collectivism.  &lt;/p&gt;\n\n&lt;p&gt;This is somewhat backed up by psychology - Fascist organisations tend to target people who are struggling with self-hatred. I&amp;#39;ve even heard that members of Fascist organisations have similar psychological profiles to the victims of the Catholic Priest molestation cases.  &lt;/p&gt;\n\n&lt;p&gt;Even if Wayne doesn&amp;#39;t declare himself a Fascist, he may still have a Fascist-y worldview, caused by his trauma.&lt;br/&gt;\nHe takes his self-contempt, and converts it into cold hatred for those he blames for his parents&amp;#39; deaths: Criminals.&lt;br/&gt;\nHe may have a degree in criminal psychology, but he ignores the parts that don&amp;#39;t fit with his worldview.  &lt;/p&gt;\n\n&lt;p&gt;How does this make him a Fascist? His views on how to deal with his chosen enemy, is that &lt;strong&gt;violence is the only answer&lt;/strong&gt;. If crime is chaos, then order must be put in place by all means necessary - that is, through violence and hierarchy. Furthermore, he distances himself from these accusations by putting resources to criminal reformation - yet he never fully gives up on his bloodlust, always back every night to enact further rage-filled revenge fantasies.  &lt;/p&gt;\n\n&lt;p&gt;At this point you may be thinking that Batman works outside of the law, so how can he possibly be a symbol of hierarchy? Well that&amp;#39;s where the Joker comes in.  &lt;/p&gt;\n\n&lt;p&gt;The Joker has always had an oddly deep understanding of Batman&amp;#39;s motives. He always seems to be egging him on, trying to convince him to laugh or kill.&lt;br/&gt;\nIf we take the Fascist theory as a given, then maybe the Joker isn&amp;#39;t merely trying to prove a point - it&amp;#39;s possible he wants Batman to become Gotham&amp;#39;s dictator. He knows how close Batman is to falling off that cliff, that his rules stop him just short of becoming an actual Fascist, but the Joker wants to see him fall into that pit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcqnv0", "score_hidden": false, "stickied": false, "created": 1492413528.0, "created_utc": 1492384728.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgdeb3b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dotchan", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "* Absolute poverty (i.e. everybody is poor) does not cause crime, especially not violent crime; rather, it's relative poverty (i.e. the jackass next door/block/neighborhood/city/county/country has more cool swag than I do).\n\n* Not everybody locked up in Arkham Asylum fits the legal definition of not guilty by reason of insanity.  I am not a lawyer, but from what I understand of the law, a) the only kind of insanity that keeps one out of prison is the one where you truly don't understand what you are doing is wrong (and a very, very, very tiny subset of Batman's rogue gallery fits this definition) ; b) being declared insane only means you get treated by a psychiatrist until you are fit to stand trial.\n\n* While it can be argued that Batman partially subsidizes Gotham's legal system with his efforts, he didn't cause it.  The rot's been there for so long it's practically institutionalized.\n\n* Arkham Asylum's issues are not Batman's fault, except that maybe he should be lobbying harder for a better institution (unfortunately for him, \"The Madhouse is Run By the Inmates\" is too powerful a storytelling device to ever go away).  He studied psychology (both general and criminal) insofar as to give him an edge in crime fighting, but he is not a qualified or certified therapist.\n\n* In most continuities, Batman only uses violence to stop crimes in progress, in which case he has the right to self defense (which also extends to the defense of others who cannot defend themselves) and is justified to answer with force equivalent to the threat displayed.  You can argue that he goes over the line, and over how often he does so, but not every Batman is a Punisher wannabe itching for an excuse to punch a guy in the face.\n\n* In most continuities, Batman tries to follow the law pertaining to reasonable suspicion, search, and seizure procedures--the only thing that makes his actions suspect is that he does his stuff without explicit police authorization.  Excepting some weird early stuff before his characterization really came together and the \"grimdarkedgy for its own sake\" reimaginings, no matter how Batman takes a suspect down it pretty much always ends with said suspect being turned over to the legal system.\n\n* In most continuities, Bruce Wayne is a very active philanthropist in Gotham.  Not only does he give to charities (ones I'm sure he thoroughly vetted beforehand), but he personally spearheads projects for the poor and employs those who otherwise wouldn't be given a second chance.\n\n* If I were a truly desperate person in need of food, money, clothes, shelter and good health insurance, would I rather work for a boss a)  who shoots his own underlings for a laugh, or b) who hired a dude with a rap sheet a mile long and is barely ever in the office? If I were a person who either cognitively recognizes, or is told by someone I trust, that I have problems that I need to take care of, would I go to a) a place so fucked up one of its therapists is now running around in a clown costume rollerskating with hyenas, or b) maybe someplace else?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Absolute poverty (i.e. everybody is poor) does not cause crime, especially not violent crime; rather, it&amp;#39;s relative poverty (i.e. the jackass next door/block/neighborhood/city/county/country has more cool swag than I do).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Not everybody locked up in Arkham Asylum fits the legal definition of not guilty by reason of insanity.  I am not a lawyer, but from what I understand of the law, a) the only kind of insanity that keeps one out of prison is the one where you truly don&amp;#39;t understand what you are doing is wrong (and a very, very, very tiny subset of Batman&amp;#39;s rogue gallery fits this definition) ; b) being declared insane only means you get treated by a psychiatrist until you are fit to stand trial.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;While it can be argued that Batman partially subsidizes Gotham&amp;#39;s legal system with his efforts, he didn&amp;#39;t cause it.  The rot&amp;#39;s been there for so long it&amp;#39;s practically institutionalized.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Arkham Asylum&amp;#39;s issues are not Batman&amp;#39;s fault, except that maybe he should be lobbying harder for a better institution (unfortunately for him, &amp;quot;The Madhouse is Run By the Inmates&amp;quot; is too powerful a storytelling device to ever go away).  He studied psychology (both general and criminal) insofar as to give him an edge in crime fighting, but he is not a qualified or certified therapist.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In most continuities, Batman only uses violence to stop crimes in progress, in which case he has the right to self defense (which also extends to the defense of others who cannot defend themselves) and is justified to answer with force equivalent to the threat displayed.  You can argue that he goes over the line, and over how often he does so, but not every Batman is a Punisher wannabe itching for an excuse to punch a guy in the face.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In most continuities, Batman tries to follow the law pertaining to reasonable suspicion, search, and seizure procedures--the only thing that makes his actions suspect is that he does his stuff without explicit police authorization.  Excepting some weird early stuff before his characterization really came together and the &amp;quot;grimdarkedgy for its own sake&amp;quot; reimaginings, no matter how Batman takes a suspect down it pretty much always ends with said suspect being turned over to the legal system.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In most continuities, Bruce Wayne is a very active philanthropist in Gotham.  Not only does he give to charities (ones I&amp;#39;m sure he thoroughly vetted beforehand), but he personally spearheads projects for the poor and employs those who otherwise wouldn&amp;#39;t be given a second chance.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If I were a truly desperate person in need of food, money, clothes, shelter and good health insurance, would I rather work for a boss a)  who shoots his own underlings for a laugh, or b) who hired a dude with a rap sheet a mile long and is barely ever in the office? If I were a person who either cognitively recognizes, or is told by someone I trust, that I have problems that I need to take care of, would I go to a) a place so fucked up one of its therapists is now running around in a clown costume rollerskating with hyenas, or b) maybe someplace else?&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdeb3b", "score_hidden": false, "stickied": false, "created": 1492459339.0, "created_utc": 1492430539.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgdwh4g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yumcake", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Batman's work is first and foremost for Batman. It's to address his wants and needs.\n\n1) Batman helps people, but the reason he does it is to assuage his own personal demons and moral beliefs, and not for the benefit of others. He'd rather keep playing hero even if it means people dying because the problem isn't getting fully addressed. He could, for example, hold a gun and fire it in self-defense. If Joker had knocked on Jim Gordon's door instead of Barbara Gordon's door, there's a chance that Joker would have caught a bullet in the face, saving countless lives, and nobody would think any less of Jim Gordon for having defended himself against a serial killer. It'd be just 1 normal guy with a gun permanently fixing a problem that Batman refuses to.\n\n2) **Batman chooses to be ineffective.** Batman could easily bang it out toe-to-toe with the Hulk or KO superman in a single punch. That's not an outrageous claim: **Batman, Iron Man, and Dr. Doom all have the same powerset!**. They both have effectively infinite wealth and resources, as well as an infinite amount of off-panel free time to accomplish anything they want. Thus Batman would field a hulk-buster suit at any time, or magical armor like Doom. Or even spend a summer with his bestie Zatanna and take out Superman by simply saying \"Srewop On.\" and taking down Superman with one bare fisted punch. \n\nBatman's limitations in dealing with bad guys are self-imposed. He likes the feeling of struggling against bad guys with the least efficient means because of the thrill and satisfaction from smashing faces with his own hands and feet. It's his way of temporarily soothing his own psychological damage. If he really wanted to stop threats, it'd be trivial to do so in a more permanent fashion the way his protege Jason Todd does, with a bullet. \n\nJason Todd himself is an example of Batman's refusal to deal with the Joker problem. He had a wealth of opportunity to stop Joker permanently, and by refusing to do so, Joker was able to kill Jason Todd the way he did. The way the story attempts to make it seem like Red Hood is a little crazy for blaming Batman, but the Joker is quite crazy, you don't blame the Joker for being Joker. But Batman at least likes to pretend that he has the mental capacity to know better and understand that his actions have consequences. Batman himself is pretty commonly depicted as accepting responsibility for what happened to Jason...because he IS responsible.\n\n**And what about getting more help to stop all these deaths in Gotham?** Batman famously has a whole Batfamily of people working for him and applying his methods. But nearly all of them did so over his extreme reluctance and his clear instructions to NOT get involved in protecting the people that Batman is clearly failing to save. Every time an outside hero visits Gotham to stop, I'm sure everybody reading this can tell me how that encounter goes. The visiting hero saves a person, and Batman shows up to say, \"Stop, get out\". Like I said, Batman's activities in Gotham are for Batman first and foremost, not for the good of Gotham.\n\n**Batman wouldn't even need to kill anyone either**. In the case of repeat offenders for whom rehabilitation has been ineffective, Batman has the following alternatives:\n\n1) Instead of constantly trusting a provably incompetent institution to lock these guys up, Batman could invest some of his infinite free time into building his own prison. It's a hell of a lot easier to break out of Arkham than say...the goddamn Phantom Zone! Cobblepot's crafty, but he has nothing at his disposal that could help him out of there. \n\n2) Cripple them. It's grisly, but these are repeat offenders and rehabilitation has been tried in earnest. Obviously, you'd want to apply the minimal amount of force necessary to ensure these guys aren't an ongoing threat. Destroy a kneecap for example, and they'll be confined to limping or the use of a cane, making it impossible for them to contemplate a plan involving any kind of running or fighting. If the first application doesn't work, remove an elbow. Maybe they manage to charismatically cajoke henchmen into dong the evil deeds on their behalf? Destroy their larynx and they'll need have to try to do that gang leadership through text. Sooner or later, they'll be ineffective, and really, nobody's going to feel bad about the serial killer that limps because of they way their last rampage got stopped. You still allow them to live and explore a fulfilling life in rehabilitation.", "edited": 1492454413.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Batman&amp;#39;s work is first and foremost for Batman. It&amp;#39;s to address his wants and needs.&lt;/p&gt;\n\n&lt;p&gt;1) Batman helps people, but the reason he does it is to assuage his own personal demons and moral beliefs, and not for the benefit of others. He&amp;#39;d rather keep playing hero even if it means people dying because the problem isn&amp;#39;t getting fully addressed. He could, for example, hold a gun and fire it in self-defense. If Joker had knocked on Jim Gordon&amp;#39;s door instead of Barbara Gordon&amp;#39;s door, there&amp;#39;s a chance that Joker would have caught a bullet in the face, saving countless lives, and nobody would think any less of Jim Gordon for having defended himself against a serial killer. It&amp;#39;d be just 1 normal guy with a gun permanently fixing a problem that Batman refuses to.&lt;/p&gt;\n\n&lt;p&gt;2) &lt;strong&gt;Batman chooses to be ineffective.&lt;/strong&gt; Batman could easily bang it out toe-to-toe with the Hulk or KO superman in a single punch. That&amp;#39;s not an outrageous claim: &lt;strong&gt;Batman, Iron Man, and Dr. Doom all have the same powerset!&lt;/strong&gt;. They both have effectively infinite wealth and resources, as well as an infinite amount of off-panel free time to accomplish anything they want. Thus Batman would field a hulk-buster suit at any time, or magical armor like Doom. Or even spend a summer with his bestie Zatanna and take out Superman by simply saying &amp;quot;Srewop On.&amp;quot; and taking down Superman with one bare fisted punch. &lt;/p&gt;\n\n&lt;p&gt;Batman&amp;#39;s limitations in dealing with bad guys are self-imposed. He likes the feeling of struggling against bad guys with the least efficient means because of the thrill and satisfaction from smashing faces with his own hands and feet. It&amp;#39;s his way of temporarily soothing his own psychological damage. If he really wanted to stop threats, it&amp;#39;d be trivial to do so in a more permanent fashion the way his protege Jason Todd does, with a bullet. &lt;/p&gt;\n\n&lt;p&gt;Jason Todd himself is an example of Batman&amp;#39;s refusal to deal with the Joker problem. He had a wealth of opportunity to stop Joker permanently, and by refusing to do so, Joker was able to kill Jason Todd the way he did. The way the story attempts to make it seem like Red Hood is a little crazy for blaming Batman, but the Joker is quite crazy, you don&amp;#39;t blame the Joker for being Joker. But Batman at least likes to pretend that he has the mental capacity to know better and understand that his actions have consequences. Batman himself is pretty commonly depicted as accepting responsibility for what happened to Jason...because he IS responsible.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;And what about getting more help to stop all these deaths in Gotham?&lt;/strong&gt; Batman famously has a whole Batfamily of people working for him and applying his methods. But nearly all of them did so over his extreme reluctance and his clear instructions to NOT get involved in protecting the people that Batman is clearly failing to save. Every time an outside hero visits Gotham to stop, I&amp;#39;m sure everybody reading this can tell me how that encounter goes. The visiting hero saves a person, and Batman shows up to say, &amp;quot;Stop, get out&amp;quot;. Like I said, Batman&amp;#39;s activities in Gotham are for Batman first and foremost, not for the good of Gotham.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Batman wouldn&amp;#39;t even need to kill anyone either&lt;/strong&gt;. In the case of repeat offenders for whom rehabilitation has been ineffective, Batman has the following alternatives:&lt;/p&gt;\n\n&lt;p&gt;1) Instead of constantly trusting a provably incompetent institution to lock these guys up, Batman could invest some of his infinite free time into building his own prison. It&amp;#39;s a hell of a lot easier to break out of Arkham than say...the goddamn Phantom Zone! Cobblepot&amp;#39;s crafty, but he has nothing at his disposal that could help him out of there. &lt;/p&gt;\n\n&lt;p&gt;2) Cripple them. It&amp;#39;s grisly, but these are repeat offenders and rehabilitation has been tried in earnest. Obviously, you&amp;#39;d want to apply the minimal amount of force necessary to ensure these guys aren&amp;#39;t an ongoing threat. Destroy a kneecap for example, and they&amp;#39;ll be confined to limping or the use of a cane, making it impossible for them to contemplate a plan involving any kind of running or fighting. If the first application doesn&amp;#39;t work, remove an elbow. Maybe they manage to charismatically cajoke henchmen into dong the evil deeds on their behalf? Destroy their larynx and they&amp;#39;ll need have to try to do that gang leadership through text. Sooner or later, they&amp;#39;ll be ineffective, and really, nobody&amp;#39;s going to feel bad about the serial killer that limps because of they way their last rampage got stopped. You still allow them to live and explore a fulfilling life in rehabilitation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdwh4g", "score_hidden": false, "stickied": false, "created": 1492482982.0, "created_utc": 1492454182.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcq8xv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WereAboutToArgue", "parent_id": "t1_dgcflgh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "There have been stories where villains blame Batman for creating them (my favorite is the \"Trial\" episode of BTAS), but many ultimately admit that they'd be just as messed up without him.", "edited": 1492407090.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There have been stories where villains blame Batman for creating them (my favorite is the &amp;quot;Trial&amp;quot; episode of BTAS), but many ultimately admit that they&amp;#39;d be just as messed up without him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcq8xv", "score_hidden": false, "stickied": false, "created": 1492412953.0, "created_utc": 1492384153.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgcimiw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "noryu", "parent_id": "t1_dgcflgh", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yes, exactly. Seems rather narcissistic doesn't it? Unless of course batman is empathising with these criminals as fellow humans who have vast intelligences and immeasurable suffering in their past, present, or future.\n\n\"You must be the change you wish to see in the world\" - Abraham Lincoln, probably", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, exactly. Seems rather narcissistic doesn&amp;#39;t it? Unless of course batman is empathising with these criminals as fellow humans who have vast intelligences and immeasurable suffering in their past, present, or future.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You must be the change you wish to see in the world&amp;quot; - Abraham Lincoln, probably&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcimiw", "score_hidden": false, "stickied": false, "created": 1492402819.0, "created_utc": 1492374019.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcflgh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sammyjamez", "parent_id": "t1_dgcf9j0", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "So I guess Batman took this approach on purpose. The more he keeps using intimidation tactics on criminals, the more they come back for vengeance and commit more crimes and the more Gotham needs Batman again.\n\nIt comes a cycle that never ends and keeps Batman occupied forever", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I guess Batman took this approach on purpose. The more he keeps using intimidation tactics on criminals, the more they come back for vengeance and commit more crimes and the more Gotham needs Batman again.&lt;/p&gt;\n\n&lt;p&gt;It comes a cycle that never ends and keeps Batman occupied forever&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcflgh", "score_hidden": false, "stickied": false, "created": 1492398883.0, "created_utc": 1492370083.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcf9j0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "noryu", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I agree, mostly, that batman is working against himself and his 'shared' goal of eliminating crime in Gotham. \n\nTL;DR: Batman IS a criminal mastermind, he is simply not straying from his decided path of goodness. A true Dark Knight. The secret is that he truly believes he will eventually win in his war against evil, and that even the most insane and evil deserve a chance at retribution.\n\nHere's the grind: Bruce Wayne, ignoring alternating persona, is pensive and thoughtful because of his awareness of psychology and spirituality; being that he is batman, and that his tactic is fear and pain, he has no choice but to treat criminal minds the way they most understand: through reward and punishment.\n\nThey 'must' be reconditioned and reformed, yet the system in place to do so is lacking and corrupted. Hence his relationship with the head psychologist at Arkham, and his relationship with Jim Gordon. Arkham is not meant to work, which is why Batman is able to retain a certain relationship with his archenemies, very forcefully, as 'old friends' as he also actually has old friends.\n\nNotice his relationship with each Robin; constantly criticizing, constantly affirming. That is, to me, a sign that he treats society and crime the same way. Batman took on the burden of judgement; \"Who has taken crime too far? Who still might?\" And it shows in his personal relationships, and in his mental state.\n\nIf Batman really is the altruist that his fans may know him to be, then *The Dark Night Returns* is my favorite story to the effects of his rigidity on the matter. He retained all of the facets mentioned in OPs post, yet was an old bitter man, due to lack of result. He then goes on to complete his course, being that he grinded on this concept for most of his life, and created an army of similarly minded followers on the path to motivated peace​.\n\nEdit: logic..", "edited": 1492375226.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree, mostly, that batman is working against himself and his &amp;#39;shared&amp;#39; goal of eliminating crime in Gotham. &lt;/p&gt;\n\n&lt;p&gt;TL;DR: Batman IS a criminal mastermind, he is simply not straying from his decided path of goodness. A true Dark Knight. The secret is that he truly believes he will eventually win in his war against evil, and that even the most insane and evil deserve a chance at retribution.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the grind: Bruce Wayne, ignoring alternating persona, is pensive and thoughtful because of his awareness of psychology and spirituality; being that he is batman, and that his tactic is fear and pain, he has no choice but to treat criminal minds the way they most understand: through reward and punishment.&lt;/p&gt;\n\n&lt;p&gt;They &amp;#39;must&amp;#39; be reconditioned and reformed, yet the system in place to do so is lacking and corrupted. Hence his relationship with the head psychologist at Arkham, and his relationship with Jim Gordon. Arkham is not meant to work, which is why Batman is able to retain a certain relationship with his archenemies, very forcefully, as &amp;#39;old friends&amp;#39; as he also actually has old friends.&lt;/p&gt;\n\n&lt;p&gt;Notice his relationship with each Robin; constantly criticizing, constantly affirming. That is, to me, a sign that he treats society and crime the same way. Batman took on the burden of judgement; &amp;quot;Who has taken crime too far? Who still might?&amp;quot; And it shows in his personal relationships, and in his mental state.&lt;/p&gt;\n\n&lt;p&gt;If Batman really is the altruist that his fans may know him to be, then &lt;em&gt;The Dark Night Returns&lt;/em&gt; is my favorite story to the effects of his rigidity on the matter. He retained all of the facets mentioned in OPs post, yet was an old bitter man, due to lack of result. He then goes on to complete his course, being that he grinded on this concept for most of his life, and created an army of similarly minded followers on the path to motivated peace​.&lt;/p&gt;\n\n&lt;p&gt;Edit: logic..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcf9j0", "score_hidden": false, "stickied": false, "created": 1492398447.0, "created_utc": 1492369647.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgd0627", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IHateShovels", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "It's why I always preferred The Punisher.  \n\nBatman has an entire rogues' gallery waiting to break out of an asylum.  \n\nPunisher has a graveyard of people that have crossed him.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s why I always preferred The Punisher.  &lt;/p&gt;\n\n&lt;p&gt;Batman has an entire rogues&amp;#39; gallery waiting to break out of an asylum.  &lt;/p&gt;\n\n&lt;p&gt;Punisher has a graveyard of people that have crossed him.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd0627", "score_hidden": false, "stickied": false, "created": 1492426392.0, "created_utc": 1492397592.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgdhv1e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "deadbydurden", "parent_id": "t1_dgdh6la", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Oh, Thank you for correcting me. I was always a fan of the fan interpretation that Gotham was New York at night and Gotham was New York at day. Wonder why I thought that was possible. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, Thank you for correcting me. I was always a fan of the fan interpretation that Gotham was New York at night and Gotham was New York at day. Wonder why I thought that was possible. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdhv1e", "score_hidden": false, "stickied": false, "created": 1492465735.0, "created_utc": 1492436935.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdh6la", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ZeroCorpse", "parent_id": "t1_dgd8cle", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Actually, it IS across the bay in the comics. \n\nhttp://dccomicsmovie.com/wp-content/uploads/2015/07/New_Adventures_of_Superboy.jpg\n\nhttps://upload.wikimedia.org/wikipedia/en/thumb/6/62/Gotham_City_map_%28Amazing_World_of_DC_Comics%29.jpg/275px-Gotham_City_map_%28Amazing_World_of_DC_Comics%29.jpg\n\nGotham is in New Jersey, and Metropolis is in Delaware. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually, it IS across the bay in the comics. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://dccomicsmovie.com/wp-content/uploads/2015/07/New_Adventures_of_Superboy.jpg\"&gt;http://dccomicsmovie.com/wp-content/uploads/2015/07/New_Adventures_of_Superboy.jpg&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://upload.wikimedia.org/wikipedia/en/thumb/6/62/Gotham_City_map_%28Amazing_World_of_DC_Comics%29.jpg/275px-Gotham_City_map_%28Amazing_World_of_DC_Comics%29.jpg\"&gt;https://upload.wikimedia.org/wikipedia/en/thumb/6/62/Gotham_City_map_%28Amazing_World_of_DC_Comics%29.jpg/275px-Gotham_City_map_%28Amazing_World_of_DC_Comics%29.jpg&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Gotham is in New Jersey, and Metropolis is in Delaware. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdh6la", "score_hidden": false, "stickied": false, "created": 1492464677.0, "created_utc": 1492435877.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8cle", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "deadbydurden", "parent_id": "t1_dgd6mwv", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; Gotham is just across the bay from Metropolis\n\nNot in the comics. That's Zack Snyder's interpretation in BVS. \n\n&gt; Superman could clean up Gotham in a weekend\n\nNot true in the slightest. What makes Superman great is what makes him unable to fix Gotham's real underlying problem: corruption. Superman's brute force, super powers, and idealistic thinking in man's inherent good is a disadvantage when it comes to Gotham, because the criminals of Gotham are rotten to the core. No one understands the depth of rot of Gotham criminals like Batman does, and no other superhero is able to blur the line between criminal and do-gooder like Batman can. Batman can play dirty where Superman cannot (and should not). Joker repeatedly says that only Batman truly understands him, and only Batman can predict him. It is Batman's humanity, paranoia and trauma (all traits that Superman does not have) that make him Gotham's victim as well as saviour. Superman cannot fix Gotham if he cannot understand or comprehend what is wrong with Gotham. Sure, he can catch Gotham criminals with his pinky finger, but there will be a dozen criminals to replace him. You should read No Man's Land, it helps support my argument. ", "edited": 1492412794.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Gotham is just across the bay from Metropolis&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not in the comics. That&amp;#39;s Zack Snyder&amp;#39;s interpretation in BVS. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Superman could clean up Gotham in a weekend&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not true in the slightest. What makes Superman great is what makes him unable to fix Gotham&amp;#39;s real underlying problem: corruption. Superman&amp;#39;s brute force, super powers, and idealistic thinking in man&amp;#39;s inherent good is a disadvantage when it comes to Gotham, because the criminals of Gotham are rotten to the core. No one understands the depth of rot of Gotham criminals like Batman does, and no other superhero is able to blur the line between criminal and do-gooder like Batman can. Batman can play dirty where Superman cannot (and should not). Joker repeatedly says that only Batman truly understands him, and only Batman can predict him. It is Batman&amp;#39;s humanity, paranoia and trauma (all traits that Superman does not have) that make him Gotham&amp;#39;s victim as well as saviour. Superman cannot fix Gotham if he cannot understand or comprehend what is wrong with Gotham. Sure, he can catch Gotham criminals with his pinky finger, but there will be a dozen criminals to replace him. You should read No Man&amp;#39;s Land, it helps support my argument. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd8cle", "score_hidden": false, "stickied": false, "created": 1492441349.0, "created_utc": 1492412549.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgd834s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fax-on-fax-off", "parent_id": "t1_dgd6mwv", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yeah cause Lobo would certainly be better for Gotham than Batman (?)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah cause Lobo would certainly be better for Gotham than Batman (?)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd834s", "score_hidden": false, "stickied": false, "created": 1492440740.0, "created_utc": 1492411940.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd6mwv", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ZeroCorpse", "parent_id": "t1_dgcflk6", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; Gotham's just worse.\n\nThat's the messed up part. Gotham is just across the bay from Metropolis. Superman could clean up Gotham in a weekend, seeing as all Batman's enemies are basically just psychos in silly costumes with weird gimmicks and no powers, but he doesn't do it, and Batman wouldn't like it if he did. \n\nIt just makes no sense. None of Batman's enemies are any match for Supes, and honestly, after dozens of times being thrown in Arkham by Batman only to escape, maybe it's time Superman swoops into Gotham, picks up all the crazies with criminally-oriented fixations, and tosses them into Belle Reve instead of Blackgate or Arkham. \n\nHell, even Supergirl could make short work of guys like the Joker, the Penguin, the Riddler, and even Mr. Freeze. \n\nIf the villains would have existed even if Batman hadn't come into being, it might have been better because it wouldn't be Batman claiming the sole right to capture them; Other heroes (or antiheroes) would fill the gap and probably do a more permanent job of putting them away (or ending them). \n\nI say they should let Black Adam or Lobo have a week to clean up Gotham. That would just about do it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Gotham&amp;#39;s just worse.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s the messed up part. Gotham is just across the bay from Metropolis. Superman could clean up Gotham in a weekend, seeing as all Batman&amp;#39;s enemies are basically just psychos in silly costumes with weird gimmicks and no powers, but he doesn&amp;#39;t do it, and Batman wouldn&amp;#39;t like it if he did. &lt;/p&gt;\n\n&lt;p&gt;It just makes no sense. None of Batman&amp;#39;s enemies are any match for Supes, and honestly, after dozens of times being thrown in Arkham by Batman only to escape, maybe it&amp;#39;s time Superman swoops into Gotham, picks up all the crazies with criminally-oriented fixations, and tosses them into Belle Reve instead of Blackgate or Arkham. &lt;/p&gt;\n\n&lt;p&gt;Hell, even Supergirl could make short work of guys like the Joker, the Penguin, the Riddler, and even Mr. Freeze. &lt;/p&gt;\n\n&lt;p&gt;If the villains would have existed even if Batman hadn&amp;#39;t come into being, it might have been better because it wouldn&amp;#39;t be Batman claiming the sole right to capture them; Other heroes (or antiheroes) would fill the gap and probably do a more permanent job of putting them away (or ending them). &lt;/p&gt;\n\n&lt;p&gt;I say they should let Black Adam or Lobo have a week to clean up Gotham. That would just about do it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd6mwv", "score_hidden": false, "stickied": false, "created": 1492437455.0, "created_utc": 1492408655.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcflk6", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "fax-on-fax-off", "parent_id": "t1_dgc6vaw", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "But plenty of them became villains independently of him. It's not like Dr. Freeze was like \"I have this freeze gun but since no one is running around in a Bat costume I guess I'll just put it away.\"\n\nBatman exists because in his world, supervillains exist. They exist in other cities, countries, and universes. Gotham's just worse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But plenty of them became villains independently of him. It&amp;#39;s not like Dr. Freeze was like &amp;quot;I have this freeze gun but since no one is running around in a Bat costume I guess I&amp;#39;ll just put it away.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Batman exists because in his world, supervillains exist. They exist in other cities, countries, and universes. Gotham&amp;#39;s just worse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcflk6", "score_hidden": false, "stickied": false, "created": 1492398887.0, "created_utc": 1492370087.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6vaw", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ZeroCorpse", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 1, "body": "I've always seen it that Batman came first, and all the psychos in masks with weird gimmicks followed.\n\nIt seems to me that he blazed the trail and made it seem okay for people with psychological problems to take to the streets in colorful costumes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always seen it that Batman came first, and all the psychos in masks with weird gimmicks followed.&lt;/p&gt;\n\n&lt;p&gt;It seems to me that he blazed the trail and made it seem okay for people with psychological problems to take to the streets in colorful costumes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc6vaw", "score_hidden": false, "stickied": false, "created": 1492387319.0, "created_utc": 1492358519.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgc4tjz", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "bigmike67", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Tldr", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tldr&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgc4tjz", "score_hidden": false, "stickied": false, "created": 1492384513.0, "created_utc": 1492355713.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgd35w6", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Byron_Blitzkrieg", "parent_id": "t1_dgcvj4e", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I wonder if the Red Hood never fell into those chemicals, no Joker, No Harley, all those people Joker has killed are alive. Harvey Dent also would have died without Batman, so no Two-Face. That's not even trying to find villains that are tied to Batman.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder if the Red Hood never fell into those chemicals, no Joker, No Harley, all those people Joker has killed are alive. Harvey Dent also would have died without Batman, so no Two-Face. That&amp;#39;s not even trying to find villains that are tied to Batman.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd35w6", "score_hidden": false, "stickied": false, "created": 1492430878.0, "created_utc": 1492402078.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcvj4e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TacticusThrowaway", "parent_id": "t1_dgcsb52", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "&gt; Are any villains reformed?\n\nHarley, depending on the story.\n\n&gt; If you make the claim that Batman is truly helping the community, then why are those problems still around, it's almost as though it didn't matter if he was around.\n\nWould it be worse if he wasn't? Given that he's stopped people who tried to destroy the city with no connection to him, yes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Are any villains reformed?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Harley, depending on the story.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you make the claim that Batman is truly helping the community, then why are those problems still around, it&amp;#39;s almost as though it didn&amp;#39;t matter if he was around.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Would it be worse if he wasn&amp;#39;t? Given that he&amp;#39;s stopped people who tried to destroy the city with no connection to him, yes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcvj4e", "score_hidden": false, "stickied": false, "created": 1492420080.0, "created_utc": 1492391280.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsb52", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Byron_Blitzkrieg", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The best answer is in the results: Is crime in Gotham still a problem? Are any villains reformed? How much property damage was paid for by Wayne without drawing suspicion? If you make the claim that Batman is truly helping the community, then why are those problems still around, it's almost as though it didn't matter if he was around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best answer is in the results: Is crime in Gotham still a problem? Are any villains reformed? How much property damage was paid for by Wayne without drawing suspicion? If you make the claim that Batman is truly helping the community, then why are those problems still around, it&amp;#39;s almost as though it didn&amp;#39;t matter if he was around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgcsb52", "score_hidden": false, "stickied": false, "created": 1492415743.0, "created_utc": 1492386943.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65p1bf", "likes": null, "replies": "", "user_reports": [], "id": "dgdbmt2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sammyjamez", "parent_id": "t1_dgd1isq", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "ummm ... TBIs do not make people more violent.\n\nWell, it depends which part of the brain is injured *(look up Phileas Gaige)*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ummm ... TBIs do not make people more violent.&lt;/p&gt;\n\n&lt;p&gt;Well, it depends which part of the brain is injured &lt;em&gt;(look up Phileas Gaige)&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdbmt2", "score_hidden": false, "stickied": false, "created": 1492451767.0, "created_utc": 1492422967.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd1isq", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "p4nic", "parent_id": "t3_65p1bf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Batman is smart enough to realize he's a prime reason for the high recidivism in Gotham.  Traumatic brain injury causes people to become more violent, and Batman's go to for dealing with everything is punching people untill they're knocked out.  He secretly loves being a thug, and continuing to beat people's heads in is job security for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Batman is smart enough to realize he&amp;#39;s a prime reason for the high recidivism in Gotham.  Traumatic brain injury causes people to become more violent, and Batman&amp;#39;s go to for dealing with everything is punching people untill they&amp;#39;re knocked out.  He secretly loves being a thug, and continuing to beat people&amp;#39;s heads in is job security for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd1isq", "score_hidden": false, "stickied": false, "created": 1492428331.0, "created_utc": 1492399531.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]