[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So all throughout the Harry Potter books and most of the early films all magic is done nearly exclusively by Wand and Magic words with the exception of House Elves who have Magic inherent in them. But as the series continue we see more and more examples of magic done either without wands (How Harry inflates petunia, Apparating) Or without words (The silent spells harry learns) in The films, we see many wizards increasingly, mostly older, experienced wizards not using Words at all. And barely using their wands. With few exception. And some Spells are always spoken aloud (Petrificus Totallis, The Unforgivable Curses, Several disarming spells) But as we see. The most powerful wizards like Grindewald can use a wide variety of spells without a word. And Many can without even wands, such as Barty Crouch/Mad Eye, or Dumbledore. &lt;/p&gt;\n\n&lt;p&gt;This leads me to the conclusion that the words used in Spells are unnecessary for them, but it helps ensure the spells work exactly as intended. They are focusing aids. Wands accomplish the same goal. Amplify and direct magic like a conductor&amp;#39;s baton. They are not truly necessary but are an enormous help.  &lt;/p&gt;\n\n&lt;p&gt;What we see in the books of students using wands and using spells verbally is just what beginners or wizards not familiar intimately with a particular spell. Or simply demonstrating. As Wizards get older their powers grow and they become more comfortable with their spellcraft, and are able to cast without words, and eventually without wands or gestures. Though it is more difficult. Grindewald can hurl lightning bolts at people like nothing, Aurors can rebuild entire cities with gestures like a conductor. Newt Scamander can Obliviate Muggles with a gesture. Mad Eye can snap his figures and transform someone into a ferret.  The Magic is internal, the wand is an amplifier. &lt;/p&gt;\n\n&lt;p&gt;So why then if wands and words for beginners or as aids rather than truly nessecary does Voldemort of all wizards use the killing curse by speaking aloud? Two possibilities. The Killing Curse is a spell that requires immense focus and willpower to pull off. Some spells, like the Patronus require a lot of willpower to use, and focus. The words help materialize intent, It focuses the magic through the wand and ensure that nothing goes wrong in the casting. Another possibility: Tom Riddle is a showman who loves shouting his attacks out and gesturing wildly, and intentionally does this in order to be more intimidating, announcing his intentions. Or it&amp;#39;s a combination of both. &lt;/p&gt;\n\n&lt;p&gt;But ultimately, the most powerful Wizards like Dumbledore can move mountains without either a wand, or a single word spoken. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So all throughout the Harry Potter books and most of the early films all magic is done nearly exclusively by Wand and Magic words with the exception of House Elves who have Magic inherent in them. But as the series continue we see more and more examples of magic done either without wands (How Harry inflates petunia, Apparating) Or without words (The silent spells harry learns) in The films, we see many wizards increasingly, mostly older, experienced wizards not using Words at all. And barely using their wands. With few exception. And some Spells are always spoken aloud (Petrificus Totallis, The Unforgivable Curses, Several disarming spells) But as we see. The most powerful wizards like Grindewald can use a wide variety of spells without a word. And Many can without even wands, such as Barty Crouch/Mad Eye, or Dumbledore. \n\nThis leads me to the conclusion that the words used in Spells are unnecessary for them, but it helps ensure the spells work exactly as intended. They are focusing aids. Wands accomplish the same goal. Amplify and direct magic like a conductor's baton. They are not truly necessary but are an enormous help.  \n\nWhat we see in the books of students using wands and using spells verbally is just what beginners or wizards not familiar intimately with a particular spell. Or simply demonstrating. As Wizards get older their powers grow and they become more comfortable with their spellcraft, and are able to cast without words, and eventually without wands or gestures. Though it is more difficult. Grindewald can hurl lightning bolts at people like nothing, Aurors can rebuild entire cities with gestures like a conductor. Newt Scamander can Obliviate Muggles with a gesture. Mad Eye can snap his figures and transform someone into a ferret.  The Magic is internal, the wand is an amplifier. \n\nSo why then if wands and words for beginners or as aids rather than truly nessecary does Voldemort of all wizards use the killing curse by speaking aloud? Two possibilities. The Killing Curse is a spell that requires immense focus and willpower to pull off. Some spells, like the Patronus require a lot of willpower to use, and focus. The words help materialize intent, It focuses the magic through the wand and ensure that nothing goes wrong in the casting. Another possibility: Tom Riddle is a showman who loves shouting his attacks out and gesturing wildly, and intentionally does this in order to be more intimidating, announcing his intentions. Or it's a combination of both. \n\nBut ultimately, the most powerful Wizards like Dumbledore can move mountains without either a wand, or a single word spoken. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65pzxj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 29, "report_reasons": null, "author": "looshface", "saved": false, "mod_reports": [], "name": "t3_65pzxj", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "spoiler", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": true, "permalink": "/r/FanTheories/comments/65pzxj/fantastic_beastsharry_potter_spoilers_magic_words/", "num_reports": null, "locked": false, "stickied": false, "created": 1492389453.0, "url": "https://www.reddit.com/r/FanTheories/comments/65pzxj/fantastic_beastsharry_potter_spoilers_magic_words/", "author_flair_text": null, "quarantine": false, "title": "[Fantastic Beasts/Harry Potter Spoilers] Magic Words are only used to aid in magic by Students and for very difficult rote spells.", "created_utc": 1492360653.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65pzxj", "likes": null, "replies": "", "user_reports": [], "id": "dgca906", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "djflint", "parent_id": "t3_65pzxj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I'm sure that this is almost stated in one of the books. I forget where though.   \nOne example which springs to mind is when harry drops his wand in a dark subway (during the dementor attack in book 5?) And frustrated says \"lumos\" and his wand, which he isn't touching, lights up.   \nI like this theory! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure that this is almost stated in one of the books. I forget where though.&lt;br/&gt;\nOne example which springs to mind is when harry drops his wand in a dark subway (during the dementor attack in book 5?) And frustrated says &amp;quot;lumos&amp;quot; and his wand, which he isn&amp;#39;t touching, lights up.&lt;br/&gt;\nI like this theory! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgca906", "score_hidden": false, "stickied": false, "created": 1492391772.0, "created_utc": 1492362972.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65pzxj", "likes": null, "replies": "", "user_reports": [], "id": "dgct2fb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SatNav", "parent_id": "t3_65pzxj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yep, as you've described it is pretty much how it's given in the books, for words at least.\n\nWizards are born with magic, wands allow them to channel and direct it, words help them to focus their intent on what they want to accomplish.\n\nThere's a lesson in one of the books (book six, I think) where they're taught to cast spells wordlessly. It's described as very difficult to do, and the teacher says that many trained wizards don't bother with it, and some never learn it properly.\n\nIt doesn't seem to be the same way with wands though. Wizards can still do magic without a wand, but it's uncontrolled (such as when an untrained child wizard makes something magical happen unintentionally), and usually only in stressful situations. A wizard without their wand is generally considered \"disarmed\" and powerless.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, as you&amp;#39;ve described it is pretty much how it&amp;#39;s given in the books, for words at least.&lt;/p&gt;\n\n&lt;p&gt;Wizards are born with magic, wands allow them to channel and direct it, words help them to focus their intent on what they want to accomplish.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a lesson in one of the books (book six, I think) where they&amp;#39;re taught to cast spells wordlessly. It&amp;#39;s described as very difficult to do, and the teacher says that many trained wizards don&amp;#39;t bother with it, and some never learn it properly.&lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t seem to be the same way with wands though. Wizards can still do magic without a wand, but it&amp;#39;s uncontrolled (such as when an untrained child wizard makes something magical happen unintentionally), and usually only in stressful situations. A wizard without their wand is generally considered &amp;quot;disarmed&amp;quot; and powerless.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgct2fb", "score_hidden": false, "stickied": false, "created": 1492416799.0, "created_utc": 1492387999.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65pzxj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65pzxj", "likes": null, "replies": "", "user_reports": [], "id": "dgddm1z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "looshface", "parent_id": "t1_dgczlfu", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think this is explainable. It's a Rote spell in that it's use is clearly defined. Wizards are taught words, and what they mean and what spell it's for as a way to teach them how to learn to do it without the word, in this theory. The Word without the context, requires only the least of emotional intent. It's clearly a spell to be used in anger. Harry casts this spell not knowing what it does, but clearly wanting to cause some harm. (Though not exactly what it actualy does kind of harm). Which is also precisely the kind of emotion that Snape must've had when he wrote this down. What he intended it to be used for. Magic can be used, as we've seen many times, without understanding exactly what it's meant to do, but by going off vague feelings. Especially the wild magic used by a wizard without a wand, or an Obscurus. So Harry using the Sectumsempra, not knowing what it does, but having the feeling of what he wants to do, cause harm, is enough to be able to use it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is explainable. It&amp;#39;s a Rote spell in that it&amp;#39;s use is clearly defined. Wizards are taught words, and what they mean and what spell it&amp;#39;s for as a way to teach them how to learn to do it without the word, in this theory. The Word without the context, requires only the least of emotional intent. It&amp;#39;s clearly a spell to be used in anger. Harry casts this spell not knowing what it does, but clearly wanting to cause some harm. (Though not exactly what it actualy does kind of harm). Which is also precisely the kind of emotion that Snape must&amp;#39;ve had when he wrote this down. What he intended it to be used for. Magic can be used, as we&amp;#39;ve seen many times, without understanding exactly what it&amp;#39;s meant to do, but by going off vague feelings. Especially the wild magic used by a wizard without a wand, or an Obscurus. So Harry using the Sectumsempra, not knowing what it does, but having the feeling of what he wants to do, cause harm, is enough to be able to use it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgddm1z", "score_hidden": false, "stickied": false, "created": 1492457670.0, "created_utc": 1492428870.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65pzxj", "likes": null, "replies": "", "user_reports": [], "id": "dgd3fic", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reliable_information", "parent_id": "t1_dgczlfu", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "He might now enough. It says it's \"For Enemies\". \n\nIt's a focus of anger or hatred. You don't know what it does, but you know it's gonna be bad for whoever is on the other side. Maybe that's all a wizard needs. Feeling and implication. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He might now enough. It says it&amp;#39;s &amp;quot;For Enemies&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a focus of anger or hatred. You don&amp;#39;t know what it does, but you know it&amp;#39;s gonna be bad for whoever is on the other side. Maybe that&amp;#39;s all a wizard needs. Feeling and implication. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd3fic", "score_hidden": false, "stickied": false, "created": 1492431311.0, "created_utc": 1492402511.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgczlfu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mmm3says", "parent_id": "t3_65pzxj", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "The problem with this: Sectumsempra \n\nHarry casts a spell with no idea what it is, beyond a magic word.  It's the perfect opposite of a wizard having any idea what he is doing. \n\nThe words might not be necessary, but by this demonstration they nevertheless somehow have to contain almost everything you need to cast a spell.  Or it wouldn't have worked.  There is probably a note on how it flick your wand, but it was small enough to fit in the book's margin whatever it was.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem with this: Sectumsempra &lt;/p&gt;\n\n&lt;p&gt;Harry casts a spell with no idea what it is, beyond a magic word.  It&amp;#39;s the perfect opposite of a wizard having any idea what he is doing. &lt;/p&gt;\n\n&lt;p&gt;The words might not be necessary, but by this demonstration they nevertheless somehow have to contain almost everything you need to cast a spell.  Or it wouldn&amp;#39;t have worked.  There is probably a note on how it flick your wand, but it was small enough to fit in the book&amp;#39;s margin whatever it was.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgczlfu", "score_hidden": false, "stickied": false, "created": 1492425607.0, "created_utc": 1492396807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]