[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know, I know, the title sounds misleading, but I couldn&amp;#39;t think of a better way to put it.&lt;/p&gt;\n\n&lt;p&gt;The show The Animaniacs is about three siblings who have fun at the expense of those around them; &amp;quot;those around them&amp;quot;, of course, can vary from ancient kings and knights to the people enjoying a cruise. Furthermore, the Warner Siblings&amp;#39; usual antics are often interspersed with other animated shorts, such as Slappy the Squirrel, Pinky and the Brain, etc. It&amp;#39;s also important to note that many of the more out-there skits, such as the medieval and cruise ones I mentioned earlier, often have characters from the series taking the place of characters in that situation, such as the Nurse playing a maid. The Warners also don&amp;#39;t even pretend the fourth wall exists, calling out to the audience all the time.&lt;/p&gt;\n\n&lt;p&gt;I propose that the Animaniacs is, in fact, a TV show within a TV show.&lt;/p&gt;\n\n&lt;p&gt;The Warner Siblings origin story wasn&amp;#39;t a lie- they were, in fact, cartoon characters &amp;#39;born&amp;#39; in a time that wasn&amp;#39;t ready for their insane brand of humor. One day, they escaped from their confinement and started rampaging again. However, this time, they were now in the 90s, when people were far more willing to let their children watch such zany characters and their antics.&lt;/p&gt;\n\n&lt;p&gt;The TV producers decided to let them have the spotlight in a show for other misfit characters, which was both to use up a time slot, introduce potential cartoons without putting in the full effort, and for its own sake. The Warners enjoyed it, but their zany antics weren&amp;#39;t restricted to their own show- they would often run in when other shows were recording and steal the show. Because their interference often produced very funny skits, the producers allowed that, too, since the show was fairly popular.&lt;/p&gt;\n\n&lt;p&gt;This is why there are a wide variety of content both including and not including the Warner Siblings- because it was all a TV show, and they wouldn&amp;#39;t have it any other way.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR: The Animaniacs was a TV show within a TV show, with many of the more out-there skits being when the Warners invaded other sets.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I know, I know, the title sounds misleading, but I couldn't think of a better way to put it.\n\nThe show The Animaniacs is about three siblings who have fun at the expense of those around them; \"those around them\", of course, can vary from ancient kings and knights to the people enjoying a cruise. Furthermore, the Warner Siblings' usual antics are often interspersed with other animated shorts, such as Slappy the Squirrel, Pinky and the Brain, etc. It's also important to note that many of the more out-there skits, such as the medieval and cruise ones I mentioned earlier, often have characters from the series taking the place of characters in that situation, such as the Nurse playing a maid. The Warners also don't even pretend the fourth wall exists, calling out to the audience all the time.\n\nI propose that the Animaniacs is, in fact, a TV show within a TV show.\n\nThe Warner Siblings origin story wasn't a lie- they were, in fact, cartoon characters 'born' in a time that wasn't ready for their insane brand of humor. One day, they escaped from their confinement and started rampaging again. However, this time, they were now in the 90s, when people were far more willing to let their children watch such zany characters and their antics.\n\nThe TV producers decided to let them have the spotlight in a show for other misfit characters, which was both to use up a time slot, introduce potential cartoons without putting in the full effort, and for its own sake. The Warners enjoyed it, but their zany antics weren't restricted to their own show- they would often run in when other shows were recording and steal the show. Because their interference often produced very funny skits, the producers allowed that, too, since the show was fairly popular.\n\nThis is why there are a wide variety of content both including and not including the Warner Siblings- because it was all a TV show, and they wouldn't have it any other way.\n\n**TL;DR: The Animaniacs was a TV show within a TV show, with many of the more out-there skits being when the Warners invaded other sets.**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65t07r", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "yay855", "saved": false, "mod_reports": [], "name": "t3_65t07r", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65t07r/the_animaniacs_is_a_tv_show/", "num_reports": null, "locked": false, "stickied": false, "created": 1492424954.0, "url": "https://www.reddit.com/r/FanTheories/comments/65t07r/the_animaniacs_is_a_tv_show/", "author_flair_text": null, "quarantine": false, "title": "[The Animaniacs] is a TV Show", "created_utc": 1492396154.0, "distinguished": null, "media": null, "upvote_ratio": 0.7, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65t07r", "likes": null, "replies": "", "user_reports": [], "id": "dgdcvzq", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "UntouchableC", "parent_id": "t3_65t07r", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I'm sorry but this isn't so much fan theory as the actual plot behind Animaniacs. Its not a TV show within a TV show more of a \"reality/improv\" TV show on the WB studio lot  with the occasional actual sketch/musical thrown in.\n\nThe intro explicitly explains the plot, of how they go around warner bros studio fucking stuff up. \nPinky &amp; The Brain and the others were signed on to fill the 30minute time slot. Its not so much the WB executives wanted to give them a chance. More they both legally own/are responsible for the Warner siblings and are stuck with them due to golden handcuffs.\n\nThey \"have pay-or-play contracts\"...which means WB have to air their madness or pay extra. \n\nA lot of the stuff is meta/improv/reality TV because the writers are loco and they have no scripts..\"why bother to rehearse\". WB must cobble together 30mins of content to air or suffer further.\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry but this isn&amp;#39;t so much fan theory as the actual plot behind Animaniacs. Its not a TV show within a TV show more of a &amp;quot;reality/improv&amp;quot; TV show on the WB studio lot  with the occasional actual sketch/musical thrown in.&lt;/p&gt;\n\n&lt;p&gt;The intro explicitly explains the plot, of how they go around warner bros studio fucking stuff up. \nPinky &amp;amp; The Brain and the others were signed on to fill the 30minute time slot. Its not so much the WB executives wanted to give them a chance. More they both legally own/are responsible for the Warner siblings and are stuck with them due to golden handcuffs.&lt;/p&gt;\n\n&lt;p&gt;They &amp;quot;have pay-or-play contracts&amp;quot;...which means WB have to air their madness or pay extra. &lt;/p&gt;\n\n&lt;p&gt;A lot of the stuff is meta/improv/reality TV because the writers are loco and they have no scripts..&amp;quot;why bother to rehearse&amp;quot;. WB must cobble together 30mins of content to air or suffer further.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdcvzq", "score_hidden": false, "stickied": false, "created": 1492455742.0, "created_utc": 1492426942.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65t07r", "likes": null, "replies": "", "user_reports": [], "id": "dgd1154", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "emerald_bat", "parent_id": "t3_65t07r", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "You could even take this a step further and say that all the historical/fantasy cartoons are actually the original Animaniacs cartoons from the 1930s. The Warners are not actually \"crazy\" but are aware of time in a non-linear fashion, hence the contemporary references. This is why they were locked up in the first place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could even take this a step further and say that all the historical/fantasy cartoons are actually the original Animaniacs cartoons from the 1930s. The Warners are not actually &amp;quot;crazy&amp;quot; but are aware of time in a non-linear fashion, hence the contemporary references. This is why they were locked up in the first place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgd1154", "score_hidden": false, "stickied": false, "created": 1492427622.0, "created_utc": 1492398822.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]