[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;. Here is a Repost of my headcannon speculating on Kryptonians n stuff which answers all sorts of whys:&lt;/p&gt;\n\n&lt;p&gt;My personal Fan theory on Clark&amp;#39;s powers in Smallville (and a better one that the official explanation imho) - Starting off - Obviously a no form of radiation could ever induce all these powers in people. But the crazy is a clue. Something is interacting with people&amp;#39;s psychological conditions. Think about it, the guy in a frozen pond gets ice powers, the guy in the sauna gets fire powers. Bitten by bugs, bug powers. The fat girl gets a power that makes her skinny. No natural rock would know the I want to be skinny.\nThey never even try to try to explain it. It has always bothered me that only the very weak versions of superman&amp;#39;s powers can reasonable by explained by and sort of plausible natural biology. Some increased strength, healing, and endurance, senses sharpened to a degree. These are extensions of what biology could do with an increased energy budget.&lt;/p&gt;\n\n&lt;p&gt;But Flight, X-ray vision, heat vision, existing in a vacuum come out of nowhere. Heat vision uses up far more energy than his body&amp;#39;s surface area can absorb. All the sunlight powering my powers does not satisfy the amounts of energy kryptonians commonly use.&lt;/p&gt;\n\n&lt;p&gt;Why? Because the powers are not due to natural biology. Sunlight only activates the quantum tech in a kryptonian&amp;#39;s body. The technology was developed long ago and became first ubiquitous and then largely forgotten. The only remnant the Kryptonian&amp;#39;s of Jor-El&amp;#39;s time really used were the extracting energy form the mass at their planet&amp;#39;s core - which was originally needed as the interface to program the technology. Once, Kryptonians were an expansionist military empire. They applied this technology to their military so that it activated in alien star systems. It was designed to allow their soldiers to survive an alien battlefield and then make it home.&lt;/p&gt;\n\n&lt;p&gt;But having anyone running around with that much power on the home planet would not be an option. So they the tech to be shut off by red sunlight / interacting with krypton&amp;#39;s core (green K). The tech was ancient and no longer used on Krypton so it was pretty much trivial to the isolationist Kyrptonian society that later developed. Kypronian &amp;quot;Minerals&amp;quot; are really the shattered remains of the quantum tech network. Broken and malfunctioning. Green - suppresses powers and scrags the q-tech resulting in physical weakness/harm Red - attempts mental interface and fails - causing mental changes. Black - is attempting to clone the kryptonian Blue - shuts off powers Gold - burns the nanotech out.&lt;/p&gt;\n\n&lt;p&gt;This theory neatly explains the following issues that are otherwise unaddressed:&lt;/p&gt;\n\n&lt;p&gt;1) Why human tech can&amp;#39;t analyze its atomic structure or duplicate it. (It&amp;#39;s quantum biatch!)&lt;/p&gt;\n\n&lt;p&gt;2) why meteor exposed people tend go nuts - its not meant to interface with a human biology. It causes damage that results in psychosis and/or other forms of mental instability.&lt;/p&gt;\n\n&lt;p&gt;3) why meteor freak powers vary widely relate to the situations they are gained in. (It does interface imperfectly and tries to help out someone in distress.&lt;/p&gt;\n\n&lt;p&gt;4) Power Transfers - Green + Lightning - causes a Kryptonian quantum tech to release from the body it occupies and latch onto the nearest suitable host (happened like 3 times in smallville)&lt;/p&gt;\n\n&lt;p&gt;5) How Kryptonians can exert far more power than a solar panel of the same size could collect&lt;/p&gt;\n\n&lt;p&gt;6) Why more intense sunlight charges them faster (fuller activation of the tech&lt;/p&gt;\n\n&lt;p&gt;7) Why krypton exploded (tech was misused, mass/energy conversion chain reaction ensued.)&lt;/p&gt;\n\n&lt;p&gt;8 ) Why Kryptoinans they gain powers to do things that natural evolution cannot explain. (range weapon,super-speed,flight,x-ray vision - Face it, these are a soldier&amp;#39;s dream powers)&lt;/p&gt;\n\n&lt;p&gt;9) How powers reach such an extreme degree. (Faster than a speeding bullet, more powerful than a locomotive)&lt;/p&gt;\n\n&lt;p&gt;10) How Kryptonian powers can be transferred to another (Clark+Green K + Lightning+ Touching = power transfer) - because his messed up quantum tech thinks its being set to empower the other person.&lt;/p&gt;\n\n&lt;p&gt;11) Kryptonian crystal tech.&lt;/p&gt;\n\n&lt;p&gt;12) Why said tech is so hard to crack - a proper interface is the size of a planet&amp;#39;s core. There only ever was one. And it blew up!&lt;/p&gt;\n\n&lt;p&gt;Please note - I was jazzed to see something a lot like explanation a lot like this for the powers of the titular hero in the comic book Invincible. Who&amp;#39;s dad is obviously derivative of Superman. Aliens empowered by &amp;quot;smart atom&amp;quot; technology.&lt;/p&gt;\n\n&lt;p&gt;Wacky Sub theory for the hardcore sci-fi fans- Why does Clark and the other Krptonians seem so human? What are the odds of that (Yes, I know Jor El picked earth, but still, indistinguishable form human when his powers are off?). Odds of any alien looking human should be astronomically low according to serious science speculation. Of course, way easier on the artists than actually alien aliens, but what if the physical similarity is all a lie? One way to make interaction with an alien species easier is to look just like them. Kryptonians explored the galaxies long ago. Maybe they built the means of making friendly relations much easier into that spiffy tech so it would be all &amp;quot;Ahhhh .. Alien! Kill it!!&amp;quot; bang bang bang punch-blast\nUnbeknownst to all, even themselves, Kryptonians are shape-changers! When they enter a surveyed system their biological forms are reformatted to match the dominant intelligent species of that area of space. Yes, their computers translate the appearances of Kryptonians in their records to match. The tech is in the computers too. Yes, it changes the memories of Kryptonians so they remember being human looking all along. (explains Supergirl&amp;#39;s memories of Krypton where everyone looks human.)&lt;/p&gt;\n\n&lt;p&gt;Their true form ma be purple jellyfish or giant badgers But they all look human because they&amp;#39;re all on earth. They may visit an alien planet, assume an alien form, have an adventure, and go back to earth; where their memories are ret-conned to make them think the aliens looked pretty human and forget noticing the change.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I&amp;#39;ve posted this before but though you guys might give me some feedback for thought.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": ". Here is a Repost of my headcannon speculating on Kryptonians n stuff which answers all sorts of whys:\n\nMy personal Fan theory on Clark's powers in Smallville (and a better one that the official explanation imho) - Starting off - Obviously a no form of radiation could ever induce all these powers in people. But the crazy is a clue. Something is interacting with people's psychological conditions. Think about it, the guy in a frozen pond gets ice powers, the guy in the sauna gets fire powers. Bitten by bugs, bug powers. The fat girl gets a power that makes her skinny. No natural rock would know the I want to be skinny.\nThey never even try to try to explain it. It has always bothered me that only the very weak versions of superman's powers can reasonable by explained by and sort of plausible natural biology. Some increased strength, healing, and endurance, senses sharpened to a degree. These are extensions of what biology could do with an increased energy budget.\n\nBut Flight, X-ray vision, heat vision, existing in a vacuum come out of nowhere. Heat vision uses up far more energy than his body's surface area can absorb. All the sunlight powering my powers does not satisfy the amounts of energy kryptonians commonly use.\n\nWhy? Because the powers are not due to natural biology. Sunlight only activates the quantum tech in a kryptonian's body. The technology was developed long ago and became first ubiquitous and then largely forgotten. The only remnant the Kryptonian's of Jor-El's time really used were the extracting energy form the mass at their planet's core - which was originally needed as the interface to program the technology. Once, Kryptonians were an expansionist military empire. They applied this technology to their military so that it activated in alien star systems. It was designed to allow their soldiers to survive an alien battlefield and then make it home.\n\nBut having anyone running around with that much power on the home planet would not be an option. So they the tech to be shut off by red sunlight / interacting with krypton's core (green K). The tech was ancient and no longer used on Krypton so it was pretty much trivial to the isolationist Kyrptonian society that later developed. Kypronian \"Minerals\" are really the shattered remains of the quantum tech network. Broken and malfunctioning. Green - suppresses powers and scrags the q-tech resulting in physical weakness/harm Red - attempts mental interface and fails - causing mental changes. Black - is attempting to clone the kryptonian Blue - shuts off powers Gold - burns the nanotech out.\n\nThis theory neatly explains the following issues that are otherwise unaddressed:\n\n1) Why human tech can't analyze its atomic structure or duplicate it. (It's quantum biatch!)\n\n2) why meteor exposed people tend go nuts - its not meant to interface with a human biology. It causes damage that results in psychosis and/or other forms of mental instability.\n\n3) why meteor freak powers vary widely relate to the situations they are gained in. (It does interface imperfectly and tries to help out someone in distress.\n\n4) Power Transfers - Green + Lightning - causes a Kryptonian quantum tech to release from the body it occupies and latch onto the nearest suitable host (happened like 3 times in smallville)\n\n5) How Kryptonians can exert far more power than a solar panel of the same size could collect\n\n6) Why more intense sunlight charges them faster (fuller activation of the tech\n\n7) Why krypton exploded (tech was misused, mass/energy conversion chain reaction ensued.)\n\n8 ) Why Kryptoinans they gain powers to do things that natural evolution cannot explain. (range weapon,super-speed,flight,x-ray vision - Face it, these are a soldier's dream powers)\n\n9) How powers reach such an extreme degree. (Faster than a speeding bullet, more powerful than a locomotive)\n\n10) How Kryptonian powers can be transferred to another (Clark+Green K + Lightning+ Touching = power transfer) - because his messed up quantum tech thinks its being set to empower the other person.\n\n11) Kryptonian crystal tech.\n\n12) Why said tech is so hard to crack - a proper interface is the size of a planet's core. There only ever was one. And it blew up!\n\nPlease note - I was jazzed to see something a lot like explanation a lot like this for the powers of the titular hero in the comic book Invincible. Who's dad is obviously derivative of Superman. Aliens empowered by \"smart atom\" technology.\n\nWacky Sub theory for the hardcore sci-fi fans- Why does Clark and the other Krptonians seem so human? What are the odds of that (Yes, I know Jor El picked earth, but still, indistinguishable form human when his powers are off?). Odds of any alien looking human should be astronomically low according to serious science speculation. Of course, way easier on the artists than actually alien aliens, but what if the physical similarity is all a lie? One way to make interaction with an alien species easier is to look just like them. Kryptonians explored the galaxies long ago. Maybe they built the means of making friendly relations much easier into that spiffy tech so it would be all \"Ahhhh .. Alien! Kill it!!\" bang bang bang punch-blast\nUnbeknownst to all, even themselves, Kryptonians are shape-changers! When they enter a surveyed system their biological forms are reformatted to match the dominant intelligent species of that area of space. Yes, their computers translate the appearances of Kryptonians in their records to match. The tech is in the computers too. Yes, it changes the memories of Kryptonians so they remember being human looking all along. (explains Supergirl's memories of Krypton where everyone looks human.)\n\nTheir true form ma be purple jellyfish or giant badgers But they all look human because they're all on earth. They may visit an alien planet, assume an alien form, have an adventure, and go back to earth; where their memories are ret-conned to make them think the aliens looked pretty human and forget noticing the change.\n\nAnyway, I've posted this before but though you guys might give me some feedback for thought.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65t5li", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "mmm3says", "saved": false, "mod_reports": [], "name": "t3_65t5li", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65t5li/superman_my_headcannon_theory_to_explain_all/", "num_reports": null, "locked": false, "stickied": false, "created": 1492426898.0, "url": "https://www.reddit.com/r/FanTheories/comments/65t5li/superman_my_headcannon_theory_to_explain_all/", "author_flair_text": null, "quarantine": false, "title": "[ Superman ] - My headcannon theory to explain all sorts of stuff.", "created_utc": 1492398098.0, "distinguished": null, "media": null, "upvote_ratio": 0.43, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]