[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This Theory may have some flaws&lt;/p&gt;\n\n&lt;p&gt;In the third Harry Potter Book (The Prisioner from Azkaban) we see Harry and Hermione use a time turner to save Buckbeack and Sirius. However, all the events they caused using the time turner had allready happend.\n- Harry had been hit in the head by a rock\n- Harry was saved from the Dementors by a glowing stag (His own Patronus) \n- Buckbeak was saved \nAll of these events happend before they went back in time, then they made all of the events happen. For starters this creates a paradox since we dont know how or who started the chain of events. But the most important thing this proves is that there is no muliverse in the Harry Potter Universe. \nSo all the events would always have happend in the same way. This goes for all the books, Harry always kills the baselisk, Sirius, Lupin, Snape and Dumbledore always dies. and the profecy is a lie since Voldemort always loses. \nI belive that this proves that every choice made in the Harry Potter books were ilisions, that they live in a Universe were fate exists and nothing could be changed by any number of Time-Turners &lt;/p&gt;\n\n&lt;p&gt;Side note: This totaly ruins &amp;quot;The Cursed Child&amp;quot;  since it deals with the multiverse, but I for one never considered that cannon. &lt;/p&gt;\n\n&lt;p&gt;Tl;dr The Time Turners cant be used to change any events since all the events would already have happend. No multivserse in the HP universe and this makes it so that none of the choices in the books were real. all who died would always die, and all events would happend the same way. &lt;/p&gt;\n\n&lt;p&gt;Thanks for reading, this is my first theory. and sorry for bad spelling english is not my native language  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This Theory may have some flaws\n\nIn the third Harry Potter Book (The Prisioner from Azkaban) we see Harry and Hermione use a time turner to save Buckbeack and Sirius. However, all the events they caused using the time turner had allready happend.\n- Harry had been hit in the head by a rock\n- Harry was saved from the Dementors by a glowing stag (His own Patronus) \n- Buckbeak was saved \nAll of these events happend before they went back in time, then they made all of the events happen. For starters this creates a paradox since we dont know how or who started the chain of events. But the most important thing this proves is that there is no muliverse in the Harry Potter Universe. \nSo all the events would always have happend in the same way. This goes for all the books, Harry always kills the baselisk, Sirius, Lupin, Snape and Dumbledore always dies. and the profecy is a lie since Voldemort always loses. \nI belive that this proves that every choice made in the Harry Potter books were ilisions, that they live in a Universe were fate exists and nothing could be changed by any number of Time-Turners \n\nSide note: This totaly ruins \"The Cursed Child\"  since it deals with the multiverse, but I for one never considered that cannon. \n\nTl;dr The Time Turners cant be used to change any events since all the events would already have happend. No multivserse in the HP universe and this makes it so that none of the choices in the books were real. all who died would always die, and all events would happend the same way. \n\nThanks for reading, this is my first theory. and sorry for bad spelling english is not my native language  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ueqf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "Luxerus", "saved": false, "mod_reports": [], "name": "t3_65ueqf", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65ueqf/harry_potter_how_the_third_book_proves_that_fate/", "num_reports": null, "locked": false, "stickied": false, "created": 1492447071.0, "url": "https://www.reddit.com/r/FanTheories/comments/65ueqf/harry_potter_how_the_third_book_proves_that_fate/", "author_flair_text": null, "quarantine": false, "title": "[Harry Potter] How the third book proves that fate exists in the Harry Potter Universe", "created_utc": 1492418271.0, "distinguished": null, "media": null, "upvote_ratio": 0.62, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65ueqf", "likes": null, "replies": "", "user_reports": [], "id": "dgdajjr", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Levyathyn", "parent_id": "t3_65ueqf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "This doesn't ruin the multiverse, or prove fate, realistically speaking--or as realistically as you can when referring to wizards and time travel in the same phrasing.\n\nFirst, there's no paradox here; time travel in Harry Potter is linearly enforced, it's played straight and set in stone. The dangers of meddling with it are not shown but are *heavily* alluded to, and many people write it off. But ask yourself if in the magic world, where there exists horrific being made of *actual* nightmares, shapeshifters and changelings, appearance duplication spells and potions, and all manner of horrible beasts up to and including dragons and soul reapers, how would the simple act of seeing yourself or crossing paths with yourself drive wizards mad?\n\nIf someone was not only a magically gifted elder wizard with decades of practice under his or her belt *and* had been given a Time Turner to use, which would automatically let most wizards know to expect that they might see themselves, or to be ready to accept knowledge of their past/future lives intersecting, how can you honestly expect just that to drive them insane? Simply put, it wouldn't. The dangers of time travel aren't just showing up and watching, or perpetuating events that already happened, or even really crossing yourself. It's the chance of causing a paradox, which instead of hurting time would likely just destroy whatever was trying to affect time, somehow. Insanity would be the least I'd expect.\n\nTime is linear, and can't be forced into a change; that means there's no paradox because there was no 'first dry run' of the day that didn't include Harry getting smacked with a stone, or Buckbeak being saved. It had always happened. That's not fate, either; that's choice. Just a choice that hadn't happened yet.\n\nThe situation lined up so that Harry and Hermione were free and clear to use time travel to ensure that, in the past, they remained free and clear to use it. And the need remained, so that they had a reason to. And if that weren't enough, Dumbledore even drops the suggestion, letting her know that it's okay.\n\nAs for the multi-verse, this proves nothing about that. It's a stretch to even involve a theoretical multiverse including infinite possible realities and outcomes. Even just undoing the tie to fate above would be enough, but the grasp is already tenuous; an infinite multiverse of realities would have infinite realities with different fates. Or realities where fate doesn't exist. If there's a conceivable world where Harry Potter is a female middle-aged tax attorney in South Africa--and in an infinite multiverse, there is--then there's certainly infinite realities where fate and time travel never even crossed the wizarding world, and many more where it was just different.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This doesn&amp;#39;t ruin the multiverse, or prove fate, realistically speaking--or as realistically as you can when referring to wizards and time travel in the same phrasing.&lt;/p&gt;\n\n&lt;p&gt;First, there&amp;#39;s no paradox here; time travel in Harry Potter is linearly enforced, it&amp;#39;s played straight and set in stone. The dangers of meddling with it are not shown but are &lt;em&gt;heavily&lt;/em&gt; alluded to, and many people write it off. But ask yourself if in the magic world, where there exists horrific being made of &lt;em&gt;actual&lt;/em&gt; nightmares, shapeshifters and changelings, appearance duplication spells and potions, and all manner of horrible beasts up to and including dragons and soul reapers, how would the simple act of seeing yourself or crossing paths with yourself drive wizards mad?&lt;/p&gt;\n\n&lt;p&gt;If someone was not only a magically gifted elder wizard with decades of practice under his or her belt &lt;em&gt;and&lt;/em&gt; had been given a Time Turner to use, which would automatically let most wizards know to expect that they might see themselves, or to be ready to accept knowledge of their past/future lives intersecting, how can you honestly expect just that to drive them insane? Simply put, it wouldn&amp;#39;t. The dangers of time travel aren&amp;#39;t just showing up and watching, or perpetuating events that already happened, or even really crossing yourself. It&amp;#39;s the chance of causing a paradox, which instead of hurting time would likely just destroy whatever was trying to affect time, somehow. Insanity would be the least I&amp;#39;d expect.&lt;/p&gt;\n\n&lt;p&gt;Time is linear, and can&amp;#39;t be forced into a change; that means there&amp;#39;s no paradox because there was no &amp;#39;first dry run&amp;#39; of the day that didn&amp;#39;t include Harry getting smacked with a stone, or Buckbeak being saved. It had always happened. That&amp;#39;s not fate, either; that&amp;#39;s choice. Just a choice that hadn&amp;#39;t happened yet.&lt;/p&gt;\n\n&lt;p&gt;The situation lined up so that Harry and Hermione were free and clear to use time travel to ensure that, in the past, they remained free and clear to use it. And the need remained, so that they had a reason to. And if that weren&amp;#39;t enough, Dumbledore even drops the suggestion, letting her know that it&amp;#39;s okay.&lt;/p&gt;\n\n&lt;p&gt;As for the multi-verse, this proves nothing about that. It&amp;#39;s a stretch to even involve a theoretical multiverse including infinite possible realities and outcomes. Even just undoing the tie to fate above would be enough, but the grasp is already tenuous; an infinite multiverse of realities would have infinite realities with different fates. Or realities where fate doesn&amp;#39;t exist. If there&amp;#39;s a conceivable world where Harry Potter is a female middle-aged tax attorney in South Africa--and in an infinite multiverse, there is--then there&amp;#39;s certainly infinite realities where fate and time travel never even crossed the wizarding world, and many more where it was just different.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdajjr", "score_hidden": false, "stickied": false, "created": 1492447976.0, "created_utc": 1492419176.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65ueqf", "likes": null, "replies": "", "user_reports": [], "id": "dgdqw0s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dr69ons6mur6i", "parent_id": "t3_65ueqf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "If I remember correctly didn't Dumbledor say something about saving two lives, or more than one, when he gave Hermionie the time turner? I always assumed that meant that buckbeak died the first time around.\n\nEDIT: Yes. I know. I'm a horrible speller.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I remember correctly didn&amp;#39;t Dumbledor say something about saving two lives, or more than one, when he gave Hermionie the time turner? I always assumed that meant that buckbeak died the first time around.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Yes. I know. I&amp;#39;m a horrible speller.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdqw0s", "score_hidden": false, "stickied": false, "created": 1492476777.0, "created_utc": 1492447977.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]