[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;[Cursed Child spoilers ahead]&lt;/p&gt;\n\n&lt;p&gt;As we learned in the newest story Harry Potter and the Cursed Child, the time turners were not all destroyed. I can&amp;#39;t remember if they had the Cursed Child time turners destroyed afterward, but it&amp;#39;s possible that more of them still exist somewhere.&lt;/p&gt;\n\n&lt;p&gt;Harry&amp;#39;s entire existence revolved around the murder of his parents, and the prophecy that came to life in defeating Lord Voldemort. He was never able to fully recover from the loss of his family, and starting his new family with Ginny could never fully satisfy the longing he had to be with his parents. This is where my theory comes together.&lt;/p&gt;\n\n&lt;p&gt;In Harry Potter and the Deathly Hallows we learned that Harry&amp;#39;s parents had a cat when Harry was just a baby. All we know about this cat is that Harry nearly kills it while playing with a toy broomstick, and that (Harry believes) the cat either died on the night his parents were killed, or otherwise ran away when there was no one left to feed it.&lt;/p&gt;\n\n&lt;p&gt;Harry Potter IS the Potter family&amp;#39;s cat. Without the Ministry&amp;#39;s knowledge (or with it, since Hermione is Minister), Harry Potter became an animagus like his father and God father before him, taking the form of a cat. He used a time turner, and went back in time where he bothered Lily or James Potter into adopting him, possibly by being an exceptionally bright and talented cat that always hung around. &lt;/p&gt;\n\n&lt;p&gt;He hid the time turner in the room of requirement at Hogwarts without very much fear of it being found or losing it. Harry spent the many years with his parents that he was deprived of as a child, learning about their relationship and helping them in small ways when he could (similar to how Crookshanks helped Sirius).&lt;/p&gt;\n\n&lt;p&gt;On the night that Harry&amp;#39;s parents were murdered, Harry the cat left, knowing that he was once again not able to interfere, having already been there for the events once and stood by in the Cursed Child. He returned to Hogwarts, entered the castle through one of the secret passage ways, retrieved the time turner and returned home years later to the exact time that he left, as if nothing ever happened. Sure, he would now be years older than he was when he left, but wizards live extremely long lives, and it was worth having those years with his parents.&lt;/p&gt;\n\n&lt;p&gt;Side note: I like to imagine he did this at a time where the Marauders were still roaming Hogwarts, and that he might&amp;#39;ve met them on the grounds and gotten into a tussle with Sirius in his dog form. Thanks for reading! Feel free to tear this theory apart if you find holes.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Cursed Child spoilers ahead]\n\nAs we learned in the newest story Harry Potter and the Cursed Child, the time turners were not all destroyed. I can't remember if they had the Cursed Child time turners destroyed afterward, but it's possible that more of them still exist somewhere.\n\nHarry's entire existence revolved around the murder of his parents, and the prophecy that came to life in defeating Lord Voldemort. He was never able to fully recover from the loss of his family, and starting his new family with Ginny could never fully satisfy the longing he had to be with his parents. This is where my theory comes together.\n\nIn Harry Potter and the Deathly Hallows we learned that Harry's parents had a cat when Harry was just a baby. All we know about this cat is that Harry nearly kills it while playing with a toy broomstick, and that (Harry believes) the cat either died on the night his parents were killed, or otherwise ran away when there was no one left to feed it.\n\nHarry Potter IS the Potter family's cat. Without the Ministry's knowledge (or with it, since Hermione is Minister), Harry Potter became an animagus like his father and God father before him, taking the form of a cat. He used a time turner, and went back in time where he bothered Lily or James Potter into adopting him, possibly by being an exceptionally bright and talented cat that always hung around. \n\nHe hid the time turner in the room of requirement at Hogwarts without very much fear of it being found or losing it. Harry spent the many years with his parents that he was deprived of as a child, learning about their relationship and helping them in small ways when he could (similar to how Crookshanks helped Sirius).\n\nOn the night that Harry's parents were murdered, Harry the cat left, knowing that he was once again not able to interfere, having already been there for the events once and stood by in the Cursed Child. He returned to Hogwarts, entered the castle through one of the secret passage ways, retrieved the time turner and returned home years later to the exact time that he left, as if nothing ever happened. Sure, he would now be years older than he was when he left, but wizards live extremely long lives, and it was worth having those years with his parents.\n\nSide note: I like to imagine he did this at a time where the Marauders were still roaming Hogwarts, and that he might've met them on the grounds and gotten into a tussle with Sirius in his dog form. Thanks for reading! Feel free to tear this theory apart if you find holes.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65vyo4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "PadowanLearner", "saved": false, "mod_reports": [], "name": "t3_65vyo4", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65vyo4/harry_potter_the_potter_familys_cat/", "num_reports": null, "locked": false, "stickied": false, "created": 1492469153.0, "url": "https://www.reddit.com/r/FanTheories/comments/65vyo4/harry_potter_the_potter_familys_cat/", "author_flair_text": null, "quarantine": false, "title": "[Harry Potter] The Potter family's cat", "created_utc": 1492440353.0, "distinguished": null, "media": null, "upvote_ratio": 0.63, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65vyo4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65vyo4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65vyo4", "likes": null, "replies": "", "user_reports": [], "id": "dge29dm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Obversa", "parent_id": "t1_dgds4gn", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Yes. McGonagall was also a member of the Order of the Phoenix, which would give her a presence in the lives of James and Lily, who were also Order members. In the books and the films, there's a picture of all of the Order members together during the First Wizarding War, which would presumably include a younger McGonagall with the Potters as well. \n\n&gt; And they'd have known she was a cat Animagus and what she looked like.\n\nI think that's the point. Sirius Black was, after all, a dog. It would make sense that McGonagall kept watch over the Potters as a cat. She evwn does this on Privet Drive anticipating the arrival of baby Harry at the Durlseys' house, after his parents' deaths. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. McGonagall was also a member of the Order of the Phoenix, which would give her a presence in the lives of James and Lily, who were also Order members. In the books and the films, there&amp;#39;s a picture of all of the Order members together during the First Wizarding War, which would presumably include a younger McGonagall with the Potters as well. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And they&amp;#39;d have known she was a cat Animagus and what she looked like.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think that&amp;#39;s the point. Sirius Black was, after all, a dog. It would make sense that McGonagall kept watch over the Potters as a cat. She evwn does this on Privet Drive anticipating the arrival of baby Harry at the Durlseys&amp;#39; house, after his parents&amp;#39; deaths. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dge29dm", "score_hidden": false, "stickied": false, "created": 1492489513.0, "created_utc": 1492460713.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgds4gn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PadowanLearner", "parent_id": "t1_dgdosku", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I thought about this, but McGonagall would have been present in their lives already as a human though wouldn't she? And they'd have known she was a cat Animagus and what she looked like. The theory isn't based on any fact or evidence more just what would be possible without contradicting other story lines in the series lol but I didn't know JK said that in an interview, so I guess I'm shot!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought about this, but McGonagall would have been present in their lives already as a human though wouldn&amp;#39;t she? And they&amp;#39;d have known she was a cat Animagus and what she looked like. The theory isn&amp;#39;t based on any fact or evidence more just what would be possible without contradicting other story lines in the series lol but I didn&amp;#39;t know JK said that in an interview, so I guess I&amp;#39;m shot!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgds4gn", "score_hidden": false, "stickied": false, "created": 1492478152.0, "created_utc": 1492449352.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdosku", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Obversa", "parent_id": "t3_65vyo4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I think the main flaws of this theory are:\n\n- There is no evidence elsewhere in either the original books or *Cursed Child* to suggest that Harry became an Animagus, or even a cat Animagus.\n\n- JK Rowling said in a previous interview that Harry would \"never become an Animagus\". [(Source)](http://www.accio-quote.org/articles/1999/1199-newsweek-odonnell.html) She also confirmed this a second time [here](http://www.accio-quote.org/articles/1999/1099-pressclubtransc.htm).\n\n- The theory has too little solid evidence to back it up, and relies too much on speculation / headcanon. It is also too overly complex, when there are other, much simpler solutions available.\n\nFor example, I think there is more evidence for the Potters' cat to have been Professor McGonagall than Harry himself.", "edited": 1492446047.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the main flaws of this theory are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;There is no evidence elsewhere in either the original books or &lt;em&gt;Cursed Child&lt;/em&gt; to suggest that Harry became an Animagus, or even a cat Animagus.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;JK Rowling said in a previous interview that Harry would &amp;quot;never become an Animagus&amp;quot;. &lt;a href=\"http://www.accio-quote.org/articles/1999/1199-newsweek-odonnell.html\"&gt;(Source)&lt;/a&gt; She also confirmed this a second time &lt;a href=\"http://www.accio-quote.org/articles/1999/1099-pressclubtransc.htm\"&gt;here&lt;/a&gt;.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The theory has too little solid evidence to back it up, and relies too much on speculation / headcanon. It is also too overly complex, when there are other, much simpler solutions available.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;For example, I think there is more evidence for the Potters&amp;#39; cat to have been Professor McGonagall than Harry himself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdosku", "score_hidden": false, "stickied": false, "created": 1492474450.0, "created_utc": 1492445650.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65vyo4", "likes": null, "replies": "", "user_reports": [], "id": "dge1tht", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NotLordShaxx", "parent_id": "t3_65vyo4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "That's not even a theory. It's a headcanon.\n\n/r/ShittyFanTheories", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s not even a theory. It&amp;#39;s a headcanon.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"/r/ShittyFanTheories\"&gt;/r/ShittyFanTheories&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dge1tht", "score_hidden": false, "stickied": false, "created": 1492489023.0, "created_utc": 1492460223.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65vyo4", "likes": null, "replies": "", "user_reports": [], "id": "dgdq6f3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PrnGam", "parent_id": "t3_65vyo4", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "My first grade teacher was named Mrs. Potter, and she had a cat named Harry. Hmm...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My first grade teacher was named Mrs. Potter, and she had a cat named Harry. Hmm...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgdq6f3", "score_hidden": false, "stickied": false, "created": 1492475993.0, "created_utc": 1492447193.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]