[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;tl;dnr:&lt;/strong&gt; The Je&amp;#39;daii philosophy (prior to the formation of the Jedi Order) had been balance between Ashla (Light side) and Bogan (Dark side). We see this in the trailer for &amp;quot;The Last Jedi&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;However, after the Force Wars, in which the followers of Ashla (Light side) won over the followers of Bogan (Dark side), the former founded the Jedi order, &amp;quot;stating the Light side to be stronger&amp;quot;. We will see Rey seek out the teachings, and perhaps physical / Force semblance of, &amp;quot;the First Jedi&amp;quot; - the Je&amp;#39;daii - in order to seek to return balance to the Force.&lt;/p&gt;\n\n&lt;p&gt;As such, this theory also posits that it is Rey, in the same vein of Anakin Skywalker, who is a &amp;quot;Chosen One&amp;quot; of the Force - someone who, unlike the Jedi believed, &amp;quot;would destroy the Sith&amp;quot;, but eliminate the very thing making the Force unablanced: the Jedi themselves. (&amp;quot;It&amp;#39;s time for the Jedi to end.&amp;quot;)&lt;/p&gt;\n\n&lt;p&gt;Likewise, this theory may also tie into the one that Snoke is, indeed, &lt;a href=\"https://www.reddit.com/r/FanTheories/comments/4ggih9/star_wars_the_force_awakens_kylo_ren_is_a_dark/d2hrwgx/\"&gt;a holocron of an ancient Dark side Force user&lt;/a&gt;...one who could possibly be a Je&amp;#39;daii himself. Snoke could also possibly be a holocron of the first follower of Bogan, one of the first Dark Side users, and a Dark Je&amp;#39;daii.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;With the release of the first teaser trailer for &lt;em&gt;Star Wars: The Last Jedi&lt;/em&gt;, and director Rian Johnson claiming that &amp;quot;the Last Jedi is singular, [one person]&amp;quot;, this got me thinking...if the movie is about the &lt;em&gt;last&lt;/em&gt; Jedi, then what about the &lt;em&gt;first&lt;/em&gt; Jedi?&lt;/p&gt;\n\n&lt;p&gt;This, too, was prompted by two claims / evidence within, and behind, the making of the predecessor film, &lt;em&gt;Star Wars: The Force Awakens&lt;/em&gt;: &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The film was almost called &lt;em&gt;Star Wars: [An] Ancient Evil&lt;/em&gt;.&lt;/li&gt;\n&lt;li&gt;Kylo Ren&amp;#39;s lightsaber is &amp;quot;based off an ancient design&amp;quot;.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;This signifies, in order to determine more about the present and future of the series in &lt;em&gt;The Last Jedi&lt;/em&gt;, we must go back to &amp;quot;ancient&amp;quot; times...to the beginning of the Jedi Order, and how (and why) it came to be.&lt;/p&gt;\n\n&lt;p&gt;That being said, I also feel it relevant to bring up a quote from the Bible in what I believe will be relevant to &lt;em&gt;The Last Jedi&lt;/em&gt;: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;I am the Alpha and the Omega, the First and the Last, the Beginning and the End.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If applied to &lt;em&gt;The Force Awakens&lt;/em&gt;, this would most likely apply to Luke himself, who, as it seems, is &amp;quot;the Last Jedi&amp;quot; as well. (The &amp;quot;First&amp;quot;, in the sense he tried to retore the Order; the &amp;quot;Last&amp;quot;, because he realizes destruction of the Dark side unbalances the Force.) &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also because Rey, likely, will seek to restore the &amp;quot;balanced&amp;quot; view of the Force, as established by the Je&amp;#39;daii, predecessors to the Jedi.&lt;/p&gt;\n\n&lt;p&gt;Using a Quora answer to summarize the history of the Jedi:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;First things first, &lt;em&gt;Star Wars: Dawn of the Jedi&lt;/em&gt; series deals with the Je&amp;#39;daii Order, the order directly preceding the Jedi Order but not considered the same body. The Order of Dai Bendu preceded the Je&amp;#39;daii Order and could be said to be its spriritual ancestor.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1. The Order of Dai Bendu = at least 37,453 BBY - 36,453 BBY&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;One of the earliest groups to discover the Force, a millenia before the formation of the Je&amp;#39;daii Order they discovered a pyramidal edifice they could &amp;quot;hear&amp;quot;. They called it the &amp;quot;Tho Yor&amp;quot;, and tended it for a thousand years, before it &amp;quot;woke up&amp;quot; and revealed itself to be a starship, which transported them to the world of Tython, where they contributed to the foundation of the Je&amp;#39;daii Order.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2. Je&amp;#39;daii Order = 36,453 BBY - 25,783 BBY&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Wookiepedia gives the date of formation of the Je&amp;#39;daii Order as 36,453 BBY, sourced to &lt;em&gt;Star Wars: Dawn of the Jedi: Force Storm 1&lt;/em&gt; (the first issue of the Dark Horse miniseries)&lt;/p&gt;\n\n&lt;p&gt;The Monks of Dai Bendu had been only one of eight Tho Yor, that had repeated the pattern elsewhere in the galaxy, gathering Force-sensitive sentients who could hear their call and bringing them to Tython. These force-sensitives became the first Tythans and together became the Je&amp;#39;daii Order.&lt;/p&gt;\n\n&lt;p&gt;The collapse of the Je&amp;#39;daii Order came about due the Force Wars - the conflict between Dark-side (Bogan) and Light-side (Ashla) followers in the Je&amp;#39;daii Order. And post-war, the surviving Light-Siders led to the formation of the Jedi Order.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3. Jedi Order = 25,783 BBY - 19 BBY&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Wookiepedia gives the date of formation of Jedi Order as 25,783 BBY, sourced to SWTOR Timeline Video 1. It seems to the the date of the end of Force Wars, one of the direct outcomes of which was the creation of the Jedi Order.&lt;/p&gt;\n\n&lt;p&gt;The Je&amp;#39;daii philosophy had been balance between Ashla (Light side) and Bogan (Dark side). However, after the Force Wars, when the followers of Bogan were defeated, the victors, i.e. the followers of Ashla abandoned the philosophy of balance, stating the Light side to be stronger and this splinter group began calling themselves Jedi and formed a Jedi Council consisting of the founding members: Jedi Masters Rajivari, Garon Jard, Cala Brin and Ters Sendon. [They deemed that they would only use their powers for the protection of the weak and disenfranchised.]&lt;/p&gt;\n\n&lt;p&gt;(Rajivari later abandoned the Light, and could be said to be the first Dark Jedi.)&lt;/p&gt;\n\n&lt;p&gt;This organization persisted until the Great Jedi Purge led by Darths Sidious and Vader in 19 BBY, though it almost perished with the First Jedi Purge during Darth Revan&amp;#39;s time in 3954 BBY. &lt;a href=\"https://scifi.stackexchange.com/questions/70572/who-was-were-the-first-jedi\"&gt;(Source)&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This history also is (or, was) backed up by two other &amp;quot;official&amp;quot; sources: &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;The Jedi Path : A Manual for Students of the Force&lt;/em&gt;, a sourcebook which lists the earliest Jedi as originating on the planet of Tython.&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Jedi Vs Sith : The Essential Guide to the Force&lt;/em&gt;, a sourcebook which states, &amp;quot;...as long as there have been Jedi, there have been those who have been tempted to use the force for selfish and even nefarious purposes.&amp;quot;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Likewise, the unbalance created by the Jedi - only focusing on the Light side of the Force - may have prompted the Prophecy to begin with. The destruction / defeat of the Dark Side / Bogan followers, the Dark Je&amp;#39;daii, left the Jedi entirely leaning to the Light side of the Force, and later gave rise to the Sith (formed by Dark Jedi).&lt;/p&gt;\n\n&lt;p&gt;As one poster put it aptly:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My god history seems to repeat itself for the Jedi and Sith. Jedi destroy Sith, Sith destroy Jedi, and vice versa for thousands of Millenia. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So Anakin&amp;#39;s line of, &amp;quot;From my point of view, the Jedi are evil!&amp;quot;, while widely regarded as bad and cheesy, might actually &lt;em&gt;not&lt;/em&gt; have been off-base. While not &amp;quot;evil&amp;quot;, the Jedi, it seems, are the ones who have been un-balancing the Force to begin with. Instead of a balance between light and dark, as the Je&amp;#39;daii once believed, the Jedi instead believe &amp;quot;the Light side is the most powerful&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Last, but not least, we have more evidence of &lt;em&gt;The Last jedi&lt;/em&gt; involving the Je&amp;#39;daii through inclusion of this quote in the official book for &lt;em&gt;The Force Awakens&lt;/em&gt;:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;&amp;quot;First comes the day&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Then comes the night.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;After the darkness&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Shines through the light.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;The difference, they say,&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Is only made right&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;By the resolving of gray&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Through refined Jedi sight.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not only does this poem directly mirror what Luke and Rey talk about in the teaser trailer for &lt;em&gt;The Last Jedi&lt;/em&gt;, but it has &amp;quot;ancient&amp;quot; origins within the canon.&lt;/p&gt;\n\n&lt;p&gt;In-canon, it comes from the Journal of the Whills,  a journal that referenced the Jedi. A verse within the journal labeled 7:477 contained a poem concerning the dark side and the light side of The Force.&lt;/p&gt;\n\n&lt;p&gt;From the Star Wars Wiki:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The conception of the Journal of the Whills dates back to the earliest drafts of the Star Wars franchise, in which George Lucas had intended to use the Journal as a plot device for connecting the Star Wars galaxy to the real world.&lt;/p&gt;\n\n&lt;p&gt;While this idea was ultimately dropped, the Journal was mentioned in several Star Wars sources such as the novelization of the original film, which, like the novelization of &lt;em&gt;The Force Awakens&lt;/em&gt;, was written by Alan Dean Foster.&lt;/p&gt;\n\n&lt;p&gt;The Journal of the Whills was first made canon by the novelization of &lt;em&gt;The Force Awakens&lt;/em&gt;, which opens with a quotation from the journal.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;While, at first, it appears that the &amp;quot;resolving of gray&amp;quot; refers to fully turning to the Light side, I don&amp;#39;t think that is the case...only that the vision &amp;quot;becomes clear...through resolving of gray&amp;quot;. This is in clear contrast to theories about Rey (and, perhaps, Luke) &lt;a href=\"http://comicbook.com/starwars/2017/04/17/star-wars-8-rey-gray-last-jedi/\"&gt;becoming Gray Jedi&lt;/a&gt;.  &lt;/p&gt;\n\n&lt;p&gt;What I think the poem means is more along the lines of &amp;quot;clearing one&amp;#39;s vision through elightenment&amp;quot;, specifically...realizing that a balance between the Light side and the Dark side is necessary. Elsewise, &amp;quot;unbalance&amp;quot; between the two sides of the Force will lead to the cycle of warfare and destruction we see throughout the centuries between the Jedi (Light) and the Sith (Dark).&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;In addition to the above, I wanted to add another, separate point that&amp;#39;s been discussed: lightsaber color.&lt;/p&gt;\n\n&lt;p&gt;In the poster for &lt;em&gt;The Last Jedi&lt;/em&gt;, we see Rey&amp;#39;s lightsaber seemingly change / alternate between blue (Light) and red (Dark), possibly symbolizing &amp;quot;balance&amp;quot; between the two sides of the force.&lt;/p&gt;\n\n&lt;p&gt;However, there is another Force-user who has also experienced this in the past, and that person is none other than Princess Leia Organa Solo, the twin sister of Luke Skywalker.&lt;/p&gt;\n\n&lt;p&gt;From one source:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;For many years in the Legends EU, Leia used an old hand-me-down lightsaber - a blue one. However, she rarely used it and also neglected her training as a Jedi, long fearing that either her or her children would repeat the mistakes of Darth Vader,&lt;/p&gt;\n\n&lt;p&gt;However, a third of the way into the novel &amp;quot;Ambush at Corellia&amp;quot;, Luke gives her a new lightsaber - one that he built from scratch just for her. The lightsaber is described as smaller than her previous one - fitting her hand much better - and having a red blade. &lt;a href=\"https://scifi.stackexchange.com/questions/105655/why-did-luke-give-leia-a-red-lightsaber-of-all-colors\"&gt;(Source)&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;However, another source posits:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Her very first lightsaber was a green one given to her by Luke in the Thrawn trilogy. She lost that one at the end of the trilogy, and then got a lightsaber from Vima-Da-Boda, which was destroyed not long after. After that she built her own that had a &amp;quot;ruby&amp;quot; blade that she used all the way through the New Jedi Order Series. When she finally finished her Jedi training in the Dark Nest Trilogy she built a new blue lightsaber that she&amp;#39;s used ever since. &lt;a href=\"http://starwars.wikia.com/wiki/Forum:KB:Leia%27s_lightsaber(s\"&gt;(Source)&lt;/a&gt;)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;However, when the late Carrie Fisher was asked &amp;quot;what color lightsaber Leia should have&amp;quot;, she responded with an interesting one: purple. &lt;a href=\"http://www.cinemablend.com/news/1588480/star-wars-what-color-lightsaber-leia-should-have-according-to-carrie-fisher\"&gt;(Source)&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s interesting to note that purple - the color between blue (Light) and red (Dark) - may also indicate a &amp;quot;balance&amp;quot; between the two. This is, too, is referenced by Rey&amp;#39;s lightsaber &amp;quot;changing&amp;quot; between blue / red on &lt;em&gt;The Last Jedi&lt;/em&gt; poster, perhaps with purple being the ultimate result of a Force user who &amp;quot;accepts balance between the Light side (Jedi) and the Dark side (Sith)&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**tl;dnr:** The Je'daii philosophy (prior to the formation of the Jedi Order) had been balance between Ashla (Light side) and Bogan (Dark side). We see this in the trailer for \"The Last Jedi\". \n\nHowever, after the Force Wars, in which the followers of Ashla (Light side) won over the followers of Bogan (Dark side), the former founded the Jedi order, \"stating the Light side to be stronger\". We will see Rey seek out the teachings, and perhaps physical / Force semblance of, \"the First Jedi\" - the Je'daii - in order to seek to return balance to the Force.\n\nAs such, this theory also posits that it is Rey, in the same vein of Anakin Skywalker, who is a \"Chosen One\" of the Force - someone who, unlike the Jedi believed, \"would destroy the Sith\", but eliminate the very thing making the Force unablanced: the Jedi themselves. (\"It's time for the Jedi to end.\")\n\nLikewise, this theory may also tie into the one that Snoke is, indeed, [a holocron of an ancient Dark side Force user](https://www.reddit.com/r/FanTheories/comments/4ggih9/star_wars_the_force_awakens_kylo_ren_is_a_dark/d2hrwgx/)...one who could possibly be a Je'daii himself. Snoke could also possibly be a holocron of the first follower of Bogan, one of the first Dark Side users, and a Dark Je'daii.\n\n-------------------------------\n\nWith the release of the first teaser trailer for *Star Wars: The Last Jedi*, and director Rian Johnson claiming that \"the Last Jedi is singular, [one person]\", this got me thinking...if the movie is about the *last* Jedi, then what about the *first* Jedi?\n\nThis, too, was prompted by two claims / evidence within, and behind, the making of the predecessor film, *Star Wars: The Force Awakens*: \n\n- The film was almost called *Star Wars: [An] Ancient Evil*.\n- Kylo Ren's lightsaber is \"based off an ancient design\".\n\nThis signifies, in order to determine more about the present and future of the series in *The Last Jedi*, we must go back to \"ancient\" times...to the beginning of the Jedi Order, and how (and why) it came to be.\n\nThat being said, I also feel it relevant to bring up a quote from the Bible in what I believe will be relevant to *The Last Jedi*: \n\n&gt; \"I am the Alpha and the Omega, the First and the Last, the Beginning and the End.\"\n\nIf applied to *The Force Awakens*, this would most likely apply to Luke himself, who, as it seems, is \"the Last Jedi\" as well. (The \"First\", in the sense he tried to retore the Order; the \"Last\", because he realizes destruction of the Dark side unbalances the Force.) \n\nIt's also because Rey, likely, will seek to restore the \"balanced\" view of the Force, as established by the Je'daii, predecessors to the Jedi.\n\nUsing a Quora answer to summarize the history of the Jedi:\n\n&gt; First things first, *Star Wars: Dawn of the Jedi* series deals with the Je'daii Order, the order directly preceding the Jedi Order but not considered the same body. The Order of Dai Bendu preceded the Je'daii Order and could be said to be its spriritual ancestor.\n\n&gt; **1. The Order of Dai Bendu = at least 37,453 BBY - 36,453 BBY**\n\n&gt; One of the earliest groups to discover the Force, a millenia before the formation of the Je'daii Order they discovered a pyramidal edifice they could \"hear\". They called it the \"Tho Yor\", and tended it for a thousand years, before it \"woke up\" and revealed itself to be a starship, which transported them to the world of Tython, where they contributed to the foundation of the Je'daii Order.\n\n&gt; **2. Je'daii Order = 36,453 BBY - 25,783 BBY**\n\n&gt; Wookiepedia gives the date of formation of the Je'daii Order as 36,453 BBY, sourced to *Star Wars: Dawn of the Jedi: Force Storm 1* (the first issue of the Dark Horse miniseries)\n\n&gt; The Monks of Dai Bendu had been only one of eight Tho Yor, that had repeated the pattern elsewhere in the galaxy, gathering Force-sensitive sentients who could hear their call and bringing them to Tython. These force-sensitives became the first Tythans and together became the Je'daii Order.\n\n&gt; The collapse of the Je'daii Order came about due the Force Wars - the conflict between Dark-side (Bogan) and Light-side (Ashla) followers in the Je'daii Order. And post-war, the surviving Light-Siders led to the formation of the Jedi Order.\n\n&gt; **3. Jedi Order = 25,783 BBY - 19 BBY**\n\n&gt; Wookiepedia gives the date of formation of Jedi Order as 25,783 BBY, sourced to SWTOR Timeline Video 1. It seems to the the date of the end of Force Wars, one of the direct outcomes of which was the creation of the Jedi Order.\n\n&gt; The Je'daii philosophy had been balance between Ashla (Light side) and Bogan (Dark side). However, after the Force Wars, when the followers of Bogan were defeated, the victors, i.e. the followers of Ashla abandoned the philosophy of balance, stating the Light side to be stronger and this splinter group began calling themselves Jedi and formed a Jedi Council consisting of the founding members: Jedi Masters Rajivari, Garon Jard, Cala Brin and Ters Sendon. [They deemed that they would only use their powers for the protection of the weak and disenfranchised.]\n\n&gt; (Rajivari later abandoned the Light, and could be said to be the first Dark Jedi.)\n\n&gt; This organization persisted until the Great Jedi Purge led by Darths Sidious and Vader in 19 BBY, though it almost perished with the First Jedi Purge during Darth Revan's time in 3954 BBY. [(Source)](https://scifi.stackexchange.com/questions/70572/who-was-were-the-first-jedi)\n\nThis history also is (or, was) backed up by two other \"official\" sources: \n\n- *The Jedi Path : A Manual for Students of the Force*, a sourcebook which lists the earliest Jedi as originating on the planet of Tython.\n- *Jedi Vs Sith : The Essential Guide to the Force*, a sourcebook which states, \"...as long as there have been Jedi, there have been those who have been tempted to use the force for selfish and even nefarious purposes.\"\n\nLikewise, the unbalance created by the Jedi - only focusing on the Light side of the Force - may have prompted the Prophecy to begin with. The destruction / defeat of the Dark Side / Bogan followers, the Dark Je'daii, left the Jedi entirely leaning to the Light side of the Force, and later gave rise to the Sith (formed by Dark Jedi).\n\nAs one poster put it aptly:\n\n&gt; My god history seems to repeat itself for the Jedi and Sith. Jedi destroy Sith, Sith destroy Jedi, and vice versa for thousands of Millenia. \n\nSo Anakin's line of, \"From my point of view, the Jedi are evil!\", while widely regarded as bad and cheesy, might actually *not* have been off-base. While not \"evil\", the Jedi, it seems, are the ones who have been un-balancing the Force to begin with. Instead of a balance between light and dark, as the Je'daii once believed, the Jedi instead believe \"the Light side is the most powerful\".\n\nLast, but not least, we have more evidence of *The Last jedi* involving the Je'daii through inclusion of this quote in the official book for *The Force Awakens*:\n\n&gt; *\"First comes the day*\n\n&gt; *Then comes the night.*\n\n&gt; *After the darkness*\n\n&gt; *Shines through the light.*\n\n&gt; *The difference, they say,*\n\n&gt; *Is only made right*\n\n&gt; *By the resolving of gray*\n\n&gt; *Through refined Jedi sight.\"*\n\nNot only does this poem directly mirror what Luke and Rey talk about in the teaser trailer for *The Last Jedi*, but it has \"ancient\" origins within the canon.\n\nIn-canon, it comes from the Journal of the Whills,  a journal that referenced the Jedi. A verse within the journal labeled 7:477 contained a poem concerning the dark side and the light side of The Force.\n\nFrom the Star Wars Wiki:\n\n&gt; The conception of the Journal of the Whills dates back to the earliest drafts of the Star Wars franchise, in which George Lucas had intended to use the Journal as a plot device for connecting the Star Wars galaxy to the real world.\n\n&gt; While this idea was ultimately dropped, the Journal was mentioned in several Star Wars sources such as the novelization of the original film, which, like the novelization of *The Force Awakens*, was written by Alan Dean Foster.\n\n&gt; The Journal of the Whills was first made canon by the novelization of *The Force Awakens*, which opens with a quotation from the journal.\n\nWhile, at first, it appears that the \"resolving of gray\" refers to fully turning to the Light side, I don't think that is the case...only that the vision \"becomes clear...through resolving of gray\". This is in clear contrast to theories about Rey (and, perhaps, Luke) [becoming Gray Jedi](http://comicbook.com/starwars/2017/04/17/star-wars-8-rey-gray-last-jedi/).  \n\nWhat I think the poem means is more along the lines of \"clearing one's vision through elightenment\", specifically...realizing that a balance between the Light side and the Dark side is necessary. Elsewise, \"unbalance\" between the two sides of the Force will lead to the cycle of warfare and destruction we see throughout the centuries between the Jedi (Light) and the Sith (Dark).\n\n---------------------\n\nIn addition to the above, I wanted to add another, separate point that's been discussed: lightsaber color.\n\nIn the poster for *The Last Jedi*, we see Rey's lightsaber seemingly change / alternate between blue (Light) and red (Dark), possibly symbolizing \"balance\" between the two sides of the force.\n\nHowever, there is another Force-user who has also experienced this in the past, and that person is none other than Princess Leia Organa Solo, the twin sister of Luke Skywalker.\n\nFrom one source:\n\n&gt; For many years in the Legends EU, Leia used an old hand-me-down lightsaber - a blue one. However, she rarely used it and also neglected her training as a Jedi, long fearing that either her or her children would repeat the mistakes of Darth Vader,\n\n&gt; However, a third of the way into the novel \"Ambush at Corellia\", Luke gives her a new lightsaber - one that he built from scratch just for her. The lightsaber is described as smaller than her previous one - fitting her hand much better - and having a red blade. [(Source)](https://scifi.stackexchange.com/questions/105655/why-did-luke-give-leia-a-red-lightsaber-of-all-colors)\n\nHowever, another source posits:\n\n&gt; Her very first lightsaber was a green one given to her by Luke in the Thrawn trilogy. She lost that one at the end of the trilogy, and then got a lightsaber from Vima-Da-Boda, which was destroyed not long after. After that she built her own that had a \"ruby\" blade that she used all the way through the New Jedi Order Series. When she finally finished her Jedi training in the Dark Nest Trilogy she built a new blue lightsaber that she's used ever since. [(Source)](http://starwars.wikia.com/wiki/Forum:KB:Leia%27s_lightsaber(s))\n\nHowever, when the late Carrie Fisher was asked \"what color lightsaber Leia should have\", she responded with an interesting one: purple. [(Source)](http://www.cinemablend.com/news/1588480/star-wars-what-color-lightsaber-leia-should-have-according-to-carrie-fisher)\n\nIt's interesting to note that purple - the color between blue (Light) and red (Dark) - may also indicate a \"balance\" between the two. This is, too, is referenced by Rey's lightsaber \"changing\" between blue / red on *The Last Jedi* poster, perhaps with purple being the ultimate result of a Force user who \"accepts balance between the Light side (Jedi) and the Dark side (Sith)\".", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65y2vz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 25, "report_reasons": null, "author": "Obversa", "saved": false, "mod_reports": [], "name": "t3_65y2vz", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/fBN6RAWqXwzRBTRk7GGA_vb_D8qoHO15oOXCctDid_U.jpg?s=20c9cca35d56fd57490504d56ae7ee12", "width": 316, "height": 316}, "resolutions": [{"url": "https://i.redditmedia.com/fBN6RAWqXwzRBTRk7GGA_vb_D8qoHO15oOXCctDid_U.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=803d72bcdae8b6c9f0277a5e5bcafbef", "width": 108, "height": 108}, {"url": "https://i.redditmedia.com/fBN6RAWqXwzRBTRk7GGA_vb_D8qoHO15oOXCctDid_U.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=4604a6892992c39cef2c3ba374a51502", "width": 216, "height": 216}], "variants": {}, "id": "jr06LfKFaAoOMGYCYhfFLy2CXyPoQepo6vOwJn7GNDg"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65y2vz/star_wars_the_last_jedi_will_involve_rey_and_luke/", "num_reports": null, "locked": false, "stickied": false, "created": 1492489242.0, "url": "https://www.reddit.com/r/FanTheories/comments/65y2vz/star_wars_the_last_jedi_will_involve_rey_and_luke/", "author_flair_text": null, "quarantine": false, "title": "[Star Wars] \"The Last Jedi\" will involve Rey and Luke returning to the teachings of \"the First Jedi\".", "created_utc": 1492460442.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65y2vz", "likes": null, "replies": "", "user_reports": [], "id": "dge8dnm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Reoh", "parent_id": "t3_65y2vz", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I've seen a lot of posts along this train of thought but none of them were so well thought out, nice job. I just want to add a couple things about your mentioning of purple.\n\nAs most of us know, Mace Windu's lightsaber was purple. The Ligthsaber form 7 [Vaapad](https://www.youtube.com/watch?v=dsnc1Mf5GBM) was considered by some to be a dangerous balance between peace and passion, mirroring thoughts about red and blue light sabers.\n\nIn the lightsaber battle at the end of The Force Awakens, there were several instances of purple lighting. Admittedly this could have simply been superior lighting effects (which weren't in the earlier series during similar fights). Or perhaps it was a manifestation of *the force awakening?*\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen a lot of posts along this train of thought but none of them were so well thought out, nice job. I just want to add a couple things about your mentioning of purple.&lt;/p&gt;\n\n&lt;p&gt;As most of us know, Mace Windu&amp;#39;s lightsaber was purple. The Ligthsaber form 7 &lt;a href=\"https://www.youtube.com/watch?v=dsnc1Mf5GBM\"&gt;Vaapad&lt;/a&gt; was considered by some to be a dangerous balance between peace and passion, mirroring thoughts about red and blue light sabers.&lt;/p&gt;\n\n&lt;p&gt;In the lightsaber battle at the end of The Force Awakens, there were several instances of purple lighting. Admittedly this could have simply been superior lighting effects (which weren&amp;#39;t in the earlier series during similar fights). Or perhaps it was a manifestation of &lt;em&gt;the force awakening?&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dge8dnm", "score_hidden": false, "stickied": false, "created": 1492496829.0, "created_utc": 1492468029.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65y2vz", "likes": null, "replies": "", "user_reports": [], "id": "dge4xcn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NaggingNavigator", "parent_id": "t3_65y2vz", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "I like where you're going with this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like where you&amp;#39;re going with this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dge4xcn", "score_hidden": false, "stickied": false, "created": 1492492540.0, "created_utc": 1492463740.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65y2vz", "likes": null, "replies": "", "user_reports": [], "id": "dge4yzf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MattThePossum", "parent_id": "t3_65y2vz", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "Excellent post, my dude. I couldn't help but come to the same conclusion, although I haven't put anywhere near as much thought into it. So mad props. \n\nI feel like this is increasingly common speculation, between discussion of Qui-Gon being a grey jedi, and ironic palpatine shitposts that evolve into legit discussions of Jedi decadence and how they actually aren't balanced in the force. \n\nThe whole thing kind of reminds me of the old R+L=J speculation in /r/asoiaf, everyone totally saw it coming before the show revealed it, and I can't help but feel strongly that your theory is right on the money. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent post, my dude. I couldn&amp;#39;t help but come to the same conclusion, although I haven&amp;#39;t put anywhere near as much thought into it. So mad props. &lt;/p&gt;\n\n&lt;p&gt;I feel like this is increasingly common speculation, between discussion of Qui-Gon being a grey jedi, and ironic palpatine shitposts that evolve into legit discussions of Jedi decadence and how they actually aren&amp;#39;t balanced in the force. &lt;/p&gt;\n\n&lt;p&gt;The whole thing kind of reminds me of the old R+L=J speculation in &lt;a href=\"/r/asoiaf\"&gt;/r/asoiaf&lt;/a&gt;, everyone totally saw it coming before the show revealed it, and I can&amp;#39;t help but feel strongly that your theory is right on the money. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dge4yzf", "score_hidden": false, "stickied": false, "created": 1492492596.0, "created_utc": 1492463796.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]