[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FanTheories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;DO NOT READ UNLESS YOU HAVE WATCHED, Spoilers.&lt;/p&gt;\n\n&lt;p&gt;After repeat viewing of this film and \nmuch thinking I came together with a theory for this film&lt;/p&gt;\n\n&lt;p&gt;even though the film presents Verbal Kint as Keyser Söze I think some things counter this and doesn&amp;#39;t make a lot of sense at times. In some ways it makes more sense if Kint is working for Keyser Söze&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;This invokes some guesswork but still makes things murky about the film.\nKevin Spacey who portrays Kint was 35 at the time (1995)\nKobayishi tells the group that Dean Keaton stole steel designated for a nuclear reactor in Pakistan in 1981\nSo if Kint is the same age or around the same as the actor and the film is set in 1995 then kint would of have been 21 years old, it doesn&amp;#39;t sound plausible for a 21 year old to have the connections for a nuclear reactor in Pakistan but this can be continued further.\nIn the flash back scene where keyser kills his family, he has 3 kids and a wife, we don&amp;#39;t know when it took place but we can do some rough age estimation \nHis oldest son looks around 8 and even if had that son when he was 16 that would make keyser around 24, at least. And at this time he is a small time drug dealer in turkey, already he is older then 21 and a small time drug dealer could not have a nuclear reactor in Pakistan.\nFrom this kint is to young to be keyser. \nOf course the flashback scene could be fiction but even with the first part with kobayishi, it still poses some questions on how a 21 year old could have a nuclear reactor.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;This doesn&amp;#39;t have any evidence to argue against it but just some common sense.\nIf Kint is keyser, this means a crime lord of immense caliber as played the act of verbal for 6 weeks or more and either built up a identity or stolen one. \nI can&amp;#39;t understand why someone this powerful would risk themselves frontline and risk exposing themselves for 6 weeks or longer. It would make much more sene if he used a skilled member in his empire or hired someone he knew with the skills needed but doesn&amp;#39;t risk himself and having someone doing the frontline work he needs while he can safely pull the strings from afar. \nAnother interesting point from this is after the lineup scene when the suspects are in the holding cell, Keaton points out he has met kint once or twice before, in another lineup, so this means kint has been feigning being a cripple for more then 6 weeks, if kint is keyser then this makes even less sense. \nAnd also maybe the man called kobayishi arranged both of these line ups, the first one to Keaton has knowledge of kint so the others accept kint. as Kobayishi reveals in his introduction that he arranged the main one. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When the burnt Hungarian describes Keyser Söze he is depicted as kint exposing his whole face not with a hat so he can&amp;#39;t be the man in the suit, unless he decided to run around killing people then put his hat on to  and then got changed before the police got there, which is just ridiculous. Because kint was seen on the boat killing people and exposing his face, I think kint went on the boat killing people so the man in the suit who is actually keyser söze, can make sure he gets Arturo Marquez the man who can identify him and he happens to come across McManus and Keaton. And kill them or maybe even kint killed McManus. Hockney was killed by the man in the suit(Keyser) as keyser was nearby waiting for the commotion to end so he can board, hockey happened to come in his sights so keyser killed him to tie up a loose end. I think kint was ordered to clean up the boat for keyser, then he was to be captured and go back into character as a cripple, to spin the tale to the police and kint would have no attention to him due to him appearing weak, however the burnt Hungarian is a variable which wasn&amp;#39;t anticipated but lucky for kint he told his story in just enough time, but this checks out for keyser as the police thinks kint is keyser when he is not. On top of this The 91 million dollars was left so the police think it is a drug deal however the burnt Hungarian let the police know it wasn&amp;#39;t. Practically the Hungarian has been a huge pain the ass for keyser&amp;#39;s plan but it still kind of checks out. A lot more attention however is towards keyser&amp;#39;s way but they have the wrong identity. Kint&amp;#39;s story wasn&amp;#39;t going to involve keyser but due to the Hungarian he had to very quickly change his story, Overall I think it would make much more sense for kint to be working for keyser söze but the film intends for kint to be keyser söze.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Any feedback or criticism would be appreciated, made a Reddit account to post this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "DO NOT READ UNLESS YOU HAVE WATCHED, Spoilers.\n\nAfter repeat viewing of this film and \nmuch thinking I came together with a theory for this film\n\neven though the film presents Verbal Kint as Keyser Söze I think some things counter this and doesn't make a lot of sense at times. In some ways it makes more sense if Kint is working for Keyser Söze\n\n1. This invokes some guesswork but still makes things murky about the film.\nKevin Spacey who portrays Kint was 35 at the time (1995)\nKobayishi tells the group that Dean Keaton stole steel designated for a nuclear reactor in Pakistan in 1981\nSo if Kint is the same age or around the same as the actor and the film is set in 1995 then kint would of have been 21 years old, it doesn't sound plausible for a 21 year old to have the connections for a nuclear reactor in Pakistan but this can be continued further.\nIn the flash back scene where keyser kills his family, he has 3 kids and a wife, we don't know when it took place but we can do some rough age estimation \nHis oldest son looks around 8 and even if had that son when he was 16 that would make keyser around 24, at least. And at this time he is a small time drug dealer in turkey, already he is older then 21 and a small time drug dealer could not have a nuclear reactor in Pakistan.\nFrom this kint is to young to be keyser. \nOf course the flashback scene could be fiction but even with the first part with kobayishi, it still poses some questions on how a 21 year old could have a nuclear reactor.\n\n2. This doesn't have any evidence to argue against it but just some common sense.\nIf Kint is keyser, this means a crime lord of immense caliber as played the act of verbal for 6 weeks or more and either built up a identity or stolen one. \nI can't understand why someone this powerful would risk themselves frontline and risk exposing themselves for 6 weeks or longer. It would make much more sene if he used a skilled member in his empire or hired someone he knew with the skills needed but doesn't risk himself and having someone doing the frontline work he needs while he can safely pull the strings from afar. \nAnother interesting point from this is after the lineup scene when the suspects are in the holding cell, Keaton points out he has met kint once or twice before, in another lineup, so this means kint has been feigning being a cripple for more then 6 weeks, if kint is keyser then this makes even less sense. \nAnd also maybe the man called kobayishi arranged both of these line ups, the first one to Keaton has knowledge of kint so the others accept kint. as Kobayishi reveals in his introduction that he arranged the main one. \n3. When the burnt Hungarian describes Keyser Söze he is depicted as kint exposing his whole face not with a hat so he can't be the man in the suit, unless he decided to run around killing people then put his hat on to  and then got changed before the police got there, which is just ridiculous. Because kint was seen on the boat killing people and exposing his face, I think kint went on the boat killing people so the man in the suit who is actually keyser söze, can make sure he gets Arturo Marquez the man who can identify him and he happens to come across McManus and Keaton. And kill them or maybe even kint killed McManus. Hockney was killed by the man in the suit(Keyser) as keyser was nearby waiting for the commotion to end so he can board, hockey happened to come in his sights so keyser killed him to tie up a loose end. I think kint was ordered to clean up the boat for keyser, then he was to be captured and go back into character as a cripple, to spin the tale to the police and kint would have no attention to him due to him appearing weak, however the burnt Hungarian is a variable which wasn't anticipated but lucky for kint he told his story in just enough time, but this checks out for keyser as the police thinks kint is keyser when he is not. On top of this The 91 million dollars was left so the police think it is a drug deal however the burnt Hungarian let the police know it wasn't. Practically the Hungarian has been a huge pain the ass for keyser's plan but it still kind of checks out. A lot more attention however is towards keyser's way but they have the wrong identity. Kint's story wasn't going to involve keyser but due to the Hungarian he had to very quickly change his story, Overall I think it would make much more sense for kint to be working for keyser söze but the film intends for kint to be keyser söze.\n\nAny feedback or criticism would be appreciated, made a Reddit account to post this.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ycxf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "KaiZ42x", "saved": false, "mod_reports": [], "name": "t3_65ycxf", "subreddit_name_prefixed": "r/FanTheories", "approved_by": null, "over_18": false, "domain": "self.FanTheories", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u6rc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FanTheories/comments/65ycxf/the_usual_suspects_theory/", "num_reports": null, "locked": false, "stickied": false, "created": 1492491915.0, "url": "https://www.reddit.com/r/FanTheories/comments/65ycxf/the_usual_suspects_theory/", "author_flair_text": null, "quarantine": false, "title": "The usual suspects theory", "created_utc": 1492463115.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u6rc", "removal_reason": null, "link_id": "t3_65ycxf", "likes": null, "replies": "", "user_reports": [], "id": "dgeefmj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EnderVViggen", "parent_id": "t3_65ycxf", "subreddit_name_prefixed": "r/FanTheories", "controversiality": 0, "body": "So i just read #1 and I can already tell you, this isn't quit right.\n\nWhat you're forgetting is that everything that Kent talks about in the interrogation (basically the movie) is completely made up, on the spot.  None of it was true...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So i just read #1 and I can already tell you, this isn&amp;#39;t quit right.&lt;/p&gt;\n\n&lt;p&gt;What you&amp;#39;re forgetting is that everything that Kent talks about in the interrogation (basically the movie) is completely made up, on the spot.  None of it was true...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FanTheories", "name": "t1_dgeefmj", "score_hidden": true, "stickied": false, "created": 1492504641.0, "created_utc": 1492475841.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]