[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WikiLeaks", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t like what Mike Pompeo is saying about WikiLeaks right now. WikiLeaks essentially gave him his job by leaking Clinton&amp;#39;s emails and getting Trump elected. After learning about PRISM and many other ways in which the intelligence agencies overstep their boundaries, I&amp;#39;m more inclined to trust Assange than Pompeo. Sad, but true. Doesn&amp;#39;t help that the CIA or NSA never apologized, because the fact is what they were doing (and probably still are doing) is wrong. Point blank wrong!&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have anything to hide, and these days most people post every single detail about themselves on Facebook anyway. It just makes me mad that this ancient oligarchy exists in Washington of these old dudes who think they can do what they want and say what they want. The only things I&amp;#39;ve seen from Mike Pompeo and his lot are that they have lots of shiny tools and big buttons which they like to play with because it makes them feel important. I don&amp;#39;t think they are PRODUCTIVE, I don&amp;#39;t think they are ORGANIZED, and I don&amp;#39;t think they CARE. I liken them to a bunch of big babies let loose in a Toys R Us. . . all they do is make a mess and cry when someone tells them to clean up after themselves. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't like what Mike Pompeo is saying about WikiLeaks right now. WikiLeaks essentially gave him his job by leaking Clinton's emails and getting Trump elected. After learning about PRISM and many other ways in which the intelligence agencies overstep their boundaries, I'm more inclined to trust Assange than Pompeo. Sad, but true. Doesn't help that the CIA or NSA never apologized, because the fact is what they were doing (and probably still are doing) is wrong. Point blank wrong!\n\nI don't have anything to hide, and these days most people post every single detail about themselves on Facebook anyway. It just makes me mad that this ancient oligarchy exists in Washington of these old dudes who think they can do what they want and say what they want. The only things I've seen from Mike Pompeo and his lot are that they have lots of shiny tools and big buttons which they like to play with because it makes them feel important. I don't think they are PRODUCTIVE, I don't think they are ORGANIZED, and I don't think they CARE. I liken them to a bunch of big babies let loose in a Toys R Us. . . all they do is make a mess and cry when someone tells them to clean up after themselves. ", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657uho", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "WindUpBird002", "saved": false, "mod_reports": [], "name": "t3_657uho", "subreddit_name_prefixed": "r/WikiLeaks", "approved_by": null, "over_18": false, "domain": "self.WikiLeaks", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qy11", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WikiLeaks/comments/657uho/trust_issues/", "num_reports": null, "locked": false, "stickied": false, "created": 1492141852.0, "url": "https://www.reddit.com/r/WikiLeaks/comments/657uho/trust_issues/", "author_flair_text": null, "quarantine": false, "title": "Trust issues", "created_utc": 1492113052.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]