[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WikiLeaks", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h3&gt;&lt;a href=\"https://www.forbes.com/sites/leemathews/2017/04/15/shadow-brokers-leak-reveals-the-nsas-deep-access-into-swift-banking-network/#7871dcda4445\"&gt;Shadow Brokers Leak Reveals The NSA&amp;#39;s Deep Access Into SWIFT Banking Network&lt;/a&gt;&lt;/h3&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In August of 2016, a group calling itself the Shadow Brokers emerged with a treasure trove of purported NSA hacking tools. The group released only a small portion of its take and eventually tried unsuccessfully to auction the good stuff. When no one offered to pay, Shadow Brokers decided to give it away for free.&lt;/p&gt;\n\n&lt;p&gt;In an enterprise setting, however, disabling the Windows Firewall and allowing remote desktop connections is quite common. That&amp;#39;s where these exploits were designed to work, and the Shadow Brokers data appears to reveal that the NSA used these tools against at least one eyebrow-raising target: a SWIFT bureau in the Middle East.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Following The Money&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As part of the Bush administration&amp;#39;s War on Terrorism the Terrorist Finance Tracking program was set up. Under TFTP, the U.S. gained the ability to monitor transactions carried out via SWIFT. Why target SWIFT specifically? There are upwards of 11,000 banks in 200 countries that use it, and they exchange around 15 million messages a day. If you need to keep an eye on large amounts of money moving internationally, SWIFT is the key.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;•••&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A leaked PowerPoint slide appears to confirm that the NSA had successfully set up backdoor monitoring on 9 banks running  SWIFT Alliance Access (SAA) servers. At least three others at another SWIFT Bureau were targeted, but they had not been compromised at the time of creation of the PowerPoint presentation in 2013.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/a-rundown-of-the-biggest-cybersecurity-incidents-of-2016\"&gt;A Rundown of the Biggest Cybersecurity Incidents of 2016&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;h3&gt;&lt;a href=\"https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/a-rundown-of-the-biggest-cybersecurity-incidents-of-2016#LeoniAndBangladeshBank\"&gt;Most expensive attacks: Leoni and Bangladesh Bank&lt;/a&gt;&lt;/h3&gt;\n\n&lt;p&gt;Large multinational companies are the prime targets of &lt;a href=\"https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/billion-dollar-scams-the-numbers-behind-business-email-compromise\"&gt;Business Email Compromise&lt;/a&gt; (BEC), which is a type of online scam that usually begins with an attacker compromising a legitimate email account and tricking the company’s financial officer to wire funds to their accounts. Typically the companies that fall victim to these scams deal with foreign suppliers and habitually use wire transfer payments. Victims of BEC scams have increased &lt;a href=\"https://www.fbi.gov/contact-us/field-offices/phoenix/news/press-releases/fbi-warns-of-dramatic-increase-in-business-e-mail-scams\"&gt;270%&lt;/a&gt; since the start of 2015, and this year saw one of the largest amounts lost by an enterprise.\nRead more&lt;/p&gt;\n\n&lt;h3&gt;&lt;a href=\"https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/a-rundown-of-the-biggest-cybersecurity-incidents-of-2016#SWIFTattack\"&gt;Biggest attack vector in finance: SWIFT&lt;/a&gt;&lt;/h3&gt;\n\n&lt;p&gt;The Society for Worldwide Interbank Financial Telecommunication (SWIFT) is a global transaction messaging network used by banks and other financial entities such as foreign exchanges and investment firms. Unfortunately, this year saw attackers &lt;a href=\"http://blog.trendmicro.com/trendlabs-security-intelligence/high-profiled-cyber-theft-against-banks-targeted-swift-systems/\"&gt;targeting SWIFT clients&lt;/a&gt;, compromising and manipulating organizations into sending fraudulent money transfer requests. It’s unclear how many of these attacks were actually successful, but in June, SWIFT sent its clients a &lt;a href=\"http://www.reuters.com/article/us-cyber-heist-swift-idUSKCN11600C?feedType=RSS&amp;amp;feedName=technologyNews\"&gt;letter&lt;/a&gt; warning them about the possible dangers. The organization also urged clients to update their software and tighten their cyber defenses.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://motherboard.vice.com/en_us/article/shadow-brokers-dump-alleged-windows-exploits-and-nsa-presentations-on-targeting-banks\"&gt;Shadow Brokers Dump Alleged Windows Exploits and NSA Presentations on Targeting Banks&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The post includes a link to a selection of files and folders. One sub-folder called &amp;quot;exploits&amp;quot; includes executable files with apparent codenames such as &amp;quot;Eternalsynergy,&amp;quot; &amp;quot;Erraticgopher,&amp;quot; and &amp;quot;Emeraldthread.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;•••&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;This is phenomenal data, it has all the hallmarks of slickly produced internal attack tools,&amp;quot; Hacker Fantastic continued. &amp;quot;I am certain that analysis on this data will turn up another 0day [zero day].&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Security architect Kevin Beaumont told Motherboard in a Twitter direct message, &amp;quot;All of the Windows implants are new to VirusTotal [an online file scanning tool], which suggests they&amp;#39;ve not been seen before.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Targets of NSA hacking operations may also be able to determine whether they were compromised thanks to these new files. Cybersecurity company Symantec recently did something similar but with details of alleged CIA hacking tools released by Wikileaks.&lt;/p&gt;\n\n&lt;p&gt;Another section of the [dump](\n(&lt;a href=\"https://gist.github.com/misterch0c/08829bc65b208609d455a9f4aeaa2a6c\"&gt;https://gist.github.com/misterch0c/08829bc65b208609d455a9f4aeaa2a6c&lt;/a&gt;) includes several alleged presentations marked &amp;quot;TOP SECRET&amp;quot; concerning &amp;quot;[JEEPFLEA_MARKET](&lt;/p&gt;\n\n&lt;p&gt;).&amp;quot; According to a previous analysis by Electrospaces.net, which searches through previously released government documents including the Snowden files for additional clues, Jeepflea is a hacking project from Tailored Access Operations (TAO), the NSA&amp;#39;s elite hacking unit. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://money.cnn.com/2017/04/14/technology/windows-exploits-shadow-brokers/\"&gt;NSA&amp;#39;s powerful Windows hacking tools leaked online&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.cyberscoop.com/shadow-brokers-nsa-documents-reveal-sweeping-espionage-operation-middle-eastern-banks/\"&gt;Shadow Brokers leak NSA documents that may reveal operation aimed at Middle Eastern banks&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So here are the dots not being connected...&lt;/p&gt;\n\n&lt;p&gt;In 2016 Shadow Brokers placed a trove of NSA hacking tools up for sale last year. On &lt;a href=\"https://www.wired.com/2016/08/shadow-brokers-mess-happens-nsa-hoards-zero-days/\"&gt;08.17.16&lt;/a&gt; wired reported that that stolen NSA exploit tools were being held hostage for a Bit Coin pay out. When no one came up with the ransom the Shadow Brokers began selling the apps individually for prices that range from 1 to 1000 Bit Coins.&lt;/p&gt;\n\n&lt;p&gt;This is only half the story because prior to the release of the information in August 2016 maybe as far back as several years a series of attacks and robberies through the SWIFT system occurred.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.bloomberg.com/news/articles/2016-05-26/swift-hack-probe-expands-to-up-to-dozen-banks-beyond-bangladesh\"&gt;Swift Hack Probe Expands to Up to a Dozen Banks Beyond Bangladesh&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.wired.com/2016/05/insane-81m-bangladesh-bank-heist-heres-know/\"&gt;That Insane, $81M Bangladesh Bank Heist? Here’s What We Know&lt;/a&gt;\n05.17.16 - 7:00 am&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://mobile.nytimes.com/2016/05/13/business/dealbook/swift-global-bank-network-attack.html?_r=0&amp;amp;referer=\"&gt;Once Again, Thieves Enter Swift Financial Network and Steal&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;New details about a second attack involving Swift — the messaging system used by thousands of banks and companies to move money around the world — are emerging as investigators are still trying to solve the $81 million heist from the central bank of Bangladesh in February. In that theft, the attackers were able to compel the Federal Reserve Bank of New York to move money to accounts in the Philippines.&lt;/p&gt;\n\n&lt;p&gt;The second attack involves a commercial bank, which Swift declined to identify. But in a letter Swift plans to share with its users on Friday, the messaging network warned that the two attacks bore numerous similarities and were very likely part of a “wider and highly adaptive campaign targeting banks.”&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.theregister.co.uk/2016/05/27/fourth_bank_hit_by_swift_hackers/\"&gt;FOURTH bank hit by SWIFT hackers&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Evidence is emerging that the SWIFT (Society for Worldwide Interbank Financial Telecom) attacks began as far back as October 2015 when the Philippines bank was first hit, two months prior to the discovery of the failed attack on Tien Phong Bank in Vietnam.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There are many more articles beyond these, but what it looks like is the Shadow Brokers or some associated individuals pulled off a series of bank heists prior to releasing the applications to the open market. That also open the &lt;a href=\"https://threatpost.com/shadowbrokers-expose-nsa-access-to-swift-service-bureaus/124996/\"&gt;question of what the NSA&lt;/a&gt; was doing with the applications? They could have have been tracking &amp;quot;suspects&amp;quot; but it seems they could have also been moving money for any reason they chose without records being left in the banking system. The possible exploits were only exposed after a series of bank robberies exposed the power of the tools the NSA had developed. &lt;/p&gt;\n\n&lt;p&gt;It seems once again crimes have exposed the government&amp;#39;s illicit powers concealed by the intelligence community (IC). It is entirely possible that the tools were used legally and only to expose private records of terrorists and spies under FISA warrants, but who knows. The only thing that exposed these exploits was the theft. Kinda makes ya wonder, huh?&lt;/p&gt;\n\n&lt;p&gt;The evidence and the different styles of hacking listed in the articles about the bank heists suggests that an initial group stole some NSA hacking tools and pulled off the Bangladesh heist. They may or may not have done Ecuador or the Philippines but it seems that at some point the exploits were sold on the open market, but that does not exclude some clandestine deals with other groups that also have employed the exploits. Once the initial 81 million was stolen they distributed the exploits to other groups who may have also attacked the SWIFT system and other targets to make forensics on nation state level zero day attacks that much more difficult. Several groups attempting independent attacks increased the attack vectors making identification even more difficult. It also appears that the hackers may have targeted banks that had the Trojans installed initially. So why would they go for relatively small scores when they essentially owned the SWIFT system. Could the hackers be attacking networks already infected with the Trojan. &lt;/p&gt;\n\n&lt;p&gt;It really makes sense when you think about the banks they hit. The NSA installs the Trojans to &amp;quot;observe&amp;quot; suspected transactions. The hackers obtain the exploits, found the Trojans phoning home and used them to own the infected systems, modified the attack vectors to transfer money. Why not skip the phishing attack when there was already infected banks. Take the path of least resistance that leads back to someone the American government would never admit lead away from the hackers. &lt;/p&gt;\n\n&lt;p&gt;Of course that means anyone including the IC could have manipulated transactions, but hey that wouldn&amp;#39;t have been a robbery would it. Really the tools could have been used to track transactions, but they could have facilitated the IC surreptitious movement of money to fund operations. &lt;/p&gt;\n\n&lt;p&gt;In all reality it was very clever, make a score, don&amp;#39;t get greedy, prevent the creation of a M.O. to narrow investigations and identify the perpetrators. But identifying clever when they managed to steal exploits from the NSA and could use the exploits to attack the banking system. Just the fact that they can&amp;#39;t be identified means they are pretty slick and the exploits are not for the novice user. There were some skills at work here. &lt;/p&gt;\n\n&lt;p&gt;What else was done with the exploits and who are they?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://thehackernews.com/2017/04/nsa-hacking-tools.html?m=1\"&gt;Shadow Brokers Group Releases More Stolen NSA Hacking Tools &amp;amp; Exploits&lt;/a&gt;\n Saturday, April 08, 2017&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Besides dumping some NSA&amp;#39;s hacking tools back in August 2016, the Shadow Brokers also released an encrypted cache of files containing more NSA&amp;#39;s hacking tools and exploits in an auction, asking for 1 Million Bitcoins (around $568 Million).\nHowever, after failed auction, the group put up those hacking tools and exploits for direct sale on an underground website, categorizing them into a type — like &amp;quot;exploits,&amp;quot; &amp;quot;Trojans,&amp;quot; and &amp;quot;implant&amp;quot; — each of which ranged from 1 to 100 Bitcoins (from $780 to $78,000).\nNow, the Shadow Brokers has finally released password for the encrypted cache of NSA&amp;#39;s files, allowing anyone to unlock and download the auction data dump.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;h3&gt;CrDj”(;Va.*NdlnzB9M@K2)#&amp;gt;deB7mN&lt;/h3&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.wired.com/2016/08/shadow-brokers-mess-happens-nsa-hoards-zero-days/\"&gt;THE SHADOW BROKERS MESS IS WHAT HAPPENS WHEN THE NSA HOARDS ZERO-DAYS&lt;/a&gt;\nAUTHOR: ANDY GREENBERG\n08.17.16. - 8:34 PM&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://techcrunch.com/2016/08/16/everything-you-need-to-know-about-the-nsa-hack-but-were-afraid-to-google/\"&gt;Everything you need to know about the NSA hack - but were afraid to Google&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.theregister.co.uk/2016/10/31/shadow_brokers_dump/\"&gt;Shadow Brokers leak systems hacked by NSA – mostly mail and uni servers in India, China&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://hosted2.ap.org/APDEFAULT/cae69a7523db45408eeb2b3a98c0c9c5/Article_2017-04-14-Cybersecurity-NSA/id-737110725d064fdfbba883c920f1979c\"&gt;New leak suggests NSA penetrated Mideast banking networks&lt;/a&gt;\nBy RAPHAEL SATTER&lt;/p&gt;\n\n&lt;h1&gt;&lt;a href=\"https://metacurity.com\"&gt;&amp;lt;Metacurity&amp;gt;&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;Sunday April 16, 2017\nclick here for archives&lt;/p&gt;\n\n&lt;p&gt;☰\nLatest News&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"/r/CoincidenceTheorist\"&gt;r/CoincidenceTheorist&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;-23-&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "###[Shadow Brokers Leak Reveals The NSA's Deep Access Into SWIFT Banking Network](https://www.forbes.com/sites/leemathews/2017/04/15/shadow-brokers-leak-reveals-the-nsas-deep-access-into-swift-banking-network/#7871dcda4445)\n\n&gt;In August of 2016, a group calling itself the Shadow Brokers emerged with a treasure trove of purported NSA hacking tools. The group released only a small portion of its take and eventually tried unsuccessfully to auction the good stuff. When no one offered to pay, Shadow Brokers decided to give it away for free.\n\n&gt;In an enterprise setting, however, disabling the Windows Firewall and allowing remote desktop connections is quite common. That's where these exploits were designed to work, and the Shadow Brokers data appears to reveal that the NSA used these tools against at least one eyebrow-raising target: a SWIFT bureau in the Middle East.\n\nFollowing The Money\n\n&gt;As part of the Bush administration's War on Terrorism the Terrorist Finance Tracking program was set up. Under TFTP, the U.S. gained the ability to monitor transactions carried out via SWIFT. Why target SWIFT specifically? There are upwards of 11,000 banks in 200 countries that use it, and they exchange around 15 million messages a day. If you need to keep an eye on large amounts of money moving internationally, SWIFT is the key.\n\n•••\n\n&gt;A leaked PowerPoint slide appears to confirm that the NSA had successfully set up backdoor monitoring on 9 banks running  SWIFT Alliance Access (SAA) servers. At least three others at another SWIFT Bureau were targeted, but they had not been compromised at the time of creation of the PowerPoint presentation in 2013.\n\n\n[A Rundown of the Biggest Cybersecurity Incidents of 2016](https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/a-rundown-of-the-biggest-cybersecurity-incidents-of-2016)\n\n&gt;###[Most expensive attacks: Leoni and Bangladesh Bank](https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/a-rundown-of-the-biggest-cybersecurity-incidents-of-2016#LeoniAndBangladeshBank)\n&gt;Large multinational companies are the prime targets of [Business Email Compromise](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/billion-dollar-scams-the-numbers-behind-business-email-compromise) (BEC), which is a type of online scam that usually begins with an attacker compromising a legitimate email account and tricking the company’s financial officer to wire funds to their accounts. Typically the companies that fall victim to these scams deal with foreign suppliers and habitually use wire transfer payments. Victims of BEC scams have increased [270%](https://www.fbi.gov/contact-us/field-offices/phoenix/news/press-releases/fbi-warns-of-dramatic-increase-in-business-e-mail-scams) since the start of 2015, and this year saw one of the largest amounts lost by an enterprise.\nRead more\n\n&gt;###[Biggest attack vector in finance: SWIFT](https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/a-rundown-of-the-biggest-cybersecurity-incidents-of-2016#SWIFTattack)\n&gt;The Society for Worldwide Interbank Financial Telecommunication (SWIFT) is a global transaction messaging network used by banks and other financial entities such as foreign exchanges and investment firms. Unfortunately, this year saw attackers [targeting SWIFT clients](http://blog.trendmicro.com/trendlabs-security-intelligence/high-profiled-cyber-theft-against-banks-targeted-swift-systems/), compromising and manipulating organizations into sending fraudulent money transfer requests. It’s unclear how many of these attacks were actually successful, but in June, SWIFT sent its clients a [letter](http://www.reuters.com/article/us-cyber-heist-swift-idUSKCN11600C?feedType=RSS&amp;feedName=technologyNews) warning them about the possible dangers. The organization also urged clients to update their software and tighten their cyber defenses.\n\n\n\n\n[Shadow Brokers Dump Alleged Windows Exploits and NSA Presentations on Targeting Banks](https://motherboard.vice.com/en_us/article/shadow-brokers-dump-alleged-windows-exploits-and-nsa-presentations-on-targeting-banks)\n\n&gt;The post includes a link to a selection of files and folders. One sub-folder called \"exploits\" includes executable files with apparent codenames such as \"Eternalsynergy,\" \"Erraticgopher,\" and \"Emeraldthread.\"\n\n•••\n\n&gt;\"This is phenomenal data, it has all the hallmarks of slickly produced internal attack tools,\" Hacker Fantastic continued. \"I am certain that analysis on this data will turn up another 0day [zero day].\"\n\n&gt;Security architect Kevin Beaumont told Motherboard in a Twitter direct message, \"All of the Windows implants are new to VirusTotal [an online file scanning tool], which suggests they've not been seen before.\"\n\nTargets of NSA hacking operations may also be able to determine whether they were compromised thanks to these new files. Cybersecurity company Symantec recently did something similar but with details of alleged CIA hacking tools released by Wikileaks.\n\nAnother section of the [dump](\n(https://gist.github.com/misterch0c/08829bc65b208609d455a9f4aeaa2a6c) includes several alleged presentations marked \"TOP SECRET\" concerning \"[JEEPFLEA_MARKET](\n\n).\" According to a previous analysis by Electrospaces.net, which searches through previously released government documents including the Snowden files for additional clues, Jeepflea is a hacking project from Tailored Access Operations (TAO), the NSA's elite hacking unit. \n\n\n[NSA's powerful Windows hacking tools leaked online](http://money.cnn.com/2017/04/14/technology/windows-exploits-shadow-brokers/)\n\n[Shadow Brokers leak NSA documents that may reveal operation aimed at Middle Eastern banks](https://www.cyberscoop.com/shadow-brokers-nsa-documents-reveal-sweeping-espionage-operation-middle-eastern-banks/)\n\nSo here are the dots not being connected...\n\nIn 2016 Shadow Brokers placed a trove of NSA hacking tools up for sale last year. On [08.17.16](https://www.wired.com/2016/08/shadow-brokers-mess-happens-nsa-hoards-zero-days/) wired reported that that stolen NSA exploit tools were being held hostage for a Bit Coin pay out. When no one came up with the ransom the Shadow Brokers began selling the apps individually for prices that range from 1 to 1000 Bit Coins.\n\nThis is only half the story because prior to the release of the information in August 2016 maybe as far back as several years a series of attacks and robberies through the SWIFT system occurred.\n\n[Swift Hack Probe Expands to Up to a Dozen Banks Beyond Bangladesh](https://www.bloomberg.com/news/articles/2016-05-26/swift-hack-probe-expands-to-up-to-dozen-banks-beyond-bangladesh)\n\n[That Insane, $81M Bangladesh Bank Heist? Here’s What We Know](https://www.wired.com/2016/05/insane-81m-bangladesh-bank-heist-heres-know/)\n05.17.16 - 7:00 am\n\n[Once Again, Thieves Enter Swift Financial Network and Steal](https://mobile.nytimes.com/2016/05/13/business/dealbook/swift-global-bank-network-attack.html?_r=0&amp;referer=)\n\n&gt;New details about a second attack involving Swift — the messaging system used by thousands of banks and companies to move money around the world — are emerging as investigators are still trying to solve the $81 million heist from the central bank of Bangladesh in February. In that theft, the attackers were able to compel the Federal Reserve Bank of New York to move money to accounts in the Philippines.\n\n&gt;The second attack involves a commercial bank, which Swift declined to identify. But in a letter Swift plans to share with its users on Friday, the messaging network warned that the two attacks bore numerous similarities and were very likely part of a “wider and highly adaptive campaign targeting banks.”\n\n[FOURTH bank hit by SWIFT hackers](https://www.theregister.co.uk/2016/05/27/fourth_bank_hit_by_swift_hackers/)\n&gt;Evidence is emerging that the SWIFT (Society for Worldwide Interbank Financial Telecom) attacks began as far back as October 2015 when the Philippines bank was first hit, two months prior to the discovery of the failed attack on Tien Phong Bank in Vietnam.\n\nThere are many more articles beyond these, but what it looks like is the Shadow Brokers or some associated individuals pulled off a series of bank heists prior to releasing the applications to the open market. That also open the [question of what the NSA](https://threatpost.com/shadowbrokers-expose-nsa-access-to-swift-service-bureaus/124996/) was doing with the applications? They could have have been tracking \"suspects\" but it seems they could have also been moving money for any reason they chose without records being left in the banking system. The possible exploits were only exposed after a series of bank robberies exposed the power of the tools the NSA had developed. \n\nIt seems once again crimes have exposed the government's illicit powers concealed by the intelligence community (IC). It is entirely possible that the tools were used legally and only to expose private records of terrorists and spies under FISA warrants, but who knows. The only thing that exposed these exploits was the theft. Kinda makes ya wonder, huh?\n\nThe evidence and the different styles of hacking listed in the articles about the bank heists suggests that an initial group stole some NSA hacking tools and pulled off the Bangladesh heist. They may or may not have done Ecuador or the Philippines but it seems that at some point the exploits were sold on the open market, but that does not exclude some clandestine deals with other groups that also have employed the exploits. Once the initial 81 million was stolen they distributed the exploits to other groups who may have also attacked the SWIFT system and other targets to make forensics on nation state level zero day attacks that much more difficult. Several groups attempting independent attacks increased the attack vectors making identification even more difficult. It also appears that the hackers may have targeted banks that had the Trojans installed initially. So why would they go for relatively small scores when they essentially owned the SWIFT system. Could the hackers be attacking networks already infected with the Trojan. \n\nIt really makes sense when you think about the banks they hit. The NSA installs the Trojans to \"observe\" suspected transactions. The hackers obtain the exploits, found the Trojans phoning home and used them to own the infected systems, modified the attack vectors to transfer money. Why not skip the phishing attack when there was already infected banks. Take the path of least resistance that leads back to someone the American government would never admit lead away from the hackers. \n\nOf course that means anyone including the IC could have manipulated transactions, but hey that wouldn't have been a robbery would it. Really the tools could have been used to track transactions, but they could have facilitated the IC surreptitious movement of money to fund operations. \n\nIn all reality it was very clever, make a score, don't get greedy, prevent the creation of a M.O. to narrow investigations and identify the perpetrators. But identifying clever when they managed to steal exploits from the NSA and could use the exploits to attack the banking system. Just the fact that they can't be identified means they are pretty slick and the exploits are not for the novice user. There were some skills at work here. \n\nWhat else was done with the exploits and who are they?\n\n[Shadow Brokers Group Releases More Stolen NSA Hacking Tools &amp; Exploits](http://thehackernews.com/2017/04/nsa-hacking-tools.html?m=1)\n Saturday, April 08, 2017\n\n&gt;Besides dumping some NSA's hacking tools back in August 2016, the Shadow Brokers also released an encrypted cache of files containing more NSA's hacking tools and exploits in an auction, asking for 1 Million Bitcoins (around $568 Million).\nHowever, after failed auction, the group put up those hacking tools and exploits for direct sale on an underground website, categorizing them into a type — like \"exploits,\" \"Trojans,\" and \"implant\" — each of which ranged from 1 to 100 Bitcoins (from $780 to $78,000).\nNow, the Shadow Brokers has finally released password for the encrypted cache of NSA's files, allowing anyone to unlock and download the auction data dump.\n\n###CrDj”(;Va.*NdlnzB9M@K2)#&gt;deB7mN\n\n[THE SHADOW BROKERS MESS IS WHAT HAPPENS WHEN THE NSA HOARDS ZERO-DAYS](https://www.wired.com/2016/08/shadow-brokers-mess-happens-nsa-hoards-zero-days/)\nAUTHOR: ANDY GREENBERG\n08.17.16. - 8:34 PM\n\n[Everything you need to know about the NSA hack - but were afraid to Google](https://techcrunch.com/2016/08/16/everything-you-need-to-know-about-the-nsa-hack-but-were-afraid-to-google/)\n\n[Shadow Brokers leak systems hacked by NSA – mostly mail and uni servers in India, China](https://www.theregister.co.uk/2016/10/31/shadow_brokers_dump/)\n\n[New leak suggests NSA penetrated Mideast banking networks](http://hosted2.ap.org/APDEFAULT/cae69a7523db45408eeb2b3a98c0c9c5/Article_2017-04-14-Cybersecurity-NSA/id-737110725d064fdfbba883c920f1979c)\nBy RAPHAEL SATTER\n\n\n\n\n\n\n#[&lt;Metacurity&gt;](https://metacurity.com)\nSunday April 16, 2017\nclick here for archives\n     \n☰\nLatest News\n\nr/CoincidenceTheorist\n\n\n-23-\n\n", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "660pcm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "J_Dillinger", "saved": false, "mod_reports": [], "name": "t3_660pcm", "subreddit_name_prefixed": "r/WikiLeaks", "approved_by": null, "over_18": false, "domain": "self.WikiLeaks", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/6y8WgNV3aGMsIVce3aA9NVWYwMBADNk8ZTUX0z7rlto.jpg?s=c44cd29c9dec0c40a16e779e422458ad", "width": 640, "height": 434}, "resolutions": [{"url": "https://i.redditmedia.com/6y8WgNV3aGMsIVce3aA9NVWYwMBADNk8ZTUX0z7rlto.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=7d78baa6448dc8a811ffb6e3c18935f9", "width": 108, "height": 73}, {"url": "https://i.redditmedia.com/6y8WgNV3aGMsIVce3aA9NVWYwMBADNk8ZTUX0z7rlto.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=4164074b4f62718e301cebc2afd56cf1", "width": 216, "height": 146}, {"url": "https://i.redditmedia.com/6y8WgNV3aGMsIVce3aA9NVWYwMBADNk8ZTUX0z7rlto.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=e3cc2f5bd6914f2a6153b758e04a50f2", "width": 320, "height": 217}, {"url": "https://i.redditmedia.com/6y8WgNV3aGMsIVce3aA9NVWYwMBADNk8ZTUX0z7rlto.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=25ec10b5adc7d3f5c02c028cad0edd90", "width": 640, "height": 434}], "variants": {}, "id": "6Bu5270lZ5KL6d34nC25NmbgBNzjaaUVq_XTMKv4isA"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2qy11", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WikiLeaks/comments/660pcm/shadow_brokers_release_nsa_hacking_tools_but_were/", "num_reports": null, "locked": false, "stickied": false, "created": 1492518305.0, "url": "https://www.reddit.com/r/WikiLeaks/comments/660pcm/shadow_brokers_release_nsa_hacking_tools_but_were/", "author_flair_text": null, "quarantine": false, "title": "Shadow Brokers release NSA hacking tools, but were the tools used in a series of bank robberies involving the SWIFT transfer system?", "created_utc": 1492489505.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]