[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "askscience", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Engineering", "id": "653c2v", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "pyrophorus", "saved": false, "mod_reports": [], "name": "t3_653c2v", "subreddit_name_prefixed": "r/askscience", "approved_by": null, "over_18": false, "domain": "self.askscience", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qm4e", "edited": false, "link_flair_css_class": "eng", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/askscience/comments/653c2v/how_do_chip_credit_cards_protect_against_static/", "num_reports": null, "locked": false, "stickied": false, "created": 1492086083.0, "url": "https://www.reddit.com/r/askscience/comments/653c2v/how_do_chip_credit_cards_protect_against_static/", "author_flair_text": null, "quarantine": false, "title": "How do chip credit cards protect against static discharge?", "created_utc": 1492057283.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_653c2v", "likes": null, "replies": "", "user_reports": [], "id": "dg80ejy", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "CrossCheckPanda", "parent_id": "t3_653c2v", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": "I can't find any information on EMV chips in specific but i design ICs that pass strikes with the human body model so im going to say how I would do this. \n\nESD strikes are very breif events. Very high voltage difference between the external zap and the circuit but VERY LITTLE energy. Because your body is not a great ~~conductor~~ capacitor (stupid auto correct). To survive an ESD event you must give the energy somewhere to go that can handle the energy. \n\nWhen an ESD strike happens the voltage on all the transistors connected to the outside world will rise until one of the transistors reaches its breakdown voltage. At breakdown large amounts of current will flow (stopping the voltage rise) and discharge the energy. A small device will be permanently damaged by this event. A large device will spread out the energy and survive. \n\nThe idea behind ESD protection is a large device with a lower breakdown then anything else connected. At the expense of size and usable voltages you can make your clamp big enough that it cab survive a large strike, and low voltage enough that it will always breakdown first.\n\nModified [Silicon Controlled Rectifiers] (https://en.m.wikipedia.org/wiki/Silicon_controlled_rectifier#/editor/7) are popular for high voltage devices while simply using a large transistor with lower breakdown can handle low voltages.  ", "edited": 1492113984.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t find any information on EMV chips in specific but i design ICs that pass strikes with the human body model so im going to say how I would do this. &lt;/p&gt;\n\n&lt;p&gt;ESD strikes are very breif events. Very high voltage difference between the external zap and the circuit but VERY LITTLE energy. Because your body is not a great &lt;del&gt;conductor&lt;/del&gt; capacitor (stupid auto correct). To survive an ESD event you must give the energy somewhere to go that can handle the energy. &lt;/p&gt;\n\n&lt;p&gt;When an ESD strike happens the voltage on all the transistors connected to the outside world will rise until one of the transistors reaches its breakdown voltage. At breakdown large amounts of current will flow (stopping the voltage rise) and discharge the energy. A small device will be permanently damaged by this event. A large device will spread out the energy and survive. &lt;/p&gt;\n\n&lt;p&gt;The idea behind ESD protection is a large device with a lower breakdown then anything else connected. At the expense of size and usable voltages you can make your clamp big enough that it cab survive a large strike, and low voltage enough that it will always breakdown first.&lt;/p&gt;\n\n&lt;p&gt;Modified &lt;a href=\"https://en.m.wikipedia.org/wiki/Silicon_controlled_rectifier#/editor/7\"&gt;Silicon Controlled Rectifiers&lt;/a&gt; are popular for high voltage devices while simply using a large transistor with lower breakdown can handle low voltages.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dg80ejy", "score_hidden": false, "stickied": false, "created": 1492137804.0, "created_utc": 1492109004.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_653c2v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_653c2v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_653c2v", "likes": null, "replies": "", "user_reports": [], "id": "dg7ohqg", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "TunnelFET", "parent_id": "t1_dg7nkq6", "subreddit_name_prefixed": "r/askscience", "controversiality": 1, "body": "Right. Well out of honesty I shouldn't maybe be answering this question because really, I don't know the answer and I should refrain from speculation but I've looked at cross sections of the chip and so far, I don't see any reason to suspect they have extra sets of protection against ESD other than any standard measures you should always take to protect your system against ESD.\n\nI see that the pads are connected to a chip via bond-wires which might melt due to an ESD and the inner workings of the chip are obviously sensitive to ESD but I don't expect that, because they are not shipped in special ESD packaging, one has to conclude they invoke special other techniques of ESD protection instead.\n\nI think the simple reason they are not packaged in ESD plastic is because of money. The chips are mass produced anyway and a new card isn't that expensive. I don't think that a bank who sells you the card has the same type of quality assurance a distributeur of 'fairly expensive' integrated circuits have and I'm also not sure that extremely cheap IC's are also always shipped in ESD packaging for that reason. After a while, the protection is more expensive than the product itself and just sending 2 extra would save you more money than putting it in special plastic. The same might hold for your credit card. The odds of a chip breaking due to an ESD is low especially since you'd have to touch the chip itself which you rarely do, and in the rare cases it will break, nobody will know how it happened and the customer probably just requests a new one. \n\nThat is not to say that tere is no ESD protection, good designers have a standard series of tools to make your chip as ESD insensitive as possible but I don't think for your credit card, it extends beyond any other common technique you might find in any other chip. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right. Well out of honesty I shouldn&amp;#39;t maybe be answering this question because really, I don&amp;#39;t know the answer and I should refrain from speculation but I&amp;#39;ve looked at cross sections of the chip and so far, I don&amp;#39;t see any reason to suspect they have extra sets of protection against ESD other than any standard measures you should always take to protect your system against ESD.&lt;/p&gt;\n\n&lt;p&gt;I see that the pads are connected to a chip via bond-wires which might melt due to an ESD and the inner workings of the chip are obviously sensitive to ESD but I don&amp;#39;t expect that, because they are not shipped in special ESD packaging, one has to conclude they invoke special other techniques of ESD protection instead.&lt;/p&gt;\n\n&lt;p&gt;I think the simple reason they are not packaged in ESD plastic is because of money. The chips are mass produced anyway and a new card isn&amp;#39;t that expensive. I don&amp;#39;t think that a bank who sells you the card has the same type of quality assurance a distributeur of &amp;#39;fairly expensive&amp;#39; integrated circuits have and I&amp;#39;m also not sure that extremely cheap IC&amp;#39;s are also always shipped in ESD packaging for that reason. After a while, the protection is more expensive than the product itself and just sending 2 extra would save you more money than putting it in special plastic. The same might hold for your credit card. The odds of a chip breaking due to an ESD is low especially since you&amp;#39;d have to touch the chip itself which you rarely do, and in the rare cases it will break, nobody will know how it happened and the customer probably just requests a new one. &lt;/p&gt;\n\n&lt;p&gt;That is not to say that tere is no ESD protection, good designers have a standard series of tools to make your chip as ESD insensitive as possible but I don&amp;#39;t think for your credit card, it extends beyond any other common technique you might find in any other chip. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dg7ohqg", "score_hidden": false, "stickied": false, "created": 1492125110.0, "created_utc": 1492096310.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7nkq6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "pyrophorus", "parent_id": "t1_dg7mqr9", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": "Yes.  When you purchase loose integrated circuits or other ESD sensitive components, they are shipped in special static dissipating/conductive packaging and often need to be handled at ESD-safe workstations.  But credit cards are carried around without any special precautions.  So I'm curious what circuitry on the card protects the chip against damage (or if it is not needed, what makes it different than other cases where such protection is needed).  I've heard of using diodes to \"clamp\" terminals to a safe voltage, but in my limited understanding it seems like this would require the device to be connected to a voltage source or at least a ground terminal.  Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes.  When you purchase loose integrated circuits or other ESD sensitive components, they are shipped in special static dissipating/conductive packaging and often need to be handled at ESD-safe workstations.  But credit cards are carried around without any special precautions.  So I&amp;#39;m curious what circuitry on the card protects the chip against damage (or if it is not needed, what makes it different than other cases where such protection is needed).  I&amp;#39;ve heard of using diodes to &amp;quot;clamp&amp;quot; terminals to a safe voltage, but in my limited understanding it seems like this would require the device to be connected to a voltage source or at least a ground terminal.  Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dg7nkq6", "score_hidden": false, "stickied": false, "created": 1492124103.0, "created_utc": 1492095303.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7mqr9", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "TunnelFET", "parent_id": "t3_653c2v", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": "I don't quite understand your question. Do you mean: How do the chips on credit cards protect themselves against static discharge?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t quite understand your question. Do you mean: How do the chips on credit cards protect themselves against static discharge?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dg7mqr9", "score_hidden": false, "stickied": false, "created": 1492123150.0, "created_utc": 1492094350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]