[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "askscience", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know we obviously wash them in chemicals after wearing them, but what&amp;#39;s to stop the organic nature of them from doing just that (turning into a mushy, smelly mess, like dead flowers left in a vase?)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I know we obviously wash them in chemicals after wearing them, but what's to stop the organic nature of them from doing just that (turning into a mushy, smelly mess, like dead flowers left in a vase?)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Biology", "id": "65de6m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "browncm28", "saved": false, "mod_reports": [], "name": "t3_65de6m", "subreddit_name_prefixed": "r/askscience", "approved_by": null, "over_18": false, "domain": "self.askscience", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qm4e", "edited": false, "link_flair_css_class": "bio", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/askscience/comments/65de6m/if_clothes_are_made_of_100_cotton_and_cotton_is/", "num_reports": null, "locked": false, "stickied": false, "created": 1492214774.0, "url": "https://www.reddit.com/r/askscience/comments/65de6m/if_clothes_are_made_of_100_cotton_and_cotton_is/", "author_flair_text": null, "quarantine": false, "title": "If clothes are made of 100% cotton, and cotton is an organic plant, why don't clothes mold, spoil, decompose (rapidly), etc. like any other plant would?", "created_utc": 1492185974.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_65de6m", "likes": null, "replies": "", "user_reports": [], "id": "dg9kzas", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "MCPhssthpok", "parent_id": "t3_65de6m", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": "Mold can't grow without moisture. If you dried out the flowers they would last indefinitely.\n\nContrariwise, if you leave your 100% cotton clothes damp in an environment where they can't dry out they will definitely go moldy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mold can&amp;#39;t grow without moisture. If you dried out the flowers they would last indefinitely.&lt;/p&gt;\n\n&lt;p&gt;Contrariwise, if you leave your 100% cotton clothes damp in an environment where they can&amp;#39;t dry out they will definitely go moldy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dg9kzas", "score_hidden": false, "stickied": false, "created": 1492225337.0, "created_utc": 1492196537.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_65de6m", "likes": null, "replies": "", "user_reports": [], "id": "dg9mxpb", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "ihamsa", "parent_id": "t3_65de6m", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": "Not all plant material spoils easily. Got any wooden furniture? A wooden table could easily serve hundreds of years.\n\nCotton is almost 100% cellulose. \n\nCellulose is a natural polymer made of relatively simple building blocks, similar to those found in sugar (cellulose is a *polysaccharide*). It is very stable, that is, it will not decompose on its own, because chemical bonds between individual sugary building blocks are very strong. These bonds also make cellulose very tough to digest (unlike sugar, where no such bonds exist). We humans, as well as many other animals, cannot digest cellulose at all. Cellulose-eating bacteria do exist but most of them are anaerobic (i.e. they wouldn't be able to live in an oxygen-rich environment) or at least need water; they thrive, for example, in stomachs of ruminant animals such as cows. Which is why cows can feed on grass and other plant material other animals won't be able to eat: these bacteria break down the cellulose for them. Such micro-organisms (mainly fungi) also live in the soil, which is also an moist and partly anaerobic environment. If you bury a T-shirt in a garden, it will probably be eaten away by these micro-organisms rather soon.\n\nWood is mainly cellulose embedded in a matrix of lignin, which is another kind of tough organic polymer, so it is also very stable.\n\n\"Wet\" plant tissue, on the other hand, usually contains lots of complex, not too stable organic compounds that are both prone to decomposing on their own and are easy food for various micro-organisms (the main reason why food spoils easily: whatever we can eat, microbes can eat too).", "edited": 1492199129.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not all plant material spoils easily. Got any wooden furniture? A wooden table could easily serve hundreds of years.&lt;/p&gt;\n\n&lt;p&gt;Cotton is almost 100% cellulose. &lt;/p&gt;\n\n&lt;p&gt;Cellulose is a natural polymer made of relatively simple building blocks, similar to those found in sugar (cellulose is a &lt;em&gt;polysaccharide&lt;/em&gt;). It is very stable, that is, it will not decompose on its own, because chemical bonds between individual sugary building blocks are very strong. These bonds also make cellulose very tough to digest (unlike sugar, where no such bonds exist). We humans, as well as many other animals, cannot digest cellulose at all. Cellulose-eating bacteria do exist but most of them are anaerobic (i.e. they wouldn&amp;#39;t be able to live in an oxygen-rich environment) or at least need water; they thrive, for example, in stomachs of ruminant animals such as cows. Which is why cows can feed on grass and other plant material other animals won&amp;#39;t be able to eat: these bacteria break down the cellulose for them. Such micro-organisms (mainly fungi) also live in the soil, which is also an moist and partly anaerobic environment. If you bury a T-shirt in a garden, it will probably be eaten away by these micro-organisms rather soon.&lt;/p&gt;\n\n&lt;p&gt;Wood is mainly cellulose embedded in a matrix of lignin, which is another kind of tough organic polymer, so it is also very stable.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Wet&amp;quot; plant tissue, on the other hand, usually contains lots of complex, not too stable organic compounds that are both prone to decomposing on their own and are easy food for various micro-organisms (the main reason why food spoils easily: whatever we can eat, microbes can eat too).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dg9mxpb", "score_hidden": false, "stickied": false, "created": 1492227696.0, "created_utc": 1492198896.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_65de6m", "likes": null, "replies": "", "user_reports": [], "id": "dg9kzxz", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "rocketsocks", "parent_id": "t3_65de6m", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": "Uh... they totally can. What stops it is very straightforward, clothes are usually kept dry.\n\nCotton is cellulose, which is the same material as paper is made out of. Books on your shelf don't get moldy or break down even though dead trees and leaves in the forest do precisely because they are kept dry. But leave a load of laundry in the washing machine for 24 hours or drop a magazine into a mud puddle and you'll quickly discover how subject to the whims of nature those materials can be. Wet clothes will become \"mildewy\" (a kind of mold) if allowed to stay damp for too long, and over a period of weeks or months they can become moldy and rotten.\n\nFlowers have a shorter shelf-life because they're not just cellulose, they have other materials in them and they have a natural decay process (designed, I guess, to return nutrients to the soil for offspring). Clothing is more comparable to paper or wood, which doesn't decay easily but will eventually, and can be encouraged to do so quicker under the right conditions (dampness especially).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uh... they totally can. What stops it is very straightforward, clothes are usually kept dry.&lt;/p&gt;\n\n&lt;p&gt;Cotton is cellulose, which is the same material as paper is made out of. Books on your shelf don&amp;#39;t get moldy or break down even though dead trees and leaves in the forest do precisely because they are kept dry. But leave a load of laundry in the washing machine for 24 hours or drop a magazine into a mud puddle and you&amp;#39;ll quickly discover how subject to the whims of nature those materials can be. Wet clothes will become &amp;quot;mildewy&amp;quot; (a kind of mold) if allowed to stay damp for too long, and over a period of weeks or months they can become moldy and rotten.&lt;/p&gt;\n\n&lt;p&gt;Flowers have a shorter shelf-life because they&amp;#39;re not just cellulose, they have other materials in them and they have a natural decay process (designed, I guess, to return nutrients to the soil for offspring). Clothing is more comparable to paper or wood, which doesn&amp;#39;t decay easily but will eventually, and can be encouraged to do so quicker under the right conditions (dampness especially).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dg9kzxz", "score_hidden": false, "stickied": false, "created": 1492225358.0, "created_utc": 1492196558.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_65de6m", "likes": null, "replies": "", "user_reports": [], "id": "dg9c5rt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65de6m", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dg9c5rt", "score_hidden": false, "stickied": false, "created": 1492215130.0, "created_utc": 1492186330.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]