[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "askscience", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Does that make sense?&lt;/p&gt;\n\n&lt;p&gt;And additionally, from a psychological point of view, are things like hunger and thirst similar to addictions, just beneficial rather than harmful?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Does that make sense?\n\nAnd additionally, from a psychological point of view, are things like hunger and thirst similar to addictions, just beneficial rather than harmful?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Neuroscience", "id": "65qw35", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "tjenatjenatjena", "saved": false, "mod_reports": [], "name": "t3_65qw35", "subreddit_name_prefixed": "r/askscience", "approved_by": null, "over_18": false, "domain": "self.askscience", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qm4e", "edited": false, "link_flair_css_class": "neuro", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/askscience/comments/65qw35/is_there_a_clear_neurological_distinction_between/", "num_reports": null, "locked": false, "stickied": false, "created": 1492399558.0, "url": "https://www.reddit.com/r/askscience/comments/65qw35/is_there_a_clear_neurological_distinction_between/", "author_flair_text": null, "quarantine": false, "title": "Is there a clear neurological distinction between addiction and just really wanting something, or are they on the same spectrum?", "created_utc": 1492370758.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_65qw35", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_65qw35", "likes": null, "replies": "", "user_reports": [], "id": "dgdsv0i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ScorpioLaw", "parent_id": "t1_dgdpjng", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": " Not to mention the physical effects of withdrawal are absolutely debilitating. If an opiate addict is starving and in withdrawal they would have a very hard time eating or keeping food down in the first place. \n\n On the other hand drugs like amphetamines cause effects that lower appetite. \n\n \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not to mention the physical effects of withdrawal are absolutely debilitating. If an opiate addict is starving and in withdrawal they would have a very hard time eating or keeping food down in the first place. &lt;/p&gt;\n\n&lt;p&gt;On the other hand drugs like amphetamines cause effects that lower appetite. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dgdsv0i", "score_hidden": false, "stickied": false, "created": 1492478976.0, "created_utc": 1492450176.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpjng", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rehabilitated86", "parent_id": "t3_65qw35", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": "Drugs can \"hijack\" the hedonic system of the brain, or the \"reward\" system in such a way that drugs become a priority equal to or greater than basic survival like food and water.\n\nThis has been demonstrated on rats and mice using both drugs like cocaine and also by directly activating their reward pathways through electrical stimulation, i.e. electrodes were attached and when the mouse pushed a lever, it activated the reward system. The mouse went as far as to completely ignore food and water and repeatedly push the lever. I don't have access but maybe someone else can find this study.\n\nHow that translates to humans we are still figuring out, but as of now we assume it works more or less the same way. Cravings for drugs can overpower those for food and water, they are much different than just \"craving a cheeseburger\" (for a normal individual without any addictions).\n\nNow I'm not saying drug addicts will starve themselves to death but when given the choice between food and drugs, most will spend their money on the drugs and \"worry about food later\" which leads to the typical addict lifestyle and health complications.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Drugs can &amp;quot;hijack&amp;quot; the hedonic system of the brain, or the &amp;quot;reward&amp;quot; system in such a way that drugs become a priority equal to or greater than basic survival like food and water.&lt;/p&gt;\n\n&lt;p&gt;This has been demonstrated on rats and mice using both drugs like cocaine and also by directly activating their reward pathways through electrical stimulation, i.e. electrodes were attached and when the mouse pushed a lever, it activated the reward system. The mouse went as far as to completely ignore food and water and repeatedly push the lever. I don&amp;#39;t have access but maybe someone else can find this study.&lt;/p&gt;\n\n&lt;p&gt;How that translates to humans we are still figuring out, but as of now we assume it works more or less the same way. Cravings for drugs can overpower those for food and water, they are much different than just &amp;quot;craving a cheeseburger&amp;quot; (for a normal individual without any addictions).&lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m not saying drug addicts will starve themselves to death but when given the choice between food and drugs, most will spend their money on the drugs and &amp;quot;worry about food later&amp;quot; which leads to the typical addict lifestyle and health complications.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dgdpjng", "score_hidden": false, "stickied": false, "created": 1492475289.0, "created_utc": 1492446489.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_65qw35", "likes": null, "replies": "", "user_reports": [], "id": "dgdrfr0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MasterGrok", "parent_id": "t3_65qw35", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": "Addiction is defined as a collection of symptoms so the answer to your question is different for each of those symptoms. By diagnostic definition, any one of those symptoms in isolation or in the absence of clinically significant distress isn't addiction.  \n\nIn the scientific literature we use the word \"craving\" to describe really wanting something. So for that one specific symptom your generalization is mostly accurate. However there are lots of other symptoms that are in fact more important than simple craving. \n\nOne of the classic syndromes and what a lot of people are talking about when they say addiction is physiological dependence. Physiological dependence is most definitely something different than craving. Physiological dependence describes s response by your body to repeated administrations of a drug than includes some combination of physiological tolerance and withdrawal symptoms. When physiological dependence looks it's worst, an addictive person will need to take increasing amounts of a drug in order to avoid unpleasant and potentially life threatening withdrawal symptoms. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Addiction is defined as a collection of symptoms so the answer to your question is different for each of those symptoms. By diagnostic definition, any one of those symptoms in isolation or in the absence of clinically significant distress isn&amp;#39;t addiction.  &lt;/p&gt;\n\n&lt;p&gt;In the scientific literature we use the word &amp;quot;craving&amp;quot; to describe really wanting something. So for that one specific symptom your generalization is mostly accurate. However there are lots of other symptoms that are in fact more important than simple craving. &lt;/p&gt;\n\n&lt;p&gt;One of the classic syndromes and what a lot of people are talking about when they say addiction is physiological dependence. Physiological dependence is most definitely something different than craving. Physiological dependence describes s response by your body to repeated administrations of a drug than includes some combination of physiological tolerance and withdrawal symptoms. When physiological dependence looks it&amp;#39;s worst, an addictive person will need to take increasing amounts of a drug in order to avoid unpleasant and potentially life threatening withdrawal symptoms. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dgdrfr0", "score_hidden": false, "stickied": false, "created": 1492477385.0, "created_utc": 1492448585.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_65qw35", "likes": null, "replies": "", "user_reports": [], "id": "dgdt0qo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ScorpioLaw", "parent_id": "t3_65qw35", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": " I am on mobile and I can't find the link but there were definitely studies all over that show how addiction changes the brain. It doesn't have to even be just about physical dependence either. \n\n Look up psychological studies on gambling or sex addicts to find good information that should lead you there! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am on mobile and I can&amp;#39;t find the link but there were definitely studies all over that show how addiction changes the brain. It doesn&amp;#39;t have to even be just about physical dependence either. &lt;/p&gt;\n\n&lt;p&gt;Look up psychological studies on gambling or sex addicts to find good information that should lead you there! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dgdt0qo", "score_hidden": false, "stickied": false, "created": 1492479151.0, "created_utc": 1492450351.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm4e", "removal_reason": null, "link_id": "t3_65qw35", "likes": null, "replies": "", "user_reports": [], "id": "dgdw32n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lxjuice", "parent_id": "t3_65qw35", "subreddit_name_prefixed": "r/askscience", "controversiality": 0, "body": "It's a neurological spectrum. Generally impulsive or hedonic people are further along the spectrum than people who aren't. The process of becoming addicted also moves you along the spectrum and just generally wanting something is like addiction-lite.\n\nNatural addictions are analogous to unnatural ones. They use the same brain systems but don't involve the same brain changes (i.e. you can be hungry without having the brain of an addict). The main difference is that they will always be there. Even if you could somehow survive without eating you'll probably still be hungry. Celibate Buddhist monks still get sexual urges sometimes, they just meditate them away.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a neurological spectrum. Generally impulsive or hedonic people are further along the spectrum than people who aren&amp;#39;t. The process of becoming addicted also moves you along the spectrum and just generally wanting something is like addiction-lite.&lt;/p&gt;\n\n&lt;p&gt;Natural addictions are analogous to unnatural ones. They use the same brain systems but don&amp;#39;t involve the same brain changes (i.e. you can be hungry without having the brain of an addict). The main difference is that they will always be there. Even if you could somehow survive without eating you&amp;#39;ll probably still be hungry. Celibate Buddhist monks still get sexual urges sometimes, they just meditate them away.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "askscience", "name": "t1_dgdw32n", "score_hidden": false, "stickied": false, "created": 1492482543.0, "created_utc": 1492453743.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]